; ModuleID = './[inter]dpkg-deb--main.o.i'
source_filename = "./[inter]dpkg-deb--main.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.deb_version = type { i32, i32 }
%struct.compress_params = type { i32, i32, i32 }
%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.dpkg_error = type { i32, i32, i8* }

@.str = private unnamed_addr constant [23 x i8] c"${Package}\09${Version}\0A\00", align 1
@showformat = global i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str, i32 0, i32 0), align 8
@debugflag = global i32 0, align 4
@nocheckflag = global i32 0, align 4
@opt_verbose = global i32 0, align 4
@opt_root_owner_group = global i32 0, align 4
@opt_uniform_compression = global i32 1, align 4
@deb_format = global %struct.deb_version { i32 2, i32 0 }, align 4
@compress_params = global %struct.compress_params { i32 2, i32 0, i32 -1 }, align 4
@.str.1 = private unnamed_addr constant [5 x i8] c"dpkg\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"dpkg-deb\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !27)
!1 = !DIFile(filename: "[inter]dpkg-deb--main.o.i", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!2 = !{!3, !12, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compressor_type", file: !4, line: 38, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/compress.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "COMPRESSOR_TYPE_UNKNOWN", value: -1)
!7 = !DIEnumerator(name: "COMPRESSOR_TYPE_NONE", value: 0)
!8 = !DIEnumerator(name: "COMPRESSOR_TYPE_GZIP", value: 1)
!9 = !DIEnumerator(name: "COMPRESSOR_TYPE_XZ", value: 2)
!10 = !DIEnumerator(name: "COMPRESSOR_TYPE_BZIP2", value: 3)
!11 = !DIEnumerator(name: "COMPRESSOR_TYPE_LZMA", value: 4)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compressor_strategy", file: !4, line: 47, size: 32, align: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19, !20}
!14 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_UNKNOWN", value: -1)
!15 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_NONE", value: 0)
!16 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_FILTERED", value: 1)
!17 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_HUFFMAN", value: 2)
!18 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_RLE", value: 3)
!19 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_FIXED", value: 4)
!20 = !DIEnumerator(name: "COMPRESSOR_STRATEGY_EXTREME", value: 5)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !22, line: 36, size: 32, align: 32, elements: !23)
!22 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!25 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!26 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!27 = !{!28, !33, !35, !36, !37, !38, !39, !45, !51, !81}
!28 = distinct !DIGlobalVariable(name: "showformat", scope: !0, file: !29, line: 48, type: !30, isLocal: false, isDefinition: true, variable: i8** @showformat)
!29 = !DIFile(filename: "main.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = distinct !DIGlobalVariable(name: "debugflag", scope: !0, file: !29, line: 141, type: !34, isLocal: false, isDefinition: true, variable: i32* @debugflag)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = distinct !DIGlobalVariable(name: "nocheckflag", scope: !0, file: !29, line: 142, type: !34, isLocal: false, isDefinition: true, variable: i32* @nocheckflag)
!36 = distinct !DIGlobalVariable(name: "opt_verbose", scope: !0, file: !29, line: 143, type: !34, isLocal: false, isDefinition: true, variable: i32* @opt_verbose)
!37 = distinct !DIGlobalVariable(name: "opt_root_owner_group", scope: !0, file: !29, line: 144, type: !34, isLocal: false, isDefinition: true, variable: i32* @opt_root_owner_group)
!38 = distinct !DIGlobalVariable(name: "opt_uniform_compression", scope: !0, file: !29, line: 145, type: !34, isLocal: false, isDefinition: true, variable: i32* @opt_uniform_compression)
!39 = distinct !DIGlobalVariable(name: "deb_format", scope: !0, file: !29, line: 147, type: !40, isLocal: false, isDefinition: true, variable: %struct.deb_version* @deb_format)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deb_version", file: !41, line: 37, size: 64, align: 32, elements: !42)
!41 = !DIFile(filename: "../lib/dpkg/deb-version.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !40, file: !41, line: 38, baseType: !34, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !40, file: !41, line: 39, baseType: !34, size: 32, align: 32, offset: 32)
!45 = distinct !DIGlobalVariable(name: "compress_params", scope: !0, file: !29, line: 165, type: !46, isLocal: false, isDefinition: true, variable: %struct.compress_params* @compress_params)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compress_params", file: !4, line: 57, size: 96, align: 32, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !4, line: 58, baseType: !3, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !46, file: !4, line: 59, baseType: !12, size: 32, align: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !46, file: !4, line: 60, baseType: !34, size: 32, align: 32, offset: 64)
!51 = distinct !DIGlobalVariable(name: "cmdinfos", scope: !0, file: !29, line: 203, type: !52, isLocal: true, isDefinition: true, variable: [25 x %struct.cmdinfo]* @cmdinfos)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 12800, align: 64, elements: !79)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmdinfo", file: !55, line: 38, size: 512, align: 64, elements: !56)
!55 = !DIFile(filename: "../lib/dpkg/options.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!56 = !{!57, !58, !59, !60, !62, !64, !69, !70, !72}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "olong", scope: !54, file: !55, line: 39, baseType: !30, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "oshort", scope: !54, file: !55, line: 40, baseType: !32, size: 8, align: 8, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "takesvalue", scope: !54, file: !55, line: 48, baseType: !34, size: 32, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "iassignto", scope: !54, file: !55, line: 49, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sassignto", scope: !54, file: !55, line: 50, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !54, file: !55, line: 51, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !30}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arg_int", scope: !54, file: !55, line: 53, baseType: !34, size: 32, align: 32, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "arg_ptr", scope: !54, file: !55, line: 54, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !54, file: !55, line: 56, baseType: !73, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !55, line: 36, baseType: !75)
!75 = !DISubroutineType(types: !76)
!76 = !{!34, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!79 = !{!80}
!80 = !DISubrange(count: 25)
!81 = distinct !DIGlobalVariable(name: "printforhelp", scope: !0, file: !29, line: 137, type: !82, isLocal: true, isDefinition: true, variable: [132 x i8]* @printforhelp)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1056, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 132)
!85 = !{i32 2, !"Dwarf Version", i32 4}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!88 = distinct !DISubprogram(name: "main", scope: !29, file: !29, line: 232, type: !89, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!34, !34, !77}
!91 = !{}
!92 = !DILocalVariable(name: "argc", arg: 1, scope: !88, file: !29, line: 232, type: !34)
!93 = !DIExpression()
!94 = !DILocation(line: 232, column: 14, scope: !88)
!95 = !DILocalVariable(name: "argv", arg: 2, scope: !88, file: !29, line: 232, type: !77)
!96 = !DILocation(line: 232, column: 39, scope: !88)
!97 = !DILocalVariable(name: "err", scope: !88, file: !29, line: 233, type: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !22, line: 42, size: 128, align: 64, elements: !99)
!99 = !{!100, !101, !102}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !22, line: 43, baseType: !21, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !98, file: !22, line: 45, baseType: !34, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !98, file: !22, line: 46, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!104 = !DILocation(line: 233, column: 21, scope: !88)
!105 = !DILocalVariable(name: "ret", scope: !88, file: !29, line: 234, type: !34)
!106 = !DILocation(line: 234, column: 7, scope: !88)
!107 = !DILocation(line: 236, column: 3, scope: !88)
!108 = !DILocation(line: 237, column: 3, scope: !88)
!109 = !DILocation(line: 238, column: 3, scope: !88)
!110 = !DILocation(line: 240, column: 8, scope: !111)
!111 = distinct !DILexicalBlock(scope: !88, file: !29, line: 240, column: 7)
!112 = !DILocation(line: 240, column: 7, scope: !88)
!113 = !DILocation(line: 240, column: 28, scope: !114)
!114 = !DILexicalBlockFile(scope: !111, file: !29, discriminator: 1)
!115 = !DILocation(line: 240, column: 19, scope: !116)
!116 = !DILexicalBlockFile(scope: !114, file: !29, discriminator: 2)
!117 = !DILocation(line: 240, column: 19, scope: !114)
!118 = !DILocation(line: 242, column: 8, scope: !119)
!119 = distinct !DILexicalBlock(scope: !88, file: !29, line: 242, column: 7)
!120 = !DILocation(line: 242, column: 7, scope: !88)
!121 = !DILocation(line: 243, column: 14, scope: !119)
!122 = !DILocation(line: 243, column: 64, scope: !119)
!123 = !DILocation(line: 243, column: 5, scope: !124)
!124 = !DILexicalBlockFile(scope: !119, file: !29, discriminator: 1)
!125 = !DILocation(line: 243, column: 5, scope: !119)
!126 = !DILocation(line: 245, column: 7, scope: !127)
!127 = distinct !DILexicalBlock(scope: !88, file: !29, line: 245, column: 7)
!128 = !DILocation(line: 245, column: 31, scope: !127)
!129 = !DILocation(line: 246, column: 24, scope: !127)
!130 = !DILocation(line: 246, column: 29, scope: !127)
!131 = !DILocation(line: 246, column: 53, scope: !127)
!132 = !DILocation(line: 247, column: 24, scope: !127)
!133 = !DILocation(line: 247, column: 29, scope: !127)
!134 = !DILocation(line: 247, column: 53, scope: !127)
!135 = !DILocation(line: 248, column: 24, scope: !127)
!136 = !DILocation(line: 248, column: 29, scope: !127)
!137 = !DILocation(line: 245, column: 7, scope: !138)
!138 = !DILexicalBlockFile(scope: !88, file: !29, discriminator: 1)
!139 = !DILocation(line: 249, column: 14, scope: !127)
!140 = !DILocation(line: 250, column: 50, scope: !127)
!141 = !DILocation(line: 250, column: 14, scope: !127)
!142 = !DILocation(line: 249, column: 5, scope: !143)
!143 = !DILexicalBlockFile(scope: !127, file: !29, discriminator: 1)
!144 = !DILocation(line: 249, column: 5, scope: !127)
!145 = !DILocation(line: 252, column: 9, scope: !88)
!146 = !DILocation(line: 252, column: 20, scope: !88)
!147 = !DILocation(line: 252, column: 27, scope: !88)
!148 = !DILocation(line: 252, column: 7, scope: !88)
!149 = !DILocation(line: 254, column: 3, scope: !88)
!150 = !DILocation(line: 256, column: 10, scope: !88)
!151 = !DILocation(line: 256, column: 3, scope: !88)
!152 = distinct !DISubprogram(name: "set_deb_format", scope: !29, file: !29, line: 150, type: !66, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !91)
!153 = !DILocalVariable(name: "cip", arg: 1, scope: !152, file: !29, line: 150, type: !68)
!154 = !DILocation(line: 150, column: 38, scope: !152)
!155 = !DILocalVariable(name: "value", arg: 2, scope: !152, file: !29, line: 150, type: !30)
!156 = !DILocation(line: 150, column: 55, scope: !152)
!157 = !DILocalVariable(name: "err", scope: !152, file: !29, line: 152, type: !30)
!158 = !DILocation(line: 152, column: 15, scope: !152)
!159 = !DILocation(line: 154, column: 40, scope: !152)
!160 = !DILocation(line: 154, column: 9, scope: !152)
!161 = !DILocation(line: 154, column: 7, scope: !152)
!162 = !DILocation(line: 155, column: 7, scope: !163)
!163 = distinct !DILexicalBlock(scope: !152, file: !29, line: 155, column: 7)
!164 = !DILocation(line: 155, column: 7, scope: !152)
