; ModuleID = './[inter]dpkg-deb--build.o.i'
source_filename = "./[inter]dpkg-deb--build.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.compress_params = type { i32, i32, i32 }
%struct.deb_version = type { i32, i32 }
%struct.tar_pack_options = type { i64, i8*, i8 }
%struct.dpkg_error = type { i32, i32, i8* }
%struct.dpkg_ar = type { i8*, i32, i64, i64, i32 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }

!87 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!88 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!89 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!90 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !28, line: 95, size: 32, align: 32, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!94 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!95 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!96 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parsedbflags", file: !28, line: 328, size: 32, align: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!99 = !DIEnumerator(name: "pdb_single_stanza", value: 1)
!100 = !DIEnumerator(name: "pdb_recordavailable", value: 2)
!101 = !DIEnumerator(name: "pdb_rejectstatus", value: 4)
!102 = !DIEnumerator(name: "pdb_weakclassification", value: 8)
!103 = !DIEnumerator(name: "pdb_ignore_archives", value: 16)
!104 = !DIEnumerator(name: "pdb_ignoreolder", value: 32)
!105 = !DIEnumerator(name: "pdb_lax_version_parser", value: 64)
!106 = !DIEnumerator(name: "pdb_lax_stanza_parser", value: 512)
!107 = !DIEnumerator(name: "pdb_lax_parser", value: 576)
!108 = !DIEnumerator(name: "pdb_close_fd", value: 128)
!109 = !DIEnumerator(name: "pdb_dash_is_stdin", value: 256)
!110 = !DIEnumerator(name: "pdb_parse_status", value: 584)
!111 = !DIEnumerator(name: "pdb_parse_update", value: 585)
!112 = !DIEnumerator(name: "pdb_parse_available", value: 582)
!113 = !DIEnumerator(name: "pdb_parse_binary", value: 7)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !115, line: 32, size: 32, align: 32, elements: !116)
!115 = !DIFile(filename: "../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!118 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!119 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!120 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!121 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!122 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!123 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!124 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !28, line: 388, size: 32, align: 32, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "vdew_never", value: 0)
!128 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!129 = !DIEnumerator(name: "vdew_always", value: 2)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "treewalk_options", file: !131, line: 39, size: 32, align: 32, elements: !132)
!131 = !DIFile(filename: "../lib/dpkg/treewalk.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!132 = !{!133, !134, !135}
!133 = !DIEnumerator(name: "TREEWALK_NONE", value: 0)
!134 = !DIEnumerator(name: "TREEWALK_FORCE_STAT", value: 1)
!135 = !DIEnumerator(name: "TREEWALK_FOLLOW_LINKS", value: 2)
!136 = !{!137, !138, !141}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !139, line: 134, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!140 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!141 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!142 = !{!143, !158}
!143 = distinct !DIGlobalVariable(name: "deb_magic", scope: !144, file: !145, line: 617, type: !155, isLocal: true, isDefinition: true, variable: [5 x i8]* @do_build.deb_magic)
!144 = distinct !DISubprogram(name: "do_build", scope: !145, file: !145, line: 510, type: !146, isLocal: false, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!145 = !DIFile(filename: "build.c", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !149}
!148 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !{}
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 40, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = distinct !DIGlobalVariable(name: "maintainerscripts", scope: !0, file: !145, line: 196, type: !159, isLocal: true, isDefinition: true, variable: [6 x i8*]* @maintainerscripts)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 384, align: 64, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 6)
!162 = !{i32 2, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!165 = !DILocalVariable(name: "argv", arg: 1, scope: !144, file: !145, line: 510, type: !149)
!166 = !DIExpression()
!167 = !DILocation(line: 510, column: 29, scope: !144)
!168 = !DILocalVariable(name: "control_compress_params", scope: !144, file: !145, line: 512, type: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "compress_params", file: !4, line: 57, size: 96, align: 32, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !4, line: 58, baseType: !3, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !169, file: !4, line: 59, baseType: !12, size: 32, align: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !169, file: !4, line: 60, baseType: !148, size: 32, align: 32, offset: 64)
!174 = !DILocation(line: 512, column: 26, scope: !144)
!175 = !DILocalVariable(name: "tar_options", scope: !144, file: !145, line: 513, type: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_pack_options", file: !145, line: 421, size: 192, align: 64, elements: !177)
!177 = !{!178, !183, !184}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !176, file: !145, line: 422, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !180, line: 75, baseType: !181)
!180 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !182, line: 139, baseType: !140)
!182 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !176, file: !145, line: 423, baseType: !151, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "root_owner_group", scope: !176, file: !145, line: 424, baseType: !185, size: 8, align: 8, offset: 128)
!185 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!186 = !DILocation(line: 513, column: 27, scope: !144)
!187 = !DILocalVariable(name: "err", scope: !144, file: !145, line: 514, type: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !22, line: 42, size: 128, align: 64, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !22, line: 43, baseType: !21, size: 32, align: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !188, file: !22, line: 45, baseType: !148, size: 32, align: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !188, file: !22, line: 46, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!194 = !DILocation(line: 514, column: 21, scope: !144)
!195 = !DILocalVariable(name: "ar", scope: !144, file: !145, line: 515, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_ar", file: !198, line: 57, size: 320, align: 64, elements: !199)
!198 = !DIFile(filename: "../lib/dpkg/ar.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!199 = !{!200, !201, !206, !207, !210}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !198, line: 58, baseType: !151, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !197, file: !198, line: 59, baseType: !202, size: 32, align: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !203, line: 70, baseType: !204)
!203 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !182, line: 129, baseType: !205)
!205 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !197, file: !198, line: 60, baseType: !179, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !198, line: 61, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !203, line: 86, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !182, line: 131, baseType: !140)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !197, file: !198, line: 62, baseType: !148, size: 32, align: 32, offset: 256)
!211 = !DILocation(line: 515, column: 19, scope: !144)
!212 = !DILocalVariable(name: "timestamp", scope: !144, file: !145, line: 516, type: !179)
!213 = !DILocation(line: 516, column: 10, scope: !144)
!214 = !DILocalVariable(name: "timestamp_str", scope: !144, file: !145, line: 517, type: !151)
!215 = !DILocation(line: 517, column: 15, scope: !144)
!216 = !DILocalVariable(name: "dir", scope: !144, file: !145, line: 518, type: !151)
!217 = !DILocation(line: 518, column: 15, scope: !144)
!218 = !DILocalVariable(name: "dest", scope: !144, file: !145, line: 518, type: !151)
!219 = !DILocation(line: 518, column: 21, scope: !144)
!220 = !DILocalVariable(name: "ctrldir", scope: !144, file: !145, line: 519, type: !193)
!221 = !DILocation(line: 519, column: 9, scope: !144)
!222 = !DILocalVariable(name: "debar", scope: !144, file: !145, line: 520, type: !193)
!223 = !DILocation(line: 520, column: 9, scope: !144)
!224 = !DILocalVariable(name: "tfbuf", scope: !144, file: !145, line: 521, type: !193)
!225 = !DILocation(line: 521, column: 9, scope: !144)
!226 = !DILocalVariable(name: "gzfd", scope: !144, file: !145, line: 522, type: !148)
!227 = !DILocation(line: 522, column: 7, scope: !144)
!228 = !DILocation(line: 525, column: 14, scope: !144)
!229 = !DILocation(line: 525, column: 9, scope: !144)
!230 = !DILocation(line: 525, column: 7, scope: !144)
!231 = !DILocation(line: 526, column: 8, scope: !232)
!232 = distinct !DILexicalBlock(scope: !144, file: !145, line: 526, column: 7)
!233 = !DILocation(line: 526, column: 7, scope: !144)
!234 = !DILocation(line: 527, column: 14, scope: !232)
!235 = !DILocation(line: 527, column: 60, scope: !232)
!236 = !DILocation(line: 527, column: 71, scope: !232)
!237 = !DILocation(line: 527, column: 5, scope: !238)
!238 = !DILexicalBlockFile(scope: !232, file: !145, discriminator: 1)
!239 = !DILocation(line: 527, column: 5, scope: !232)
!240 = !DILocation(line: 529, column: 15, scope: !144)
!241 = !DILocation(line: 529, column: 10, scope: !144)
!242 = !DILocation(line: 529, column: 8, scope: !144)
!243 = !DILocation(line: 530, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !144, file: !145, line: 530, column: 7)
!245 = !DILocation(line: 530, column: 12, scope: !244)
!246 = !DILocation(line: 530, column: 16, scope: !247)
!247 = !DILexicalBlockFile(scope: !244, file: !145, discriminator: 1)
!248 = !DILocation(line: 530, column: 15, scope: !247)
!249 = !DILocation(line: 530, column: 7, scope: !247)
!250 = !DILocation(line: 531, column: 14, scope: !244)
!251 = !DILocation(line: 531, column: 59, scope: !244)
!252 = !DILocation(line: 531, column: 70, scope: !244)
!253 = !DILocation(line: 531, column: 5, scope: !247)
!254 = !DILocation(line: 531, column: 5, scope: !244)
!255 = !DILocation(line: 533, column: 29, scope: !144)
!256 = !DILocation(line: 533, column: 34, scope: !144)
!257 = !DILocation(line: 533, column: 11, scope: !144)
!258 = !DILocation(line: 533, column: 9, scope: !144)
!259 = !DILocation(line: 534, column: 30, scope: !144)
!260 = !DILocation(line: 534, column: 13, scope: !144)
!261 = !DILocation(line: 534, column: 11, scope: !144)
!262 = !DILocation(line: 537, column: 7, scope: !263)
!263 = distinct !DILexicalBlock(scope: !144, file: !145, line: 537, column: 7)
!264 = !DILocation(line: 537, column: 7, scope: !144)
!265 = !DILocation(line: 538, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !145, line: 538, column: 9)
!267 = distinct !DILexicalBlock(scope: !263, file: !145, line: 537, column: 20)
!268 = !DILocation(line: 538, column: 15, scope: !266)
!269 = !DILocation(line: 538, column: 9, scope: !267)
!270 = !DILocation(line: 539, column: 14, scope: !266)
!271 = !DILocation(line: 539, column: 7, scope: !272)
!272 = !DILexicalBlockFile(scope: !266, file: !145, discriminator: 1)
!273 = !DILocation(line: 539, column: 7, scope: !266)
!274 = !DILocation(line: 540, column: 13, scope: !267)
!275 = !DILocation(line: 540, column: 5, scope: !276)
!276 = !DILexicalBlockFile(scope: !267, file: !145, discriminator: 1)
!277 = !DILocation(line: 541, column: 10, scope: !267)
!278 = !DILocation(line: 541, column: 59, scope: !267)
!279 = !DILocation(line: 541, column: 5, scope: !276)
!280 = !DILocation(line: 542, column: 3, scope: !267)
!281 = !DILocalVariable(name: "pkg", scope: !282, file: !145, line: 543, type: !283)
!282 = distinct !DILexicalBlock(scope: !263, file: !145, line: 542, column: 10)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !28, line: 195, size: 3072, align: 64, elements: !285)
!285 = !{!286, !332, !333, !334, !335, !336, !337, !338, !339, !340, !370, !371, !374, !383, !399, !400, !406, !409, !410, !411}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !284, file: !28, line: 196, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !28, line: 242, size: 3392, align: 64, elements: !289)
!289 = !{!290, !291, !292, !293, !331}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !28, line: 243, baseType: !287, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !28, line: 244, baseType: !151, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !288, file: !28, line: 245, baseType: !284, size: 3072, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !288, file: !28, line: 249, baseType: !294, size: 128, align: 64, offset: 3200)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !288, file: !28, line: 246, size: 128, align: 64, elements: !295)
!295 = !{!296, !330}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !294, file: !28, line: 247, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !28, line: 63, size: 640, align: 64, elements: !299)
!299 = !{!300, !308, !309, !310, !311, !312, !321, !327, !328, !329}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !298, file: !28, line: 64, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !28, line: 56, size: 256, align: 64, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !302, file: !28, line: 57, baseType: !283, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !28, line: 58, baseType: !301, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !302, file: !28, line: 59, baseType: !297, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !28, line: 60, baseType: !27, size: 32, align: 32, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !298, file: !28, line: 65, baseType: !287, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !28, line: 66, baseType: !297, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !298, file: !28, line: 66, baseType: !297, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !298, file: !28, line: 66, baseType: !297, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !298, file: !28, line: 67, baseType: !313, size: 64, align: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !40, line: 48, size: 192, align: 64, elements: !316)
!316 = !{!317, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !40, line: 49, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !40, line: 50, baseType: !151, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !40, line: 51, baseType: !39, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !298, file: !28, line: 68, baseType: !322, size: 192, align: 64, offset: 384)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !51, line: 42, size: 192, align: 64, elements: !323)
!323 = !{!324, !325, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !322, file: !51, line: 44, baseType: !205, size: 32, align: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !322, file: !51, line: 46, baseType: !151, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !322, file: !51, line: 48, baseType: !151, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !298, file: !28, line: 69, baseType: !50, size: 32, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !298, file: !28, line: 70, baseType: !185, size: 8, align: 8, offset: 608)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !298, file: !28, line: 71, baseType: !185, size: 8, align: 8, offset: 616)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !294, file: !28, line: 248, baseType: !297, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !288, file: !28, line: 250, baseType: !148, size: 32, align: 32, offset: 3328)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !284, file: !28, line: 197, baseType: !283, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !284, file: !28, line: 199, baseType: !59, size: 32, align: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !284, file: !28, line: 201, baseType: !67, size: 32, align: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !284, file: !28, line: 202, baseType: !71, size: 32, align: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !284, file: !28, line: 203, baseType: !81, size: 32, align: 32, offset: 224)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !284, file: !28, line: 204, baseType: !151, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !284, file: !28, line: 205, baseType: !151, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !284, file: !28, line: 206, baseType: !322, size: 192, align: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !284, file: !28, line: 207, baseType: !341, size: 960, align: 64, offset: 576)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !28, line: 107, size: 960, align: 64, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !363}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !341, file: !28, line: 108, baseType: !301, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !341, file: !28, line: 110, baseType: !185, size: 8, align: 8, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !341, file: !28, line: 111, baseType: !91, size: 32, align: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !341, file: !28, line: 112, baseType: !313, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !341, file: !28, line: 115, baseType: !151, size: 64, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !341, file: !28, line: 116, baseType: !151, size: 64, align: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !341, file: !28, line: 117, baseType: !151, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !341, file: !28, line: 118, baseType: !151, size: 64, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !341, file: !28, line: 119, baseType: !151, size: 64, align: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !341, file: !28, line: 120, baseType: !151, size: 64, align: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !341, file: !28, line: 121, baseType: !151, size: 64, align: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !341, file: !28, line: 122, baseType: !322, size: 192, align: 64, offset: 640)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !341, file: !28, line: 123, baseType: !356, size: 64, align: 64, offset: 832)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !28, line: 80, size: 256, align: 64, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !28, line: 81, baseType: !356, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !28, line: 82, baseType: !151, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !357, file: !28, line: 83, baseType: !151, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !357, file: !28, line: 84, baseType: !185, size: 8, align: 8, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !341, file: !28, line: 124, baseType: !364, size: 64, align: 64, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !28, line: 74, size: 192, align: 64, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !28, line: 75, baseType: !364, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !28, line: 76, baseType: !151, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !365, file: !28, line: 77, baseType: !151, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !284, file: !28, line: 208, baseType: !341, size: 960, align: 64, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !284, file: !28, line: 209, baseType: !372, size: 64, align: 64, offset: 2496)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !28, line: 151, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !284, file: !28, line: 211, baseType: !375, size: 64, align: 64, offset: 2560)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !28, line: 87, size: 320, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !28, line: 88, baseType: !375, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !28, line: 89, baseType: !151, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !376, file: !28, line: 90, baseType: !151, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !28, line: 91, baseType: !151, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !376, file: !28, line: 92, baseType: !151, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !284, file: !28, line: 216, baseType: !384, size: 128, align: 64, offset: 2624)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !284, file: !28, line: 213, size: 128, align: 64, elements: !385)
!385 = !{!386, !398}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !384, file: !28, line: 215, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !28, line: 142, size: 320, align: 64, elements: !389)
!389 = !{!390, !391, !392, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !388, file: !28, line: 143, baseType: !283, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !388, file: !28, line: 143, baseType: !283, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !388, file: !28, line: 144, baseType: !387, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !388, file: !28, line: 147, baseType: !394, size: 128, align: 64, offset: 192)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !28, line: 145, size: 128, align: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !28, line: 146, baseType: !387, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !394, file: !28, line: 146, baseType: !387, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !384, file: !28, line: 215, baseType: !387, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !284, file: !28, line: 219, baseType: !387, size: 64, align: 64, offset: 2752)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !284, file: !28, line: 220, baseType: !401, size: 64, align: 64, offset: 2816)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !28, line: 134, size: 128, align: 64, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !28, line: 135, baseType: !401, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !402, file: !28, line: 136, baseType: !151, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !284, file: !28, line: 231, baseType: !407, size: 64, align: 64, offset: 2880)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !28, line: 231, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !284, file: !28, line: 232, baseType: !208, size: 64, align: 64, offset: 2944)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !284, file: !28, line: 233, baseType: !185, size: 8, align: 8, offset: 3008)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !284, file: !28, line: 236, baseType: !185, size: 8, align: 8, offset: 3016)
!412 = !DILocation(line: 543, column: 21, scope: !282)
!413 = !DILocation(line: 545, column: 30, scope: !282)
!414 = !DILocation(line: 545, column: 39, scope: !282)
!415 = !DILocation(line: 545, column: 11, scope: !282)
!416 = !DILocation(line: 545, column: 9, scope: !282)
!417 = !DILocation(line: 546, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !282, file: !145, line: 546, column: 9)
!419 = !DILocation(line: 546, column: 15, scope: !418)
!420 = !DILocation(line: 546, column: 9, scope: !282)
!421 = !DILocation(line: 547, column: 42, scope: !418)
!422 = !DILocation(line: 547, column: 48, scope: !418)
!423 = !DILocation(line: 547, column: 15, scope: !418)
!424 = !DILocation(line: 547, column: 13, scope: !418)
!425 = !DILocation(line: 547, column: 7, scope: !418)
!426 = !DILocation(line: 548, column: 10, scope: !282)
!427 = !DILocation(line: 548, column: 53, scope: !282)
!428 = !DILocation(line: 548, column: 58, scope: !282)
!429 = !DILocation(line: 548, column: 63, scope: !282)
!430 = !DILocation(line: 548, column: 69, scope: !282)
!431 = !DILocation(line: 548, column: 5, scope: !432)
!432 = !DILexicalBlockFile(scope: !282, file: !145, discriminator: 1)
!433 = !DILocation(line: 550, column: 11, scope: !144)
!434 = !DILocation(line: 550, column: 19, scope: !144)
!435 = !DILocation(line: 550, column: 3, scope: !436)
!436 = !DILexicalBlockFile(scope: !144, file: !145, discriminator: 1)
!437 = !DILocation(line: 552, column: 19, scope: !144)
!438 = !DILocation(line: 552, column: 17, scope: !144)
!439 = !DILocation(line: 553, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !144, file: !145, line: 553, column: 7)
!441 = !DILocation(line: 553, column: 7, scope: !144)
!442 = !DILocation(line: 554, column: 33, scope: !440)
!443 = !DILocation(line: 554, column: 17, scope: !440)
!444 = !DILocation(line: 554, column: 15, scope: !440)
!445 = !DILocation(line: 554, column: 5, scope: !440)
!446 = !DILocation(line: 556, column: 17, scope: !440)
!447 = !DILocation(line: 556, column: 15, scope: !440)
!448 = !DILocation(line: 560, column: 23, scope: !144)
!449 = !DILocation(line: 560, column: 8, scope: !144)
!450 = !DILocation(line: 560, column: 6, scope: !144)
!451 = !DILocation(line: 562, column: 21, scope: !144)
!452 = !DILocation(line: 562, column: 25, scope: !144)
!453 = !DILocation(line: 562, column: 3, scope: !144)
!454 = !DILocation(line: 564, column: 3, scope: !144)
!455 = !DILocation(line: 568, column: 11, scope: !144)
!456 = !DILocation(line: 568, column: 9, scope: !144)
!457 = !DILocation(line: 569, column: 18, scope: !144)
!458 = !DILocation(line: 569, column: 10, scope: !144)
!459 = !DILocation(line: 569, column: 8, scope: !144)
!460 = !DILocation(line: 570, column: 7, scope: !461)
!461 = distinct !DILexicalBlock(scope: !144, file: !145, line: 570, column: 7)
!462 = !DILocation(line: 570, column: 12, scope: !461)
!463 = !DILocation(line: 570, column: 7, scope: !144)
!464 = !DILocation(line: 571, column: 13, scope: !461)
!465 = !DILocation(line: 571, column: 60, scope: !466)
!466 = !DILexicalBlockFile(scope: !461, file: !145, discriminator: 1)
!467 = !DILocation(line: 571, column: 5, scope: !468)
!468 = !DILexicalBlockFile(scope: !461, file: !145, discriminator: 2)
!469 = !DILocation(line: 571, column: 5, scope: !461)
!470 = !DILocation(line: 573, column: 14, scope: !471)
!471 = distinct !DILexicalBlock(scope: !144, file: !145, line: 573, column: 7)
!472 = !DILocation(line: 573, column: 7, scope: !471)
!473 = !DILocation(line: 573, column: 7, scope: !144)
!474 = !DILocation(line: 574, column: 12, scope: !471)
!475 = !DILocation(line: 574, column: 65, scope: !476)
!476 = !DILexicalBlockFile(scope: !471, file: !145, discriminator: 1)
!477 = !DILocation(line: 575, column: 12, scope: !471)
!478 = !DILocation(line: 574, column: 5, scope: !479)
!479 = !DILexicalBlockFile(scope: !471, file: !145, discriminator: 2)
!480 = !DILocation(line: 574, column: 5, scope: !471)
!481 = !DILocation(line: 576, column: 8, scope: !144)
!482 = !DILocation(line: 576, column: 3, scope: !144)
!483 = !DILocation(line: 579, column: 7, scope: !484)
!484 = distinct !DILexicalBlock(scope: !144, file: !145, line: 579, column: 7)
!485 = !DILocation(line: 579, column: 7, scope: !144)
!486 = !DILocation(line: 580, column: 31, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !145, line: 579, column: 32)
!488 = !DILocation(line: 581, column: 3, scope: !487)
!489 = !DILocation(line: 582, column: 29, scope: !490)
!490 = distinct !DILexicalBlock(scope: !484, file: !145, line: 581, column: 10)
!491 = !DILocation(line: 582, column: 34, scope: !490)
!492 = !DILocation(line: 583, column: 29, scope: !490)
!493 = !DILocation(line: 583, column: 38, scope: !490)
!494 = !DILocation(line: 584, column: 29, scope: !490)
!495 = !DILocation(line: 584, column: 35, scope: !490)
!496 = !DILocation(line: 585, column: 10, scope: !497)
!497 = distinct !DILexicalBlock(scope: !490, file: !145, line: 585, column: 9)
!498 = !DILocation(line: 585, column: 9, scope: !490)
!499 = !DILocation(line: 586, column: 98, scope: !497)
!500 = !DILocation(line: 586, column: 7, scope: !497)
!501 = !DILocation(line: 590, column: 15, scope: !144)
!502 = !DILocation(line: 590, column: 20, scope: !144)
!503 = !DILocation(line: 591, column: 27, scope: !144)
!504 = !DILocation(line: 591, column: 15, scope: !144)
!505 = !DILocation(line: 591, column: 25, scope: !144)
!506 = !DILocation(line: 592, column: 15, scope: !144)
!507 = !DILocation(line: 592, column: 32, scope: !144)
!508 = !DILocation(line: 593, column: 16, scope: !144)
!509 = !DILocation(line: 594, column: 42, scope: !144)
!510 = !DILocation(line: 593, column: 3, scope: !144)
!511 = !DILocation(line: 596, column: 8, scope: !144)
!512 = !DILocation(line: 596, column: 3, scope: !144)
!513 = !DILocation(line: 598, column: 13, scope: !514)
!514 = distinct !DILexicalBlock(scope: !144, file: !145, line: 598, column: 7)
!515 = !DILocation(line: 598, column: 7, scope: !514)
!516 = !DILocation(line: 598, column: 7, scope: !144)
!517 = !DILocation(line: 599, column: 13, scope: !514)
!518 = !DILocation(line: 599, column: 62, scope: !519)
!519 = !DILexicalBlockFile(scope: !514, file: !145, discriminator: 1)
!520 = !DILocation(line: 599, column: 5, scope: !521)
!521 = !DILexicalBlockFile(scope: !514, file: !145, discriminator: 2)
!522 = !DILocation(line: 599, column: 5, scope: !514)
!523 = !DILocation(line: 603, column: 18, scope: !524)
!524 = distinct !DILexicalBlock(scope: !144, file: !145, line: 603, column: 7)
!525 = !DILocation(line: 603, column: 24, scope: !524)
!526 = !DILocation(line: 603, column: 7, scope: !144)
!527 = !DILocalVariable(name: "controlstab", scope: !528, file: !145, line: 604, type: !529)
!528 = distinct !DILexicalBlock(scope: !524, file: !145, line: 603, column: 30)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !530, line: 46, size: 1152, align: 64, elements: !531)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!531 = !{!532, !534, !536, !538, !539, !541, !543, !544, !545, !546, !548, !550, !556, !557, !558}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !529, file: !530, line: 48, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !182, line: 124, baseType: !141)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !529, file: !530, line: 53, baseType: !535, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !182, line: 127, baseType: !141)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !529, file: !530, line: 61, baseType: !537, size: 64, align: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !182, line: 130, baseType: !141)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !529, file: !530, line: 62, baseType: !204, size: 32, align: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !529, file: !530, line: 64, baseType: !540, size: 32, align: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !182, line: 125, baseType: !205)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !529, file: !530, line: 65, baseType: !542, size: 32, align: 32, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !182, line: 126, baseType: !205)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !529, file: !530, line: 67, baseType: !148, size: 32, align: 32, offset: 288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !529, file: !530, line: 69, baseType: !533, size: 64, align: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !529, file: !530, line: 74, baseType: !209, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !529, file: !530, line: 78, baseType: !547, size: 64, align: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !182, line: 153, baseType: !140)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !529, file: !530, line: 80, baseType: !549, size: 64, align: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !182, line: 158, baseType: !140)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !529, file: !530, line: 91, baseType: !551, size: 128, align: 64, offset: 576)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !180, line: 120, size: 128, align: 64, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !551, file: !180, line: 122, baseType: !181, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !551, file: !180, line: 123, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !182, line: 175, baseType: !140)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !529, file: !530, line: 92, baseType: !551, size: 128, align: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !529, file: !530, line: 93, baseType: !551, size: 128, align: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !529, file: !530, line: 106, baseType: !559, size: 192, align: 64, offset: 960)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, align: 64, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 3)
!562 = !DILocation(line: 604, column: 17, scope: !528)
!563 = !DILocalVariable(name: "versionbuf", scope: !528, file: !145, line: 605, type: !564)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 320, align: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 40)
!567 = !DILocation(line: 605, column: 10, scope: !528)
!568 = !DILocation(line: 607, column: 15, scope: !569)
!569 = distinct !DILexicalBlock(scope: !528, file: !145, line: 607, column: 9)
!570 = !DILocation(line: 607, column: 9, scope: !569)
!571 = !DILocation(line: 607, column: 9, scope: !528)
!572 = !DILocation(line: 608, column: 15, scope: !569)
!573 = !DILocation(line: 608, column: 62, scope: !574)
!574 = !DILexicalBlockFile(scope: !569, file: !145, discriminator: 1)
!575 = !DILocation(line: 608, column: 7, scope: !576)
!576 = !DILexicalBlockFile(scope: !569, file: !145, discriminator: 2)
!577 = !DILocation(line: 608, column: 7, scope: !569)
!578 = !DILocation(line: 609, column: 13, scope: !528)
!579 = !DILocation(line: 610, column: 35, scope: !528)
!580 = !DILocation(line: 609, column: 5, scope: !528)
!581 = !DILocation(line: 611, column: 18, scope: !582)
!582 = distinct !DILexicalBlock(scope: !528, file: !145, line: 611, column: 9)
!583 = !DILocation(line: 611, column: 22, scope: !582)
!584 = !DILocation(line: 611, column: 26, scope: !582)
!585 = !DILocation(line: 611, column: 45, scope: !582)
!586 = !DILocation(line: 611, column: 38, scope: !582)
!587 = !DILocation(line: 611, column: 9, scope: !588)
!588 = !DILexicalBlockFile(scope: !582, file: !145, discriminator: 1)
!589 = !DILocation(line: 611, column: 58, scope: !582)
!590 = !DILocation(line: 611, column: 9, scope: !528)
!591 = !DILocation(line: 612, column: 15, scope: !582)
!592 = !DILocation(line: 612, column: 46, scope: !582)
!593 = !DILocation(line: 612, column: 7, scope: !588)
!594 = !DILocation(line: 612, column: 7, scope: !582)
!595 = !DILocation(line: 613, column: 28, scope: !596)
!596 = distinct !DILexicalBlock(scope: !528, file: !145, line: 613, column: 9)
!597 = !DILocation(line: 613, column: 13, scope: !596)
!598 = !DILocation(line: 613, column: 17, scope: !596)
!599 = !DILocation(line: 613, column: 9, scope: !596)
!600 = !DILocation(line: 613, column: 34, scope: !596)
!601 = !DILocation(line: 613, column: 9, scope: !528)
!602 = !DILocation(line: 614, column: 14, scope: !596)
!603 = !DILocation(line: 614, column: 65, scope: !604)
!604 = !DILexicalBlockFile(scope: !596, file: !145, discriminator: 1)
!605 = !DILocation(line: 615, column: 14, scope: !596)
!606 = !DILocation(line: 615, column: 18, scope: !596)
!607 = !DILocation(line: 615, column: 28, scope: !596)
!608 = !DILocation(line: 614, column: 7, scope: !609)
!609 = !DILexicalBlockFile(scope: !596, file: !145, discriminator: 2)
!610 = !DILocation(line: 614, column: 7, scope: !596)
!611 = !DILocation(line: 616, column: 3, scope: !528)
!612 = !DILocation(line: 616, column: 25, scope: !613)
!613 = !DILexicalBlockFile(scope: !614, file: !145, discriminator: 1)
!614 = distinct !DILexicalBlock(scope: !524, file: !145, line: 616, column: 14)
!615 = !DILocation(line: 616, column: 31, scope: !613)
!616 = !DILocation(line: 616, column: 14, scope: !613)
!617 = !DILocalVariable(name: "adminmember", scope: !618, file: !145, line: 618, type: !619)
!618 = distinct !DILexicalBlock(scope: !614, file: !145, line: 616, column: 37)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 136, align: 8, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 17)
!622 = !DILocation(line: 618, column: 10, scope: !618)
!623 = !DILocation(line: 620, column: 13, scope: !618)
!624 = !DILocation(line: 621, column: 62, scope: !618)
!625 = !DILocation(line: 621, column: 13, scope: !618)
!626 = !DILocation(line: 620, column: 5, scope: !618)
!627 = !DILocation(line: 623, column: 23, scope: !618)
!628 = !DILocation(line: 623, column: 5, scope: !618)
!629 = !DILocation(line: 624, column: 28, scope: !618)
!630 = !DILocation(line: 624, column: 60, scope: !618)
!631 = !DILocation(line: 624, column: 5, scope: !632)
!632 = !DILexicalBlockFile(scope: !618, file: !145, discriminator: 1)
!633 = !DILocation(line: 625, column: 29, scope: !618)
!634 = !DILocation(line: 625, column: 33, scope: !618)
!635 = !DILocation(line: 625, column: 46, scope: !618)
!636 = !DILocation(line: 625, column: 5, scope: !618)
!637 = !DILocation(line: 626, column: 3, scope: !618)
!638 = !DILocation(line: 627, column: 91, scope: !639)
!639 = distinct !DILexicalBlock(scope: !614, file: !145, line: 626, column: 10)
!640 = !DILocation(line: 627, column: 109, scope: !639)
!641 = !DILocation(line: 627, column: 5, scope: !639)
!642 = !DILocation(line: 630, column: 9, scope: !144)
!643 = !DILocation(line: 630, column: 3, scope: !144)
!644 = !DILocation(line: 633, column: 18, scope: !645)
!645 = distinct !DILexicalBlock(scope: !144, file: !145, line: 633, column: 7)
!646 = !DILocation(line: 633, column: 24, scope: !645)
!647 = !DILocation(line: 633, column: 7, scope: !144)
!648 = !DILocation(line: 637, column: 12, scope: !649)
!649 = distinct !DILexicalBlock(scope: !645, file: !145, line: 633, column: 30)
!650 = !DILocation(line: 637, column: 16, scope: !649)
!651 = !DILocation(line: 637, column: 10, scope: !649)
!652 = !DILocation(line: 638, column: 3, scope: !649)
!653 = !DILocation(line: 638, column: 25, scope: !654)
!654 = !DILexicalBlockFile(scope: !655, file: !145, discriminator: 1)
!655 = distinct !DILexicalBlock(scope: !645, file: !145, line: 638, column: 14)
!656 = !DILocation(line: 638, column: 31, scope: !654)
!657 = !DILocation(line: 638, column: 14, scope: !654)
!658 = !DILocation(line: 641, column: 13, scope: !659)
!659 = distinct !DILexicalBlock(scope: !655, file: !145, line: 638, column: 37)
!660 = !DILocation(line: 641, column: 11, scope: !659)
!661 = !DILocation(line: 642, column: 20, scope: !659)
!662 = !DILocation(line: 642, column: 12, scope: !659)
!663 = !DILocation(line: 642, column: 10, scope: !659)
!664 = !DILocation(line: 643, column: 9, scope: !665)
!665 = distinct !DILexicalBlock(scope: !659, file: !145, line: 643, column: 9)
!666 = !DILocation(line: 643, column: 14, scope: !665)
!667 = !DILocation(line: 643, column: 9, scope: !659)
!668 = !DILocation(line: 644, column: 15, scope: !665)
!669 = !DILocation(line: 644, column: 62, scope: !670)
!670 = !DILexicalBlockFile(scope: !665, file: !145, discriminator: 1)
!671 = !DILocation(line: 644, column: 7, scope: !672)
!672 = !DILexicalBlockFile(scope: !665, file: !145, discriminator: 2)
!673 = !DILocation(line: 644, column: 7, scope: !665)
!674 = !DILocation(line: 646, column: 16, scope: !675)
!675 = distinct !DILexicalBlock(scope: !659, file: !145, line: 646, column: 9)
!676 = !DILocation(line: 646, column: 9, scope: !675)
!677 = !DILocation(line: 646, column: 9, scope: !659)
!678 = !DILocation(line: 647, column: 14, scope: !675)
!679 = !DILocation(line: 647, column: 67, scope: !680)
!680 = !DILexicalBlockFile(scope: !675, file: !145, discriminator: 1)
!681 = !DILocation(line: 648, column: 14, scope: !675)
!682 = !DILocation(line: 647, column: 7, scope: !683)
!683 = !DILexicalBlockFile(scope: !675, file: !145, discriminator: 2)
!684 = !DILocation(line: 647, column: 7, scope: !675)
!685 = !DILocation(line: 649, column: 10, scope: !659)
!686 = !DILocation(line: 649, column: 5, scope: !659)
!687 = !DILocation(line: 650, column: 3, scope: !659)
!688 = !DILocation(line: 651, column: 91, scope: !689)
!689 = distinct !DILexicalBlock(scope: !655, file: !145, line: 650, column: 10)
!690 = !DILocation(line: 651, column: 109, scope: !689)
!691 = !DILocation(line: 651, column: 5, scope: !689)
!692 = !DILocation(line: 655, column: 15, scope: !144)
!693 = !DILocation(line: 655, column: 20, scope: !144)
!694 = !DILocation(line: 656, column: 27, scope: !144)
!695 = !DILocation(line: 656, column: 15, scope: !144)
!696 = !DILocation(line: 656, column: 25, scope: !144)
!697 = !DILocation(line: 657, column: 34, scope: !144)
!698 = !DILocation(line: 657, column: 15, scope: !144)
!699 = !DILocation(line: 657, column: 32, scope: !144)
!700 = !DILocation(line: 658, column: 16, scope: !144)
!701 = !DILocation(line: 658, column: 73, scope: !144)
!702 = !DILocation(line: 658, column: 3, scope: !144)
!703 = !DILocation(line: 661, column: 18, scope: !704)
!704 = distinct !DILexicalBlock(scope: !144, file: !145, line: 661, column: 7)
!705 = !DILocation(line: 661, column: 24, scope: !704)
!706 = !DILocation(line: 661, column: 7, scope: !144)
!707 = !DILocalVariable(name: "datamember", scope: !708, file: !145, line: 662, type: !619)
!708 = distinct !DILexicalBlock(scope: !704, file: !145, line: 661, column: 30)
!709 = !DILocation(line: 662, column: 10, scope: !708)
!710 = !DILocation(line: 664, column: 13, scope: !708)
!711 = !DILocation(line: 665, column: 54, scope: !708)
!712 = !DILocation(line: 665, column: 13, scope: !708)
!713 = !DILocation(line: 664, column: 5, scope: !708)
!714 = !DILocation(line: 667, column: 15, scope: !715)
!715 = distinct !DILexicalBlock(scope: !708, file: !145, line: 667, column: 9)
!716 = !DILocation(line: 667, column: 9, scope: !715)
!717 = !DILocation(line: 667, column: 9, scope: !708)
!718 = !DILocation(line: 668, column: 15, scope: !715)
!719 = !DILocation(line: 668, column: 64, scope: !720)
!720 = !DILexicalBlockFile(scope: !715, file: !145, discriminator: 1)
!721 = !DILocation(line: 668, column: 7, scope: !722)
!722 = !DILexicalBlockFile(scope: !715, file: !145, discriminator: 2)
!723 = !DILocation(line: 668, column: 7, scope: !715)
!724 = !DILocation(line: 670, column: 29, scope: !708)
!725 = !DILocation(line: 670, column: 33, scope: !708)
!726 = !DILocation(line: 670, column: 45, scope: !708)
!727 = !DILocation(line: 670, column: 5, scope: !708)
!728 = !DILocation(line: 672, column: 11, scope: !708)
!729 = !DILocation(line: 672, column: 5, scope: !708)
!730 = !DILocation(line: 673, column: 3, scope: !708)
!731 = !DILocation(line: 674, column: 13, scope: !732)
!732 = distinct !DILexicalBlock(scope: !144, file: !145, line: 674, column: 7)
!733 = !DILocation(line: 674, column: 17, scope: !732)
!734 = !DILocation(line: 674, column: 7, scope: !732)
!735 = !DILocation(line: 674, column: 7, scope: !144)
!736 = !DILocation(line: 675, column: 13, scope: !732)
!737 = !DILocation(line: 675, column: 50, scope: !732)
!738 = !DILocation(line: 675, column: 54, scope: !732)
!739 = !DILocation(line: 675, column: 5, scope: !740)
!740 = !DILexicalBlockFile(scope: !732, file: !145, discriminator: 1)
!741 = !DILocation(line: 675, column: 5, scope: !732)
!742 = !DILocation(line: 677, column: 17, scope: !144)
!743 = !DILocation(line: 677, column: 3, scope: !144)
!744 = !DILocation(line: 679, column: 8, scope: !144)
!745 = !DILocation(line: 679, column: 3, scope: !144)
!746 = !DILocation(line: 681, column: 3, scope: !144)
!747 = distinct !DISubprogram(name: "gen_dest_pathname", scope: !145, file: !145, line: 380, type: !748, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!748 = !DISubroutineType(types: !749)
!749 = !{!193, !151, !151}
!750 = !DILocalVariable(name: "dir", arg: 1, scope: !747, file: !145, line: 380, type: !151)
!751 = !DILocation(line: 380, column: 31, scope: !747)
!752 = !DILocalVariable(name: "dest", arg: 2, scope: !747, file: !145, line: 380, type: !151)
!753 = !DILocation(line: 380, column: 48, scope: !747)
!754 = !DILocation(line: 382, column: 7, scope: !755)
!755 = distinct !DILexicalBlock(scope: !747, file: !145, line: 382, column: 7)
!756 = !DILocation(line: 382, column: 7, scope: !747)
!757 = !DILocalVariable(name: "dest_stab", scope: !758, file: !145, line: 383, type: !529)
!758 = distinct !DILexicalBlock(scope: !755, file: !145, line: 382, column: 13)
!759 = !DILocation(line: 383, column: 17, scope: !758)
!760 = !DILocation(line: 385, column: 14, scope: !761)
!761 = distinct !DILexicalBlock(scope: !758, file: !145, line: 385, column: 9)
!762 = !DILocation(line: 385, column: 9, scope: !761)
!763 = !DILocation(line: 385, column: 9, scope: !758)
!764 = !DILocation(line: 386, column: 12, scope: !765)
!765 = distinct !DILexicalBlock(scope: !766, file: !145, line: 386, column: 10)
!766 = distinct !DILexicalBlock(scope: !761, file: !145, line: 385, column: 33)
!767 = !DILocation(line: 386, column: 11, scope: !765)
!768 = !DILocation(line: 386, column: 16, scope: !765)
!769 = !DILocation(line: 386, column: 10, scope: !766)
!770 = !DILocation(line: 387, column: 17, scope: !765)
!771 = !DILocation(line: 387, column: 79, scope: !765)
!772 = !DILocation(line: 387, column: 9, scope: !773)
!773 = !DILexicalBlockFile(scope: !765, file: !145, discriminator: 1)
!774 = !DILocation(line: 387, column: 9, scope: !765)
!775 = !DILocation(line: 388, column: 5, scope: !766)
!776 = !DILocation(line: 388, column: 25, scope: !777)
!777 = !DILexicalBlockFile(scope: !778, file: !145, discriminator: 1)
!778 = distinct !DILexicalBlock(scope: !761, file: !145, line: 388, column: 15)
!779 = !DILocation(line: 388, column: 18, scope: !777)
!780 = !DILocation(line: 388, column: 29, scope: !777)
!781 = !DILocation(line: 388, column: 15, scope: !777)
!782 = !DILocation(line: 390, column: 7, scope: !783)
!783 = distinct !DILexicalBlock(scope: !778, file: !145, line: 388, column: 43)
!784 = !DILocation(line: 393, column: 21, scope: !758)
!785 = !DILocation(line: 393, column: 12, scope: !758)
!786 = !DILocation(line: 393, column: 5, scope: !758)
!787 = !DILocalVariable(name: "pathname", scope: !788, file: !145, line: 395, type: !193)
!788 = distinct !DILexicalBlock(scope: !755, file: !145, line: 394, column: 10)
!789 = !DILocation(line: 395, column: 11, scope: !788)
!790 = !DILocation(line: 397, column: 32, scope: !788)
!791 = !DILocation(line: 397, column: 25, scope: !788)
!792 = !DILocation(line: 397, column: 37, scope: !788)
!793 = !DILocation(line: 397, column: 16, scope: !794)
!794 = !DILexicalBlockFile(scope: !788, file: !145, discriminator: 1)
!795 = !DILocation(line: 397, column: 14, scope: !788)
!796 = !DILocation(line: 398, column: 12, scope: !788)
!797 = !DILocation(line: 398, column: 22, scope: !788)
!798 = !DILocation(line: 398, column: 5, scope: !788)
!799 = !DILocation(line: 399, column: 30, scope: !788)
!800 = !DILocation(line: 399, column: 5, scope: !788)
!801 = !DILocation(line: 400, column: 12, scope: !788)
!802 = !DILocation(line: 400, column: 5, scope: !788)
!803 = !DILocation(line: 402, column: 12, scope: !788)
!804 = !DILocation(line: 402, column: 5, scope: !788)
!805 = !DILocation(line: 404, column: 1, scope: !747)
!806 = distinct !DISubprogram(name: "check_control_area", scope: !145, file: !145, line: 350, type: !807, isLocal: true, isDefinition: true, scopeLine: 351, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!807 = !DISubroutineType(types: !808)
!808 = !{!283, !151, !151}
!809 = !DILocalVariable(name: "ctrldir", arg: 1, scope: !806, file: !145, line: 350, type: !151)
!810 = !DILocation(line: 350, column: 32, scope: !806)
!811 = !DILocalVariable(name: "rootdir", arg: 2, scope: !806, file: !145, line: 350, type: !151)
!812 = !DILocation(line: 350, column: 53, scope: !806)
!813 = !DILocalVariable(name: "pkg", scope: !806, file: !145, line: 352, type: !283)
!814 = !DILocation(line: 352, column: 19, scope: !806)
!815 = !DILocalVariable(name: "warns", scope: !806, file: !145, line: 353, type: !148)
!816 = !DILocation(line: 353, column: 7, scope: !806)
!817 = !DILocation(line: 356, column: 28, scope: !806)
!818 = !DILocation(line: 356, column: 9, scope: !806)
!819 = !DILocation(line: 356, column: 7, scope: !806)
!820 = !DILocation(line: 357, column: 20, scope: !806)
!821 = !DILocation(line: 357, column: 3, scope: !806)
!822 = !DILocation(line: 358, column: 19, scope: !806)
!823 = !DILocation(line: 358, column: 28, scope: !806)
!824 = !DILocation(line: 358, column: 3, scope: !806)
!825 = !DILocation(line: 360, column: 11, scope: !806)
!826 = !DILocation(line: 360, column: 9, scope: !806)
!827 = !DILocation(line: 361, column: 7, scope: !828)
!828 = distinct !DILexicalBlock(scope: !806, file: !145, line: 361, column: 7)
!829 = !DILocation(line: 361, column: 7, scope: !806)
!830 = !DILocation(line: 362, column: 121, scope: !828)
!831 = !DILocation(line: 362, column: 13, scope: !828)
!832 = !DILocation(line: 364, column: 13, scope: !828)
!833 = !DILocation(line: 362, column: 5, scope: !834)
!834 = !DILexicalBlockFile(scope: !828, file: !145, discriminator: 1)
!835 = !DILocation(line: 362, column: 5, scope: !828)
!836 = !DILocation(line: 366, column: 10, scope: !806)
!837 = !DILocation(line: 366, column: 3, scope: !806)
!838 = distinct !DISubprogram(name: "gen_dest_pathname_from_pkg", scope: !145, file: !145, line: 412, type: !839, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!839 = !DISubroutineType(types: !840)
!840 = !{!193, !151, !283}
!841 = !DILocalVariable(name: "dir", arg: 1, scope: !838, file: !145, line: 412, type: !151)
!842 = !DILocation(line: 412, column: 40, scope: !838)
!843 = !DILocalVariable(name: "pkg", arg: 2, scope: !838, file: !145, line: 412, type: !283)
!844 = !DILocation(line: 412, column: 61, scope: !838)
!845 = !DILocation(line: 414, column: 35, scope: !838)
!846 = !DILocation(line: 414, column: 40, scope: !838)
!847 = !DILocation(line: 414, column: 45, scope: !838)
!848 = !DILocation(line: 414, column: 50, scope: !838)
!849 = !DILocation(line: 415, column: 35, scope: !838)
!850 = !DILocation(line: 415, column: 40, scope: !838)
!851 = !DILocation(line: 415, column: 50, scope: !838)
!852 = !DILocation(line: 415, column: 18, scope: !838)
!853 = !DILocation(line: 416, column: 18, scope: !838)
!854 = !DILocation(line: 416, column: 23, scope: !838)
!855 = !DILocation(line: 416, column: 33, scope: !838)
!856 = !DILocation(line: 416, column: 39, scope: !838)
!857 = !DILocation(line: 414, column: 10, scope: !838)
!858 = !DILocation(line: 414, column: 3, scope: !838)
!859 = distinct !DISubprogram(name: "parse_timestamp", scope: !145, file: !145, line: 493, type: !860, isLocal: true, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!860 = !DISubroutineType(types: !861)
!861 = !{!179, !151}
!862 = !DILocalVariable(name: "value", arg: 1, scope: !859, file: !145, line: 493, type: !151)
!863 = !DILocation(line: 493, column: 29, scope: !859)
!864 = !DILocalVariable(name: "timestamp", scope: !859, file: !145, line: 495, type: !179)
!865 = !DILocation(line: 495, column: 10, scope: !859)
!866 = !DILocalVariable(name: "end", scope: !859, file: !145, line: 496, type: !193)
!867 = !DILocation(line: 496, column: 9, scope: !859)
!868 = !DILocation(line: 498, column: 4, scope: !859)
!869 = !DILocation(line: 498, column: 8, scope: !859)
!870 = !DILocation(line: 499, column: 22, scope: !859)
!871 = !DILocation(line: 499, column: 15, scope: !859)
!872 = !DILocation(line: 499, column: 13, scope: !859)
!873 = !DILocation(line: 500, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !859, file: !145, line: 500, column: 7)
!875 = !DILocation(line: 500, column: 16, scope: !874)
!876 = !DILocation(line: 500, column: 13, scope: !874)
!877 = !DILocation(line: 500, column: 20, scope: !874)
!878 = !DILocation(line: 500, column: 24, scope: !879)
!879 = !DILexicalBlockFile(scope: !874, file: !145, discriminator: 1)
!880 = !DILocation(line: 500, column: 23, scope: !879)
!881 = !DILocation(line: 500, column: 28, scope: !879)
!882 = !DILocation(line: 500, column: 32, scope: !883)
!883 = !DILexicalBlockFile(scope: !874, file: !145, discriminator: 2)
!884 = !DILocation(line: 500, column: 31, scope: !883)
!885 = !DILocation(line: 500, column: 36, scope: !883)
!886 = !DILocation(line: 500, column: 7, scope: !883)
!887 = !DILocation(line: 501, column: 13, scope: !874)
!888 = !DILocation(line: 501, column: 60, scope: !874)
!889 = !DILocation(line: 501, column: 5, scope: !879)
!890 = !DILocation(line: 501, column: 5, scope: !874)
!891 = !DILocation(line: 503, column: 10, scope: !859)
!892 = !DILocation(line: 503, column: 3, scope: !859)
!893 = distinct !DISubprogram(name: "tarball_pack", scope: !145, file: !145, line: 431, type: !894, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !151, !896, !900, !901, !148}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "filenames_feed_func", file: !145, line: 419, baseType: !898)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !151, !148}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!902 = !DILocalVariable(name: "dir", arg: 1, scope: !893, file: !145, line: 431, type: !151)
!903 = !DILocation(line: 431, column: 26, scope: !893)
!904 = !DILocalVariable(name: "tar_filenames_feeder", arg: 2, scope: !893, file: !145, line: 431, type: !896)
!905 = !DILocation(line: 431, column: 52, scope: !893)
!906 = !DILocalVariable(name: "options", arg: 3, scope: !893, file: !145, line: 432, type: !900)
!907 = !DILocation(line: 432, column: 39, scope: !893)
!908 = !DILocalVariable(name: "tar_compress_params", arg: 4, scope: !893, file: !145, line: 433, type: !901)
!909 = !DILocation(line: 433, column: 38, scope: !893)
!910 = !DILocalVariable(name: "fd_out", arg: 5, scope: !893, file: !145, line: 433, type: !148)
!911 = !DILocation(line: 433, column: 63, scope: !893)
!912 = !DILocalVariable(name: "pipe_filenames", scope: !893, file: !145, line: 435, type: !913)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, align: 32, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 2)
!916 = !DILocation(line: 435, column: 7, scope: !893)
!917 = !DILocalVariable(name: "pipe_tarball", scope: !893, file: !145, line: 435, type: !913)
!918 = !DILocation(line: 435, column: 26, scope: !893)
!919 = !DILocalVariable(name: "pid_tar", scope: !893, file: !145, line: 436, type: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !203, line: 98, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !182, line: 133, baseType: !148)
!922 = !DILocation(line: 436, column: 9, scope: !893)
!923 = !DILocalVariable(name: "pid_comp", scope: !893, file: !145, line: 436, type: !920)
!924 = !DILocation(line: 436, column: 18, scope: !893)
!925 = !DILocation(line: 439, column: 10, scope: !893)
!926 = !DILocation(line: 439, column: 3, scope: !893)
!927 = !DILocation(line: 440, column: 10, scope: !893)
!928 = !DILocation(line: 440, column: 3, scope: !893)
!929 = !DILocation(line: 441, column: 13, scope: !893)
!930 = !DILocation(line: 441, column: 11, scope: !893)
!931 = !DILocation(line: 442, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !893, file: !145, line: 442, column: 7)
!933 = !DILocation(line: 442, column: 15, scope: !932)
!934 = !DILocation(line: 442, column: 7, scope: !893)
!935 = !DILocalVariable(name: "cmd", scope: !936, file: !145, line: 443, type: !937)
!936 = distinct !DILexicalBlock(scope: !932, file: !145, line: 442, column: 21)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "command", file: !938, line: 37, size: 256, align: 64, elements: !939)
!938 = !DIFile(filename: "../lib/dpkg/command.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!939 = !{!940, !941, !942, !943, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !938, line: 39, baseType: !151, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !937, file: !938, line: 41, baseType: !151, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !937, file: !938, line: 42, baseType: !148, size: 32, align: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "argv_size", scope: !937, file: !938, line: 43, baseType: !148, size: 32, align: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !937, file: !938, line: 44, baseType: !945, size: 64, align: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!946 = !DILocation(line: 443, column: 20, scope: !936)
!947 = !DILocalVariable(name: "mtime", scope: !936, file: !145, line: 444, type: !948)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 400, align: 8, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 50)
!951 = !DILocation(line: 444, column: 10, scope: !936)
!952 = !DILocation(line: 446, column: 12, scope: !936)
!953 = !DILocation(line: 446, column: 5, scope: !936)
!954 = !DILocation(line: 447, column: 11, scope: !936)
!955 = !DILocation(line: 447, column: 5, scope: !936)
!956 = !DILocation(line: 448, column: 11, scope: !936)
!957 = !DILocation(line: 448, column: 5, scope: !936)
!958 = !DILocation(line: 449, column: 12, scope: !936)
!959 = !DILocation(line: 449, column: 5, scope: !936)
!960 = !DILocation(line: 450, column: 11, scope: !936)
!961 = !DILocation(line: 450, column: 5, scope: !936)
!962 = !DILocation(line: 451, column: 11, scope: !936)
!963 = !DILocation(line: 451, column: 5, scope: !936)
!964 = !DILocation(line: 453, column: 15, scope: !965)
!965 = distinct !DILexicalBlock(scope: !936, file: !145, line: 453, column: 9)
!966 = !DILocation(line: 453, column: 9, scope: !965)
!967 = !DILocation(line: 453, column: 9, scope: !936)
!968 = !DILocation(line: 454, column: 15, scope: !965)
!969 = !DILocation(line: 454, column: 55, scope: !965)
!970 = !DILocation(line: 454, column: 7, scope: !971)
!971 = !DILexicalBlockFile(scope: !965, file: !145, discriminator: 1)
!972 = !DILocation(line: 454, column: 7, scope: !965)
!973 = !DILocation(line: 456, column: 14, scope: !936)
!974 = !DILocation(line: 456, column: 44, scope: !936)
!975 = !DILocation(line: 456, column: 53, scope: !936)
!976 = !DILocation(line: 456, column: 5, scope: !936)
!977 = !DILocation(line: 458, column: 5, scope: !936)
!978 = !DILocation(line: 460, column: 39, scope: !936)
!979 = !DILocation(line: 459, column: 5, scope: !936)
!980 = !DILocation(line: 462, column: 9, scope: !981)
!981 = distinct !DILexicalBlock(scope: !936, file: !145, line: 462, column: 9)
!982 = !DILocation(line: 462, column: 18, scope: !981)
!983 = !DILocation(line: 462, column: 9, scope: !936)
!984 = !DILocation(line: 463, column: 40, scope: !981)
!985 = !DILocation(line: 463, column: 49, scope: !981)
!986 = !DILocation(line: 463, column: 7, scope: !981)
!987 = !DILocation(line: 464, column: 9, scope: !988)
!988 = distinct !DILexicalBlock(scope: !936, file: !145, line: 464, column: 9)
!989 = !DILocation(line: 464, column: 18, scope: !988)
!990 = !DILocation(line: 464, column: 9, scope: !936)
!991 = !DILocation(line: 465, column: 7, scope: !988)
!992 = !DILocation(line: 466, column: 5, scope: !936)
!993 = !DILocation(line: 468, column: 5, scope: !936)
!994 = !DILocation(line: 470, column: 9, scope: !893)
!995 = !DILocation(line: 470, column: 3, scope: !893)
!996 = !DILocation(line: 471, column: 9, scope: !893)
!997 = !DILocation(line: 471, column: 3, scope: !893)
!998 = !DILocation(line: 474, column: 14, scope: !893)
!999 = !DILocation(line: 474, column: 12, scope: !893)
!1000 = !DILocation(line: 475, column: 7, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !893, file: !145, line: 475, column: 7)
!1002 = !DILocation(line: 475, column: 16, scope: !1001)
!1003 = !DILocation(line: 475, column: 7, scope: !893)
!1004 = !DILocation(line: 476, column: 11, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1001, file: !145, line: 475, column: 22)
!1006 = !DILocation(line: 476, column: 5, scope: !1005)
!1007 = !DILocation(line: 477, column: 21, scope: !1005)
!1008 = !DILocation(line: 477, column: 42, scope: !1005)
!1009 = !DILocation(line: 477, column: 59, scope: !1005)
!1010 = !DILocation(line: 478, column: 21, scope: !1005)
!1011 = !DILocation(line: 477, column: 5, scope: !1005)
!1012 = !DILocation(line: 479, column: 5, scope: !1005)
!1013 = !DILocation(line: 481, column: 9, scope: !893)
!1014 = !DILocation(line: 481, column: 3, scope: !893)
!1015 = !DILocation(line: 484, column: 3, scope: !893)
!1016 = !DILocation(line: 484, column: 24, scope: !893)
!1017 = !DILocation(line: 484, column: 29, scope: !893)
!1018 = !DILocation(line: 487, column: 9, scope: !893)
!1019 = !DILocation(line: 487, column: 3, scope: !893)
!1020 = !DILocation(line: 488, column: 16, scope: !893)
!1021 = !DILocation(line: 488, column: 26, scope: !893)
!1022 = !DILocation(line: 488, column: 3, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !893, file: !145, discriminator: 1)
!1024 = !DILocation(line: 489, column: 16, scope: !893)
!1025 = !DILocation(line: 489, column: 3, scope: !893)
!1026 = !DILocation(line: 490, column: 1, scope: !893)
!1027 = distinct !DISubprogram(name: "control_treewalk_feed", scope: !145, file: !145, line: 60, type: !898, isLocal: true, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!1028 = !DILocalVariable(name: "dir", arg: 1, scope: !1027, file: !145, line: 60, type: !151)
!1029 = !DILocation(line: 60, column: 35, scope: !1027)
!1030 = !DILocalVariable(name: "fd_out", arg: 2, scope: !1027, file: !145, line: 60, type: !148)
!1031 = !DILocation(line: 60, column: 44, scope: !1027)
!1032 = !DILocalVariable(name: "tree", scope: !1027, file: !145, line: 62, type: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "treeroot", file: !131, line: 57, flags: DIFlagFwdDecl)
!1035 = !DILocation(line: 62, column: 20, scope: !1027)
!1036 = !DILocalVariable(name: "node", scope: !1027, file: !145, line: 63, type: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "treenode", file: !131, line: 45, flags: DIFlagFwdDecl)
!1039 = !DILocation(line: 63, column: 20, scope: !1027)
!1040 = !DILocation(line: 65, column: 24, scope: !1027)
!1041 = !DILocation(line: 65, column: 10, scope: !1027)
!1042 = !DILocation(line: 65, column: 8, scope: !1027)
!1043 = !DILocation(line: 66, column: 29, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1027, file: !145, line: 66, column: 3)
!1045 = !DILocation(line: 66, column: 15, scope: !1044)
!1046 = !DILocation(line: 66, column: 13, scope: !1044)
!1047 = !DILocation(line: 66, column: 8, scope: !1044)
!1048 = !DILocation(line: 66, column: 36, scope: !1049)
!1049 = !DILexicalBlockFile(scope: !1050, file: !145, discriminator: 1)
!1050 = distinct !DILexicalBlock(scope: !1044, file: !145, line: 66, column: 3)
!1051 = !DILocation(line: 66, column: 3, scope: !1049)
!1052 = !DILocalVariable(name: "nodename", scope: !1053, file: !145, line: 67, type: !193)
!1053 = distinct !DILexicalBlock(scope: !1050, file: !145, line: 66, column: 70)
!1054 = !DILocation(line: 67, column: 11, scope: !1053)
!1055 = !DILocation(line: 69, column: 54, scope: !1053)
!1056 = !DILocation(line: 69, column: 32, scope: !1053)
!1057 = !DILocation(line: 69, column: 16, scope: !1058)
!1058 = !DILexicalBlockFile(scope: !1053, file: !145, discriminator: 1)
!1059 = !DILocation(line: 69, column: 14, scope: !1053)
!1060 = !DILocation(line: 70, column: 18, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1053, file: !145, line: 70, column: 9)
!1062 = !DILocation(line: 70, column: 26, scope: !1061)
!1063 = !DILocation(line: 70, column: 43, scope: !1061)
!1064 = !DILocation(line: 70, column: 36, scope: !1061)
!1065 = !DILocation(line: 70, column: 53, scope: !1061)
!1066 = !DILocation(line: 70, column: 9, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1061, file: !145, discriminator: 1)
!1068 = !DILocation(line: 70, column: 58, scope: !1061)
!1069 = !DILocation(line: 70, column: 9, scope: !1053)
!1070 = !DILocation(line: 71, column: 15, scope: !1061)
!1071 = !DILocation(line: 72, column: 15, scope: !1061)
!1072 = !DILocation(line: 71, column: 7, scope: !1067)
!1073 = !DILocation(line: 71, column: 7, scope: !1061)
!1074 = !DILocation(line: 73, column: 10, scope: !1053)
!1075 = !DILocation(line: 73, column: 5, scope: !1053)
!1076 = !DILocation(line: 74, column: 3, scope: !1053)
!1077 = !DILocation(line: 66, column: 63, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1050, file: !145, discriminator: 2)
!1079 = !DILocation(line: 66, column: 49, scope: !1078)
!1080 = !DILocation(line: 66, column: 47, scope: !1078)
!1081 = !DILocation(line: 66, column: 3, scope: !1078)
!1082 = distinct !{!1082, !1083}
!1083 = !DILocation(line: 66, column: 3, scope: !1027)
!1084 = !DILocation(line: 75, column: 18, scope: !1027)
!1085 = !DILocation(line: 75, column: 3, scope: !1027)
!1086 = !DILocation(line: 76, column: 1, scope: !1027)
!1087 = distinct !DISubprogram(name: "file_treewalk_feed", scope: !145, file: !145, line: 153, type: !898, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!1088 = !DILocalVariable(name: "dir", arg: 1, scope: !1087, file: !145, line: 153, type: !151)
!1089 = !DILocation(line: 153, column: 32, scope: !1087)
!1090 = !DILocalVariable(name: "fd_out", arg: 2, scope: !1087, file: !145, line: 153, type: !148)
!1091 = !DILocation(line: 153, column: 41, scope: !1087)
!1092 = !DILocalVariable(name: "tree", scope: !1087, file: !145, line: 155, type: !1033)
!1093 = !DILocation(line: 155, column: 20, scope: !1087)
!1094 = !DILocalVariable(name: "node", scope: !1087, file: !145, line: 156, type: !1037)
!1095 = !DILocation(line: 156, column: 20, scope: !1087)
!1096 = !DILocalVariable(name: "fi", scope: !1087, file: !145, line: 157, type: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_info", file: !145, line: 81, size: 128, align: 64, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1098, file: !145, line: 82, baseType: !1097, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1098, file: !145, line: 83, baseType: !193, size: 64, align: 64, offset: 64)
!1102 = !DILocation(line: 157, column: 21, scope: !1087)
!1103 = !DILocalVariable(name: "symlist", scope: !1087, file: !145, line: 158, type: !1097)
!1104 = !DILocation(line: 158, column: 21, scope: !1087)
!1105 = !DILocalVariable(name: "symlist_end", scope: !1087, file: !145, line: 159, type: !1097)
!1106 = !DILocation(line: 159, column: 21, scope: !1087)
!1107 = !DILocation(line: 161, column: 24, scope: !1087)
!1108 = !DILocation(line: 161, column: 10, scope: !1087)
!1109 = !DILocation(line: 161, column: 8, scope: !1087)
!1110 = !DILocation(line: 162, column: 29, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1087, file: !145, line: 162, column: 3)
!1112 = !DILocation(line: 162, column: 15, scope: !1111)
!1113 = !DILocation(line: 162, column: 13, scope: !1111)
!1114 = !DILocation(line: 162, column: 8, scope: !1111)
!1115 = !DILocation(line: 162, column: 36, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1117, file: !145, discriminator: 1)
!1117 = distinct !DILexicalBlock(scope: !1111, file: !145, line: 162, column: 3)
!1118 = !DILocation(line: 162, column: 3, scope: !1116)
!1119 = !DILocalVariable(name: "virtname", scope: !1120, file: !145, line: 163, type: !151)
!1120 = distinct !DILexicalBlock(scope: !1117, file: !145, line: 162, column: 71)
!1121 = !DILocation(line: 163, column: 17, scope: !1120)
!1122 = !DILocation(line: 163, column: 50, scope: !1120)
!1123 = !DILocation(line: 163, column: 28, scope: !1120)
!1124 = !DILocalVariable(name: "nodename", scope: !1120, file: !145, line: 164, type: !193)
!1125 = !DILocation(line: 164, column: 11, scope: !1120)
!1126 = !DILocation(line: 166, column: 17, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1120, file: !145, line: 166, column: 9)
!1128 = !DILocation(line: 166, column: 9, scope: !1127)
!1129 = !DILocation(line: 166, column: 55, scope: !1127)
!1130 = !DILocation(line: 166, column: 9, scope: !1120)
!1131 = !DILocation(line: 167, column: 7, scope: !1127)
!1132 = !DILocation(line: 169, column: 32, scope: !1120)
!1133 = !DILocation(line: 169, column: 16, scope: !1120)
!1134 = !DILocation(line: 169, column: 14, scope: !1120)
!1135 = !DILocation(line: 171, column: 16, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1120, file: !145, line: 171, column: 9)
!1137 = !DILocation(line: 171, column: 9, scope: !1136)
!1138 = !DILocation(line: 171, column: 9, scope: !1120)
!1139 = !DILocation(line: 172, column: 14, scope: !1136)
!1140 = !DILocation(line: 172, column: 63, scope: !1136)
!1141 = !DILocation(line: 172, column: 7, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1136, file: !145, discriminator: 1)
!1143 = !DILocation(line: 172, column: 7, scope: !1136)
!1144 = !DILocation(line: 176, column: 26, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1120, file: !145, line: 176, column: 8)
!1146 = !DILocation(line: 176, column: 8, scope: !1145)
!1147 = !DILocation(line: 176, column: 11, scope: !1145)
!1148 = !DILocation(line: 176, column: 22, scope: !1145)
!1149 = !DILocation(line: 176, column: 8, scope: !1120)
!1150 = !DILocation(line: 177, column: 26, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1145, file: !145, line: 176, column: 42)
!1152 = !DILocation(line: 177, column: 12, scope: !1151)
!1153 = !DILocation(line: 177, column: 10, scope: !1151)
!1154 = !DILocation(line: 178, column: 53, scope: !1151)
!1155 = !DILocation(line: 178, column: 7, scope: !1151)
!1156 = !DILocation(line: 179, column: 5, scope: !1151)
!1157 = !DILocation(line: 180, column: 20, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !145, line: 180, column: 11)
!1159 = distinct !DILexicalBlock(scope: !1145, file: !145, line: 179, column: 12)
!1160 = !DILocation(line: 180, column: 28, scope: !1158)
!1161 = !DILocation(line: 180, column: 45, scope: !1158)
!1162 = !DILocation(line: 180, column: 38, scope: !1158)
!1163 = !DILocation(line: 180, column: 55, scope: !1158)
!1164 = !DILocation(line: 180, column: 11, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1158, file: !145, discriminator: 1)
!1166 = !DILocation(line: 180, column: 60, scope: !1158)
!1167 = !DILocation(line: 180, column: 11, scope: !1159)
!1168 = !DILocation(line: 181, column: 17, scope: !1158)
!1169 = !DILocation(line: 182, column: 17, scope: !1158)
!1170 = !DILocation(line: 181, column: 9, scope: !1165)
!1171 = !DILocation(line: 181, column: 9, scope: !1158)
!1172 = !DILocation(line: 185, column: 10, scope: !1120)
!1173 = !DILocation(line: 185, column: 5, scope: !1120)
!1174 = !DILocation(line: 186, column: 3, scope: !1120)
!1175 = !DILocation(line: 162, column: 64, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1117, file: !145, discriminator: 2)
!1177 = !DILocation(line: 162, column: 50, scope: !1176)
!1178 = !DILocation(line: 162, column: 48, scope: !1176)
!1179 = !DILocation(line: 162, column: 3, scope: !1176)
!1180 = distinct !{!1180, !1181}
!1181 = !DILocation(line: 162, column: 3, scope: !1087)
!1182 = !DILocation(line: 187, column: 18, scope: !1087)
!1183 = !DILocation(line: 187, column: 3, scope: !1087)
!1184 = !DILocation(line: 189, column: 13, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1087, file: !145, line: 189, column: 3)
!1186 = !DILocation(line: 189, column: 11, scope: !1185)
!1187 = !DILocation(line: 189, column: 8, scope: !1185)
!1188 = !DILocation(line: 189, column: 22, scope: !1189)
!1189 = !DILexicalBlockFile(scope: !1190, file: !145, discriminator: 1)
!1190 = distinct !DILexicalBlock(scope: !1185, file: !145, line: 189, column: 3)
!1191 = !DILocation(line: 189, column: 3, scope: !1189)
!1192 = !DILocation(line: 190, column: 18, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1190, file: !145, line: 190, column: 9)
!1194 = !DILocation(line: 190, column: 26, scope: !1193)
!1195 = !DILocation(line: 190, column: 30, scope: !1193)
!1196 = !DILocation(line: 190, column: 41, scope: !1193)
!1197 = !DILocation(line: 190, column: 45, scope: !1193)
!1198 = !DILocation(line: 190, column: 34, scope: !1193)
!1199 = !DILocation(line: 190, column: 49, scope: !1193)
!1200 = !DILocation(line: 190, column: 9, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1193, file: !145, discriminator: 2)
!1202 = !DILocation(line: 190, column: 54, scope: !1193)
!1203 = !DILocation(line: 190, column: 9, scope: !1190)
!1204 = !DILocation(line: 191, column: 15, scope: !1193)
!1205 = !DILocation(line: 191, column: 69, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1193, file: !145, discriminator: 1)
!1207 = !DILocation(line: 191, column: 7, scope: !1201)
!1208 = !DILocation(line: 191, column: 7, scope: !1193)
!1209 = !DILocation(line: 190, column: 56, scope: !1206)
!1210 = !DILocation(line: 189, column: 31, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1190, file: !145, discriminator: 2)
!1212 = !DILocation(line: 189, column: 35, scope: !1211)
!1213 = !DILocation(line: 189, column: 29, scope: !1211)
!1214 = !DILocation(line: 189, column: 3, scope: !1211)
!1215 = distinct !{!1215, !1216}
!1216 = !DILocation(line: 189, column: 3, scope: !1087)
!1217 = !DILocation(line: 193, column: 23, scope: !1087)
!1218 = !DILocation(line: 193, column: 3, scope: !1087)
!1219 = !DILocation(line: 194, column: 1, scope: !1087)
!1220 = distinct !DISubprogram(name: "check_control_file", scope: !145, file: !145, line: 320, type: !1221, isLocal: true, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!283, !151}
!1223 = !DILocalVariable(name: "ctrldir", arg: 1, scope: !1220, file: !145, line: 320, type: !151)
!1224 = !DILocation(line: 320, column: 32, scope: !1220)
!1225 = !DILocalVariable(name: "pkg", scope: !1220, file: !145, line: 322, type: !283)
!1226 = !DILocation(line: 322, column: 19, scope: !1220)
!1227 = !DILocalVariable(name: "controlfile", scope: !1220, file: !145, line: 323, type: !193)
!1228 = !DILocation(line: 323, column: 9, scope: !1220)
!1229 = !DILocation(line: 325, column: 34, scope: !1220)
!1230 = !DILocation(line: 325, column: 17, scope: !1220)
!1231 = !DILocation(line: 325, column: 15, scope: !1220)
!1232 = !DILocation(line: 326, column: 11, scope: !1220)
!1233 = !DILocation(line: 326, column: 3, scope: !1220)
!1234 = !DILocation(line: 328, column: 14, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1220, file: !145, line: 328, column: 7)
!1236 = !DILocation(line: 328, column: 19, scope: !1235)
!1237 = !DILocation(line: 328, column: 24, scope: !1235)
!1238 = !DILocation(line: 328, column: 7, scope: !1235)
!1239 = !DILocation(line: 329, column: 14, scope: !1235)
!1240 = !DILocation(line: 329, column: 19, scope: !1235)
!1241 = !DILocation(line: 329, column: 24, scope: !1235)
!1242 = !DILocation(line: 329, column: 7, scope: !1235)
!1243 = !DILocation(line: 328, column: 73, scope: !1235)
!1244 = !DILocation(line: 328, column: 7, scope: !1220)
!1245 = !DILocation(line: 330, column: 12, scope: !1235)
!1246 = !DILocation(line: 330, column: 5, scope: !1247)
!1247 = !DILexicalBlockFile(scope: !1235, file: !145, discriminator: 1)
!1248 = !DILocation(line: 330, column: 5, scope: !1235)
!1249 = !DILocation(line: 331, column: 7, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1220, file: !145, line: 331, column: 7)
!1251 = !DILocation(line: 331, column: 12, scope: !1250)
!1252 = !DILocation(line: 331, column: 22, scope: !1250)
!1253 = !DILocation(line: 331, column: 28, scope: !1250)
!1254 = !DILocation(line: 331, column: 33, scope: !1250)
!1255 = !DILocation(line: 331, column: 51, scope: !1250)
!1256 = !DILocation(line: 332, column: 7, scope: !1250)
!1257 = !DILocation(line: 332, column: 12, scope: !1250)
!1258 = !DILocation(line: 332, column: 22, scope: !1250)
!1259 = !DILocation(line: 332, column: 28, scope: !1250)
!1260 = !DILocation(line: 332, column: 33, scope: !1250)
!1261 = !DILocation(line: 331, column: 7, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1220, file: !145, discriminator: 1)
!1263 = !DILocation(line: 333, column: 12, scope: !1250)
!1264 = !DILocation(line: 333, column: 5, scope: !1265)
!1265 = !DILexicalBlockFile(scope: !1250, file: !145, discriminator: 1)
!1266 = !DILocation(line: 333, column: 5, scope: !1250)
!1267 = !DILocation(line: 334, column: 7, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1220, file: !145, line: 334, column: 7)
!1269 = !DILocation(line: 334, column: 12, scope: !1268)
!1270 = !DILocation(line: 334, column: 21, scope: !1268)
!1271 = !DILocation(line: 334, column: 7, scope: !1220)
!1272 = !DILocation(line: 335, column: 13, scope: !1268)
!1273 = !DILocation(line: 336, column: 13, scope: !1268)
!1274 = !DILocation(line: 336, column: 26, scope: !1268)
!1275 = !DILocation(line: 336, column: 31, scope: !1268)
!1276 = !DILocation(line: 335, column: 5, scope: !1277)
!1277 = !DILexicalBlockFile(scope: !1268, file: !145, discriminator: 1)
!1278 = !DILocation(line: 335, column: 5, scope: !1268)
!1279 = !DILocation(line: 338, column: 8, scope: !1220)
!1280 = !DILocation(line: 338, column: 3, scope: !1220)
!1281 = !DILocation(line: 340, column: 10, scope: !1220)
!1282 = !DILocation(line: 340, column: 3, scope: !1220)
!1283 = distinct !DISubprogram(name: "check_file_perms", scope: !145, file: !145, line: 209, type: !1284, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{null, !151}
!1286 = !DILocalVariable(name: "ctrldir", arg: 1, scope: !1283, file: !145, line: 209, type: !151)
!1287 = !DILocation(line: 209, column: 30, scope: !1283)
!1288 = !DILocalVariable(name: "path", scope: !1283, file: !145, line: 211, type: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !1290, line: 55, size: 192, align: 64, elements: !1291)
!1290 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!1291 = !{!1292, !1295, !1296}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1289, file: !1290, line: 56, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1294, line: 216, baseType: !141)
!1294 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1289, file: !1290, line: 56, baseType: !1293, size: 64, align: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1289, file: !1290, line: 57, baseType: !193, size: 64, align: 64, offset: 128)
!1297 = !DILocation(line: 211, column: 17, scope: !1283)
!1298 = !DILocalVariable(name: "mscriptp", scope: !1283, file: !145, line: 212, type: !149)
!1299 = !DILocation(line: 212, column: 22, scope: !1283)
!1300 = !DILocalVariable(name: "mscriptstab", scope: !1283, file: !145, line: 213, type: !529)
!1301 = !DILocation(line: 213, column: 15, scope: !1283)
!1302 = !DILocation(line: 215, column: 31, scope: !1283)
!1303 = !DILocation(line: 215, column: 3, scope: !1283)
!1304 = !DILocation(line: 216, column: 18, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1283, file: !145, line: 216, column: 7)
!1306 = !DILocation(line: 216, column: 7, scope: !1305)
!1307 = !DILocation(line: 216, column: 7, scope: !1283)
!1308 = !DILocation(line: 217, column: 13, scope: !1305)
!1309 = !DILocation(line: 217, column: 5, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !1305, file: !145, discriminator: 1)
!1311 = !DILocation(line: 217, column: 5, scope: !1305)
!1312 = !DILocation(line: 218, column: 19, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1283, file: !145, line: 218, column: 7)
!1314 = !DILocation(line: 218, column: 10, scope: !1313)
!1315 = !DILocation(line: 218, column: 21, scope: !1313)
!1316 = !DILocation(line: 218, column: 7, scope: !1283)
!1317 = !DILocation(line: 219, column: 12, scope: !1313)
!1318 = !DILocation(line: 219, column: 5, scope: !1319)
!1319 = !DILexicalBlockFile(scope: !1313, file: !145, discriminator: 1)
!1320 = !DILocation(line: 219, column: 5, scope: !1313)
!1321 = !DILocation(line: 220, column: 20, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1283, file: !145, line: 220, column: 7)
!1323 = !DILocation(line: 220, column: 28, scope: !1322)
!1324 = !DILocation(line: 220, column: 37, scope: !1322)
!1325 = !DILocation(line: 220, column: 7, scope: !1283)
!1326 = !DILocation(line: 221, column: 12, scope: !1322)
!1327 = !DILocation(line: 223, column: 40, scope: !1322)
!1328 = !DILocation(line: 223, column: 48, scope: !1322)
!1329 = !DILocation(line: 223, column: 12, scope: !1322)
!1330 = !DILocation(line: 221, column: 5, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1322, file: !145, discriminator: 1)
!1332 = !DILocation(line: 221, column: 5, scope: !1322)
!1333 = !DILocation(line: 225, column: 17, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1283, file: !145, line: 225, column: 3)
!1335 = !DILocation(line: 225, column: 8, scope: !1334)
!1336 = !DILocation(line: 225, column: 39, scope: !1337)
!1337 = !DILexicalBlockFile(scope: !1338, file: !145, discriminator: 1)
!1338 = distinct !DILexicalBlock(scope: !1334, file: !145, line: 225, column: 3)
!1339 = !DILocation(line: 225, column: 38, scope: !1337)
!1340 = !DILocation(line: 225, column: 3, scope: !1337)
!1341 = !DILocation(line: 226, column: 5, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1338, file: !145, line: 225, column: 61)
!1343 = !DILocation(line: 227, column: 35, scope: !1342)
!1344 = !DILocation(line: 227, column: 45, scope: !1342)
!1345 = !DILocation(line: 227, column: 44, scope: !1342)
!1346 = !DILocation(line: 227, column: 5, scope: !1342)
!1347 = !DILocation(line: 228, column: 21, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1342, file: !145, line: 228, column: 9)
!1349 = !DILocation(line: 228, column: 10, scope: !1348)
!1350 = !DILocation(line: 228, column: 9, scope: !1342)
!1351 = !DILocation(line: 229, column: 22, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1353, file: !145, line: 229, column: 10)
!1353 = distinct !DILexicalBlock(scope: !1348, file: !145, line: 228, column: 41)
!1354 = !DILocation(line: 229, column: 13, scope: !1352)
!1355 = !DILocation(line: 229, column: 24, scope: !1352)
!1356 = !DILocation(line: 229, column: 10, scope: !1353)
!1357 = !DILocation(line: 230, column: 9, scope: !1352)
!1358 = !DILocation(line: 231, column: 23, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1353, file: !145, line: 231, column: 11)
!1360 = !DILocation(line: 231, column: 14, scope: !1359)
!1361 = !DILocation(line: 231, column: 25, scope: !1359)
!1362 = !DILocation(line: 231, column: 11, scope: !1353)
!1363 = !DILocation(line: 232, column: 16, scope: !1359)
!1364 = !DILocation(line: 233, column: 17, scope: !1359)
!1365 = !DILocation(line: 233, column: 16, scope: !1359)
!1366 = !DILocation(line: 232, column: 9, scope: !1367)
!1367 = !DILexicalBlockFile(scope: !1359, file: !145, discriminator: 1)
!1368 = !DILocation(line: 232, column: 9, scope: !1359)
!1369 = !DILocation(line: 234, column: 24, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1353, file: !145, line: 234, column: 11)
!1371 = !DILocation(line: 234, column: 32, scope: !1370)
!1372 = !DILocation(line: 234, column: 41, scope: !1370)
!1373 = !DILocation(line: 234, column: 11, scope: !1353)
!1374 = !DILocation(line: 235, column: 16, scope: !1370)
!1375 = !DILocation(line: 237, column: 17, scope: !1370)
!1376 = !DILocation(line: 237, column: 16, scope: !1370)
!1377 = !DILocation(line: 237, column: 55, scope: !1370)
!1378 = !DILocation(line: 237, column: 63, scope: !1370)
!1379 = !DILocation(line: 237, column: 27, scope: !1370)
!1380 = !DILocation(line: 235, column: 9, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1370, file: !145, discriminator: 1)
!1382 = !DILocation(line: 235, column: 9, scope: !1370)
!1383 = !DILocation(line: 238, column: 5, scope: !1353)
!1384 = !DILocation(line: 238, column: 17, scope: !1385)
!1385 = !DILexicalBlockFile(scope: !1386, file: !145, discriminator: 1)
!1386 = distinct !DILexicalBlock(scope: !1348, file: !145, line: 238, column: 15)
!1387 = !DILocation(line: 238, column: 16, scope: !1385)
!1388 = !DILocation(line: 238, column: 21, scope: !1385)
!1389 = !DILocation(line: 238, column: 15, scope: !1385)
!1390 = !DILocation(line: 239, column: 15, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1386, file: !145, line: 238, column: 32)
!1392 = !DILocation(line: 239, column: 71, scope: !1391)
!1393 = !DILocation(line: 239, column: 70, scope: !1391)
!1394 = !DILocation(line: 239, column: 7, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1391, file: !145, discriminator: 1)
!1396 = !DILocation(line: 239, column: 7, scope: !1391)
!1397 = !DILocation(line: 241, column: 3, scope: !1342)
!1398 = !DILocation(line: 225, column: 57, scope: !1399)
!1399 = !DILexicalBlockFile(scope: !1338, file: !145, discriminator: 2)
!1400 = !DILocation(line: 225, column: 3, scope: !1399)
!1401 = distinct !{!1401, !1402}
!1402 = !DILocation(line: 225, column: 3, scope: !1283)
!1403 = !DILocation(line: 243, column: 3, scope: !1283)
!1404 = !DILocation(line: 244, column: 1, scope: !1283)
!1405 = distinct !DISubprogram(name: "check_conffiles", scope: !145, file: !145, line: 250, type: !1406, isLocal: true, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{null, !151, !151}
!1408 = !DILocalVariable(name: "ctrldir", arg: 1, scope: !1405, file: !145, line: 250, type: !151)
!1409 = !DILocation(line: 250, column: 29, scope: !1405)
!1410 = !DILocalVariable(name: "rootdir", arg: 2, scope: !1405, file: !145, line: 250, type: !151)
!1411 = !DILocation(line: 250, column: 50, scope: !1405)
!1412 = !DILocalVariable(name: "cf", scope: !1405, file: !145, line: 252, type: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1415, line: 48, baseType: !1416)
!1415 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1417, line: 241, size: 1728, align: 64, elements: !1418)
!1417 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dpkg/[task]dpkg-deb--dpkg-deb")
!1418 = !{!1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1439, !1440, !1441, !1442, !1443, !1445, !1447, !1451, !1454, !1456, !1457, !1458, !1459, !1460, !1461, !1462}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1416, file: !1417, line: 242, baseType: !148, size: 32, align: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1416, file: !1417, line: 247, baseType: !193, size: 64, align: 64, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1416, file: !1417, line: 248, baseType: !193, size: 64, align: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1416, file: !1417, line: 249, baseType: !193, size: 64, align: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1416, file: !1417, line: 250, baseType: !193, size: 64, align: 64, offset: 256)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1416, file: !1417, line: 251, baseType: !193, size: 64, align: 64, offset: 320)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1416, file: !1417, line: 252, baseType: !193, size: 64, align: 64, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1416, file: !1417, line: 253, baseType: !193, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1416, file: !1417, line: 254, baseType: !193, size: 64, align: 64, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1416, file: !1417, line: 256, baseType: !193, size: 64, align: 64, offset: 576)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1416, file: !1417, line: 257, baseType: !193, size: 64, align: 64, offset: 640)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1416, file: !1417, line: 258, baseType: !193, size: 64, align: 64, offset: 704)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1416, file: !1417, line: 260, baseType: !1432, size: 64, align: 64, offset: 768)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
