; ModuleID = './libSyncDriver_la-syncDriverPosix.o.i'
source_filename = "./libSyncDriver_la-syncDriverPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.SyncHandle = type { i32 (%struct.SyncHandle*)*, void (%struct.SyncHandle*)*, void (%struct.SyncHandle*, i8**, i8*)* }
%struct._GPtrArray = type { i8**, i32 }
%struct.RemoteDevPrefix = type { i8*, i64 }
%struct._GPatternSpec = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }

@gExcludedFileSystems = internal global i8* null, align 8
@.str = private unnamed_addr constant [58 x i8] c"SyncDriver: Leave the excluded file system list as \22%s\22.\0A\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"(null)\00", align 1
@.str.2 = private unnamed_addr constant [44 x i8] c"SyncDriver: Excluding file system, name=%s\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"all\00", align 1
@.str.4 = private unnamed_addr constant [40 x i8] c"SyncDriver: No file systems to freeze.\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !33)
!1 = !DIFile(filename: "libSyncDriver_la-syncDriverPosix.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "syncDriverInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "SD_SUCCESS", value: 0)
!7 = !DIEnumerator(name: "SD_ERROR", value: 1)
!8 = !DIEnumerator(name: "SD_UNAVAILABLE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 45, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/syncDriver.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "SYNCDRIVER_IDLE", value: 0)
!13 = !DIEnumerator(name: "SYNCDRIVER_BUSY", value: 1)
!14 = !DIEnumerator(name: "SYNCDRIVER_ERROR", value: 2)
!15 = !{!16, !17, !26, !28, !29}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !19, line: 37, baseType: !20)
!19 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !19, line: 39, size: 128, align: 64, elements: !21)
!21 = !{!22, !25}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !19, line: 41, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !24, line: 77, baseType: !16)
!24 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !19, line: 42, baseType: !17, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !24, line: 87, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !23}
!33 = !{!34, !36, !47, !53, !65}
!34 = distinct !DIGlobalVariable(name: "gExcludedFileSystems", scope: !0, file: !35, line: 68, type: !26, isLocal: true, isDefinition: true, variable: i8** @gExcludedFileSystems)
!35 = !DIFile(filename: "syncDriverPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!36 = distinct !DIGlobalVariable(name: "gExcludedPathPatterns", scope: !0, file: !35, line: 71, type: !37, isLocal: true, isDefinition: true, variable: %struct._GPtrArray** @gExcludedPathPatterns)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !39, line: 39, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !39, line: 53, size: 128, align: 64, elements: !41)
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !40, file: !39, line: 55, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 56, baseType: !45, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !24, line: 55, baseType: !46)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = distinct !DIGlobalVariable(name: "gRemoteFSTypes", scope: !0, file: !35, line: 44, type: !48, isLocal: true, isDefinition: true, variable: [6 x i8*]* @gRemoteFSTypes)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 384, align: 64, elements: !51)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!51 = !{!52}
!52 = !DISubrange(count: 6)
!53 = distinct !DIGlobalVariable(name: "gRemoteDevPrefixes", scope: !0, file: !35, line: 60, type: !54, isLocal: true, isDefinition: true, variable: [2 x %struct.RemoteDevPrefix]* @gRemoteDevPrefixes)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 256, align: 64, elements: !63)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "RemoteDevPrefix", file: !35, line: 56, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 53, size: 128, align: 64, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !56, file: !35, line: 54, baseType: !49, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !56, file: !35, line: 55, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 216, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!62 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!63 = !{!64}
!64 = !DISubrange(count: 2)
!65 = distinct !DIGlobalVariable(name: "gBackends", scope: !0, file: !35, line: 36, type: !66, isLocal: true, isDefinition: true, variable: [3 x i32 (%struct._GSList*, %struct.SyncHandle**)*]* @gBackends)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 192, align: 64, elements: !96)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncFreezeFn", file: !4, line: 43, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !72, !74}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverErr", file: !4, line: 41, baseType: !3)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncDriverHandle", file: !10, line: 41, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SyncHandle", file: !4, line: 46, size: 192, align: 64, elements: !78)
!78 = !{!79, !84, !88}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "thaw", scope: !77, file: !4, line: 47, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!71, !83}
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !77, file: !4, line: 48, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !75}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !77, file: !4, line: 50, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !83, !92, !93}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !95, line: 230, baseType: !27)
!95 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!101 = distinct !DISubprogram(name: "SyncDriver_Init", scope: !35, file: !35, line: 201, type: !102, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{!94}
!104 = !{}
!105 = !DILocation(line: 203, column: 4, scope: !101)
!106 = distinct !DISubprogram(name: "SyncDriverFilterFS", scope: !35, file: !35, line: 359, type: !107, isLocal: false, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!107 = !DISubroutineType(types: !108)
!108 = !{!17, !17, !49}
!109 = !DILocalVariable(name: "pathlist", arg: 1, scope: !106, file: !35, line: 359, type: !17)
!110 = !DIExpression()
!111 = !DILocation(line: 359, column: 28, scope: !106)
!112 = !DILocalVariable(name: "excludedFS", arg: 2, scope: !106, file: !35, line: 360, type: !49)
!113 = !DILocation(line: 360, column: 32, scope: !106)
!114 = !DILocalVariable(name: "current", scope: !106, file: !35, line: 362, type: !17)
!115 = !DILocation(line: 362, column: 12, scope: !106)
!116 = !DILocation(line: 367, column: 18, scope: !117)
!117 = distinct !DILexicalBlock(scope: !106, file: !35, line: 367, column: 8)
!118 = !DILocation(line: 367, column: 30, scope: !117)
!119 = !DILocation(line: 367, column: 8, scope: !117)
!120 = !DILocation(line: 367, column: 52, scope: !117)
!121 = !DILocation(line: 367, column: 8, scope: !106)
!122 = !DILocation(line: 368, column: 34, scope: !123)
!123 = distinct !DILexicalBlock(scope: !117, file: !35, line: 367, column: 58)
!124 = !DILocation(line: 368, column: 7, scope: !123)
!125 = !DILocation(line: 369, column: 4, scope: !123)
!126 = !DILocation(line: 371, column: 11, scope: !127)
!127 = distinct !DILexicalBlock(scope: !117, file: !35, line: 369, column: 11)
!128 = !DILocation(line: 371, column: 22, scope: !127)
!129 = !DILocation(line: 371, column: 10, scope: !127)
!130 = !DILocation(line: 371, column: 32, scope: !131)
!131 = !DILexicalBlockFile(scope: !127, file: !35, discriminator: 1)
!132 = !DILocation(line: 371, column: 10, scope: !131)
!133 = !DILocation(line: 371, column: 10, scope: !134)
!134 = !DILexicalBlockFile(scope: !127, file: !35, discriminator: 2)
!135 = !DILocation(line: 371, column: 10, scope: !136)
!136 = !DILexicalBlockFile(scope: !127, file: !35, discriminator: 3)
!137 = !DILocation(line: 370, column: 7, scope: !127)
!138 = !DILocation(line: 377, column: 8, scope: !139)
!139 = distinct !DILexicalBlock(scope: !106, file: !35, line: 377, column: 8)
!140 = !DILocation(line: 377, column: 29, scope: !139)
!141 = !DILocation(line: 377, column: 8, scope: !106)
!142 = !DILocation(line: 378, column: 14, scope: !143)
!143 = distinct !DILexicalBlock(scope: !139, file: !35, line: 377, column: 37)
!144 = !DILocation(line: 378, column: 7, scope: !143)
!145 = !DILocation(line: 385, column: 14, scope: !106)
!146 = !DILocation(line: 385, column: 12, scope: !106)
!147 = !DILocation(line: 386, column: 4, scope: !106)
!148 = !DILocation(line: 386, column: 11, scope: !149)
!149 = !DILexicalBlockFile(scope: !106, file: !35, discriminator: 1)
!150 = !DILocation(line: 386, column: 19, scope: !149)
!151 = !DILocation(line: 386, column: 4, scope: !149)
!152 = !DILocalVariable(name: "next", scope: !153, file: !35, line: 387, type: !17)
!153 = distinct !DILexicalBlock(scope: !106, file: !35, line: 386, column: 27)
!154 = !DILocation(line: 387, column: 15, scope: !153)
!155 = !DILocation(line: 387, column: 24, scope: !153)
!156 = !DILocation(line: 387, column: 23, scope: !153)
!157 = !DILocation(line: 387, column: 48, scope: !158)
!158 = !DILexicalBlockFile(scope: !153, file: !35, discriminator: 1)
!159 = !DILocation(line: 387, column: 59, scope: !158)
!160 = !DILocation(line: 387, column: 23, scope: !158)
!161 = !DILocation(line: 387, column: 23, scope: !162)
!162 = !DILexicalBlockFile(scope: !153, file: !35, discriminator: 2)
!163 = !DILocation(line: 387, column: 23, scope: !164)
!164 = !DILexicalBlockFile(scope: !153, file: !35, discriminator: 3)
!165 = !DILocation(line: 387, column: 15, scope: !164)
!166 = !DILocalVariable(name: "path", scope: !153, file: !35, line: 388, type: !26)
!167 = !DILocation(line: 388, column: 13, scope: !153)
!168 = !DILocation(line: 388, column: 29, scope: !153)
!169 = !DILocation(line: 388, column: 38, scope: !153)
!170 = !DILocation(line: 390, column: 34, scope: !171)
!171 = distinct !DILexicalBlock(scope: !153, file: !35, line: 390, column: 11)
!172 = !DILocation(line: 390, column: 11, scope: !171)
!173 = !DILocation(line: 390, column: 11, scope: !153)
!174 = !DILocation(line: 391, column: 67, scope: !175)
!175 = distinct !DILexicalBlock(scope: !171, file: !35, line: 390, column: 41)
!176 = !DILocation(line: 391, column: 10, scope: !175)
!177 = !DILocation(line: 392, column: 41, scope: !175)
!178 = !DILocation(line: 392, column: 51, scope: !175)
!179 = !DILocation(line: 392, column: 21, scope: !175)
!180 = !DILocation(line: 392, column: 19, scope: !175)
!181 = !DILocation(line: 393, column: 15, scope: !175)
!182 = !DILocation(line: 393, column: 10, scope: !175)
!183 = !DILocation(line: 394, column: 7, scope: !175)
!184 = !DILocation(line: 395, column: 17, scope: !153)
!185 = !DILocation(line: 395, column: 15, scope: !153)
!186 = !DILocation(line: 386, column: 4, scope: !187)
!187 = !DILexicalBlockFile(scope: !106, file: !35, discriminator: 2)
!188 = distinct !{!188, !147}
!189 = !DILocation(line: 398, column: 11, scope: !106)
!190 = !DILocation(line: 398, column: 4, scope: !106)
!191 = !DILocation(line: 399, column: 1, scope: !106)
!192 = distinct !DISubprogram(name: "SyncDriverUpdateExcludedFS", scope: !35, file: !35, line: 247, type: !193, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !49}
!195 = !DILocalVariable(name: "excludedFS", arg: 1, scope: !192, file: !35, line: 247, type: !49)
!196 = !DILocation(line: 247, column: 40, scope: !192)
!197 = !DILocalVariable(name: "patterns", scope: !192, file: !35, line: 249, type: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !24, line: 46, baseType: !27)
!201 = !DILocation(line: 249, column: 12, scope: !192)
!202 = !DILocalVariable(name: "i", scope: !192, file: !35, line: 250, type: !28)
!203 = !DILocation(line: 250, column: 8, scope: !192)
!204 = !DILocation(line: 261, column: 8, scope: !205)
!205 = distinct !DILexicalBlock(scope: !192, file: !35, line: 261, column: 8)
!206 = !DILocation(line: 261, column: 30, scope: !205)
!207 = !DILocation(line: 261, column: 8, scope: !192)
!208 = !DILocation(line: 266, column: 14, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !35, line: 261, column: 38)
!210 = !DILocation(line: 266, column: 7, scope: !209)
!211 = !DILocation(line: 267, column: 24, scope: !209)
!212 = !DILocation(line: 267, column: 7, scope: !209)
!213 = !DILocation(line: 268, column: 4, scope: !209)
!214 = !DILocation(line: 270, column: 8, scope: !215)
!215 = distinct !DILexicalBlock(scope: !192, file: !35, line: 270, column: 8)
!216 = !DILocation(line: 270, column: 19, scope: !215)
!217 = !DILocation(line: 270, column: 8, scope: !192)
!218 = !DILocation(line: 271, column: 7, scope: !219)
!219 = distinct !DILexicalBlock(scope: !215, file: !35, line: 270, column: 27)
!220 = !DILocation(line: 272, column: 28, scope: !219)
!221 = !DILocation(line: 273, column: 29, scope: !219)
!222 = !DILocation(line: 274, column: 7, scope: !219)
!223 = !DILocation(line: 277, column: 75, scope: !192)
!224 = !DILocation(line: 277, column: 4, scope: !192)
!225 = !DILocation(line: 279, column: 36, scope: !192)
!226 = !DILocation(line: 279, column: 27, scope: !192)
!227 = !DILocation(line: 279, column: 25, scope: !192)
!228 = !DILocation(line: 281, column: 10, scope: !192)
!229 = !DILocation(line: 280, column: 26, scope: !192)
!230 = !DILocation(line: 283, column: 26, scope: !192)
!231 = !DILocation(line: 283, column: 15, scope: !192)
!232 = !DILocation(line: 283, column: 13, scope: !192)
!233 = !DILocation(line: 285, column: 11, scope: !234)
!234 = distinct !DILexicalBlock(scope: !192, file: !35, line: 285, column: 4)
!235 = !DILocation(line: 285, column: 9, scope: !234)
!236 = !DILocation(line: 285, column: 25, scope: !237)
!237 = !DILexicalBlockFile(scope: !238, file: !35, discriminator: 1)
!238 = distinct !DILexicalBlock(scope: !234, file: !35, line: 285, column: 4)
!239 = !DILocation(line: 285, column: 16, scope: !237)
!240 = !DILocation(line: 285, column: 28, scope: !237)
!241 = !DILocation(line: 285, column: 4, scope: !237)
!242 = !DILocation(line: 286, column: 20, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !35, line: 286, column: 11)
!244 = distinct !DILexicalBlock(scope: !238, file: !35, line: 285, column: 41)
!245 = !DILocation(line: 286, column: 11, scope: !243)
!246 = !DILocation(line: 286, column: 26, scope: !243)
!247 = !DILocation(line: 286, column: 11, scope: !244)
!248 = !DILocation(line: 287, column: 26, scope: !249)
!249 = distinct !DILexicalBlock(scope: !243, file: !35, line: 286, column: 35)
!250 = !DILocation(line: 288, column: 54, scope: !249)
!251 = !DILocation(line: 288, column: 45, scope: !249)
!252 = !DILocation(line: 288, column: 26, scope: !249)
!253 = !DILocation(line: 287, column: 10, scope: !249)
!254 = !DILocation(line: 289, column: 7, scope: !249)
!255 = !DILocation(line: 290, column: 4, scope: !244)
!256 = !DILocation(line: 285, column: 36, scope: !257)
!257 = !DILexicalBlockFile(scope: !238, file: !35, discriminator: 2)
!258 = !DILocation(line: 285, column: 4, scope: !257)
!259 = distinct !{!259, !260}
!260 = !DILocation(line: 285, column: 4, scope: !192)
!261 = !DILocation(line: 292, column: 15, scope: !192)
!262 = !DILocation(line: 292, column: 4, scope: !192)
!263 = !DILocation(line: 293, column: 1, scope: !192)
!264 = !DILocation(line: 293, column: 1, scope: !265)
!265 = !DILexicalBlockFile(scope: !192, file: !35, discriminator: 1)
!266 = distinct !DISubprogram(name: "SyncDriverIsExcludedFS", scope: !35, file: !35, line: 318, type: !267, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!267 = !DISubroutineType(types: !268)
!268 = !{!94, !49}
!269 = !DILocalVariable(name: "path", arg: 1, scope: !266, file: !35, line: 318, type: !49)
!270 = !DILocation(line: 318, column: 36, scope: !266)
!271 = !DILocalVariable(name: "i", scope: !266, file: !35, line: 320, type: !28)
!272 = !DILocation(line: 320, column: 8, scope: !266)
!273 = !DILocation(line: 325, column: 11, scope: !274)
!274 = distinct !DILexicalBlock(scope: !266, file: !35, line: 325, column: 4)
!275 = !DILocation(line: 325, column: 9, scope: !274)
!276 = !DILocation(line: 325, column: 16, scope: !277)
!277 = !DILexicalBlockFile(scope: !278, file: !35, discriminator: 1)
!278 = distinct !DILexicalBlock(scope: !274, file: !35, line: 325, column: 4)
!279 = !DILocation(line: 325, column: 20, scope: !277)
!280 = !DILocation(line: 325, column: 43, scope: !277)
!281 = !DILocation(line: 325, column: 18, scope: !277)
!282 = !DILocation(line: 325, column: 4, scope: !277)
!283 = !DILocation(line: 326, column: 67, scope: !284)
!284 = distinct !DILexicalBlock(scope: !285, file: !35, line: 326, column: 11)
!285 = distinct !DILexicalBlock(scope: !278, file: !35, line: 325, column: 53)
!286 = !DILocation(line: 326, column: 34, scope: !284)
!287 = !DILocation(line: 326, column: 36, scope: !284)
!288 = !DILocation(line: 326, column: 60, scope: !284)
!289 = !DILocation(line: 327, column: 34, scope: !284)
!290 = !DILocation(line: 326, column: 11, scope: !284)
!291 = !DILocation(line: 326, column: 11, scope: !285)
!292 = !DILocation(line: 328, column: 10, scope: !293)
!293 = distinct !DILexicalBlock(scope: !284, file: !35, line: 327, column: 41)
!294 = !DILocation(line: 330, column: 4, scope: !285)
!295 = !DILocation(line: 325, column: 48, scope: !296)
!296 = !DILexicalBlockFile(scope: !278, file: !35, discriminator: 2)
!297 = !DILocation(line: 325, column: 4, scope: !296)
!298 = distinct !{!298, !299}
!299 = !DILocation(line: 325, column: 4, scope: !266)
!300 = !DILocation(line: 331, column: 4, scope: !266)
!301 = !DILocation(line: 332, column: 1, scope: !266)
!302 = distinct !DISubprogram(name: "SyncDriver_Freeze", scope: !35, file: !35, line: 434, type: !303, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!303 = !DISubroutineType(types: !304)
!304 = !{!94, !49, !94, !74, !49}
!305 = !DILocalVariable(name: "userPaths", arg: 1, scope: !302, file: !35, line: 434, type: !49)
!306 = !DILocation(line: 434, column: 31, scope: !302)
!307 = !DILocalVariable(name: "enableNullDriver", arg: 2, scope: !302, file: !35, line: 435, type: !94)
!308 = !DILocation(line: 435, column: 24, scope: !302)
!309 = !DILocalVariable(name: "handle", arg: 3, scope: !302, file: !35, line: 436, type: !74)
!310 = !DILocation(line: 436, column: 37, scope: !302)
!311 = !DILocalVariable(name: "excludedFileSystems", arg: 4, scope: !302, file: !35, line: 437, type: !49)
!312 = !DILocation(line: 437, column: 31, scope: !302)
!313 = !DILocalVariable(name: "paths", scope: !302, file: !35, line: 439, type: !17)
!314 = !DILocation(line: 439, column: 12, scope: !302)
!315 = !DILocalVariable(name: "err", scope: !302, file: !35, line: 440, type: !71)
!316 = !DILocation(line: 440, column: 18, scope: !302)
!317 = !DILocalVariable(name: "i", scope: !302, file: !35, line: 441, type: !60)
!318 = !DILocation(line: 441, column: 11, scope: !302)
!319 = !DILocation(line: 449, column: 8, scope: !320)
!320 = distinct !DILexicalBlock(scope: !302, file: !35, line: 449, column: 8)
!321 = !DILocation(line: 449, column: 18, scope: !320)
!322 = !DILocation(line: 449, column: 25, scope: !320)
!323 = !DILocation(line: 450, column: 16, scope: !320)
!324 = !DILocation(line: 450, column: 8, scope: !320)
!325 = !DILocation(line: 450, column: 48, scope: !320)
!326 = !DILocation(line: 450, column: 53, scope: !320)
!327 = !DILocation(line: 451, column: 8, scope: !320)
!328 = !DILocation(line: 451, column: 21, scope: !320)
!329 = !DILocation(line: 449, column: 8, scope: !330)
!330 = !DILexicalBlockFile(scope: !302, file: !35, discriminator: 1)
!331 = !DILocation(line: 452, column: 15, scope: !332)
!332 = distinct !DILexicalBlock(scope: !320, file: !35, line: 451, column: 29)
!333 = !DILocation(line: 452, column: 13, scope: !332)
!334 = !DILocation(line: 453, column: 4, scope: !332)
!335 = !DILocation(line: 457, column: 7, scope: !336)
!336 = distinct !DILexicalBlock(scope: !320, file: !35, line: 453, column: 11)
!337 = !DILocation(line: 457, column: 15, scope: !338)
!338 = !DILexicalBlockFile(scope: !336, file: !35, discriminator: 1)
!339 = !DILocation(line: 457, column: 14, scope: !338)
!340 = !DILocation(line: 457, column: 25, scope: !338)
!341 = !DILocation(line: 457, column: 7, scope: !338)
!342 = !DILocalVariable(name: "c", scope: !343, file: !35, line: 458, type: !49)
!343 = distinct !DILexicalBlock(scope: !336, file: !35, line: 457, column: 34)
!344 = !DILocation(line: 458, column: 22, scope: !343)
!345 = !DILocalVariable(name: "path", scope: !343, file: !35, line: 459, type: !26)
!346 = !DILocation(line: 459, column: 16, scope: !343)
!347 = !DILocation(line: 461, column: 15, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !35, line: 461, column: 14)
!349 = !DILocation(line: 461, column: 14, scope: !348)
!350 = !DILocation(line: 461, column: 25, scope: !348)
!351 = !DILocation(line: 461, column: 14, scope: !343)
!352 = !DILocation(line: 465, column: 22, scope: !353)
!353 = distinct !DILexicalBlock(scope: !348, file: !35, line: 461, column: 33)
!354 = !DILocation(line: 466, column: 13, scope: !353)
!355 = distinct !{!355, !335}
!356 = !DILocation(line: 469, column: 21, scope: !343)
!357 = !DILocation(line: 469, column: 14, scope: !343)
!358 = !DILocation(line: 469, column: 12, scope: !343)
!359 = !DILocation(line: 470, column: 14, scope: !360)
!360 = distinct !DILexicalBlock(scope: !343, file: !35, line: 470, column: 14)
!361 = !DILocation(line: 470, column: 16, scope: !360)
!362 = !DILocation(line: 470, column: 14, scope: !343)
!363 = !DILocation(line: 471, column: 37, scope: !364)
!364 = distinct !DILexicalBlock(scope: !360, file: !35, line: 470, column: 24)
!365 = !DILocation(line: 471, column: 20, scope: !364)
!366 = !DILocation(line: 471, column: 18, scope: !364)
!367 = !DILocation(line: 472, column: 36, scope: !364)
!368 = !DILocation(line: 472, column: 43, scope: !364)
!369 = !DILocation(line: 472, column: 21, scope: !364)
!370 = !DILocation(line: 472, column: 19, scope: !364)
!371 = !DILocation(line: 473, column: 13, scope: !364)
!372 = !DILocation(line: 475, column: 38, scope: !373)
!373 = distinct !DILexicalBlock(scope: !360, file: !35, line: 474, column: 17)
!374 = !DILocation(line: 475, column: 51, scope: !373)
!375 = !DILocation(line: 475, column: 55, scope: !373)
!376 = !DILocation(line: 475, column: 53, scope: !373)
!377 = !DILocation(line: 475, column: 20, scope: !373)
!378 = !DILocation(line: 475, column: 18, scope: !373)
!379 = !DILocation(line: 476, column: 36, scope: !373)
!380 = !DILocation(line: 476, column: 43, scope: !373)
!381 = !DILocation(line: 476, column: 21, scope: !373)
!382 = !DILocation(line: 476, column: 19, scope: !373)
!383 = !DILocation(line: 477, column: 25, scope: !373)
!384 = !DILocation(line: 477, column: 23, scope: !373)
!385 = !DILocation(line: 457, column: 7, scope: !386)
!386 = !DILexicalBlockFile(scope: !336, file: !35, discriminator: 2)
!387 = !DILocation(line: 482, column: 31, scope: !302)
!388 = !DILocation(line: 482, column: 38, scope: !302)
!389 = !DILocation(line: 482, column: 12, scope: !302)
!390 = !DILocation(line: 482, column: 10, scope: !302)
!391 = !DILocation(line: 483, column: 8, scope: !392)
!392 = distinct !DILexicalBlock(scope: !302, file: !35, line: 483, column: 8)
!393 = !DILocation(line: 483, column: 14, scope: !392)
!394 = !DILocation(line: 483, column: 8, scope: !302)
!395 = !DILocation(line: 484, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !35, line: 483, column: 22)
!397 = !DILocation(line: 485, column: 7, scope: !396)
!398 = !DILocation(line: 488, column: 4, scope: !302)
!399 = !DILocation(line: 488, column: 11, scope: !330)
!400 = !DILocation(line: 488, column: 15, scope: !330)
!401 = !DILocation(line: 488, column: 33, scope: !330)
!402 = !DILocation(line: 488, column: 36, scope: !403)
!403 = !DILexicalBlockFile(scope: !302, file: !35, discriminator: 2)
!404 = !DILocation(line: 488, column: 38, scope: !403)
!405 = !DILocation(line: 488, column: 4, scope: !406)
!406 = !DILexicalBlockFile(scope: !302, file: !35, discriminator: 3)
!407 = !DILocalVariable(name: "freezeFn", scope: !408, file: !35, line: 489, type: !67)
!408 = distinct !DILexicalBlock(scope: !302, file: !35, line: 488, column: 84)
!409 = !DILocation(line: 489, column: 20, scope: !408)
!410 = !DILocation(line: 489, column: 41, scope: !408)
!411 = !DILocation(line: 489, column: 31, scope: !408)
!412 = !DILocation(line: 490, column: 59, scope: !408)
!413 = !DILocation(line: 490, column: 53, scope: !408)
!414 = !DILocation(line: 490, column: 7, scope: !408)
!415 = !DILocation(line: 491, column: 8, scope: !408)
!416 = !DILocation(line: 493, column: 12, scope: !417)
!417 = distinct !DILexicalBlock(scope: !408, file: !35, line: 493, column: 11)
!418 = !DILocation(line: 493, column: 29, scope: !417)
!419 = !DILocation(line: 493, column: 33, scope: !420)
!420 = !DILexicalBlockFile(scope: !417, file: !35, discriminator: 1)
!421 = !DILocation(line: 493, column: 42, scope: !420)
!422 = !DILocation(line: 493, column: 11, scope: !420)
!423 = !DILocation(line: 494, column: 10, scope: !424)
!424 = distinct !DILexicalBlock(scope: !417, file: !35, line: 493, column: 65)
!425 = !DILocation(line: 495, column: 10, scope: !424)
!426 = distinct !{!426, !398}
!427 = !DILocation(line: 498, column: 13, scope: !408)
!428 = !DILocation(line: 498, column: 22, scope: !408)
!429 = !DILocation(line: 498, column: 29, scope: !408)
!430 = !DILocation(line: 498, column: 11, scope: !408)
!431 = !DILocation(line: 488, column: 4, scope: !432)
!432 = !DILexicalBlockFile(scope: !302, file: !35, discriminator: 4)
!433 = !DILocation(line: 504, column: 20, scope: !302)
!434 = !DILocation(line: 504, column: 4, scope: !302)
!435 = !DILocation(line: 505, column: 17, scope: !302)
!436 = !DILocation(line: 505, column: 4, scope: !302)
!437 = !DILocation(line: 507, column: 11, scope: !302)
!438 = !DILocation(line: 507, column: 15, scope: !302)
!439 = !DILocation(line: 507, column: 4, scope: !302)
!440 = !DILocation(line: 508, column: 1, scope: !302)
!441 = distinct !DISubprogram(name: "SyncDriverLocalMounts", scope: !35, file: !35, line: 140, type: !442, isLocal: true, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!442 = !DISubroutineType(types: !443)
!443 = !{!17}
!444 = !DILocalVariable(name: "paths", scope: !441, file: !35, line: 142, type: !17)
!445 = !DILocation(line: 142, column: 12, scope: !441)
!446 = !DILocalVariable(name: "mounts", scope: !441, file: !35, line: 143, type: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !449, line: 48, baseType: !450)
!449 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !451, line: 241, size: 1728, align: 64, elements: !452)
!451 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !473, !474, !475, !476, !480, !482, !484, !488, !491, !493, !494, !495, !496, !497, !498, !499}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !450, file: !451, line: 242, baseType: !28, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !450, file: !451, line: 247, baseType: !26, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !450, file: !451, line: 248, baseType: !26, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !450, file: !451, line: 249, baseType: !26, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !450, file: !451, line: 250, baseType: !26, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !450, file: !451, line: 251, baseType: !26, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !450, file: !451, line: 252, baseType: !26, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !450, file: !451, line: 253, baseType: !26, size: 64, align: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !450, file: !451, line: 254, baseType: !26, size: 64, align: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !450, file: !451, line: 256, baseType: !26, size: 64, align: 64, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !450, file: !451, line: 257, baseType: !26, size: 64, align: 64, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !450, file: !451, line: 258, baseType: !26, size: 64, align: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !450, file: !451, line: 260, baseType: !466, size: 64, align: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !451, line: 156, size: 192, align: 64, elements: !468)
!468 = !{!469, !470, !472}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !467, file: !451, line: 157, baseType: !466, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !467, file: !451, line: 158, baseType: !471, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !467, file: !451, line: 162, baseType: !28, size: 32, align: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !450, file: !451, line: 262, baseType: !471, size: 64, align: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !450, file: !451, line: 264, baseType: !28, size: 32, align: 32, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !450, file: !451, line: 268, baseType: !28, size: 32, align: 32, offset: 928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !450, file: !451, line: 270, baseType: !477, size: 64, align: 64, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !478, line: 131, baseType: !479)
!478 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!479 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !450, file: !451, line: 274, baseType: !481, size: 16, align: 16, offset: 1024)
!481 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !450, file: !451, line: 275, baseType: !483, size: 8, align: 8, offset: 1040)
!483 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !450, file: !451, line: 276, baseType: !485, size: 8, align: 8, offset: 1048)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 1)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !450, file: !451, line: 280, baseType: !489, size: 64, align: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !451, line: 150, baseType: null)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !450, file: !451, line: 289, baseType: !492, size: 64, align: 64, offset: 1152)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !478, line: 132, baseType: !479)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !450, file: !451, line: 297, baseType: !16, size: 64, align: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !450, file: !451, line: 298, baseType: !16, size: 64, align: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !450, file: !451, line: 299, baseType: !16, size: 64, align: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !450, file: !451, line: 300, baseType: !16, size: 64, align: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !450, file: !451, line: 302, baseType: !60, size: 64, align: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !450, file: !451, line: 303, baseType: !28, size: 32, align: 32, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !450, file: !451, line: 305, baseType: !500, size: 160, align: 8, offset: 1568)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, align: 8, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 20)
!503 = !DILocation(line: 143, column: 11, scope: !441)
!504 = !DILocalVariable(name: "mntinfo", scope: !441, file: !35, line: 144, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mntent", file: !507, line: 53, size: 320, align: 64, elements: !508)
!507 = !DIFile(filename: "/usr/include/mntent.h", directory: "/home/lichi/Desktop/open-vm-tools/line962")
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_fsname", scope: !506, file: !507, line: 55, baseType: !26, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_dir", scope: !506, file: !507, line: 56, baseType: !26, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_type", scope: !506, file: !507, line: 57, baseType: !26, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_opts", scope: !506, file: !507, line: 58, baseType: !26, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_freq", scope: !506, file: !507, line: 59, baseType: !28, size: 32, align: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_passno", scope: !506, file: !507, line: 60, baseType: !28, size: 32, align: 32, offset: 288)
!515 = !DILocation(line: 144, column: 19, scope: !441)
!516 = !DILocation(line: 146, column: 18, scope: !517)
!517 = distinct !DILexicalBlock(scope: !441, file: !35, line: 146, column: 8)
!518 = !DILocation(line: 146, column: 16, scope: !517)
!519 = !DILocation(line: 146, column: 25, scope: !517)
!520 = !DILocation(line: 146, column: 8, scope: !441)
!521 = !DILocation(line: 147, column: 7, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !35, line: 146, column: 45)
!523 = !DILocation(line: 148, column: 7, scope: !522)
!524 = !DILocation(line: 151, column: 4, scope: !441)
!525 = !DILocation(line: 151, column: 39, scope: !526)
!526 = !DILexicalBlockFile(scope: !441, file: !35, discriminator: 1)
!527 = !DILocation(line: 151, column: 23, scope: !526)
!528 = !DILocation(line: 151, column: 21, scope: !526)
!529 = !DILocation(line: 151, column: 48, scope: !526)
!530 = !DILocation(line: 151, column: 4, scope: !526)
!531 = !DILocalVariable(name: "path", scope: !532, file: !35, line: 152, type: !26)
!532 = distinct !DILexicalBlock(scope: !441, file: !35, line: 151, column: 13)
!533 = !DILocation(line: 152, column: 13, scope: !532)
!534 = !DILocation(line: 157, column: 32, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !35, line: 157, column: 11)
!536 = !DILocation(line: 157, column: 11, scope: !535)
!537 = !DILocation(line: 157, column: 11, scope: !532)
!538 = !DILocation(line: 159, column: 16, scope: !539)
!539 = distinct !DILexicalBlock(scope: !535, file: !35, line: 157, column: 42)
!540 = !DILocation(line: 159, column: 25, scope: !539)
!541 = !DILocation(line: 159, column: 37, scope: !539)
!542 = !DILocation(line: 159, column: 46, scope: !539)
!543 = !DILocation(line: 158, column: 10, scope: !539)
!544 = !DILocation(line: 160, column: 10, scope: !539)
!545 = distinct !{!545, !524}
!546 = !DILocation(line: 163, column: 31, scope: !532)
!547 = !DILocation(line: 163, column: 40, scope: !532)
!548 = !DILocation(line: 163, column: 14, scope: !532)
!549 = !DILocation(line: 163, column: 12, scope: !532)
!550 = !DILocation(line: 175, column: 31, scope: !532)
!551 = !DILocation(line: 175, column: 38, scope: !532)
!552 = !DILocation(line: 175, column: 15, scope: !532)
!553 = !DILocation(line: 175, column: 13, scope: !532)
!554 = !DILocation(line: 151, column: 4, scope: !555)
!555 = !DILexicalBlockFile(scope: !441, file: !35, discriminator: 2)
!556 = !DILocation(line: 178, column: 22, scope: !441)
!557 = !DILocation(line: 178, column: 12, scope: !441)
!558 = !DILocation(line: 178, column: 30, scope: !441)
!559 = !DILocation(line: 179, column: 11, scope: !441)
!560 = !DILocation(line: 179, column: 4, scope: !441)
!561 = !DILocation(line: 180, column: 1, scope: !441)
!562 = distinct !DISubprogram(name: "SyncDriverFreePath", scope: !35, file: !35, line: 224, type: !563, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !23, !23}
!565 = !DILocalVariable(name: "data", arg: 1, scope: !562, file: !35, line: 224, type: !23)
!566 = !DILocation(line: 224, column: 29, scope: !562)
!567 = !DILocalVariable(name: "userData", arg: 2, scope: !562, file: !35, line: 224, type: !23)
!568 = !DILocation(line: 224, column: 44, scope: !562)
!569 = !DILocation(line: 226, column: 9, scope: !562)
!570 = !DILocation(line: 226, column: 4, scope: !562)
!571 = !DILocation(line: 227, column: 1, scope: !562)
!572 = distinct !DISubprogram(name: "SyncDriver_Thaw", scope: !35, file: !35, line: 529, type: !573, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !104)
!573 = !DISubroutineType(types: !574)
!574 = !{!94, !83}
!575 = !DILocalVariable(name: "handle", arg: 1, scope: !572, file: !35, line: 529, type: !83)
