; ModuleID = './libresolutionCommon_la-resolutionCommon.o.i'
source_filename = "./libresolutionCommon_la-resolutionCommon.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Drm2Interface = type { i32 (i8*, i8*)*, i32 (i32)*, %struct._drmVersion* (i32)*, void (%struct._drmVersion*)*, i32 (i32)*, i32 (i32, i64, i8*, i64)* }
%struct._drmVersion = type { i32, i32, i32, i32, i8*, i32, i8*, i32, i8* }
%struct.Udev1Interface = type { i8* (%struct.udev_device*)*, %struct.udev_device* (%struct.udev_device*, i8*, i8*)*, i8* (%struct.udev_device*, i8*)*, %struct.udev_device* (%struct.udev*, i8*)*, %struct.udev_device* (%struct.udev_device*)*, i32 (%struct.udev_enumerate*, i8*, i8*)*, i32 (%struct.udev_enumerate*, i8*)*, %struct.udev_list_entry* (%struct.udev_enumerate*)*, %struct.udev_enumerate* (%struct.udev*)*, i32 (%struct.udev_enumerate*)*, %struct.udev_enumerate* (%struct.udev_enumerate*)*, i8* (%struct.udev_list_entry*)*, %struct.udev_list_entry* (%struct.udev_list_entry*)*, %struct.udev* ()*, %struct.udev* (%struct.udev*)* }
%struct.udev_device = type opaque
%struct.udev = type opaque
%struct.udev_enumerate = type opaque
%struct.udev_list_entry = type opaque
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, globals: !21)
!1 = !DIFile(filename: "libresolutionCommon_la-resolutionCommon.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!2 = !{!3, !7}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 51, size: 32, align: 32, elements: !9)
!8 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!9 = !{!10, !11, !12, !13, !14, !15, !16, !17, !18}
!10 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!11 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!15 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!16 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!17 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !{!22, !26}
!22 = distinct !DIGlobalVariable(name: "numDriverNames", scope: !0, file: !23, line: 63, type: !24, isLocal: true, isDefinition: true, variable: i32 2)
!23 = !DIFile(filename: "resolutionCommon.c", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = distinct !DIGlobalVariable(name: "driverNames", scope: !0, file: !23, line: 58, type: !27, isLocal: true, isDefinition: true, variable: [2 x i8*]* @driverNames)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, align: 64, elements: !31)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!36 = distinct !DISubprogram(name: "resolutionCheckForKMS", scope: !23, file: !23, line: 288, type: !37, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!37 = !DISubroutineType(types: !38)
!38 = !{!25, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !42)
!42 = !{!43, !45, !50, !53, !54, !59, !64, !69, !70, !71, !73}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !41, file: !4, line: 243, baseType: !44, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !4, line: 245, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !49, line: 46, baseType: !30)
!49 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !41, file: !4, line: 247, baseType: !51, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !49, line: 50, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !49, line: 49, baseType: !25)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !41, file: !4, line: 249, baseType: !25, size: 32, align: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !41, file: !4, line: 251, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !57, line: 56, baseType: !58)
!57 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !57, line: 56, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !41, file: !4, line: 253, baseType: !60, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !62, line: 48, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !41, file: !4, line: 255, baseType: !65, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !67, line: 48, baseType: !68)
!67 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !67, line: 48, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !41, file: !4, line: 261, baseType: !25, size: 32, align: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !41, file: !4, line: 263, baseType: !25, size: 32, align: 32, offset: 416)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !41, file: !4, line: 265, baseType: !72, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !41, file: !4, line: 273, baseType: !74, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !49, line: 77, baseType: !20)
!75 = !{}
!76 = !DILocalVariable(name: "ctx", arg: 1, scope: !36, file: !23, line: 288, type: !39)
!77 = !DIExpression()
!78 = !DILocation(line: 288, column: 36, scope: !36)
!79 = !DILocalVariable(name: "err", scope: !36, file: !23, line: 291, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !82, line: 42, baseType: !83)
!82 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !82, line: 44, size: 128, align: 64, elements: !84)
!84 = !{!85, !91, !92}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !83, file: !82, line: 46, baseType: !86, size: 32, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !87, line: 36, baseType: !88)
!87 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !89, line: 45, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!90 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !83, file: !82, line: 47, baseType: !52, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !83, file: !82, line: 48, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!94 = !DILocation(line: 291, column: 13, scope: !36)
!95 = !DILocalVariable(name: "doResolutionKMS", scope: !36, file: !23, line: 292, type: !51)
!96 = !DILocation(line: 292, column: 14, scope: !36)
!97 = !DILocalVariable(name: "fd", scope: !36, file: !23, line: 293, type: !25)
!98 = !DILocation(line: 293, column: 9, scope: !36)
!99 = !DILocation(line: 295, column: 46, scope: !36)
!100 = !DILocation(line: 295, column: 51, scope: !36)
!101 = !DILocation(line: 295, column: 23, scope: !36)
!102 = !DILocation(line: 295, column: 21, scope: !36)
!103 = !DILocation(line: 297, column: 9, scope: !104)
!104 = distinct !DILexicalBlock(scope: !36, file: !23, line: 297, column: 9)
!105 = !DILocation(line: 297, column: 9, scope: !36)
!106 = !DILocalVariable(name: "major", scope: !107, file: !23, line: 303, type: !25)
!107 = distinct !DILexicalBlock(scope: !104, file: !23, line: 297, column: 14)
!108 = !DILocation(line: 303, column: 6, scope: !107)
!109 = !DILocalVariable(name: "minor", scope: !107, file: !23, line: 303, type: !25)
!110 = !DILocation(line: 303, column: 13, scope: !107)
!111 = !DILocalVariable(name: "level", scope: !107, file: !23, line: 303, type: !25)
!112 = !DILocation(line: 303, column: 20, scope: !107)
!113 = !DILocation(line: 304, column: 2, scope: !107)
!114 = !DILocation(line: 305, column: 18, scope: !107)
!115 = !DILocation(line: 306, column: 7, scope: !116)
!116 = distinct !DILexicalBlock(scope: !107, file: !23, line: 306, column: 6)
!117 = !DILocation(line: 308, column: 23, scope: !116)
!118 = !DILocation(line: 309, column: 7, scope: !116)
!119 = !DILocation(line: 309, column: 13, scope: !116)
!120 = !DILocation(line: 309, column: 18, scope: !116)
!121 = !DILocation(line: 310, column: 8, scope: !116)
!122 = !DILocation(line: 310, column: 14, scope: !116)
!123 = !DILocation(line: 310, column: 20, scope: !116)
!124 = !DILocation(line: 311, column: 8, scope: !116)
!125 = !DILocation(line: 311, column: 14, scope: !116)
!126 = !DILocation(line: 306, column: 6, scope: !127)
!127 = !DILexicalBlockFile(scope: !107, file: !23, discriminator: 1)
!128 = !DILocation(line: 312, column: 22, scope: !129)
!129 = distinct !DILexicalBlock(scope: !116, file: !23, line: 311, column: 22)
!130 = !DILocation(line: 313, column: 6, scope: !129)
!131 = !DILocation(line: 315, column: 2, scope: !129)
!132 = !DILocation(line: 316, column: 6, scope: !133)
!133 = distinct !DILexicalBlock(scope: !116, file: !23, line: 315, column: 9)
!134 = !DILocation(line: 318, column: 22, scope: !133)
!135 = !DILocation(line: 320, column: 5, scope: !107)
!136 = !DILocation(line: 321, column: 116, scope: !137)
!137 = distinct !DILexicalBlock(scope: !104, file: !23, line: 320, column: 12)
!138 = !DILocation(line: 321, column: 115, scope: !137)
!139 = !DILocation(line: 321, column: 2, scope: !137)
!140 = !DILocation(line: 325, column: 10, scope: !141)
!141 = distinct !DILexicalBlock(scope: !36, file: !23, line: 325, column: 9)
!142 = !DILocation(line: 325, column: 9, scope: !36)
!143 = !DILocation(line: 326, column: 2, scope: !141)
!144 = !DILocation(line: 328, column: 9, scope: !145)
!145 = distinct !DILexicalBlock(scope: !36, file: !23, line: 328, column: 9)
!146 = !DILocation(line: 328, column: 9, scope: !36)
!147 = !DILocation(line: 329, column: 2, scope: !148)
!148 = distinct !DILexicalBlock(scope: !145, file: !23, line: 328, column: 29)
!149 = !DILocation(line: 331, column: 2, scope: !148)
!150 = !DILocation(line: 333, column: 2, scope: !151)
!151 = distinct !DILexicalBlock(scope: !145, file: !23, line: 332, column: 12)
!152 = !DILocation(line: 336, column: 10, scope: !36)
!153 = !DILocation(line: 336, column: 8, scope: !36)
!154 = !DILocation(line: 338, column: 9, scope: !155)
!155 = distinct !DILexicalBlock(scope: !36, file: !23, line: 338, column: 9)
!156 = !DILocation(line: 338, column: 12, scope: !155)
!157 = !DILocation(line: 338, column: 9, scope: !36)
!158 = !DILocation(line: 339, column: 2, scope: !155)
!159 = !DILocation(line: 341, column: 2, scope: !155)
!160 = !DILocation(line: 344, column: 12, scope: !36)
!161 = !DILocation(line: 344, column: 5, scope: !36)
!162 = !DILocation(line: 345, column: 1, scope: !36)
!163 = distinct !DISubprogram(name: "resolutionXorgDriverVersion", scope: !23, file: !23, line: 391, type: !164, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!164 = !DISubroutineType(types: !165)
!165 = !{!25, !25, !72, !28, !166, !166, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!167 = !DILocalVariable(name: "numPaths", arg: 1, scope: !163, file: !23, line: 391, type: !25)
!168 = !DILocation(line: 391, column: 33, scope: !163)
!169 = !DILocalVariable(name: "paths", arg: 2, scope: !163, file: !23, line: 393, type: !72)
!170 = !DILocation(line: 393, column: 20, scope: !163)
!171 = !DILocalVariable(name: "versionString", arg: 3, scope: !163, file: !23, line: 395, type: !28)
!172 = !DILocation(line: 395, column: 19, scope: !163)
!173 = !DILocalVariable(name: "major", arg: 4, scope: !163, file: !23, line: 396, type: !166)
!174 = !DILocation(line: 396, column: 13, scope: !163)
!175 = !DILocalVariable(name: "minor", arg: 5, scope: !163, file: !23, line: 397, type: !166)
!176 = !DILocation(line: 397, column: 13, scope: !163)
!177 = !DILocalVariable(name: "level", arg: 6, scope: !163, file: !23, line: 398, type: !166)
!178 = !DILocation(line: 398, column: 13, scope: !163)
!179 = !DILocalVariable(name: "driver", scope: !163, file: !23, line: 401, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !182, line: 48, baseType: !183)
!182 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !184, line: 241, size: 1728, align: 64, elements: !185)
!184 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!185 = !{!186, !187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !207, !208, !209, !210, !214, !216, !218, !222, !225, !227, !228, !229, !230, !231, !235, !236}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !183, file: !184, line: 242, baseType: !25, size: 32, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !183, file: !184, line: 247, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !183, file: !184, line: 248, baseType: !188, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !183, file: !184, line: 249, baseType: !188, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !183, file: !184, line: 250, baseType: !188, size: 64, align: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !183, file: !184, line: 251, baseType: !188, size: 64, align: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !183, file: !184, line: 252, baseType: !188, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !183, file: !184, line: 253, baseType: !188, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !183, file: !184, line: 254, baseType: !188, size: 64, align: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !183, file: !184, line: 256, baseType: !188, size: 64, align: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !183, file: !184, line: 257, baseType: !188, size: 64, align: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !183, file: !184, line: 258, baseType: !188, size: 64, align: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !183, file: !184, line: 260, baseType: !200, size: 64, align: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !184, line: 156, size: 192, align: 64, elements: !202)
!202 = !{!203, !204, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !201, file: !184, line: 157, baseType: !200, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !201, file: !184, line: 158, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !201, file: !184, line: 162, baseType: !25, size: 32, align: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !183, file: !184, line: 262, baseType: !205, size: 64, align: 64, offset: 832)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !183, file: !184, line: 264, baseType: !25, size: 32, align: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !183, file: !184, line: 268, baseType: !25, size: 32, align: 32, offset: 928)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !183, file: !184, line: 270, baseType: !211, size: 64, align: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !212, line: 131, baseType: !213)
!212 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!213 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !183, file: !184, line: 274, baseType: !215, size: 16, align: 16, offset: 1024)
!215 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !183, file: !184, line: 275, baseType: !217, size: 8, align: 8, offset: 1040)
!217 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !183, file: !184, line: 276, baseType: !219, size: 8, align: 8, offset: 1048)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 1)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !183, file: !184, line: 280, baseType: !223, size: 64, align: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !184, line: 150, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !183, file: !184, line: 289, baseType: !226, size: 64, align: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !212, line: 132, baseType: !213)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !183, file: !184, line: 297, baseType: !20, size: 64, align: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !183, file: !184, line: 298, baseType: !20, size: 64, align: 64, offset: 1280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !183, file: !184, line: 299, baseType: !20, size: 64, align: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !183, file: !184, line: 300, baseType: !20, size: 64, align: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !183, file: !184, line: 302, baseType: !232, size: 64, align: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 216, baseType: !234)
!233 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!234 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !183, file: !184, line: 303, baseType: !25, size: 32, align: 32, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !183, file: !184, line: 305, baseType: !237, size: 160, align: 8, offset: 1568)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 20)
!240 = !DILocation(line: 401, column: 10, scope: !163)
!241 = !DILocalVariable(name: "curMatch", scope: !163, file: !23, line: 402, type: !28)
!242 = !DILocation(line: 402, column: 16, scope: !163)
!243 = !DILocalVariable(name: "curFileChar", scope: !163, file: !23, line: 403, type: !30)
!244 = !DILocation(line: 403, column: 9, scope: !163)
!245 = !DILocalVariable(name: "i", scope: !163, file: !23, line: 404, type: !25)
!246 = !DILocation(line: 404, column: 8, scope: !163)
!247 = !DILocation(line: 406, column: 4, scope: !163)
!248 = !DILocation(line: 407, column: 10, scope: !249)
!249 = distinct !DILexicalBlock(scope: !163, file: !23, line: 407, column: 4)
!250 = !DILocation(line: 407, column: 8, scope: !249)
!251 = !DILocation(line: 407, column: 15, scope: !252)
!252 = !DILexicalBlockFile(scope: !253, file: !23, discriminator: 1)
!253 = distinct !DILexicalBlock(scope: !249, file: !23, line: 407, column: 4)
!254 = !DILocation(line: 407, column: 19, scope: !252)
!255 = !DILocation(line: 407, column: 17, scope: !252)
!256 = !DILocation(line: 407, column: 4, scope: !252)
!257 = !DILocation(line: 408, column: 99, scope: !258)
!258 = distinct !DILexicalBlock(scope: !253, file: !23, line: 407, column: 34)
!259 = !DILocation(line: 408, column: 93, scope: !258)
!260 = !DILocation(line: 408, column: 8, scope: !258)
!261 = !DILocation(line: 409, column: 29, scope: !258)
!262 = !DILocation(line: 409, column: 23, scope: !258)
!263 = !DILocation(line: 409, column: 17, scope: !258)
!264 = !DILocation(line: 409, column: 15, scope: !258)
!265 = !DILocation(line: 410, column: 12, scope: !266)
!266 = distinct !DILexicalBlock(scope: !258, file: !23, line: 410, column: 12)
!267 = !DILocation(line: 410, column: 12, scope: !258)
!268 = !DILocation(line: 411, column: 5, scope: !266)
!269 = !DILocation(line: 412, column: 4, scope: !258)
!270 = !DILocation(line: 407, column: 29, scope: !271)
!271 = !DILexicalBlockFile(scope: !253, file: !23, discriminator: 2)
!272 = !DILocation(line: 407, column: 4, scope: !271)
!273 = distinct !{!273, !274}
!274 = !DILocation(line: 407, column: 4, scope: !163)
!275 = !DILocation(line: 414, column: 9, scope: !276)
!276 = distinct !DILexicalBlock(scope: !163, file: !23, line: 414, column: 8)
!277 = !DILocation(line: 414, column: 8, scope: !163)
!278 = !DILocation(line: 415, column: 8, scope: !279)
!279 = distinct !DILexicalBlock(scope: !276, file: !23, line: 414, column: 17)
!280 = !DILocation(line: 416, column: 8, scope: !279)
!281 = !DILocation(line: 419, column: 4, scope: !163)
!282 = !DILocation(line: 420, column: 15, scope: !163)
!283 = !DILocation(line: 420, column: 13, scope: !163)
!284 = !DILocation(line: 421, column: 4, scope: !163)
!285 = !DILocation(line: 421, column: 12, scope: !286)
!286 = !DILexicalBlockFile(scope: !163, file: !23, discriminator: 1)
!287 = !DILocation(line: 421, column: 11, scope: !286)
!288 = !DILocation(line: 421, column: 4, scope: !286)
!289 = !DILocation(line: 422, column: 16, scope: !290)
!290 = distinct !DILexicalBlock(scope: !291, file: !23, line: 422, column: 11)
!291 = distinct !DILexicalBlock(scope: !163, file: !23, line: 421, column: 22)
!292 = !DILocation(line: 422, column: 11, scope: !290)
!293 = !DILocation(line: 422, column: 11, scope: !291)
!294 = !DILocation(line: 423, column: 3, scope: !290)
!295 = !DILocation(line: 425, column: 27, scope: !291)
!296 = !DILocation(line: 425, column: 21, scope: !291)
!297 = !DILocation(line: 425, column: 19, scope: !291)
!298 = !DILocation(line: 426, column: 11, scope: !299)
!299 = distinct !DILexicalBlock(scope: !291, file: !23, line: 426, column: 11)
!300 = !DILocation(line: 426, column: 27, scope: !299)
!301 = !DILocation(line: 426, column: 26, scope: !299)
!302 = !DILocation(line: 426, column: 23, scope: !299)
!303 = !DILocation(line: 426, column: 11, scope: !291)
!304 = !DILocation(line: 427, column: 11, scope: !305)
!305 = distinct !DILexicalBlock(scope: !299, file: !23, line: 426, column: 37)
!306 = !DILocation(line: 428, column: 3, scope: !305)
!307 = distinct !{!307, !284}
!308 = !DILocation(line: 429, column: 18, scope: !309)
!309 = distinct !DILexicalBlock(scope: !299, file: !23, line: 429, column: 18)
!310 = !DILocation(line: 429, column: 30, scope: !309)
!311 = !DILocation(line: 429, column: 27, scope: !309)
!312 = !DILocation(line: 429, column: 18, scope: !299)
!313 = !DILocation(line: 430, column: 14, scope: !314)
!314 = distinct !DILexicalBlock(scope: !309, file: !23, line: 429, column: 45)
!315 = !DILocation(line: 430, column: 12, scope: !314)
!316 = !DILocation(line: 431, column: 17, scope: !314)
!317 = !DILocation(line: 431, column: 30, scope: !314)
!318 = !DILocation(line: 431, column: 10, scope: !314)
!319 = !DILocation(line: 432, column: 7, scope: !314)
!320 = !DILocation(line: 421, column: 4, scope: !321)
!321 = !DILexicalBlockFile(scope: !163, file: !23, discriminator: 2)
!322 = !DILocation(line: 435, column: 15, scope: !323)
!323 = distinct !DILexicalBlock(scope: !163, file: !23, line: 435, column: 8)
!324 = !DILocation(line: 435, column: 35, scope: !323)
!325 = !DILocation(line: 435, column: 42, scope: !323)
!326 = !DILocation(line: 435, column: 49, scope: !323)
!327 = !DILocation(line: 435, column: 8, scope: !323)
!328 = !DILocation(line: 435, column: 56, scope: !323)
!329 = !DILocation(line: 435, column: 8, scope: !163)
!330 = !DILocation(line: 436, column: 7, scope: !323)
!331 = !DILocation(line: 438, column: 11, scope: !163)
!332 = !DILocation(line: 438, column: 4, scope: !163)
!333 = !DILocation(line: 439, column: 99, scope: !163)
!334 = !DILocation(line: 439, column: 98, scope: !163)
!335 = !DILocation(line: 439, column: 107, scope: !163)
!336 = !DILocation(line: 439, column: 106, scope: !163)
!337 = !DILocation(line: 439, column: 115, scope: !163)
!338 = !DILocation(line: 439, column: 114, scope: !163)
!339 = !DILocation(line: 439, column: 4, scope: !163)
!340 = !DILocation(line: 441, column: 4, scope: !163)
!341 = !DILocation(line: 444, column: 11, scope: !163)
!342 = !DILocation(line: 444, column: 4, scope: !163)
!343 = !DILocation(line: 445, column: 4, scope: !163)
!344 = !DILocation(line: 446, column: 4, scope: !163)
!345 = !DILocation(line: 447, column: 1, scope: !163)
!346 = distinct !DISubprogram(name: "resolutionDRMRPrimaryCheckOpen", scope: !23, file: !23, line: 242, type: !347, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!347 = !DISubroutineType(types: !348)
!348 = !{!25}
!349 = !DILocalVariable(name: "fd", scope: !346, file: !23, line: 244, type: !25)
!350 = !DILocation(line: 244, column: 9, scope: !346)
!351 = !DILocation(line: 246, column: 10, scope: !346)
!352 = !DILocation(line: 246, column: 8, scope: !346)
!353 = !DILocation(line: 247, column: 9, scope: !354)
!354 = distinct !DILexicalBlock(scope: !346, file: !23, line: 247, column: 9)
!355 = !DILocation(line: 247, column: 12, scope: !354)
!356 = !DILocation(line: 247, column: 9, scope: !346)
!357 = !DILocation(line: 248, column: 2, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !23, line: 247, column: 17)
!359 = !DILocation(line: 249, column: 7, scope: !358)
!360 = !DILocation(line: 249, column: 5, scope: !358)
!361 = !DILocation(line: 250, column: 6, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !23, line: 250, column: 6)
!363 = !DILocation(line: 250, column: 9, scope: !362)
!364 = !DILocation(line: 250, column: 6, scope: !358)
!365 = !DILocation(line: 251, column: 13, scope: !362)
!366 = !DILocation(line: 251, column: 19, scope: !362)
!367 = !DILocation(line: 251, column: 30, scope: !362)
!368 = !DILocation(line: 251, column: 6, scope: !362)
!369 = !DILocation(line: 252, column: 5, scope: !358)
!370 = !DILocation(line: 253, column: 9, scope: !371)
!371 = distinct !DILexicalBlock(scope: !346, file: !23, line: 253, column: 9)
!372 = !DILocation(line: 253, column: 12, scope: !371)
!373 = !DILocation(line: 253, column: 9, scope: !346)
!374 = !DILocation(line: 254, column: 2, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !23, line: 253, column: 17)
!376 = !DILocation(line: 255, column: 2, scope: !375)
!377 = !DILocation(line: 258, column: 36, scope: !378)
!378 = distinct !DILexicalBlock(scope: !346, file: !23, line: 258, column: 9)
!379 = !DILocation(line: 258, column: 10, scope: !378)
!380 = !DILocation(line: 258, column: 9, scope: !346)
!381 = !DILocation(line: 259, column: 9, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !23, line: 258, column: 41)
!383 = !DILocation(line: 259, column: 2, scope: !382)
!384 = !DILocation(line: 262, column: 11, scope: !346)
!385 = !DILocation(line: 262, column: 5, scope: !346)
!386 = !DILocation(line: 264, column: 5, scope: !346)
!387 = !DILocation(line: 265, column: 1, scope: !346)
!388 = distinct !DISubprogram(name: "resolutionDRMClose", scope: !23, file: !23, line: 365, type: !389, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !25}
!391 = !DILocalVariable(name: "fd", arg: 1, scope: !388, file: !23, line: 365, type: !25)
!392 = !DILocation(line: 365, column: 24, scope: !388)
!393 = !DILocation(line: 367, column: 11, scope: !388)
!394 = !DILocation(line: 367, column: 5, scope: !388)
!395 = !DILocation(line: 368, column: 5, scope: !388)
!396 = !DILocation(line: 369, column: 1, scope: !388)
!397 = distinct !DISubprogram(name: "resolutionOpenDRM", scope: !23, file: !23, line: 81, type: !398, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!398 = !DISubroutineType(types: !399)
!399 = !{!25, !28}
!400 = !DILocalVariable(name: "node", arg: 1, scope: !397, file: !23, line: 81, type: !28)
!401 = !DILocation(line: 81, column: 31, scope: !397)
!402 = !DILocalVariable(name: "udev", scope: !397, file: !23, line: 83, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev", file: !405, line: 34, flags: DIFlagFwdDecl)
!405 = !DIFile(filename: "resolutionDL.h", directory: "/home/lichi/Desktop/open-vm-tools/line1477")
!406 = !DILocation(line: 83, column: 18, scope: !397)
!407 = !DILocalVariable(name: "enumerate", scope: !397, file: !23, line: 84, type: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_enumerate", file: !405, line: 36, flags: DIFlagFwdDecl)
!410 = !DILocation(line: 84, column: 28, scope: !397)
!411 = !DILocalVariable(name: "devices", scope: !397, file: !23, line: 85, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_list_entry", file: !405, line: 64, flags: DIFlagFwdDecl)
!414 = !DILocation(line: 85, column: 29, scope: !397)
!415 = !DILocalVariable(name: "devListEntry", scope: !397, file: !23, line: 85, type: !412)
!416 = !DILocation(line: 85, column: 39, scope: !397)
!417 = !DILocalVariable(name: "dev", scope: !397, file: !23, line: 86, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "udev_device", file: !405, line: 35, flags: DIFlagFwdDecl)
!420 = !DILocation(line: 86, column: 25, scope: !397)
!421 = !DILocalVariable(name: "fd", scope: !397, file: !23, line: 87, type: !25)
!422 = !DILocation(line: 87, column: 9, scope: !397)
!423 = !DILocalVariable(name: "drmFd", scope: !397, file: !23, line: 88, type: !25)
!424 = !DILocation(line: 88, column: 9, scope: !397)
!425 = !DILocalVariable(name: "devNode", scope: !397, file: !23, line: 89, type: !28)
!426 = !DILocation(line: 89, column: 17, scope: !397)
!427 = !DILocation(line: 92, column: 13, scope: !397)
!428 = !DILocation(line: 92, column: 19, scope: !397)
!429 = !DILocation(line: 92, column: 11, scope: !397)
!430 = !DILocation(line: 93, column: 9, scope: !431)
!431 = distinct !DILexicalBlock(scope: !397, file: !23, line: 93, column: 9)
!432 = !DILocation(line: 93, column: 15, scope: !431)
!433 = !DILocation(line: 93, column: 9, scope: !397)
!434 = !DILocation(line: 94, column: 15, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !23, line: 93, column: 21)
!436 = !DILocation(line: 94, column: 21, scope: !435)
!437 = !DILocation(line: 94, column: 32, scope: !435)
!438 = !DILocation(line: 95, column: 5, scope: !435)
!439 = !DILocation(line: 97, column: 12, scope: !397)
!440 = !DILocation(line: 97, column: 19, scope: !397)
!441 = !DILocation(line: 97, column: 10, scope: !397)
!442 = !DILocation(line: 98, column: 10, scope: !443)
!443 = distinct !DILexicalBlock(scope: !397, file: !23, line: 98, column: 9)
!444 = !DILocation(line: 98, column: 9, scope: !397)
!445 = !DILocation(line: 99, column: 9, scope: !446)
!446 = distinct !DILexicalBlock(scope: !443, file: !23, line: 98, column: 16)
!447 = !DILocation(line: 107, column: 17, scope: !397)
!448 = !DILocation(line: 107, column: 24, scope: !397)
!449 = !DILocation(line: 107, column: 39, scope: !397)
!450 = !DILocation(line: 107, column: 15, scope: !397)
!451 = !DILocation(line: 108, column: 9, scope: !452)
!452 = distinct !DILexicalBlock(scope: !397, file: !23, line: 108, column: 9)
!453 = !DILocation(line: 108, column: 16, scope: !452)
!454 = !DILocation(line: 108, column: 47, scope: !452)
!455 = !DILocation(line: 108, column: 9, scope: !397)
!456 = !DILocation(line: 109, column: 2, scope: !452)
!457 = !DILocation(line: 110, column: 9, scope: !458)
!458 = distinct !DILexicalBlock(scope: !397, file: !23, line: 110, column: 9)
!459 = !DILocation(line: 110, column: 16, scope: !458)
!460 = !DILocation(line: 110, column: 46, scope: !458)
!461 = !DILocation(line: 110, column: 9, scope: !397)
!462 = !DILocation(line: 111, column: 2, scope: !458)
!463 = !DILocation(line: 112, column: 9, scope: !464)
!464 = distinct !DILexicalBlock(scope: !397, file: !23, line: 112, column: 9)
!465 = !DILocation(line: 112, column: 16, scope: !464)
!466 = !DILocation(line: 112, column: 40, scope: !464)
!467 = !DILocation(line: 112, column: 9, scope: !397)
!468 = !DILocation(line: 113, column: 2, scope: !464)
!469 = !DILocation(line: 115, column: 15, scope: !397)
!470 = !DILocation(line: 115, column: 22, scope: !397)
!471 = !DILocation(line: 115, column: 48, scope: !397)
!472 = !DILocation(line: 115, column: 13, scope: !397)
!473 = !DILocation(line: 116, column: 25, scope: !474)
!474 = distinct !DILexicalBlock(scope: !397, file: !23, line: 116, column: 5)
!475 = !DILocation(line: 116, column: 23, scope: !474)
!476 = !DILocation(line: 116, column: 10, scope: !474)
!477 = !DILocation(line: 116, column: 34, scope: !478)
!478 = !DILexicalBlockFile(scope: !479, file: !23, discriminator: 1)
!479 = distinct !DILexicalBlock(scope: !474, file: !23, line: 116, column: 5)
!480 = !DILocation(line: 116, column: 47, scope: !478)
!481 = !DILocation(line: 116, column: 5, scope: !478)
!482 = !DILocalVariable(name: "path", scope: !483, file: !23, line: 117, type: !28)
!483 = distinct !DILexicalBlock(scope: !479, file: !23, line: 116, column: 66)
!484 = !DILocation(line: 117, column: 14, scope: !483)
!485 = !DILocalVariable(name: "vendor", scope: !483, file: !23, line: 117, type: !28)
!486 = !DILocation(line: 117, column: 21, scope: !483)
!487 = !DILocalVariable(name: "device", scope: !483, file: !23, line: 117, type: !28)
!488 = !DILocation(line: 117, column: 30, scope: !483)
!489 = !DILocalVariable(name: "parent", scope: !483, file: !23, line: 118, type: !418)
!490 = !DILocation(line: 118, column: 22, scope: !483)
!491 = !DILocation(line: 120, column: 9, scope: !483)
!492 = !DILocation(line: 120, column: 16, scope: !483)
!493 = !DILocation(line: 120, column: 37, scope: !483)
!494 = !DILocation(line: 120, column: 7, scope: !483)
!495 = !DILocation(line: 121, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !483, file: !23, line: 121, column: 6)
!497 = !DILocation(line: 121, column: 6, scope: !483)
!498 = !DILocation(line: 122, column: 6, scope: !496)
!499 = !DILocation(line: 123, column: 14, scope: !500)
!500 = distinct !DILexicalBlock(scope: !483, file: !23, line: 123, column: 6)
!501 = !DILocation(line: 123, column: 20, scope: !500)
!502 = !DILocation(line: 123, column: 7, scope: !500)
!503 = !DILocation(line: 123, column: 6, scope: !483)
!504 = !DILocation(line: 124, column: 6, scope: !500)
!505 = !DILocation(line: 126, column: 8, scope: !483)
!506 = !DILocation(line: 126, column: 15, scope: !483)
!507 = !DILocation(line: 126, column: 40, scope: !483)
!508 = !DILocation(line: 126, column: 46, scope: !483)
!509 = !DILocation(line: 126, column: 6, scope: !483)
!510 = !DILocation(line: 127, column: 7, scope: !511)
!511 = distinct !DILexicalBlock(scope: !483, file: !23, line: 127, column: 6)
!512 = !DILocation(line: 127, column: 6, scope: !483)
!513 = !DILocation(line: 128, column: 6, scope: !511)
!514 = !DILocation(line: 130, column: 11, scope: !483)
!515 = !DILocation(line: 130, column: 18, scope: !483)
!516 = !DILocation(line: 130, column: 60, scope: !483)
!517 = !DILocation(line: 130, column: 9, scope: !483)
!518 = !DILocation(line: 133, column: 7, scope: !519)
!519 = distinct !DILexicalBlock(scope: !483, file: !23, line: 133, column: 6)
!520 = !DILocation(line: 133, column: 6, scope: !483)
!521 = !DILocation(line: 134, column: 6, scope: !519)
!522 = !DILocation(line: 136, column: 11, scope: !483)
!523 = !DILocation(line: 136, column: 18, scope: !483)
!524 = !DILocation(line: 136, column: 44, scope: !483)
!525 = !DILocation(line: 136, column: 9, scope: !483)
!526 = !DILocation(line: 137, column: 11, scope: !483)
!527 = !DILocation(line: 137, column: 18, scope: !483)
!528 = !DILocation(line: 137, column: 44, scope: !483)
!529 = !DILocation(line: 137, column: 9, scope: !483)
!530 = !DILocation(line: 138, column: 7, scope: !531)
!531 = distinct !DILexicalBlock(scope: !483, file: !23, line: 138, column: 6)
!532 = !DILocation(line: 138, column: 14, scope: !531)
!533 = !DILocation(line: 138, column: 18, scope: !534)
!534 = !DILexicalBlockFile(scope: !531, file: !23, discriminator: 1)
!535 = !DILocation(line: 138, column: 6, scope: !534)
!536 = !DILocation(line: 139, column: 6, scope: !531)
!537 = !DILocation(line: 141, column: 13, scope: !538)
!538 = distinct !DILexicalBlock(scope: !483, file: !23, line: 141, column: 6)
!539 = !DILocation(line: 141, column: 6, scope: !538)
!540 = !DILocation(line: 141, column: 31, scope: !538)
!541 = !DILocation(line: 142, column: 13, scope: !538)
!542 = !DILocation(line: 142, column: 6, scope: !538)
!543 = !DILocation(line: 141, column: 6, scope: !544)
!544 = !DILexicalBlockFile(scope: !483, file: !23, discriminator: 1)
!545 = !DILocation(line: 143, column: 6, scope: !538)
!546 = !DILocation(line: 145, column: 12, scope: !483)
!547 = !DILocation(line: 145, column: 19, scope: !483)
!548 = !DILocation(line: 145, column: 39, scope: !483)
!549 = !DILocation(line: 145, column: 10, scope: !483)
!550 = !DILocation(line: 146, column: 7, scope: !551)
!551 = distinct !DILexicalBlock(scope: !483, file: !23, line: 146, column: 6)
!552 = !DILocation(line: 146, column: 6, scope: !483)
!553 = !DILocation(line: 147, column: 6, scope: !551)
!554 = !DILocation(line: 149, column: 12, scope: !483)
!555 = !DILocation(line: 149, column: 7, scope: !483)
!556 = !DILocation(line: 149, column: 5, scope: !483)
!557 = !DILocation(line: 150, column: 2, scope: !483)
!558 = !DILocation(line: 150, column: 9, scope: !483)
!559 = !DILocation(line: 150, column: 23, scope: !483)
!560 = !DILocation(line: 151, column: 2, scope: !483)
!561 = !DILocation(line: 154, column: 2, scope: !483)
!562 = !DILocation(line: 154, column: 9, scope: !483)
!563 = !DILocation(line: 154, column: 23, scope: !483)
!564 = !DILocation(line: 155, column: 5, scope: !483)
!565 = !DILocation(line: 116, column: 22, scope: !566)
!566 = !DILexicalBlockFile(scope: !479, file: !23, discriminator: 2)
!567 = !DILocation(line: 116, column: 30, scope: !566)
!568 = !DILocation(line: 116, column: 51, scope: !566)
!569 = !DILocation(line: 116, column: 21, scope: !566)
!570 = !DILocation(line: 116, column: 19, scope: !566)
!571 = !DILocation(line: 116, column: 5, scope: !566)
!572 = distinct !{!572, !573}
!573 = !DILocation(line: 116, column: 5, scope: !397)
!574 = !DILocation(line: 157, column: 5, scope: !397)
!575 = !DILocation(line: 157, column: 12, scope: !397)
!576 = !DILocation(line: 157, column: 29, scope: !397)
!577 = !DILocation(line: 158, column: 5, scope: !397)
!578 = !DILocation(line: 158, column: 12, scope: !397)
!579 = !DILocation(line: 158, column: 19, scope: !397)
!580 = !DILocation(line: 160, column: 9, scope: !581)
!581 = distinct !DILexicalBlock(scope: !397, file: !23, line: 160, column: 9)
!582 = !DILocation(line: 160, column: 15, scope: !581)
!583 = !DILocation(line: 160, column: 9, scope: !397)
!584 = !DILocation(line: 161, column: 8, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !23, line: 160, column: 21)
!586 = !DILocation(line: 161, column: 14, scope: !585)
!587 = !DILocation(line: 161, column: 20, scope: !585)
!588 = !DILocation(line: 162, column: 5, scope: !585)
!589 = !DILocation(line: 164, column: 12, scope: !397)
!590 = !DILocation(line: 164, column: 5, scope: !397)
!591 = !DILocation(line: 167, column: 5, scope: !397)
!592 = !DILocation(line: 167, column: 12, scope: !397)
!593 = !DILocation(line: 167, column: 26, scope: !397)
!594 = !DILocation(line: 169, column: 5, scope: !397)
!595 = !DILocation(line: 169, column: 12, scope: !397)
!596 = !DILocation(line: 169, column: 29, scope: !397)
!597 = !DILocation(line: 170, column: 5, scope: !397)
!598 = !DILocation(line: 170, column: 12, scope: !397)
!599 = !DILocation(line: 170, column: 19, scope: !397)
!600 = !DILocation(line: 172, column: 9, scope: !601)
!601 = distinct !DILexicalBlock(scope: !397, file: !23, line: 172, column: 9)
!602 = !DILocation(line: 172, column: 15, scope: !601)
!603 = !DILocation(line: 172, column: 9, scope: !397)
!604 = !DILocation(line: 173, column: 8, scope: !605)
!605 = distinct !DILexicalBlock(scope: !601, file: !23, line: 172, column: 21)
!606 = !DILocation(line: 173, column: 14, scope: !605)
!607 = !DILocation(line: 173, column: 20, scope: !605)
!608 = !DILocation(line: 174, column: 5, scope: !605)
!609 = !DILocation(line: 176, column: 5, scope: !397)
!610 = !DILocation(line: 177, column: 1, scope: !397)
!611 = distinct !DISubprogram(name: "resolutionDRMCheckVersion", scope: !23, file: !23, line: 200, type: !612, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!612 = !DISubroutineType(types: !613)
!613 = !{!25, !25}
!614 = !DILocalVariable(name: "fd", arg: 1, scope: !611, file: !23, line: 200, type: !25)
!615 = !DILocation(line: 200, column: 31, scope: !611)
!616 = !DILocalVariable(name: "ver", scope: !611, file: !23, line: 202, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "drmVersionPtr", file: !405, line: 102, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_drmVersion", file: !405, line: 92, size: 448, align: 64, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !619, file: !405, line: 93, baseType: !25, size: 32, align: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !619, file: !405, line: 94, baseType: !25, size: 32, align: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "version_patchlevel", scope: !619, file: !405, line: 95, baseType: !25, size: 32, align: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name_len", scope: !619, file: !405, line: 96, baseType: !25, size: 32, align: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !405, line: 97, baseType: !188, size: 64, align: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "date_len", scope: !619, file: !405, line: 98, baseType: !25, size: 32, align: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !619, file: !405, line: 99, baseType: !188, size: 64, align: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "desc_len", scope: !619, file: !405, line: 100, baseType: !25, size: 32, align: 32, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !619, file: !405, line: 101, baseType: !188, size: 64, align: 64, offset: 384)
!630 = !DILocation(line: 202, column: 19, scope: !611)
!631 = !DILocation(line: 202, column: 25, scope: !611)
!632 = !DILocation(line: 202, column: 31, scope: !611)
!633 = !DILocation(line: 202, column: 42, scope: !611)
!634 = !DILocation(line: 204, column: 10, scope: !635)
!635 = distinct !DILexicalBlock(scope: !611, file: !23, line: 204, column: 9)
!636 = !DILocation(line: 204, column: 9, scope: !611)
!637 = !DILocation(line: 205, column: 2, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !23, line: 204, column: 15)
!639 = !DILocation(line: 206, column: 2, scope: !638)
!640 = !DILocation(line: 209, column: 9, scope: !641)
!641 = distinct !DILexicalBlock(scope: !611, file: !23, line: 209, column: 9)
!642 = !DILocation(line: 209, column: 14, scope: !641)
!643 = !DILocation(line: 209, column: 28, scope: !641)
!644 = !DILocation(line: 209, column: 33, scope: !641)
!645 = !DILocation(line: 210, column: 9, scope: !641)
!646 = !DILocation(line: 210, column: 14, scope: !641)
!647 = !DILocation(line: 210, column: 28, scope: !641)
!648 = !DILocation(line: 209, column: 9, scope: !649)
!649 = !DILexicalBlockFile(scope: !611, file: !23, discriminator: 1)
!650 = !DILocation(line: 211, column: 123, scope: !651)
!651 = distinct !DILexicalBlock(scope: !641, file: !23, line: 210, column: 34)
!652 = !DILocation(line: 211, column: 128, scope: !651)
!653 = !DILocation(line: 211, column: 143, scope: !651)
!654 = !DILocation(line: 211, column: 148, scope: !651)
!655 = !DILocation(line: 211, column: 8, scope: !651)
!656 = !DILocation(line: 213, column: 8, scope: !651)
!657 = !DILocation(line: 213, column: 14, scope: !651)
!658 = !DILocation(line: 213, column: 26, scope: !651)
!659 = !DILocation(line: 214, column: 8, scope: !651)
!660 = !DILocation(line: 217, column: 5, scope: !611)
!661 = !DILocation(line: 217, column: 11, scope: !611)
!662 = !DILocation(line: 217, column: 23, scope: !611)
!663 = !DILocation(line: 218, column: 5, scope: !611)
!664 = !DILocation(line: 219, column: 1, scope: !611)
