; ModuleID = './authPosix.o.i'
source_filename = "./authPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.AuthTokenInternal = type { %struct.passwd, i64, [0 x i8] }
%struct.spwd = type { i8*, i8*, i64, i64, i64, i64, i64, i64, i64 }

@.str = private unnamed_addr constant [6 x i8] c"UTF-8\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"User not in UTF-8\0A\00", align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"Password not in UTF-8\0A\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"x\00", align 1
@.str.4 = private unnamed_addr constant [6 x i8] c"glurp\00", align 1

; Function Attrs: nounwind uwtable
define %struct.passwd* @Auth_GetPwnam(i8*) #0 !dbg !265 {
  %2 = alloca %struct.passwd*, align 8
  %3 = alloca i8*, align 8
  %4 = alloca %struct.AuthTokenInternal*, align 8
  %5 = alloca i32, align 4
  %6 = alloca %struct.passwd*, align 8
  store i8* %0, i8** %3, align 8
  call void @llvm.dbg.declare(metadata i8** %3, metadata !271, metadata !272), !dbg !273
  call void @llvm.dbg.declare(metadata %struct.AuthTokenInternal** %4, metadata !274, metadata !272), !dbg !275
  call void @llvm.dbg.declare(metadata i32* %5, metadata !276, metadata !272), !dbg !278
  call void @llvm.dbg.declare(metadata %struct.passwd** %6, metadata !279, metadata !272), !dbg !281

!141 = !DIEnumerator(name: "_SC_BASE", value: 134)
!142 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!143 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!144 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!145 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!146 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!147 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!148 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!149 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!150 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!151 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!152 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!153 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!154 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!155 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!156 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!157 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!158 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!159 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!160 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!161 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!162 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!163 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!164 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!165 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!166 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!167 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!168 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!169 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!170 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!171 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!172 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!173 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!174 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!175 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!176 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!177 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!178 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!179 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!180 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!181 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!182 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!183 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!184 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!185 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!186 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!187 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!188 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!189 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!190 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!191 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!192 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!193 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!194 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!195 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!196 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!197 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!198 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!199 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!200 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!201 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!202 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!203 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!204 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!205 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!206 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!207 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!208 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!209 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!210 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !{!222, !223, !243, !250}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AuthToken", file: !224, line: 42, baseType: !225)
!224 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/auth.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !228, line: 49, size: 384, align: 64, elements: !229)
!228 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!229 = !{!230, !233, !234, !238, !240, !241, !242}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !227, file: !228, line: 51, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !227, file: !228, line: 52, baseType: !231, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !227, file: !228, line: 53, baseType: !235, size: 32, align: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !236, line: 125, baseType: !237)
!236 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!237 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !227, file: !228, line: 54, baseType: !239, size: 32, align: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !236, line: 126, baseType: !237)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !227, file: !228, line: 55, baseType: !231, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !227, file: !228, line: 56, baseType: !231, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !227, file: !228, line: 57, baseType: !231, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AuthTokenInternal", file: !245, line: 55, baseType: !246)
!245 = !DIFile(filename: "authPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !245, line: 51, size: 448, align: 64, elements: !247)
!247 = !{!248, !249, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pwd", scope: !246, file: !245, line: 52, baseType: !227, size: 384, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bufSize", scope: !246, file: !245, line: 53, baseType: !250, size: 64, align: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !251, line: 216, baseType: !252)
!251 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!252 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !245, line: 54, baseType: !254, offset: 448)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, align: 8, elements: !260)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !256, line: 177, baseType: !257)
!256 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !258, line: 48, baseType: !259)
!258 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!259 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!260 = !{!261}
!261 = !DISubrange(count: -1)
!262 = !{i32 2, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!265 = distinct !DISubprogram(name: "Auth_GetPwnam", scope: !245, file: !245, line: 307, type: !266, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!266 = !DISubroutineType(types: !267)
!267 = !{!223, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!270 = !{}
!271 = !DILocalVariable(name: "user", arg: 1, scope: !265, file: !245, line: 307, type: !268)
!272 = !DIExpression()
!273 = !DILocation(line: 307, column: 27, scope: !265)
!274 = !DILocalVariable(name: "ati", scope: !265, file: !245, line: 309, type: !243)
!275 = !DILocation(line: 309, column: 23, scope: !265)
!276 = !DILocalVariable(name: "res", scope: !265, file: !245, line: 310, type: !277)
!277 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!278 = !DILocation(line: 310, column: 8, scope: !265)
!279 = !DILocalVariable(name: "ppwd", scope: !265, file: !245, line: 311, type: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!281 = !DILocation(line: 311, column: 19, scope: !265)
!282 = !DILocation(line: 315, column: 10, scope: !265)
!283 = !DILocation(line: 315, column: 8, scope: !265)
!284 = !DILocation(line: 316, column: 27, scope: !265)
!285 = !DILocation(line: 316, column: 34, scope: !265)
!286 = !DILocation(line: 316, column: 39, scope: !265)
!287 = !DILocation(line: 316, column: 44, scope: !265)
!288 = !DILocation(line: 316, column: 49, scope: !265)
!289 = !DILocation(line: 316, column: 54, scope: !265)
!290 = !DILocation(line: 316, column: 59, scope: !265)
!291 = !DILocation(line: 316, column: 10, scope: !265)
!292 = !DILocation(line: 316, column: 8, scope: !265)
!293 = !DILocation(line: 318, column: 14, scope: !294)
!294 = distinct !DILexicalBlock(scope: !265, file: !245, line: 318, column: 8)
!295 = !DILocation(line: 318, column: 11, scope: !294)
!296 = !DILocation(line: 318, column: 19, scope: !294)
!297 = !DILocation(line: 318, column: 23, scope: !298)
!298 = !DILexicalBlockFile(scope: !294, file: !245, discriminator: 1)
!299 = !DILocation(line: 318, column: 28, scope: !298)
!300 = !DILocation(line: 318, column: 8, scope: !298)
!301 = !DILocation(line: 319, column: 35, scope: !302)
!302 = distinct !DILexicalBlock(scope: !294, file: !245, line: 318, column: 37)
!303 = !DILocation(line: 319, column: 23, scope: !302)
!304 = !DILocation(line: 319, column: 7, scope: !302)
!305 = !DILocation(line: 320, column: 7, scope: !302)
!306 = !DILocation(line: 325, column: 23, scope: !265)
!307 = !DILocation(line: 325, column: 11, scope: !265)
!308 = !DILocation(line: 325, column: 4, scope: !265)
!309 = !DILocation(line: 326, column: 1, scope: !265)
!310 = distinct !DISubprogram(name: "AuthAllocateToken", scope: !245, file: !245, line: 264, type: !311, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!311 = !DISubroutineType(types: !312)
!312 = !{!243}
!313 = !DILocalVariable(name: "bufSize", scope: !310, file: !245, line: 266, type: !314)
!314 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!315 = !DILocation(line: 266, column: 9, scope: !310)
!316 = !DILocalVariable(name: "ati", scope: !310, file: !245, line: 267, type: !243)
!317 = !DILocation(line: 267, column: 23, scope: !310)
!318 = !DILocation(line: 275, column: 5, scope: !310)
!319 = !DILocation(line: 275, column: 9, scope: !310)
!320 = !DILocation(line: 276, column: 14, scope: !310)
!321 = !DILocation(line: 276, column: 12, scope: !310)
!322 = !DILocation(line: 277, column: 10, scope: !323)
!323 = distinct !DILexicalBlock(scope: !310, file: !245, line: 277, column: 8)
!324 = !DILocation(line: 277, column: 9, scope: !323)
!325 = !DILocation(line: 277, column: 14, scope: !323)
!326 = !DILocation(line: 277, column: 20, scope: !323)
!327 = !DILocation(line: 277, column: 24, scope: !328)
!328 = !DILexicalBlockFile(scope: !323, file: !245, discriminator: 1)
!329 = !DILocation(line: 277, column: 32, scope: !328)
!330 = !DILocation(line: 277, column: 8, scope: !328)
!331 = !DILocation(line: 278, column: 15, scope: !332)
!332 = distinct !DILexicalBlock(scope: !323, file: !245, line: 277, column: 39)
!333 = !DILocation(line: 279, column: 4, scope: !332)
!334 = !DILocation(line: 281, column: 12, scope: !310)
!335 = !DILocation(line: 283, column: 50, scope: !310)
!336 = !DILocation(line: 283, column: 39, scope: !310)
!337 = !DILocation(line: 283, column: 10, scope: !310)
!338 = !DILocation(line: 283, column: 8, scope: !310)
!339 = !DILocation(line: 284, column: 19, scope: !310)
!340 = !DILocation(line: 284, column: 4, scope: !310)
!341 = !DILocation(line: 284, column: 9, scope: !310)
!342 = !DILocation(line: 284, column: 17, scope: !310)
!343 = !DILocation(line: 286, column: 11, scope: !310)
!344 = !DILocation(line: 286, column: 4, scope: !310)
!345 = distinct !DISubprogram(name: "Auth_CloseToken", scope: !245, file: !245, line: 514, type: !346, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !223}
!348 = !DILocalVariable(name: "token", arg: 1, scope: !345, file: !245, line: 514, type: !223)
!349 = !DILocation(line: 514, column: 27, scope: !345)
!350 = !DILocation(line: 516, column: 18, scope: !345)
!351 = !DILocation(line: 516, column: 9, scope: !345)
!352 = !DILocation(line: 516, column: 4, scope: !345)
!353 = !DILocation(line: 517, column: 1, scope: !345)
!354 = distinct !DISubprogram(name: "Auth_AuthenticateSelf", scope: !245, file: !245, line: 346, type: !355, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!355 = !DISubroutineType(types: !356)
!356 = !{!223}
!357 = !DILocalVariable(name: "ati", scope: !354, file: !245, line: 348, type: !243)
!358 = !DILocation(line: 348, column: 23, scope: !354)
!359 = !DILocalVariable(name: "res", scope: !354, file: !245, line: 349, type: !277)
!360 = !DILocation(line: 349, column: 8, scope: !354)
!361 = !DILocalVariable(name: "ppwd", scope: !354, file: !245, line: 350, type: !280)
!362 = !DILocation(line: 350, column: 19, scope: !354)
!363 = !DILocation(line: 352, column: 10, scope: !354)
!364 = !DILocation(line: 352, column: 8, scope: !354)
!365 = !DILocation(line: 353, column: 27, scope: !354)
!366 = !DILocation(line: 353, column: 38, scope: !354)
!367 = !DILocation(line: 353, column: 43, scope: !354)
!368 = !DILocation(line: 353, column: 48, scope: !354)
!369 = !DILocation(line: 353, column: 53, scope: !354)
!370 = !DILocation(line: 353, column: 58, scope: !354)
!371 = !DILocation(line: 353, column: 63, scope: !354)
!372 = !DILocation(line: 353, column: 10, scope: !373)
!373 = !DILexicalBlockFile(scope: !354, file: !245, discriminator: 1)
!374 = !DILocation(line: 353, column: 8, scope: !354)
!375 = !DILocation(line: 355, column: 14, scope: !376)
!376 = distinct !DILexicalBlock(scope: !354, file: !245, line: 355, column: 8)
!377 = !DILocation(line: 355, column: 11, scope: !376)
!378 = !DILocation(line: 355, column: 19, scope: !376)
!379 = !DILocation(line: 355, column: 23, scope: !380)
!380 = !DILexicalBlockFile(scope: !376, file: !245, discriminator: 1)
!381 = !DILocation(line: 355, column: 28, scope: !380)
!382 = !DILocation(line: 355, column: 8, scope: !380)
!383 = !DILocation(line: 356, column: 35, scope: !384)
!384 = distinct !DILexicalBlock(scope: !376, file: !245, line: 355, column: 37)
!385 = !DILocation(line: 356, column: 23, scope: !384)
!386 = !DILocation(line: 356, column: 7, scope: !384)
!387 = !DILocation(line: 357, column: 7, scope: !384)
!388 = !DILocation(line: 362, column: 23, scope: !354)
!389 = !DILocation(line: 362, column: 11, scope: !354)
!390 = !DILocation(line: 362, column: 4, scope: !354)
!391 = !DILocation(line: 363, column: 1, scope: !354)
!392 = distinct !DISubprogram(name: "Auth_AuthenticateUser", scope: !245, file: !245, line: 385, type: !393, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!393 = !DISubroutineType(types: !394)
!394 = !{!223, !268, !268}
!395 = !DILocalVariable(name: "user", arg: 1, scope: !392, file: !245, line: 385, type: !268)
!396 = !DILocation(line: 385, column: 35, scope: !392)
!397 = !DILocalVariable(name: "pass", arg: 2, scope: !392, file: !245, line: 386, type: !268)
!398 = !DILocation(line: 386, column: 35, scope: !392)
!399 = !DILocalVariable(name: "success", scope: !392, file: !245, line: 393, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !256, line: 230, baseType: !232)
!401 = !DILocation(line: 393, column: 9, scope: !392)
!402 = !DILocalVariable(name: "ati", scope: !392, file: !245, line: 394, type: !243)
!403 = !DILocation(line: 394, column: 23, scope: !392)
!404 = !DILocation(line: 396, column: 26, scope: !405)
!405 = distinct !DILexicalBlock(scope: !392, file: !245, line: 396, column: 8)
!406 = !DILocation(line: 396, column: 39, scope: !405)
!407 = !DILocation(line: 396, column: 32, scope: !405)
!408 = !DILocation(line: 396, column: 9, scope: !409)
!409 = !DILexicalBlockFile(scope: !405, file: !245, discriminator: 1)
!410 = !DILocation(line: 396, column: 9, scope: !405)
!411 = !DILocation(line: 396, column: 8, scope: !392)
!412 = !DILocation(line: 397, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !405, file: !245, line: 396, column: 56)
!414 = !DILocation(line: 398, column: 7, scope: !413)
!415 = !DILocation(line: 400, column: 26, scope: !416)
!416 = distinct !DILexicalBlock(scope: !392, file: !245, line: 400, column: 8)
!417 = !DILocation(line: 400, column: 39, scope: !416)
!418 = !DILocation(line: 400, column: 32, scope: !416)
!419 = !DILocation(line: 400, column: 9, scope: !420)
!420 = !DILexicalBlockFile(scope: !416, file: !245, discriminator: 1)
!421 = !DILocation(line: 400, column: 9, scope: !416)
!422 = !DILocation(line: 400, column: 8, scope: !392)
!423 = !DILocation(line: 401, column: 7, scope: !424)
!424 = distinct !DILexicalBlock(scope: !416, file: !245, line: 400, column: 56)
!425 = !DILocation(line: 402, column: 7, scope: !424)
!426 = !DILocation(line: 453, column: 46, scope: !392)
!427 = !DILocation(line: 453, column: 32, scope: !392)
!428 = !DILocation(line: 453, column: 10, scope: !392)
!429 = !DILocation(line: 453, column: 8, scope: !392)
!430 = !DILocation(line: 455, column: 8, scope: !431)
!431 = distinct !DILexicalBlock(scope: !392, file: !245, line: 455, column: 8)
!432 = !DILocation(line: 455, column: 12, scope: !431)
!433 = !DILocation(line: 455, column: 8, scope: !392)
!434 = !DILocation(line: 456, column: 7, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !245, line: 455, column: 20)
!436 = !DILocation(line: 459, column: 9, scope: !437)
!437 = distinct !DILexicalBlock(scope: !392, file: !245, line: 459, column: 8)
!438 = !DILocation(line: 459, column: 14, scope: !437)
!439 = !DILocation(line: 459, column: 18, scope: !437)
!440 = !DILocation(line: 459, column: 8, scope: !437)
!441 = !DILocation(line: 459, column: 28, scope: !437)
!442 = !DILocation(line: 459, column: 8, scope: !392)
!443 = !DILocalVariable(name: "pw", scope: !444, file: !245, line: 460, type: !268)
!444 = distinct !DILexicalBlock(scope: !437, file: !245, line: 459, column: 37)
!445 = !DILocation(line: 460, column: 19, scope: !444)
!446 = !DILocation(line: 460, column: 24, scope: !444)
!447 = !DILocation(line: 460, column: 29, scope: !444)
!448 = !DILocation(line: 460, column: 33, scope: !444)
!449 = !DILocalVariable(name: "namep", scope: !444, file: !245, line: 461, type: !268)
!450 = !DILocation(line: 461, column: 19, scope: !444)
!451 = !DILocation(line: 465, column: 18, scope: !452)
!452 = distinct !DILexicalBlock(scope: !444, file: !245, line: 465, column: 11)
!453 = !DILocation(line: 465, column: 11, scope: !452)
!454 = !DILocation(line: 465, column: 27, scope: !452)
!455 = !DILocation(line: 465, column: 11, scope: !444)
!456 = !DILocalVariable(name: "sp", scope: !457, file: !245, line: 466, type: !458)
!457 = distinct !DILexicalBlock(scope: !452, file: !245, line: 465, column: 33)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spwd", file: !460, line: 39, size: 576, align: 64, elements: !461)
!460 = !DIFile(filename: "/usr/include/shadow.h", directory: "/home/lichi/Desktop/open-vm-tools/line21")
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sp_namp", scope: !459, file: !460, line: 41, baseType: !231, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sp_pwdp", scope: !459, file: !460, line: 42, baseType: !231, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sp_lstchg", scope: !459, file: !460, line: 43, baseType: !314, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sp_min", scope: !459, file: !460, line: 44, baseType: !314, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sp_max", scope: !459, file: !460, line: 45, baseType: !314, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sp_warn", scope: !459, file: !460, line: 46, baseType: !314, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sp_inact", scope: !459, file: !460, line: 48, baseType: !314, size: 64, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sp_expire", scope: !459, file: !460, line: 50, baseType: !314, size: 64, align: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sp_flag", scope: !459, file: !460, line: 52, baseType: !252, size: 64, align: 64, offset: 512)
!471 = !DILocation(line: 466, column: 23, scope: !457)
!472 = !DILocation(line: 466, column: 37, scope: !457)
!473 = !DILocation(line: 466, column: 28, scope: !457)
!474 = !DILocation(line: 468, column: 14, scope: !475)
!475 = distinct !DILexicalBlock(scope: !457, file: !245, line: 468, column: 14)
!476 = !DILocation(line: 468, column: 14, scope: !457)
!477 = !DILocation(line: 469, column: 18, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !245, line: 468, column: 18)
!479 = !DILocation(line: 469, column: 22, scope: !478)
!480 = !DILocation(line: 469, column: 16, scope: !478)
!481 = !DILocation(line: 470, column: 10, scope: !478)
!482 = !DILocation(line: 471, column: 7, scope: !457)
!483 = !DILocation(line: 474, column: 21, scope: !444)
!484 = !DILocation(line: 474, column: 27, scope: !444)
!485 = !DILocation(line: 474, column: 15, scope: !444)
!486 = !DILocation(line: 474, column: 13, scope: !444)
!487 = !DILocation(line: 475, column: 11, scope: !488)
!488 = distinct !DILexicalBlock(scope: !444, file: !245, line: 475, column: 11)
!489 = !DILocation(line: 475, column: 17, scope: !488)
!490 = !DILocation(line: 475, column: 24, scope: !488)
!491 = !DILocation(line: 475, column: 34, scope: !492)
!492 = !DILexicalBlockFile(scope: !488, file: !245, discriminator: 1)
!493 = !DILocation(line: 475, column: 41, scope: !492)
!494 = !DILocation(line: 475, column: 27, scope: !492)
!495 = !DILocation(line: 475, column: 45, scope: !492)
!496 = !DILocation(line: 475, column: 11, scope: !492)
!497 = !DILocation(line: 477, column: 10, scope: !498)
!498 = distinct !DILexicalBlock(scope: !488, file: !245, line: 475, column: 51)
!499 = !DILocation(line: 481, column: 22, scope: !444)
!500 = !DILocation(line: 481, column: 7, scope: !444)
!501 = !DILocation(line: 482, column: 4, scope: !444)
!502 = !DILocation(line: 485, column: 12, scope: !392)
!503 = !DILocation(line: 485, column: 4, scope: !392)
!504 = !DILocation(line: 488, column: 8, scope: !505)
!505 = distinct !DILexicalBlock(scope: !392, file: !245, line: 488, column: 8)
!506 = !DILocation(line: 488, column: 8, scope: !392)
!507 = !DILocation(line: 489, column: 26, scope: !508)
!508 = distinct !DILexicalBlock(scope: !505, file: !245, line: 488, column: 17)
!509 = !DILocation(line: 489, column: 14, scope: !508)
!510 = !DILocation(line: 489, column: 7, scope: !508)
!511 = !DILocation(line: 491, column: 35, scope: !512)
!512 = distinct !DILexicalBlock(scope: !505, file: !245, line: 490, column: 11)
!513 = !DILocation(line: 491, column: 23, scope: !512)
!514 = !DILocation(line: 491, column: 7, scope: !512)
!515 = !DILocation(line: 492, column: 7, scope: !512)
!516 = !DILocation(line: 494, column: 1, scope: !392)
