; ModuleID = './[inter]third-party--zlib-1.2.7--gzwrite.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--gzwrite.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gzFile_s = type { i32, i8*, i64 }
%struct.gz_state = type { %struct.gzFile_s, i32, i32, i8*, i32, i32, i8*, i8*, i32, i32, i64, i32, i32, i32, i32, i64, i32, i32, i8*, %struct.z_stream_s }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [37 x i8] c"requested length does not fit in int\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"out of memory\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"1.2.7\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"stdio error (consult errno)\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"internal error: deflate stream corrupt\00", align 1

; Function Attrs: nounwind uwtable
define i32 @gzwrite(%struct.gzFile_s*, i8*, i32) #0 !dbg !85 {
  %4 = alloca i32, align 4
  %5 = alloca %struct.gzFile_s*, align 8
  %6 = alloca i8*, align 8
  %7 = alloca i32, align 4
  %8 = alloca i32, align 4
  %9 = alloca i32, align 4
  %10 = alloca %struct.gz_state*, align 8
  %11 = alloca %struct.z_stream_s*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--gzwrite.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!2 = !{}
!3 = !{!4, !5, !23, !26, !81, !16, !21}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_statep", file: !6, line: 177, baseType: !7)
!6 = !DIFile(filename: "gzguts.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_state", file: !6, line: 176, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 145, size: 1856, align: 64, elements: !10)
!10 = !{!11, !22, !24, !25, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !9, file: !6, line: 147, baseType: !12, size: 192, align: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !13, line: 1670, size: 192, align: 64, elements: !14)
!13 = !DIFile(filename: "zlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!14 = !{!15, !17, !20}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !12, file: !13, line: 1671, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !12, file: !13, line: 1672, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !12, file: !13, line: 1673, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !9, file: !6, line: 152, baseType: !23, size: 32, align: 32, offset: 192)
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !9, file: !6, line: 153, baseType: !23, size: 32, align: 32, offset: 224)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !9, file: !6, line: 154, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !9, file: !6, line: 155, baseType: !16, size: 32, align: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !9, file: !6, line: 156, baseType: !16, size: 32, align: 32, offset: 352)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !9, file: !6, line: 157, baseType: !18, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !9, file: !6, line: 158, baseType: !18, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !9, file: !6, line: 159, baseType: !23, size: 32, align: 32, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "how", scope: !9, file: !6, line: 161, baseType: !23, size: 32, align: 32, offset: 544)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !9, file: !6, line: 162, baseType: !21, size: 64, align: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !9, file: !6, line: 163, baseType: !23, size: 32, align: 32, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "past", scope: !9, file: !6, line: 164, baseType: !23, size: 32, align: 32, offset: 672)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !9, file: !6, line: 166, baseType: !23, size: 32, align: 32, offset: 704)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !9, file: !6, line: 167, baseType: !23, size: 32, align: 32, offset: 736)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !9, file: !6, line: 169, baseType: !21, size: 64, align: 64, offset: 768)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !9, file: !6, line: 170, baseType: !23, size: 32, align: 32, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !9, file: !6, line: 172, baseType: !23, size: 32, align: 32, offset: 864)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !9, file: !6, line: 173, baseType: !26, size: 64, align: 64, offset: 896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !9, file: !6, line: 175, baseType: !44, size: 896, align: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !13, line: 104, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !13, line: 85, size: 896, align: 64, elements: !46)
!46 = !{!47, !52, !54, !57, !58, !59, !60, !61, !66, !72, !77, !78, !79, !80}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !45, file: !13, line: 86, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !50, line: 374, baseType: !51)
!50 = !DIFile(filename: "zconf.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !50, line: 365, baseType: !19)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !45, file: !13, line: 87, baseType: !53, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !50, line: 367, baseType: !16)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !45, file: !13, line: 88, baseType: !55, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !50, line: 368, baseType: !56)
!56 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !45, file: !13, line: 90, baseType: !48, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !45, file: !13, line: 91, baseType: !53, size: 32, align: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !45, file: !13, line: 92, baseType: !55, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !45, file: !13, line: 94, baseType: !26, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !45, file: !13, line: 95, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !13, line: 1742, size: 32, align: 32, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !63, file: !13, line: 1742, baseType: !23, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !45, file: !13, line: 97, baseType: !67, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !13, line: 80, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !71, !53, !53}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !50, line: 383, baseType: !4)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !45, file: !13, line: 98, baseType: !73, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !13, line: 81, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !71, !71}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !45, file: !13, line: 99, baseType: !71, size: 64, align: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !45, file: !13, line: 101, baseType: !23, size: 32, align: 32, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !45, file: !13, line: 102, baseType: !55, size: 64, align: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !45, file: !13, line: 103, baseType: !55, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidp", file: !50, line: 384, baseType: !4)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!85 = distinct !DISubprogram(name: "gzwrite", scope: !86, file: !86, line: 165, type: !87, isLocal: false, isDefinition: true, scopeLine: 169, isOptimized: false, unit: !0, variables: !2)
!86 = !DIFile(filename: "gzwrite.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!87 = !DISubroutineType(types: !88)
!88 = !{!23, !89, !91, !16}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !13, line: 1207, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpc", file: !50, line: 382, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!94 = !DILocalVariable(name: "file", arg: 1, scope: !85, file: !86, line: 166, type: !89)
!95 = !DIExpression()
!96 = !DILocation(line: 166, column: 12, scope: !85)
!97 = !DILocalVariable(name: "buf", arg: 2, scope: !85, file: !86, line: 167, type: !91)
!98 = !DILocation(line: 167, column: 12, scope: !85)
!99 = !DILocalVariable(name: "len", arg: 3, scope: !85, file: !86, line: 168, type: !16)
!100 = !DILocation(line: 168, column: 14, scope: !85)
!101 = !DILocalVariable(name: "put", scope: !85, file: !86, line: 170, type: !16)
!102 = !DILocation(line: 170, column: 14, scope: !85)
!103 = !DILocation(line: 170, column: 20, scope: !85)
!104 = !DILocalVariable(name: "n", scope: !85, file: !86, line: 171, type: !16)
!105 = !DILocation(line: 171, column: 14, scope: !85)
!106 = !DILocalVariable(name: "state", scope: !85, file: !86, line: 172, type: !5)
!107 = !DILocation(line: 172, column: 15, scope: !85)
!108 = !DILocalVariable(name: "strm", scope: !85, file: !86, line: 173, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !13, line: 106, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!111 = !DILocation(line: 173, column: 15, scope: !85)
!112 = !DILocation(line: 176, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !85, file: !86, line: 176, column: 9)
!114 = !DILocation(line: 176, column: 14, scope: !113)
!115 = !DILocation(line: 176, column: 9, scope: !85)
!116 = !DILocation(line: 177, column: 9, scope: !113)
!117 = !DILocation(line: 178, column: 24, scope: !85)
!118 = !DILocation(line: 178, column: 13, scope: !85)
!119 = !DILocation(line: 178, column: 11, scope: !85)
!120 = !DILocation(line: 179, column: 14, scope: !85)
!121 = !DILocation(line: 179, column: 21, scope: !85)
!122 = !DILocation(line: 179, column: 10, scope: !85)
!123 = !DILocation(line: 182, column: 9, scope: !124)
!124 = distinct !DILexicalBlock(scope: !85, file: !86, line: 182, column: 9)
!125 = !DILocation(line: 182, column: 16, scope: !124)
!126 = !DILocation(line: 182, column: 21, scope: !124)
!127 = !DILocation(line: 182, column: 30, scope: !124)
!128 = !DILocation(line: 182, column: 33, scope: !129)
!129 = !DILexicalBlockFile(scope: !124, file: !86, discriminator: 1)
!130 = !DILocation(line: 182, column: 40, scope: !129)
!131 = !DILocation(line: 182, column: 44, scope: !129)
!132 = !DILocation(line: 182, column: 9, scope: !129)
!133 = !DILocation(line: 183, column: 9, scope: !124)
!134 = !DILocation(line: 187, column: 14, scope: !135)
!135 = distinct !DILexicalBlock(scope: !85, file: !86, line: 187, column: 9)
!136 = !DILocation(line: 187, column: 18, scope: !135)
!137 = !DILocation(line: 187, column: 9, scope: !85)
!138 = !DILocation(line: 188, column: 18, scope: !139)
!139 = distinct !DILexicalBlock(scope: !135, file: !86, line: 187, column: 23)
!140 = !DILocation(line: 188, column: 9, scope: !139)
!141 = !DILocation(line: 189, column: 9, scope: !139)
!142 = !DILocation(line: 193, column: 9, scope: !143)
!143 = distinct !DILexicalBlock(scope: !85, file: !86, line: 193, column: 9)
!144 = !DILocation(line: 193, column: 13, scope: !143)
!145 = !DILocation(line: 193, column: 9, scope: !85)
!146 = !DILocation(line: 194, column: 9, scope: !143)
!147 = !DILocation(line: 197, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !85, file: !86, line: 197, column: 9)
!149 = !DILocation(line: 197, column: 16, scope: !148)
!150 = !DILocation(line: 197, column: 21, scope: !148)
!151 = !DILocation(line: 197, column: 26, scope: !148)
!152 = !DILocation(line: 197, column: 37, scope: !153)
!153 = !DILexicalBlockFile(scope: !148, file: !86, discriminator: 1)
!154 = !DILocation(line: 197, column: 29, scope: !153)
!155 = !DILocation(line: 197, column: 44, scope: !153)
!156 = !DILocation(line: 197, column: 9, scope: !153)
!157 = !DILocation(line: 198, column: 9, scope: !148)
!158 = !DILocation(line: 201, column: 9, scope: !159)
!159 = distinct !DILexicalBlock(scope: !85, file: !86, line: 201, column: 9)
!160 = !DILocation(line: 201, column: 16, scope: !159)
!161 = !DILocation(line: 201, column: 9, scope: !85)
!162 = !DILocation(line: 202, column: 9, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !86, line: 201, column: 22)
!164 = !DILocation(line: 202, column: 16, scope: !163)
!165 = !DILocation(line: 202, column: 21, scope: !163)
!166 = !DILocation(line: 203, column: 21, scope: !167)
!167 = distinct !DILexicalBlock(scope: !163, file: !86, line: 203, column: 13)
!168 = !DILocation(line: 203, column: 28, scope: !167)
!169 = !DILocation(line: 203, column: 35, scope: !167)
!170 = !DILocation(line: 203, column: 13, scope: !167)
!171 = !DILocation(line: 203, column: 41, scope: !167)
!172 = !DILocation(line: 203, column: 13, scope: !163)
!173 = !DILocation(line: 204, column: 13, scope: !167)
!174 = !DILocation(line: 205, column: 5, scope: !163)
!175 = !DILocation(line: 208, column: 9, scope: !176)
!176 = distinct !DILexicalBlock(scope: !85, file: !86, line: 208, column: 9)
!177 = !DILocation(line: 208, column: 15, scope: !176)
!178 = !DILocation(line: 208, column: 22, scope: !176)
!179 = !DILocation(line: 208, column: 13, scope: !176)
!180 = !DILocation(line: 208, column: 9, scope: !85)
!181 = !DILocation(line: 210, column: 9, scope: !182)
!182 = distinct !DILexicalBlock(scope: !176, file: !86, line: 208, column: 28)
!183 = distinct !{!183, !181}
!184 = !DILocation(line: 211, column: 17, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !86, line: 211, column: 17)
!186 = distinct !DILexicalBlock(scope: !182, file: !86, line: 210, column: 12)
!187 = !DILocation(line: 211, column: 23, scope: !185)
!188 = !DILocation(line: 211, column: 32, scope: !185)
!189 = !DILocation(line: 211, column: 17, scope: !186)
!190 = !DILocation(line: 212, column: 33, scope: !185)
!191 = !DILocation(line: 212, column: 40, scope: !185)
!192 = !DILocation(line: 212, column: 17, scope: !185)
!193 = !DILocation(line: 212, column: 23, scope: !185)
!194 = !DILocation(line: 212, column: 31, scope: !185)
!195 = !DILocation(line: 213, column: 17, scope: !186)
!196 = !DILocation(line: 213, column: 24, scope: !186)
!197 = !DILocation(line: 213, column: 31, scope: !186)
!198 = !DILocation(line: 213, column: 37, scope: !186)
!199 = !DILocation(line: 213, column: 29, scope: !186)
!200 = !DILocation(line: 213, column: 15, scope: !186)
!201 = !DILocation(line: 214, column: 17, scope: !202)
!202 = distinct !DILexicalBlock(scope: !186, file: !86, line: 214, column: 17)
!203 = !DILocation(line: 214, column: 21, scope: !202)
!204 = !DILocation(line: 214, column: 19, scope: !202)
!205 = !DILocation(line: 214, column: 17, scope: !186)
!206 = !DILocation(line: 215, column: 21, scope: !202)
!207 = !DILocation(line: 215, column: 19, scope: !202)
!208 = !DILocation(line: 215, column: 17, scope: !202)
!209 = !DILocation(line: 216, column: 20, scope: !186)
!210 = !DILocation(line: 216, column: 26, scope: !186)
!211 = !DILocation(line: 216, column: 36, scope: !186)
!212 = !DILocation(line: 216, column: 42, scope: !186)
!213 = !DILocation(line: 216, column: 34, scope: !186)
!214 = !DILocation(line: 216, column: 52, scope: !186)
!215 = !DILocation(line: 216, column: 57, scope: !186)
!216 = !DILocation(line: 216, column: 13, scope: !186)
!217 = !DILocation(line: 217, column: 31, scope: !186)
!218 = !DILocation(line: 217, column: 13, scope: !186)
!219 = !DILocation(line: 217, column: 19, scope: !186)
!220 = !DILocation(line: 217, column: 28, scope: !186)
!221 = !DILocation(line: 218, column: 29, scope: !186)
!222 = !DILocation(line: 218, column: 13, scope: !186)
!223 = !DILocation(line: 218, column: 20, scope: !186)
!224 = !DILocation(line: 218, column: 22, scope: !186)
!225 = !DILocation(line: 218, column: 26, scope: !186)
!226 = !DILocation(line: 219, column: 27, scope: !186)
!227 = !DILocation(line: 219, column: 33, scope: !186)
!228 = !DILocation(line: 219, column: 31, scope: !186)
!229 = !DILocation(line: 219, column: 17, scope: !186)
!230 = !DILocation(line: 220, column: 20, scope: !186)
!231 = !DILocation(line: 220, column: 17, scope: !186)
!232 = !DILocation(line: 221, column: 17, scope: !233)
!233 = distinct !DILexicalBlock(scope: !186, file: !86, line: 221, column: 17)
!234 = !DILocation(line: 221, column: 21, scope: !233)
!235 = !DILocation(line: 221, column: 32, scope: !236)
!236 = !DILexicalBlockFile(scope: !233, file: !86, discriminator: 1)
!237 = !DILocation(line: 221, column: 24, scope: !236)
!238 = !DILocation(line: 221, column: 42, scope: !236)
!239 = !DILocation(line: 221, column: 17, scope: !236)
!240 = !DILocation(line: 222, column: 17, scope: !233)
!241 = !DILocation(line: 223, column: 9, scope: !186)
!242 = !DILocation(line: 223, column: 18, scope: !243)
!243 = !DILexicalBlockFile(scope: !182, file: !86, discriminator: 1)
!244 = !DILocation(line: 223, column: 9, scope: !243)
!245 = !DILocation(line: 224, column: 5, scope: !182)
!246 = !DILocation(line: 227, column: 13, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !86, line: 227, column: 13)
!248 = distinct !DILexicalBlock(scope: !176, file: !86, line: 225, column: 10)
!249 = !DILocation(line: 227, column: 19, scope: !247)
!250 = !DILocation(line: 227, column: 28, scope: !247)
!251 = !DILocation(line: 227, column: 39, scope: !252)
!252 = !DILexicalBlockFile(scope: !247, file: !86, discriminator: 1)
!253 = !DILocation(line: 227, column: 31, scope: !252)
!254 = !DILocation(line: 227, column: 49, scope: !252)
!255 = !DILocation(line: 227, column: 13, scope: !252)
!256 = !DILocation(line: 228, column: 13, scope: !247)
!257 = !DILocation(line: 231, column: 26, scope: !248)
!258 = !DILocation(line: 231, column: 9, scope: !248)
!259 = !DILocation(line: 231, column: 15, scope: !248)
!260 = !DILocation(line: 231, column: 24, scope: !248)
!261 = !DILocation(line: 232, column: 32, scope: !248)
!262 = !DILocation(line: 232, column: 9, scope: !248)
!263 = !DILocation(line: 232, column: 15, scope: !248)
!264 = !DILocation(line: 232, column: 23, scope: !248)
!265 = !DILocation(line: 233, column: 25, scope: !248)
!266 = !DILocation(line: 233, column: 9, scope: !248)
!267 = !DILocation(line: 233, column: 16, scope: !248)
!268 = !DILocation(line: 233, column: 18, scope: !248)
!269 = !DILocation(line: 233, column: 22, scope: !248)
!270 = !DILocation(line: 234, column: 21, scope: !271)
!271 = distinct !DILexicalBlock(scope: !248, file: !86, line: 234, column: 13)
!272 = !DILocation(line: 234, column: 13, scope: !271)
!273 = !DILocation(line: 234, column: 31, scope: !271)
!274 = !DILocation(line: 234, column: 13, scope: !248)
!275 = !DILocation(line: 235, column: 13, scope: !271)
!276 = !DILocation(line: 239, column: 17, scope: !85)
!277 = !DILocation(line: 239, column: 5, scope: !85)
!278 = !DILocation(line: 240, column: 1, scope: !85)
!279 = distinct !DISubprogram(name: "gz_init", scope: !86, file: !86, line: 15, type: !280, isLocal: true, isDefinition: true, scopeLine: 17, isOptimized: false, unit: !0, variables: !2)
!280 = !DISubroutineType(types: !281)
!281 = !{!23, !5}
!282 = !DILocalVariable(name: "state", arg: 1, scope: !279, file: !86, line: 16, type: !5)
!283 = !DILocation(line: 16, column: 15, scope: !279)
!284 = !DILocalVariable(name: "ret", scope: !279, file: !86, line: 18, type: !23)
!285 = !DILocation(line: 18, column: 9, scope: !279)
!286 = !DILocalVariable(name: "strm", scope: !279, file: !86, line: 19, type: !109)
!287 = !DILocation(line: 19, column: 15, scope: !279)
!288 = !DILocation(line: 19, column: 24, scope: !279)
!289 = !DILocation(line: 19, column: 31, scope: !279)
!290 = !DILocation(line: 22, column: 24, scope: !279)
!291 = !DILocation(line: 22, column: 31, scope: !279)
!292 = !DILocation(line: 22, column: 17, scope: !279)
!293 = !DILocation(line: 22, column: 5, scope: !279)
!294 = !DILocation(line: 22, column: 12, scope: !279)
!295 = !DILocation(line: 22, column: 15, scope: !279)
!296 = !DILocation(line: 23, column: 9, scope: !297)
!297 = distinct !DILexicalBlock(scope: !279, file: !86, line: 23, column: 9)
!298 = !DILocation(line: 23, column: 16, scope: !297)
!299 = !DILocation(line: 23, column: 19, scope: !297)
!300 = !DILocation(line: 23, column: 9, scope: !279)
!301 = !DILocation(line: 24, column: 18, scope: !302)
!302 = distinct !DILexicalBlock(scope: !297, file: !86, line: 23, column: 27)
!303 = !DILocation(line: 24, column: 9, scope: !302)
!304 = !DILocation(line: 25, column: 9, scope: !302)
!305 = !DILocation(line: 29, column: 10, scope: !306)
!306 = distinct !DILexicalBlock(scope: !279, file: !86, line: 29, column: 9)
!307 = !DILocation(line: 29, column: 17, scope: !306)
!308 = !DILocation(line: 29, column: 9, scope: !279)
!309 = !DILocation(line: 31, column: 29, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !86, line: 29, column: 25)
!311 = !DILocation(line: 31, column: 36, scope: !310)
!312 = !DILocation(line: 31, column: 22, scope: !310)
!313 = !DILocation(line: 31, column: 9, scope: !310)
!314 = !DILocation(line: 31, column: 16, scope: !310)
!315 = !DILocation(line: 31, column: 20, scope: !310)
!316 = !DILocation(line: 32, column: 13, scope: !317)
!317 = distinct !DILexicalBlock(scope: !310, file: !86, line: 32, column: 13)
!318 = !DILocation(line: 32, column: 20, scope: !317)
!319 = !DILocation(line: 32, column: 24, scope: !317)
!320 = !DILocation(line: 32, column: 13, scope: !310)
!321 = !DILocation(line: 33, column: 18, scope: !322)
!322 = distinct !DILexicalBlock(scope: !317, file: !86, line: 32, column: 32)
!323 = !DILocation(line: 33, column: 25, scope: !322)
!324 = !DILocation(line: 33, column: 13, scope: !322)
!325 = !DILocation(line: 34, column: 22, scope: !322)
!326 = !DILocation(line: 34, column: 13, scope: !322)
!327 = !DILocation(line: 35, column: 13, scope: !322)
!328 = !DILocation(line: 39, column: 9, scope: !310)
!329 = !DILocation(line: 39, column: 15, scope: !310)
!330 = !DILocation(line: 39, column: 22, scope: !310)
!331 = !DILocation(line: 40, column: 9, scope: !310)
!332 = !DILocation(line: 40, column: 15, scope: !310)
!333 = !DILocation(line: 40, column: 21, scope: !310)
!334 = !DILocation(line: 41, column: 9, scope: !310)
!335 = !DILocation(line: 41, column: 15, scope: !310)
!336 = !DILocation(line: 41, column: 22, scope: !310)
!337 = !DILocation(line: 42, column: 30, scope: !310)
!338 = !DILocation(line: 42, column: 37, scope: !310)
!339 = !DILocation(line: 42, column: 44, scope: !310)
!340 = !DILocation(line: 42, column: 71, scope: !310)
!341 = !DILocation(line: 42, column: 78, scope: !310)
!342 = !DILocation(line: 42, column: 15, scope: !310)
!343 = !DILocation(line: 42, column: 13, scope: !310)
!344 = !DILocation(line: 44, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !310, file: !86, line: 44, column: 13)
!346 = !DILocation(line: 44, column: 17, scope: !345)
!347 = !DILocation(line: 44, column: 13, scope: !310)
!348 = !DILocation(line: 45, column: 18, scope: !349)
!349 = distinct !DILexicalBlock(scope: !345, file: !86, line: 44, column: 23)
!350 = !DILocation(line: 45, column: 25, scope: !349)
!351 = !DILocation(line: 45, column: 13, scope: !349)
!352 = !DILocation(line: 46, column: 18, scope: !349)
!353 = !DILocation(line: 46, column: 25, scope: !349)
!354 = !DILocation(line: 46, column: 13, scope: !349)
!355 = !DILocation(line: 47, column: 22, scope: !349)
!356 = !DILocation(line: 47, column: 13, scope: !349)
!357 = !DILocation(line: 48, column: 13, scope: !349)
!358 = !DILocation(line: 50, column: 5, scope: !310)
!359 = !DILocation(line: 53, column: 19, scope: !279)
!360 = !DILocation(line: 53, column: 26, scope: !279)
!361 = !DILocation(line: 53, column: 5, scope: !279)
!362 = !DILocation(line: 53, column: 12, scope: !279)
!363 = !DILocation(line: 53, column: 17, scope: !279)
!364 = !DILocation(line: 56, column: 10, scope: !365)
!365 = distinct !DILexicalBlock(scope: !279, file: !86, line: 56, column: 9)
!366 = !DILocation(line: 56, column: 17, scope: !365)
!367 = !DILocation(line: 56, column: 9, scope: !279)
!368 = !DILocation(line: 57, column: 27, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !86, line: 56, column: 25)
!370 = !DILocation(line: 57, column: 34, scope: !369)
!371 = !DILocation(line: 57, column: 9, scope: !369)
!372 = !DILocation(line: 57, column: 15, scope: !369)
!373 = !DILocation(line: 57, column: 25, scope: !369)
!374 = !DILocation(line: 58, column: 26, scope: !369)
!375 = !DILocation(line: 58, column: 33, scope: !369)
!376 = !DILocation(line: 58, column: 9, scope: !369)
!377 = !DILocation(line: 58, column: 15, scope: !369)
!378 = !DILocation(line: 58, column: 24, scope: !369)
!379 = !DILocation(line: 59, column: 25, scope: !369)
!380 = !DILocation(line: 59, column: 31, scope: !369)
!381 = !DILocation(line: 59, column: 9, scope: !369)
!382 = !DILocation(line: 59, column: 16, scope: !369)
!383 = !DILocation(line: 59, column: 18, scope: !369)
!384 = !DILocation(line: 59, column: 23, scope: !369)
!385 = !DILocation(line: 60, column: 5, scope: !369)
!386 = !DILocation(line: 61, column: 5, scope: !279)
!387 = !DILocation(line: 62, column: 1, scope: !279)
!388 = distinct !DISubprogram(name: "gz_zero", scope: !86, file: !86, line: 133, type: !389, isLocal: true, isDefinition: true, scopeLine: 136, isOptimized: false, unit: !0, variables: !2)
!389 = !DISubroutineType(types: !390)
!390 = !{!23, !5, !21}
!391 = !DILocalVariable(name: "state", arg: 1, scope: !388, file: !86, line: 134, type: !5)
!392 = !DILocation(line: 134, column: 15, scope: !388)
!393 = !DILocalVariable(name: "len", arg: 2, scope: !388, file: !86, line: 135, type: !21)
!394 = !DILocation(line: 135, column: 10, scope: !388)
!395 = !DILocalVariable(name: "first", scope: !388, file: !86, line: 137, type: !23)
!396 = !DILocation(line: 137, column: 9, scope: !388)
!397 = !DILocalVariable(name: "n", scope: !388, file: !86, line: 138, type: !16)
!398 = !DILocation(line: 138, column: 14, scope: !388)
!399 = !DILocalVariable(name: "strm", scope: !388, file: !86, line: 139, type: !109)
!400 = !DILocation(line: 139, column: 15, scope: !388)
!401 = !DILocation(line: 139, column: 24, scope: !388)
!402 = !DILocation(line: 139, column: 31, scope: !388)
!403 = !DILocation(line: 142, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !388, file: !86, line: 142, column: 9)
!405 = !DILocation(line: 142, column: 15, scope: !404)
!406 = !DILocation(line: 142, column: 24, scope: !404)
!407 = !DILocation(line: 142, column: 35, scope: !408)
!408 = !DILexicalBlockFile(scope: !404, file: !86, discriminator: 1)
!409 = !DILocation(line: 142, column: 27, scope: !408)
!410 = !DILocation(line: 142, column: 45, scope: !408)
!411 = !DILocation(line: 142, column: 9, scope: !408)
!412 = !DILocation(line: 143, column: 9, scope: !404)
!413 = !DILocation(line: 146, column: 11, scope: !388)
!414 = !DILocation(line: 147, column: 5, scope: !388)
!415 = !DILocation(line: 147, column: 12, scope: !416)
!416 = !DILexicalBlockFile(scope: !388, file: !86, discriminator: 1)
!417 = !DILocation(line: 147, column: 5, scope: !416)
!418 = !DILocation(line: 148, column: 82, scope: !419)
!419 = distinct !DILexicalBlock(scope: !388, file: !86, line: 147, column: 17)
!420 = !DILocation(line: 148, column: 89, scope: !419)
!421 = !DILocation(line: 148, column: 76, scope: !419)
!422 = !DILocation(line: 148, column: 96, scope: !419)
!423 = !DILocation(line: 148, column: 94, scope: !419)
!424 = !DILocation(line: 148, column: 13, scope: !419)
!425 = !DILocation(line: 149, column: 23, scope: !419)
!426 = !DILocation(line: 149, column: 13, scope: !419)
!427 = !DILocation(line: 148, column: 13, scope: !428)
!428 = !DILexicalBlockFile(scope: !419, file: !86, discriminator: 1)
!429 = !DILocation(line: 149, column: 29, scope: !428)
!430 = !DILocation(line: 149, column: 36, scope: !428)
!431 = !DILocation(line: 148, column: 13, scope: !432)
!432 = !DILexicalBlockFile(scope: !419, file: !86, discriminator: 2)
!433 = !DILocation(line: 148, column: 13, scope: !434)
!434 = !DILexicalBlockFile(scope: !419, file: !86, discriminator: 3)
!435 = !DILocation(line: 148, column: 11, scope: !434)
!436 = !DILocation(line: 150, column: 13, scope: !437)
!437 = distinct !DILexicalBlock(scope: !419, file: !86, line: 150, column: 13)
!438 = !DILocation(line: 150, column: 13, scope: !419)
!439 = !DILocation(line: 151, column: 20, scope: !440)
!440 = distinct !DILexicalBlock(scope: !437, file: !86, line: 150, column: 20)
!441 = !DILocation(line: 151, column: 27, scope: !440)
!442 = !DILocation(line: 151, column: 34, scope: !440)
!443 = !DILocation(line: 151, column: 13, scope: !440)
!444 = !DILocation(line: 152, column: 19, scope: !440)
!445 = !DILocation(line: 153, column: 9, scope: !440)
!446 = !DILocation(line: 154, column: 26, scope: !419)
!447 = !DILocation(line: 154, column: 9, scope: !419)
!448 = !DILocation(line: 154, column: 15, scope: !419)
!449 = !DILocation(line: 154, column: 24, scope: !419)
!450 = !DILocation(line: 155, column: 25, scope: !419)
!451 = !DILocation(line: 155, column: 32, scope: !419)
!452 = !DILocation(line: 155, column: 9, scope: !419)
!453 = !DILocation(line: 155, column: 15, scope: !419)
!454 = !DILocation(line: 155, column: 23, scope: !419)
!455 = !DILocation(line: 156, column: 25, scope: !419)
!456 = !DILocation(line: 156, column: 9, scope: !419)
!457 = !DILocation(line: 156, column: 16, scope: !419)
!458 = !DILocation(line: 156, column: 18, scope: !419)
!459 = !DILocation(line: 156, column: 22, scope: !419)
!460 = !DILocation(line: 157, column: 21, scope: !461)
!461 = distinct !DILexicalBlock(scope: !419, file: !86, line: 157, column: 13)
!462 = !DILocation(line: 157, column: 13, scope: !461)
!463 = !DILocation(line: 157, column: 31, scope: !461)
!464 = !DILocation(line: 157, column: 13, scope: !419)
!465 = !DILocation(line: 158, column: 13, scope: !461)
!466 = !DILocation(line: 159, column: 16, scope: !419)
!467 = !DILocation(line: 159, column: 13, scope: !419)
!468 = !DILocation(line: 147, column: 5, scope: !469)
!469 = !DILexicalBlockFile(scope: !388, file: !86, discriminator: 2)
!470 = distinct !{!470, !414}
!471 = !DILocation(line: 161, column: 5, scope: !388)
!472 = !DILocation(line: 162, column: 1, scope: !388)
!473 = distinct !DISubprogram(name: "gz_comp", scope: !86, file: !86, line: 70, type: !474, isLocal: true, isDefinition: true, scopeLine: 73, isOptimized: false, unit: !0, variables: !2)
!474 = !DISubroutineType(types: !475)
!475 = !{!23, !5, !23}
!476 = !DILocalVariable(name: "state", arg: 1, scope: !473, file: !86, line: 71, type: !5)
!477 = !DILocation(line: 71, column: 15, scope: !473)
!478 = !DILocalVariable(name: "flush", arg: 2, scope: !473, file: !86, line: 72, type: !23)
!479 = !DILocation(line: 72, column: 9, scope: !473)
!480 = !DILocalVariable(name: "ret", scope: !473, file: !86, line: 74, type: !23)
!481 = !DILocation(line: 74, column: 9, scope: !473)
!482 = !DILocalVariable(name: "got", scope: !473, file: !86, line: 74, type: !23)
!483 = !DILocation(line: 74, column: 14, scope: !473)
!484 = !DILocalVariable(name: "have", scope: !473, file: !86, line: 75, type: !16)
!485 = !DILocation(line: 75, column: 14, scope: !473)
!486 = !DILocalVariable(name: "strm", scope: !473, file: !86, line: 76, type: !109)
!487 = !DILocation(line: 76, column: 15, scope: !473)
!488 = !DILocation(line: 76, column: 24, scope: !473)
!489 = !DILocation(line: 76, column: 31, scope: !473)
!490 = !DILocation(line: 79, column: 9, scope: !491)
!491 = distinct !DILexicalBlock(scope: !473, file: !86, line: 79, column: 9)
!492 = !DILocation(line: 79, column: 16, scope: !491)
!493 = !DILocation(line: 79, column: 21, scope: !491)
!494 = !DILocation(line: 79, column: 26, scope: !491)
!495 = !DILocation(line: 79, column: 37, scope: !496)
!496 = !DILexicalBlockFile(scope: !491, file: !86, discriminator: 1)
!497 = !DILocation(line: 79, column: 29, scope: !496)
!498 = !DILocation(line: 79, column: 44, scope: !496)
!499 = !DILocation(line: 79, column: 9, scope: !496)
!500 = !DILocation(line: 80, column: 9, scope: !491)
!501 = !DILocation(line: 83, column: 9, scope: !502)
!502 = distinct !DILexicalBlock(scope: !473, file: !86, line: 83, column: 9)
!503 = !DILocation(line: 83, column: 16, scope: !502)
!504 = !DILocation(line: 83, column: 9, scope: !473)
!505 = !DILocation(line: 84, column: 21, scope: !506)
!506 = distinct !DILexicalBlock(scope: !502, file: !86, line: 83, column: 24)
!507 = !DILocation(line: 84, column: 28, scope: !506)
!508 = !DILocation(line: 84, column: 32, scope: !506)
!509 = !DILocation(line: 84, column: 38, scope: !506)
!510 = !DILocation(line: 84, column: 47, scope: !506)
!511 = !DILocation(line: 84, column: 53, scope: !506)
!512 = !DILocation(line: 84, column: 15, scope: !506)
!513 = !DILocation(line: 84, column: 13, scope: !506)
!514 = !DILocation(line: 85, column: 13, scope: !515)
!515 = distinct !DILexicalBlock(scope: !506, file: !86, line: 85, column: 13)
!516 = !DILocation(line: 85, column: 17, scope: !515)
!517 = !DILocation(line: 85, column: 21, scope: !515)
!518 = !DILocation(line: 85, column: 34, scope: !519)
!519 = !DILexicalBlockFile(scope: !515, file: !86, discriminator: 1)
!520 = !DILocation(line: 85, column: 41, scope: !519)
!521 = !DILocation(line: 85, column: 47, scope: !519)
!522 = !DILocation(line: 85, column: 38, scope: !519)
!523 = !DILocation(line: 85, column: 13, scope: !519)
!524 = !DILocation(line: 86, column: 22, scope: !525)
!525 = distinct !DILexicalBlock(scope: !515, file: !86, line: 85, column: 57)
!526 = !DILocation(line: 86, column: 13, scope: !525)
!527 = !DILocation(line: 87, column: 13, scope: !525)
!528 = !DILocation(line: 89, column: 9, scope: !506)
!529 = !DILocation(line: 89, column: 15, scope: !506)
!530 = !DILocation(line: 89, column: 24, scope: !506)
!531 = !DILocation(line: 90, column: 9, scope: !506)
!532 = !DILocation(line: 94, column: 9, scope: !473)
!533 = !DILocation(line: 95, column: 5, scope: !473)
!534 = distinct !{!534, !533}
!535 = !DILocation(line: 98, column: 13, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !86, line: 98, column: 13)
!537 = distinct !DILexicalBlock(scope: !473, file: !86, line: 95, column: 8)
!538 = !DILocation(line: 98, column: 19, scope: !536)
!539 = !DILocation(line: 98, column: 29, scope: !536)
!540 = !DILocation(line: 98, column: 34, scope: !536)
!541 = !DILocation(line: 98, column: 38, scope: !542)
!542 = !DILexicalBlockFile(scope: !536, file: !86, discriminator: 1)
!543 = !DILocation(line: 98, column: 44, scope: !542)
!544 = !DILocation(line: 98, column: 49, scope: !542)
!545 = !DILocation(line: 99, column: 14, scope: !536)
!546 = !DILocation(line: 99, column: 20, scope: !536)
!547 = !DILocation(line: 99, column: 25, scope: !536)
!548 = !DILocation(line: 99, column: 28, scope: !542)
!549 = !DILocation(line: 99, column: 32, scope: !542)
!550 = !DILocation(line: 98, column: 13, scope: !551)
!551 = !DILexicalBlockFile(scope: !537, file: !86, discriminator: 2)
!552 = !DILocation(line: 100, column: 31, scope: !553)
!553 = distinct !DILexicalBlock(scope: !536, file: !86, line: 99, column: 40)
!554 = !DILocation(line: 100, column: 37, scope: !553)
!555 = !DILocation(line: 100, column: 48, scope: !553)
!556 = !DILocation(line: 100, column: 55, scope: !553)
!557 = !DILocation(line: 100, column: 57, scope: !553)
!558 = !DILocation(line: 100, column: 46, scope: !553)
!559 = !DILocation(line: 100, column: 20, scope: !553)
!560 = !DILocation(line: 100, column: 18, scope: !553)
!561 = !DILocation(line: 101, column: 17, scope: !562)
!562 = distinct !DILexicalBlock(scope: !553, file: !86, line: 101, column: 17)
!563 = !DILocation(line: 101, column: 22, scope: !562)
!564 = !DILocation(line: 101, column: 39, scope: !565)
!565 = !DILexicalBlockFile(scope: !562, file: !86, discriminator: 1)
!566 = !DILocation(line: 101, column: 46, scope: !565)
!567 = !DILocation(line: 101, column: 50, scope: !565)
!568 = !DILocation(line: 101, column: 57, scope: !565)
!569 = !DILocation(line: 101, column: 59, scope: !565)
!570 = !DILocation(line: 101, column: 65, scope: !565)
!571 = !DILocation(line: 101, column: 33, scope: !565)
!572 = !DILocation(line: 101, column: 31, scope: !565)
!573 = !DILocation(line: 101, column: 72, scope: !565)
!574 = !DILocation(line: 101, column: 76, scope: !565)
!575 = !DILocation(line: 102, column: 36, scope: !562)
!576 = !DILocation(line: 102, column: 43, scope: !562)
!577 = !DILocation(line: 102, column: 40, scope: !562)
!578 = !DILocation(line: 101, column: 17, scope: !579)
!579 = !DILexicalBlockFile(scope: !553, file: !86, discriminator: 2)
!580 = !DILocation(line: 103, column: 26, scope: !581)
!581 = distinct !DILexicalBlock(scope: !562, file: !86, line: 102, column: 50)
!582 = !DILocation(line: 103, column: 17, scope: !581)
!583 = !DILocation(line: 104, column: 17, scope: !581)
!584 = !DILocation(line: 106, column: 17, scope: !585)
!585 = distinct !DILexicalBlock(scope: !553, file: !86, line: 106, column: 17)
!586 = !DILocation(line: 106, column: 23, scope: !585)
!587 = !DILocation(line: 106, column: 33, scope: !585)
!588 = !DILocation(line: 106, column: 17, scope: !553)
!589 = !DILocation(line: 107, column: 35, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !86, line: 106, column: 39)
!591 = !DILocation(line: 107, column: 42, scope: !590)
!592 = !DILocation(line: 107, column: 17, scope: !590)
!593 = !DILocation(line: 107, column: 23, scope: !590)
!594 = !DILocation(line: 107, column: 33, scope: !590)
!595 = !DILocation(line: 108, column: 34, scope: !590)
!596 = !DILocation(line: 108, column: 41, scope: !590)
!597 = !DILocation(line: 108, column: 17, scope: !590)
!598 = !DILocation(line: 108, column: 23, scope: !590)
!599 = !DILocation(line: 108, column: 32, scope: !590)
!600 = !DILocation(line: 109, column: 13, scope: !590)
!601 = !DILocation(line: 110, column: 29, scope: !553)
!602 = !DILocation(line: 110, column: 35, scope: !553)
!603 = !DILocation(line: 110, column: 13, scope: !553)
!604 = !DILocation(line: 110, column: 20, scope: !553)
!605 = !DILocation(line: 110, column: 22, scope: !553)
!606 = !DILocation(line: 110, column: 27, scope: !553)
!607 = !DILocation(line: 111, column: 9, scope: !553)
!608 = !DILocation(line: 114, column: 16, scope: !537)
!609 = !DILocation(line: 114, column: 22, scope: !537)
!610 = !DILocation(line: 114, column: 14, scope: !537)
!611 = !DILocation(line: 115, column: 23, scope: !537)
!612 = !DILocation(line: 115, column: 29, scope: !537)
!613 = !DILocation(line: 115, column: 15, scope: !537)
!614 = !DILocation(line: 115, column: 13, scope: !537)
!615 = !DILocation(line: 116, column: 13, scope: !616)
!616 = distinct !DILexicalBlock(scope: !537, file: !86, line: 116, column: 13)
!617 = !DILocation(line: 116, column: 17, scope: !616)
!618 = !DILocation(line: 116, column: 13, scope: !537)
!619 = !DILocation(line: 117, column: 22, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !86, line: 116, column: 26)
!621 = !DILocation(line: 117, column: 13, scope: !620)
!622 = !DILocation(line: 119, column: 13, scope: !620)
!623 = !DILocation(line: 121, column: 17, scope: !537)
!624 = !DILocation(line: 121, column: 23, scope: !537)
!625 = !DILocation(line: 121, column: 14, scope: !537)
!626 = !DILocation(line: 122, column: 5, scope: !537)
!627 = !DILocation(line: 122, column: 14, scope: !628)
!628 = !DILexicalBlockFile(scope: !473, file: !86, discriminator: 1)
!629 = !DILocation(line: 122, column: 5, scope: !628)
!630 = !DILocation(line: 125, column: 9, scope: !631)
!631 = distinct !DILexicalBlock(scope: !473, file: !86, line: 125, column: 9)
!632 = !DILocation(line: 125, column: 15, scope: !631)
!633 = !DILocation(line: 125, column: 9, scope: !473)
!634 = !DILocation(line: 126, column: 22, scope: !631)
!635 = !DILocation(line: 126, column: 9, scope: !631)
!636 = !DILocation(line: 129, column: 5, scope: !473)
!637 = !DILocation(line: 130, column: 1, scope: !473)
!638 = distinct !DISubprogram(name: "gzputc", scope: !86, file: !86, line: 243, type: !639, isLocal: false, isDefinition: true, scopeLine: 246, isOptimized: false, unit: !0, variables: !2)
!639 = !DISubroutineType(types: !640)
!640 = !{!23, !89, !23}
!641 = !DILocalVariable(name: "file", arg: 1, scope: !638, file: !86, line: 244, type: !89)
!642 = !DILocation(line: 244, column: 12, scope: !638)
!643 = !DILocalVariable(name: "c", arg: 2, scope: !638, file: !86, line: 245, type: !23)
!644 = !DILocation(line: 245, column: 9, scope: !638)
!645 = !DILocalVariable(name: "buf", scope: !638, file: !86, line: 247, type: !646)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 1)
!649 = !DILocation(line: 247, column: 19, scope: !638)
!650 = !DILocalVariable(name: "state", scope: !638, file: !86, line: 248, type: !5)
!651 = !DILocation(line: 248, column: 15, scope: !638)
!652 = !DILocalVariable(name: "strm", scope: !638, file: !86, line: 249, type: !109)
!653 = !DILocation(line: 249, column: 15, scope: !638)
!654 = !DILocation(line: 252, column: 9, scope: !655)
!655 = distinct !DILexicalBlock(scope: !638, file: !86, line: 252, column: 9)
!656 = !DILocation(line: 252, column: 14, scope: !655)
!657 = !DILocation(line: 252, column: 9, scope: !638)
!658 = !DILocation(line: 253, column: 9, scope: !655)
!659 = !DILocation(line: 254, column: 24, scope: !638)
!660 = !DILocation(line: 254, column: 13, scope: !638)
!661 = !DILocation(line: 254, column: 11, scope: !638)
!662 = !DILocation(line: 255, column: 14, scope: !638)
!663 = !DILocation(line: 255, column: 21, scope: !638)
!664 = !DILocation(line: 255, column: 10, scope: !638)
!665 = !DILocation(line: 258, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !638, file: !86, line: 258, column: 9)
!667 = !DILocation(line: 258, column: 16, scope: !666)
!668 = !DILocation(line: 258, column: 21, scope: !666)
!669 = !DILocation(line: 258, column: 30, scope: !666)
!670 = !DILocation(line: 258, column: 33, scope: !671)
!671 = !DILexicalBlockFile(scope: !666, file: !86, discriminator: 1)
!672 = !DILocation(line: 258, column: 40, scope: !671)
!673 = !DILocation(line: 258, column: 44, scope: !671)
!674 = !DILocation(line: 258, column: 9, scope: !671)
!675 = !DILocation(line: 259, column: 9, scope: !666)
!676 = !DILocation(line: 262, column: 9, scope: !677)
!677 = distinct !DILexicalBlock(scope: !638, file: !86, line: 262, column: 9)
!678 = !DILocation(line: 262, column: 16, scope: !677)
!679 = !DILocation(line: 262, column: 9, scope: !638)
!680 = !DILocation(line: 263, column: 9, scope: !681)
!681 = distinct !DILexicalBlock(scope: !677, file: !86, line: 262, column: 22)
!682 = !DILocation(line: 263, column: 16, scope: !681)
!683 = !DILocation(line: 263, column: 21, scope: !681)
!684 = !DILocation(line: 264, column: 21, scope: !685)
!685 = distinct !DILexicalBlock(scope: !681, file: !86, line: 264, column: 13)
!686 = !DILocation(line: 264, column: 28, scope: !685)
!687 = !DILocation(line: 264, column: 35, scope: !685)
!688 = !DILocation(line: 264, column: 13, scope: !685)
!689 = !DILocation(line: 264, column: 41, scope: !685)
!690 = !DILocation(line: 264, column: 13, scope: !681)
!691 = !DILocation(line: 265, column: 13, scope: !685)
!692 = !DILocation(line: 266, column: 5, scope: !681)
!693 = !DILocation(line: 270, column: 9, scope: !694)
!694 = distinct !DILexicalBlock(scope: !638, file: !86, line: 270, column: 9)
!695 = !DILocation(line: 270, column: 15, scope: !694)
!696 = !DILocation(line: 270, column: 26, scope: !694)
!697 = !DILocation(line: 270, column: 33, scope: !694)
!698 = !DILocation(line: 270, column: 24, scope: !694)
!699 = !DILocation(line: 270, column: 9, scope: !638)
!700 = !DILocation(line: 271, column: 13, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !86, line: 271, column: 13)
!702 = distinct !DILexicalBlock(scope: !694, file: !86, line: 270, column: 39)
!703 = !DILocation(line: 271, column: 19, scope: !701)
!704 = !DILocation(line: 271, column: 28, scope: !701)
!705 = !DILocation(line: 271, column: 13, scope: !702)
!706 = !DILocation(line: 272, column: 29, scope: !701)
!707 = !DILocation(line: 272, column: 36, scope: !701)
!708 = !DILocation(line: 272, column: 13, scope: !701)
!709 = !DILocation(line: 272, column: 19, scope: !701)
!710 = !DILocation(line: 272, column: 27, scope: !701)
!711 = !DILocation(line: 273, column: 43, scope: !702)
!712 = !DILocation(line: 273, column: 23, scope: !702)
!713 = !DILocation(line: 273, column: 29, scope: !702)
!714 = !DILocation(line: 273, column: 37, scope: !702)
!715 = !DILocation(line: 273, column: 9, scope: !702)
!716 = !DILocation(line: 273, column: 15, scope: !702)
!717 = !DILocation(line: 273, column: 41, scope: !702)
!718 = !DILocation(line: 274, column: 9, scope: !702)
!719 = !DILocation(line: 274, column: 16, scope: !702)
!720 = !DILocation(line: 274, column: 18, scope: !702)
!721 = !DILocation(line: 274, column: 21, scope: !702)
!722 = !DILocation(line: 275, column: 16, scope: !702)
!723 = !DILocation(line: 275, column: 18, scope: !702)
!724 = !DILocation(line: 275, column: 9, scope: !702)
!725 = !DILocation(line: 279, column: 14, scope: !638)
!726 = !DILocation(line: 279, column: 5, scope: !638)
!727 = !DILocation(line: 279, column: 12, scope: !638)
!728 = !DILocation(line: 280, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !638, file: !86, line: 280, column: 9)
!730 = !DILocation(line: 280, column: 23, scope: !729)
!731 = !DILocation(line: 280, column: 9, scope: !729)
!732 = !DILocation(line: 280, column: 31, scope: !729)
!733 = !DILocation(line: 280, column: 9, scope: !638)
!734 = !DILocation(line: 281, column: 9, scope: !729)
!735 = !DILocation(line: 282, column: 12, scope: !638)
!736 = !DILocation(line: 282, column: 14, scope: !638)
!737 = !DILocation(line: 282, column: 5, scope: !638)
!738 = !DILocation(line: 283, column: 1, scope: !638)
!739 = distinct !DISubprogram(name: "gzputs", scope: !86, file: !86, line: 286, type: !740, isLocal: false, isDefinition: true, scopeLine: 289, isOptimized: false, unit: !0, variables: !2)
!740 = !DISubroutineType(types: !741)
!741 = !{!23, !89, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!744 = !DILocalVariable(name: "file", arg: 1, scope: !739, file: !86, line: 287, type: !89)
!745 = !DILocation(line: 287, column: 12, scope: !739)
!746 = !DILocalVariable(name: "str", arg: 2, scope: !739, file: !86, line: 288, type: !742)
!747 = !DILocation(line: 288, column: 17, scope: !739)
!748 = !DILocalVariable(name: "ret", scope: !739, file: !86, line: 290, type: !23)
!749 = !DILocation(line: 290, column: 9, scope: !739)
!750 = !DILocalVariable(name: "len", scope: !739, file: !86, line: 291, type: !16)
!751 = !DILocation(line: 291, column: 14, scope: !739)
!752 = !DILocation(line: 294, column: 28, scope: !739)
!753 = !DILocation(line: 294, column: 21, scope: !739)
!754 = !DILocation(line: 294, column: 11, scope: !739)
!755 = !DILocation(line: 294, column: 9, scope: !739)
!756 = !DILocation(line: 295, column: 19, scope: !739)
!757 = !DILocation(line: 295, column: 25, scope: !739)
!758 = !DILocation(line: 295, column: 30, scope: !739)
!759 = !DILocation(line: 295, column: 11, scope: !739)
!760 = !DILocation(line: 295, column: 9, scope: !739)
!761 = !DILocation(line: 296, column: 12, scope: !739)
!762 = !DILocation(line: 296, column: 16, scope: !739)
!763 = !DILocation(line: 296, column: 21, scope: !739)
!764 = !DILocation(line: 296, column: 24, scope: !765)
!765 = !DILexicalBlockFile(scope: !739, file: !86, discriminator: 1)
!766 = !DILocation(line: 296, column: 28, scope: !765)
!767 = !DILocation(line: 296, column: 12, scope: !765)
!768 = !DILocation(line: 296, column: 12, scope: !769)
!769 = !DILexicalBlockFile(scope: !739, file: !86, discriminator: 2)
!770 = !DILocation(line: 296, column: 40, scope: !771)
!771 = !DILexicalBlockFile(scope: !739, file: !86, discriminator: 3)
!772 = !DILocation(line: 296, column: 12, scope: !771)
!773 = !DILocation(line: 296, column: 12, scope: !774)
!774 = !DILexicalBlockFile(scope: !739, file: !86, discriminator: 4)
!775 = !DILocation(line: 296, column: 5, scope: !774)
!776 = distinct !DISubprogram(name: "gzprintf", scope: !86, file: !86, line: 303, type: !777, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!777 = !DISubroutineType(types: !778)
!778 = !{!23, !89, !742, null}
!779 = !DILocalVariable(name: "file", arg: 1, scope: !776, file: !86, line: 303, type: !89)
!780 = !DILocation(line: 303, column: 22, scope: !776)
!781 = !DILocalVariable(name: "format", arg: 2, scope: !776, file: !86, line: 303, type: !742)
!782 = !DILocation(line: 303, column: 40, scope: !776)
!783 = !DILocalVariable(name: "size", scope: !776, file: !86, line: 305, type: !23)
!784 = !DILocation(line: 305, column: 9, scope: !776)
!785 = !DILocalVariable(name: "len", scope: !776, file: !86, line: 305, type: !23)
!786 = !DILocation(line: 305, column: 15, scope: !776)
!787 = !DILocalVariable(name: "state", scope: !776, file: !86, line: 306, type: !5)
!788 = !DILocation(line: 306, column: 15, scope: !776)
!789 = !DILocalVariable(name: "strm", scope: !776, file: !86, line: 307, type: !109)
!790 = !DILocation(line: 307, column: 15, scope: !776)
!791 = !DILocalVariable(name: "va", scope: !776, file: !86, line: 308, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !793, line: 79, baseType: !794)
!793 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !795, line: 40, baseType: !796)
!795 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 308, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 192, align: 64, elements: !647)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 308, size: 192, align: 64, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !798, file: !1, line: 308, baseType: !16, size: 32, align: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !798, file: !1, line: 308, baseType: !16, size: 32, align: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !798, file: !1, line: 308, baseType: !4, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !798, file: !1, line: 308, baseType: !4, size: 64, align: 64, offset: 128)
!804 = !DILocation(line: 308, column: 13, scope: !776)
!805 = !DILocation(line: 311, column: 9, scope: !806)
!806 = distinct !DILexicalBlock(scope: !776, file: !86, line: 311, column: 9)
!807 = !DILocation(line: 311, column: 14, scope: !806)
!808 = !DILocation(line: 311, column: 9, scope: !776)
!809 = !DILocation(line: 312, column: 9, scope: !806)
!810 = !DILocation(line: 313, column: 24, scope: !776)
!811 = !DILocation(line: 313, column: 13, scope: !776)
!812 = !DILocation(line: 313, column: 11, scope: !776)
!813 = !DILocation(line: 314, column: 14, scope: !776)
!814 = !DILocation(line: 314, column: 21, scope: !776)
!815 = !DILocation(line: 314, column: 10, scope: !776)
!816 = !DILocation(line: 317, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !776, file: !86, line: 317, column: 9)
!818 = !DILocation(line: 317, column: 16, scope: !817)
!819 = !DILocation(line: 317, column: 21, scope: !817)
!820 = !DILocation(line: 317, column: 30, scope: !817)
!821 = !DILocation(line: 317, column: 33, scope: !822)
!822 = !DILexicalBlockFile(scope: !817, file: !86, discriminator: 1)
!823 = !DILocation(line: 317, column: 40, scope: !822)
!824 = !DILocation(line: 317, column: 44, scope: !822)
!825 = !DILocation(line: 317, column: 9, scope: !822)
!826 = !DILocation(line: 318, column: 9, scope: !817)
!827 = !DILocation(line: 321, column: 9, scope: !828)
!828 = distinct !DILexicalBlock(scope: !776, file: !86, line: 321, column: 9)
!829 = !DILocation(line: 321, column: 16, scope: !828)
!830 = !DILocation(line: 321, column: 21, scope: !828)
!831 = !DILocation(line: 321, column: 26, scope: !828)
!832 = !DILocation(line: 321, column: 37, scope: !833)
!833 = !DILexicalBlockFile(scope: !828, file: !86, discriminator: 1)
!834 = !DILocation(line: 321, column: 29, scope: !833)
!835 = !DILocation(line: 321, column: 44, scope: !833)
!836 = !DILocation(line: 321, column: 9, scope: !833)
!837 = !DILocation(line: 322, column: 9, scope: !828)
!838 = !DILocation(line: 325, column: 9, scope: !839)
!839 = distinct !DILexicalBlock(scope: !776, file: !86, line: 325, column: 9)
!840 = !DILocation(line: 325, column: 16, scope: !839)
!841 = !DILocation(line: 325, column: 9, scope: !776)
!842 = !DILocation(line: 326, column: 9, scope: !843)
!843 = distinct !DILexicalBlock(scope: !839, file: !86, line: 325, column: 22)
!844 = !DILocation(line: 326, column: 16, scope: !843)
!845 = !DILocation(line: 326, column: 21, scope: !843)
!846 = !DILocation(line: 327, column: 21, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !86, line: 327, column: 13)
!848 = !DILocation(line: 327, column: 28, scope: !847)
!849 = !DILocation(line: 327, column: 35, scope: !847)
!850 = !DILocation(line: 327, column: 13, scope: !847)
!851 = !DILocation(line: 327, column: 41, scope: !847)
!852 = !DILocation(line: 327, column: 13, scope: !843)
!853 = !DILocation(line: 328, column: 13, scope: !847)
!854 = !DILocation(line: 329, column: 5, scope: !843)
!855 = !DILocation(line: 332, column: 9, scope: !856)
!856 = distinct !DILexicalBlock(scope: !776, file: !86, line: 332, column: 9)
!857 = !DILocation(line: 332, column: 15, scope: !856)
!858 = !DILocation(line: 332, column: 24, scope: !856)
!859 = !DILocation(line: 332, column: 35, scope: !860)
!860 = !DILexicalBlockFile(scope: !856, file: !86, discriminator: 1)
!861 = !DILocation(line: 332, column: 27, scope: !860)
!862 = !DILocation(line: 332, column: 45, scope: !860)
!863 = !DILocation(line: 332, column: 9, scope: !860)
!864 = !DILocation(line: 333, column: 9, scope: !856)
!865 = !DILocation(line: 336, column: 18, scope: !776)
!866 = !DILocation(line: 336, column: 25, scope: !776)
!867 = !DILocation(line: 336, column: 10, scope: !776)
!868 = !DILocation(line: 337, column: 15, scope: !776)
!869 = !DILocation(line: 337, column: 20, scope: !776)
!870 = !DILocation(line: 337, column: 5, scope: !776)
