; ModuleID = './[inter]third-party--zlib-1.2.7--trees.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--trees.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.static_tree_desc_s = type { %struct.ct_data_s*, i32*, i32, i32, i32 }
%struct.ct_data_s = type { %union.anon, %union.anon.0 }
%union.anon = type { i16 }
%union.anon.0 = type { i16 }
%struct.internal_state = type { %struct.z_stream_s*, i32, i8*, i64, i8*, i32, i32, %struct.gz_header_s*, i32, i8, i32, i32, i32, i32, i8*, i64, i16*, i16*, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [573 x %struct.ct_data_s], [61 x %struct.ct_data_s], [39 x %struct.ct_data_s], %struct.tree_desc_s, %struct.tree_desc_s, %struct.tree_desc_s, [16 x i16], [573 x i32], i32, i32, [573 x i8], i8*, i32, i32, i16*, i64, i64, i32, i32, i16, i32, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }
%struct.tree_desc_s = type { %struct.ct_data_s*, i32, %struct.static_tree_desc_s* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !55)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--trees.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!2 = !{}
!3 = !{!4, !5, !8, !10, !11, !49, !17, !51, !53, !54}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !6, line: 43, baseType: !7)
!6 = !DIFile(filename: "zutil.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!7 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !6, line: 41, baseType: !9)
!9 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!10 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree_desc", file: !13, line: 87, baseType: !14)
!13 = !DIFile(filename: "deflate.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc_s", file: !13, line: 83, size: 192, align: 64, elements: !15)
!15 = !{!16, !31, !32}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !14, file: !13, line: 84, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !13, line: 74, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data_s", file: !13, line: 65, size: 32, align: 16, elements: !20)
!20 = !{!21, !26}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !19, file: !13, line: 69, baseType: !22, size: 16, align: 16)
!22 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !19, file: !13, line: 66, size: 16, align: 16, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !22, file: !13, line: 67, baseType: !5, size: 16, align: 16)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !22, file: !13, line: 68, baseType: !5, size: 16, align: 16)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !19, file: !13, line: 73, baseType: !27, size: 16, align: 16, offset: 16)
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !19, file: !13, line: 70, size: 16, align: 16, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !27, file: !13, line: 71, baseType: !5, size: 16, align: 16)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !27, file: !13, line: 72, baseType: !5, size: 16, align: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !14, file: !13, line: 85, baseType: !4, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stat_desc", scope: !14, file: !13, line: 86, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_tree_desc", file: !13, line: 81, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_tree_desc_s", file: !36, line: 117, size: 256, align: 64, elements: !37)
!36 = !DIFile(filename: "trees.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!37 = !{!38, !41, !46, !47, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "static_tree", scope: !35, file: !36, line: 118, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "extra_bits", scope: !35, file: !36, line: 119, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "intf", file: !45, line: 377, baseType: !4)
!45 = !DIFile(filename: "zconf.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "extra_base", scope: !35, file: !36, line: 120, baseType: !4, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !35, file: !36, line: 121, baseType: !4, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !35, file: !36, line: 122, baseType: !4, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !6, line: 45, baseType: !52)
!52 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!53 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !45, line: 365, baseType: !9)
!55 = !{!56, !62, !66, !67, !72, !73, !77, !78, !82, !86, !88, !90, !91}
!56 = distinct !DIGlobalVariable(name: "_dist_code", scope: !0, file: !57, line: 73, type: !58, isLocal: false, isDefinition: true, variable: [512 x i8]* @_dist_code)
!57 = !DIFile(filename: "trees.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 4096, align: 8, elements: !60)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!60 = !{!61}
!61 = !DISubrange(count: 512)
!62 = distinct !DIGlobalVariable(name: "_length_code", scope: !0, file: !57, line: 102, type: !63, isLocal: false, isDefinition: true, variable: [256 x i8]* @_length_code)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, align: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 256)
!66 = distinct !DIGlobalVariable(name: "static_l_desc", scope: !0, file: !36, line: 125, type: !34, isLocal: true, isDefinition: true, variable: %struct.static_tree_desc_s* @static_l_desc)
!67 = distinct !DIGlobalVariable(name: "extra_lbits", scope: !0, file: !36, line: 62, type: !68, isLocal: true, isDefinition: true, variable: [29 x i32]* @extra_lbits)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 928, align: 32, elements: !70)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!70 = !{!71}
!71 = !DISubrange(count: 29)
!72 = distinct !DIGlobalVariable(name: "static_d_desc", scope: !0, file: !36, line: 128, type: !34, isLocal: true, isDefinition: true, variable: %struct.static_tree_desc_s* @static_d_desc)
!73 = distinct !DIGlobalVariable(name: "extra_dbits", scope: !0, file: !36, line: 65, type: !74, isLocal: true, isDefinition: true, variable: [30 x i32]* @extra_dbits)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 960, align: 32, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 30)
!77 = distinct !DIGlobalVariable(name: "static_bl_desc", scope: !0, file: !36, line: 131, type: !34, isLocal: true, isDefinition: true, variable: %struct.static_tree_desc_s* @static_bl_desc)
!78 = distinct !DIGlobalVariable(name: "extra_blbits", scope: !0, file: !36, line: 68, type: !79, isLocal: true, isDefinition: true, variable: [19 x i32]* @extra_blbits)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 608, align: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 19)
!82 = distinct !DIGlobalVariable(name: "static_ltree", scope: !0, file: !57, line: 3, type: !83, isLocal: true, isDefinition: true, variable: [288 x %struct.ct_data_s]* @static_ltree)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 9216, align: 16, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 288)
!86 = distinct !DIGlobalVariable(name: "bl_order", scope: !0, file: !36, line: 71, type: !87, isLocal: true, isDefinition: true, variable: [19 x i8]* @bl_order)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 152, align: 8, elements: !80)
!88 = distinct !DIGlobalVariable(name: "static_dtree", scope: !0, file: !57, line: 64, type: !89, isLocal: true, isDefinition: true, variable: [30 x %struct.ct_data_s]* @static_dtree)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 960, align: 16, elements: !75)
!90 = distinct !DIGlobalVariable(name: "base_length", scope: !0, file: !57, line: 118, type: !68, isLocal: true, isDefinition: true, variable: [29 x i32]* @base_length)
!91 = distinct !DIGlobalVariable(name: "base_dist", scope: !0, file: !57, line: 123, type: !74, isLocal: true, isDefinition: true, variable: [30 x i32]* @base_dist)
!92 = !{i32 2, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!95 = distinct !DISubprogram(name: "_tr_init", scope: !36, file: !36, line: 381, type: !96, isLocal: false, isDefinition: true, scopeLine: 383, isOptimized: false, unit: !0, variables: !2)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "deflate_state", file: !13, line: 273, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !13, line: 97, size: 47488, align: 64, elements: !101)
!101 = !{!102, !138, !139, !140, !141, !142, !143, !144, !163, !164, !165, !166, !167, !168, !169, !170, !171, !175, !176, !177, !178, !179, !180, !181, !182, !183, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !200, !204, !208, !209, !210, !211, !215, !217, !218, !219, !221, !224, !225, !226, !229, !230, !231, !232, !233, !234, !235}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !100, file: !13, line: 98, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !104, line: 106, baseType: !105)
!104 = !DIFile(filename: "zlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !104, line: 104, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !104, line: 85, size: 896, align: 64, elements: !108)
!108 = !{!109, !112, !114, !116, !117, !118, !119, !120, !122, !129, !134, !135, !136, !137}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !107, file: !104, line: 86, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !45, line: 374, baseType: !54)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !107, file: !104, line: 87, baseType: !113, size: 32, align: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !45, line: 367, baseType: !10)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !107, file: !104, line: 88, baseType: !115, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !45, line: 368, baseType: !52)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !107, file: !104, line: 90, baseType: !110, size: 64, align: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !107, file: !104, line: 91, baseType: !113, size: 32, align: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !107, file: !104, line: 92, baseType: !115, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !107, file: !104, line: 94, baseType: !49, size: 64, align: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !107, file: !104, line: 95, baseType: !121, size: 64, align: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !107, file: !104, line: 97, baseType: !123, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !104, line: 80, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !127, !113, !113}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !45, line: 383, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !107, file: !104, line: 98, baseType: !130, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !104, line: 81, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !127, !127}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !107, file: !104, line: 99, baseType: !127, size: 64, align: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !107, file: !104, line: 101, baseType: !4, size: 32, align: 32, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !107, file: !104, line: 102, baseType: !115, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !107, file: !104, line: 103, baseType: !115, size: 64, align: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !100, file: !13, line: 99, baseType: !4, size: 32, align: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf", scope: !100, file: !13, line: 100, baseType: !110, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf_size", scope: !100, file: !13, line: 101, baseType: !51, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pending_out", scope: !100, file: !13, line: 102, baseType: !110, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !100, file: !13, line: 103, baseType: !113, size: 32, align: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !100, file: !13, line: 104, baseType: !4, size: 32, align: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !100, file: !13, line: 105, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !104, line: 129, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !104, line: 127, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !104, line: 112, size: 640, align: 64, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !148, file: !104, line: 113, baseType: !4, size: 32, align: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !148, file: !104, line: 114, baseType: !115, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !148, file: !104, line: 115, baseType: !4, size: 32, align: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !148, file: !104, line: 116, baseType: !4, size: 32, align: 32, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !148, file: !104, line: 117, baseType: !110, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !148, file: !104, line: 118, baseType: !113, size: 32, align: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !148, file: !104, line: 119, baseType: !113, size: 32, align: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !104, line: 120, baseType: !110, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !148, file: !104, line: 121, baseType: !113, size: 32, align: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !148, file: !104, line: 122, baseType: !110, size: 64, align: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !148, file: !104, line: 123, baseType: !113, size: 32, align: 32, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !148, file: !104, line: 124, baseType: !4, size: 32, align: 32, offset: 544)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !148, file: !104, line: 125, baseType: !4, size: 32, align: 32, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "gzindex", scope: !100, file: !13, line: 106, baseType: !113, size: 32, align: 32, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !100, file: !13, line: 107, baseType: !54, size: 8, align: 8, offset: 480)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "last_flush", scope: !100, file: !13, line: 108, baseType: !4, size: 32, align: 32, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "w_size", scope: !100, file: !13, line: 112, baseType: !113, size: 32, align: 32, offset: 544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "w_bits", scope: !100, file: !13, line: 113, baseType: !113, size: 32, align: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "w_mask", scope: !100, file: !13, line: 114, baseType: !113, size: 32, align: 32, offset: 608)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !100, file: !13, line: 116, baseType: !110, size: 64, align: 64, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !100, file: !13, line: 126, baseType: !51, size: 64, align: 64, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !13, line: 131, baseType: !172, size: 64, align: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "Posf", file: !13, line: 90, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !13, line: 89, baseType: !5)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !13, line: 137, baseType: !172, size: 64, align: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ins_h", scope: !100, file: !13, line: 139, baseType: !113, size: 32, align: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !100, file: !13, line: 140, baseType: !113, size: 32, align: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !100, file: !13, line: 141, baseType: !113, size: 32, align: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !100, file: !13, line: 142, baseType: !113, size: 32, align: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "hash_shift", scope: !100, file: !13, line: 144, baseType: !113, size: 32, align: 32, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !100, file: !13, line: 151, baseType: !53, size: 64, align: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "match_length", scope: !100, file: !13, line: 156, baseType: !113, size: 32, align: 32, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev_match", scope: !100, file: !13, line: 157, baseType: !184, size: 32, align: 32, offset: 1184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !13, line: 91, baseType: !10)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "match_available", scope: !100, file: !13, line: 158, baseType: !4, size: 32, align: 32, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "strstart", scope: !100, file: !13, line: 159, baseType: !113, size: 32, align: 32, offset: 1248)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "match_start", scope: !100, file: !13, line: 160, baseType: !113, size: 32, align: 32, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !100, file: !13, line: 161, baseType: !113, size: 32, align: 32, offset: 1312)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev_length", scope: !100, file: !13, line: 163, baseType: !113, size: 32, align: 32, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !100, file: !13, line: 168, baseType: !113, size: 32, align: 32, offset: 1376)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy_match", scope: !100, file: !13, line: 174, baseType: !113, size: 32, align: 32, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !100, file: !13, line: 185, baseType: !4, size: 32, align: 32, offset: 1440)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !100, file: !13, line: 186, baseType: !4, size: 32, align: 32, offset: 1472)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "good_match", scope: !100, file: !13, line: 188, baseType: !113, size: 32, align: 32, offset: 1504)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nice_match", scope: !100, file: !13, line: 191, baseType: !4, size: 32, align: 32, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_ltree", scope: !100, file: !13, line: 195, baseType: !197, size: 18336, align: 16, offset: 1568)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 18336, align: 16, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 573)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dtree", scope: !100, file: !13, line: 196, baseType: !201, size: 1952, align: 16, offset: 19904)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1952, align: 16, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 61)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bl_tree", scope: !100, file: !13, line: 197, baseType: !205, size: 1248, align: 16, offset: 21856)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1248, align: 16, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 39)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "l_desc", scope: !100, file: !13, line: 199, baseType: !14, size: 192, align: 64, offset: 23104)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "d_desc", scope: !100, file: !13, line: 200, baseType: !14, size: 192, align: 64, offset: 23296)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "bl_desc", scope: !100, file: !13, line: 201, baseType: !14, size: 192, align: 64, offset: 23488)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bl_count", scope: !100, file: !13, line: 203, baseType: !212, size: 256, align: 16, offset: 23680)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, align: 16, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !100, file: !13, line: 206, baseType: !216, size: 18336, align: 32, offset: 23936)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 18336, align: 32, elements: !198)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "heap_len", scope: !100, file: !13, line: 207, baseType: !4, size: 32, align: 32, offset: 42272)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "heap_max", scope: !100, file: !13, line: 208, baseType: !4, size: 32, align: 32, offset: 42304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !100, file: !13, line: 213, baseType: !220, size: 4584, align: 8, offset: 42336)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 4584, align: 8, elements: !198)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l_buf", scope: !100, file: !13, line: 217, baseType: !222, size: 64, align: 64, offset: 46976)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchf", file: !6, line: 42, baseType: !8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lit_bufsize", scope: !100, file: !13, line: 219, baseType: !113, size: 32, align: 32, offset: 47040)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last_lit", scope: !100, file: !13, line: 239, baseType: !113, size: 32, align: 32, offset: 47072)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "d_buf", scope: !100, file: !13, line: 241, baseType: !227, size: 64, align: 64, offset: 47104)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ushf", file: !6, line: 44, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !100, file: !13, line: 247, baseType: !51, size: 64, align: 64, offset: 47168)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "static_len", scope: !100, file: !13, line: 248, baseType: !51, size: 64, align: 64, offset: 47232)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !100, file: !13, line: 249, baseType: !113, size: 32, align: 32, offset: 47296)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !100, file: !13, line: 250, baseType: !113, size: 32, align: 32, offset: 47328)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bi_buf", scope: !100, file: !13, line: 257, baseType: !5, size: 16, align: 16, offset: 47360)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bi_valid", scope: !100, file: !13, line: 261, baseType: !4, size: 32, align: 32, offset: 47392)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "high_water", scope: !100, file: !13, line: 266, baseType: !51, size: 64, align: 64, offset: 47424)
!236 = !DILocalVariable(name: "s", arg: 1, scope: !95, file: !36, line: 382, type: !98)
!237 = !DIExpression()
!238 = !DILocation(line: 382, column: 20, scope: !95)
!239 = !DILocation(line: 384, column: 5, scope: !95)
!240 = !DILocation(line: 386, column: 26, scope: !95)
!241 = !DILocation(line: 386, column: 29, scope: !95)
!242 = !DILocation(line: 386, column: 5, scope: !95)
!243 = !DILocation(line: 386, column: 8, scope: !95)
!244 = !DILocation(line: 386, column: 15, scope: !95)
!245 = !DILocation(line: 386, column: 24, scope: !95)
!246 = !DILocation(line: 387, column: 5, scope: !95)
!247 = !DILocation(line: 387, column: 8, scope: !95)
!248 = !DILocation(line: 387, column: 15, scope: !95)
!249 = !DILocation(line: 387, column: 25, scope: !95)
!250 = !DILocation(line: 389, column: 26, scope: !95)
!251 = !DILocation(line: 389, column: 29, scope: !95)
!252 = !DILocation(line: 389, column: 5, scope: !95)
!253 = !DILocation(line: 389, column: 8, scope: !95)
!254 = !DILocation(line: 389, column: 15, scope: !95)
!255 = !DILocation(line: 389, column: 24, scope: !95)
!256 = !DILocation(line: 390, column: 5, scope: !95)
!257 = !DILocation(line: 390, column: 8, scope: !95)
!258 = !DILocation(line: 390, column: 15, scope: !95)
!259 = !DILocation(line: 390, column: 25, scope: !95)
!260 = !DILocation(line: 392, column: 27, scope: !95)
!261 = !DILocation(line: 392, column: 30, scope: !95)
!262 = !DILocation(line: 392, column: 5, scope: !95)
!263 = !DILocation(line: 392, column: 8, scope: !95)
!264 = !DILocation(line: 392, column: 16, scope: !95)
!265 = !DILocation(line: 392, column: 25, scope: !95)
!266 = !DILocation(line: 393, column: 5, scope: !95)
!267 = !DILocation(line: 393, column: 8, scope: !95)
!268 = !DILocation(line: 393, column: 16, scope: !95)
!269 = !DILocation(line: 393, column: 26, scope: !95)
!270 = !DILocation(line: 395, column: 5, scope: !95)
!271 = !DILocation(line: 395, column: 8, scope: !95)
!272 = !DILocation(line: 395, column: 15, scope: !95)
!273 = !DILocation(line: 396, column: 5, scope: !95)
!274 = !DILocation(line: 396, column: 8, scope: !95)
!275 = !DILocation(line: 396, column: 17, scope: !95)
!276 = !DILocation(line: 403, column: 16, scope: !95)
!277 = !DILocation(line: 403, column: 5, scope: !95)
!278 = !DILocation(line: 404, column: 1, scope: !95)
!279 = distinct !DISubprogram(name: "tr_static_init", scope: !36, file: !36, line: 234, type: !280, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !DILocation(line: 314, column: 1, scope: !279)
!283 = distinct !DISubprogram(name: "init_block", scope: !36, file: !36, line: 409, type: !96, isLocal: true, isDefinition: true, scopeLine: 411, isOptimized: false, unit: !0, variables: !2)
!284 = !DILocalVariable(name: "s", arg: 1, scope: !283, file: !36, line: 410, type: !98)
!285 = !DILocation(line: 410, column: 20, scope: !283)
!286 = !DILocalVariable(name: "n", scope: !283, file: !36, line: 412, type: !4)
!287 = !DILocation(line: 412, column: 9, scope: !283)
!288 = !DILocation(line: 415, column: 12, scope: !289)
!289 = distinct !DILexicalBlock(scope: !283, file: !36, line: 415, column: 5)
!290 = !DILocation(line: 415, column: 10, scope: !289)
!291 = !DILocation(line: 415, column: 17, scope: !292)
!292 = !DILexicalBlockFile(scope: !293, file: !36, discriminator: 1)
!293 = distinct !DILexicalBlock(scope: !289, file: !36, line: 415, column: 5)
!294 = !DILocation(line: 415, column: 19, scope: !292)
!295 = !DILocation(line: 415, column: 5, scope: !292)
!296 = !DILocation(line: 415, column: 52, scope: !297)
!297 = !DILexicalBlockFile(scope: !293, file: !36, discriminator: 2)
!298 = !DILocation(line: 415, column: 39, scope: !297)
!299 = !DILocation(line: 415, column: 42, scope: !297)
