; ModuleID = './[inter]third-party--zlib-1.2.7--infback.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--infback.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.code = type { i8, i8, i16 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.inflate_state = type { i32, i32, i32, i32, i32, i32, i64, i64, %struct.gz_header_s*, i32, i32, i32, i32, i8*, i64, i32, i32, i32, i32, %struct.code*, %struct.code*, i32, i32, i32, i32, i32, i32, %struct.code*, [320 x i16], [288 x i16], [1444 x %struct.code], i32, i32, i32 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"1.2.7\00", align 1
@inflateBack.order = internal constant [19 x i16] [i16 16, i16 17, i16 18, i16 0, i16 8, i16 7, i16 9, i16 6, i16 10, i16 5, i16 11, i16 4, i16 12, i16 3, i16 13, i16 2, i16 14, i16 1, i16 15], align 16
@.str.1 = private unnamed_addr constant [19 x i8] c"invalid block type\00", align 1
@.str.2 = private unnamed_addr constant [29 x i8] c"invalid stored block lengths\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"too many length or distance symbols\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"invalid code lengths set\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !44, globals: !146)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--infback.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!2 = !{!3, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 20, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "inflate.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!6 = !DIEnumerator(name: "HEAD", value: 0)
!7 = !DIEnumerator(name: "FLAGS", value: 1)
!8 = !DIEnumerator(name: "TIME", value: 2)
!9 = !DIEnumerator(name: "OS", value: 3)
!10 = !DIEnumerator(name: "EXLEN", value: 4)
!11 = !DIEnumerator(name: "EXTRA", value: 5)
!12 = !DIEnumerator(name: "NAME", value: 6)
!13 = !DIEnumerator(name: "COMMENT", value: 7)
!14 = !DIEnumerator(name: "HCRC", value: 8)
!15 = !DIEnumerator(name: "DICTID", value: 9)
!16 = !DIEnumerator(name: "DICT", value: 10)
!17 = !DIEnumerator(name: "TYPE", value: 11)
!18 = !DIEnumerator(name: "TYPEDO", value: 12)
!19 = !DIEnumerator(name: "STORED", value: 13)
!20 = !DIEnumerator(name: "COPY_", value: 14)
!21 = !DIEnumerator(name: "COPY", value: 15)
!22 = !DIEnumerator(name: "TABLE", value: 16)
!23 = !DIEnumerator(name: "LENLENS", value: 17)
!24 = !DIEnumerator(name: "CODELENS", value: 18)
!25 = !DIEnumerator(name: "LEN_", value: 19)
!26 = !DIEnumerator(name: "LEN", value: 20)
!27 = !DIEnumerator(name: "LENEXT", value: 21)
!28 = !DIEnumerator(name: "DIST", value: 22)
!29 = !DIEnumerator(name: "DISTEXT", value: 23)
!30 = !DIEnumerator(name: "MATCH", value: 24)
!31 = !DIEnumerator(name: "LIT", value: 25)
!32 = !DIEnumerator(name: "CHECK", value: 26)
!33 = !DIEnumerator(name: "LENGTH", value: 27)
!34 = !DIEnumerator(name: "DONE", value: 28)
!35 = !DIEnumerator(name: "BAD", value: 29)
!36 = !DIEnumerator(name: "MEM", value: 30)
!37 = !DIEnumerator(name: "SYNC", value: 31)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 54, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "inftrees.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "CODES", value: 0)
!42 = !DIEnumerator(name: "LENS", value: 1)
!43 = !DIEnumerator(name: "DISTS", value: 2)
!44 = !{!45, !46, !51, !56, !60, !142, !55, !71, !144, !117, !109, !88}
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !47, line: 80, baseType: !48)
!47 = !DIFile(filename: "zlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !51, !54, !54}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !52, line: 383, baseType: !53)
!52 = !DIFile(filename: "zconf.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !52, line: 367, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !47, line: 81, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !51, !51}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inflate_state", file: !4, line: 81, size: 57216, align: 64, elements: !62)
!62 = !{!63, !65, !66, !67, !68, !69, !70, !72, !73, !97, !98, !99, !100, !101, !103, !104, !105, !106, !107, !108, !118, !119, !120, !121, !122, !123, !124, !125, !127, !131, !135, !139, !140, !141}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !61, file: !4, line: 82, baseType: !64, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "inflate_mode", file: !4, line: 53, baseType: !3)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !61, file: !4, line: 83, baseType: !45, size: 32, align: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !61, file: !4, line: 84, baseType: !45, size: 32, align: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !61, file: !4, line: 85, baseType: !45, size: 32, align: 32, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !4, line: 86, baseType: !45, size: 32, align: 32, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !61, file: !4, line: 87, baseType: !55, size: 32, align: 32, offset: 160)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !61, file: !4, line: 88, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !61, file: !4, line: 89, baseType: !71, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !61, file: !4, line: 90, baseType: !74, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !47, line: 129, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !47, line: 127, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !47, line: 112, size: 640, align: 64, elements: !78)
!78 = !{!79, !80, !82, !83, !84, !89, !90, !91, !92, !93, !94, !95, !96}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !77, file: !47, line: 113, baseType: !45, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !77, file: !47, line: 114, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !52, line: 368, baseType: !71)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !77, file: !47, line: 115, baseType: !45, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !77, file: !47, line: 116, baseType: !45, size: 32, align: 32, offset: 160)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !77, file: !47, line: 117, baseType: !85, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !52, line: 374, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !52, line: 365, baseType: !88)
!88 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !77, file: !47, line: 118, baseType: !54, size: 32, align: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !77, file: !47, line: 119, baseType: !54, size: 32, align: 32, offset: 288)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !47, line: 120, baseType: !85, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !77, file: !47, line: 121, baseType: !54, size: 32, align: 32, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !77, file: !47, line: 122, baseType: !85, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !77, file: !47, line: 123, baseType: !54, size: 32, align: 32, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !77, file: !47, line: 124, baseType: !45, size: 32, align: 32, offset: 544)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !77, file: !47, line: 125, baseType: !45, size: 32, align: 32, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "wbits", scope: !61, file: !4, line: 92, baseType: !55, size: 32, align: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !61, file: !4, line: 93, baseType: !55, size: 32, align: 32, offset: 416)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "whave", scope: !61, file: !4, line: 94, baseType: !55, size: 32, align: 32, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "wnext", scope: !61, file: !4, line: 95, baseType: !55, size: 32, align: 32, offset: 480)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !61, file: !4, line: 96, baseType: !102, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !61, file: !4, line: 98, baseType: !71, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !61, file: !4, line: 99, baseType: !55, size: 32, align: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !61, file: !4, line: 101, baseType: !55, size: 32, align: 32, offset: 672)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !61, file: !4, line: 102, baseType: !55, size: 32, align: 32, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !61, file: !4, line: 104, baseType: !55, size: 32, align: 32, offset: 736)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "lencode", scope: !61, file: !4, line: 106, baseType: !109, size: 64, align: 64, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "code", file: !39, line: 28, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 24, size: 32, align: 16, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !112, file: !39, line: 25, baseType: !88, size: 8, align: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !112, file: !39, line: 26, baseType: !88, size: 8, align: 8, offset: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !39, line: 27, baseType: !117, size: 16, align: 16, offset: 16)
!117 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "distcode", scope: !61, file: !4, line: 107, baseType: !109, size: 64, align: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lenbits", scope: !61, file: !4, line: 108, baseType: !55, size: 32, align: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "distbits", scope: !61, file: !4, line: 109, baseType: !55, size: 32, align: 32, offset: 928)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ncode", scope: !61, file: !4, line: 111, baseType: !55, size: 32, align: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !61, file: !4, line: 112, baseType: !55, size: 32, align: 32, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ndist", scope: !61, file: !4, line: 113, baseType: !55, size: 32, align: 32, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !61, file: !4, line: 114, baseType: !55, size: 32, align: 32, offset: 1056)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !4, line: 115, baseType: !126, size: 64, align: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !61, file: !4, line: 116, baseType: !128, size: 5120, align: 16, offset: 1152)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 5120, align: 16, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !61, file: !4, line: 117, baseType: !132, size: 4608, align: 16, offset: 6272)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 4608, align: 16, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !61, file: !4, line: 118, baseType: !136, size: 46208, align: 16, offset: 10880)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 46208, align: 16, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1444)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sane", scope: !61, file: !4, line: 119, baseType: !45, size: 32, align: 32, offset: 57088)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !61, file: !4, line: 120, baseType: !45, size: 32, align: 32, offset: 57120)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "was", scope: !61, file: !4, line: 121, baseType: !55, size: 32, align: 32, offset: 57152)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !47, line: 83, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!146 = !{!147, !185, !193}
!147 = distinct !DIGlobalVariable(name: "order", scope: !148, file: !149, line: 269, type: !181, isLocal: true, isDefinition: true, variable: [19 x i16]* @inflateBack.order)
!148 = distinct !DISubprogram(name: "inflateBack", scope: !149, file: !149, line: 250, type: !150, isLocal: false, isDefinition: true, scopeLine: 256, isOptimized: false, unit: !0, variables: !180)
!149 = !DIFile(filename: "infback.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!150 = !DISubroutineType(types: !151)
!151 = !{!45, !152, !171, !53, !176, !53}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !47, line: 106, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !47, line: 104, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !47, line: 85, size: 896, align: 64, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !155, file: !47, line: 86, baseType: !85, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !155, file: !47, line: 87, baseType: !54, size: 32, align: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !155, file: !47, line: 88, baseType: !81, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !155, file: !47, line: 90, baseType: !85, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !155, file: !47, line: 91, baseType: !54, size: 32, align: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !155, file: !47, line: 92, baseType: !81, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !155, file: !47, line: 94, baseType: !144, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !47, line: 95, baseType: !142, size: 64, align: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !155, file: !47, line: 97, baseType: !46, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !155, file: !47, line: 98, baseType: !56, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !155, file: !47, line: 99, baseType: !51, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !155, file: !47, line: 101, baseType: !45, size: 32, align: 32, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !155, file: !47, line: 102, baseType: !81, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !155, file: !47, line: 103, baseType: !81, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_func", file: !47, line: 1010, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!55, !53, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "out_func", file: !47, line: 1011, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!45, !53, !102, !55}
!180 = !{}
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 304, align: 16, elements: !183)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!183 = !{!184}
!184 = !DISubrange(count: 19)
!185 = distinct !DIGlobalVariable(name: "lenfix", scope: !186, file: !189, line: 10, type: !190, isLocal: true, isDefinition: true, variable: [512 x %struct.code]* @fixedtables.lenfix)
!186 = distinct !DISubprogram(name: "fixedtables", scope: !149, file: !149, line: 82, type: !187, isLocal: true, isDefinition: true, scopeLine: 84, isOptimized: false, unit: !0, variables: !180)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !60}
!189 = !DIFile(filename: "inffixed.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 16384, align: 16, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 512)
!193 = distinct !DIGlobalVariable(name: "distfix", scope: !186, file: !189, line: 87, type: !194, isLocal: true, isDefinition: true, variable: [32 x %struct.code]* @fixedtables.distfix)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1024, align: 16, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 32)
!197 = !{i32 2, !"Dwarf Version", i32 4}
!198 = !{i32 2, !"Debug Info Version", i32 3}
!199 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!200 = distinct !DISubprogram(name: "inflateBackInit_", scope: !149, file: !149, line: 28, type: !201, isLocal: false, isDefinition: true, scopeLine: 34, isOptimized: false, unit: !0, variables: !180)
!201 = !DISubroutineType(types: !202)
!202 = !{!45, !152, !45, !102, !203, !45}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!205 = !DILocalVariable(name: "strm", arg: 1, scope: !200, file: !149, line: 29, type: !152)
!206 = !DIExpression()
!207 = !DILocation(line: 29, column: 11, scope: !200)
!208 = !DILocalVariable(name: "windowBits", arg: 2, scope: !200, file: !149, line: 30, type: !45)
!209 = !DILocation(line: 30, column: 5, scope: !200)
!210 = !DILocalVariable(name: "window", arg: 3, scope: !200, file: !149, line: 31, type: !102)
!211 = !DILocation(line: 31, column: 16, scope: !200)
!212 = !DILocalVariable(name: "version", arg: 4, scope: !200, file: !149, line: 32, type: !203)
!213 = !DILocation(line: 32, column: 13, scope: !200)
!214 = !DILocalVariable(name: "stream_size", arg: 5, scope: !200, file: !149, line: 33, type: !45)
!215 = !DILocation(line: 33, column: 5, scope: !200)
!216 = !DILocalVariable(name: "state", scope: !200, file: !149, line: 35, type: !60)
!217 = !DILocation(line: 35, column: 27, scope: !200)
!218 = !DILocation(line: 37, column: 9, scope: !219)
!219 = distinct !DILexicalBlock(scope: !200, file: !149, line: 37, column: 9)
!220 = !DILocation(line: 37, column: 17, scope: !219)
!221 = !DILocation(line: 37, column: 22, scope: !219)
!222 = !DILocation(line: 37, column: 25, scope: !223)
!223 = !DILexicalBlockFile(scope: !219, file: !149, discriminator: 1)
!224 = !DILocation(line: 37, column: 39, scope: !223)
!225 = !DILocation(line: 37, column: 36, scope: !223)
!226 = !DILocation(line: 37, column: 50, scope: !223)
