; ModuleID = './[inter]third-party--zlib-1.2.7--deflate.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--deflate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.config_s = type { i16, i16, i16, i16, i32 (%struct.internal_state*, i32)* }
%struct.internal_state = type { %struct.z_stream_s*, i32, i8*, i64, i8*, i32, i32, %struct.gz_header_s*, i32, i8, i32, i32, i32, i32, i8*, i64, i16*, i16*, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [573 x %struct.ct_data_s], [61 x %struct.ct_data_s], [39 x %struct.ct_data_s], %struct.tree_desc_s, %struct.tree_desc_s, %struct.tree_desc_s, [16 x i16], [573 x i32], i32, i32, [573 x i8], i8*, i32, i32, i16*, i64, i64, i32, i32, i16, i32, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }
%struct.ct_data_s = type { %union.anon, %union.anon.0 }
%union.anon = type { i16 }
%union.anon.0 = type { i16 }
%struct.tree_desc_s = type { %struct.ct_data_s*, i32, %struct.static_tree_desc_s* }
%struct.static_tree_desc_s = type { i32 }

@deflate_copyright = constant [68 x i8] c" deflate 1.2.7 Copyright 1995-2012 Jean-loup Gailly and Mark Adler \00", align 16
@deflateInit2_.my_version = internal constant [6 x i8] c"1.2.7\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !10, globals: !190)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--deflate.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 66, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "deflate.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "need_more", value: 0)
!7 = !DIEnumerator(name: "block_done", value: 1)
!8 = !DIEnumerator(name: "finish_started", value: 2)
!9 = !DIEnumerator(name: "finish_done", value: 3)
!10 = !{!11, !16, !21, !25, !52, !37, !96, !179, !174, !63, !49, !39, !20, !98, !108, !99, !19, !188, !111, !57}
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !12, line: 80, baseType: !13)
!12 = !DIFile(filename: "zlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !16, !19, !19}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !17, line: 383, baseType: !18)
!17 = !DIFile(filename: "zconf.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !17, line: 367, baseType: !20)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !12, line: 81, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !16, !16}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "deflate_state", file: !27, line: 273, baseType: !28)
!27 = !DIFile(filename: "deflate.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !27, line: 97, size: 47488, align: 64, elements: !29)
!29 = !{!30, !60, !61, !62, !65, !66, !67, !68, !87, !88, !89, !90, !91, !92, !93, !94, !95, !101, !102, !103, !104, !105, !106, !107, !109, !110, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !139, !143, !147, !160, !161, !162, !166, !168, !169, !170, !173, !176, !177, !178, !181, !182, !183, !184, !185, !186, !187}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !28, file: !27, line: 98, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !12, line: 106, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !12, line: 104, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !12, line: 85, size: 896, align: 64, elements: !35)
!35 = !{!36, !41, !42, !45, !46, !47, !48, !51, !53, !54, !55, !56, !58, !59}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !34, file: !12, line: 86, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !17, line: 374, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !17, line: 365, baseType: !40)
!40 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !12, line: 87, baseType: !19, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !34, file: !12, line: 88, baseType: !43, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !17, line: 368, baseType: !44)
!44 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !34, file: !12, line: 90, baseType: !37, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !34, file: !12, line: 91, baseType: !19, size: 32, align: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !34, file: !12, line: 92, baseType: !43, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !34, file: !12, line: 94, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !34, file: !12, line: 95, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !34, file: !12, line: 97, baseType: !11, size: 64, align: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !34, file: !12, line: 98, baseType: !21, size: 64, align: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !34, file: !12, line: 99, baseType: !16, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !34, file: !12, line: 101, baseType: !57, size: 32, align: 32, offset: 704)
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !34, file: !12, line: 102, baseType: !43, size: 64, align: 64, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !34, file: !12, line: 103, baseType: !43, size: 64, align: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !28, file: !27, line: 99, baseType: !57, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf", scope: !28, file: !27, line: 100, baseType: !37, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf_size", scope: !28, file: !27, line: 101, baseType: !63, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !64, line: 45, baseType: !44)
!64 = !DIFile(filename: "zutil.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pending_out", scope: !28, file: !27, line: 102, baseType: !37, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !28, file: !27, line: 103, baseType: !19, size: 32, align: 32, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !28, file: !27, line: 104, baseType: !57, size: 32, align: 32, offset: 352)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !28, file: !27, line: 105, baseType: !69, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !12, line: 129, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !12, line: 127, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !12, line: 112, size: 640, align: 64, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !72, file: !12, line: 113, baseType: !57, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !72, file: !12, line: 114, baseType: !43, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !72, file: !12, line: 115, baseType: !57, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !72, file: !12, line: 116, baseType: !57, size: 32, align: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !72, file: !12, line: 117, baseType: !37, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !72, file: !12, line: 118, baseType: !19, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !72, file: !12, line: 119, baseType: !19, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !12, line: 120, baseType: !37, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !72, file: !12, line: 121, baseType: !19, size: 32, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !72, file: !12, line: 122, baseType: !37, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !72, file: !12, line: 123, baseType: !19, size: 32, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !72, file: !12, line: 124, baseType: !57, size: 32, align: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !72, file: !12, line: 125, baseType: !57, size: 32, align: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "gzindex", scope: !28, file: !27, line: 106, baseType: !19, size: 32, align: 32, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !28, file: !27, line: 107, baseType: !39, size: 8, align: 8, offset: 480)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "last_flush", scope: !28, file: !27, line: 108, baseType: !57, size: 32, align: 32, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "w_size", scope: !28, file: !27, line: 112, baseType: !19, size: 32, align: 32, offset: 544)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "w_bits", scope: !28, file: !27, line: 113, baseType: !19, size: 32, align: 32, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "w_mask", scope: !28, file: !27, line: 114, baseType: !19, size: 32, align: 32, offset: 608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !28, file: !27, line: 116, baseType: !37, size: 64, align: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !28, file: !27, line: 126, baseType: !63, size: 64, align: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !28, file: !27, line: 131, baseType: !96, size: 64, align: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Posf", file: !27, line: 90, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !27, line: 89, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !64, line: 43, baseType: !100)
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !28, file: !27, line: 137, baseType: !96, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ins_h", scope: !28, file: !27, line: 139, baseType: !19, size: 32, align: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !28, file: !27, line: 140, baseType: !19, size: 32, align: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !28, file: !27, line: 141, baseType: !19, size: 32, align: 32, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !28, file: !27, line: 142, baseType: !19, size: 32, align: 32, offset: 992)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hash_shift", scope: !28, file: !27, line: 144, baseType: !19, size: 32, align: 32, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !28, file: !27, line: 151, baseType: !108, size: 64, align: 64, offset: 1088)
!108 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "match_length", scope: !28, file: !27, line: 156, baseType: !19, size: 32, align: 32, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "prev_match", scope: !28, file: !27, line: 157, baseType: !111, size: 32, align: 32, offset: 1184)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !27, line: 91, baseType: !20)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "match_available", scope: !28, file: !27, line: 158, baseType: !57, size: 32, align: 32, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "strstart", scope: !28, file: !27, line: 159, baseType: !19, size: 32, align: 32, offset: 1248)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "match_start", scope: !28, file: !27, line: 160, baseType: !19, size: 32, align: 32, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !28, file: !27, line: 161, baseType: !19, size: 32, align: 32, offset: 1312)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev_length", scope: !28, file: !27, line: 163, baseType: !19, size: 32, align: 32, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !28, file: !27, line: 168, baseType: !19, size: 32, align: 32, offset: 1376)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy_match", scope: !28, file: !27, line: 174, baseType: !19, size: 32, align: 32, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !28, file: !27, line: 185, baseType: !57, size: 32, align: 32, offset: 1440)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !28, file: !27, line: 186, baseType: !57, size: 32, align: 32, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "good_match", scope: !28, file: !27, line: 188, baseType: !19, size: 32, align: 32, offset: 1504)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "nice_match", scope: !28, file: !27, line: 191, baseType: !57, size: 32, align: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_ltree", scope: !28, file: !27, line: 195, baseType: !124, size: 18336, align: 16, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 18336, align: 16, elements: !137)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data_s", file: !27, line: 65, size: 32, align: 16, elements: !126)
!126 = !{!127, !132}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !125, file: !27, line: 69, baseType: !128, size: 16, align: 16)
!128 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !27, line: 66, size: 16, align: 16, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !128, file: !27, line: 67, baseType: !99, size: 16, align: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !128, file: !27, line: 68, baseType: !99, size: 16, align: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !125, file: !27, line: 73, baseType: !133, size: 16, align: 16, offset: 16)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !27, line: 70, size: 16, align: 16, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !133, file: !27, line: 71, baseType: !99, size: 16, align: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !133, file: !27, line: 72, baseType: !99, size: 16, align: 16)
!137 = !{!138}
!138 = !DISubrange(count: 573)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dtree", scope: !28, file: !27, line: 196, baseType: !140, size: 1952, align: 16, offset: 19904)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 1952, align: 16, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 61)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "bl_tree", scope: !28, file: !27, line: 197, baseType: !144, size: 1248, align: 16, offset: 21856)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 1248, align: 16, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 39)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "l_desc", scope: !28, file: !27, line: 199, baseType: !148, size: 192, align: 64, offset: 23104)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc_s", file: !27, line: 83, size: 192, align: 64, elements: !149)
!149 = !{!150, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !148, file: !27, line: 84, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !27, line: 74, baseType: !125)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !148, file: !27, line: 85, baseType: !57, size: 32, align: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "stat_desc", scope: !148, file: !27, line: 86, baseType: !155, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_tree_desc", file: !27, line: 81, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_tree_desc_s", file: !4, line: 155, size: 32, align: 32, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !157, file: !4, line: 155, baseType: !57, size: 32, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "d_desc", scope: !28, file: !27, line: 200, baseType: !148, size: 192, align: 64, offset: 23296)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bl_desc", scope: !28, file: !27, line: 201, baseType: !148, size: 192, align: 64, offset: 23488)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "bl_count", scope: !28, file: !27, line: 203, baseType: !163, size: 256, align: 16, offset: 23680)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, align: 16, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !28, file: !27, line: 206, baseType: !167, size: 18336, align: 32, offset: 23936)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 18336, align: 32, elements: !137)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "heap_len", scope: !28, file: !27, line: 207, baseType: !57, size: 32, align: 32, offset: 42272)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "heap_max", scope: !28, file: !27, line: 208, baseType: !57, size: 32, align: 32, offset: 42304)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !28, file: !27, line: 213, baseType: !171, size: 4584, align: 8, offset: 42336)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 4584, align: 8, elements: !137)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !64, line: 41, baseType: !40)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "l_buf", scope: !28, file: !27, line: 217, baseType: !174, size: 64, align: 64, offset: 46976)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchf", file: !64, line: 42, baseType: !172)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "lit_bufsize", scope: !28, file: !27, line: 219, baseType: !19, size: 32, align: 32, offset: 47040)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "last_lit", scope: !28, file: !27, line: 239, baseType: !19, size: 32, align: 32, offset: 47072)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "d_buf", scope: !28, file: !27, line: 241, baseType: !179, size: 64, align: 64, offset: 47104)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "ushf", file: !64, line: 44, baseType: !99)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !28, file: !27, line: 247, baseType: !63, size: 64, align: 64, offset: 47168)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "static_len", scope: !28, file: !27, line: 248, baseType: !63, size: 64, align: 64, offset: 47232)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !28, file: !27, line: 249, baseType: !19, size: 32, align: 32, offset: 47296)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !28, file: !27, line: 250, baseType: !19, size: 32, align: 32, offset: 47328)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bi_buf", scope: !28, file: !27, line: 257, baseType: !99, size: 16, align: 16, offset: 47360)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bi_valid", scope: !28, file: !27, line: 261, baseType: !57, size: 32, align: 32, offset: 47392)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "high_water", scope: !28, file: !27, line: 266, baseType: !63, size: 64, align: 64, offset: 47424)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "charf", file: !17, line: 376, baseType: !50)
!190 = !{!191, !196, !205}
!191 = distinct !DIGlobalVariable(name: "deflate_copyright", scope: !0, file: !4, line: 54, type: !192, isLocal: false, isDefinition: true, variable: [68 x i8]* @deflate_copyright)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 544, align: 8, elements: !194)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!194 = !{!195}
!195 = !DISubrange(count: 68)
!196 = distinct !DIGlobalVariable(name: "my_version", scope: !197, file: !4, line: 226, type: !202, isLocal: true, isDefinition: true, variable: [6 x i8]* @deflateInit2_.my_version)
!197 = distinct !DISubprogram(name: "deflateInit2_", scope: !4, file: !4, line: 213, type: !198, isLocal: false, isDefinition: true, scopeLine: 223, isOptimized: false, unit: !0, variables: !201)
!198 = !DISubroutineType(types: !199)
!199 = !{!57, !31, !57, !57, !57, !57, !57, !200, !57}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!201 = !{}
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 48, align: 8, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 6)
!205 = distinct !DIGlobalVariable(name: "configuration_table", scope: !0, file: !4, line: 131, type: !206, isLocal: true, isDefinition: true, variable: [10 x %struct.config_s]* @configuration_table)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1280, align: 64, elements: !221)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "config", file: !4, line: 123, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "config_s", file: !4, line: 117, size: 128, align: 64, elements: !210)
!210 = !{!211, !212, !213, !214, !215}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "good_length", scope: !209, file: !4, line: 118, baseType: !99, size: 16, align: 16)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy", scope: !209, file: !4, line: 119, baseType: !99, size: 16, align: 16, offset: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nice_length", scope: !209, file: !4, line: 120, baseType: !99, size: 16, align: 16, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain", scope: !209, file: !4, line: 121, baseType: !99, size: 16, align: 16, offset: 48)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !209, file: !4, line: 122, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "compress_func", file: !4, line: 73, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !25, !57}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_state", file: !4, line: 71, baseType: !3)
!221 = !{!222}
!222 = !DISubrange(count: 10)
!223 = !{i32 2, !"Dwarf Version", i32 4}
!224 = !{i32 2, !"Debug Info Version", i32 3}
!225 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!226 = distinct !DISubprogram(name: "deflateInit_", scope: !4, file: !4, line: 201, type: !227, isLocal: false, isDefinition: true, scopeLine: 206, isOptimized: false, unit: !0, variables: !201)
!227 = !DISubroutineType(types: !228)
!228 = !{!57, !31, !57, !200, !57}
!229 = !DILocalVariable(name: "strm", arg: 1, scope: !226, file: !4, line: 202, type: !31)
!230 = !DIExpression()
!231 = !DILocation(line: 202, column: 15, scope: !226)
!232 = !DILocalVariable(name: "level", arg: 2, scope: !226, file: !4, line: 203, type: !57)
!233 = !DILocation(line: 203, column: 9, scope: !226)
!234 = !DILocalVariable(name: "version", arg: 3, scope: !226, file: !4, line: 204, type: !200)
!235 = !DILocation(line: 204, column: 17, scope: !226)
!236 = !DILocalVariable(name: "stream_size", arg: 4, scope: !226, file: !4, line: 205, type: !57)
!237 = !DILocation(line: 205, column: 9, scope: !226)
!238 = !DILocation(line: 207, column: 26, scope: !226)
!239 = !DILocation(line: 207, column: 32, scope: !226)
!240 = !DILocation(line: 208, column: 29, scope: !226)
!241 = !DILocation(line: 208, column: 38, scope: !226)
!242 = !DILocation(line: 207, column: 12, scope: !226)
!243 = !DILocation(line: 207, column: 5, scope: !226)
!244 = !DILocalVariable(name: "strm", arg: 1, scope: !197, file: !4, line: 215, type: !31)
!245 = !DILocation(line: 215, column: 15, scope: !197)
!246 = !DILocalVariable(name: "level", arg: 2, scope: !197, file: !4, line: 216, type: !57)
!247 = !DILocation(line: 216, column: 9, scope: !197)
!248 = !DILocalVariable(name: "method", arg: 3, scope: !197, file: !4, line: 217, type: !57)
!249 = !DILocation(line: 217, column: 9, scope: !197)
!250 = !DILocalVariable(name: "windowBits", arg: 4, scope: !197, file: !4, line: 218, type: !57)
!251 = !DILocation(line: 218, column: 9, scope: !197)
!252 = !DILocalVariable(name: "memLevel", arg: 5, scope: !197, file: !4, line: 219, type: !57)
!253 = !DILocation(line: 219, column: 9, scope: !197)
!254 = !DILocalVariable(name: "strategy", arg: 6, scope: !197, file: !4, line: 220, type: !57)
!255 = !DILocation(line: 220, column: 9, scope: !197)
!256 = !DILocalVariable(name: "version", arg: 7, scope: !197, file: !4, line: 221, type: !200)
!257 = !DILocation(line: 221, column: 17, scope: !197)
!258 = !DILocalVariable(name: "stream_size", arg: 8, scope: !197, file: !4, line: 222, type: !57)
!259 = !DILocation(line: 222, column: 9, scope: !197)
!260 = !DILocalVariable(name: "s", scope: !197, file: !4, line: 224, type: !25)
!261 = !DILocation(line: 224, column: 20, scope: !197)
!262 = !DILocalVariable(name: "wrap", scope: !197, file: !4, line: 225, type: !57)
!263 = !DILocation(line: 225, column: 9, scope: !197)
!264 = !DILocalVariable(name: "overlay", scope: !197, file: !4, line: 228, type: !179)
!265 = !DILocation(line: 228, column: 11, scope: !197)
!266 = !DILocation(line: 233, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !197, file: !4, line: 233, column: 9)
!268 = !DILocation(line: 233, column: 17, scope: !267)
!269 = !DILocation(line: 233, column: 22, scope: !267)
!270 = !DILocation(line: 233, column: 25, scope: !271)
!271 = !DILexicalBlockFile(scope: !267, file: !4, discriminator: 1)
!272 = !DILocation(line: 233, column: 39, scope: !271)
!273 = !DILocation(line: 233, column: 36, scope: !271)
