; ModuleID = './[inter]third-party--zlib-1.2.7--inflate.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--inflate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.code = type { i8, i8, i16 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type opaque
%struct.inflate_state = type { i32, i32, i32, i32, i32, i32, i64, i64, %struct.gz_header_s*, i32, i32, i32, i32, i8*, i64, i32, i32, i32, i32, %struct.code*, %struct.code*, i32, i32, i32, i32, i32, i32, %struct.code*, [320 x i16], [288 x i16], [1444 x %struct.code], i32, i32, i32 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }

@.str = private unnamed_addr constant [6 x i8] c"1.2.7\00", align 1
@inflate.order = internal constant [19 x i16] [i16 16, i16 17, i16 18, i16 0, i16 8, i16 7, i16 9, i16 6, i16 10, i16 5, i16 11, i16 4, i16 12, i16 3, i16 13, i16 2, i16 14, i16 1, i16 15], align 16
@.str.1 = private unnamed_addr constant [23 x i8] c"incorrect header check\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"unknown compression method\00", align 1
@.str.3 = private unnamed_addr constant [20 x i8] c"invalid window size\00", align 1
@.str.4 = private unnamed_addr constant [25 x i8] c"unknown header flags set\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !44, globals: !147)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--inflate.o.i", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!2 = !{!3, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 20, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "inflate.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!6 = !DIEnumerator(name: "HEAD", value: 0)
!7 = !DIEnumerator(name: "FLAGS", value: 1)
!8 = !DIEnumerator(name: "TIME", value: 2)
!9 = !DIEnumerator(name: "OS", value: 3)
!10 = !DIEnumerator(name: "EXLEN", value: 4)
!11 = !DIEnumerator(name: "EXTRA", value: 5)
!12 = !DIEnumerator(name: "NAME", value: 6)
!13 = !DIEnumerator(name: "COMMENT", value: 7)
!14 = !DIEnumerator(name: "HCRC", value: 8)
!15 = !DIEnumerator(name: "DICTID", value: 9)
!16 = !DIEnumerator(name: "DICT", value: 10)
!17 = !DIEnumerator(name: "TYPE", value: 11)
!18 = !DIEnumerator(name: "TYPEDO", value: 12)
!19 = !DIEnumerator(name: "STORED", value: 13)
!20 = !DIEnumerator(name: "COPY_", value: 14)
!21 = !DIEnumerator(name: "COPY", value: 15)
!22 = !DIEnumerator(name: "TABLE", value: 16)
!23 = !DIEnumerator(name: "LENLENS", value: 17)
!24 = !DIEnumerator(name: "CODELENS", value: 18)
!25 = !DIEnumerator(name: "LEN_", value: 19)
!26 = !DIEnumerator(name: "LEN", value: 20)
!27 = !DIEnumerator(name: "LENEXT", value: 21)
!28 = !DIEnumerator(name: "DIST", value: 22)
!29 = !DIEnumerator(name: "DISTEXT", value: 23)
!30 = !DIEnumerator(name: "MATCH", value: 24)
!31 = !DIEnumerator(name: "LIT", value: 25)
!32 = !DIEnumerator(name: "CHECK", value: 26)
!33 = !DIEnumerator(name: "LENGTH", value: 27)
!34 = !DIEnumerator(name: "DONE", value: 28)
!35 = !DIEnumerator(name: "BAD", value: 29)
!36 = !DIEnumerator(name: "MEM", value: 30)
!37 = !DIEnumerator(name: "SYNC", value: 31)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 54, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "inftrees.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "CODES", value: 0)
!42 = !DIEnumerator(name: "LENS", value: 1)
!43 = !DIEnumerator(name: "DISTS", value: 2)
!44 = !{!45, !56, !132, !51, !134, !138, !142, !58, !77, !144, !107, !99, !74, !92, !146}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inflate_state", file: !4, line: 81, size: 57216, align: 64, elements: !47)
!47 = !{!48, !50, !52, !53, !54, !55, !57, !59, !60, !87, !88, !89, !90, !91, !93, !94, !95, !96, !97, !98, !108, !109, !110, !111, !112, !113, !114, !115, !117, !121, !125, !129, !130, !131}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !46, file: !4, line: 82, baseType: !49, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "inflate_mode", file: !4, line: 53, baseType: !3)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !46, file: !4, line: 83, baseType: !51, size: 32, align: 32, offset: 32)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !46, file: !4, line: 84, baseType: !51, size: 32, align: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "havedict", scope: !46, file: !4, line: 85, baseType: !51, size: 32, align: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !4, line: 86, baseType: !51, size: 32, align: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !46, file: !4, line: 87, baseType: !56, size: 32, align: 32, offset: 160)
!56 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !46, file: !4, line: 88, baseType: !58, size: 64, align: 64, offset: 192)
!58 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !46, file: !4, line: 89, baseType: !58, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !46, file: !4, line: 90, baseType: !61, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !62, line: 129, baseType: !63)
!62 = !DIFile(filename: "zlib.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !62, line: 127, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !62, line: 112, size: 640, align: 64, elements: !66)
!66 = !{!67, !68, !71, !72, !73, !78, !80, !81, !82, !83, !84, !85, !86}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !65, file: !62, line: 113, baseType: !51, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !65, file: !62, line: 114, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !70, line: 368, baseType: !58)
!70 = !DIFile(filename: "zconf.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !65, file: !62, line: 115, baseType: !51, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !65, file: !62, line: 116, baseType: !51, size: 32, align: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !65, file: !62, line: 117, baseType: !74, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !70, line: 374, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !70, line: 365, baseType: !77)
!77 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !65, file: !62, line: 118, baseType: !79, size: 32, align: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !70, line: 367, baseType: !56)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !65, file: !62, line: 119, baseType: !79, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !62, line: 120, baseType: !74, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !65, file: !62, line: 121, baseType: !79, size: 32, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !65, file: !62, line: 122, baseType: !74, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !65, file: !62, line: 123, baseType: !79, size: 32, align: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !65, file: !62, line: 124, baseType: !51, size: 32, align: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !65, file: !62, line: 125, baseType: !51, size: 32, align: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "wbits", scope: !46, file: !4, line: 92, baseType: !56, size: 32, align: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "wsize", scope: !46, file: !4, line: 93, baseType: !56, size: 32, align: 32, offset: 416)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "whave", scope: !46, file: !4, line: 94, baseType: !56, size: 32, align: 32, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "wnext", scope: !46, file: !4, line: 95, baseType: !56, size: 32, align: 32, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !46, file: !4, line: 96, baseType: !92, size: 64, align: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "hold", scope: !46, file: !4, line: 98, baseType: !58, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !46, file: !4, line: 99, baseType: !56, size: 32, align: 32, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !46, file: !4, line: 101, baseType: !56, size: 32, align: 32, offset: 672)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !46, file: !4, line: 102, baseType: !56, size: 32, align: 32, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !46, file: !4, line: 104, baseType: !56, size: 32, align: 32, offset: 736)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "lencode", scope: !46, file: !4, line: 106, baseType: !99, size: 64, align: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "code", file: !39, line: 28, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 24, size: 32, align: 16, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !102, file: !39, line: 25, baseType: !77, size: 8, align: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !102, file: !39, line: 26, baseType: !77, size: 8, align: 8, offset: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !39, line: 27, baseType: !107, size: 16, align: 16, offset: 16)
!107 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "distcode", scope: !46, file: !4, line: 107, baseType: !99, size: 64, align: 64, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "lenbits", scope: !46, file: !4, line: 108, baseType: !56, size: 32, align: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "distbits", scope: !46, file: !4, line: 109, baseType: !56, size: 32, align: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ncode", scope: !46, file: !4, line: 111, baseType: !56, size: 32, align: 32, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nlen", scope: !46, file: !4, line: 112, baseType: !56, size: 32, align: 32, offset: 992)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ndist", scope: !46, file: !4, line: 113, baseType: !56, size: 32, align: 32, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !46, file: !4, line: 114, baseType: !56, size: 32, align: 32, offset: 1056)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !46, file: !4, line: 115, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !46, file: !4, line: 116, baseType: !118, size: 5120, align: 16, offset: 1152)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 5120, align: 16, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !46, file: !4, line: 117, baseType: !122, size: 4608, align: 16, offset: 6272)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 4608, align: 16, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "codes", scope: !46, file: !4, line: 118, baseType: !126, size: 46208, align: 16, offset: 10880)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 46208, align: 16, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 1444)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "sane", scope: !46, file: !4, line: 119, baseType: !51, size: 32, align: 32, offset: 57088)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !46, file: !4, line: 120, baseType: !51, size: 32, align: 32, offset: 57120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "was", scope: !46, file: !4, line: 121, baseType: !56, size: 32, align: 32, offset: 57152)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !70, line: 383, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !62, line: 80, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!132, !132, !79, !79}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !62, line: 81, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !132, !132}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !62, line: 83, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!146 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!147 = !{!148, !177, !185}
!148 = distinct !DIGlobalVariable(name: "order", scope: !149, file: !150, line: 624, type: !173, isLocal: true, isDefinition: true, variable: [19 x i16]* @inflate.order)
!149 = distinct !DISubprogram(name: "inflate", scope: !150, file: !150, line: 604, type: !151, isLocal: false, isDefinition: true, scopeLine: 607, isOptimized: false, unit: !0, variables: !172)
!150 = !DIFile(filename: "inflate.c", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !153, !51}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !62, line: 106, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !62, line: 104, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !62, line: 85, size: 896, align: 64, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !156, file: !62, line: 86, baseType: !74, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !156, file: !62, line: 87, baseType: !79, size: 32, align: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !156, file: !62, line: 88, baseType: !69, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !156, file: !62, line: 90, baseType: !74, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !156, file: !62, line: 91, baseType: !79, size: 32, align: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !156, file: !62, line: 92, baseType: !69, size: 64, align: 64, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !156, file: !62, line: 94, baseType: !144, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !62, line: 95, baseType: !142, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !156, file: !62, line: 97, baseType: !134, size: 64, align: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !156, file: !62, line: 98, baseType: !138, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !156, file: !62, line: 99, baseType: !132, size: 64, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !156, file: !62, line: 101, baseType: !51, size: 32, align: 32, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !156, file: !62, line: 102, baseType: !69, size: 64, align: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !156, file: !62, line: 103, baseType: !69, size: 64, align: 64, offset: 832)
!172 = !{}
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 304, align: 16, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!175 = !{!176}
!176 = !DISubrange(count: 19)
!177 = distinct !DIGlobalVariable(name: "lenfix", scope: !178, file: !181, line: 10, type: !182, isLocal: true, isDefinition: true, variable: [512 x %struct.code]* @fixedtables.lenfix)
!178 = distinct !DISubprogram(name: "fixedtables", scope: !150, file: !150, line: 260, type: !179, isLocal: true, isDefinition: true, scopeLine: 262, isOptimized: false, unit: !0, variables: !172)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !45}
!181 = !DIFile(filename: "inffixed.h", directory: "/home/lichi/Desktop/bedops/[lib]third-party--zlib-1.2.7--libz.a")
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 16384, align: 16, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 512)
!185 = distinct !DIGlobalVariable(name: "distfix", scope: !178, file: !181, line: 87, type: !186, isLocal: true, isDefinition: true, variable: [32 x %struct.code]* @fixedtables.distfix)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1024, align: 16, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 32)
!189 = !{i32 2, !"Dwarf Version", i32 4}
!190 = !{i32 2, !"Debug Info Version", i32 3}
!191 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!192 = distinct !DISubprogram(name: "inflateResetKeep", scope: !150, file: !150, line: 103, type: !193, isLocal: false, isDefinition: true, scopeLine: 105, isOptimized: false, unit: !0, variables: !172)
!193 = !DISubroutineType(types: !194)
!194 = !{!51, !153}
!195 = !DILocalVariable(name: "strm", arg: 1, scope: !192, file: !150, line: 104, type: !153)
!196 = !DIExpression()
!197 = !DILocation(line: 104, column: 11, scope: !192)
!198 = !DILocalVariable(name: "state", scope: !192, file: !150, line: 106, type: !45)
!199 = !DILocation(line: 106, column: 27, scope: !192)
!200 = !DILocation(line: 108, column: 9, scope: !201)
!201 = distinct !DILexicalBlock(scope: !192, file: !150, line: 108, column: 9)
!202 = !DILocation(line: 108, column: 14, scope: !201)
!203 = !DILocation(line: 108, column: 19, scope: !201)
!204 = !DILocation(line: 108, column: 22, scope: !205)
!205 = !DILexicalBlockFile(scope: !201, file: !150, discriminator: 1)
!206 = !DILocation(line: 108, column: 28, scope: !205)
!207 = !DILocation(line: 108, column: 34, scope: !205)
!208 = !DILocation(line: 108, column: 9, scope: !205)
!209 = !DILocation(line: 108, column: 40, scope: !210)
!210 = !DILexicalBlockFile(scope: !201, file: !150, discriminator: 2)
!211 = !DILocation(line: 109, column: 37, scope: !192)
!212 = !DILocation(line: 109, column: 43, scope: !192)
!213 = !DILocation(line: 109, column: 13, scope: !192)
!214 = !DILocation(line: 109, column: 11, scope: !192)
!215 = !DILocation(line: 110, column: 40, scope: !192)
!216 = !DILocation(line: 110, column: 47, scope: !192)
!217 = !DILocation(line: 110, column: 53, scope: !192)
!218 = !DILocation(line: 110, column: 22, scope: !192)
!219 = !DILocation(line: 110, column: 28, scope: !192)
!220 = !DILocation(line: 110, column: 38, scope: !192)
!221 = !DILocation(line: 110, column: 5, scope: !192)
!222 = !DILocation(line: 110, column: 11, scope: !192)
!223 = !DILocation(line: 110, column: 20, scope: !192)
!224 = !DILocation(line: 111, column: 5, scope: !192)
!225 = !DILocation(line: 111, column: 11, scope: !192)
!226 = !DILocation(line: 111, column: 15, scope: !192)
!227 = !DILocation(line: 112, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !192, file: !150, line: 112, column: 9)
!229 = !DILocation(line: 112, column: 16, scope: !228)
!230 = !DILocation(line: 112, column: 9, scope: !192)
!231 = !DILocation(line: 113, column: 23, scope: !228)
!232 = !DILocation(line: 113, column: 30, scope: !228)
