; ModuleID = './ulSema.o.i'
source_filename = "./ulSema.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, {}*, {}*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXUserSemaphore = type { %struct.MXUserHeader, %struct.Atomic_uint32, %union.sem_t, %struct.Atomic_uint64 }
%struct.Atomic_uint32 = type { i32 }
%union.sem_t = type { i64, [24 x i8] }
%struct.Atomic_uint64 = type { i64 }
%struct.MXUserAcquireStats = type { %struct.MXUserAcquisitionStats, %struct.Atomic_uint64 }
%struct.MXUserAcquisitionStats = type { double, i64, i64, i64, i64, i64, i64, i64, %struct.MXUserBasicStats }
%struct.MXUserBasicStats = type { i8*, i64, i64, i64, i64, double }
%struct.MXUserHisto = type opaque
%struct.timeval = type { i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.timezone = type { i32, i32 }

@.str = private unnamed_addr constant [20 x i8] c"%s: semaphore @ %p\0A\00", align 1
@__FUNCTION__.MXUserDumpSemaphore = private unnamed_addr constant [20 x i8] c"MXUserDumpSemaphore\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"\09signature 0x%X\0A\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"\09name %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"\09rank 0x%X\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "ulSema.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !85, !82, !86, !74, !90}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserSemaphore", file: !18, line: 43, baseType: !19)
!18 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserSemaphore", file: !20, line: 62, size: 832, align: 64, elements: !21)
!20 = !DIFile(filename: "ulSema.c", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!21 = !{!22, !56, !63, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !19, file: !20, line: 64, baseType: !23, size: 448, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !25)
!25 = !{!26, !32, !35, !37, !42, !47, !48}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !24, file: !4, line: 457, baseType: !27, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !28, line: 173, baseType: !29)
!28 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 51, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!31 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !24, file: !4, line: 458, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !24, file: !4, line: 459, baseType: !36, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !28, line: 1167, baseType: !27)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !24, file: !4, line: 464, baseType: !38, size: 32, align: 32, offset: 160)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !24, file: !4, line: 461, size: 32, align: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !38, file: !4, line: 462, baseType: !31, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !38, file: !4, line: 463, baseType: !31, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !24, file: !4, line: 466, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !24, file: !4, line: 467, baseType: !43, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !24, file: !4, line: 468, baseType: !49, size: 128, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !50, line: 45, baseType: !51)
!50 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !50, line: 42, size: 128, align: 64, elements: !52)
!52 = !{!53, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !50, line: 43, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !50, line: 44, baseType: !54, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "activeUserCount", scope: !19, file: !20, line: 65, baseType: !57, size: 32, align: 32, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !58, line: 135, baseType: !59)
!58 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !58, line: 133, size: 32, align: 32, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !59, file: !58, line: 134, baseType: !62, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nativeSemaphore", scope: !19, file: !20, line: 66, baseType: !64, size: 256, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "NativeSemaphore", file: !20, line: 58, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !66, line: 40, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/semaphore.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !66, line: 36, size: 256, align: 64, elements: !68)
!68 = !{!69, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !67, file: !66, line: 38, baseType: !70, size: 256, align: 8)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 256, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !67, file: !66, line: 39, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "acquireStatsMem", scope: !19, file: !20, line: 67, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !58, line: 3829, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !58, line: 139, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !58, line: 137, size: 64, align: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !78, file: !58, line: 138, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !28, line: 171, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 55, baseType: !84)
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !87, line: 75, baseType: !88)
!87 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !89, line: 139, baseType: !74)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !30, line: 122, baseType: !84)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!94 = distinct !DISubprogram(name: "MXUserDumpSemaphore", scope: !20, file: !20, line: 412, type: !95, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!98 = !{}
!99 = !DILocalVariable(name: "header", arg: 1, scope: !94, file: !20, line: 412, type: !97)
!100 = !DIExpression()
!101 = !DILocation(line: 412, column: 35, scope: !94)
!102 = !DILocalVariable(name: "sema", scope: !94, file: !20, line: 414, type: !16)
!103 = !DILocation(line: 414, column: 21, scope: !94)
!104 = !DILocation(line: 414, column: 48, scope: !94)
!105 = !DILocation(line: 414, column: 28, scope: !94)
!106 = !DILocation(line: 416, column: 50, scope: !94)
!107 = !DILocation(line: 416, column: 4, scope: !94)
!108 = !DILocation(line: 418, column: 34, scope: !94)
!109 = !DILocation(line: 418, column: 40, scope: !94)
!110 = !DILocation(line: 418, column: 47, scope: !94)
!111 = !DILocation(line: 418, column: 4, scope: !94)
!112 = !DILocation(line: 419, column: 27, scope: !94)
!113 = !DILocation(line: 419, column: 33, scope: !94)
!114 = !DILocation(line: 419, column: 40, scope: !94)
!115 = !DILocation(line: 419, column: 4, scope: !94)
!116 = !DILocation(line: 420, column: 29, scope: !94)
!117 = !DILocation(line: 420, column: 35, scope: !94)
!118 = !DILocation(line: 420, column: 42, scope: !94)
!119 = !DILocation(line: 420, column: 4, scope: !94)
!120 = !DILocation(line: 421, column: 36, scope: !94)
!121 = !DILocation(line: 421, column: 42, scope: !94)
!122 = !DILocation(line: 421, column: 49, scope: !94)
!123 = !DILocation(line: 421, column: 54, scope: !94)
!124 = !DILocation(line: 421, column: 4, scope: !94)
!125 = !DILocation(line: 423, column: 53, scope: !94)
!126 = !DILocation(line: 423, column: 59, scope: !94)
!127 = !DILocation(line: 423, column: 38, scope: !94)
!128 = !DILocation(line: 423, column: 4, scope: !129)
!129 = !DILexicalBlockFile(scope: !94, file: !20, discriminator: 1)
!130 = !DILocation(line: 424, column: 51, scope: !94)
!131 = !DILocation(line: 424, column: 57, scope: !94)
!132 = !DILocation(line: 424, column: 4, scope: !94)
!133 = !DILocation(line: 425, column: 1, scope: !94)
!134 = distinct !DISubprogram(name: "Atomic_Read32", scope: !58, file: !58, line: 911, type: !135, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!135 = !DISubroutineType(types: !136)
!136 = !{!27, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!139 = !DILocalVariable(name: "var", arg: 1, scope: !134, file: !58, line: 911, type: !137)
!140 = !DILocation(line: 911, column: 36, scope: !134)
!141 = !DILocalVariable(name: "value", scope: !134, file: !58, line: 913, type: !27)
!142 = !DILocation(line: 913, column: 11, scope: !134)
!143 = !DILocation(line: 938, column: 14, scope: !134)
!144 = !DILocation(line: 938, column: 19, scope: !134)
!145 = !DILocation(line: 935, column: 4, scope: !134)
!146 = !{i32 128478}
!147 = !DILocation(line: 953, column: 11, scope: !134)
!148 = !DILocation(line: 953, column: 4, scope: !134)
!149 = distinct !DISubprogram(name: "MXUser_CreateSemaphore", scope: !20, file: !20, line: 449, type: !150, isLocal: false, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!150 = !DISubroutineType(types: !151)
!151 = !{!16, !152, !36}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!154 = !DILocalVariable(name: "userName", arg: 1, scope: !149, file: !20, line: 449, type: !152)
!155 = !DILocation(line: 449, column: 36, scope: !149)
!156 = !DILocalVariable(name: "rank", arg: 2, scope: !149, file: !20, line: 450, type: !36)
!157 = !DILocation(line: 450, column: 32, scope: !149)
!158 = !DILocalVariable(name: "properName", scope: !149, file: !20, line: 452, type: !33)
!159 = !DILocation(line: 452, column: 10, scope: !149)
!160 = !DILocalVariable(name: "sema", scope: !149, file: !20, line: 453, type: !16)
!161 = !DILocation(line: 453, column: 21, scope: !149)
!162 = !DILocation(line: 453, column: 28, scope: !149)
!163 = !DILocation(line: 455, column: 8, scope: !164)
!164 = distinct !DILexicalBlock(scope: !149, file: !20, line: 455, column: 8)
!165 = !DILocation(line: 455, column: 17, scope: !164)
!166 = !DILocation(line: 455, column: 8, scope: !149)
!167 = !DILocation(line: 456, column: 53, scope: !168)
!168 = distinct !DILexicalBlock(scope: !164, file: !20, line: 455, column: 25)
!169 = !DILocation(line: 456, column: 20, scope: !170)
!170 = !DILexicalBlockFile(scope: !168, file: !20, discriminator: 1)
!171 = !DILocation(line: 456, column: 18, scope: !168)
!172 = !DILocation(line: 457, column: 4, scope: !168)
!173 = !DILocation(line: 458, column: 37, scope: !174)
!174 = distinct !DILexicalBlock(scope: !164, file: !20, line: 457, column: 11)
!175 = !DILocation(line: 458, column: 20, scope: !174)
!176 = !DILocation(line: 458, column: 18, scope: !174)
!177 = !DILocation(line: 461, column: 40, scope: !178)
!178 = distinct !DILexicalBlock(scope: !149, file: !20, line: 461, column: 8)
!179 = !DILocation(line: 461, column: 46, scope: !178)
!180 = !DILocation(line: 461, column: 28, scope: !178)
!181 = !DILocation(line: 461, column: 63, scope: !178)
!182 = !DILocation(line: 461, column: 26, scope: !178)
!183 = !DILocation(line: 461, column: 25, scope: !178)
!184 = !DILocation(line: 461, column: 8, scope: !178)
!185 = !DILocation(line: 461, column: 8, scope: !149)
!186 = !DILocalVariable(name: "statsMode", scope: !187, file: !20, line: 462, type: !27)
!187 = distinct !DILexicalBlock(scope: !178, file: !20, line: 461, column: 74)
!188 = !DILocation(line: 462, column: 14, scope: !187)
!189 = !DILocation(line: 464, column: 32, scope: !187)
!190 = !DILocation(line: 464, column: 7, scope: !187)
!191 = !DILocation(line: 464, column: 13, scope: !187)
!192 = !DILocation(line: 464, column: 20, scope: !187)
!193 = !DILocation(line: 464, column: 30, scope: !187)
!194 = !DILocation(line: 465, column: 27, scope: !187)
!195 = !DILocation(line: 465, column: 7, scope: !187)
!196 = !DILocation(line: 465, column: 13, scope: !187)
!197 = !DILocation(line: 465, column: 20, scope: !187)
!198 = !DILocation(line: 465, column: 25, scope: !187)
!199 = !DILocation(line: 466, column: 27, scope: !187)
!200 = !DILocation(line: 466, column: 7, scope: !187)
!201 = !DILocation(line: 466, column: 13, scope: !187)
!202 = !DILocation(line: 466, column: 20, scope: !187)
!203 = !DILocation(line: 466, column: 25, scope: !187)
!204 = !DILocation(line: 467, column: 40, scope: !187)
!205 = !DILocation(line: 467, column: 7, scope: !187)
!206 = !DILocation(line: 467, column: 13, scope: !187)
!207 = !DILocation(line: 467, column: 20, scope: !187)
!208 = !DILocation(line: 467, column: 25, scope: !187)
!209 = !DILocation(line: 467, column: 38, scope: !187)
!210 = !DILocation(line: 468, column: 7, scope: !187)
!211 = !DILocation(line: 468, column: 13, scope: !187)
!212 = !DILocation(line: 468, column: 20, scope: !187)
!213 = !DILocation(line: 468, column: 29, scope: !187)
!214 = !DILocation(line: 470, column: 19, scope: !187)
!215 = !DILocation(line: 470, column: 17, scope: !187)
!216 = !DILocation(line: 472, column: 15, scope: !187)
!217 = !DILocation(line: 472, column: 7, scope: !187)
!218 = !DILocation(line: 474, column: 30, scope: !219)
!219 = distinct !DILexicalBlock(scope: !187, file: !20, line: 472, column: 34)
!220 = !DILocation(line: 474, column: 36, scope: !219)
!221 = !DILocation(line: 474, column: 10, scope: !219)
!222 = !DILocation(line: 475, column: 10, scope: !219)
!223 = !DILocation(line: 475, column: 16, scope: !219)
!224 = !DILocation(line: 475, column: 23, scope: !219)
!225 = !DILocation(line: 475, column: 33, scope: !219)
!226 = !DILocation(line: 476, column: 10, scope: !219)
!227 = !DILocation(line: 480, column: 29, scope: !219)
!228 = !DILocation(line: 480, column: 35, scope: !219)
!229 = !DILocation(line: 480, column: 10, scope: !219)
!230 = !DILocation(line: 481, column: 10, scope: !219)
!231 = !DILocation(line: 481, column: 16, scope: !219)
!232 = !DILocation(line: 481, column: 23, scope: !219)
!233 = !DILocation(line: 481, column: 33, scope: !219)
!234 = !DILocation(line: 482, column: 10, scope: !219)
!235 = !DILocation(line: 485, column: 63, scope: !219)
!236 = !DILocation(line: 485, column: 10, scope: !219)
!237 = !DILocation(line: 488, column: 24, scope: !187)
!238 = !DILocation(line: 488, column: 30, scope: !187)
!239 = !DILocation(line: 488, column: 7, scope: !187)
!240 = !DILocation(line: 489, column: 4, scope: !187)
!241 = !DILocation(line: 490, column: 7, scope: !242)
!242 = distinct !DILexicalBlock(scope: !178, file: !20, line: 489, column: 11)
!243 = !DILocation(line: 493, column: 11, scope: !149)
!244 = !DILocation(line: 493, column: 4, scope: !149)
!245 = distinct !DISubprogram(name: "MXUserInit", scope: !20, file: !20, line: 237, type: !246, isLocal: true, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !249}
!248 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!250 = !DILocalVariable(name: "sema", arg: 1, scope: !245, file: !20, line: 237, type: !249)
!251 = !DILocation(line: 237, column: 29, scope: !245)
!252 = !DILocation(line: 239, column: 21, scope: !245)
!253 = !DILocation(line: 239, column: 12, scope: !245)
!254 = !DILocation(line: 239, column: 33, scope: !245)
!255 = !DILocation(line: 239, column: 11, scope: !245)
!256 = !DILocation(line: 239, column: 43, scope: !257)
!257 = !DILexicalBlockFile(scope: !245, file: !20, discriminator: 1)
!258 = !DILocation(line: 239, column: 42, scope: !257)
!259 = !DILocation(line: 239, column: 11, scope: !257)
!260 = !DILocation(line: 239, column: 11, scope: !261)
!261 = !DILexicalBlockFile(scope: !245, file: !20, discriminator: 2)
!262 = !DILocation(line: 239, column: 11, scope: !263)
!263 = !DILexicalBlockFile(scope: !245, file: !20, discriminator: 3)
!264 = !DILocation(line: 239, column: 4, scope: !263)
!265 = distinct !DISubprogram(name: "MXUserStatsActionSema", scope: !20, file: !20, line: 355, type: !95, isLocal: true, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!266 = !DILocalVariable(name: "header", arg: 1, scope: !265, file: !20, line: 355, type: !97)
!267 = !DILocation(line: 355, column: 37, scope: !265)
!268 = !DILocalVariable(name: "sema", scope: !265, file: !20, line: 357, type: !16)
!269 = !DILocation(line: 357, column: 21, scope: !265)
!270 = !DILocation(line: 357, column: 48, scope: !265)
!271 = !DILocation(line: 357, column: 28, scope: !265)
!272 = !DILocalVariable(name: "acquireStats", scope: !265, file: !20, line: 358, type: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquireStats", file: !4, line: 562, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 558, size: 960, align: 64, elements: !276)
!276 = !{!277, !300}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !4, line: 560, baseType: !278, size: 896, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquisitionStats", file: !4, line: 552, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 541, size: 896, align: 64, elements: !280)
!280 = !{!281, !283, !284, !285, !286, !287, !288, !289, !290}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "contentionRatioFloor", scope: !279, file: !4, line: 542, baseType: !282, size: 64, align: 64)
!282 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "contentionCountFloor", scope: !279, file: !4, line: 543, baseType: !82, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "contentionDurationFloor", scope: !279, file: !4, line: 544, baseType: !82, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "numAttempts", scope: !279, file: !4, line: 545, baseType: !82, size: 64, align: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccesses", scope: !279, file: !4, line: 546, baseType: !82, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccessesContended", scope: !279, file: !4, line: 547, baseType: !82, size: 64, align: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "successContentionTime", scope: !279, file: !4, line: 548, baseType: !82, size: 64, align: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totalContentionTime", scope: !279, file: !4, line: 549, baseType: !82, size: 64, align: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "basicStats", scope: !279, file: !4, line: 551, baseType: !291, size: 384, align: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserBasicStats", file: !4, line: 539, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 532, size: 384, align: 64, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "typeName", scope: !292, file: !4, line: 533, baseType: !33, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "numSamples", scope: !292, file: !4, line: 534, baseType: !82, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "minTime", scope: !292, file: !4, line: 535, baseType: !82, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !292, file: !4, line: 536, baseType: !82, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "timeSum", scope: !292, file: !4, line: 537, baseType: !82, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timeSquaredSum", scope: !292, file: !4, line: 538, baseType: !282, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !275, file: !4, line: 561, baseType: !76, size: 64, align: 64, offset: 896)
!301 = !DILocation(line: 358, column: 24, scope: !265)
!302 = !DILocation(line: 358, column: 55, scope: !265)
!303 = !DILocation(line: 358, column: 61, scope: !265)
!304 = !DILocation(line: 358, column: 39, scope: !265)
!305 = !DILocation(line: 360, column: 28, scope: !306)
!306 = distinct !DILexicalBlock(scope: !265, file: !20, line: 360, column: 8)
!307 = !DILocation(line: 360, column: 41, scope: !306)
!308 = !DILocation(line: 360, column: 26, scope: !306)
!309 = !DILocation(line: 360, column: 25, scope: !306)
!310 = !DILocation(line: 360, column: 8, scope: !306)
!311 = !DILocation(line: 360, column: 8, scope: !265)
!312 = !DILocalVariable(name: "isHot", scope: !313, file: !20, line: 361, type: !314)
!313 = distinct !DILexicalBlock(scope: !306, file: !20, line: 360, column: 14)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !28, line: 230, baseType: !34)
!315 = !DILocation(line: 361, column: 12, scope: !313)
!316 = !DILocalVariable(name: "doLog", scope: !313, file: !20, line: 362, type: !314)
!317 = !DILocation(line: 362, column: 12, scope: !313)
!318 = !DILocalVariable(name: "contentionRatio", scope: !313, file: !20, line: 363, type: !282)
!319 = !DILocation(line: 363, column: 14, scope: !313)
!320 = !DILocation(line: 369, column: 35, scope: !313)
!321 = !DILocation(line: 369, column: 49, scope: !313)
!322 = !DILocation(line: 369, column: 55, scope: !313)
!323 = !DILocation(line: 369, column: 7, scope: !313)
!324 = !DILocation(line: 371, column: 27, scope: !325)
!325 = distinct !DILexicalBlock(scope: !313, file: !20, line: 371, column: 11)
!326 = !DILocation(line: 371, column: 41, scope: !325)
!327 = !DILocation(line: 371, column: 11, scope: !325)
!328 = !DILocation(line: 371, column: 48, scope: !325)
!329 = !DILocation(line: 371, column: 11, scope: !313)
!330 = !DILocation(line: 372, column: 42, scope: !331)
!331 = distinct !DILexicalBlock(scope: !325, file: !20, line: 371, column: 56)
!332 = !DILocation(line: 372, column: 56, scope: !331)
!333 = !DILocation(line: 372, column: 26, scope: !331)
!334 = !DILocation(line: 372, column: 64, scope: !331)
!335 = !DILocation(line: 372, column: 10, scope: !336)
!336 = !DILexicalBlockFile(scope: !331, file: !20, discriminator: 1)
!337 = !DILocation(line: 373, column: 7, scope: !331)
!338 = !DILocation(line: 379, column: 22, scope: !313)
!339 = !DILocation(line: 379, column: 36, scope: !313)
!340 = !DILocation(line: 379, column: 7, scope: !313)
!341 = !DILocation(line: 381, column: 11, scope: !342)
!342 = distinct !DILexicalBlock(scope: !313, file: !20, line: 381, column: 11)
!343 = !DILocation(line: 381, column: 11, scope: !313)
!344 = !DILocation(line: 382, column: 39, scope: !345)
!345 = distinct !DILexicalBlock(scope: !342, file: !20, line: 381, column: 18)
!346 = !DILocation(line: 382, column: 45, scope: !345)
!347 = !DILocation(line: 382, column: 10, scope: !345)
!348 = !DILocation(line: 386, column: 14, scope: !349)
!349 = distinct !DILexicalBlock(scope: !345, file: !20, line: 386, column: 14)
!350 = !DILocation(line: 386, column: 14, scope: !345)
!351 = !DILocation(line: 388, column: 17, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !20, line: 386, column: 21)
!353 = !DILocation(line: 388, column: 23, scope: !352)
!354 = !DILocation(line: 388, column: 30, scope: !352)
!355 = !DILocation(line: 388, column: 36, scope: !352)
!356 = !DILocation(line: 387, column: 13, scope: !352)
!357 = !DILocation(line: 389, column: 10, scope: !352)
!358 = !DILocation(line: 390, column: 7, scope: !345)
!359 = !DILocation(line: 391, column: 4, scope: !313)
!360 = !DILocation(line: 392, column: 1, scope: !265)
!361 = distinct !DISubprogram(name: "MXUser_DestroySemaphore", scope: !20, file: !20, line: 514, type: !362, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !16}
!364 = !DILocalVariable(name: "sema", arg: 1, scope: !361, file: !20, line: 514, type: !16)
!365 = !DILocation(line: 514, column: 42, scope: !361)
!366 = !DILocation(line: 516, column: 28, scope: !367)
!367 = distinct !DILexicalBlock(scope: !361, file: !20, line: 516, column: 8)
!368 = !DILocation(line: 516, column: 33, scope: !367)
!369 = !DILocation(line: 516, column: 26, scope: !367)
!370 = !DILocation(line: 516, column: 25, scope: !367)
!371 = !DILocation(line: 516, column: 8, scope: !367)
!372 = !DILocation(line: 516, column: 8, scope: !361)
!373 = !DILocalVariable(name: "err", scope: !374, file: !20, line: 517, type: !248)
!374 = distinct !DILexicalBlock(scope: !367, file: !20, line: 516, column: 14)
!375 = !DILocation(line: 517, column: 11, scope: !374)
!376 = !DILocation(line: 519, column: 29, scope: !374)
!377 = !DILocation(line: 519, column: 35, scope: !374)
!378 = !DILocation(line: 519, column: 7, scope: !374)
!379 = !DILocation(line: 521, column: 26, scope: !380)
!380 = distinct !DILexicalBlock(scope: !374, file: !20, line: 521, column: 11)
!381 = !DILocation(line: 521, column: 32, scope: !380)
!382 = !DILocation(line: 521, column: 11, scope: !380)
!383 = !DILocation(line: 521, column: 49, scope: !380)
!384 = !DILocation(line: 521, column: 11, scope: !374)
!385 = !DILocation(line: 522, column: 30, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !20, line: 521, column: 55)
!387 = !DILocation(line: 522, column: 36, scope: !386)
!388 = !DILocation(line: 522, column: 10, scope: !386)
!389 = !DILocation(line: 525, column: 7, scope: !386)
!390 = !DILocation(line: 527, column: 7, scope: !374)
!391 = !DILocation(line: 527, column: 13, scope: !374)
!392 = !DILocation(line: 527, column: 20, scope: !374)
!393 = !DILocation(line: 527, column: 30, scope: !374)
!394 = !DILocation(line: 529, column: 28, scope: !374)
!395 = !DILocation(line: 529, column: 34, scope: !374)
!396 = !DILocation(line: 529, column: 13, scope: !374)
!397 = !DILocation(line: 529, column: 11, scope: !374)
!398 = !DILocation(line: 531, column: 29, scope: !399)
!399 = distinct !DILexicalBlock(scope: !374, file: !20, line: 531, column: 11)
!400 = !DILocation(line: 531, column: 33, scope: !399)
!401 = !DILocation(line: 531, column: 28, scope: !399)
!402 = !DILocation(line: 531, column: 11, scope: !399)
!403 = !DILocation(line: 531, column: 11, scope: !374)
!404 = !DILocation(line: 532, column: 30, scope: !405)
!405 = distinct !DILexicalBlock(scope: !399, file: !20, line: 531, column: 44)
!406 = !DILocation(line: 532, column: 36, scope: !405)
!407 = !DILocation(line: 533, column: 43, scope: !405)
!408 = !DILocation(line: 532, column: 10, scope: !405)
!409 = !DILocation(line: 534, column: 7, scope: !405)
!410 = !DILocation(line: 536, column: 29, scope: !374)
!411 = !DILocation(line: 536, column: 35, scope: !374)
!412 = !DILocation(line: 536, column: 7, scope: !374)
!413 = !DILocation(line: 551, column: 12, scope: !374)
!414 = !DILocation(line: 551, column: 18, scope: !374)
!415 = !DILocation(line: 551, column: 25, scope: !374)
!416 = !DILocation(line: 551, column: 7, scope: !374)
!417 = !DILocation(line: 552, column: 7, scope: !374)
!418 = !DILocation(line: 552, column: 13, scope: !374)
!419 = !DILocation(line: 552, column: 20, scope: !374)
!420 = !DILocation(line: 552, column: 25, scope: !374)
!421 = !DILocation(line: 553, column: 12, scope: !374)
!422 = !DILocation(line: 553, column: 7, scope: !374)
!423 = !DILocation(line: 554, column: 4, scope: !374)
!424 = !DILocation(line: 555, column: 1, scope: !361)
!425 = distinct !DISubprogram(name: "MXUserValidateHeader", scope: !4, file: !4, line: 507, type: !426, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !97, !428}
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserObjectType", file: !4, line: 450, baseType: !3)
!429 = !DILocalVariable(name: "header", arg: 1, scope: !425, file: !4, line: 507, type: !97)
!430 = !DILocation(line: 507, column: 36, scope: !425)
!431 = !DILocalVariable(name: "objectType", arg: 2, scope: !425, file: !4, line: 508, type: !428)
!432 = !DILocation(line: 508, column: 39, scope: !425)
!433 = !DILocation(line: 510, column: 4, scope: !425)
!434 = distinct !DISubprogram(name: "MXUserDestroy", scope: !20, file: !20, line: 243, type: !246, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!435 = !DILocalVariable(name: "sema", arg: 1, scope: !434, file: !20, line: 243, type: !249)
!436 = !DILocation(line: 243, column: 32, scope: !434)
!437 = !DILocation(line: 245, column: 24, scope: !434)
!438 = !DILocation(line: 245, column: 12, scope: !434)
!439 = !DILocation(line: 245, column: 30, scope: !434)
!440 = !DILocation(line: 245, column: 11, scope: !434)
!441 = !DILocation(line: 245, column: 40, scope: !442)
!442 = !DILexicalBlockFile(scope: !434, file: !20, discriminator: 1)
!443 = !DILocation(line: 245, column: 39, scope: !442)
!444 = !DILocation(line: 245, column: 11, scope: !442)
!445 = !DILocation(line: 245, column: 11, scope: !446)
!446 = !DILexicalBlockFile(scope: !434, file: !20, discriminator: 2)
!447 = !DILocation(line: 245, column: 11, scope: !448)
!448 = !DILexicalBlockFile(scope: !434, file: !20, discriminator: 3)
!449 = !DILocation(line: 245, column: 4, scope: !448)
!450 = distinct !DISubprogram(name: "MXUser_DownSemaphore", scope: !20, file: !20, line: 577, type: !362, isLocal: false, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!451 = !DILocalVariable(name: "sema", arg: 1, scope: !450, file: !20, line: 577, type: !16)
!452 = !DILocation(line: 577, column: 39, scope: !450)
!453 = !DILocalVariable(name: "err", scope: !450, file: !20, line: 579, type: !248)
!454 = !DILocation(line: 579, column: 8, scope: !450)
!455 = !DILocation(line: 582, column: 26, scope: !450)
!456 = !DILocation(line: 582, column: 32, scope: !450)
!457 = !DILocation(line: 582, column: 4, scope: !450)
!458 = !DILocation(line: 584, column: 18, scope: !450)
!459 = !DILocation(line: 584, column: 24, scope: !450)
!460 = !DILocation(line: 584, column: 4, scope: !450)
!461 = !DILocation(line: 586, column: 31, scope: !450)
!462 = !DILocation(line: 586, column: 37, scope: !450)
!463 = !DILocation(line: 586, column: 4, scope: !450)
!464 = !DILocation(line: 621, column: 25, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !20, line: 620, column: 11)
!466 = distinct !DILexicalBlock(scope: !450, file: !20, line: 588, column: 8)
!467 = !DILocation(line: 621, column: 31, scope: !465)
!468 = !DILocation(line: 621, column: 13, scope: !465)
!469 = !DILocation(line: 621, column: 11, scope: !465)
!470 = !DILocation(line: 624, column: 26, scope: !471)
!471 = distinct !DILexicalBlock(scope: !450, file: !20, line: 624, column: 8)
!472 = !DILocation(line: 624, column: 30, scope: !471)
!473 = !DILocation(line: 624, column: 25, scope: !471)
!474 = !DILocation(line: 624, column: 8, scope: !471)
!475 = !DILocation(line: 624, column: 8, scope: !450)
!476 = !DILocation(line: 625, column: 27, scope: !477)
!477 = distinct !DILexicalBlock(scope: !471, file: !20, line: 624, column: 41)
!478 = !DILocation(line: 625, column: 33, scope: !477)
!479 = !DILocation(line: 626, column: 40, scope: !477)
!480 = !DILocation(line: 625, column: 7, scope: !477)
!481 = !DILocation(line: 627, column: 4, scope: !477)
!482 = !DILocation(line: 629, column: 27, scope: !450)
!483 = !DILocation(line: 629, column: 33, scope: !450)
!484 = !DILocation(line: 629, column: 4, scope: !450)
!485 = !DILocation(line: 631, column: 18, scope: !450)
!486 = !DILocation(line: 631, column: 24, scope: !450)
!487 = !DILocation(line: 631, column: 4, scope: !450)
!488 = !DILocation(line: 632, column: 1, scope: !450)
!489 = distinct !DISubprogram(name: "Atomic_Inc32", scope: !58, file: !58, line: 1636, type: !490, isLocal: true, isDefinition: true, scopeLine: 1637, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!493 = !DILocalVariable(name: "var", arg: 1, scope: !489, file: !58, line: 1636, type: !492)
!494 = !DILocation(line: 1636, column: 29, scope: !489)
!495 = !DILocation(line: 1645, column: 15, scope: !489)
!496 = !DILocation(line: 1645, column: 20, scope: !489)
!497 = !DILocation(line: 1643, column: 4, scope: !489)
!498 = !{i32 134101}
!499 = !DILocation(line: 1655, column: 1, scope: !489)
!500 = distinct !DISubprogram(name: "MXUserAcquisitionTracking", scope: !4, file: !4, line: 494, type: !501, isLocal: true, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !97, !314}
!503 = !DILocalVariable(name: "header", arg: 1, scope: !500, file: !4, line: 494, type: !97)
!504 = !DILocation(line: 494, column: 41, scope: !500)
!505 = !DILocalVariable(name: "checkRank", arg: 2, scope: !500, file: !4, line: 495, type: !314)
!506 = !DILocation(line: 495, column: 32, scope: !500)
!507 = !DILocation(line: 497, column: 4, scope: !500)
!508 = distinct !DISubprogram(name: "MXUserDown", scope: !20, file: !20, line: 249, type: !246, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!509 = !DILocalVariable(name: "sema", arg: 1, scope: !508, file: !20, line: 249, type: !249)
!510 = !DILocation(line: 249, column: 29, scope: !508)
!511 = !DILocalVariable(name: "err", scope: !508, file: !20, line: 251, type: !248)
!512 = !DILocation(line: 251, column: 8, scope: !508)
!513 = !DILocation(line: 254, column: 4, scope: !508)
!514 = distinct !{!514, !513}
!515 = !DILocation(line: 255, column: 23, scope: !516)
!516 = distinct !DILexicalBlock(scope: !508, file: !20, line: 254, column: 7)
!517 = !DILocation(line: 255, column: 14, scope: !516)
!518 = !DILocation(line: 255, column: 29, scope: !516)
!519 = !DILocation(line: 255, column: 13, scope: !516)
!520 = !DILocation(line: 255, column: 39, scope: !521)
!521 = !DILexicalBlockFile(scope: !516, file: !20, discriminator: 1)
!522 = !DILocation(line: 255, column: 38, scope: !521)
!523 = !DILocation(line: 255, column: 13, scope: !521)
!524 = !DILocation(line: 255, column: 13, scope: !525)
!525 = !DILexicalBlockFile(scope: !516, file: !20, discriminator: 2)
!526 = !DILocation(line: 255, column: 13, scope: !527)
!527 = !DILexicalBlockFile(scope: !516, file: !20, discriminator: 3)
!528 = !DILocation(line: 255, column: 11, scope: !527)
!529 = !DILocation(line: 256, column: 4, scope: !516)
!530 = !DILocation(line: 256, column: 13, scope: !531)
!531 = !DILexicalBlockFile(scope: !508, file: !20, discriminator: 1)
!532 = !DILocation(line: 256, column: 17, scope: !531)
!533 = !DILocation(line: 256, column: 4, scope: !531)
!534 = !DILocation(line: 258, column: 11, scope: !508)
!535 = !DILocation(line: 258, column: 4, scope: !508)
!536 = distinct !DISubprogram(name: "MXUserReleaseTracking", scope: !4, file: !4, line: 501, type: !95, isLocal: true, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!537 = !DILocalVariable(name: "header", arg: 1, scope: !536, file: !4, line: 501, type: !97)
!538 = !DILocation(line: 501, column: 37, scope: !536)
!539 = !DILocation(line: 503, column: 4, scope: !536)
!540 = distinct !DISubprogram(name: "Atomic_Dec32", scope: !58, file: !58, line: 1676, type: !490, isLocal: true, isDefinition: true, scopeLine: 1677, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!541 = !DILocalVariable(name: "var", arg: 1, scope: !540, file: !58, line: 1676, type: !492)
!542 = !DILocation(line: 1676, column: 29, scope: !540)
!543 = !DILocation(line: 1685, column: 15, scope: !540)
!544 = !DILocation(line: 1685, column: 20, scope: !540)
!545 = !DILocation(line: 1683, column: 4, scope: !540)
!546 = !{i32 134391}
!547 = !DILocation(line: 1695, column: 1, scope: !540)
!548 = distinct !DISubprogram(name: "MXUser_TimedDownSemaphore", scope: !20, file: !20, line: 655, type: !549, isLocal: false, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!549 = !DISubroutineType(types: !550)
!550 = !{!314, !16, !27}
!551 = !DILocalVariable(name: "sema", arg: 1, scope: !548, file: !20, line: 655, type: !16)
!552 = !DILocation(line: 655, column: 44, scope: !548)
!553 = !DILocalVariable(name: "waitTimeMsec", arg: 2, scope: !548, file: !20, line: 656, type: !27)
!554 = !DILocation(line: 656, column: 34, scope: !548)
!555 = !DILocalVariable(name: "err", scope: !548, file: !20, line: 658, type: !248)
!556 = !DILocation(line: 658, column: 8, scope: !548)
!557 = !DILocalVariable(name: "downOccurred", scope: !548, file: !20, line: 659, type: !314)
!558 = !DILocation(line: 659, column: 9, scope: !548)
!559 = !DILocation(line: 662, column: 26, scope: !548)
!560 = !DILocation(line: 662, column: 32, scope: !548)
!561 = !DILocation(line: 662, column: 4, scope: !548)
!562 = !DILocation(line: 664, column: 18, scope: !548)
!563 = !DILocation(line: 664, column: 24, scope: !548)
!564 = !DILocation(line: 664, column: 4, scope: !548)
!565 = !DILocation(line: 666, column: 31, scope: !548)
!566 = !DILocation(line: 666, column: 37, scope: !548)
!567 = !DILocation(line: 666, column: 4, scope: !548)
!568 = !DILocation(line: 705, column: 30, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !20, line: 704, column: 11)
!570 = distinct !DILexicalBlock(scope: !548, file: !20, line: 668, column: 8)
!571 = !DILocation(line: 705, column: 36, scope: !569)
!572 = !DILocation(line: 705, column: 53, scope: !569)
!573 = !DILocation(line: 705, column: 13, scope: !569)
!574 = !DILocation(line: 705, column: 11, scope: !569)
!575 = !DILocation(line: 709, column: 26, scope: !576)
!576 = distinct !DILexicalBlock(scope: !548, file: !20, line: 709, column: 8)
!577 = !DILocation(line: 709, column: 30, scope: !576)
!578 = !DILocation(line: 709, column: 25, scope: !576)
!579 = !DILocation(line: 709, column: 8, scope: !576)
!580 = !DILocation(line: 709, column: 8, scope: !548)
!581 = !DILocation(line: 710, column: 27, scope: !582)
!582 = distinct !DILexicalBlock(scope: !576, file: !20, line: 709, column: 41)
!583 = !DILocation(line: 710, column: 33, scope: !582)
!584 = !DILocation(line: 711, column: 40, scope: !582)
!585 = !DILocation(line: 710, column: 7, scope: !582)
!586 = !DILocation(line: 712, column: 4, scope: !582)
!587 = !DILocation(line: 714, column: 27, scope: !548)
!588 = !DILocation(line: 714, column: 33, scope: !548)
!589 = !DILocation(line: 714, column: 4, scope: !548)
!590 = !DILocation(line: 716, column: 18, scope: !548)
!591 = !DILocation(line: 716, column: 24, scope: !548)
!592 = !DILocation(line: 716, column: 4, scope: !548)
!593 = !DILocation(line: 718, column: 11, scope: !548)
!594 = !DILocation(line: 718, column: 4, scope: !548)
!595 = distinct !DISubprogram(name: "MXUserTimedDown", scope: !20, file: !20, line: 262, type: !596, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
!596 = !DISubroutineType(types: !597)
!597 = !{!248, !249, !27, !598}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!599 = !DILocalVariable(name: "sema", arg: 1, scope: !595, file: !20, line: 262, type: !249)
!600 = !DILocation(line: 262, column: 34, scope: !595)
!601 = !DILocalVariable(name: "waitTimeMsec", arg: 2, scope: !595, file: !20, line: 263, type: !27)
!602 = !DILocation(line: 263, column: 24, scope: !595)
!603 = !DILocalVariable(name: "downOccurred", arg: 3, scope: !595, file: !20, line: 264, type: !598)
!604 = !DILocation(line: 264, column: 23, scope: !595)
!605 = !DILocalVariable(name: "err", scope: !595, file: !20, line: 266, type: !248)
!606 = !DILocation(line: 266, column: 8, scope: !595)
!607 = !DILocalVariable(name: "endNS", scope: !595, file: !20, line: 267, type: !82)
!608 = !DILocation(line: 267, column: 11, scope: !595)
!609 = !DILocalVariable(name: "curTime", scope: !595, file: !20, line: 268, type: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !611, line: 30, size: 128, align: 64, elements: !612)
!611 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line507")
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !610, file: !611, line: 32, baseType: !88, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !610, file: !611, line: 33, baseType: !615, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !89, line: 141, baseType: !74)
!616 = !DILocation(line: 268, column: 19, scope: !595)
!617 = !DILocalVariable(name: "endTime", scope: !595, file: !20, line: 269, type: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !87, line: 120, size: 128, align: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !618, file: !87, line: 122, baseType: !88, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !618, file: !87, line: 123, baseType: !622, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !89, line: 175, baseType: !74)
!623 = !DILocation(line: 269, column: 20, scope: !595)
!624 = !DILocation(line: 277, column: 4, scope: !595)
!625 = !DILocation(line: 278, column: 30, scope: !595)
!626 = !DILocation(line: 278, column: 37, scope: !595)
!627 = !DILocation(line: 279, column: 30, scope: !595)
!628 = !DILocation(line: 279, column: 38, scope: !595)
!629 = !DILocation(line: 278, column: 61, scope: !595)
!630 = !DILocation(line: 280, column: 22, scope: !595)
!631 = !DILocation(line: 280, column: 13, scope: !595)
!632 = !DILocation(line: 280, column: 35, scope: !595)
!633 = !DILocation(line: 279, column: 46, scope: !595)
!634 = !DILocation(line: 278, column: 10, scope: !595)
!635 = !DILocation(line: 282, column: 31, scope: !595)
!636 = !DILocation(line: 282, column: 37, scope: !595)
!637 = !DILocation(line: 282, column: 12, scope: !595)
!638 = !DILocation(line: 282, column: 19, scope: !595)
!639 = !DILocation(line: 283, column: 34, scope: !595)
!640 = !DILocation(line: 283, column: 40, scope: !595)
!641 = !DILocation(line: 283, column: 12, scope: !595)
!642 = !DILocation(line: 283, column: 20, scope: !595)
!643 = !DILocation(line: 285, column: 4, scope: !595)
!644 = distinct !{!644, !643}
!645 = !DILocation(line: 286, column: 28, scope: !646)
!646 = distinct !DILexicalBlock(scope: !595, file: !20, line: 285, column: 7)
!647 = !DILocation(line: 286, column: 14, scope: !646)
!648 = !DILocation(line: 286, column: 44, scope: !646)
!649 = !DILocation(line: 286, column: 13, scope: !646)
!650 = !DILocation(line: 286, column: 54, scope: !651)
!651 = !DILexicalBlockFile(scope: !646, file: !20, discriminator: 1)
!652 = !DILocation(line: 286, column: 53, scope: !651)
!653 = !DILocation(line: 286, column: 13, scope: !651)
!654 = !DILocation(line: 286, column: 13, scope: !655)
!655 = !DILexicalBlockFile(scope: !646, file: !20, discriminator: 2)
!656 = !DILocation(line: 286, column: 13, scope: !657)
!657 = !DILexicalBlockFile(scope: !646, file: !20, discriminator: 3)
!658 = !DILocation(line: 286, column: 11, scope: !657)
!659 = !DILocation(line: 288, column: 11, scope: !660)
!660 = distinct !DILexicalBlock(scope: !646, file: !20, line: 288, column: 11)
!661 = !DILocation(line: 288, column: 15, scope: !660)
!662 = !DILocation(line: 288, column: 11, scope: !646)
!663 = !DILocation(line: 289, column: 11, scope: !664)
!664 = distinct !DILexicalBlock(scope: !660, file: !20, line: 288, column: 21)
!665 = !DILocation(line: 289, column: 24, scope: !664)
!666 = !DILocation(line: 290, column: 7, scope: !664)
!667 = !DILocation(line: 291, column: 11, scope: !668)
!668 = distinct !DILexicalBlock(scope: !660, file: !20, line: 290, column: 14)
!669 = !DILocation(line: 291, column: 24, scope: !668)
!670 = !DILocation(line: 294, column: 14, scope: !671)
!671 = distinct !DILexicalBlock(scope: !668, file: !20, line: 294, column: 14)
!672 = !DILocation(line: 294, column: 18, scope: !671)
!673 = !DILocation(line: 294, column: 14, scope: !668)
!674 = !DILocation(line: 295, column: 17, scope: !675)
!675 = distinct !DILexicalBlock(scope: !671, file: !20, line: 294, column: 31)
!676 = !DILocation(line: 296, column: 10, scope: !675)
!677 = !DILocation(line: 298, column: 4, scope: !646)
!678 = !DILocation(line: 298, column: 13, scope: !679)
!679 = !DILexicalBlockFile(scope: !595, file: !20, discriminator: 1)
!680 = !DILocation(line: 298, column: 17, scope: !679)
!681 = !DILocation(line: 298, column: 4, scope: !679)
!682 = !DILocation(line: 300, column: 11, scope: !595)
!683 = !DILocation(line: 300, column: 4, scope: !595)
!684 = distinct !DISubprogram(name: "MXUser_TryDownSemaphore", scope: !20, file: !20, line: 745, type: !685, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !98)
