; ModuleID = './[inter]third-party--zlib-1.2.7--example.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--example.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.gzFile_s = type { i32, i8*, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type { i32 }

@hello = constant [14 x i8] c"hello, hello!\00", align 1
@dictionary = constant [6 x i8] c"hello\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [14 x i8] c"%s error: %d\0A\00", align 1
@.str.1 = private unnamed_addr constant [9 x i8] c"compress\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"garbage\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"uncompress\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"bad uncompress\0A\00", align 1
@.str.5 = private unnamed_addr constant [18 x i8] c"uncompress(): %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"wb\00", align 1

!50 = !{null, !18, !18}
!51 = !{i32 2, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!54 = distinct !DISubprogram(name: "test_compress", scope: !24, file: !24, line: 88, type: !55, isLocal: false, isDefinition: true, scopeLine: 91, isOptimized: false, unit: !0, variables: !2)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !21, !4, !21, !4}
!57 = !DILocalVariable(name: "compr", arg: 1, scope: !54, file: !24, line: 89, type: !21)
!58 = !DIExpression()
!59 = !DILocation(line: 89, column: 11, scope: !54)
!60 = !DILocalVariable(name: "comprLen", arg: 2, scope: !54, file: !24, line: 90, type: !4)
!61 = !DILocation(line: 90, column: 11, scope: !54)
!62 = !DILocalVariable(name: "uncompr", arg: 3, scope: !54, file: !24, line: 89, type: !21)
!63 = !DILocation(line: 89, column: 19, scope: !54)
!64 = !DILocalVariable(name: "uncomprLen", arg: 4, scope: !54, file: !24, line: 90, type: !4)
!65 = !DILocation(line: 90, column: 21, scope: !54)
!66 = !DILocalVariable(name: "err", scope: !54, file: !24, line: 92, type: !14)
!67 = !DILocation(line: 92, column: 9, scope: !54)
!68 = !DILocalVariable(name: "len", scope: !54, file: !24, line: 93, type: !4)
!69 = !DILocation(line: 93, column: 11, scope: !54)
!70 = !DILocation(line: 93, column: 24, scope: !54)
!71 = !DILocation(line: 93, column: 37, scope: !54)
!72 = !DILocation(line: 95, column: 20, scope: !54)
!73 = !DILocation(line: 95, column: 59, scope: !54)
!74 = !DILocation(line: 95, column: 11, scope: !54)
!75 = !DILocation(line: 95, column: 9, scope: !54)
!76 = !DILocation(line: 96, column: 11, scope: !77)
!77 = distinct !DILexicalBlock(scope: !78, file: !24, line: 96, column: 11)
!78 = distinct !DILexicalBlock(scope: !54, file: !24, line: 96, column: 5)
!79 = !DILocation(line: 96, column: 15, scope: !77)
!80 = !DILocation(line: 96, column: 11, scope: !78)
!81 = !DILocation(line: 96, column: 4, scope: !82)
!82 = !DILexicalBlockFile(scope: !83, file: !24, discriminator: 1)
!83 = distinct !DILexicalBlock(scope: !77, file: !24, line: 96, column: 21)
!84 = !DILocation(line: 96, column: 36, scope: !82)
!85 = !DILocation(line: 96, column: 23, scope: !82)
!86 = !DILocation(line: 96, column: 42, scope: !87)
!87 = !DILexicalBlockFile(scope: !82, file: !24, discriminator: 2)
!88 = !DILocation(line: 96, column: 42, scope: !82)
!89 = !DILocation(line: 98, column: 19, scope: !54)
!90 = !DILocation(line: 98, column: 5, scope: !54)
!91 = !DILocation(line: 100, column: 22, scope: !54)
!92 = !DILocation(line: 100, column: 44, scope: !54)
!93 = !DILocation(line: 100, column: 51, scope: !54)
!94 = !DILocation(line: 100, column: 11, scope: !54)
!95 = !DILocation(line: 100, column: 9, scope: !54)
!96 = !DILocation(line: 101, column: 11, scope: !97)
!97 = distinct !DILexicalBlock(scope: !98, file: !24, line: 101, column: 11)
!98 = distinct !DILexicalBlock(scope: !54, file: !24, line: 101, column: 5)
!99 = !DILocation(line: 101, column: 15, scope: !97)
!100 = !DILocation(line: 101, column: 11, scope: !98)
!101 = !DILocation(line: 101, column: 4, scope: !102)
!102 = !DILexicalBlockFile(scope: !103, file: !24, discriminator: 1)
!103 = distinct !DILexicalBlock(scope: !97, file: !24, line: 101, column: 21)
!104 = !DILocation(line: 101, column: 38, scope: !102)
!105 = !DILocation(line: 101, column: 23, scope: !102)
!106 = !DILocation(line: 101, column: 44, scope: !107)
!107 = !DILexicalBlockFile(scope: !102, file: !24, discriminator: 2)
!108 = !DILocation(line: 101, column: 44, scope: !102)
!109 = !DILocation(line: 103, column: 23, scope: !110)
!110 = distinct !DILexicalBlock(scope: !54, file: !24, line: 103, column: 9)
!111 = !DILocation(line: 103, column: 9, scope: !110)
!112 = !DILocation(line: 103, column: 9, scope: !54)
!113 = !DILocation(line: 104, column: 16, scope: !114)
!114 = distinct !DILexicalBlock(scope: !110, file: !24, line: 103, column: 40)
!115 = !DILocation(line: 104, column: 9, scope: !114)
!116 = !DILocation(line: 105, column: 9, scope: !114)
!117 = !DILocation(line: 107, column: 46, scope: !118)
!118 = distinct !DILexicalBlock(scope: !110, file: !24, line: 106, column: 12)
!119 = !DILocation(line: 107, column: 9, scope: !118)
!120 = !DILocation(line: 109, column: 1, scope: !54)
!121 = distinct !DISubprogram(name: "test_gzio", scope: !24, file: !24, line: 114, type: !122, isLocal: false, isDefinition: true, scopeLine: 118, isOptimized: false, unit: !0, variables: !2)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !38, !21, !4}
!124 = !DILocalVariable(name: "fname", arg: 1, scope: !121, file: !24, line: 115, type: !38)
!125 = !DILocation(line: 115, column: 17, scope: !121)
!126 = !DILocalVariable(name: "uncompr", arg: 2, scope: !121, file: !24, line: 116, type: !21)
!127 = !DILocation(line: 116, column: 11, scope: !121)
!128 = !DILocalVariable(name: "uncomprLen", arg: 3, scope: !121, file: !24, line: 117, type: !4)
!129 = !DILocation(line: 117, column: 11, scope: !121)
!130 = !DILocalVariable(name: "err", scope: !121, file: !24, line: 122, type: !14)
!131 = !DILocation(line: 122, column: 9, scope: !121)
!132 = !DILocalVariable(name: "len", scope: !121, file: !24, line: 123, type: !14)
!133 = !DILocation(line: 123, column: 9, scope: !121)
!134 = !DILocation(line: 123, column: 20, scope: !121)
!135 = !DILocation(line: 123, column: 15, scope: !121)
!136 = !DILocation(line: 123, column: 33, scope: !121)
!137 = !DILocalVariable(name: "file", scope: !121, file: !24, line: 124, type: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !42, line: 1207, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !42, line: 1670, size: 192, align: 64, elements: !141)
!141 = !{!142, !143, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !140, file: !42, line: 1671, baseType: !16, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !42, line: 1672, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !140, file: !42, line: 1673, baseType: !17, size: 64, align: 64, offset: 128)
!146 = !DILocation(line: 124, column: 12, scope: !121)
!147 = !DILocalVariable(name: "pos", scope: !121, file: !24, line: 125, type: !17)
!148 = !DILocation(line: 125, column: 10, scope: !121)
!149 = !DILocation(line: 127, column: 19, scope: !121)
!150 = !DILocation(line: 127, column: 12, scope: !121)
!151 = !DILocation(line: 127, column: 10, scope: !121)
!152 = !DILocation(line: 128, column: 9, scope: !153)
!153 = distinct !DILexicalBlock(scope: !121, file: !24, line: 128, column: 9)
!154 = !DILocation(line: 128, column: 14, scope: !153)
!155 = !DILocation(line: 128, column: 9, scope: !121)
!156 = !DILocation(line: 129, column: 16, scope: !157)
!157 = distinct !DILexicalBlock(scope: !153, file: !24, line: 128, column: 22)
!158 = !DILocation(line: 129, column: 9, scope: !157)
!159 = !DILocation(line: 130, column: 9, scope: !157)
!160 = !DILocation(line: 132, column: 12, scope: !121)
!161 = !DILocation(line: 132, column: 5, scope: !121)
!162 = !DILocation(line: 133, column: 16, scope: !163)
!163 = distinct !DILexicalBlock(scope: !121, file: !24, line: 133, column: 9)
!164 = !DILocation(line: 133, column: 9, scope: !163)
!165 = !DILocation(line: 133, column: 30, scope: !163)
!166 = !DILocation(line: 133, column: 9, scope: !121)
!167 = !DILocation(line: 134, column: 16, scope: !168)
!168 = distinct !DILexicalBlock(scope: !163, file: !24, line: 133, column: 36)
!169 = !DILocation(line: 134, column: 52, scope: !168)
!170 = !DILocation(line: 134, column: 44, scope: !168)
!171 = !DILocation(line: 134, column: 9, scope: !172)
!172 = !DILexicalBlockFile(scope: !168, file: !24, discriminator: 1)
!173 = !DILocation(line: 135, column: 9, scope: !168)
!174 = !DILocation(line: 137, column: 18, scope: !175)
!175 = distinct !DILexicalBlock(scope: !121, file: !24, line: 137, column: 9)
!176 = !DILocation(line: 137, column: 9, scope: !175)
!177 = !DILocation(line: 137, column: 42, scope: !175)
!178 = !DILocation(line: 137, column: 9, scope: !121)
!179 = !DILocation(line: 138, column: 16, scope: !180)
!180 = distinct !DILexicalBlock(scope: !175, file: !24, line: 137, column: 48)
!181 = !DILocation(line: 138, column: 54, scope: !180)
!182 = !DILocation(line: 138, column: 46, scope: !180)
!183 = !DILocation(line: 138, column: 9, scope: !184)
!184 = !DILexicalBlockFile(scope: !180, file: !24, discriminator: 1)
!185 = !DILocation(line: 139, column: 9, scope: !180)
!186 = !DILocation(line: 141, column: 12, scope: !121)
!187 = !DILocation(line: 141, column: 5, scope: !121)
!188 = !DILocation(line: 142, column: 13, scope: !121)
!189 = !DILocation(line: 142, column: 5, scope: !121)
!190 = !DILocation(line: 144, column: 19, scope: !121)
!191 = !DILocation(line: 144, column: 12, scope: !121)
!192 = !DILocation(line: 144, column: 10, scope: !121)
!193 = !DILocation(line: 145, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !121, file: !24, line: 145, column: 9)
!195 = !DILocation(line: 145, column: 14, scope: !194)
!196 = !DILocation(line: 145, column: 9, scope: !121)
!197 = !DILocation(line: 146, column: 16, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !24, line: 145, column: 22)
!199 = !DILocation(line: 146, column: 9, scope: !198)
!200 = !DILocation(line: 147, column: 9, scope: !198)
!201 = !DILocation(line: 149, column: 19, scope: !121)
!202 = !DILocation(line: 149, column: 5, scope: !121)
!203 = !DILocation(line: 151, column: 16, scope: !204)
!204 = distinct !DILexicalBlock(scope: !121, file: !24, line: 151, column: 9)
!205 = !DILocation(line: 151, column: 22, scope: !204)
!206 = !DILocation(line: 151, column: 41, scope: !204)
!207 = !DILocation(line: 151, column: 31, scope: !204)
!208 = !DILocation(line: 151, column: 9, scope: !204)
!209 = !DILocation(line: 151, column: 56, scope: !204)
!210 = !DILocation(line: 151, column: 53, scope: !204)
!211 = !DILocation(line: 151, column: 9, scope: !121)
!212 = !DILocation(line: 152, column: 16, scope: !213)
!213 = distinct !DILexicalBlock(scope: !204, file: !24, line: 151, column: 61)
!214 = !DILocation(line: 152, column: 52, scope: !213)
!215 = !DILocation(line: 152, column: 44, scope: !213)
!216 = !DILocation(line: 152, column: 9, scope: !217)
!217 = !DILexicalBlockFile(scope: !213, file: !24, discriminator: 1)
!218 = !DILocation(line: 153, column: 9, scope: !213)
!219 = !DILocation(line: 155, column: 23, scope: !220)
!220 = distinct !DILexicalBlock(scope: !121, file: !24, line: 155, column: 9)
!221 = !DILocation(line: 155, column: 9, scope: !220)
!222 = !DILocation(line: 155, column: 9, scope: !121)
!223 = !DILocation(line: 156, column: 16, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !24, line: 155, column: 40)
!225 = !DILocation(line: 156, column: 51, scope: !224)
!226 = !DILocation(line: 156, column: 9, scope: !224)
!227 = !DILocation(line: 157, column: 9, scope: !224)
!228 = !DILocation(line: 159, column: 41, scope: !229)
!229 = distinct !DILexicalBlock(scope: !220, file: !24, line: 158, column: 12)
!230 = !DILocation(line: 159, column: 9, scope: !229)
!231 = !DILocation(line: 162, column: 18, scope: !121)
!232 = !DILocation(line: 162, column: 11, scope: !121)
!233 = !DILocation(line: 162, column: 9, scope: !121)
!234 = !DILocation(line: 163, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !121, file: !24, line: 163, column: 9)
!236 = !DILocation(line: 163, column: 13, scope: !235)
!237 = !DILocation(line: 163, column: 18, scope: !235)
!238 = !DILocation(line: 163, column: 28, scope: !239)
!239 = !DILexicalBlockFile(scope: !235, file: !24, discriminator: 1)
!240 = !DILocation(line: 163, column: 21, scope: !239)
!241 = !DILocation(line: 163, column: 37, scope: !239)
!242 = !DILocation(line: 163, column: 34, scope: !239)
!243 = !DILocation(line: 163, column: 9, scope: !239)
!244 = !DILocation(line: 164, column: 16, scope: !245)
!245 = distinct !DILexicalBlock(scope: !235, file: !24, line: 163, column: 42)
!246 = !DILocation(line: 165, column: 23, scope: !245)
!247 = !DILocation(line: 165, column: 41, scope: !245)
!248 = !DILocation(line: 165, column: 34, scope: !245)
!249 = !DILocation(line: 164, column: 9, scope: !245)
!250 = !DILocation(line: 166, column: 9, scope: !245)
!251 = !DILocation(line: 169, column: 11, scope: !252)
!252 = distinct !DILexicalBlock(scope: !121, file: !24, line: 169, column: 9)
!253 = !DILocation(line: 169, column: 18, scope: !252)
!254 = !DILocation(line: 169, column: 10, scope: !252)
!255 = !DILocation(line: 169, column: 27, scope: !256)
!256 = !DILexicalBlockFile(scope: !252, file: !24, discriminator: 1)
!257 = !DILocation(line: 169, column: 34, scope: !256)
!258 = !DILocation(line: 169, column: 38, scope: !256)
!259 = !DILocation(line: 169, column: 43, scope: !256)
!260 = !DILocation(line: 169, column: 50, scope: !256)
!261 = !DILocation(line: 169, column: 53, scope: !256)
!262 = !DILocation(line: 169, column: 60, scope: !256)
!263 = !DILocation(line: 169, column: 67, scope: !256)
!264 = !DILocation(line: 169, column: 72, scope: !256)
!265 = !DILocation(line: 169, column: 57, scope: !256)
!266 = !DILocation(line: 169, column: 25, scope: !256)
!267 = !DILocation(line: 169, column: 10, scope: !256)
!268 = !DILocation(line: 169, column: 85, scope: !269)
!269 = !DILexicalBlockFile(scope: !252, file: !24, discriminator: 2)
!270 = !DILocation(line: 169, column: 78, scope: !269)
!271 = !DILocation(line: 169, column: 10, scope: !269)
!272 = !DILocation(line: 169, column: 10, scope: !273)
!273 = !DILexicalBlockFile(scope: !252, file: !24, discriminator: 3)
!274 = !DILocation(line: 169, column: 92, scope: !273)
!275 = !DILocation(line: 169, column: 9, scope: !273)
!276 = !DILocation(line: 170, column: 16, scope: !277)
!277 = distinct !DILexicalBlock(scope: !252, file: !24, line: 169, column: 100)
!278 = !DILocation(line: 170, column: 9, scope: !277)
!279 = !DILocation(line: 171, column: 9, scope: !277)
!280 = !DILocation(line: 174, column: 23, scope: !281)
!281 = distinct !DILexicalBlock(scope: !121, file: !24, line: 174, column: 9)
!282 = !DILocation(line: 174, column: 9, scope: !281)
!283 = !DILocation(line: 174, column: 29, scope: !281)
!284 = !DILocation(line: 174, column: 9, scope: !121)
!285 = !DILocation(line: 175, column: 16, scope: !286)
!286 = distinct !DILexicalBlock(scope: !281, file: !24, line: 174, column: 37)
!287 = !DILocation(line: 175, column: 9, scope: !286)
!288 = !DILocation(line: 176, column: 9, scope: !286)
!289 = !DILocation(line: 179, column: 12, scope: !121)
!290 = !DILocation(line: 179, column: 25, scope: !121)
!291 = !DILocation(line: 179, column: 39, scope: !121)
!292 = !DILocation(line: 179, column: 34, scope: !121)
!293 = !DILocation(line: 179, column: 5, scope: !121)
!294 = !DILocation(line: 180, column: 23, scope: !295)
!295 = distinct !DILexicalBlock(scope: !121, file: !24, line: 180, column: 9)
!296 = !DILocation(line: 180, column: 9, scope: !295)
!297 = !DILocation(line: 180, column: 32, scope: !295)
!298 = !DILocation(line: 180, column: 9, scope: !121)
!299 = !DILocation(line: 181, column: 16, scope: !300)
!300 = distinct !DILexicalBlock(scope: !295, file: !24, line: 180, column: 38)
!301 = !DILocation(line: 181, column: 65, scope: !300)
!302 = !DILocation(line: 181, column: 57, scope: !300)
!303 = !DILocation(line: 181, column: 9, scope: !304)
!304 = !DILexicalBlockFile(scope: !300, file: !24, discriminator: 1)
!305 = !DILocation(line: 182, column: 9, scope: !300)
!306 = !DILocation(line: 184, column: 23, scope: !307)
!307 = distinct !DILexicalBlock(scope: !121, file: !24, line: 184, column: 9)
!308 = !DILocation(line: 184, column: 9, scope: !307)
!309 = !DILocation(line: 184, column: 9, scope: !121)
!310 = !DILocation(line: 185, column: 16, scope: !311)
!311 = distinct !DILexicalBlock(scope: !307, file: !24, line: 184, column: 44)
!312 = !DILocation(line: 185, column: 9, scope: !311)
!313 = !DILocation(line: 186, column: 9, scope: !311)
!314 = !DILocation(line: 188, column: 54, scope: !315)
!315 = distinct !DILexicalBlock(scope: !307, file: !24, line: 187, column: 12)
!316 = !DILocation(line: 188, column: 9, scope: !315)
!317 = !DILocation(line: 191, column: 13, scope: !121)
!318 = !DILocation(line: 191, column: 5, scope: !121)
!319 = !DILocation(line: 193, column: 1, scope: !121)
!320 = distinct !DISubprogram(name: "test_deflate", scope: !24, file: !24, line: 200, type: !321, isLocal: false, isDefinition: true, scopeLine: 203, isOptimized: false, unit: !0, variables: !2)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !21, !4}
!323 = !DILocalVariable(name: "compr", arg: 1, scope: !320, file: !24, line: 201, type: !21)
!324 = !DILocation(line: 201, column: 11, scope: !320)
!325 = !DILocalVariable(name: "comprLen", arg: 2, scope: !320, file: !24, line: 202, type: !4)
!326 = !DILocation(line: 202, column: 11, scope: !320)
!327 = !DILocalVariable(name: "c_stream", scope: !320, file: !24, line: 204, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !42, line: 104, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !42, line: 85, size: 896, align: 64, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !343, !344, !345, !346, !347, !348}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !329, file: !42, line: 86, baseType: !19, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !329, file: !42, line: 87, baseType: !20, size: 32, align: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !329, file: !42, line: 88, baseType: !4, size: 64, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !329, file: !42, line: 90, baseType: !19, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !329, file: !42, line: 91, baseType: !20, size: 32, align: 32, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !329, file: !42, line: 92, baseType: !4, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !329, file: !42, line: 94, baseType: !12, size: 64, align: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !329, file: !42, line: 95, baseType: !339, size: 64, align: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !42, line: 1742, size: 32, align: 32, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !340, file: !42, line: 1742, baseType: !14, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !329, file: !42, line: 97, baseType: !41, size: 64, align: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !329, file: !42, line: 98, baseType: !47, size: 64, align: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !329, file: !42, line: 99, baseType: !18, size: 64, align: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !329, file: !42, line: 101, baseType: !14, size: 32, align: 32, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !329, file: !42, line: 102, baseType: !4, size: 64, align: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !329, file: !42, line: 103, baseType: !4, size: 64, align: 64, offset: 832)
!349 = !DILocation(line: 204, column: 14, scope: !320)
!350 = !DILocalVariable(name: "err", scope: !320, file: !24, line: 205, type: !14)
!351 = !DILocation(line: 205, column: 9, scope: !320)
!352 = !DILocalVariable(name: "len", scope: !320, file: !24, line: 206, type: !4)
!353 = !DILocation(line: 206, column: 11, scope: !320)
!354 = !DILocation(line: 206, column: 24, scope: !320)
!355 = !DILocation(line: 206, column: 37, scope: !320)
!356 = !DILocation(line: 208, column: 23, scope: !320)
!357 = !DILocation(line: 208, column: 14, scope: !320)
!358 = !DILocation(line: 208, column: 21, scope: !320)
!359 = !DILocation(line: 209, column: 22, scope: !320)
!360 = !DILocation(line: 209, column: 14, scope: !320)
!361 = !DILocation(line: 209, column: 20, scope: !320)
!362 = !DILocation(line: 210, column: 14, scope: !320)
!363 = !DILocation(line: 210, column: 21, scope: !320)
!364 = !DILocation(line: 212, column: 11, scope: !320)
!365 = !DILocation(line: 212, column: 9, scope: !320)
!366 = !DILocation(line: 213, column: 11, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !24, line: 213, column: 11)
!368 = distinct !DILexicalBlock(scope: !320, file: !24, line: 213, column: 5)
!369 = !DILocation(line: 213, column: 15, scope: !367)
!370 = !DILocation(line: 213, column: 11, scope: !368)
!371 = !DILocation(line: 213, column: 4, scope: !372)
!372 = !DILexicalBlockFile(scope: !373, file: !24, discriminator: 1)
!373 = distinct !DILexicalBlock(scope: !367, file: !24, line: 213, column: 21)
!374 = !DILocation(line: 213, column: 39, scope: !372)
!375 = !DILocation(line: 213, column: 23, scope: !372)
!376 = !DILocation(line: 213, column: 45, scope: !377)
!377 = !DILexicalBlockFile(scope: !372, file: !24, discriminator: 2)
!378 = !DILocation(line: 213, column: 45, scope: !372)
!379 = !DILocation(line: 215, column: 14, scope: !320)
!380 = !DILocation(line: 215, column: 22, scope: !320)
!381 = !DILocation(line: 216, column: 25, scope: !320)
!382 = !DILocation(line: 216, column: 14, scope: !320)
!383 = !DILocation(line: 216, column: 23, scope: !320)
!384 = !DILocation(line: 218, column: 5, scope: !320)
!385 = !DILocation(line: 218, column: 21, scope: !386)
!386 = !DILexicalBlockFile(scope: !320, file: !24, discriminator: 1)
!387 = !DILocation(line: 218, column: 33, scope: !386)
!388 = !DILocation(line: 218, column: 30, scope: !386)
!389 = !DILocation(line: 218, column: 37, scope: !386)
!390 = !DILocation(line: 218, column: 49, scope: !391)
!391 = !DILexicalBlockFile(scope: !320, file: !24, discriminator: 2)
!392 = !DILocation(line: 218, column: 61, scope: !391)
!393 = !DILocation(line: 218, column: 59, scope: !391)
!394 = !DILocation(line: 218, column: 5, scope: !395)
!395 = !DILexicalBlockFile(scope: !320, file: !24, discriminator: 3)
!396 = !DILocation(line: 219, column: 38, scope: !397)
!397 = distinct !DILexicalBlock(scope: !320, file: !24, line: 218, column: 71)
!398 = !DILocation(line: 219, column: 48, scope: !397)
!399 = !DILocation(line: 219, column: 18, scope: !397)
!400 = !DILocation(line: 219, column: 27, scope: !397)
!401 = !DILocation(line: 220, column: 15, scope: !397)
!402 = !DILocation(line: 220, column: 13, scope: !397)
!403 = !DILocation(line: 221, column: 15, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !24, line: 221, column: 15)
!405 = distinct !DILexicalBlock(scope: !397, file: !24, line: 221, column: 9)
!406 = !DILocation(line: 221, column: 19, scope: !404)
!407 = !DILocation(line: 221, column: 15, scope: !405)
!408 = !DILocation(line: 221, column: 8, scope: !409)
!409 = !DILexicalBlockFile(scope: !410, file: !24, discriminator: 1)
!410 = distinct !DILexicalBlock(scope: !404, file: !24, line: 221, column: 25)
!411 = !DILocation(line: 221, column: 39, scope: !409)
!412 = !DILocation(line: 221, column: 27, scope: !409)
!413 = !DILocation(line: 221, column: 45, scope: !414)
