; ModuleID = './libvmtools_la-i18n.o.i'
source_filename = "./libvmtools_la-i18n.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MsgState = type { %struct.HashTable*, %struct.GStaticMutex }
%struct.HashTable = type opaque
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct._GOnce = type { i32, i8* }
%struct.MsgCatalog = type { %struct.HashTable* }
%struct._GError = type { i32, i32, i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }

!321 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!322 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!323 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!324 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!325 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!326 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!327 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!328 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!329 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!330 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!331 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!332 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!333 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!334 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!335 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!336 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!337 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!338 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!339 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!340 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!341 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!342 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!343 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!344 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!345 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!346 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!347 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !349, line: 95, size: 32, align: 32, elements: !350)
!349 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!350 = !{!351, !352, !353}
!351 = !DIEnumerator(name: "G_ONCE_STATUS_NOTCALLED", value: 0)
!352 = !DIEnumerator(name: "G_ONCE_STATUS_PROGRESS", value: 1)
!353 = !DIEnumerator(name: "G_ONCE_STATUS_READY", value: 2)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 69, size: 32, align: 32, elements: !356)
!355 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!356 = !{!357, !358, !359, !360}
!357 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!358 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!359 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!360 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 77, size: 32, align: 32, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!364 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!365 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 31, size: 32, align: 32, elements: !368)
!367 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!368 = !{!369, !370, !371, !372, !373, !374}
!369 = !DIEnumerator(name: "G_IO_IN", value: 1)
!370 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!371 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!372 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!373 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!374 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 84, size: 32, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385}
!377 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!378 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!379 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!380 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!381 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!382 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!383 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!384 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!385 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!386 = !{!387, !388, !392, !450, !455, !459}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !390, line: 46, baseType: !391)
!390 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!391 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MsgState", file: !394, line: 58, baseType: !395)
!394 = !DIFile(filename: "i18n.c", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MsgState", file: !394, line: 55, size: 448, align: 64, elements: !396)
!396 = !{!397, !402}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !395, file: !394, line: 56, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTable", file: !400, line: 40, baseType: !401)
!400 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashTable", file: !400, line: 40, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !395, file: !394, line: 57, baseType: !403, size: 384, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !404, line: 140, baseType: !405)
!404 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 133, size: 384, align: 64, elements: !406)
!406 = !{!407, !420}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !405, file: !404, line: 135, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !349, line: 51, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !349, line: 58, size: 64, align: 64, elements: !411)
!411 = !{!412, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !410, file: !349, line: 61, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !390, line: 77, baseType: !387)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !410, file: !349, line: 62, baseType: !415, size: 64, align: 32)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 64, align: 32, elements: !418)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !390, line: 55, baseType: !417)
!417 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!418 = !{!419}
!419 = !DISubrange(count: 2)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !405, file: !404, line: 138, baseType: !421, size: 320, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !422, line: 128, baseType: !423)
!422 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !422, line: 90, size: 320, align: 64, elements: !424)
!424 = !{!425, !444, !448}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !423, file: !422, line: 125, baseType: !426, size: 320, align: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !422, line: 92, size: 320, align: 64, elements: !427)
!427 = !{!428, !430, !431, !432, !433, !434, !436, !437}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !426, file: !422, line: 94, baseType: !429, size: 32, align: 32)
!429 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !426, file: !422, line: 95, baseType: !417, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !426, file: !422, line: 96, baseType: !429, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !426, file: !422, line: 98, baseType: !417, size: 32, align: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !426, file: !422, line: 102, baseType: !429, size: 32, align: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !426, file: !422, line: 104, baseType: !435, size: 16, align: 16, offset: 160)
!435 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !426, file: !422, line: 105, baseType: !435, size: 16, align: 16, offset: 176)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !426, file: !422, line: 106, baseType: !438, size: 128, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !422, line: 79, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !422, line: 75, size: 128, align: 64, elements: !440)
!440 = !{!441, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !439, file: !422, line: 77, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !439, file: !422, line: 78, baseType: !442, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !423, file: !422, line: 126, baseType: !445, size: 320, align: 8)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 320, align: 8, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 40)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !423, file: !422, line: 127, baseType: !449, size: 64, align: 64)
!449 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "MsgCatalog", file: !394, line: 52, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MsgCatalog", file: !394, line: 47, size: 64, align: 64, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !452, file: !394, line: 48, baseType: !398, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTableFreeEntryFn", file: !400, line: 43, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !387}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!460 = !{!461, !462}
!461 = distinct !DIGlobalVariable(name: "gMsgState", scope: !0, file: !394, line: 61, type: !392, isLocal: true, isDefinition: true, variable: %struct.MsgState** @gMsgState)
!462 = distinct !DIGlobalVariable(name: "msgStateInit", scope: !463, file: !394, line: 155, type: !467, isLocal: true, isDefinition: true, variable: %struct._GOnce* @MsgGetState.msgStateInit)
!463 = distinct !DISubprogram(name: "MsgGetState", scope: !394, file: !394, line: 153, type: !464, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!392}
!466 = !{}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOnce", file: !349, line: 56, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOnce", file: !349, line: 103, size: 128, align: 64, elements: !469)
!469 = !{!470, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !468, file: !349, line: 105, baseType: !471, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOnceStatus", file: !349, line: 100, baseType: !348)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !468, file: !349, line: 106, baseType: !474, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!475 = !{i32 2, !"Dwarf Version", i32 4}
!476 = !{i32 2, !"Debug Info Version", i32 3}
!477 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!478 = distinct !DISubprogram(name: "VMToolsMsgCleanup", scope: !394, file: !394, line: 679, type: !479, isLocal: false, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!479 = !DISubroutineType(types: !480)
!480 = !{null}
!481 = !DILocation(line: 681, column: 8, scope: !482)
!482 = distinct !DILexicalBlock(scope: !478, file: !394, line: 681, column: 8)
!483 = !DILocation(line: 681, column: 18, scope: !482)
!484 = !DILocation(line: 681, column: 8, scope: !478)
!485 = !DILocation(line: 682, column: 11, scope: !486)
!486 = distinct !DILexicalBlock(scope: !487, file: !394, line: 682, column: 11)
!487 = distinct !DILexicalBlock(scope: !482, file: !394, line: 681, column: 26)
!488 = !DILocation(line: 682, column: 22, scope: !486)
!489 = !DILocation(line: 682, column: 30, scope: !486)
!490 = !DILocation(line: 682, column: 11, scope: !487)
!491 = !DILocation(line: 683, column: 25, scope: !492)
!492 = distinct !DILexicalBlock(scope: !486, file: !394, line: 682, column: 38)
!493 = !DILocation(line: 683, column: 36, scope: !492)
!494 = !DILocation(line: 683, column: 10, scope: !492)
!495 = !DILocation(line: 684, column: 7, scope: !492)
!496 = !DILocation(line: 685, column: 28, scope: !487)
!497 = !DILocation(line: 685, column: 39, scope: !487)
!498 = !DILocation(line: 685, column: 7, scope: !487)
!499 = !DILocation(line: 686, column: 14, scope: !487)
!500 = !DILocation(line: 686, column: 7, scope: !487)
!501 = !DILocation(line: 687, column: 4, scope: !487)
!502 = !DILocation(line: 688, column: 1, scope: !478)
!503 = distinct !DISubprogram(name: "VMTools_BindTextDomain", scope: !394, file: !394, line: 709, type: !504, isLocal: false, isDefinition: true, scopeLine: 712, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !506, !506, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!508 = !DILocalVariable(name: "domain", arg: 1, scope: !503, file: !394, line: 709, type: !506)
!509 = !DIExpression()
!510 = !DILocation(line: 709, column: 36, scope: !503)
!511 = !DILocalVariable(name: "lang", arg: 2, scope: !503, file: !394, line: 710, type: !506)
!512 = !DILocation(line: 710, column: 36, scope: !503)
!513 = !DILocalVariable(name: "catdir", arg: 3, scope: !503, file: !394, line: 711, type: !506)
!514 = !DILocation(line: 711, column: 36, scope: !503)
!515 = !DILocalVariable(name: "dfltdir", scope: !503, file: !394, line: 713, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!517 = !DILocation(line: 713, column: 10, scope: !503)
!518 = !DILocalVariable(name: "file", scope: !503, file: !394, line: 714, type: !388)
!519 = !DILocation(line: 714, column: 11, scope: !503)
!520 = !DILocalVariable(name: "usrlang", scope: !503, file: !394, line: 715, type: !388)
!521 = !DILocation(line: 715, column: 11, scope: !503)
!522 = !DILocalVariable(name: "state", scope: !503, file: !394, line: 716, type: !392)
!523 = !DILocation(line: 716, column: 14, scope: !503)
!524 = !DILocation(line: 716, column: 22, scope: !503)
!525 = !DILocalVariable(name: "catalog", scope: !503, file: !394, line: 717, type: !450)
!526 = !DILocation(line: 717, column: 16, scope: !503)
!527 = !DILocation(line: 726, column: 8, scope: !528)
!528 = distinct !DILexicalBlock(scope: !503, file: !394, line: 726, column: 8)
!529 = !DILocation(line: 726, column: 13, scope: !528)
!530 = !DILocation(line: 726, column: 20, scope: !528)
!531 = !DILocation(line: 726, column: 24, scope: !532)
!532 = !DILexicalBlockFile(scope: !528, file: !394, discriminator: 1)
!533 = !DILocation(line: 726, column: 23, scope: !532)
!534 = !DILocation(line: 726, column: 29, scope: !532)
!535 = !DILocation(line: 726, column: 8, scope: !532)
!536 = !DILocation(line: 727, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !528, file: !394, line: 726, column: 38)
!538 = !DILocation(line: 727, column: 15, scope: !537)
!539 = !DILocation(line: 728, column: 14, scope: !537)
!540 = !DILocation(line: 728, column: 12, scope: !537)
!541 = !DILocation(line: 729, column: 4, scope: !537)
!542 = !DILocation(line: 731, column: 82, scope: !503)
!543 = !DILocation(line: 731, column: 4, scope: !503)
!544 = !DILocation(line: 737, column: 8, scope: !545)
!545 = distinct !DILexicalBlock(scope: !503, file: !394, line: 737, column: 8)
!546 = !DILocation(line: 737, column: 15, scope: !545)
!547 = !DILocation(line: 737, column: 8, scope: !503)
!548 = !DILocation(line: 739, column: 17, scope: !549)
!549 = distinct !DILexicalBlock(scope: !545, file: !394, line: 737, column: 23)
!550 = !DILocation(line: 739, column: 15, scope: !549)
!551 = !DILocation(line: 743, column: 17, scope: !549)
!552 = !DILocation(line: 743, column: 16, scope: !549)
!553 = !DILocation(line: 743, column: 28, scope: !554)
!554 = !DILexicalBlockFile(scope: !549, file: !394, discriminator: 1)
!555 = !DILocation(line: 743, column: 16, scope: !554)
!556 = !DILocation(line: 743, column: 16, scope: !557)
!557 = !DILexicalBlockFile(scope: !549, file: !394, discriminator: 2)
!558 = !DILocation(line: 743, column: 16, scope: !559)
!559 = !DILexicalBlockFile(scope: !549, file: !394, discriminator: 3)
!560 = !DILocation(line: 743, column: 14, scope: !559)
!561 = !DILocation(line: 744, column: 4, scope: !549)
!562 = !DILocation(line: 747, column: 27, scope: !503)
!563 = !DILocation(line: 747, column: 45, scope: !503)
!564 = !DILocation(line: 747, column: 56, scope: !503)
!565 = !DILocation(line: 746, column: 11, scope: !503)
!566 = !DILocation(line: 746, column: 9, scope: !503)
!567 = !DILocation(line: 749, column: 21, scope: !568)
!568 = distinct !DILexicalBlock(scope: !503, file: !394, line: 749, column: 8)
!569 = !DILocation(line: 749, column: 9, scope: !568)
!570 = !DILocation(line: 749, column: 8, scope: !503)
!571 = !DILocalVariable(name: "sep", scope: !572, file: !394, line: 754, type: !516)
!572 = distinct !DILexicalBlock(scope: !568, file: !394, line: 749, column: 28)
!573 = !DILocation(line: 754, column: 13, scope: !572)
!574 = !DILocation(line: 754, column: 27, scope: !572)
!575 = !DILocation(line: 754, column: 19, scope: !572)
!576 = !DILocation(line: 755, column: 11, scope: !577)
!577 = distinct !DILexicalBlock(scope: !572, file: !394, line: 755, column: 11)
!578 = !DILocation(line: 755, column: 15, scope: !577)
!579 = !DILocation(line: 755, column: 11, scope: !572)
!580 = !DILocation(line: 756, column: 14, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !394, line: 756, column: 14)
!582 = distinct !DILexicalBlock(scope: !577, file: !394, line: 755, column: 23)
!583 = !DILocation(line: 756, column: 22, scope: !581)
!584 = !DILocation(line: 756, column: 14, scope: !582)
!585 = !DILocation(line: 757, column: 40, scope: !586)
!586 = distinct !DILexicalBlock(scope: !581, file: !394, line: 756, column: 30)
!587 = !DILocation(line: 757, column: 23, scope: !586)
!588 = !DILocation(line: 757, column: 21, scope: !586)
!589 = !DILocation(line: 758, column: 10, scope: !586)
!590 = !DILocation(line: 759, column: 18, scope: !582)
!591 = !DILocation(line: 759, column: 24, scope: !582)
!592 = !DILocation(line: 759, column: 22, scope: !582)
!593 = !DILocation(line: 759, column: 10, scope: !582)
!594 = !DILocation(line: 759, column: 30, scope: !582)
!595 = !DILocation(line: 760, column: 17, scope: !582)
!596 = !DILocation(line: 760, column: 10, scope: !582)
!597 = !DILocation(line: 762, column: 33, scope: !582)
!598 = !DILocation(line: 762, column: 51, scope: !582)
!599 = !DILocation(line: 762, column: 65, scope: !582)
!600 = !DILocation(line: 761, column: 17, scope: !582)
!601 = !DILocation(line: 761, column: 15, scope: !582)
!602 = !DILocation(line: 763, column: 7, scope: !582)
!603 = !DILocation(line: 764, column: 4, scope: !572)
!604 = !DILocation(line: 766, column: 29, scope: !503)
!605 = !DILocation(line: 766, column: 14, scope: !503)
!606 = !DILocation(line: 766, column: 12, scope: !503)
!607 = !DILocation(line: 768, column: 8, scope: !608)
!608 = distinct !DILexicalBlock(scope: !503, file: !394, line: 768, column: 8)
!609 = !DILocation(line: 768, column: 16, scope: !608)
!610 = !DILocation(line: 768, column: 8, scope: !503)
!611 = !DILocation(line: 769, column: 19, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !394, line: 769, column: 11)
!613 = distinct !DILexicalBlock(scope: !608, file: !394, line: 768, column: 24)
!614 = !DILocation(line: 769, column: 11, scope: !612)
!615 = !DILocation(line: 769, column: 11, scope: !613)
!616 = !DILocation(line: 774, column: 138, scope: !617)
!617 = distinct !DILexicalBlock(scope: !612, file: !394, line: 769, column: 35)
!618 = !DILocation(line: 774, column: 146, scope: !617)
!619 = !DILocation(line: 774, column: 152, scope: !617)
!620 = !DILocation(line: 774, column: 10, scope: !617)
!621 = !DILocation(line: 776, column: 7, scope: !617)
!622 = !DILocation(line: 777, column: 4, scope: !613)
!623 = !DILocation(line: 778, column: 53, scope: !624)
!624 = distinct !DILexicalBlock(scope: !608, file: !394, line: 777, column: 11)
!625 = !DILocation(line: 778, column: 60, scope: !624)
!626 = !DILocation(line: 778, column: 21, scope: !624)
!627 = !DILocation(line: 778, column: 7, scope: !628)
!628 = !DILexicalBlockFile(scope: !624, file: !394, discriminator: 1)
!629 = !DILocation(line: 779, column: 21, scope: !624)
!630 = !DILocation(line: 779, column: 29, scope: !624)
!631 = !DILocation(line: 779, column: 7, scope: !624)
!632 = !DILocation(line: 780, column: 55, scope: !624)
!633 = !DILocation(line: 780, column: 62, scope: !624)
!634 = !DILocation(line: 780, column: 23, scope: !624)
!635 = !DILocation(line: 780, column: 7, scope: !628)
!636 = !DILocation(line: 782, column: 11, scope: !503)
!637 = !DILocation(line: 782, column: 4, scope: !503)
!638 = !DILocation(line: 783, column: 9, scope: !503)
!639 = !DILocation(line: 783, column: 4, scope: !503)
!640 = !DILocation(line: 784, column: 11, scope: !503)
!641 = !DILocation(line: 784, column: 4, scope: !503)
!642 = !DILocation(line: 785, column: 1, scope: !503)
!643 = !DILocation(line: 156, column: 23, scope: !463)
!644 = !DILocation(line: 156, column: 30, scope: !463)
!645 = !DILocation(line: 156, column: 5, scope: !463)
!646 = !DILocation(line: 156, column: 73, scope: !647)
!647 = !DILexicalBlockFile(scope: !463, file: !394, discriminator: 1)
!648 = !DILocation(line: 156, column: 5, scope: !647)
!649 = !DILocation(line: 156, column: 82, scope: !650)
!650 = !DILexicalBlockFile(scope: !463, file: !394, discriminator: 2)
!651 = !DILocation(line: 156, column: 5, scope: !650)
!652 = !DILocation(line: 156, column: 5, scope: !653)
!653 = !DILexicalBlockFile(scope: !463, file: !394, discriminator: 3)
!654 = !DILocation(line: 157, column: 11, scope: !463)
!655 = !DILocation(line: 157, column: 4, scope: !463)
!656 = distinct !DISubprogram(name: "MsgGetUserLanguage", scope: !394, file: !394, line: 209, type: !657, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!657 = !DISubroutineType(types: !658)
!658 = !{!388}
!659 = !DILocalVariable(name: "lang", scope: !656, file: !394, line: 211, type: !388)
!660 = !DILocation(line: 211, column: 11, scope: !656)
!661 = !DILocalVariable(name: "tmp", scope: !656, file: !394, line: 235, type: !516)
!662 = !DILocation(line: 235, column: 10, scope: !656)
!663 = !DILocation(line: 235, column: 16, scope: !656)
!664 = !DILocation(line: 236, column: 8, scope: !665)
!665 = distinct !DILexicalBlock(scope: !656, file: !394, line: 236, column: 8)
!666 = !DILocation(line: 236, column: 12, scope: !665)
!667 = !DILocation(line: 236, column: 8, scope: !656)
!668 = !DILocation(line: 237, column: 14, scope: !669)
!669 = distinct !DILexicalBlock(scope: !665, file: !394, line: 236, column: 20)
!670 = !DILocation(line: 237, column: 12, scope: !669)
!671 = !DILocation(line: 238, column: 4, scope: !669)
!672 = !DILocalVariable(name: "dot", scope: !673, file: !394, line: 239, type: !516)
!673 = distinct !DILexicalBlock(scope: !665, file: !394, line: 238, column: 11)
!674 = !DILocation(line: 239, column: 13, scope: !673)
!675 = !DILocation(line: 241, column: 23, scope: !673)
!676 = !DILocation(line: 241, column: 14, scope: !673)
!677 = !DILocation(line: 241, column: 12, scope: !673)
!678 = !DILocation(line: 242, column: 20, scope: !673)
!679 = !DILocation(line: 242, column: 13, scope: !673)
!680 = !DILocation(line: 242, column: 11, scope: !673)
!681 = !DILocation(line: 243, column: 11, scope: !682)
!682 = distinct !DILexicalBlock(scope: !673, file: !394, line: 243, column: 11)
!683 = !DILocation(line: 243, column: 15, scope: !682)
!684 = !DILocation(line: 243, column: 11, scope: !673)
!685 = !DILocation(line: 244, column: 11, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !394, line: 243, column: 23)
!687 = !DILocation(line: 244, column: 15, scope: !686)
!688 = !DILocation(line: 245, column: 7, scope: !686)
!689 = !DILocation(line: 249, column: 11, scope: !656)
!690 = !DILocation(line: 249, column: 4, scope: !656)
!691 = distinct !DISubprogram(name: "MsgLoadCatalog", scope: !394, file: !394, line: 514, type: !692, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!692 = !DISubroutineType(types: !693)
!693 = !{!450, !506}
!694 = !DILocalVariable(name: "path", arg: 1, scope: !691, file: !394, line: 514, type: !506)
!695 = !DILocation(line: 514, column: 28, scope: !691)
!696 = !DILocalVariable(name: "localPath", scope: !691, file: !394, line: 516, type: !388)
!697 = !DILocation(line: 516, column: 11, scope: !691)
!698 = !DILocalVariable(name: "err", scope: !691, file: !394, line: 517, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !701, line: 42, baseType: !702)
!701 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !701, line: 44, size: 128, align: 64, elements: !703)
!703 = !{!704, !709, !711}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !702, file: !701, line: 46, baseType: !705, size: 32, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !706, line: 36, baseType: !707)
!706 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !708, line: 45, baseType: !417)
!708 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !702, file: !701, line: 47, baseType: !710, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !390, line: 49, baseType: !429)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !702, file: !701, line: 48, baseType: !388, size: 64, align: 64, offset: 64)
!712 = !DILocation(line: 517, column: 12, scope: !691)
!713 = !DILocalVariable(name: "stream", scope: !691, file: !394, line: 518, type: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !355, line: 41, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !355, line: 97, size: 896, align: 64, elements: !717)
!717 = !{!718, !719, !843, !844, !849, !850, !851, !852, !853, !862, !863, !864, !868, !869, !870, !871, !872, !873, !874, !875}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !716, file: !355, line: 100, baseType: !710, size: 32, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !716, file: !355, line: 101, baseType: !720, size: 64, align: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !355, line: 42, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !355, line: 131, size: 512, align: 64, elements: !723)
!723 = !{!724, !733, !739, !745, !749, !830, !834, !839}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !722, file: !355, line: 133, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!728, !714, !388, !729, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !355, line: 75, baseType: !354)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !708, line: 66, baseType: !730)
!730 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !722, file: !355, line: 138, baseType: !734, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!728, !714, !737, !729, !731, !732}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !722, file: !355, line: 143, baseType: !740, size: 64, align: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!728, !714, !743, !744, !732}
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !708, line: 51, baseType: !449)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !355, line: 82, baseType: !361)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !722, file: !355, line: 147, baseType: !746, size: 64, align: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!728, !714, !732}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !722, file: !355, line: 149, baseType: !750, size: 64, align: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!753, !714, !829}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !367, line: 64, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !367, line: 171, size: 768, align: 64, elements: !756)
!756 = !{!757, !758, !779, !806, !807, !811, !812, !813, !814, !822, !823, !824, !825}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !755, file: !367, line: 174, baseType: !413, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !755, file: !367, line: 175, baseType: !759, size: 64, align: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !367, line: 77, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !367, line: 196, size: 192, align: 64, elements: !762)
!762 = !{!763, !767, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !761, file: !367, line: 198, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64, align: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !413}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !761, file: !367, line: 199, baseType: !764, size: 64, align: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !761, file: !367, line: 200, baseType: !769, size: 64, align: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !413, !753, !772, !778}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !367, line: 155, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!777, !413}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !390, line: 50, baseType: !710)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !755, file: !367, line: 177, baseType: !780, size: 64, align: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !367, line: 130, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !367, line: 214, size: 384, align: 64, elements: !784)
!784 = !{!785, !790, !794, !798, !802, !803}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !783, file: !367, line: 216, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!777, !753, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !783, file: !367, line: 218, baseType: !791, size: 64, align: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!777, !753}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !783, file: !367, line: 219, baseType: !795, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!777, !753, !773, !413}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !783, file: !367, line: 222, baseType: !799, size: 64, align: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !753}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !783, file: !367, line: 226, baseType: !773, size: 64, align: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !783, file: !367, line: 227, baseType: !804, size: 64, align: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !367, line: 212, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !755, file: !367, line: 178, baseType: !416, size: 32, align: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !755, file: !367, line: 180, baseType: !808, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !367, line: 48, baseType: !810)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !367, line: 48, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !755, file: !367, line: 182, baseType: !710, size: 32, align: 32, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !367, line: 183, baseType: !416, size: 32, align: 32, offset: 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !755, file: !367, line: 184, baseType: !416, size: 32, align: 32, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !755, file: !367, line: 186, baseType: !815, size: 64, align: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !817, line: 37, baseType: !818)
!817 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !817, line: 39, size: 128, align: 64, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !818, file: !817, line: 41, baseType: !413, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !817, line: 42, baseType: !815, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !755, file: !367, line: 188, baseType: !753, size: 64, align: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !755, file: !367, line: 189, baseType: !753, size: 64, align: 64, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !367, line: 191, baseType: !516, size: 64, align: 64, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !755, file: !367, line: 193, baseType: !826, size: 64, align: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !367, line: 65, baseType: !828)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !367, line: 65, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !367, line: 39, baseType: !366)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !722, file: !355, line: 151, baseType: !831, size: 64, align: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !714}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !722, file: !355, line: 152, baseType: !835, size: 64, align: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!728, !714, !838, !732}
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !355, line: 95, baseType: !375)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !722, file: !355, line: 155, baseType: !840, size: 64, align: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64, align: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!838, !714}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !716, file: !355, line: 103, baseType: !388, size: 64, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !716, file: !355, line: 104, baseType: !845, size: 64, align: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !846, line: 77, baseType: !847)
!846 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !846, line: 77, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !716, file: !355, line: 105, baseType: !845, size: 64, align: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !716, file: !355, line: 106, baseType: !388, size: 64, align: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !716, file: !355, line: 107, baseType: !416, size: 32, align: 32, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !716, file: !355, line: 109, baseType: !729, size: 64, align: 64, offset: 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !716, file: !355, line: 110, baseType: !854, size: 64, align: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !856, line: 39, baseType: !857)
!856 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/open-vm-tools/line1127")
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !856, line: 41, size: 192, align: 64, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !857, file: !856, line: 43, baseType: !388, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !857, file: !856, line: 44, baseType: !729, size: 64, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !857, file: !856, line: 45, baseType: !729, size: 64, align: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !716, file: !355, line: 111, baseType: !854, size: 64, align: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !716, file: !355, line: 112, baseType: !854, size: 64, align: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !716, file: !355, line: 113, baseType: !865, size: 48, align: 8, offset: 704)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 48, align: 8, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 6)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !716, file: !355, line: 117, baseType: !416, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !716, file: !355, line: 118, baseType: !416, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !716, file: !355, line: 119, baseType: !416, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !716, file: !355, line: 120, baseType: !416, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !716, file: !355, line: 121, baseType: !416, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !716, file: !355, line: 122, baseType: !416, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !716, file: !355, line: 124, baseType: !413, size: 64, align: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !716, file: !355, line: 125, baseType: !413, size: 64, align: 64, offset: 832)
!876 = !DILocation(line: 518, column: 16, scope: !691)
!877 = !DILocalVariable(name: "error", scope: !691, file: !394, line: 519, type: !777)
!878 = !DILocation(line: 519, column: 13, scope: !691)
!879 = !DILocalVariable(name: "catalog", scope: !691, file: !394, line: 520, type: !450)
!880 = !DILocation(line: 520, column: 16, scope: !691)
!881 = !DILocalVariable(name: "dict", scope: !691, file: !394, line: 521, type: !398)
!882 = !DILocation(line: 521, column: 15, scope: !691)
!883 = !DILocation(line: 524, column: 38, scope: !691)
!884 = !DILocation(line: 524, column: 16, scope: !691)
!885 = !DILocation(line: 524, column: 14, scope: !691)
!886 = !DILocation(line: 527, column: 35, scope: !691)
!887 = !DILocation(line: 527, column: 13, scope: !691)
!888 = !DILocation(line: 527, column: 11, scope: !691)
!889 = !DILocation(line: 528, column: 11, scope: !691)
!890 = !DILocation(line: 528, column: 4, scope: !691)
!891 = !DILocation(line: 530, column: 8, scope: !892)
!892 = distinct !DILexicalBlock(scope: !691, file: !394, line: 530, column: 8)
!893 = !DILocation(line: 530, column: 12, scope: !892)
!894 = !DILocation(line: 530, column: 8, scope: !691)
!895 = !DILocation(line: 531, column: 76, scope: !896)
!896 = distinct !DILexicalBlock(scope: !892, file: !394, line: 530, column: 20)
!897 = !DILocation(line: 531, column: 82, scope: !896)
!898 = !DILocation(line: 531, column: 87, scope: !896)
!899 = !DILocation(line: 531, column: 7, scope: !896)
!900 = !DILocation(line: 532, column: 7, scope: !896)
!901 = !DILocation(line: 533, column: 7, scope: !896)
!902 = !DILocation(line: 536, column: 11, scope: !691)
!903 = !DILocation(line: 536, column: 9, scope: !691)
!904 = !DILocation(line: 537, column: 30, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !394, line: 537, column: 10)
!906 = distinct !DILexicalBlock(scope: !691, file: !394, line: 537, column: 5)
!907 = !DILocation(line: 537, column: 28, scope: !905)
!908 = !DILocation(line: 537, column: 27, scope: !905)
!909 = !DILocation(line: 537, column: 10, scope: !905)
!910 = !DILocation(line: 537, column: 10, scope: !906)
!911 = !DILocation(line: 537, column: 44, scope: !912)
!912 = !DILexicalBlockFile(scope: !913, file: !394, discriminator: 1)
!913 = distinct !DILexicalBlock(scope: !905, file: !394, line: 537, column: 42)
!914 = !DILocation(line: 539, column: 4, scope: !691)
!915 = !DILocalVariable(name: "eof", scope: !916, file: !394, line: 540, type: !777)
!916 = distinct !DILexicalBlock(scope: !917, file: !394, line: 539, column: 13)
!917 = distinct !DILexicalBlock(scope: !918, file: !394, line: 539, column: 4)
!918 = distinct !DILexicalBlock(scope: !691, file: !394, line: 539, column: 4)
!919 = !DILocation(line: 540, column: 16, scope: !916)
!920 = !DILocalVariable(name: "name", scope: !916, file: !394, line: 541, type: !516)
!921 = !DILocation(line: 541, column: 13, scope: !916)
!922 = !DILocalVariable(name: "value", scope: !916, file: !394, line: 542, type: !516)
!923 = !DILocation(line: 542, column: 13, scope: !916)
!924 = !DILocalVariable(name: "line", scope: !916, file: !394, line: 543, type: !388)
!925 = !DILocation(line: 543, column: 14, scope: !916)
!926 = !DILocation(line: 546, column: 7, scope: !916)
!927 = !DILocalVariable(name: "i", scope: !928, file: !394, line: 547, type: !729)
!928 = distinct !DILexicalBlock(scope: !929, file: !394, line: 546, column: 16)
!929 = distinct !DILexicalBlock(scope: !930, file: !394, line: 546, column: 7)
!930 = distinct !DILexicalBlock(scope: !916, file: !394, line: 546, column: 7)
!931 = !DILocation(line: 547, column: 16, scope: !928)
!932 = !DILocalVariable(name: "len", scope: !928, file: !394, line: 548, type: !729)
!933 = !DILocation(line: 548, column: 16, scope: !928)
!934 = !DILocalVariable(name: "term", scope: !928, file: !394, line: 549, type: !729)
