; ModuleID = './panic.o.i'
source_filename = "./panic.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.PanicState = type { i8, i8, i8, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [16 x i8] c"coreDumpOnPanic\00", align 1
@panicState = internal global %struct.PanicState { i8 1, i8 1, i8 0, i32 0, i32 0, i8* null }, align 8
@.str.1 = private unnamed_addr constant [18 x i8] c"panic.loopOnPanic\00", align 1
@.str.2 = private unnamed_addr constant [19 x i8] c"panic.breakOnPanic\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"coreDumpFlags\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [16 x i8] c"Looping pid=%d\0A\00", align 1
@.str.5 = private unnamed_addr constant [31 x i8] c"Panic: breaking into debugger\0A\00", align 1
@Panic_Panic.count = internal global i32 0, align 4
@.str.6 = private unnamed_addr constant [10 x i8] c"PANIC: %s\00", align 1
@.str.7 = private unnamed_addr constant [12 x i8] c"Panic loop\0A\00", align 1
@.str.8 = private unnamed_addr constant [9 x i8] c"Exiting\0A\00", align 1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9, globals: !16)
!1 = !DIFile(filename: "panic.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line778")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 66, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/panic.h", directory: "/home/lichi/Desktop/open-vm-tools/line778")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PanicBreakAction_Never", value: 0)
!7 = !DIEnumerator(name: "PanicBreakAction_IfDebuggerAttached", value: 1)
!8 = !DIEnumerator(name: "PanicBreakAction_Always", value: 2)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !12, line: 85, baseType: !13)
!12 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/open-vm-tools/line778")
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DISubroutineType(types: !15)
!15 = !{null, !10}
!16 = !{!17, !35}
!17 = distinct !DIGlobalVariable(name: "count", scope: !18, file: !19, line: 530, type: !10, isLocal: true, isDefinition: true, variable: i32* @Panic_Panic.count)
!18 = distinct !DISubprogram(name: "Panic_Panic", scope: !19, file: !19, line: 526, type: !20, isLocal: false, isDefinition: true, scopeLine: 528, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!19 = !DIFile(filename: "panic.c", directory: "/home/lichi/Desktop/open-vm-tools/line778")
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 501, size: 192, align: 64, elements: !27)
!27 = !{!28, !30, !31, !33}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !26, file: !1, line: 501, baseType: !29, size: 32, align: 32)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !26, file: !1, line: 501, baseType: !29, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !26, file: !1, line: 501, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !26, file: !1, line: 501, baseType: !32, size: 64, align: 64, offset: 128)
!34 = !{}
!35 = distinct !DIGlobalVariable(name: "panicState", scope: !0, file: !19, line: 64, type: !36, isLocal: true, isDefinition: true, variable: %struct.PanicState* @panicState)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PanicState", file: !19, line: 57, size: 192, align: 64, elements: !37)
!37 = !{!38, !41, !42, !43, !44, !46}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "msgPostOnPanic", scope: !36, file: !19, line: 58, baseType: !39, size: 8, align: 8)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !40, line: 230, baseType: !24)
!40 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line778")
!41 = !DIDerivedType(tag: DW_TAG_member, name: "coreDumpOnPanic", scope: !36, file: !19, line: 59, baseType: !39, size: 8, align: 8, offset: 8)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "loopOnPanic", scope: !36, file: !19, line: 60, baseType: !39, size: 8, align: 8, offset: 16)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "coreDumpFlags", scope: !36, file: !19, line: 61, baseType: !10, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "breakOnPanic", scope: !36, file: !19, line: 62, baseType: !45, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PanicBreakAction", file: !4, line: 70, baseType: !3)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "coreDumpFile", scope: !36, file: !19, line: 63, baseType: !47, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!48 = !{i32 2, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!51 = distinct !DISubprogram(name: "Panic_Init", scope: !19, file: !19, line: 84, type: !52, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !DILocation(line: 86, column: 33, scope: !51)
!55 = !DILocation(line: 86, column: 31, scope: !51)
!56 = !DILocation(line: 87, column: 29, scope: !51)
!57 = !DILocation(line: 87, column: 27, scope: !51)
!58 = !DILocation(line: 88, column: 30, scope: !51)
!59 = !DILocation(line: 88, column: 28, scope: !51)
!60 = !DILocation(line: 90, column: 31, scope: !51)
!61 = !DILocation(line: 90, column: 29, scope: !51)
!62 = !DILocation(line: 91, column: 1, scope: !51)
!63 = distinct !DISubprogram(name: "Panic_SetPanicMsgPost", scope: !19, file: !19, line: 113, type: !64, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !39}
!66 = !DILocalVariable(name: "postMsg", arg: 1, scope: !63, file: !19, line: 113, type: !39)
!67 = !DIExpression()
!68 = !DILocation(line: 113, column: 28, scope: !63)
!69 = !DILocation(line: 115, column: 32, scope: !63)
!70 = !DILocation(line: 115, column: 30, scope: !63)
!71 = !DILocation(line: 116, column: 1, scope: !63)
!72 = distinct !DISubprogram(name: "Panic_GetPanicMsgPost", scope: !19, file: !19, line: 134, type: !73, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!73 = !DISubroutineType(types: !74)
!74 = !{!39}
!75 = !DILocation(line: 136, column: 22, scope: !72)
!76 = !DILocation(line: 136, column: 4, scope: !72)
!77 = distinct !DISubprogram(name: "Panic_SetCoreDumpOnPanic", scope: !19, file: !19, line: 165, type: !64, isLocal: false, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!78 = !DILocalVariable(name: "dumpCore", arg: 1, scope: !77, file: !19, line: 165, type: !39)
!79 = !DILocation(line: 165, column: 31, scope: !77)
!80 = !DILocation(line: 167, column: 33, scope: !77)
!81 = !DILocation(line: 167, column: 31, scope: !77)
!82 = !DILocation(line: 168, column: 1, scope: !77)
!83 = distinct !DISubprogram(name: "Panic_GetCoreDumpOnPanic", scope: !19, file: !19, line: 188, type: !73, isLocal: false, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!84 = !DILocation(line: 190, column: 22, scope: !83)
!85 = !DILocation(line: 190, column: 4, scope: !83)
!86 = distinct !DISubprogram(name: "Panic_GetCoreDumpFlags", scope: !19, file: !19, line: 214, type: !87, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!87 = !DISubroutineType(types: !88)
!88 = !{!10}
!89 = !DILocation(line: 216, column: 22, scope: !86)
!90 = !DILocation(line: 216, column: 4, scope: !86)
!91 = distinct !DISubprogram(name: "Panic_SetCoreDumpFlags", scope: !19, file: !19, line: 239, type: !14, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !34)
!92 = !DILocalVariable(name: "flags", arg: 1, scope: !91, file: !19, line: 239, type: !10)
!93 = !DILocation(line: 239, column: 28, scope: !91)
!94 = !DILocation(line: 241, column: 31, scope: !91)
!95 = !DILocation(line: 241, column: 29, scope: !91)
!96 = !DILocation(line: 242, column: 1, scope: !91)
