; ModuleID = './libtimeSync_la-timeSync.o.i'
source_filename = "./libtimeSync_la-timeSync.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.TimeSyncData = type { i32, i32, i32, i32, i32, i32, %struct._GSource*, i32, i32, %struct._GSource*, %struct.ToolsAppCtx* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%union.Backdoor_proto = type { %struct.anon }

!1 = !DIFile(filename: "libtimeSync_la-timeSync.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!2 = !{!3, !9, !14, !18, !24, !36}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimeSyncState", file: !4, line: 153, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "timeSync.c", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "TIMESYNC_INITIALIZING", value: 0)
!7 = !DIEnumerator(name: "TIMESYNC_STOPPED", value: 1)
!8 = !DIEnumerator(name: "TIMESYNC_RUNNING", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimeSyncSlewState", file: !4, line: 159, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "TimeSyncUncalibrated", value: 0)
!12 = !DIEnumerator(name: "TimeSyncCalibrating", value: 1)
!13 = !DIEnumerator(name: "TimeSyncPLL", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 232, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!16 = !{!17}
!17 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 339, size: 32, align: 32, elements: !19)
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!21 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!22 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!23 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 51, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!28 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!29 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!30 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!31 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!32 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!33 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!34 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!35 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TimeSyncType", file: !4, line: 165, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "TIMESYNC_STEP", value: 0)
!39 = !DIEnumerator(name: "TIMESYNC_PERIODIC", value: 1)
!40 = !DIEnumerator(name: "TIMESYNC_STEP_NORESYNC", value: 2)
!41 = !{!42, !43, !53}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !44, line: 155, baseType: !45)
!44 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !52}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !49, line: 50, baseType: !50)
!49 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !49, line: 49, baseType: !51)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !49, line: 77, baseType: !42)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !54, line: 171, baseType: !55)
!54 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !56, line: 55, baseType: !57)
!56 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !{!59, !65, !66, !126, !226, !227, !231}
!59 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !4, line: 128, type: !60, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, align: 8, elements: !63)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !{!64}
!64 = !DISubrange(count: 20)
!65 = distinct !DIGlobalVariable(name: "gTimeSyncToolsStartupAllowBackward", scope: !0, file: !4, line: 193, type: !48, isLocal: false, isDefinition: true, variable: i32* @gTimeSyncToolsStartupAllowBackward)
!66 = distinct !DIGlobalVariable(name: "regData", scope: !67, file: !4, line: 1036, type: !71, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!67 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !4, file: !4, line: 1034, type: !68, isLocal: false, isDefinition: true, scopeLine: 1035, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !92}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !15, line: 545, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !15, line: 501, size: 256, align: 64, elements: !73)
!73 = !{!74, !76, !88, !124}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !15, line: 503, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !72, file: !15, line: 508, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !79, line: 37, baseType: !80)
!79 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !79, line: 41, size: 128, align: 64, elements: !81)
!81 = !{!82, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !79, line: 43, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !49, line: 46, baseType: !62)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !80, file: !79, line: 44, baseType: !86, size: 32, align: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !49, line: 55, baseType: !87)
!87 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !72, file: !15, line: 539, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!48, !92, !122, !52, !123}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !15, line: 274, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !15, line: 241, size: 576, align: 64, elements: !95)
!95 = !{!96, !98, !101, !102, !103, !107, !112, !117, !118, !119, !121}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !15, line: 243, baseType: !97, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !15, line: 234, baseType: !14)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !15, line: 245, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !94, file: !15, line: 247, baseType: !48, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !94, file: !15, line: 249, baseType: !51, size: 32, align: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !94, file: !15, line: 251, baseType: !104, size: 64, align: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !44, line: 56, baseType: !106)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !44, line: 56, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !94, file: !15, line: 253, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !110, line: 48, baseType: !111)
!110 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !110, line: 48, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !94, file: !15, line: 255, baseType: !113, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !115, line: 48, baseType: !116)
!115 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !115, line: 48, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !94, file: !15, line: 261, baseType: !51, size: 32, align: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !94, file: !15, line: 263, baseType: !51, size: 32, align: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !94, file: !15, line: 265, baseType: !120, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !94, file: !15, line: 273, baseType: !52, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !15, line: 360, baseType: !18)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !72, file: !15, line: 544, baseType: !52, size: 64, align: 64, offset: 192)
!125 = !{}
!126 = distinct !DIGlobalVariable(name: "calibrationStart", scope: !127, file: !4, line: 457, type: !223, isLocal: true, isDefinition: true, variable: i64* @TimeSyncSlewTime.calibrationStart)
!127 = distinct !DISubprogram(name: "TimeSyncSlewTime", scope: !4, file: !4, line: 455, type: !128, isLocal: true, isDefinition: true, scopeLine: 456, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!128 = !DISubroutineType(types: !129)
!129 = !{!48, !130, !223}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeSyncData", file: !4, line: 183, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TimeSyncData", file: !4, line: 171, size: 448, align: 64, elements: !133)
!133 = !{!134, !135, !136, !139, !140, !142, !144, !219, !220, !221, !222}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "slewActive", scope: !132, file: !4, line: 172, baseType: !48, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "slewCorrection", scope: !132, file: !4, line: 173, baseType: !48, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "slewPercentCorrection", scope: !132, file: !4, line: 174, baseType: !137, size: 32, align: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !54, line: 173, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !56, line: 51, baseType: !87)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "timeSyncPeriod", scope: !132, file: !4, line: 175, baseType: !137, size: 32, align: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !132, file: !4, line: 176, baseType: !141, size: 32, align: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeSyncState", file: !4, line: 157, baseType: !3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "slewState", scope: !132, file: !4, line: 177, baseType: !143, size: 32, align: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeSyncSlewState", file: !4, line: 163, baseType: !9)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !132, file: !4, line: 178, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !44, line: 64, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !44, line: 171, size: 768, align: 64, elements: !148)
!148 = !{!149, !150, !166, !195, !196, !200, !201, !202, !203, !211, !212, !213, !215}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !147, file: !44, line: 174, baseType: !52, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !147, file: !44, line: 175, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !44, line: 77, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !44, line: 196, size: 192, align: 64, elements: !154)
!154 = !{!155, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !153, file: !44, line: 198, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !52}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !153, file: !44, line: 199, baseType: !156, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !153, file: !44, line: 200, baseType: !161, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !52, !145, !164, !165}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !147, file: !44, line: 177, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !44, line: 130, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !44, line: 214, size: 384, align: 64, elements: !171)
!171 = !{!172, !177, !181, !185, !189, !190}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !170, file: !44, line: 216, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!48, !145, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !170, file: !44, line: 218, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!48, !145}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !170, file: !44, line: 219, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!48, !145, !43, !52}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !170, file: !44, line: 222, baseType: !186, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !145}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !170, file: !44, line: 226, baseType: !43, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !170, file: !44, line: 227, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !44, line: 212, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !147, file: !44, line: 178, baseType: !86, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !147, file: !44, line: 180, baseType: !197, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !44, line: 48, baseType: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !44, line: 48, flags: DIFlagFwdDecl)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !147, file: !44, line: 182, baseType: !50, size: 32, align: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !44, line: 183, baseType: !86, size: 32, align: 32, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !147, file: !44, line: 184, baseType: !86, size: 32, align: 32, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !147, file: !44, line: 186, baseType: !204, size: 64, align: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !206, line: 37, baseType: !207)
!206 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !206, line: 39, size: 128, align: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !206, line: 41, baseType: !52, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !206, line: 42, baseType: !204, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !44, line: 188, baseType: !145, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !44, line: 189, baseType: !145, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !44, line: 191, baseType: !214, size: 64, align: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !147, file: !44, line: 193, baseType: !216, size: 64, align: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !44, line: 65, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !44, line: 65, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "guestResync", scope: !132, file: !4, line: 179, baseType: !48, size: 32, align: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "guestResyncTimeout", scope: !132, file: !4, line: 180, baseType: !137, size: 32, align: 32, offset: 288)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "guestResyncTimer", scope: !132, file: !4, line: 181, baseType: !145, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !132, file: !4, line: 182, baseType: !92, size: 64, align: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !54, line: 172, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 40, baseType: !225)
!225 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!226 = distinct !DIGlobalVariable(name: "calibrationAdjustment", scope: !127, file: !4, line: 458, type: !223, isLocal: true, isDefinition: true, variable: i64* @TimeSyncSlewTime.calibrationAdjustment)
!227 = distinct !DIGlobalVariable(name: "syncBeforeLoop", scope: !228, file: !4, line: 875, type: !48, isLocal: true, isDefinition: true, variable: i32* @TimeSyncSetOption.syncBeforeLoop)
!228 = distinct !DISubprogram(name: "TimeSyncSetOption", scope: !4, file: !4, line: 869, type: !229, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!229 = !DISubroutineType(types: !230)
!230 = !{!48, !52, !92, !99, !99, !70}
!231 = distinct !DIGlobalVariable(name: "doneAlready", scope: !228, file: !4, line: 960, type: !48, isLocal: true, isDefinition: true, variable: i32* @TimeSyncSetOption.doneAlready)
!232 = !{i32 2, !"Dwarf Version", i32 4}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!235 = distinct !DISubprogram(name: "TimeSyncStepTime", scope: !4, file: !4, line: 399, type: !128, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!236 = !DILocalVariable(name: "data", arg: 1, scope: !235, file: !4, line: 399, type: !130)
!237 = !DIExpression()
!238 = !DILocation(line: 399, column: 32, scope: !235)
!239 = !DILocalVariable(name: "adjustment", arg: 2, scope: !235, file: !4, line: 399, type: !223)
!240 = !DILocation(line: 399, column: 44, scope: !235)
!241 = !DILocalVariable(name: "bp", scope: !235, file: !4, line: 401, type: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Backdoor_proto", file: !243, line: 102, baseType: !244)
!243 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/backdoor_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !243, line: 85, size: 384, align: 64, elements: !245)
!245 = !{!246, !330}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !244, file: !243, line: 93, baseType: !247, size: 384, align: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !244, file: !243, line: 86, size: 384, align: 64, elements: !248)
!248 = !{!249, !267, !270, !285, !300, !315}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !247, file: !243, line: 87, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !243, line: 87, size: 64, align: 64, elements: !251)
!251 = !{!252, !260, !261, !266}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !250, file: !243, line: 87, baseType: !253, size: 32, align: 16)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !243, line: 87, size: 32, align: 16, elements: !254)
!254 = !{!255, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !253, file: !243, line: 87, baseType: !256, size: 16, align: 16)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !54, line: 175, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !56, line: 49, baseType: !258)
!258 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !253, file: !243, line: 87, baseType: !256, size: 16, align: 16, offset: 16)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !250, file: !243, line: 87, baseType: !137, size: 32, align: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !250, file: !243, line: 87, baseType: !262, size: 64, align: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !243, line: 87, size: 64, align: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !262, file: !243, line: 87, baseType: !137, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !262, file: !243, line: 87, baseType: !137, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !250, file: !243, line: 87, baseType: !53, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !247, file: !243, line: 88, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !269, line: 216, baseType: !57)
!269 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1508")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !247, file: !243, line: 89, baseType: !271, size: 64, align: 64, offset: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !243, line: 89, size: 64, align: 64, elements: !272)
!272 = !{!273, !278, !279, !284}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !271, file: !243, line: 89, baseType: !274, size: 32, align: 16)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !271, file: !243, line: 89, size: 32, align: 16, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !274, file: !243, line: 89, baseType: !256, size: 16, align: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !274, file: !243, line: 89, baseType: !256, size: 16, align: 16, offset: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !271, file: !243, line: 89, baseType: !137, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !271, file: !243, line: 89, baseType: !280, size: 64, align: 32)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !271, file: !243, line: 89, size: 64, align: 32, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !280, file: !243, line: 89, baseType: !137, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !280, file: !243, line: 89, baseType: !137, size: 32, align: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !271, file: !243, line: 89, baseType: !53, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !247, file: !243, line: 90, baseType: !286, size: 64, align: 64, offset: 192)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !243, line: 90, size: 64, align: 64, elements: !287)
!287 = !{!288, !293, !294, !299}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !286, file: !243, line: 90, baseType: !289, size: 32, align: 16)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !243, line: 90, size: 32, align: 16, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !289, file: !243, line: 90, baseType: !256, size: 16, align: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !289, file: !243, line: 90, baseType: !256, size: 16, align: 16, offset: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !286, file: !243, line: 90, baseType: !137, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !286, file: !243, line: 90, baseType: !295, size: 64, align: 32)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !243, line: 90, size: 64, align: 32, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !295, file: !243, line: 90, baseType: !137, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !295, file: !243, line: 90, baseType: !137, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !286, file: !243, line: 90, baseType: !53, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !247, file: !243, line: 91, baseType: !301, size: 64, align: 64, offset: 256)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !243, line: 91, size: 64, align: 64, elements: !302)
!302 = !{!303, !308, !309, !314}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !301, file: !243, line: 91, baseType: !304, size: 32, align: 16)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !243, line: 91, size: 32, align: 16, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !304, file: !243, line: 91, baseType: !256, size: 16, align: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !304, file: !243, line: 91, baseType: !256, size: 16, align: 16, offset: 16)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !301, file: !243, line: 91, baseType: !137, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !301, file: !243, line: 91, baseType: !310, size: 64, align: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !243, line: 91, size: 64, align: 32, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !310, file: !243, line: 91, baseType: !137, size: 32, align: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !310, file: !243, line: 91, baseType: !137, size: 32, align: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !301, file: !243, line: 91, baseType: !53, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !247, file: !243, line: 92, baseType: !316, size: 64, align: 64, offset: 320)
!316 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !247, file: !243, line: 92, size: 64, align: 64, elements: !317)
!317 = !{!318, !323, !324, !329}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !316, file: !243, line: 92, baseType: !319, size: 32, align: 16)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !316, file: !243, line: 92, size: 32, align: 16, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !319, file: !243, line: 92, baseType: !256, size: 16, align: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !319, file: !243, line: 92, baseType: !256, size: 16, align: 16, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !316, file: !243, line: 92, baseType: !137, size: 32, align: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !316, file: !243, line: 92, baseType: !325, size: 64, align: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !316, file: !243, line: 92, size: 64, align: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !325, file: !243, line: 92, baseType: !137, size: 32, align: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !325, file: !243, line: 92, baseType: !137, size: 32, align: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !316, file: !243, line: 92, baseType: !53, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !244, file: !243, line: 101, baseType: !331, size: 384, align: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !244, file: !243, line: 94, size: 384, align: 64, elements: !332)
!332 = !{!333, !348, !363, !378, !393, !408}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !331, file: !243, line: 95, baseType: !334, size: 64, align: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 95, size: 64, align: 64, elements: !335)
!335 = !{!336, !341, !342, !347}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !334, file: !243, line: 95, baseType: !337, size: 32, align: 16)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !243, line: 95, size: 32, align: 16, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !337, file: !243, line: 95, baseType: !256, size: 16, align: 16)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !337, file: !243, line: 95, baseType: !256, size: 16, align: 16, offset: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !334, file: !243, line: 95, baseType: !137, size: 32, align: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !334, file: !243, line: 95, baseType: !343, size: 64, align: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !243, line: 95, size: 64, align: 32, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !343, file: !243, line: 95, baseType: !137, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !343, file: !243, line: 95, baseType: !137, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !334, file: !243, line: 95, baseType: !53, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !331, file: !243, line: 96, baseType: !349, size: 64, align: 64, offset: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 96, size: 64, align: 64, elements: !350)
!350 = !{!351, !356, !357, !362}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !349, file: !243, line: 96, baseType: !352, size: 32, align: 16)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !243, line: 96, size: 32, align: 16, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !352, file: !243, line: 96, baseType: !256, size: 16, align: 16)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !352, file: !243, line: 96, baseType: !256, size: 16, align: 16, offset: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !349, file: !243, line: 96, baseType: !137, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !349, file: !243, line: 96, baseType: !358, size: 64, align: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !243, line: 96, size: 64, align: 32, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !358, file: !243, line: 96, baseType: !137, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !358, file: !243, line: 96, baseType: !137, size: 32, align: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !349, file: !243, line: 96, baseType: !53, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !331, file: !243, line: 97, baseType: !364, size: 64, align: 64, offset: 128)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 97, size: 64, align: 64, elements: !365)
!365 = !{!366, !371, !372, !377}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !364, file: !243, line: 97, baseType: !367, size: 32, align: 16)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !243, line: 97, size: 32, align: 16, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !367, file: !243, line: 97, baseType: !256, size: 16, align: 16)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !367, file: !243, line: 97, baseType: !256, size: 16, align: 16, offset: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !364, file: !243, line: 97, baseType: !137, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !364, file: !243, line: 97, baseType: !373, size: 64, align: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !243, line: 97, size: 64, align: 32, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !373, file: !243, line: 97, baseType: !137, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !373, file: !243, line: 97, baseType: !137, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !364, file: !243, line: 97, baseType: !53, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !331, file: !243, line: 98, baseType: !379, size: 64, align: 64, offset: 192)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 98, size: 64, align: 64, elements: !380)
!380 = !{!381, !386, !387, !392}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !379, file: !243, line: 98, baseType: !382, size: 32, align: 16)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !243, line: 98, size: 32, align: 16, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !382, file: !243, line: 98, baseType: !256, size: 16, align: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !382, file: !243, line: 98, baseType: !256, size: 16, align: 16, offset: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !379, file: !243, line: 98, baseType: !137, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !379, file: !243, line: 98, baseType: !388, size: 64, align: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !243, line: 98, size: 64, align: 32, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !388, file: !243, line: 98, baseType: !137, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !388, file: !243, line: 98, baseType: !137, size: 32, align: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !379, file: !243, line: 98, baseType: !53, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !331, file: !243, line: 99, baseType: !394, size: 64, align: 64, offset: 256)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 99, size: 64, align: 64, elements: !395)
!395 = !{!396, !401, !402, !407}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !394, file: !243, line: 99, baseType: !397, size: 32, align: 16)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !243, line: 99, size: 32, align: 16, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !397, file: !243, line: 99, baseType: !256, size: 16, align: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !397, file: !243, line: 99, baseType: !256, size: 16, align: 16, offset: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !394, file: !243, line: 99, baseType: !137, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !394, file: !243, line: 99, baseType: !403, size: 64, align: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !243, line: 99, size: 64, align: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !403, file: !243, line: 99, baseType: !137, size: 32, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !403, file: !243, line: 99, baseType: !137, size: 32, align: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !394, file: !243, line: 99, baseType: !53, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !331, file: !243, line: 100, baseType: !409, size: 64, align: 64, offset: 320)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !243, line: 100, size: 64, align: 64, elements: !410)
!410 = !{!411, !416, !417, !422}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "halfs", scope: !409, file: !243, line: 100, baseType: !412, size: 32, align: 16)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !243, line: 100, size: 32, align: 16, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !412, file: !243, line: 100, baseType: !256, size: 16, align: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !412, file: !243, line: 100, baseType: !256, size: 16, align: 16, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !409, file: !243, line: 100, baseType: !137, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !409, file: !243, line: 100, baseType: !418, size: 64, align: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !409, file: !243, line: 100, size: 64, align: 32, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !418, file: !243, line: 100, baseType: !137, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !418, file: !243, line: 100, baseType: !137, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "quad", scope: !409, file: !243, line: 100, baseType: !53, size: 64, align: 64)
!423 = !DILocation(line: 401, column: 19, scope: !235)
!424 = !DILocalVariable(name: "before", scope: !235, file: !4, line: 402, type: !223)
!425 = !DILocation(line: 402, column: 10, scope: !235)
!426 = !DILocalVariable(name: "after", scope: !235, file: !4, line: 403, type: !223)
!427 = !DILocation(line: 403, column: 10, scope: !235)
!428 = !DILocation(line: 410, column: 25, scope: !235)
!429 = !DILocation(line: 410, column: 4, scope: !235)
!430 = !DILocation(line: 412, column: 35, scope: !431)
!431 = distinct !DILexicalBlock(scope: !235, file: !4, line: 412, column: 8)
!432 = !DILocation(line: 412, column: 9, scope: !431)
!433 = !DILocation(line: 412, column: 8, scope: !235)
!434 = !DILocation(line: 413, column: 7, scope: !435)
!435 = distinct !DILexicalBlock(scope: !431, file: !4, line: 412, column: 48)
!436 = !DILocation(line: 420, column: 7, scope: !235)
!437 = !DILocation(line: 420, column: 10, scope: !235)
!438 = !DILocation(line: 420, column: 13, scope: !235)
!439 = !DILocation(line: 420, column: 19, scope: !235)
!440 = !DILocation(line: 420, column: 23, scope: !235)
!441 = !DILocation(line: 421, column: 4, scope: !235)
!442 = !DILocation(line: 432, column: 4, scope: !235)
!443 = !DILocation(line: 433, column: 1, scope: !235)
!444 = distinct !DISubprogram(name: "TimeSyncSetSlewState", scope: !4, file: !4, line: 558, type: !445, isLocal: true, isDefinition: true, scopeLine: 559, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !130, !48}
!447 = !DILocalVariable(name: "data", arg: 1, scope: !444, file: !4, line: 558, type: !130)
!448 = !DILocation(line: 558, column: 36, scope: !444)
!449 = !DILocalVariable(name: "active", arg: 2, scope: !444, file: !4, line: 558, type: !48)
!450 = !DILocation(line: 558, column: 51, scope: !444)
!451 = !DILocation(line: 560, column: 8, scope: !452)
!452 = distinct !DILexicalBlock(scope: !444, file: !4, line: 560, column: 8)
!453 = !DILocation(line: 560, column: 18, scope: !452)
!454 = !DILocation(line: 560, column: 24, scope: !452)
!455 = !DILocation(line: 560, column: 15, scope: !452)
!456 = !DILocation(line: 560, column: 8, scope: !444)
!457 = !DILocation(line: 561, column: 45, scope: !458)
!458 = distinct !DILexicalBlock(scope: !452, file: !4, line: 560, column: 36)
!459 = !DILocation(line: 561, column: 7, scope: !458)
!460 = !DILocation(line: 562, column: 12, scope: !461)
!461 = distinct !DILexicalBlock(scope: !458, file: !4, line: 562, column: 11)
!462 = !DILocation(line: 562, column: 11, scope: !458)
!463 = !DILocation(line: 563, column: 28, scope: !464)
!464 = distinct !DILexicalBlock(scope: !461, file: !4, line: 562, column: 20)
!465 = !DILocation(line: 563, column: 10, scope: !464)
!466 = !DILocation(line: 564, column: 7, scope: !464)
!467 = !DILocation(line: 565, column: 26, scope: !458)
!468 = !DILocation(line: 565, column: 7, scope: !458)
!469 = !DILocation(line: 565, column: 13, scope: !458)
!470 = !DILocation(line: 565, column: 24, scope: !458)
!471 = !DILocation(line: 566, column: 4, scope: !458)
!472 = !DILocation(line: 567, column: 1, scope: !444)
!473 = !DILocalVariable(name: "ctx", arg: 1, scope: !67, file: !4, line: 1034, type: !92)
!474 = !DILocation(line: 1034, column: 26, scope: !67)
!475 = !DILocalVariable(name: "data", scope: !67, file: !4, line: 1042, type: !130)
!476 = !DILocation(line: 1042, column: 18, scope: !67)
!477 = !DILocation(line: 1042, column: 25, scope: !67)
!478 = !DILocalVariable(name: "rpcs", scope: !67, file: !4, line: 1043, type: !479)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 384, align: 64, elements: !505)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !110, line: 115, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !110, line: 94, size: 384, align: 64, elements: !482)
!482 = !{!483, !484, !501, !502, !503, !504}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !110, line: 96, baseType: !75, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !481, file: !110, line: 98, baseType: !485, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !110, line: 90, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!48, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !110, line: 77, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !110, line: 51, size: 512, align: 64, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !110, line: 53, baseType: !75, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !491, file: !110, line: 58, baseType: !75, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !491, file: !110, line: 60, baseType: !268, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !491, file: !110, line: 65, baseType: !214, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !491, file: !110, line: 67, baseType: !268, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !491, file: !110, line: 72, baseType: !48, size: 32, align: 32, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !491, file: !110, line: 74, baseType: !42, size: 64, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !491, file: !110, line: 76, baseType: !42, size: 64, align: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !481, file: !110, line: 100, baseType: !52, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !481, file: !110, line: 102, baseType: !52, size: 64, align: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !481, file: !110, line: 109, baseType: !52, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !481, file: !110, line: 114, baseType: !268, size: 64, align: 64, offset: 320)
!505 = !{!506}
!506 = !DISubrange(count: 1)
!507 = !DILocation(line: 1043, column: 23, scope: !67)
!508 = !DILocation(line: 1043, column: 32, scope: !67)
!509 = !DILocation(line: 1044, column: 7, scope: !67)
!510 = !DILocation(line: 1044, column: 50, scope: !67)
!511 = !DILocalVariable(name: "sigs", scope: !67, file: !4, line: 1046, type: !512)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 384, align: 64, elements: !519)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !15, line: 484, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !15, line: 480, size: 192, align: 64, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !514, file: !15, line: 481, baseType: !99, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !514, file: !15, line: 482, baseType: !52, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !514, file: !15, line: 483, baseType: !52, size: 64, align: 64, offset: 128)
!519 = !{!520}
!520 = !DISubrange(count: 2)
!521 = !DILocation(line: 1046, column: 24, scope: !67)
!522 = !DILocalVariable(name: "regs", scope: !67, file: !4, line: 1050, type: !523)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 256, align: 64, elements: !519)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !15, line: 450, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !15, line: 447, size: 128, align: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !15, line: 448, baseType: !122, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !525, file: !15, line: 449, baseType: !77, size: 64, align: 64, offset: 64)
!529 = !DILocation(line: 1050, column: 16, scope: !67)
!530 = !DILocation(line: 1050, column: 25, scope: !67)
!531 = !DILocation(line: 1051, column: 7, scope: !67)
!532 = !DILocation(line: 1051, column: 47, scope: !67)
!533 = !DILocation(line: 1051, column: 29, scope: !67)
!534 = !DILocation(line: 1052, column: 7, scope: !67)
!535 = !DILocation(line: 1052, column: 46, scope: !67)
!536 = !DILocation(line: 1052, column: 28, scope: !67)
!537 = !DILocation(line: 1055, column: 4, scope: !67)
!538 = !DILocation(line: 1055, column: 10, scope: !67)
!539 = !DILocation(line: 1055, column: 21, scope: !67)
!540 = !DILocation(line: 1056, column: 4, scope: !67)
!541 = !DILocation(line: 1056, column: 10, scope: !67)
!542 = !DILocation(line: 1056, column: 25, scope: !67)
!543 = !DILocation(line: 1057, column: 4, scope: !67)
!544 = !DILocation(line: 1057, column: 10, scope: !67)
!545 = !DILocation(line: 1057, column: 32, scope: !67)
!546 = !DILocation(line: 1058, column: 4, scope: !67)
!547 = !DILocation(line: 1058, column: 10, scope: !67)
!548 = !DILocation(line: 1058, column: 16, scope: !67)
!549 = !DILocation(line: 1059, column: 4, scope: !67)
!550 = !DILocation(line: 1059, column: 10, scope: !67)
!551 = !DILocation(line: 1059, column: 20, scope: !67)
!552 = !DILocation(line: 1060, column: 4, scope: !67)
!553 = !DILocation(line: 1060, column: 10, scope: !67)
!554 = !DILocation(line: 1060, column: 25, scope: !67)
!555 = !DILocation(line: 1061, column: 4, scope: !67)
!556 = !DILocation(line: 1061, column: 10, scope: !67)
!557 = !DILocation(line: 1061, column: 16, scope: !67)
!558 = !DILocation(line: 1062, column: 4, scope: !67)
!559 = !DILocation(line: 1062, column: 10, scope: !67)
!560 = !DILocation(line: 1062, column: 22, scope: !67)
!561 = !DILocation(line: 1063, column: 4, scope: !67)
!562 = !DILocation(line: 1063, column: 10, scope: !67)
!563 = !DILocation(line: 1063, column: 29, scope: !67)
!564 = !DILocation(line: 1064, column: 4, scope: !67)
!565 = !DILocation(line: 1064, column: 10, scope: !67)
!566 = !DILocation(line: 1064, column: 27, scope: !67)
!567 = !DILocation(line: 1065, column: 16, scope: !67)
!568 = !DILocation(line: 1065, column: 4, scope: !67)
!569 = !DILocation(line: 1065, column: 10, scope: !67)
!570 = !DILocation(line: 1065, column: 14, scope: !67)
!571 = !DILocation(line: 1066, column: 37, scope: !67)
!572 = !DILocation(line: 1066, column: 19, scope: !67)
!573 = !DILocation(line: 1066, column: 17, scope: !67)
!574 = !DILocation(line: 1067, column: 23, scope: !67)
!575 = !DILocation(line: 1067, column: 21, scope: !67)
!576 = !DILocation(line: 1069, column: 4, scope: !67)
!577 = distinct !DISubprogram(name: "TimeSyncTcloHandler", scope: !4, file: !4, line: 812, type: !487, isLocal: true, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !125)
!578 = !DILocalVariable(name: "data", arg: 1, scope: !577, file: !4, line: 812, type: !489)
!579 = !DILocation(line: 812, column: 32, scope: !577)
!580 = !DILocalVariable(name: "backwardSync", scope: !577, file: !4, line: 814, type: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !54, line: 230, baseType: !62)
!582 = !DILocation(line: 814, column: 9, scope: !577)
!583 = !DILocalVariable(name: "argVal", scope: !577, file: !4, line: 815, type: !137)
!584 = !DILocation(line: 815, column: 11, scope: !577)
!585 = !DILocalVariable(name: "index", scope: !577, file: !4, line: 816, type: !87)
!586 = !DILocation(line: 816, column: 17, scope: !577)
!587 = !DILocalVariable(name: "syncData", scope: !577, file: !4, line: 817, type: !130)
!588 = !DILocation(line: 817, column: 18, scope: !577)
!589 = !DILocation(line: 817, column: 29, scope: !577)
!590 = !DILocation(line: 817, column: 35, scope: !577)
!591 = !DILocation(line: 819, column: 51, scope: !592)
