; ModuleID = './libvmbackup_la-scriptOps.o.i'
source_filename = "./libvmbackup_la-scriptOps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.VmBackupOp = type { i32 (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)*, void (%struct.VmBackupOp*)* }
%struct.VmBackupState = type { %struct.ToolsAppCtx*, %struct.VmBackupOp*, i8*, %struct.GStaticMutex, i8*, i8*, i32, %struct._GSource*, %struct._GSource*, %struct._GSource*, i8 (%struct.VmBackupState*)*, i8, i8, i8, i8, i8*, i8, i8, i8, i8, i8*, i32, i8*, i8*, i8*, i64, i8*, i32, i32, %struct.VmBackupSyncProvider*, %struct.VmBackupSyncCompleter*, i32, i32, i8, i8, i8 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57)
!1 = !DIFile(filename: "libvmbackup_la-scriptOps.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!2 = !{!3, !10, !15, !19, !30, !36, !48}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 43, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "vmBackupInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "VMBACKUP_STATUS_PENDING", value: 0)
!7 = !DIEnumerator(name: "VMBACKUP_STATUS_FINISHED", value: 1)
!8 = !DIEnumerator(name: "VMBACKUP_STATUS_CANCELED", value: 2)
!9 = !DIEnumerator(name: "VMBACKUP_STATUS_ERROR", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "VMBACKUP_SCRIPT_FREEZE", value: 0)
!13 = !DIEnumerator(name: "VMBACKUP_SCRIPT_FREEZE_FAIL", value: 1)
!14 = !DIEnumerator(name: "VMBACKUP_SCRIPT_THAW", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 232, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!17 = !{!18}
!18 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 63, size: 32, align: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29}
!21 = !DIEnumerator(name: "VMBACKUP_MSTATE_IDLE", value: 0)
!22 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_FREEZE", value: 1)
!23 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE_WAIT", value: 2)
!24 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_FREEZE", value: 3)
!25 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_THAW", value: 4)
!26 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_THAW", value: 5)
!27 = !DIEnumerator(name: "VMBACKUP_MSTATE_COMPLETE_WAIT", value: 6)
!28 = !DIEnumerator(name: "VMBACKUP_MSTATE_SCRIPT_ERROR", value: 7)
!29 = !DIEnumerator(name: "VMBACKUP_MSTATE_SYNC_ERROR", value: 8)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 50, size: 32, align: 32, elements: !31)
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "VMBACKUP_FREEZE_PENDING", value: 0)
!33 = !DIEnumerator(name: "VMBACKUP_FREEZE_FINISHED", value: 1)
!34 = !DIEnumerator(name: "VMBACKUP_FREEZE_CANCELED", value: 2)
!35 = !DIEnumerator(name: "VMBACKUP_FREEZE_ERROR", value: 3)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 51, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47}
!39 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!40 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!47 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 78, size: 32, align: 32, elements: !50)
!49 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/guestrpc/vmbackup.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "VMBACKUP_SUCCESS", value: 0)
!52 = !DIEnumerator(name: "VMBACKUP_INVALID_STATE", value: 1)
!53 = !DIEnumerator(name: "VMBACKUP_SCRIPT_ERROR", value: 2)
!54 = !DIEnumerator(name: "VMBACKUP_SYNC_ERROR", value: 3)
!55 = !DIEnumerator(name: "VMBACKUP_REMOTE_ABORT", value: 4)
!56 = !DIEnumerator(name: "VMBACKUP_UNEXPECTED_ERROR", value: 5)
!57 = !{!58, !59, !62, !77, !335}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 216, baseType: !61)
!60 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!61 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOp", file: !4, line: 86, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupOp", file: !4, line: 82, size: 192, align: 64, elements: !65)
!65 = !{!66, !72, !76}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "queryFn", scope: !64, file: !4, line: 83, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupOpStatus", file: !4, line: 48, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "releaseFn", scope: !64, file: !4, line: 84, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !71}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cancelFn", scope: !64, file: !4, line: 85, baseType: !73, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupScriptOp", file: !79, line: 68, baseType: !80)
!79 = !DIFile(filename: "scriptOps.c", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupScriptOp", file: !79, line: 62, size: 320, align: 64, elements: !81)
!81 = !{!82, !83, !87, !88, !90}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !80, file: !79, line: 63, baseType: !63, size: 192, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "canceled", scope: !80, file: !79, line: 64, baseType: !84, size: 8, align: 8, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !85, line: 230, baseType: !86)
!85 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "thawFailed", scope: !80, file: !79, line: 65, baseType: !84, size: 8, align: 8, offset: 200)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !79, line: 66, baseType: !89, size: 32, align: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupScriptType", file: !4, line: 61, baseType: !10)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !80, file: !79, line: 67, baseType: !91, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupState", file: !4, line: 141, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupState", file: !4, line: 104, size: 1984, align: 64, elements: !94)
!94 = !{!95, !135, !136, !137, !184, !186, !187, !188, !266, !267, !268, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !284, !285, !286, !287, !288, !293, !294, !296, !298, !318, !330, !331, !332, !333, !334}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !93, file: !4, line: 105, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !16, line: 274, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !16, line: 241, size: 576, align: 64, elements: !99)
!99 = !{!100, !102, !107, !111, !112, !117, !122, !127, !128, !129, !133}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !98, file: !16, line: 243, baseType: !101, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !16, line: 234, baseType: !15)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !16, line: 245, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !106, line: 46, baseType: !86)
!106 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!107 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !98, file: !16, line: 247, baseType: !108, size: 32, align: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !106, line: 50, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !106, line: 49, baseType: !110)
!110 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !98, file: !16, line: 249, baseType: !110, size: 32, align: 32, offset: 160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !98, file: !16, line: 251, baseType: !113, size: 64, align: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !115, line: 56, baseType: !116)
!115 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !115, line: 56, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !98, file: !16, line: 253, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !120, line: 48, baseType: !121)
!120 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !120, line: 48, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !98, file: !16, line: 255, baseType: !123, size: 64, align: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !125, line: 48, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !125, line: 48, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !98, file: !16, line: 261, baseType: !110, size: 32, align: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !98, file: !16, line: 263, baseType: !110, size: 32, align: 32, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !98, file: !16, line: 265, baseType: !130, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !98, file: !16, line: 273, baseType: !134, size: 64, align: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !106, line: 77, baseType: !58)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "currentOp", scope: !93, file: !4, line: 106, baseType: !62, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "currentOpName", scope: !93, file: !4, line: 107, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "opLock", scope: !93, file: !4, line: 108, baseType: !138, size: 384, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !139, line: 140, baseType: !140)
!139 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 133, size: 384, align: 64, elements: !141)
!141 = !{!142, !155}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !140, file: !139, line: 135, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !145, line: 51, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !145, line: 58, size: 64, align: 64, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !146, file: !145, line: 61, baseType: !134, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !146, file: !145, line: 62, baseType: !150, size: 64, align: 32)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, align: 32, elements: !153)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !106, line: 55, baseType: !152)
!152 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!153 = !{!154}
!154 = !DISubrange(count: 2)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !140, file: !139, line: 138, baseType: !156, size: 320, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !157, line: 128, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !157, line: 90, size: 320, align: 64, elements: !159)
!159 = !{!160, !178, !182}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !158, file: !157, line: 125, baseType: !161, size: 320, align: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !157, line: 92, size: 320, align: 64, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !170, !171}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !161, file: !157, line: 94, baseType: !110, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !161, file: !157, line: 95, baseType: !152, size: 32, align: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !161, file: !157, line: 96, baseType: !110, size: 32, align: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !161, file: !157, line: 98, baseType: !152, size: 32, align: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !161, file: !157, line: 102, baseType: !110, size: 32, align: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !161, file: !157, line: 104, baseType: !169, size: 16, align: 16, offset: 160)
!169 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !161, file: !157, line: 105, baseType: !169, size: 16, align: 16, offset: 176)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !161, file: !157, line: 106, baseType: !172, size: 128, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !157, line: 79, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !157, line: 75, size: 128, align: 64, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !173, file: !157, line: 77, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !173, file: !157, line: 78, baseType: !176, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !158, file: !157, line: 126, baseType: !179, size: 320, align: 8)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 320, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 40)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !158, file: !157, line: 127, baseType: !183, size: 64, align: 64)
!183 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "volumes", scope: !93, file: !4, line: 109, baseType: !185, size: 64, align: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "snapshots", scope: !93, file: !4, line: 110, baseType: !185, size: 64, align: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pollPeriod", scope: !93, file: !4, line: 111, baseType: !151, size: 32, align: 32, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "abortTimer", scope: !93, file: !4, line: 112, baseType: !189, size: 64, align: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !115, line: 64, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !115, line: 171, size: 768, align: 64, elements: !192)
!192 = !{!193, !194, !214, !243, !244, !248, !249, !250, !251, !259, !260, !261, !262}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !191, file: !115, line: 174, baseType: !134, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !191, file: !115, line: 175, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !115, line: 77, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !115, line: 196, size: 192, align: 64, elements: !198)
!198 = !{!199, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !197, file: !115, line: 198, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !134}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !197, file: !115, line: 199, baseType: !200, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !197, file: !115, line: 200, baseType: !205, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !134, !189, !208, !213}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !115, line: 155, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!108, !134}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !191, file: !115, line: 177, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !115, line: 130, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !115, line: 214, size: 384, align: 64, elements: !219)
!219 = !{!220, !225, !229, !233, !237, !238}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !218, file: !115, line: 216, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!108, !189, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !218, file: !115, line: 218, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!108, !189}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !218, file: !115, line: 219, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!108, !189, !209, !134}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !218, file: !115, line: 222, baseType: !234, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !189}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !218, file: !115, line: 226, baseType: !209, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !218, file: !115, line: 227, baseType: !239, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !115, line: 212, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !191, file: !115, line: 178, baseType: !151, size: 32, align: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !191, file: !115, line: 180, baseType: !245, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !115, line: 48, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !115, line: 48, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !191, file: !115, line: 182, baseType: !109, size: 32, align: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !191, file: !115, line: 183, baseType: !151, size: 32, align: 32, offset: 352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !191, file: !115, line: 184, baseType: !151, size: 32, align: 32, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !191, file: !115, line: 186, baseType: !252, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !254, line: 37, baseType: !255)
!254 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !254, line: 39, size: 128, align: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !254, line: 41, baseType: !134, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !255, file: !254, line: 42, baseType: !252, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !115, line: 188, baseType: !189, size: 64, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !115, line: 189, baseType: !189, size: 64, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !115, line: 191, baseType: !185, size: 64, align: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !191, file: !115, line: 193, baseType: !263, size: 64, align: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !115, line: 65, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !115, line: 65, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "timerEvent", scope: !93, file: !4, line: 113, baseType: !189, size: 64, align: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "keepAlive", scope: !93, file: !4, line: 114, baseType: !189, size: 64, align: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !93, file: !4, line: 115, baseType: !269, size: 64, align: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!84, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "forceRequeue", scope: !93, file: !4, line: 116, baseType: !84, size: 8, align: 8, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "generateManifests", scope: !93, file: !4, line: 117, baseType: !84, size: 8, align: 8, offset: 1032)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceApps", scope: !93, file: !4, line: 118, baseType: !84, size: 8, align: 8, offset: 1040)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quiesceFS", scope: !93, file: !4, line: 119, baseType: !84, size: 8, align: 8, offset: 1048)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "excludedFileSystems", scope: !93, file: !4, line: 120, baseType: !185, size: 64, align: 64, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "allowHWProvider", scope: !93, file: !4, line: 121, baseType: !84, size: 8, align: 8, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "execScripts", scope: !93, file: !4, line: 122, baseType: !84, size: 8, align: 8, offset: 1160)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "enableNullDriver", scope: !93, file: !4, line: 123, baseType: !84, size: 8, align: 8, offset: 1168)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "needsPriv", scope: !93, file: !4, line: 124, baseType: !84, size: 8, align: 8, offset: 1176)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scriptArg", scope: !93, file: !4, line: 125, baseType: !283, size: 64, align: 64, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !93, file: !4, line: 126, baseType: !151, size: 32, align: 32, offset: 1280)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !93, file: !4, line: 127, baseType: !134, size: 64, align: 64, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scripts", scope: !93, file: !4, line: 128, baseType: !58, size: 64, align: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "configDir", scope: !93, file: !4, line: 129, baseType: !131, size: 64, align: 64, offset: 1472)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "currentScript", scope: !93, file: !4, line: 130, baseType: !289, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !290, line: 109, baseType: !291)
!290 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !292, line: 172, baseType: !183)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!293 = !DIDerivedType(tag: DW_TAG_member, name: "errorMsg", scope: !93, file: !4, line: 131, baseType: !283, size: 64, align: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "machineState", scope: !93, file: !4, line: 132, baseType: !295, size: 32, align: 32, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupMState", file: !4, line: 73, baseType: !19)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "freezeStatus", scope: !93, file: !4, line: 133, baseType: !297, size: 32, align: 32, offset: 1696)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupFreezeStatus", file: !4, line: 55, baseType: !30)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "provider", scope: !93, file: !4, line: 134, baseType: !299, size: 64, align: 64, offset: 1728)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncProvider", file: !4, line: 154, size: 256, align: 64, elements: !301)
!301 = !{!302, !308, !313, !317}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !300, file: !4, line: 158, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCorePoolCb", file: !304, line: 54, baseType: !305)
!304 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/threadPool.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !96, !134}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotDone", scope: !300, file: !4, line: 160, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupProviderCallback", file: !4, line: 144, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!84, !91, !58}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !300, file: !4, line: 161, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !299}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !300, file: !4, line: 162, baseType: !58, size: 64, align: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "completer", scope: !93, file: !4, line: 135, baseType: !319, size: 64, align: 64, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupSyncCompleter", file: !4, line: 171, size: 256, align: 64, elements: !321)
!321 = !{!322, !324, !325, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !320, file: !4, line: 172, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupCompleterCallback", file: !4, line: 145, baseType: !310)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "snapshotCompleted", scope: !320, file: !4, line: 173, baseType: !323, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !320, file: !4, line: 174, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !319}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !320, file: !4, line: 175, baseType: !58, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupContext", scope: !93, file: !4, line: 136, baseType: !109, size: 32, align: 32, offset: 1856)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "vssBackupType", scope: !93, file: !4, line: 137, baseType: !109, size: 32, align: 32, offset: 1888)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vssBootableSystemState", scope: !93, file: !4, line: 138, baseType: !84, size: 8, align: 8, offset: 1920)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vssPartialFileSupport", scope: !93, file: !4, line: 139, baseType: !84, size: 8, align: 8, offset: 1928)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "vssUseDefault", scope: !93, file: !4, line: 140, baseType: !84, size: 8, align: 8, offset: 1936)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!337 = !{i32 2, !"Dwarf Version", i32 4}
!338 = !{i32 2, !"Debug Info Version", i32 3}
!339 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!340 = distinct !DISubprogram(name: "VmBackup_NewScriptOp", scope: !79, file: !79, line: 431, type: !341, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !343)
!341 = !DISubroutineType(types: !342)
!342 = !{!62, !89, !91}
!343 = !{}
!344 = !DILocalVariable(name: "type", arg: 1, scope: !340, file: !79, line: 431, type: !89)
!345 = !DIExpression()
!346 = !DILocation(line: 431, column: 41, scope: !340)
!347 = !DILocalVariable(name: "state", arg: 2, scope: !340, file: !79, line: 432, type: !91)
!348 = !DILocation(line: 432, column: 37, scope: !340)
!349 = !DILocalVariable(name: "fail", scope: !340, file: !79, line: 434, type: !84)
!350 = !DILocation(line: 434, column: 9, scope: !340)
!351 = !DILocalVariable(name: "fileList", scope: !340, file: !79, line: 435, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!353 = !DILocation(line: 435, column: 11, scope: !340)
!354 = !DILocalVariable(name: "scriptDir", scope: !340, file: !79, line: 436, type: !185)
!355 = !DILocation(line: 436, column: 10, scope: !340)
!356 = !DILocalVariable(name: "numFiles", scope: !340, file: !79, line: 437, type: !110)
!357 = !DILocation(line: 437, column: 8, scope: !340)
!358 = !DILocalVariable(name: "i", scope: !340, file: !79, line: 438, type: !59)
!359 = !DILocation(line: 438, column: 11, scope: !340)
!360 = !DILocalVariable(name: "op", scope: !340, file: !79, line: 439, type: !77)
!361 = !DILocation(line: 439, column: 22, scope: !340)
!362 = !DILocation(line: 441, column: 16, scope: !340)
!363 = !DILocation(line: 441, column: 14, scope: !340)
!364 = !DILocation(line: 442, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !340, file: !79, line: 442, column: 8)
!366 = !DILocation(line: 442, column: 18, scope: !365)
!367 = !DILocation(line: 442, column: 8, scope: !340)
!368 = !DILocation(line: 443, column: 7, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !79, line: 442, column: 26)
!370 = !DILocation(line: 446, column: 9, scope: !340)
!371 = !DILocation(line: 446, column: 7, scope: !340)
!372 = !DILocation(line: 447, column: 8, scope: !373)
!373 = distinct !DILexicalBlock(scope: !340, file: !79, line: 447, column: 8)
!374 = !DILocation(line: 447, column: 11, scope: !373)
!375 = !DILocation(line: 447, column: 8, scope: !340)
!376 = !DILocation(line: 448, column: 7, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !79, line: 447, column: 19)
!378 = !DILocation(line: 451, column: 16, scope: !340)
!379 = !DILocation(line: 451, column: 4, scope: !340)
!380 = !DILocation(line: 451, column: 8, scope: !340)
!381 = !DILocation(line: 451, column: 14, scope: !340)
!382 = !DILocation(line: 452, column: 15, scope: !340)
!383 = !DILocation(line: 452, column: 4, scope: !340)
!384 = !DILocation(line: 452, column: 8, scope: !340)
!385 = !DILocation(line: 452, column: 13, scope: !340)
!386 = !DILocation(line: 453, column: 4, scope: !340)
!387 = !DILocation(line: 453, column: 8, scope: !340)
!388 = !DILocation(line: 453, column: 18, scope: !340)
!389 = !DILocation(line: 453, column: 26, scope: !340)
!390 = !DILocation(line: 454, column: 4, scope: !340)
!391 = !DILocation(line: 454, column: 8, scope: !340)
!392 = !DILocation(line: 454, column: 18, scope: !340)
!393 = !DILocation(line: 454, column: 27, scope: !340)
!394 = !DILocation(line: 455, column: 4, scope: !340)
!395 = !DILocation(line: 455, column: 8, scope: !340)
!396 = !DILocation(line: 455, column: 18, scope: !340)
!397 = !DILocation(line: 455, column: 28, scope: !340)
!398 = !DILocation(line: 457, column: 77, scope: !340)
!399 = !DILocation(line: 457, column: 4, scope: !340)
!400 = !DILocation(line: 472, column: 8, scope: !401)
!401 = distinct !DILexicalBlock(scope: !340, file: !79, line: 472, column: 8)
!402 = !DILocation(line: 472, column: 13, scope: !401)
!403 = !DILocation(line: 472, column: 8, scope: !340)
!404 = !DILocalVariable(name: "scripts", scope: !405, file: !79, line: 473, type: !406)
!405 = distinct !DILexicalBlock(scope: !401, file: !79, line: 472, column: 40)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmBackupScript", file: !79, line: 59, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VmBackupScript", file: !79, line: 56, size: 128, align: 64, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !408, file: !79, line: 57, baseType: !185, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proc", scope: !408, file: !79, line: 58, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_AsyncProc", file: !414, line: 42, baseType: !415)
!414 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/procMgr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1581")
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgr_AsyncProc", file: !414, line: 42, flags: DIFlagFwdDecl)
!416 = !DILocation(line: 473, column: 23, scope: !405)
!417 = !DILocalVariable(name: "legacy", scope: !405, file: !79, line: 474, type: !110)
!418 = !DILocation(line: 474, column: 11, scope: !405)
!419 = !DILocalVariable(name: "idx", scope: !405, file: !79, line: 475, type: !59)
!420 = !DILocation(line: 475, column: 14, scope: !405)
!421 = !DILocation(line: 477, column: 7, scope: !405)
!422 = !DILocation(line: 477, column: 14, scope: !405)
!423 = !DILocation(line: 477, column: 22, scope: !405)
!424 = !DILocation(line: 478, column: 7, scope: !405)
!425 = !DILocation(line: 478, column: 14, scope: !405)
!426 = !DILocation(line: 478, column: 28, scope: !405)
!427 = !DILocation(line: 480, column: 11, scope: !428)
!428 = distinct !DILexicalBlock(scope: !405, file: !79, line: 480, column: 11)
!429 = !DILocation(line: 480, column: 54, scope: !428)
!430 = !DILocation(line: 481, column: 11, scope: !428)
!431 = !DILocation(line: 480, column: 11, scope: !432)
!432 = !DILexicalBlockFile(scope: !405, file: !79, discriminator: 1)
!433 = !DILocation(line: 482, column: 17, scope: !434)
!434 = distinct !DILexicalBlock(scope: !428, file: !79, line: 481, column: 54)
!435 = !DILocation(line: 483, column: 7, scope: !434)
!436 = !DILocation(line: 485, column: 28, scope: !437)
!437 = distinct !DILexicalBlock(scope: !405, file: !79, line: 485, column: 11)
!438 = !DILocation(line: 485, column: 11, scope: !437)
!439 = !DILocation(line: 485, column: 11, scope: !405)
!440 = !DILocation(line: 486, column: 40, scope: !441)
!441 = distinct !DILexicalBlock(scope: !437, file: !79, line: 485, column: 40)
!442 = !DILocation(line: 486, column: 21, scope: !441)
!443 = !DILocation(line: 486, column: 19, scope: !441)
!444 = !DILocation(line: 487, column: 7, scope: !441)
!445 = !DILocation(line: 489, column: 11, scope: !446)
!446 = distinct !DILexicalBlock(scope: !405, file: !79, line: 489, column: 11)
!447 = !DILocation(line: 489, column: 22, scope: !446)
!448 = !DILocation(line: 489, column: 20, scope: !446)
!449 = !DILocation(line: 489, column: 29, scope: !446)
!450 = !DILocation(line: 489, column: 11, scope: !405)
!451 = !DILocation(line: 490, column: 27, scope: !452)
!452 = distinct !DILexicalBlock(scope: !446, file: !79, line: 489, column: 34)
!453 = !DILocation(line: 490, column: 38, scope: !452)
!454 = !DILocation(line: 490, column: 36, scope: !452)
!455 = !DILocation(line: 490, column: 45, scope: !452)
!456 = !DILocation(line: 490, column: 20, scope: !452)
!457 = !DILocation(line: 490, column: 18, scope: !452)
!458 = !DILocation(line: 491, column: 14, scope: !459)
!459 = distinct !DILexicalBlock(scope: !452, file: !79, line: 491, column: 14)
!460 = !DILocation(line: 491, column: 22, scope: !459)
!461 = !DILocation(line: 491, column: 14, scope: !452)
!462 = !DILocation(line: 492, column: 18, scope: !463)
!463 = distinct !DILexicalBlock(scope: !459, file: !79, line: 491, column: 30)
!464 = !DILocation(line: 493, column: 13, scope: !463)
!465 = !DILocation(line: 500, column: 10, scope: !452)
!466 = !DILocation(line: 500, column: 17, scope: !452)
!467 = !DILocation(line: 500, column: 31, scope: !452)
!468 = !DILocation(line: 501, column: 27, scope: !452)
!469 = !DILocation(line: 501, column: 10, scope: !452)
!470 = !DILocation(line: 501, column: 17, scope: !452)
!471 = !DILocation(line: 501, column: 25, scope: !452)
