; ModuleID = './hgfsServerLinux.o.i'
source_filename = "./hgfsServerLinux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.timeval = type { i64, i64 }
%struct.HgfsFileAttrInfo = type { i32, i64, i32, i64, i64, i64, i64, i64, i8, i8, i8, i8, i64, i64, i32, i32, i64, i32, i32, i32, i32, %struct.HgfsShortFileName }
%struct.HgfsShortFileName = type { i32, [48 x i8] }
%struct.timezone = type { i32, i32 }
%struct.HgfsFileOpenInfo = type { i32, i32, i64, i32, i32, i8, i8, i8, i8, i64, i64, i32, i32, i32, i32, i32, i8*, i8*, i32, %struct.HgfsShareInfo }
%struct.HgfsShareInfo = type { i8*, i64, i8, i8, i32 }
%struct.HgfsSessionInfo = type { %struct.DblLnkLst_Links, i8, i32, i64, i32, %struct.HgfsTransportSessionInfo*, i32, %struct.MXUserExclLock*, i32, %struct.Atomic_uint32, %struct.MXUserExclLock*, %struct.HgfsFileNode*, i32, %struct.DblLnkLst_Links, %struct.DblLnkLst_Links, i32, i32, %struct.MXUserExclLock*, %struct.HgfsSearch*, i32, %struct.DblLnkLst_Links, [65 x %struct.HgfsOpCapability], i32, %struct.HgfsAsyncRequestInfo }
%struct.HgfsTransportSessionInfo = type opaque
%struct.Atomic_uint32 = type { i32 }
%struct.HgfsFileNode = type { %struct.DblLnkLst_Links, i32, i8*, i64, i8*, i64, %struct.HgfsLocalId, i32, i32, i32, i32, i32, i32, i8*, %struct.HgfsShareInfo }
%struct.HgfsLocalId = type { i64, i64 }
%struct.MXUserExclLock = type opaque

!456 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50936", value: 300)
!457 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50937", value: 301)
!458 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!459 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!460 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!461 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!462 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!463 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!464 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!465 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!466 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!467 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!468 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!469 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!470 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!471 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!472 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!473 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!474 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!475 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!476 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!477 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!478 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!479 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!480 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!481 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!482 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!483 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!484 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !486, line: 31, size: 32, align: 32, elements: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!488 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!489 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!490 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!491 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!492 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!493 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!494 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!495 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!496 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!497 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!498 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!499 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!500 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!501 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!502 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!503 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!504 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!505 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!506 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!507 = !{!508, !509, !514, !515, !510, !519, !521, !524, !537}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHandle", file: !20, line: 58, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !511, line: 173, baseType: !512)
!511 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !513, line: 51, baseType: !514)
!513 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!514 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !516, line: 80, baseType: !517)
!516 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !518, line: 125, baseType: !514)
!518 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectoryEntry", file: !526, line: 95, baseType: !527)
!526 = !DIFile(filename: "hgfsServerLinux.c", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DirectoryEntry", file: !526, line: 89, size: 2240, align: 64, elements: !528)
!528 = !{!529, !533, !534, !538, !542}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !527, file: !526, line: 90, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !511, line: 171, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !513, line: 55, baseType: !532)
!532 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !527, file: !526, line: 91, baseType: !530, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !527, file: !526, line: 92, baseType: !535, size: 16, align: 16, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !511, line: 175, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !513, line: 49, baseType: !537)
!537 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !527, file: !526, line: 93, baseType: !539, size: 8, align: 8, offset: 144)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !511, line: 177, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !513, line: 48, baseType: !541)
!541 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !527, file: !526, line: 94, baseType: !543, size: 2048, align: 8, offset: 152)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 2048, align: 8, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 256)
!546 = !{!547, !553}
!547 = distinct !DIGlobalVariable(name: "HgfsServerOpenMode", scope: !0, file: !526, line: 314, type: !548, isLocal: true, isDefinition: true, variable: [3 x i32]* @HgfsServerOpenMode)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 96, align: 32, elements: !551)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!551 = !{!552}
!552 = !DISubrange(count: 3)
!553 = distinct !DIGlobalVariable(name: "HgfsServerOpenFlags", scope: !0, file: !526, line: 302, type: !554, isLocal: true, isDefinition: true, variable: [5 x i32]* @HgfsServerOpenFlags)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 160, align: 32, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 5)
!557 = !{i32 2, !"Dwarf Version", i32 4}
!558 = !{i32 2, !"Debug Info Version", i32 3}
!559 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!560 = distinct !DISubprogram(name: "futimes", scope: !526, file: !526, line: 247, type: !561, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!561 = !DISubroutineType(types: !562)
!562 = !{!550, !550, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !566, line: 30, size: 128, align: 64, elements: !567)
!566 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!567 = !{!568, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !565, file: !566, line: 32, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !518, line: 139, baseType: !570)
!570 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !565, file: !566, line: 33, baseType: !572, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !518, line: 141, baseType: !570)
!573 = !{}
!574 = !DILocalVariable(name: "fd", arg: 1, scope: !560, file: !526, line: 247, type: !550)
!575 = !DIExpression()
!576 = !DILocation(line: 247, column: 13, scope: !560)
!577 = !DILocalVariable(name: "times", arg: 2, scope: !560, file: !526, line: 247, type: !563)
!578 = !DILocation(line: 247, column: 38, scope: !560)
!579 = !DILocalVariable(name: "mytimes", scope: !560, file: !526, line: 255, type: !580)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 256, align: 64, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 2)
!583 = !DILocation(line: 255, column: 19, scope: !560)
!584 = !DILocalVariable(name: "nameBuffer", scope: !560, file: !526, line: 258, type: !585)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 200, align: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 25)
!588 = !DILocation(line: 258, column: 9, scope: !560)
!589 = !DILocation(line: 260, column: 4, scope: !560)
!590 = !DILocation(line: 260, column: 17, scope: !560)
!591 = !DILocation(line: 261, column: 4, scope: !560)
!592 = !DILocation(line: 261, column: 17, scope: !560)
!593 = !DILocation(line: 262, column: 17, scope: !594)
!594 = distinct !DILexicalBlock(scope: !560, file: !526, line: 262, column: 8)
!595 = !DILocation(line: 262, column: 71, scope: !594)
!596 = !DILocation(line: 262, column: 8, scope: !594)
!597 = !DILocation(line: 262, column: 75, scope: !594)
!598 = !DILocation(line: 262, column: 8, scope: !560)
!599 = !DILocation(line: 263, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !594, file: !526, line: 262, column: 80)
!601 = !DILocation(line: 265, column: 24, scope: !560)
!602 = !DILocation(line: 265, column: 36, scope: !560)
!603 = !DILocation(line: 265, column: 11, scope: !560)
!604 = !DILocation(line: 265, column: 4, scope: !560)
!605 = !DILocation(line: 269, column: 1, scope: !560)
!606 = distinct !DISubprogram(name: "HgfsPlatformConvertFromNameStatus", scope: !526, file: !526, line: 411, type: !607, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!607 = !DISubroutineType(types: !608)
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsInternalStatus", file: !610, line: 82, baseType: !550)
!610 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsUtil.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsNameStatus", file: !4, line: 79, baseType: !3)
!612 = !DILocalVariable(name: "status", arg: 1, scope: !606, file: !526, line: 411, type: !611)
!613 = !DILocation(line: 411, column: 50, scope: !606)
!614 = !DILocation(line: 413, column: 11, scope: !606)
!615 = !DILocation(line: 413, column: 4, scope: !606)
!616 = !DILocation(line: 415, column: 7, scope: !617)
!617 = distinct !DILexicalBlock(scope: !606, file: !526, line: 413, column: 19)
!618 = !DILocation(line: 422, column: 7, scope: !617)
!619 = !DILocation(line: 424, column: 7, scope: !617)
!620 = !DILocation(line: 426, column: 7, scope: !617)
!621 = !DILocation(line: 428, column: 7, scope: !617)
!622 = !DILocation(line: 430, column: 7, scope: !617)
!623 = !DILocation(line: 432, column: 7, scope: !617)
!624 = !DILocation(line: 434, column: 7, scope: !617)
!625 = !DILocation(line: 436, column: 7, scope: !617)
!626 = !DILocation(line: 438, column: 1, scope: !606)
!627 = distinct !DISubprogram(name: "HgfsPlatformGetDefaultDirAttrs", scope: !526, file: !526, line: 459, type: !628, isLocal: false, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileAttrInfo", file: !129, line: 464, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileAttrInfo", file: !129, line: 440, size: 1408, align: 64, elements: !633)
!633 = !{!634, !636, !638, !640, !641, !642, !643, !644, !645, !647, !648, !649, !650, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "requestType", scope: !632, file: !129, line: 441, baseType: !635, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOp", file: !20, line: 152, baseType: !19)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !632, file: !129, line: 442, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAttrValid", file: !20, line: 434, baseType: !530)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !129, line: 443, baseType: !639, size: 32, align: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileType", file: !90, line: 99, baseType: !89)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !129, line: 444, baseType: !530, size: 64, align: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "creationTime", scope: !632, file: !129, line: 445, baseType: !530, size: 64, align: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "accessTime", scope: !632, file: !129, line: 446, baseType: !530, size: 64, align: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "writeTime", scope: !632, file: !129, line: 447, baseType: !530, size: 64, align: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "attrChangeTime", scope: !632, file: !129, line: 448, baseType: !530, size: 64, align: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "specialPerms", scope: !632, file: !129, line: 450, baseType: !646, size: 8, align: 8, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPermissions", file: !20, line: 220, baseType: !539)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPerms", scope: !632, file: !129, line: 451, baseType: !646, size: 8, align: 8, offset: 520)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "groupPerms", scope: !632, file: !129, line: 452, baseType: !646, size: 8, align: 8, offset: 528)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "otherPerms", scope: !632, file: !129, line: 453, baseType: !646, size: 8, align: 8, offset: 536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !129, line: 454, baseType: !651, size: 64, align: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAttrFlags", file: !20, line: 385, baseType: !530)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "allocationSize", scope: !632, file: !129, line: 455, baseType: !530, size: 64, align: 64, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "userId", scope: !632, file: !129, line: 456, baseType: !510, size: 32, align: 32, offset: 704)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "groupId", scope: !632, file: !129, line: 457, baseType: !510, size: 32, align: 32, offset: 736)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hostFileId", scope: !632, file: !129, line: 458, baseType: !530, size: 64, align: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "volumeId", scope: !632, file: !129, line: 459, baseType: !510, size: 32, align: 32, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "effectivePerms", scope: !632, file: !129, line: 460, baseType: !510, size: 32, align: 32, offset: 864)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "eaSize", scope: !632, file: !129, line: 461, baseType: !510, size: 32, align: 32, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reparseTag", scope: !632, file: !129, line: 462, baseType: !510, size: 32, align: 32, offset: 928)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "shortName", scope: !632, file: !129, line: 463, baseType: !661, size: 416, align: 8, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShortFileName", file: !20, line: 620, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsShortFileName", file: !20, line: 615, size: 416, align: 8, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !662, file: !20, line: 616, baseType: !510, size: 32, align: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !20, line: 617, baseType: !666, size: 384, align: 8, offset: 32)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 384, align: 8, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 48)
!669 = !DILocalVariable(name: "attr", arg: 1, scope: !627, file: !526, line: 459, type: !630)
!670 = !DILocation(line: 459, column: 50, scope: !627)
!671 = !DILocalVariable(name: "tv", scope: !627, file: !526, line: 461, type: !565)
!672 = !DILocation(line: 461, column: 19, scope: !627)
!673 = !DILocalVariable(name: "hgfsTime", scope: !627, file: !526, line: 462, type: !530)
!674 = !DILocation(line: 462, column: 11, scope: !627)
!675 = !DILocation(line: 466, column: 4, scope: !627)
!676 = !DILocation(line: 466, column: 10, scope: !627)
!677 = !DILocation(line: 466, column: 15, scope: !627)
!678 = !DILocation(line: 467, column: 4, scope: !627)
!679 = !DILocation(line: 467, column: 10, scope: !627)
!680 = !DILocation(line: 467, column: 15, scope: !627)
!681 = !DILocation(line: 474, column: 8, scope: !682)
!682 = distinct !DILexicalBlock(scope: !627, file: !526, line: 474, column: 8)
!683 = !DILocation(line: 474, column: 31, scope: !682)
!684 = !DILocation(line: 474, column: 8, scope: !627)
!685 = !DILocation(line: 475, column: 16, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !526, line: 474, column: 37)
!687 = !DILocation(line: 476, column: 4, scope: !686)
!688 = !DILocation(line: 477, column: 41, scope: !689)
!689 = distinct !DILexicalBlock(scope: !682, file: !526, line: 476, column: 11)
!690 = !DILocation(line: 477, column: 52, scope: !689)
!691 = !DILocation(line: 477, column: 60, scope: !689)
!692 = !DILocation(line: 477, column: 18, scope: !689)
!693 = !DILocation(line: 477, column: 16, scope: !689)
!694 = !DILocation(line: 479, column: 25, scope: !627)
!695 = !DILocation(line: 479, column: 4, scope: !627)
!696 = !DILocation(line: 479, column: 10, scope: !627)
!697 = !DILocation(line: 479, column: 23, scope: !627)
!698 = !DILocation(line: 480, column: 23, scope: !627)
!699 = !DILocation(line: 480, column: 4, scope: !627)
!700 = !DILocation(line: 480, column: 10, scope: !627)
!701 = !DILocation(line: 480, column: 21, scope: !627)
!702 = !DILocation(line: 481, column: 22, scope: !627)
!703 = !DILocation(line: 481, column: 4, scope: !627)
!704 = !DILocation(line: 481, column: 10, scope: !627)
!705 = !DILocation(line: 481, column: 20, scope: !627)
!706 = !DILocation(line: 482, column: 27, scope: !627)
!707 = !DILocation(line: 482, column: 4, scope: !627)
!708 = !DILocation(line: 482, column: 10, scope: !627)
!709 = !DILocation(line: 482, column: 25, scope: !627)
!710 = !DILocation(line: 483, column: 4, scope: !627)
!711 = !DILocation(line: 483, column: 10, scope: !627)
!712 = !DILocation(line: 483, column: 23, scope: !627)
!713 = !DILocation(line: 484, column: 4, scope: !627)
!714 = !DILocation(line: 484, column: 10, scope: !627)
!715 = !DILocation(line: 484, column: 21, scope: !627)
!716 = !DILocation(line: 485, column: 4, scope: !627)
!717 = !DILocation(line: 485, column: 10, scope: !627)
!718 = !DILocation(line: 485, column: 21, scope: !627)
!719 = !DILocation(line: 486, column: 4, scope: !627)
!720 = !DILocation(line: 486, column: 10, scope: !627)
!721 = !DILocation(line: 486, column: 21, scope: !627)
!722 = !DILocation(line: 488, column: 4, scope: !627)
!723 = !DILocation(line: 488, column: 10, scope: !627)
!724 = !DILocation(line: 488, column: 15, scope: !627)
!725 = !DILocation(line: 498, column: 1, scope: !627)
!726 = distinct !DISubprogram(name: "HgfsPlatformInit", scope: !526, file: !526, line: 560, type: !727, isLocal: false, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!727 = !DISubroutineType(types: !728)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !511, line: 230, baseType: !520)
!730 = !DILocation(line: 562, column: 4, scope: !726)
!731 = distinct !DISubprogram(name: "HgfsPlatformDestroy", scope: !526, file: !526, line: 583, type: !732, isLocal: false, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!732 = !DISubroutineType(types: !733)
!733 = !{null}
!734 = !DILocation(line: 585, column: 1, scope: !731)
!735 = distinct !DISubprogram(name: "HgfsServerGetOpenMode", scope: !526, file: !526, line: 613, type: !736, isLocal: false, isDefinition: true, scopeLine: 615, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!736 = !DISubroutineType(types: !737)
!737 = !{!729, !738, !778}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileOpenInfo", file: !129, line: 438, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileOpenInfo", file: !129, line: 417, size: 960, align: 64, elements: !741)
!741 = !{!742, !743, !744, !746, !748, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !762, !763, !764, !765}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "requestType", scope: !740, file: !129, line: 418, baseType: !635, size: 32, align: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !740, file: !129, line: 419, baseType: !509, size: 32, align: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !740, file: !129, line: 420, baseType: !745, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenValid", file: !20, line: 408, baseType: !530)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !740, file: !129, line: 421, baseType: !747, size: 32, align: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenMode", file: !90, line: 125, baseType: !95)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !740, file: !129, line: 422, baseType: !749, size: 32, align: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpenFlags", file: !20, line: 200, baseType: !101)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "specialPerms", scope: !740, file: !129, line: 423, baseType: !646, size: 8, align: 8, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ownerPerms", scope: !740, file: !129, line: 424, baseType: !646, size: 8, align: 8, offset: 200)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "groupPerms", scope: !740, file: !129, line: 425, baseType: !646, size: 8, align: 8, offset: 208)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "otherPerms", scope: !740, file: !129, line: 426, baseType: !646, size: 8, align: 8, offset: 216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !740, file: !129, line: 427, baseType: !651, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "allocationSize", scope: !740, file: !129, line: 428, baseType: !530, size: 64, align: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "desiredAccess", scope: !740, file: !129, line: 429, baseType: !510, size: 32, align: 32, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !740, file: !129, line: 430, baseType: !510, size: 32, align: 32, offset: 416)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "desiredLock", scope: !740, file: !129, line: 431, baseType: !759, size: 32, align: 32, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsLockType", file: !20, line: 301, baseType: !108)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "acquiredLock", scope: !740, file: !129, line: 432, baseType: !759, size: 32, align: 32, offset: 480)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cpNameSize", scope: !740, file: !129, line: 433, baseType: !510, size: 32, align: 32, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cpName", scope: !740, file: !129, line: 434, baseType: !522, size: 64, align: 64, offset: 576)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Name", scope: !740, file: !129, line: 435, baseType: !519, size: 64, align: 64, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "caseFlags", scope: !740, file: !129, line: 436, baseType: !510, size: 32, align: 32, offset: 704)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !740, file: !129, line: 437, baseType: !766, size: 192, align: 64, offset: 768)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsShareInfo", file: !129, line: 163, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsShareInfo", file: !129, line: 145, size: 192, align: 64, elements: !768)
!768 = !{!769, !770, !773, !774, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rootDir", scope: !767, file: !129, line: 147, baseType: !522, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rootDirLen", scope: !767, file: !129, line: 150, baseType: !771, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !772, line: 216, baseType: !532)
!772 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!773 = !DIDerivedType(tag: DW_TAG_member, name: "readPermissions", scope: !767, file: !129, line: 153, baseType: !729, size: 8, align: 8, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "writePermissions", scope: !767, file: !129, line: 156, baseType: !729, size: 8, align: 8, offset: 136)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !767, file: !129, line: 162, baseType: !776, size: 32, align: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSharedFolderHandle", file: !777, line: 134, baseType: !510)
!777 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!779 = !DILocalVariable(name: "openInfo", arg: 1, scope: !735, file: !526, line: 613, type: !738)
!780 = !DILocation(line: 613, column: 41, scope: !735)
!781 = !DILocalVariable(name: "modeOut", arg: 2, scope: !735, file: !526, line: 614, type: !778)
!782 = !DILocation(line: 614, column: 31, scope: !735)
!783 = !DILocation(line: 623, column: 9, scope: !784)
!784 = distinct !DILexicalBlock(scope: !735, file: !526, line: 623, column: 8)
!785 = !DILocation(line: 623, column: 19, scope: !784)
!786 = !DILocation(line: 623, column: 24, scope: !784)
!787 = !DILocation(line: 623, column: 36, scope: !784)
!788 = !DILocation(line: 623, column: 8, scope: !735)
!789 = !DILocation(line: 624, column: 8, scope: !790)
!790 = distinct !DILexicalBlock(scope: !784, file: !526, line: 623, column: 42)
!791 = !DILocation(line: 624, column: 16, scope: !790)
!792 = !DILocation(line: 625, column: 7, scope: !790)
!793 = !DILocation(line: 628, column: 11, scope: !794)
!794 = distinct !DILexicalBlock(scope: !735, file: !526, line: 628, column: 8)
!795 = !DILocation(line: 628, column: 21, scope: !794)
!796 = !DILocation(line: 628, column: 26, scope: !794)
!797 = !DILocation(line: 628, column: 53, scope: !794)
!798 = !DILocation(line: 628, column: 81, scope: !794)
!799 = !DILocation(line: 628, column: 85, scope: !800)
!800 = !DILexicalBlockFile(scope: !794, file: !526, discriminator: 1)
!801 = !DILocation(line: 628, column: 95, scope: !800)
!802 = !DILocation(line: 628, column: 100, scope: !800)
!803 = !DILocation(line: 628, column: 127, scope: !800)
!804 = !DILocation(line: 628, column: 156, scope: !800)
!805 = !DILocation(line: 628, column: 160, scope: !806)
!806 = !DILexicalBlockFile(scope: !794, file: !526, discriminator: 2)
!807 = !DILocation(line: 628, column: 170, scope: !806)
!808 = !DILocation(line: 628, column: 175, scope: !806)
!809 = !DILocation(line: 628, column: 202, scope: !806)
!810 = !DILocation(line: 628, column: 8, scope: !806)
!811 = !DILocation(line: 629, column: 58, scope: !812)
!812 = distinct !DILexicalBlock(scope: !794, file: !526, line: 628, column: 233)
!813 = !DILocation(line: 629, column: 68, scope: !812)
!814 = !DILocation(line: 629, column: 7, scope: !812)
!815 = !DILocation(line: 631, column: 7, scope: !812)
!816 = !DILocation(line: 634, column: 35, scope: !735)
!817 = !DILocation(line: 634, column: 45, scope: !735)
!818 = !DILocation(line: 634, column: 50, scope: !735)
!819 = !DILocation(line: 634, column: 15, scope: !735)
!820 = !DILocation(line: 634, column: 5, scope: !735)
!821 = !DILocation(line: 634, column: 13, scope: !735)
!822 = !DILocation(line: 636, column: 4, scope: !735)
!823 = !DILocation(line: 637, column: 1, scope: !735)
!824 = distinct !DISubprogram(name: "HgfsPlatformCloseFile", scope: !526, file: !526, line: 658, type: !825, isLocal: false, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!825 = !DISubroutineType(types: !826)
!826 = !{!609, !827, !508}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "fileDesc", file: !129, line: 28, baseType: !550)
!828 = !DILocalVariable(name: "fileDesc", arg: 1, scope: !824, file: !526, line: 658, type: !827)
!829 = !DILocation(line: 658, column: 32, scope: !824)
!830 = !DILocalVariable(name: "fileCtx", arg: 2, scope: !824, file: !526, line: 659, type: !508)
!831 = !DILocation(line: 659, column: 29, scope: !824)
!832 = !DILocation(line: 661, column: 14, scope: !833)
!833 = distinct !DILexicalBlock(scope: !824, file: !526, line: 661, column: 8)
!834 = !DILocation(line: 661, column: 8, scope: !833)
!835 = !DILocation(line: 661, column: 24, scope: !833)
!836 = !DILocation(line: 661, column: 8, scope: !824)
!837 = !DILocalVariable(name: "error", scope: !838, file: !526, line: 662, type: !550)
!838 = distinct !DILexicalBlock(scope: !833, file: !526, line: 661, column: 30)
!839 = !DILocation(line: 662, column: 11, scope: !838)
!840 = !DILocation(line: 662, column: 20, scope: !838)
!841 = !DILocation(line: 662, column: 19, scope: !838)
!842 = !DILocation(line: 664, column: 7, scope: !838)
!843 = distinct !{!843, !842}
!844 = !DILocation(line: 664, column: 33, scope: !845)
!845 = !DILexicalBlockFile(scope: !846, file: !526, discriminator: 1)
!846 = distinct !DILexicalBlock(scope: !847, file: !526, line: 664, column: 31)
!847 = distinct !DILexicalBlock(scope: !848, file: !526, line: 664, column: 16)
!848 = distinct !DILexicalBlock(scope: !838, file: !526, line: 664, column: 10)
!849 = !DILocation(line: 664, column: 201, scope: !845)
!850 = !DILocation(line: 664, column: 228, scope: !845)
!851 = !DILocation(line: 664, column: 211, scope: !852)
!852 = !DILexicalBlockFile(scope: !845, file: !526, discriminator: 2)
!853 = !DILocation(line: 664, column: 112, scope: !854)
!854 = !DILexicalBlockFile(scope: !845, file: !526, discriminator: 3)
!855 = !DILocation(line: 664, column: 239, scope: !845)
!856 = !DILocation(line: 666, column: 14, scope: !838)
!857 = !DILocation(line: 666, column: 7, scope: !838)
!858 = !DILocation(line: 669, column: 4, scope: !824)
!859 = !DILocation(line: 670, column: 1, scope: !824)
!860 = distinct !DISubprogram(name: "HgfsPlatformGetFd", scope: !526, file: !526, line: 753, type: !861, isLocal: false, isDefinition: true, scopeLine: 757, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!861 = !DISubroutineType(types: !862)
!862 = !{!609, !509, !863, !729, !974}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionInfo", file: !129, line: 389, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSessionInfo", file: !129, line: 309, size: 5824, align: 64, elements: !866)
!866 = !{!867, !875, !876, !878, !879, !880, !884, !886, !891, !892, !899, !900, !926, !927, !928, !929, !930, !931, !932, !951, !952, !953, !963, !964}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !865, file: !129, line: 311, baseType: !868, size: 128, align: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "DblLnkLst_Links", file: !869, line: 94, baseType: !870)
!869 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dbllnklst.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DblLnkLst_Links", file: !869, line: 91, size: 128, align: 64, elements: !871)
!871 = !{!872, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !869, line: 92, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !869, line: 93, baseType: !873, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "isInactive", scope: !865, file: !129, line: 313, baseType: !729, size: 8, align: 8, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !865, file: !129, line: 316, baseType: !877, size: 32, align: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionFlags", file: !20, line: 1834, baseType: !510)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sessionId", scope: !865, file: !129, line: 319, baseType: !530, size: 64, align: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "maxPacketSize", scope: !865, file: !129, line: 322, baseType: !510, size: 32, align: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "transportSession", scope: !865, file: !129, line: 325, baseType: !881, size: 64, align: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsTransportSessionInfo", file: !129, line: 96, baseType: !883)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsTransportSessionInfo", file: !129, line: 96, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !865, file: !129, line: 328, baseType: !885, size: 32, align: 32, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSessionInfoState", file: !129, line: 300, baseType: !128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fileIOLock", scope: !865, file: !129, line: 331, baseType: !887, size: 64, align: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserExclLock", file: !889, line: 38, baseType: !890)
!889 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserExclLock", file: !889, line: 38, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "numInvalidationAttempts", scope: !865, file: !129, line: 333, baseType: !550, size: 32, align: 32, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !865, file: !129, line: 335, baseType: !893, size: 32, align: 32, offset: 544)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !894, line: 135, baseType: !895)
!894 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !894, line: 133, size: 32, align: 32, elements: !896)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !895, file: !894, line: 134, baseType: !898, size: 32, align: 32)
!898 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "nodeArrayLock", scope: !865, file: !129, line: 343, baseType: !887, size: 64, align: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nodeArray", scope: !865, file: !129, line: 346, baseType: !901, size: 64, align: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileNode", file: !129, line: 227, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileNode", file: !129, line: 177, size: 1024, align: 64, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !917, !918, !919, !920, !921, !923, !924, !925}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !903, file: !129, line: 179, baseType: !868, size: 128, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !903, file: !129, line: 182, baseType: !509, size: 32, align: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Name", scope: !903, file: !129, line: 185, baseType: !519, size: 64, align: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "utf8NameLen", scope: !903, file: !129, line: 188, baseType: !771, size: 64, align: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "shareName", scope: !903, file: !129, line: 191, baseType: !519, size: 64, align: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "shareNameLen", scope: !903, file: !129, line: 194, baseType: !771, size: 64, align: 64, offset: 384)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "localId", scope: !903, file: !129, line: 197, baseType: !912, size: 128, align: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsLocalId", file: !129, line: 102, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsLocalId", file: !129, line: 99, size: 128, align: 64, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "volumeId", scope: !913, file: !129, line: 100, baseType: !530, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fileId", scope: !913, file: !129, line: 101, baseType: !530, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fileDesc", scope: !903, file: !129, line: 200, baseType: !827, size: 32, align: 32, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !903, file: !129, line: 203, baseType: !510, size: 32, align: 32, offset: 608)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "shareAccess", scope: !903, file: !129, line: 206, baseType: !510, size: 32, align: 32, offset: 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "serverLock", scope: !903, file: !129, line: 209, baseType: !759, size: 32, align: 32, offset: 672)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !903, file: !129, line: 212, baseType: !922, size: 32, align: 32, offset: 704)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileNodeState", file: !129, line: 115, baseType: !133)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !129, line: 215, baseType: !510, size: 32, align: 32, offset: 736)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fileCtx", scope: !903, file: !129, line: 223, baseType: !508, size: 64, align: 64, offset: 768)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !903, file: !129, line: 226, baseType: !766, size: 192, align: 64, offset: 832)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "numNodes", scope: !865, file: !129, line: 349, baseType: !510, size: 32, align: 32, offset: 704)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nodeFreeList", scope: !865, file: !129, line: 352, baseType: !868, size: 128, align: 64, offset: 768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nodeCachedList", scope: !865, file: !129, line: 355, baseType: !868, size: 128, align: 64, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "numCachedOpenNodes", scope: !865, file: !129, line: 358, baseType: !514, size: 32, align: 32, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "numCachedLockedNodes", scope: !865, file: !129, line: 361, baseType: !514, size: 32, align: 32, offset: 1056)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "searchArrayLock", scope: !865, file: !129, line: 370, baseType: !887, size: 64, align: 64, offset: 1088)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "searchArray", scope: !865, file: !129, line: 373, baseType: !933, size: 64, align: 64, offset: 1152)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSearch", file: !129, line: 283, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsSearch", file: !129, line: 246, size: 768, align: 64, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !947, !948, !950}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !935, file: !129, line: 248, baseType: !868, size: 128, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !935, file: !129, line: 251, baseType: !510, size: 32, align: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !935, file: !129, line: 254, baseType: !509, size: 32, align: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "utf8Dir", scope: !935, file: !129, line: 257, baseType: !519, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "utf8DirLen", scope: !935, file: !129, line: 260, baseType: !771, size: 64, align: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "utf8ShareName", scope: !935, file: !129, line: 263, baseType: !519, size: 64, align: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "utf8ShareNameLen", scope: !935, file: !129, line: 266, baseType: !771, size: 64, align: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dents", scope: !935, file: !129, line: 269, baseType: !945, size: 64, align: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "numDents", scope: !935, file: !129, line: 272, baseType: !510, size: 32, align: 32, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !129, line: 279, baseType: !949, size: 32, align: 32, offset: 544)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectorySearchType", file: !129, line: 123, baseType: !138)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "shareInfo", scope: !935, file: !129, line: 282, baseType: !766, size: 192, align: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "numSearches", scope: !865, file: !129, line: 376, baseType: !510, size: 32, align: 32, offset: 1216)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "searchFreeList", scope: !865, file: !129, line: 379, baseType: !868, size: 128, align: 64, offset: 1280)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "hgfsSessionCapabilities", scope: !865, file: !129, line: 383, baseType: !954, size: 4160, align: 8, offset: 1408)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 4160, align: 8, elements: !961)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapability", file: !20, line: 1808, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsOpCapability", file: !20, line: 1803, size: 64, align: 8, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !956, file: !20, line: 1804, baseType: !635, size: 32, align: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !20, line: 1805, baseType: !960, size: 32, align: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOpCapFlags", file: !20, line: 1702, baseType: !510)
!961 = !{!962}
!962 = !DISubrange(count: 65)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "numberOfCapabilities", scope: !865, file: !129, line: 385, baseType: !510, size: 32, align: 32, offset: 5568)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "asyncRequestsInfo", scope: !865, file: !129, line: 388, baseType: !965, size: 192, align: 64, offset: 5632)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAsyncRequestInfo", file: !129, line: 307, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsAsyncRequestInfo", file: !129, line: 302, size: 192, align: 64, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "requestCount", scope: !966, file: !129, line: 304, baseType: !893, size: 32, align: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !966, file: !129, line: 305, baseType: !887, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "requestCountIsZero", scope: !966, file: !129, line: 306, baseType: !971, size: 64, align: 64, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserCondVar", file: !889, line: 42, baseType: !973)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserCondVar", file: !889, line: 42, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!975 = !DILocalVariable(name: "hgfsHandle", arg: 1, scope: !860, file: !526, line: 753, type: !509)
!976 = !DILocation(line: 753, column: 30, scope: !860)
!977 = !DILocalVariable(name: "session", arg: 2, scope: !860, file: !526, line: 754, type: !863)
!978 = !DILocation(line: 754, column: 36, scope: !860)
!979 = !DILocalVariable(name: "append", arg: 3, scope: !860, file: !526, line: 755, type: !729)
!980 = !DILocation(line: 755, column: 24, scope: !860)
!981 = !DILocalVariable(name: "fd", arg: 4, scope: !860, file: !526, line: 756, type: !974)
!982 = !DILocation(line: 756, column: 29, scope: !860)
!983 = !DILocalVariable(name: "newFd", scope: !860, file: !526, line: 758, type: !550)
!984 = !DILocation(line: 758, column: 8, scope: !860)
!985 = !DILocalVariable(name: "openFlags", scope: !860, file: !526, line: 758, type: !550)
!986 = !DILocation(line: 758, column: 20, scope: !860)
!987 = !DILocalVariable(name: "node", scope: !860, file: !526, line: 759, type: !902)
!988 = !DILocation(line: 759, column: 17, scope: !860)
!989 = !DILocalVariable(name: "status", scope: !860, file: !526, line: 760, type: !609)
!990 = !DILocation(line: 760, column: 23, scope: !860)
!991 = !DILocation(line: 775, column: 9, scope: !860)
!992 = !DILocation(line: 775, column: 18, scope: !860)
!993 = !DILocation(line: 776, column: 25, scope: !994)
!994 = distinct !DILexicalBlock(scope: !860, file: !526, line: 776, column: 8)
!995 = !DILocation(line: 776, column: 37, scope: !994)
!996 = !DILocation(line: 776, column: 9, scope: !994)
!997 = !DILocation(line: 776, column: 8, scope: !860)
!998 = !DILocation(line: 778, column: 7, scope: !999)
!999 = distinct !DILexicalBlock(scope: !994, file: !526, line: 776, column: 57)
!1000 = distinct !{!1000, !998}
!1001 = !DILocation(line: 778, column: 33, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !1003, file: !526, discriminator: 1)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !526, line: 778, column: 31)
!1004 = distinct !DILexicalBlock(scope: !1005, file: !526, line: 778, column: 16)
!1005 = distinct !DILexicalBlock(scope: !999, file: !526, line: 778, column: 10)
!1006 = !DILocation(line: 778, column: 112, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1002, file: !526, discriminator: 2)
!1008 = !DILocation(line: 778, column: 199, scope: !1002)
!1009 = !DILocation(line: 779, column: 14, scope: !999)
!1010 = !DILocation(line: 780, column: 7, scope: !999)
!1011 = !DILocation(line: 784, column: 21, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !860, file: !526, line: 784, column: 8)
!1013 = !DILocation(line: 784, column: 33, scope: !1012)
!1014 = !DILocation(line: 784, column: 8, scope: !1012)
!1015 = !DILocation(line: 784, column: 8, scope: !860)
!1016 = !DILocation(line: 790, column: 11, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !526, line: 790, column: 11)
!1018 = distinct !DILexicalBlock(scope: !1012, file: !526, line: 784, column: 43)
!1019 = !DILocation(line: 790, column: 18, scope: !1017)
!1020 = !DILocation(line: 790, column: 28, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !1017, file: !526, discriminator: 1)
!1022 = !DILocation(line: 790, column: 34, scope: !1021)
!1023 = !DILocation(line: 790, column: 11, scope: !1021)
!1024 = !DILocation(line: 791, column: 46, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1017, file: !526, line: 790, column: 47)
!1026 = !DILocation(line: 791, column: 61, scope: !1025)
!1027 = !DILocation(line: 791, column: 19, scope: !1025)
!1028 = !DILocation(line: 791, column: 17, scope: !1025)
!1029 = !DILocation(line: 792, column: 14, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1025, file: !526, line: 792, column: 14)
!1031 = !DILocation(line: 792, column: 21, scope: !1030)
!1032 = !DILocation(line: 792, column: 14, scope: !1025)
!1033 = !DILocation(line: 793, column: 13, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !526, line: 792, column: 27)
!1035 = distinct !{!1035, !1033}
!1036 = !DILocation(line: 793, column: 39, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1038, file: !526, discriminator: 1)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !526, line: 793, column: 37)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !526, line: 793, column: 22)
!1040 = distinct !DILexicalBlock(scope: !1034, file: !526, line: 793, column: 16)
!1041 = !DILocation(line: 793, column: 227, scope: !1037)
!1042 = !DILocation(line: 793, column: 118, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1037, file: !526, discriminator: 2)
!1044 = !DILocation(line: 793, column: 240, scope: !1037)
!1045 = !DILocation(line: 795, column: 13, scope: !1034)
!1046 = !DILocation(line: 802, column: 40, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1025, file: !526, line: 802, column: 14)
!1048 = !DILocation(line: 802, column: 52, scope: !1047)
!1049 = !DILocation(line: 802, column: 15, scope: !1047)
!1050 = !DILocation(line: 802, column: 14, scope: !1025)
!1051 = !DILocation(line: 803, column: 13, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !526, line: 802, column: 65)
!1053 = distinct !{!1053, !1051}
!1054 = !DILocation(line: 803, column: 39, scope: !1055)
!1055 = !DILexicalBlockFile(scope: !1056, file: !526, discriminator: 1)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !526, line: 803, column: 37)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !526, line: 803, column: 22)
!1058 = distinct !DILexicalBlock(scope: !1052, file: !526, line: 803, column: 16)
!1059 = !DILocation(line: 803, column: 118, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1055, file: !526, discriminator: 2)
!1061 = !DILocation(line: 803, column: 223, scope: !1055)
!1062 = !DILocation(line: 805, column: 20, scope: !1052)
!1063 = !DILocation(line: 806, column: 13, scope: !1052)
!1064 = !DILocation(line: 808, column: 7, scope: !1025)
!1065 = !DILocation(line: 809, column: 23, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1017, file: !526, line: 808, column: 14)
!1067 = !DILocation(line: 809, column: 16, scope: !1066)
!1068 = !DILocation(line: 810, column: 10, scope: !1066)
!1069 = !DILocation(line: 812, column: 4, scope: !1018)
!1070 = !DILocation(line: 819, column: 36, scope: !860)
!1071 = !DILocation(line: 819, column: 52, scope: !860)
!1072 = !DILocation(line: 819, column: 13, scope: !860)
!1073 = !DILocation(line: 819, column: 11, scope: !860)
!1074 = !DILocation(line: 820, column: 8, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !860, file: !526, line: 820, column: 8)
!1076 = !DILocation(line: 820, column: 15, scope: !1075)
!1077 = !DILocation(line: 820, column: 8, scope: !860)
!1078 = !DILocation(line: 821, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1075, file: !526, line: 820, column: 21)
!1080 = !DILocation(line: 828, column: 4, scope: !860)
!1081 = !DILocation(line: 836, column: 28, scope: !860)
!1082 = !DILocation(line: 837, column: 8, scope: !860)
!1083 = !DILocation(line: 837, column: 15, scope: !860)
!1084 = !DILocation(line: 837, column: 13, scope: !860)
!1085 = !DILocation(line: 837, column: 28, scope: !860)
!1086 = !DILocation(line: 837, column: 25, scope: !860)
!1087 = !DILocation(line: 836, column: 12, scope: !860)
!1088 = !DILocation(line: 836, column: 10, scope: !860)
!1089 = !DILocation(line: 839, column: 8, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !860, file: !526, line: 839, column: 8)
!1091 = !DILocation(line: 839, column: 14, scope: !1090)
!1092 = !DILocation(line: 839, column: 8, scope: !860)
!1093 = !DILocalVariable(name: "error", scope: !1094, file: !526, line: 840, type: !550)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !526, line: 839, column: 19)
!1095 = !DILocation(line: 840, column: 11, scope: !1094)
!1096 = !DILocation(line: 840, column: 20, scope: !1094)
!1097 = !DILocation(line: 840, column: 19, scope: !1094)
!1098 = !DILocation(line: 842, column: 7, scope: !1094)
!1099 = distinct !{!1099, !1098}
!1100 = !DILocation(line: 842, column: 33, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1102, file: !526, discriminator: 1)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !526, line: 842, column: 31)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !526, line: 842, column: 16)
!1104 = distinct !DILexicalBlock(scope: !1094, file: !526, line: 842, column: 10)
!1105 = !DILocation(line: 842, column: 210, scope: !1101)
!1106 = !DILocation(line: 842, column: 8, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1101, file: !526, discriminator: 2)
!1108 = !DILocation(line: 842, column: 7, scope: !1101)
!1109 = !DILocation(line: 842, column: 220, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1101, file: !526, discriminator: 3)
!1111 = !DILocation(line: 842, column: 112, scope: !1112)
!1112 = !DILexicalBlockFile(scope: !1101, file: !526, discriminator: 4)
!1113 = !DILocation(line: 842, column: 12, scope: !1101)
!1114 = !DILocation(line: 844, column: 16, scope: !1094)
!1115 = !DILocation(line: 844, column: 14, scope: !1094)
!1116 = !DILocation(line: 845, column: 7, scope: !1094)
!1117 = !DILocation(line: 852, column: 32, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !860, file: !526, line: 852, column: 8)
!1119 = !DILocation(line: 852, column: 44, scope: !1118)
!1120 = !DILocation(line: 852, column: 53, scope: !1118)
!1121 = !DILocation(line: 852, column: 9, scope: !1118)
!1122 = !DILocation(line: 852, column: 8, scope: !860)
!1123 = !DILocation(line: 853, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1118, file: !526, line: 852, column: 66)
!1125 = distinct !{!1125, !1123}
!1126 = !DILocation(line: 853, column: 33, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1128, file: !526, discriminator: 1)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !526, line: 853, column: 31)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !526, line: 853, column: 16)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !526, line: 853, column: 10)
!1131 = !DILocation(line: 853, column: 112, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1127, file: !526, discriminator: 2)
!1133 = !DILocation(line: 853, column: 225, scope: !1127)
!1134 = !DILocation(line: 855, column: 14, scope: !1124)
!1135 = !DILocation(line: 856, column: 7, scope: !1124)
!1136 = !DILocation(line: 860, column: 24, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !860, file: !526, line: 860, column: 8)
!1138 = !DILocation(line: 860, column: 36, scope: !1137)
!1139 = !DILocation(line: 860, column: 9, scope: !1137)
!1140 = !DILocation(line: 860, column: 8, scope: !860)
!1141 = !DILocation(line: 861, column: 7, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1137, file: !526, line: 860, column: 46)
!1143 = distinct !{!1143, !1141}
!1144 = !DILocation(line: 861, column: 33, scope: !1145)
!1145 = !DILexicalBlockFile(scope: !1146, file: !526, discriminator: 1)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !526, line: 861, column: 31)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !526, line: 861, column: 16)
!1148 = distinct !DILexicalBlock(scope: !1142, file: !526, line: 861, column: 10)
!1149 = !DILocation(line: 861, column: 112, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1145, file: !526, discriminator: 2)
!1151 = !DILocation(line: 861, column: 210, scope: !1145)
!1152 = !DILocation(line: 862, column: 14, scope: !1142)
!1153 = !DILocation(line: 863, column: 7, scope: !1142)
!1154 = !DILocation(line: 860, column: 43, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1137, file: !526, discriminator: 1)
!1156 = !DILocation(line: 867, column: 8, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !860, file: !526, line: 867, column: 8)
!1158 = !DILocation(line: 867, column: 15, scope: !1157)
!1159 = !DILocation(line: 867, column: 8, scope: !860)
!1160 = !DILocation(line: 868, column: 13, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1157, file: !526, line: 867, column: 21)
!1162 = !DILocation(line: 868, column: 8, scope: !1161)
!1163 = !DILocation(line: 868, column: 11, scope: !1161)
!1164 = !DILocation(line: 869, column: 4, scope: !1161)
!1165 = !DILocation(line: 870, column: 14, scope: !860)
!1166 = !DILocation(line: 870, column: 4, scope: !860)
!1167 = !DILocation(line: 871, column: 11, scope: !860)
!1168 = !DILocation(line: 871, column: 4, scope: !860)
!1169 = distinct !DISubprogram(name: "HgfsCheckFileNode", scope: !526, file: !526, line: 692, type: !1170, isLocal: true, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!609, !522, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!1174 = !DILocalVariable(name: "localName", arg: 1, scope: !1169, file: !526, line: 692, type: !522)
!1175 = !DILocation(line: 692, column: 31, scope: !1169)
!1176 = !DILocalVariable(name: "localId", arg: 2, scope: !1169, file: !526, line: 693, type: !1172)
!1177 = !DILocation(line: 693, column: 38, scope: !1169)
!1178 = !DILocalVariable(name: "nodeStat", scope: !1169, file: !526, line: 695, type: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1180, line: 46, size: 1152, align: 64, elements: !1181)
!1180 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!1181 = !{!1182, !1184, !1186, !1188, !1190, !1191, !1193, !1194, !1195, !1197, !1199, !1201, !1208, !1209, !1210}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1179, file: !1180, line: 48, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !518, line: 124, baseType: !532)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1179, file: !1180, line: 53, baseType: !1185, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !518, line: 127, baseType: !532)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1179, file: !1180, line: 61, baseType: !1187, size: 64, align: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !518, line: 130, baseType: !532)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1179, file: !1180, line: 62, baseType: !1189, size: 32, align: 32, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !518, line: 129, baseType: !514)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1179, file: !1180, line: 64, baseType: !517, size: 32, align: 32, offset: 224)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1179, file: !1180, line: 65, baseType: !1192, size: 32, align: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !518, line: 126, baseType: !514)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1179, file: !1180, line: 67, baseType: !550, size: 32, align: 32, offset: 288)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1179, file: !1180, line: 69, baseType: !1183, size: 64, align: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1179, file: !1180, line: 74, baseType: !1196, size: 64, align: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !518, line: 131, baseType: !570)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1179, file: !1180, line: 78, baseType: !1198, size: 64, align: 64, offset: 448)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !518, line: 153, baseType: !570)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1179, file: !1180, line: 80, baseType: !1200, size: 64, align: 64, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !518, line: 158, baseType: !570)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1179, file: !1180, line: 91, baseType: !1202, size: 128, align: 64, offset: 576)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1203, line: 120, size: 128, align: 64, elements: !1204)
!1203 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line381")
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1202, file: !1203, line: 122, baseType: !569, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1202, file: !1203, line: 123, baseType: !1207, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !518, line: 175, baseType: !570)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1179, file: !1180, line: 92, baseType: !1202, size: 128, align: 64, offset: 704)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1179, file: !1180, line: 93, baseType: !1202, size: 128, align: 64, offset: 832)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1179, file: !1180, line: 106, baseType: !1211, size: 192, align: 64, offset: 960)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1207, size: 192, align: 64, elements: !551)
!1212 = !DILocation(line: 695, column: 16, scope: !1169)
!1213 = !DILocation(line: 712, column: 19, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1169, file: !526, line: 712, column: 8)
!1215 = !DILocation(line: 712, column: 8, scope: !1214)
!1216 = !DILocation(line: 712, column: 41, scope: !1214)
!1217 = !DILocation(line: 712, column: 8, scope: !1169)
!1218 = !DILocalVariable(name: "error", scope: !1219, file: !526, line: 714, type: !550)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !526, line: 712, column: 46)
!1220 = !DILocation(line: 714, column: 11, scope: !1219)
!1221 = !DILocation(line: 714, column: 20, scope: !1219)
!1222 = !DILocation(line: 714, column: 19, scope: !1219)
!1223 = !DILocation(line: 716, column: 7, scope: !1219)
!1224 = distinct !{!1224, !1223}
!1225 = !DILocation(line: 716, column: 33, scope: !1226)
!1226 = !DILexicalBlockFile(scope: !1227, file: !526, discriminator: 1)
!1227 = distinct !DILexicalBlock(scope: !1228, file: !526, line: 716, column: 31)
!1228 = distinct !DILexicalBlock(scope: !1229, file: !526, line: 716, column: 16)
!1229 = distinct !DILexicalBlock(scope: !1219, file: !526, line: 716, column: 10)
!1230 = !DILocation(line: 716, column: 211, scope: !1226)
!1231 = !DILocation(line: 716, column: 239, scope: !1226)
!1232 = !DILocation(line: 716, column: 222, scope: !1233)
!1233 = !DILexicalBlockFile(scope: !1226, file: !526, discriminator: 2)
!1234 = !DILocation(line: 716, column: 112, scope: !1235)
!1235 = !DILexicalBlockFile(scope: !1226, file: !526, discriminator: 3)
!1236 = !DILocation(line: 716, column: 250, scope: !1226)
!1237 = !DILocation(line: 718, column: 14, scope: !1219)
!1238 = !DILocation(line: 718, column: 7, scope: !1219)
!1239 = !DILocation(line: 721, column: 17, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1169, file: !526, line: 721, column: 8)
!1241 = !DILocation(line: 721, column: 27, scope: !1240)
!1242 = !DILocation(line: 721, column: 36, scope: !1240)
!1243 = !DILocation(line: 721, column: 24, scope: !1240)
!1244 = !DILocation(line: 721, column: 45, scope: !1240)
!1245 = !DILocation(line: 722, column: 17, scope: !1240)
!1246 = !DILocation(line: 722, column: 27, scope: !1240)
!1247 = !DILocation(line: 722, column: 36, scope: !1240)
!1248 = !DILocation(line: 722, column: 24, scope: !1240)
!1249 = !DILocation(line: 721, column: 8, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1169, file: !526, discriminator: 1)
!1251 = !DILocation(line: 723, column: 7, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1240, file: !526, line: 722, column: 44)
!1253 = distinct !{!1253, !1251}
!1254 = !DILocation(line: 723, column: 33, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1256, file: !526, discriminator: 1)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !526, line: 723, column: 31)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !526, line: 723, column: 16)
!1258 = distinct !DILexicalBlock(scope: !1252, file: !526, line: 723, column: 10)
!1259 = !DILocation(line: 723, column: 112, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1255, file: !526, discriminator: 2)
!1261 = !DILocation(line: 723, column: 196, scope: !1255)
!1262 = !DILocation(line: 725, column: 7, scope: !1252)
!1263 = !DILocation(line: 728, column: 4, scope: !1169)
!1264 = !DILocation(line: 729, column: 1, scope: !1169)
!1265 = distinct !DISubprogram(name: "HgfsServerGetOpenFlags", scope: !526, file: !526, line: 522, type: !1266, isLocal: true, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!729, !749, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!1269 = !DILocalVariable(name: "flagsIn", arg: 1, scope: !1265, file: !526, line: 522, type: !749)
!1270 = !DILocation(line: 522, column: 38, scope: !1265)
!1271 = !DILocalVariable(name: "flagsOut", arg: 2, scope: !1265, file: !526, line: 523, type: !1268)
!1272 = !DILocation(line: 523, column: 29, scope: !1265)
!1273 = !DILocalVariable(name: "arraySize", scope: !1265, file: !526, line: 525, type: !514)
!1274 = !DILocation(line: 525, column: 17, scope: !1265)
!1275 = !DILocation(line: 529, column: 14, scope: !1265)
!1276 = !DILocation(line: 531, column: 22, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1265, file: !526, line: 531, column: 8)
!1278 = !DILocation(line: 531, column: 33, scope: !1277)
!1279 = !DILocation(line: 531, column: 30, scope: !1277)
!1280 = !DILocation(line: 531, column: 8, scope: !1265)
!1281 = !DILocation(line: 532, column: 59, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1277, file: !526, line: 531, column: 44)
!1283 = !DILocation(line: 532, column: 7, scope: !1282)
!1284 = !DILocation(line: 534, column: 7, scope: !1282)
!1285 = !DILocation(line: 537, column: 36, scope: !1265)
!1286 = !DILocation(line: 537, column: 16, scope: !1265)
!1287 = !DILocation(line: 537, column: 5, scope: !1265)
!1288 = !DILocation(line: 537, column: 14, scope: !1265)
!1289 = !DILocation(line: 539, column: 4, scope: !1265)
!1290 = !DILocation(line: 540, column: 1, scope: !1265)
!1291 = distinct !DISubprogram(name: "HgfsPlatformValidateOpen", scope: !526, file: !526, line: 897, type: !1292, isLocal: false, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!609, !738, !729, !863, !1294, !974}
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1295 = !DILocalVariable(name: "openInfo", arg: 1, scope: !1291, file: !526, line: 897, type: !738)
!1296 = !DILocation(line: 897, column: 44, scope: !1291)
!1297 = !DILocalVariable(name: "followSymlinks", arg: 2, scope: !1291, file: !526, line: 898, type: !729)
!1298 = !DILocation(line: 898, column: 31, scope: !1291)
!1299 = !DILocalVariable(name: "session", arg: 3, scope: !1291, file: !526, line: 899, type: !863)
!1300 = !DILocation(line: 899, column: 43, scope: !1291)
!1301 = !DILocalVariable(name: "localId", arg: 4, scope: !1291, file: !526, line: 900, type: !1294)
!1302 = !DILocation(line: 900, column: 39, scope: !1291)
!1303 = !DILocalVariable(name: "fileDesc", arg: 5, scope: !1291, file: !526, line: 901, type: !974)
!1304 = !DILocation(line: 901, column: 36, scope: !1291)
!1305 = !DILocalVariable(name: "fileStat", scope: !1291, file: !526, line: 903, type: !1179)
!1306 = !DILocation(line: 903, column: 16, scope: !1291)
!1307 = !DILocalVariable(name: "fd", scope: !1291, file: !526, line: 904, type: !550)
!1308 = !DILocation(line: 904, column: 8, scope: !1291)
!1309 = !DILocalVariable(name: "openMode", scope: !1291, file: !526, line: 905, type: !550)
!1310 = !DILocation(line: 905, column: 8, scope: !1291)
!1311 = !DILocalVariable(name: "openFlags", scope: !1291, file: !526, line: 905, type: !550)
!1312 = !DILocation(line: 905, column: 22, scope: !1291)
!1313 = !DILocalVariable(name: "openPerms", scope: !1291, file: !526, line: 906, type: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !516, line: 70, baseType: !1189)
!1315 = !DILocation(line: 906, column: 11, scope: !1291)
!1316 = !DILocalVariable(name: "serverLock", scope: !1291, file: !526, line: 907, type: !759)
!1317 = !DILocation(line: 907, column: 17, scope: !1291)
!1318 = !DILocalVariable(name: "status", scope: !1291, file: !526, line: 908, type: !609)
!1319 = !DILocation(line: 908, column: 23, scope: !1291)
!1320 = !DILocalVariable(name: "needToSetAttribute", scope: !1291, file: !526, line: 909, type: !729)
!1321 = !DILocation(line: 909, column: 9, scope: !1291)
!1322 = !DILocation(line: 920, column: 32, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 920, column: 8)
!1324 = !DILocation(line: 920, column: 42, scope: !1323)
!1325 = !DILocation(line: 920, column: 47, scope: !1323)
!1326 = !DILocation(line: 921, column: 34, scope: !1323)
!1327 = !DILocation(line: 921, column: 44, scope: !1323)
!1328 = !DILocation(line: 920, column: 32, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1323, file: !526, discriminator: 1)
!1330 = !DILocation(line: 920, column: 32, scope: !1331)
!1331 = !DILexicalBlockFile(scope: !1323, file: !526, discriminator: 2)
!1332 = !DILocation(line: 920, column: 32, scope: !1333)
!1333 = !DILexicalBlockFile(scope: !1323, file: !526, discriminator: 3)
!1334 = !DILocation(line: 920, column: 9, scope: !1333)
!1335 = !DILocation(line: 922, column: 44, scope: !1323)
!1336 = !DILocation(line: 923, column: 31, scope: !1323)
!1337 = !DILocation(line: 923, column: 9, scope: !1323)
!1338 = !DILocation(line: 920, column: 8, scope: !1339)
!1339 = !DILexicalBlockFile(scope: !1291, file: !526, discriminator: 4)
!1340 = !DILocation(line: 924, column: 14, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1323, file: !526, line: 923, column: 53)
!1342 = !DILocation(line: 925, column: 7, scope: !1341)
!1343 = !DILocation(line: 938, column: 14, scope: !1291)
!1344 = !DILocation(line: 939, column: 17, scope: !1291)
!1345 = !DILocation(line: 939, column: 27, scope: !1291)
!1346 = !DILocation(line: 939, column: 32, scope: !1291)
!1347 = !DILocation(line: 940, column: 19, scope: !1291)
!1348 = !DILocation(line: 940, column: 29, scope: !1291)
!1349 = !DILocation(line: 940, column: 42, scope: !1291)
!1350 = !DILocation(line: 939, column: 17, scope: !1351)
!1351 = !DILexicalBlockFile(scope: !1291, file: !526, discriminator: 1)
!1352 = !DILocation(line: 939, column: 17, scope: !1353)
!1353 = !DILexicalBlockFile(scope: !1291, file: !526, discriminator: 2)
!1354 = !DILocation(line: 939, column: 17, scope: !1355)
!1355 = !DILexicalBlockFile(scope: !1291, file: !526, discriminator: 3)
!1356 = !DILocation(line: 939, column: 14, scope: !1355)
!1357 = !DILocation(line: 941, column: 17, scope: !1291)
!1358 = !DILocation(line: 941, column: 27, scope: !1291)
!1359 = !DILocation(line: 941, column: 32, scope: !1291)
!1360 = !DILocation(line: 942, column: 19, scope: !1291)
!1361 = !DILocation(line: 942, column: 29, scope: !1291)
!1362 = !DILocation(line: 942, column: 40, scope: !1291)
!1363 = !DILocation(line: 941, column: 17, scope: !1351)
!1364 = !DILocation(line: 941, column: 17, scope: !1353)
!1365 = !DILocation(line: 941, column: 17, scope: !1355)
!1366 = !DILocation(line: 941, column: 14, scope: !1355)
!1367 = !DILocation(line: 943, column: 17, scope: !1291)
!1368 = !DILocation(line: 943, column: 27, scope: !1291)
!1369 = !DILocation(line: 943, column: 32, scope: !1291)
!1370 = !DILocation(line: 944, column: 19, scope: !1291)
!1371 = !DILocation(line: 944, column: 29, scope: !1291)
!1372 = !DILocation(line: 944, column: 40, scope: !1291)
!1373 = !DILocation(line: 943, column: 17, scope: !1351)
!1374 = !DILocation(line: 944, column: 48, scope: !1351)
!1375 = !DILocation(line: 944, column: 58, scope: !1351)
!1376 = !DILocation(line: 944, column: 68, scope: !1351)
!1377 = !DILocation(line: 943, column: 17, scope: !1353)
!1378 = !DILocation(line: 943, column: 17, scope: !1355)
!1379 = !DILocation(line: 943, column: 14, scope: !1355)
!1380 = !DILocation(line: 945, column: 17, scope: !1291)
!1381 = !DILocation(line: 945, column: 27, scope: !1291)
!1382 = !DILocation(line: 945, column: 32, scope: !1291)
!1383 = !DILocation(line: 946, column: 19, scope: !1291)
!1384 = !DILocation(line: 946, column: 29, scope: !1291)
!1385 = !DILocation(line: 945, column: 17, scope: !1351)
!1386 = !DILocation(line: 946, column: 43, scope: !1351)
!1387 = !DILocation(line: 946, column: 53, scope: !1351)
!1388 = !DILocation(line: 946, column: 63, scope: !1351)
!1389 = !DILocation(line: 945, column: 17, scope: !1353)
!1390 = !DILocation(line: 945, column: 17, scope: !1355)
!1391 = !DILocation(line: 945, column: 14, scope: !1355)
!1392 = !DILocation(line: 952, column: 8, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 952, column: 8)
!1394 = !DILocation(line: 952, column: 8, scope: !1291)
!1395 = !DILocation(line: 953, column: 17, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1393, file: !526, line: 952, column: 24)
!1397 = !DILocation(line: 954, column: 4, scope: !1396)
!1398 = !DILocation(line: 960, column: 11, scope: !1291)
!1399 = !DILocation(line: 961, column: 9, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 961, column: 8)
!1401 = !DILocation(line: 961, column: 19, scope: !1400)
!1402 = !DILocation(line: 961, column: 29, scope: !1400)
!1403 = !DILocation(line: 961, column: 8, scope: !1291)
!1404 = !DILocalVariable(name: "deleteAccess", scope: !1405, file: !526, line: 962, type: !729)
!1405 = distinct !DILexicalBlock(scope: !1400, file: !526, line: 961, column: 47)
!1406 = !DILocation(line: 962, column: 12, scope: !1405)
!1407 = !DILocation(line: 968, column: 18, scope: !1408)
!1408 = distinct !DILexicalBlock(scope: !1405, file: !526, line: 968, column: 11)
!1409 = !DILocation(line: 968, column: 28, scope: !1408)
!1410 = !DILocation(line: 968, column: 33, scope: !1408)
!1411 = !DILocation(line: 968, column: 14, scope: !1408)
!1412 = !DILocation(line: 968, column: 46, scope: !1408)
!1413 = !DILocation(line: 969, column: 18, scope: !1408)
!1414 = !DILocation(line: 969, column: 28, scope: !1408)
!1415 = !DILocation(line: 969, column: 42, scope: !1408)
!1416 = !DILocation(line: 969, column: 14, scope: !1408)
!1417 = !DILocation(line: 968, column: 11, scope: !1418)
!1418 = !DILexicalBlockFile(scope: !1405, file: !526, discriminator: 1)
!1419 = !DILocation(line: 970, column: 23, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1408, file: !526, line: 969, column: 61)
!1421 = !DILocation(line: 971, column: 7, scope: !1420)
!1422 = !DILocation(line: 973, column: 12, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1405, file: !526, line: 973, column: 11)
!1424 = !DILocation(line: 973, column: 22, scope: !1423)
!1425 = !DILocation(line: 973, column: 55, scope: !1423)
!1426 = !DILocation(line: 974, column: 12, scope: !1423)
!1427 = !DILocation(line: 974, column: 21, scope: !1423)
!1428 = !DILocation(line: 974, column: 43, scope: !1423)
!1429 = !DILocation(line: 975, column: 11, scope: !1423)
!1430 = !DILocation(line: 973, column: 11, scope: !1418)
!1431 = !DILocation(line: 976, column: 32, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1423, file: !526, line: 975, column: 25)
!1433 = !DILocation(line: 976, column: 42, scope: !1432)
!1434 = !DILocation(line: 976, column: 19, scope: !1432)
!1435 = !DILocation(line: 976, column: 17, scope: !1432)
!1436 = !DILocation(line: 977, column: 14, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !1432, file: !526, line: 977, column: 14)
!1438 = !DILocation(line: 977, column: 21, scope: !1437)
!1439 = !DILocation(line: 977, column: 14, scope: !1432)
!1440 = !DILocation(line: 978, column: 23, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1437, file: !526, line: 977, column: 26)
!1442 = !DILocation(line: 978, column: 22, scope: !1441)
!1443 = !DILocation(line: 978, column: 20, scope: !1441)
!1444 = !DILocation(line: 979, column: 17, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1441, file: !526, line: 979, column: 17)
!1446 = !DILocation(line: 979, column: 24, scope: !1445)
!1447 = !DILocation(line: 979, column: 33, scope: !1445)
!1448 = !DILocation(line: 979, column: 37, scope: !1449)
!1449 = !DILexicalBlockFile(scope: !1445, file: !526, discriminator: 1)
!1450 = !DILocation(line: 979, column: 47, scope: !1449)
!1451 = !DILocation(line: 979, column: 58, scope: !1449)
!1452 = !DILocation(line: 979, column: 17, scope: !1449)
!1453 = !DILocation(line: 980, column: 23, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1445, file: !526, line: 979, column: 64)
!1455 = !DILocation(line: 981, column: 13, scope: !1454)
!1456 = !DILocation(line: 982, column: 10, scope: !1441)
!1457 = !DILocation(line: 988, column: 18, scope: !1458)
!1458 = distinct !DILexicalBlock(scope: !1459, file: !526, line: 988, column: 17)
!1459 = distinct !DILexicalBlock(scope: !1437, file: !526, line: 982, column: 17)
!1460 = !DILocation(line: 988, column: 28, scope: !1458)
!1461 = !DILocation(line: 988, column: 38, scope: !1458)
!1462 = !DILocation(line: 988, column: 42, scope: !1463)
!1463 = !DILexicalBlockFile(scope: !1458, file: !526, discriminator: 1)
!1464 = !DILocation(line: 988, column: 52, scope: !1463)
!1465 = !DILocation(line: 988, column: 17, scope: !1463)
!1466 = !DILocation(line: 989, column: 23, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1458, file: !526, line: 988, column: 63)
!1468 = !DILocation(line: 990, column: 13, scope: !1467)
!1469 = !DILocation(line: 991, column: 23, scope: !1470)
!1470 = distinct !DILexicalBlock(scope: !1458, file: !526, line: 990, column: 20)
!1471 = !DILocation(line: 994, column: 7, scope: !1432)
!1472 = !DILocation(line: 995, column: 11, scope: !1473)
!1473 = distinct !DILexicalBlock(scope: !1405, file: !526, line: 995, column: 11)
!1474 = !DILocation(line: 995, column: 18, scope: !1473)
!1475 = !DILocation(line: 995, column: 11, scope: !1405)
!1476 = !DILocation(line: 996, column: 10, scope: !1477)
!1477 = distinct !DILexicalBlock(scope: !1473, file: !526, line: 995, column: 24)
!1478 = distinct !{!1478, !1476}
!1479 = !DILocation(line: 996, column: 36, scope: !1480)
!1480 = !DILexicalBlockFile(scope: !1481, file: !526, discriminator: 1)
!1481 = distinct !DILexicalBlock(scope: !1482, file: !526, line: 996, column: 34)
!1482 = distinct !DILexicalBlock(scope: !1483, file: !526, line: 996, column: 19)
!1483 = distinct !DILexicalBlock(scope: !1477, file: !526, line: 996, column: 13)
!1484 = !DILocation(line: 996, column: 238, scope: !1480)
!1485 = !DILocation(line: 996, column: 248, scope: !1480)
!1486 = !DILocation(line: 996, column: 259, scope: !1480)
!1487 = !DILocation(line: 996, column: 269, scope: !1480)
!1488 = !DILocation(line: 996, column: 279, scope: !1480)
!1489 = !DILocation(line: 996, column: 304, scope: !1480)
!1490 = !DILocation(line: 996, column: 287, scope: !1491)
!1491 = !DILexicalBlockFile(scope: !1480, file: !526, discriminator: 2)
!1492 = !DILocation(line: 996, column: 115, scope: !1493)
!1493 = !DILexicalBlockFile(scope: !1480, file: !526, discriminator: 3)
!1494 = !DILocation(line: 996, column: 316, scope: !1480)
!1495 = !DILocation(line: 999, column: 10, scope: !1477)
!1496 = !DILocation(line: 1001, column: 4, scope: !1405)
!1497 = !DILocation(line: 1003, column: 9, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1003, column: 8)
!1499 = !DILocation(line: 1003, column: 19, scope: !1498)
!1500 = !DILocation(line: 1003, column: 29, scope: !1498)
!1501 = !DILocation(line: 1003, column: 8, scope: !1291)
!1502 = !DILocation(line: 1008, column: 29, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1498, file: !526, line: 1003, column: 46)
!1504 = !DILocation(line: 1008, column: 39, scope: !1503)
!1505 = !DILocation(line: 1008, column: 16, scope: !1503)
!1506 = !DILocation(line: 1008, column: 14, scope: !1503)
!1507 = !DILocation(line: 1009, column: 11, scope: !1508)
!1508 = distinct !DILexicalBlock(scope: !1503, file: !526, line: 1009, column: 11)
!1509 = !DILocation(line: 1009, column: 18, scope: !1508)
!1510 = !DILocation(line: 1009, column: 11, scope: !1503)
!1511 = !DILocation(line: 1010, column: 20, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1508, file: !526, line: 1009, column: 23)
!1513 = !DILocation(line: 1010, column: 19, scope: !1512)
!1514 = !DILocation(line: 1010, column: 17, scope: !1512)
!1515 = !DILocation(line: 1011, column: 14, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1512, file: !526, line: 1011, column: 14)
!1517 = !DILocation(line: 1011, column: 21, scope: !1516)
!1518 = !DILocation(line: 1011, column: 30, scope: !1516)
!1519 = !DILocation(line: 1011, column: 34, scope: !1520)
!1520 = !DILexicalBlockFile(scope: !1516, file: !526, discriminator: 1)
!1521 = !DILocation(line: 1011, column: 44, scope: !1520)
!1522 = !DILocation(line: 1011, column: 55, scope: !1520)
!1523 = !DILocation(line: 1011, column: 14, scope: !1520)
!1524 = !DILocation(line: 1012, column: 20, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1516, file: !526, line: 1011, column: 61)
!1526 = !DILocation(line: 1013, column: 10, scope: !1525)
!1527 = !DILocation(line: 1014, column: 7, scope: !1512)
!1528 = !DILocation(line: 1015, column: 17, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1508, file: !526, line: 1014, column: 14)
!1530 = !DILocation(line: 1017, column: 11, scope: !1531)
!1531 = distinct !DILexicalBlock(scope: !1503, file: !526, line: 1017, column: 11)
!1532 = !DILocation(line: 1017, column: 18, scope: !1531)
!1533 = !DILocation(line: 1017, column: 11, scope: !1503)
!1534 = !DILocation(line: 1018, column: 10, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1531, file: !526, line: 1017, column: 24)
!1536 = distinct !{!1536, !1534}
!1537 = !DILocation(line: 1018, column: 36, scope: !1538)
!1538 = !DILexicalBlockFile(scope: !1539, file: !526, discriminator: 1)
!1539 = distinct !DILexicalBlock(scope: !1540, file: !526, line: 1018, column: 34)
!1540 = distinct !DILexicalBlock(scope: !1541, file: !526, line: 1018, column: 19)
!1541 = distinct !DILexicalBlock(scope: !1535, file: !526, line: 1018, column: 13)
!1542 = !DILocation(line: 1018, column: 230, scope: !1538)
!1543 = !DILocation(line: 1018, column: 241, scope: !1538)
!1544 = !DILocation(line: 1018, column: 251, scope: !1538)
!1545 = !DILocation(line: 1018, column: 261, scope: !1538)
!1546 = !DILocation(line: 1018, column: 286, scope: !1538)
!1547 = !DILocation(line: 1018, column: 269, scope: !1548)
!1548 = !DILexicalBlockFile(scope: !1538, file: !526, discriminator: 2)
!1549 = !DILocation(line: 1018, column: 115, scope: !1550)
!1550 = !DILexicalBlockFile(scope: !1538, file: !526, discriminator: 3)
!1551 = !DILocation(line: 1018, column: 298, scope: !1538)
!1552 = !DILocation(line: 1021, column: 10, scope: !1535)
!1553 = !DILocation(line: 1023, column: 4, scope: !1503)
!1554 = !DILocation(line: 1032, column: 8, scope: !1555)
!1555 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1032, column: 8)
!1556 = !DILocation(line: 1032, column: 18, scope: !1555)
!1557 = !DILocation(line: 1032, column: 23, scope: !1555)
!1558 = !DILocation(line: 1032, column: 8, scope: !1291)
!1559 = !DILocation(line: 1033, column: 12, scope: !1560)
!1560 = distinct !DILexicalBlock(scope: !1561, file: !526, line: 1033, column: 11)
!1561 = distinct !DILexicalBlock(scope: !1555, file: !526, line: 1032, column: 35)
!1562 = !DILocation(line: 1033, column: 22, scope: !1560)
!1563 = !DILocation(line: 1033, column: 32, scope: !1560)
!1564 = !DILocation(line: 1034, column: 13, scope: !1560)
!1565 = !DILocation(line: 1034, column: 23, scope: !1560)
!1566 = !DILocation(line: 1034, column: 33, scope: !1560)
!1567 = !DILocation(line: 1034, column: 37, scope: !1568)
!1568 = !DILexicalBlockFile(scope: !1560, file: !526, discriminator: 1)
!1569 = !DILocation(line: 1034, column: 47, scope: !1568)
!1570 = !DILocation(line: 1033, column: 11, scope: !1571)
!1571 = !DILexicalBlockFile(scope: !1561, file: !526, discriminator: 1)
!1572 = !DILocation(line: 1035, column: 29, scope: !1573)
!1573 = distinct !DILexicalBlock(scope: !1560, file: !526, line: 1034, column: 59)
!1574 = !DILocation(line: 1036, column: 7, scope: !1573)
!1575 = !DILocation(line: 1036, column: 18, scope: !1576)
!1576 = !DILexicalBlockFile(scope: !1577, file: !526, discriminator: 1)
!1577 = distinct !DILexicalBlock(scope: !1560, file: !526, line: 1036, column: 18)
!1578 = !DILocation(line: 1036, column: 28, scope: !1576)
!1579 = !DILocalVariable(name: "err", scope: !1580, file: !526, line: 1037, type: !550)
!1580 = distinct !DILexicalBlock(scope: !1577, file: !526, line: 1036, column: 38)
!1581 = !DILocation(line: 1037, column: 14, scope: !1580)
!1582 = !DILocation(line: 1037, column: 33, scope: !1580)
!1583 = !DILocation(line: 1037, column: 43, scope: !1580)
!1584 = !DILocation(line: 1037, column: 20, scope: !1580)
!1585 = !DILocation(line: 1038, column: 32, scope: !1580)
!1586 = !DILocation(line: 1038, column: 36, scope: !1580)
!1587 = !DILocation(line: 1038, column: 42, scope: !1580)
!1588 = !DILocation(line: 1038, column: 47, scope: !1589)
!1589 = !DILexicalBlockFile(scope: !1580, file: !526, discriminator: 1)
!1590 = !DILocation(line: 1038, column: 46, scope: !1589)
!1591 = !DILocation(line: 1038, column: 51, scope: !1589)
!1592 = !DILocation(line: 1038, column: 42, scope: !1593)
!1593 = !DILexicalBlockFile(scope: !1580, file: !526, discriminator: 2)
!1594 = !DILocation(line: 1038, column: 31, scope: !1593)
!1595 = !DILocation(line: 1038, column: 29, scope: !1593)
!1596 = !DILocation(line: 1039, column: 7, scope: !1580)
!1597 = !DILocation(line: 1040, column: 4, scope: !1561)
!1598 = !DILocation(line: 1045, column: 20, scope: !1291)
!1599 = !DILocation(line: 1045, column: 30, scope: !1291)
!1600 = !DILocation(line: 1046, column: 20, scope: !1291)
!1601 = !DILocation(line: 1046, column: 31, scope: !1291)
!1602 = !DILocation(line: 1046, column: 29, scope: !1291)
!1603 = !DILocation(line: 1047, column: 20, scope: !1291)
!1604 = !DILocation(line: 1045, column: 9, scope: !1291)
!1605 = !DILocation(line: 1045, column: 7, scope: !1291)
!1606 = !DILocation(line: 1048, column: 8, scope: !1607)
!1607 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1048, column: 8)
!1608 = !DILocation(line: 1048, column: 11, scope: !1607)
!1609 = !DILocation(line: 1048, column: 8, scope: !1291)
!1610 = !DILocation(line: 1049, column: 17, scope: !1611)
!1611 = distinct !DILexicalBlock(scope: !1607, file: !526, line: 1048, column: 16)
!1612 = !DILocation(line: 1049, column: 16, scope: !1611)
!1613 = !DILocation(line: 1049, column: 14, scope: !1611)
!1614 = !DILocation(line: 1050, column: 11, scope: !1615)
!1615 = distinct !DILexicalBlock(scope: !1611, file: !526, line: 1050, column: 11)
!1616 = !DILocation(line: 1050, column: 18, scope: !1615)
!1617 = !DILocation(line: 1050, column: 11, scope: !1611)
!1618 = !DILocation(line: 1056, column: 17, scope: !1619)
!1619 = distinct !DILexicalBlock(scope: !1615, file: !526, line: 1050, column: 28)
!1620 = !DILocation(line: 1057, column: 7, scope: !1619)
!1621 = !DILocation(line: 1058, column: 7, scope: !1611)
!1622 = distinct !{!1622, !1621}
!1623 = !DILocation(line: 1058, column: 33, scope: !1624)
!1624 = !DILexicalBlockFile(scope: !1625, file: !526, discriminator: 1)
!1625 = distinct !DILexicalBlock(scope: !1626, file: !526, line: 1058, column: 31)
!1626 = distinct !DILexicalBlock(scope: !1627, file: !526, line: 1058, column: 16)
!1627 = distinct !DILexicalBlock(scope: !1611, file: !526, line: 1058, column: 10)
!1628 = !DILocation(line: 1058, column: 206, scope: !1624)
!1629 = !DILocation(line: 1058, column: 216, scope: !1624)
!1630 = !DILocation(line: 1058, column: 226, scope: !1624)
!1631 = !DILocation(line: 1058, column: 251, scope: !1624)
!1632 = !DILocation(line: 1058, column: 234, scope: !1633)
!1633 = !DILexicalBlockFile(scope: !1624, file: !526, discriminator: 2)
!1634 = !DILocation(line: 1058, column: 112, scope: !1635)
!1635 = !DILexicalBlockFile(scope: !1624, file: !526, discriminator: 3)
!1636 = !DILocation(line: 1058, column: 263, scope: !1624)
!1637 = !DILocation(line: 1060, column: 7, scope: !1611)
!1638 = !DILocation(line: 1064, column: 14, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1064, column: 8)
!1640 = !DILocation(line: 1064, column: 8, scope: !1639)
!1641 = !DILocation(line: 1064, column: 29, scope: !1639)
!1642 = !DILocation(line: 1064, column: 8, scope: !1291)
!1643 = !DILocation(line: 1065, column: 17, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1639, file: !526, line: 1064, column: 34)
!1645 = !DILocation(line: 1065, column: 16, scope: !1644)
!1646 = !DILocation(line: 1065, column: 14, scope: !1644)
!1647 = !DILocation(line: 1066, column: 7, scope: !1644)
!1648 = distinct !{!1648, !1647}
!1649 = !DILocation(line: 1066, column: 33, scope: !1650)
!1650 = !DILexicalBlockFile(scope: !1651, file: !526, discriminator: 1)
!1651 = distinct !DILexicalBlock(scope: !1652, file: !526, line: 1066, column: 31)
!1652 = distinct !DILexicalBlock(scope: !1653, file: !526, line: 1066, column: 16)
!1653 = distinct !DILexicalBlock(scope: !1644, file: !526, line: 1066, column: 10)
!1654 = !DILocation(line: 1066, column: 205, scope: !1650)
!1655 = !DILocation(line: 1066, column: 215, scope: !1650)
!1656 = !DILocation(line: 1066, column: 225, scope: !1650)
!1657 = !DILocation(line: 1066, column: 250, scope: !1650)
!1658 = !DILocation(line: 1066, column: 233, scope: !1659)
!1659 = !DILexicalBlockFile(scope: !1650, file: !526, discriminator: 2)
!1660 = !DILocation(line: 1066, column: 112, scope: !1661)
!1661 = !DILexicalBlockFile(scope: !1650, file: !526, discriminator: 3)
!1662 = !DILocation(line: 1066, column: 262, scope: !1650)
!1663 = !DILocation(line: 1068, column: 13, scope: !1644)
!1664 = !DILocation(line: 1068, column: 7, scope: !1644)
!1665 = !DILocation(line: 1069, column: 7, scope: !1644)
!1666 = !DILocation(line: 1073, column: 8, scope: !1667)
!1667 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1073, column: 8)
!1668 = !DILocation(line: 1073, column: 8, scope: !1291)
!1669 = !DILocation(line: 1074, column: 26, scope: !1670)
!1670 = distinct !DILexicalBlock(scope: !1667, file: !526, line: 1073, column: 28)
!1671 = !DILocation(line: 1074, column: 36, scope: !1670)
!1672 = !DILocation(line: 1075, column: 27, scope: !1670)
!1673 = !DILocation(line: 1075, column: 37, scope: !1670)
!1674 = !DILocation(line: 1075, column: 42, scope: !1670)
!1675 = !DILocation(line: 1075, column: 54, scope: !1670)
!1676 = !DILocation(line: 1075, column: 26, scope: !1670)
!1677 = !DILocation(line: 1076, column: 35, scope: !1670)
!1678 = !DILocation(line: 1074, column: 7, scope: !1670)
!1679 = !DILocation(line: 1077, column: 4, scope: !1670)
!1680 = !DILocation(line: 1080, column: 8, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1291, file: !526, line: 1080, column: 8)
!1682 = !DILocation(line: 1080, column: 18, scope: !1681)
!1683 = !DILocation(line: 1080, column: 23, scope: !1681)
!1684 = !DILocation(line: 1080, column: 8, scope: !1291)
!1685 = !DILocation(line: 1081, column: 20, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1681, file: !526, line: 1080, column: 36)
!1687 = !DILocation(line: 1081, column: 30, scope: !1686)
!1688 = !DILocation(line: 1081, column: 18, scope: !1686)
!1689 = !DILocation(line: 1082, column: 34, scope: !1690)
!1690 = distinct !DILexicalBlock(scope: !1686, file: !526, line: 1082, column: 11)
!1691 = !DILocation(line: 1082, column: 38, scope: !1690)
!1692 = !DILocation(line: 1082, column: 12, scope: !1690)
!1693 = !DILocation(line: 1082, column: 11, scope: !1686)
!1694 = !DILocation(line: 1083, column: 10, scope: !1695)
!1695 = distinct !DILexicalBlock(scope: !1690, file: !526, line: 1082, column: 61)
!1696 = !DILocation(line: 1083, column: 20, scope: !1695)
!1697 = !DILocation(line: 1083, column: 33, scope: !1695)
!1698 = !DILocation(line: 1084, column: 7, scope: !1695)
!1699 = !DILocation(line: 1085, column: 35, scope: !1700)
!1700 = distinct !DILexicalBlock(scope: !1690, file: !526, line: 1084, column: 14)
!1701 = !DILocation(line: 1085, column: 10, scope: !1700)
!1702 = !DILocation(line: 1085, column: 20, scope: !1700)
!1703 = !DILocation(line: 1085, column: 33, scope: !1700)
!1704 = !DILocation(line: 1087, column: 4, scope: !1686)
!1705 = !DILocation(line: 1088, column: 7, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1681, file: !526, line: 1087, column: 11)
!1707 = !DILocation(line: 1088, column: 17, scope: !1706)
!1708 = !DILocation(line: 1088, column: 30, scope: !1706)
!1709 = !DILocation(line: 1091, column: 16, scope: !1291)
!1710 = !DILocation(line: 1091, column: 5, scope: !1291)
!1711 = !DILocation(line: 1091, column: 14, scope: !1291)
!1712 = !DILocation(line: 1094, column: 33, scope: !1291)
!1713 = !DILocation(line: 1094, column: 4, scope: !1291)
!1714 = !DILocation(line: 1094, column: 13, scope: !1291)
!1715 = !DILocation(line: 1094, column: 22, scope: !1291)
!1716 = !DILocation(line: 1095, column: 31, scope: !1291)
!1717 = !DILocation(line: 1095, column: 4, scope: !1291)
!1718 = !DILocation(line: 1095, column: 13, scope: !1291)
!1719 = !DILocation(line: 1095, column: 20, scope: !1291)
!1720 = !DILocation(line: 1098, column: 11, scope: !1291)
!1721 = !DILocation(line: 1098, column: 4, scope: !1291)
!1722 = distinct !DISubprogram(name: "HgfsSetHiddenXAttr", scope: !526, file: !526, line: 5256, type: !1723, isLocal: true, isDefinition: true, scopeLine: 5259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
!1723 = !DISubroutineType(types: !1724)
!1724 = !{!609, !522, !729, !1314}
!1725 = !DILocalVariable(name: "fileName", arg: 1, scope: !1722, file: !526, line: 5256, type: !522)
!1726 = !DILocation(line: 5256, column: 32, scope: !1722)
!1727 = !DILocalVariable(name: "value", arg: 2, scope: !1722, file: !526, line: 5257, type: !729)
!1728 = !DILocation(line: 5257, column: 25, scope: !1722)
!1729 = !DILocalVariable(name: "permissions", arg: 3, scope: !1722, file: !526, line: 5258, type: !1314)
!1730 = !DILocation(line: 5258, column: 27, scope: !1722)
!1731 = !DILocation(line: 5260, column: 4, scope: !1722)
!1732 = distinct !DISubprogram(name: "HgfsPlatformFilenameLookup", scope: !526, file: !526, line: 1755, type: !1733, isLocal: false, isDefinition: true, scopeLine: 1762, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !573)
