; ModuleID = './libvmtools_la-vmtoolsConfig.o.i'
source_filename = "./libvmtools_la-vmtoolsConfig.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ConfigEntry = type { i8*, i8*, i8*, i32, i8* }
%struct._GKeyFile = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._GHashTable = type opaque
%struct._GError = type { i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@VMTools_LoadConfig.hadConfFile = internal global i32 1, align 4
@__func__.VMTools_LoadConfig = private unnamed_addr constant [19 x i8] c"VMTools_LoadConfig\00", align 1
@.str = private unnamed_addr constant [15 x i8] c"config != NULL\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Error converting to local encoding: %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"Failed to stat conf file: %s\0A\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"Cannot load config file: %s\00", align 1
@.str.4 = private unnamed_addr constant [51 x i8] c"Error loading old tools config data, bailing out.\0A\00", align 1

!8 = !DIEnumerator(name: "G_KEY_FILE_KEEP_TRANSLATIONS", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 51, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20}
!12 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!13 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!15 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!16 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!17 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!19 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!20 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 33, size: 32, align: 32, elements: !22)
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "G_KEY_FILE_ERROR_UNKNOWN_ENCODING", value: 0)
!24 = !DIEnumerator(name: "G_KEY_FILE_ERROR_PARSE", value: 1)
!25 = !DIEnumerator(name: "G_KEY_FILE_ERROR_NOT_FOUND", value: 2)
!26 = !DIEnumerator(name: "G_KEY_FILE_ERROR_KEY_NOT_FOUND", value: 3)
!27 = !DIEnumerator(name: "G_KEY_FILE_ERROR_GROUP_NOT_FOUND", value: 4)
!28 = !DIEnumerator(name: "G_KEY_FILE_ERROR_INVALID_VALUE", value: 5)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 66, size: 32, align: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/glib-2.0/glib/gfileutils.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!31 = !{!32, !33, !34, !35, !36}
!32 = !DIEnumerator(name: "G_FILE_TEST_IS_REGULAR", value: 1)
!33 = !DIEnumerator(name: "G_FILE_TEST_IS_SYMLINK", value: 2)
!34 = !DIEnumerator(name: "G_FILE_TEST_IS_DIR", value: 4)
!35 = !DIEnumerator(name: "G_FILE_TEST_IS_EXECUTABLE", value: 8)
!36 = !DIEnumerator(name: "G_FILE_TEST_EXISTS", value: 16)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 33, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!39 = !DIEnumerator(name: "G_FILE_ERROR_EXIST", value: 0)
!40 = !DIEnumerator(name: "G_FILE_ERROR_ISDIR", value: 1)
!41 = !DIEnumerator(name: "G_FILE_ERROR_ACCES", value: 2)
!42 = !DIEnumerator(name: "G_FILE_ERROR_NAMETOOLONG", value: 3)
!43 = !DIEnumerator(name: "G_FILE_ERROR_NOENT", value: 4)
!44 = !DIEnumerator(name: "G_FILE_ERROR_NOTDIR", value: 5)
!45 = !DIEnumerator(name: "G_FILE_ERROR_NXIO", value: 6)
!46 = !DIEnumerator(name: "G_FILE_ERROR_NODEV", value: 7)
!47 = !DIEnumerator(name: "G_FILE_ERROR_ROFS", value: 8)
!48 = !DIEnumerator(name: "G_FILE_ERROR_TXTBSY", value: 9)
!49 = !DIEnumerator(name: "G_FILE_ERROR_FAULT", value: 10)
!50 = !DIEnumerator(name: "G_FILE_ERROR_LOOP", value: 11)
!51 = !DIEnumerator(name: "G_FILE_ERROR_NOSPC", value: 12)
!52 = !DIEnumerator(name: "G_FILE_ERROR_NOMEM", value: 13)
!53 = !DIEnumerator(name: "G_FILE_ERROR_MFILE", value: 14)
!54 = !DIEnumerator(name: "G_FILE_ERROR_NFILE", value: 15)
!55 = !DIEnumerator(name: "G_FILE_ERROR_BADF", value: 16)
!56 = !DIEnumerator(name: "G_FILE_ERROR_INVAL", value: 17)
!57 = !DIEnumerator(name: "G_FILE_ERROR_PIPE", value: 18)
!58 = !DIEnumerator(name: "G_FILE_ERROR_AGAIN", value: 19)
!59 = !DIEnumerator(name: "G_FILE_ERROR_INTR", value: 20)
!60 = !DIEnumerator(name: "G_FILE_ERROR_IO", value: 21)
!61 = !DIEnumerator(name: "G_FILE_ERROR_PERM", value: 22)
!62 = !DIEnumerator(name: "G_FILE_ERROR_NOSYS", value: 23)
!63 = !DIEnumerator(name: "G_FILE_ERROR_FAILED", value: 24)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 43, size: 32, align: 32, elements: !66)
!65 = !DIFile(filename: "vmtoolsConfig.c", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "CFG_BOOLEAN", value: 0)
!68 = !DIEnumerator(name: "CFG_INTEGER", value: 1)
!69 = !DIEnumerator(name: "CFG_STRING", value: 2)
!70 = !DIEnumerator(name: "CFG_CALLBACK", value: 3)
!71 = !{!72, !73, !77, !79}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!76 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "CfgCallback", file: !65, line: 59, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !86, !77}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !4, line: 48, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !4, line: 48, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigEntry", file: !65, line: 57, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConfigEntry", file: !65, line: 51, size: 320, align: 64, elements: !90)
!90 = !{!91, !94, !95, !96, !99}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !89, file: !65, line: 52, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "destGroup", scope: !89, file: !65, line: 53, baseType: !92, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "destKey", scope: !89, file: !65, line: 54, baseType: !92, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !65, line: 55, baseType: !97, size: 32, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigType", file: !65, line: 48, baseType: !64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !65, line: 56, baseType: !100, size: 64, align: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !75, line: 77, baseType: !72)
!102 = !{!103, !119}
!103 = distinct !DIGlobalVariable(name: "hadConfFile", scope: !104, file: !65, line: 341, type: !107, isLocal: true, isDefinition: true, variable: i32* @VMTools_LoadConfig.hadConfFile)
!104 = distinct !DISubprogram(name: "VMTools_LoadConfig", scope: !65, file: !65, line: 324, type: !105, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !118)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !92, !110, !111, !112}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !75, line: 50, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !75, line: 49, baseType: !109)
!109 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFileFlags", file: !4, line: 55, baseType: !3)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !114, line: 75, baseType: !115)
!114 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !116, line: 139, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !{}
!119 = distinct !DIGlobalVariable(name: "entries", scope: !120, file: !65, line: 208, type: !127, isLocal: true, isDefinition: true, variable: [11 x %struct.ConfigEntry]* @VMToolsConfigUpgrade.entries)
!120 = distinct !DISubprogram(name: "VMToolsConfigUpgrade", scope: !65, file: !65, line: 205, type: !121, isLocal: true, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !118)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123, !83}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !125, line: 37, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !125, line: 37, flags: DIFlagFwdDecl)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 3520, align: 64, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 11)
!130 = !{i32 2, !"Dwarf Version", i32 4}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!133 = !DILocalVariable(name: "path", arg: 1, scope: !104, file: !65, line: 324, type: !92)
!134 = !DIExpression()
!135 = !DILocation(line: 324, column: 33, scope: !104)
!136 = !DILocalVariable(name: "flags", arg: 2, scope: !104, file: !65, line: 325, type: !110)
!137 = !DILocation(line: 325, column: 34, scope: !104)
!138 = !DILocalVariable(name: "config", arg: 3, scope: !104, file: !65, line: 326, type: !111)
!139 = !DILocation(line: 326, column: 31, scope: !104)
!140 = !DILocalVariable(name: "mtime", arg: 4, scope: !104, file: !65, line: 327, type: !112)
!141 = !DILocation(line: 327, column: 28, scope: !104)
!142 = !DILocalVariable(name: "backup", scope: !104, file: !65, line: 329, type: !73)
!143 = !DILocation(line: 329, column: 11, scope: !104)
!144 = !DILocalVariable(name: "defaultPath", scope: !104, file: !65, line: 330, type: !73)
!145 = !DILocation(line: 330, column: 11, scope: !104)
!146 = !DILocalVariable(name: "localPath", scope: !104, file: !65, line: 331, type: !73)
!147 = !DILocation(line: 331, column: 11, scope: !104)
!148 = !DILocalVariable(name: "confStat", scope: !104, file: !65, line: 334, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStatBuf", file: !150, line: 50, baseType: !151)
!150 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !152, line: 46, size: 1152, align: 64, elements: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!153 = !{!154, !157, !159, !161, !164, !166, !168, !169, !170, !172, !174, !176, !182, !183, !184}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !151, file: !152, line: 48, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !116, line: 124, baseType: !156)
!156 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !151, file: !152, line: 53, baseType: !158, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !116, line: 127, baseType: !156)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !151, file: !152, line: 61, baseType: !160, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !116, line: 130, baseType: !156)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !151, file: !152, line: 62, baseType: !162, size: 32, align: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !116, line: 129, baseType: !163)
!163 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !151, file: !152, line: 64, baseType: !165, size: 32, align: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !116, line: 125, baseType: !163)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !151, file: !152, line: 65, baseType: !167, size: 32, align: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !116, line: 126, baseType: !163)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !151, file: !152, line: 67, baseType: !109, size: 32, align: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !151, file: !152, line: 69, baseType: !155, size: 64, align: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !151, file: !152, line: 74, baseType: !171, size: 64, align: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 131, baseType: !117)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !151, file: !152, line: 78, baseType: !173, size: 64, align: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !116, line: 153, baseType: !117)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !151, file: !152, line: 80, baseType: !175, size: 64, align: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !116, line: 158, baseType: !117)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !151, file: !152, line: 91, baseType: !177, size: 128, align: 64, offset: 576)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !114, line: 120, size: 128, align: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !177, file: !114, line: 122, baseType: !115, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !177, file: !114, line: 123, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !116, line: 175, baseType: !117)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !151, file: !152, line: 92, baseType: !177, size: 128, align: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !151, file: !152, line: 93, baseType: !177, size: 128, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !151, file: !152, line: 106, baseType: !185, size: 192, align: 64, offset: 960)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 192, align: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DILocation(line: 334, column: 13, scope: !104)
!189 = !DILocalVariable(name: "old", scope: !104, file: !65, line: 338, type: !123)
!190 = !DILocation(line: 338, column: 16, scope: !104)
!191 = !DILocalVariable(name: "err", scope: !104, file: !65, line: 339, type: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !194, line: 42, baseType: !195)
!194 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !194, line: 44, size: 128, align: 64, elements: !196)
!196 = !{!197, !202, !203}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !195, file: !194, line: 46, baseType: !198, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !199, line: 36, baseType: !200)
!199 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !201, line: 45, baseType: !163)
!201 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!202 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !195, file: !194, line: 47, baseType: !108, size: 32, align: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !195, file: !194, line: 48, baseType: !73, size: 64, align: 64, offset: 64)
!204 = !DILocation(line: 339, column: 12, scope: !104)
!205 = !DILocalVariable(name: "cfg", scope: !104, file: !65, line: 340, type: !83)
!206 = !DILocation(line: 340, column: 14, scope: !104)
!207 = !DILocation(line: 343, column: 4, scope: !104)
!208 = distinct !{!208, !207}
!209 = !DILocation(line: 343, column: 12, scope: !210)
!210 = !DILexicalBlockFile(scope: !211, file: !65, discriminator: 1)
!211 = distinct !DILexicalBlock(scope: !212, file: !65, line: 343, column: 12)
!212 = distinct !DILexicalBlock(scope: !104, file: !65, line: 343, column: 6)
!213 = !DILocation(line: 343, column: 19, scope: !210)
!214 = !DILocation(line: 343, column: 7, scope: !215)
!215 = !DILexicalBlockFile(scope: !216, file: !65, discriminator: 2)
!216 = distinct !DILexicalBlock(scope: !211, file: !65, line: 343, column: 5)
!217 = !DILocation(line: 343, column: 16, scope: !218)
!218 = !DILexicalBlockFile(scope: !219, file: !65, discriminator: 3)
!219 = distinct !DILexicalBlock(scope: !211, file: !65, line: 343, column: 14)
!220 = !DILocation(line: 343, column: 103, scope: !218)
!221 = !DILocation(line: 343, column: 120, scope: !222)
!222 = !DILexicalBlockFile(scope: !212, file: !65, discriminator: 4)
!223 = !DILocation(line: 345, column: 8, scope: !224)
!224 = distinct !DILexicalBlock(scope: !104, file: !65, line: 345, column: 8)
!225 = !DILocation(line: 345, column: 13, scope: !224)
!226 = !DILocation(line: 345, column: 8, scope: !104)
!227 = !DILocation(line: 346, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !65, line: 345, column: 21)
!229 = !DILocation(line: 346, column: 19, scope: !228)
!230 = !DILocation(line: 347, column: 4, scope: !228)
!231 = !DILocation(line: 349, column: 39, scope: !104)
!232 = !DILocation(line: 349, column: 44, scope: !104)
!233 = !DILocation(line: 349, column: 38, scope: !104)
!234 = !DILocation(line: 349, column: 19, scope: !235)
!235 = !DILexicalBlockFile(scope: !104, file: !65, discriminator: 1)
!236 = !DILocation(line: 349, column: 38, scope: !235)
!237 = !DILocation(line: 349, column: 26, scope: !238)
!238 = !DILexicalBlockFile(scope: !104, file: !65, discriminator: 2)
!239 = !DILocation(line: 349, column: 38, scope: !238)
!240 = !DILocation(line: 349, column: 38, scope: !241)
!241 = !DILexicalBlockFile(scope: !104, file: !65, discriminator: 3)
!242 = !DILocation(line: 349, column: 16, scope: !241)
!243 = !DILocation(line: 349, column: 14, scope: !241)
!244 = !DILocation(line: 350, column: 8, scope: !245)
!245 = distinct !DILexicalBlock(scope: !104, file: !65, line: 350, column: 8)
!246 = !DILocation(line: 350, column: 12, scope: !245)
!247 = !DILocation(line: 350, column: 8, scope: !104)
!248 = !DILocation(line: 351, column: 93, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !65, line: 350, column: 20)
!250 = !DILocation(line: 351, column: 98, scope: !249)
!251 = !DILocation(line: 351, column: 7, scope: !249)
!252 = !DILocation(line: 352, column: 7, scope: !249)
!253 = !DILocation(line: 355, column: 13, scope: !254)
!254 = distinct !DILexicalBlock(scope: !104, file: !65, line: 355, column: 8)
!255 = !DILocation(line: 355, column: 8, scope: !254)
!256 = !DILocation(line: 355, column: 35, scope: !254)
!257 = !DILocation(line: 355, column: 8, scope: !104)
!258 = !DILocation(line: 361, column: 7, scope: !259)
!259 = distinct !DILexicalBlock(scope: !254, file: !65, line: 355, column: 42)
!260 = !DILocation(line: 362, column: 12, scope: !261)
!261 = distinct !DILexicalBlock(scope: !259, file: !65, line: 362, column: 10)
!262 = !DILocation(line: 362, column: 11, scope: !261)
!263 = !DILocation(line: 362, column: 16, scope: !261)
!264 = !DILocation(line: 362, column: 10, scope: !259)
!265 = !DILocation(line: 363, column: 11, scope: !266)
!266 = distinct !DILexicalBlock(scope: !261, file: !65, line: 362, column: 27)
!267 = !DILocation(line: 363, column: 10, scope: !266)
!268 = !DILocation(line: 363, column: 86, scope: !269)
!269 = !DILexicalBlockFile(scope: !266, file: !65, discriminator: 1)
!270 = !DILocation(line: 363, column: 10, scope: !271)
!271 = !DILexicalBlockFile(scope: !266, file: !65, discriminator: 2)
!272 = !DILocation(line: 364, column: 10, scope: !266)
!273 = !DILocation(line: 370, column: 14, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !65, line: 370, column: 14)
!275 = distinct !DILexicalBlock(scope: !261, file: !65, line: 365, column: 14)
!276 = !DILocation(line: 370, column: 14, scope: !275)
!277 = !DILocation(line: 371, column: 19, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !65, line: 370, column: 27)
!279 = !DILocation(line: 371, column: 17, scope: !278)
!280 = !DILocation(line: 372, column: 10, scope: !278)
!281 = !DILocation(line: 373, column: 22, scope: !275)
!282 = !DILocation(line: 374, column: 10, scope: !275)
!283 = !DILocation(line: 378, column: 16, scope: !104)
!284 = !DILocation(line: 381, column: 8, scope: !285)
!285 = distinct !DILexicalBlock(scope: !104, file: !65, line: 381, column: 8)
!286 = !DILocation(line: 381, column: 14, scope: !285)
!287 = !DILocation(line: 381, column: 21, scope: !285)
!288 = !DILocation(line: 381, column: 33, scope: !289)
!289 = !DILexicalBlockFile(scope: !285, file: !65, discriminator: 1)
!290 = !DILocation(line: 381, column: 41, scope: !289)
!291 = !DILocation(line: 381, column: 46, scope: !289)
!292 = !DILocation(line: 381, column: 45, scope: !289)
!293 = !DILocation(line: 381, column: 42, scope: !289)
!294 = !DILocation(line: 381, column: 8, scope: !289)
!295 = !DILocation(line: 382, column: 7, scope: !296)
!296 = distinct !DILexicalBlock(scope: !285, file: !65, line: 381, column: 53)
!297 = !DILocation(line: 387, column: 10, scope: !104)
!298 = !DILocation(line: 387, column: 8, scope: !104)
!299 = !DILocation(line: 390, column: 17, scope: !300)
!300 = distinct !DILexicalBlock(scope: !104, file: !65, line: 390, column: 8)
!301 = !DILocation(line: 390, column: 25, scope: !300)
!302 = !DILocation(line: 390, column: 8, scope: !104)
!303 = !DILocation(line: 391, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !65, line: 390, column: 31)
!305 = !DILocation(line: 394, column: 30, scope: !104)
!306 = !DILocation(line: 394, column: 35, scope: !104)
!307 = !DILocation(line: 394, column: 46, scope: !104)
!308 = !DILocation(line: 394, column: 4, scope: !104)
!309 = !DILocation(line: 395, column: 8, scope: !310)
!310 = distinct !DILexicalBlock(scope: !104, file: !65, line: 395, column: 8)
!311 = !DILocation(line: 395, column: 12, scope: !310)
!312 = !DILocation(line: 395, column: 8, scope: !104)
!313 = !DILocation(line: 396, column: 7, scope: !314)
!314 = distinct !DILexicalBlock(scope: !310, file: !65, line: 395, column: 20)
!315 = !DILocation(line: 399, column: 8, scope: !316)
!316 = distinct !DILexicalBlock(scope: !104, file: !65, line: 399, column: 8)
!317 = !DILocation(line: 399, column: 13, scope: !316)
!318 = !DILocation(line: 399, column: 18, scope: !316)
!319 = !DILocation(line: 399, column: 8, scope: !104)
!320 = !DILocation(line: 400, column: 80, scope: !321)
!321 = distinct !DILexicalBlock(scope: !316, file: !65, line: 399, column: 55)
!322 = !DILocation(line: 400, column: 85, scope: !321)
!323 = !DILocation(line: 400, column: 7, scope: !321)
!324 = !DILocation(line: 401, column: 1, scope: !321)
!325 = !DILocation(line: 402, column: 7, scope: !321)
!326 = !DILocation(line: 410, column: 8, scope: !327)
!327 = distinct !DILexicalBlock(scope: !104, file: !65, line: 410, column: 8)
!328 = !DILocation(line: 410, column: 13, scope: !327)
!329 = !DILocation(line: 410, column: 8, scope: !104)
!330 = !DILocation(line: 410, column: 13, scope: !331)
!331 = !DILexicalBlockFile(scope: !332, file: !65, discriminator: 1)
!332 = distinct !DILexicalBlock(scope: !327, file: !65, line: 409, column: 21)
!333 = !DILocation(line: 410, column: 11, scope: !331)
!334 = !DILocation(line: 411, column: 11, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !65, line: 411, column: 11)
!336 = !DILocation(line: 411, column: 15, scope: !335)
!337 = !DILocation(line: 411, column: 11, scope: !332)
!338 = !DILocation(line: 412, column: 10, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !65, line: 411, column: 23)
!340 = !DILocation(line: 413, column: 1, scope: !339)
!341 = !DILocation(line: 414, column: 10, scope: !339)
!342 = !DILocation(line: 417, column: 28, scope: !332)
!343 = !DILocation(line: 417, column: 33, scope: !332)
!344 = !DILocation(line: 417, column: 7, scope: !332)
!345 = !DILocation(line: 418, column: 42, scope: !332)
!346 = !DILocation(line: 418, column: 16, scope: !332)
!347 = !DILocation(line: 418, column: 14, scope: !332)
!348 = !DILocation(line: 420, column: 24, scope: !349)
!349 = distinct !DILexicalBlock(scope: !332, file: !65, line: 420, column: 11)
!350 = !DILocation(line: 420, column: 12, scope: !349)
!351 = !DILocation(line: 420, column: 11, scope: !332)
!352 = !DILocation(line: 421, column: 21, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !65, line: 421, column: 14)
!354 = distinct !DILexicalBlock(scope: !349, file: !65, line: 420, column: 57)
!355 = !DILocation(line: 421, column: 32, scope: !353)
!356 = !DILocation(line: 421, column: 14, scope: !353)
!357 = !DILocation(line: 421, column: 40, scope: !353)
!358 = !DILocation(line: 421, column: 14, scope: !354)
!359 = !DILocation(line: 422, column: 13, scope: !360)
!360 = distinct !DILexicalBlock(scope: !353, file: !65, line: 421, column: 47)
!361 = !DILocation(line: 423, column: 1, scope: !360)
!362 = !DILocation(line: 424, column: 13, scope: !360)
!363 = !DILocation(line: 426, column: 7, scope: !354)
!364 = !DILocation(line: 427, column: 10, scope: !365)
!365 = distinct !DILexicalBlock(scope: !349, file: !65, line: 426, column: 14)
!366 = !DILocation(line: 430, column: 7, scope: !332)
!367 = !DILocation(line: 432, column: 33, scope: !368)
!368 = distinct !DILexicalBlock(scope: !332, file: !65, line: 432, column: 11)
!369 = !DILocation(line: 432, column: 38, scope: !368)
!370 = !DILocation(line: 432, column: 32, scope: !368)
!371 = !DILocation(line: 430, column: 48, scope: !372)
!372 = !DILexicalBlockFile(scope: !368, file: !65, discriminator: 1)
!373 = !DILocation(line: 432, column: 32, scope: !372)
!374 = !DILocation(line: 430, column: 55, scope: !375)
!375 = !DILexicalBlockFile(scope: !368, file: !65, discriminator: 2)
!376 = !DILocation(line: 432, column: 32, scope: !375)
!377 = !DILocation(line: 432, column: 32, scope: !378)
!378 = !DILexicalBlockFile(scope: !368, file: !65, discriminator: 3)
!379 = !DILocation(line: 430, column: 68, scope: !378)
!380 = !DILocation(line: 432, column: 12, scope: !378)
!381 = !DILocation(line: 432, column: 11, scope: !378)
!382 = !DILocation(line: 431, column: 1, scope: !383)
!383 = distinct !DILexicalBlock(scope: !368, file: !65, line: 430, column: 80)
!384 = !DILocation(line: 432, column: 10, scope: !385)
!385 = !DILexicalBlockFile(scope: !383, file: !65, discriminator: 4)
!386 = !DILocation(line: 434, column: 4, scope: !332)
!387 = !DILocation(line: 436, column: 4, scope: !104)
!388 = !DILocation(line: 439, column: 20, scope: !104)
!389 = !DILocation(line: 439, column: 4, scope: !104)
!390 = !DILocation(line: 440, column: 8, scope: !104)
!391 = !DILocation(line: 440, column: 4, scope: !104)
!392 = !DILocation(line: 442, column: 4, scope: !104)
!393 = !DILocation(line: 443, column: 8, scope: !394)
!394 = distinct !DILexicalBlock(scope: !104, file: !65, line: 443, column: 8)
!395 = !DILocation(line: 443, column: 12, scope: !394)
!396 = !DILocation(line: 443, column: 8, scope: !104)
!397 = !DILocation(line: 444, column: 28, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !65, line: 443, column: 20)
!399 = !DILocation(line: 444, column: 7, scope: !398)
!400 = !DILocation(line: 445, column: 4, scope: !398)
!401 = !DILocation(line: 446, column: 8, scope: !402)
!402 = distinct !DILexicalBlock(scope: !104, file: !65, line: 446, column: 8)
!403 = !DILocation(line: 446, column: 12, scope: !402)
!404 = !DILocation(line: 446, column: 8, scope: !104)
!405 = !DILocation(line: 447, column: 12, scope: !406)
!406 = distinct !DILexicalBlock(scope: !407, file: !65, line: 447, column: 11)
!407 = distinct !DILexicalBlock(scope: !402, file: !65, line: 446, column: 20)
!408 = !DILocation(line: 447, column: 11, scope: !406)
!409 = !DILocation(line: 447, column: 19, scope: !406)
!410 = !DILocation(line: 447, column: 11, scope: !407)
!411 = !DILocation(line: 448, column: 27, scope: !412)
!412 = distinct !DILexicalBlock(scope: !406, file: !65, line: 447, column: 27)
!413 = !DILocation(line: 448, column: 26, scope: !412)
!414 = !DILocation(line: 448, column: 10, scope: !412)
!415 = !DILocation(line: 449, column: 7, scope: !412)
!416 = !DILocation(line: 450, column: 17, scope: !407)
!417 = !DILocation(line: 450, column: 8, scope: !407)
!418 = !DILocation(line: 450, column: 15, scope: !407)
!419 = !DILocation(line: 451, column: 11, scope: !420)
!420 = distinct !DILexicalBlock(scope: !407, file: !65, line: 451, column: 11)
!421 = !DILocation(line: 451, column: 17, scope: !420)
!422 = !DILocation(line: 451, column: 11, scope: !407)
!423 = !DILocation(line: 452, column: 27, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !65, line: 451, column: 25)
!425 = !DILocation(line: 452, column: 35, scope: !424)
!426 = !DILocation(line: 452, column: 11, scope: !424)
!427 = !DILocation(line: 452, column: 17, scope: !424)
!428 = !DILocation(line: 453, column: 7, scope: !424)
!429 = !DILocation(line: 454, column: 4, scope: !407)
!430 = !DILocation(line: 455, column: 11, scope: !104)
!431 = !DILocation(line: 455, column: 4, scope: !104)
!432 = !DILocation(line: 456, column: 11, scope: !104)
!433 = !DILocation(line: 456, column: 4, scope: !104)
!434 = !DILocation(line: 457, column: 11, scope: !104)
!435 = !DILocation(line: 457, column: 4, scope: !104)
!436 = !DILocation(line: 458, column: 12, scope: !104)
!437 = !DILocation(line: 458, column: 16, scope: !104)
!438 = !DILocation(line: 458, column: 4, scope: !104)
!439 = !DILocation(line: 459, column: 1, scope: !104)
!440 = distinct !DISubprogram(name: "VMToolsGetToolsConfFile", scope: !65, file: !65, line: 278, type: !441, isLocal: true, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !118)
!441 = !DISubroutineType(types: !442)
!442 = !{!73}
!443 = !DILocalVariable(name: "confPath", scope: !440, file: !65, line: 280, type: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!445 = !DILocation(line: 280, column: 10, scope: !440)
!446 = !DILocation(line: 280, column: 21, scope: !440)
!447 = !DILocalVariable(name: "confFilePath", scope: !440, file: !65, line: 281, type: !73)
!448 = !DILocation(line: 281, column: 11, scope: !440)
!449 = !DILocation(line: 291, column: 8, scope: !450)
!450 = distinct !DILexicalBlock(scope: !440, file: !65, line: 291, column: 8)
!451 = !DILocation(line: 291, column: 17, scope: !450)
!452 = !DILocation(line: 291, column: 8, scope: !440)
!453 = !DILocation(line: 292, column: 18, scope: !454)
!454 = distinct !DILexicalBlock(scope: !450, file: !65, line: 291, column: 25)
!455 = !DILocation(line: 292, column: 16, scope: !454)
!456 = !DILocation(line: 294, column: 4, scope: !454)
!457 = !DILocation(line: 295, column: 36, scope: !440)
!458 = !DILocation(line: 295, column: 19, scope: !440)
!459 = !DILocation(line: 295, column: 17, scope: !440)
!460 = !DILocation(line: 296, column: 9, scope: !440)
!461 = !DILocation(line: 296, column: 4, scope: !440)
!462 = !DILocation(line: 298, column: 11, scope: !440)
!463 = !DILocation(line: 298, column: 4, scope: !440)
!464 = distinct !DISubprogram(name: "VMToolsConfigLoadLegacy", scope: !65, file: !65, line: 69, type: !465, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !118)
!465 = !DISubroutineType(types: !466)
!466 = !{!123}
!467 = !DILocalVariable(name: "path", scope: !464, file: !65, line: 71, type: !73)
!468 = !DILocation(line: 71, column: 11, scope: !464)
!469 = !DILocalVariable(name: "localPath", scope: !464, file: !65, line: 72, type: !73)
!470 = !DILocation(line: 72, column: 11, scope: !464)
!471 = !DILocalVariable(name: "confPath", scope: !464, file: !65, line: 73, type: !444)
!472 = !DILocation(line: 73, column: 10, scope: !464)
!473 = !DILocation(line: 73, column: 21, scope: !464)
!474 = !DILocalVariable(name: "success", scope: !464, file: !65, line: 74, type: !107)
!475 = !DILocation(line: 74, column: 13, scope: !464)
!476 = !DILocalVariable(name: "stream", scope: !464, file: !65, line: 75, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !479, line: 48, baseType: !480)
!479 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !481, line: 241, size: 1728, align: 64, elements: !482)
!481 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !503, !504, !505, !506, !507, !509, !511, !515, !518, !520, !521, !522, !523, !524, !527, !528}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !480, file: !481, line: 242, baseType: !109, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !480, file: !481, line: 247, baseType: !444, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !480, file: !481, line: 248, baseType: !444, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !480, file: !481, line: 249, baseType: !444, size: 64, align: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !480, file: !481, line: 250, baseType: !444, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !480, file: !481, line: 251, baseType: !444, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !480, file: !481, line: 252, baseType: !444, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !480, file: !481, line: 253, baseType: !444, size: 64, align: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !480, file: !481, line: 254, baseType: !444, size: 64, align: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !480, file: !481, line: 256, baseType: !444, size: 64, align: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !480, file: !481, line: 257, baseType: !444, size: 64, align: 64, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !480, file: !481, line: 258, baseType: !444, size: 64, align: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !480, file: !481, line: 260, baseType: !496, size: 64, align: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !481, line: 156, size: 192, align: 64, elements: !498)
!498 = !{!499, !500, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !497, file: !481, line: 157, baseType: !496, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !497, file: !481, line: 158, baseType: !501, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !497, file: !481, line: 162, baseType: !109, size: 32, align: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !480, file: !481, line: 262, baseType: !501, size: 64, align: 64, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !480, file: !481, line: 264, baseType: !109, size: 32, align: 32, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !480, file: !481, line: 268, baseType: !109, size: 32, align: 32, offset: 928)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !480, file: !481, line: 270, baseType: !171, size: 64, align: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !480, file: !481, line: 274, baseType: !508, size: 16, align: 16, offset: 1024)
!508 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !480, file: !481, line: 275, baseType: !510, size: 8, align: 8, offset: 1040)
!510 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !480, file: !481, line: 276, baseType: !512, size: 8, align: 8, offset: 1048)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, align: 8, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 1)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !480, file: !481, line: 280, baseType: !516, size: 64, align: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !481, line: 150, baseType: null)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !480, file: !481, line: 289, baseType: !519, size: 64, align: 64, offset: 1152)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 132, baseType: !117)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !480, file: !481, line: 297, baseType: !72, size: 64, align: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !480, file: !481, line: 298, baseType: !72, size: 64, align: 64, offset: 1280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !480, file: !481, line: 299, baseType: !72, size: 64, align: 64, offset: 1344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !480, file: !481, line: 300, baseType: !72, size: 64, align: 64, offset: 1408)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !480, file: !481, line: 302, baseType: !525, size: 64, align: 64, offset: 1472)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !526, line: 216, baseType: !156)
!526 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1151")
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !480, file: !481, line: 303, baseType: !109, size: 32, align: 32, offset: 1536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !480, file: !481, line: 305, baseType: !529, size: 160, align: 8, offset: 1568)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, align: 8, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 20)
!532 = !DILocation(line: 75, column: 10, scope: !464)
!533 = !DILocalVariable(name: "dict", scope: !464, file: !65, line: 76, type: !123)
!534 = !DILocation(line: 76, column: 16, scope: !464)
!535 = !DILocation(line: 78, column: 8, scope: !536)
!536 = distinct !DILexicalBlock(scope: !464, file: !65, line: 78, column: 8)
!537 = !DILocation(line: 78, column: 17, scope: !536)
!538 = !DILocation(line: 78, column: 8, scope: !464)
!539 = !DILocation(line: 79, column: 7, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !65, line: 78, column: 25)
!541 = !DILocation(line: 83, column: 37, scope: !464)
!542 = !DILocation(line: 83, column: 11, scope: !464)
!543 = !DILocation(line: 83, column: 9, scope: !464)
!544 = !DILocation(line: 84, column: 38, scope: !464)
!545 = !DILocation(line: 84, column: 16, scope: !464)
!546 = !DILocation(line: 84, column: 14, scope: !464)
!547 = !DILocation(line: 85, column: 8, scope: !548)
!548 = distinct !DILexicalBlock(scope: !464, file: !65, line: 85, column: 8)
!549 = !DILocation(line: 85, column: 18, scope: !548)
!550 = !DILocation(line: 85, column: 8, scope: !464)
!551 = !DILocation(line: 86, column: 7, scope: !552)
!552 = distinct !DILexicalBlock(scope: !548, file: !65, line: 85, column: 26)
!553 = !DILocation(line: 87, column: 7, scope: !552)
!554 = !DILocation(line: 90, column: 19, scope: !464)
!555 = !DILocation(line: 90, column: 13, scope: !464)
!556 = !DILocation(line: 90, column: 11, scope: !464)
!557 = !DILocation(line: 91, column: 8, scope: !558)
!558 = distinct !DILexicalBlock(scope: !464, file: !65, line: 91, column: 8)
!559 = !DILocation(line: 91, column: 15, scope: !558)
!560 = !DILocation(line: 91, column: 8, scope: !464)
!561 = !DILocation(line: 92, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !558, file: !65, line: 91, column: 23)
!563 = !DILocation(line: 95, column: 11, scope: !464)
!564 = !DILocation(line: 95, column: 9, scope: !464)
!565 = !DILocation(line: 97, column: 4, scope: !464)
!566 = !DILocalVariable(name: "name", scope: !567, file: !65, line: 98, type: !444)
!567 = distinct !DILexicalBlock(scope: !568, file: !65, line: 97, column: 13)
!568 = distinct !DILexicalBlock(scope: !569, file: !65, line: 97, column: 4)
!569 = distinct !DILexicalBlock(scope: !464, file: !65, line: 97, column: 4)
!570 = !DILocation(line: 98, column: 13, scope: !567)
!571 = !DILocalVariable(name: "value", scope: !567, file: !65, line: 99, type: !444)
!572 = !DILocation(line: 99, column: 13, scope: !567)
!573 = !DILocalVariable(name: "line", scope: !567, file: !65, line: 100, type: !444)
!574 = !DILocation(line: 100, column: 13, scope: !567)
!575 = !DILocalVariable(name: "status", scope: !567, file: !65, line: 101, type: !109)
!576 = !DILocation(line: 101, column: 11, scope: !567)
!577 = !DILocation(line: 103, column: 32, scope: !567)
!578 = !DILocation(line: 103, column: 16, scope: !567)
!579 = !DILocation(line: 103, column: 14, scope: !567)
!580 = !DILocation(line: 104, column: 11, scope: !581)
!581 = distinct !DILexicalBlock(scope: !567, file: !65, line: 104, column: 11)
!582 = !DILocation(line: 104, column: 18, scope: !581)
!583 = !DILocation(line: 104, column: 11, scope: !567)
!584 = !DILocation(line: 105, column: 95, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !65, line: 104, column: 24)
!586 = !DILocation(line: 105, column: 101, scope: !585)
!587 = !DILocation(line: 105, column: 10, scope: !588)
!588 = !DILexicalBlockFile(scope: !585, file: !65, discriminator: 1)
!589 = !DILocation(line: 107, column: 10, scope: !585)
!590 = !DILocation(line: 108, column: 18, scope: !591)
!591 = distinct !DILexicalBlock(scope: !581, file: !65, line: 108, column: 18)
