; ModuleID = './dataMap.o.i'
source_filename = "./dataMap.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.DataMap = type { %struct.HashMap*, i64 }
%struct.HashMap = type opaque
%struct.DataMapEntry = type { i32, %union.DMFieldValue }
%union.DMFieldValue = type { %struct.anon.0 }
%struct.anon.0 = type { i32, i8* }
%struct.ClientData = type { %struct.DataMap*, i32, i8*, i32, i32, i32, %struct.FieldIdNameEntry*, i32 }
%struct.FieldIdNameEntry = type { i32, i8* }
%struct.anon = type { i64 }
%struct.anon.1 = type { i32, i64* }
%struct.anon.2 = type { i8**, i32* }

@.str = private unnamed_addr constant [20 x i8] c" DATA TRUNCATED!!!\0A\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"--> Begin\0A\00", align 1
@.str.2 = private unnamed_addr constant [10 x i8] c"--> End.\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.4 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"int64\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"string\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"int64List\00", align 1
@.str.8 = private unnamed_addr constant [2 x i8] c",\00", align 1
@.str.9 = private unnamed_addr constant [5 x i8] c",...\00", align 1
@.str.10 = private unnamed_addr constant [11 x i8] c"stringList\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !41, globals: !130)
!1 = !DIFile(filename: "dataMap.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!2 = !{!3, !12, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 65, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dataMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!5 = !{!6, !7, !8, !9, !10, !11}
!6 = !DIEnumerator(name: "DMFIELDTYPE_EMPTY", value: 0)
!7 = !DIEnumerator(name: "DMFIELDTYPE_INT64", value: 1)
!8 = !DIEnumerator(name: "DMFIELDTYPE_STRING", value: 2)
!9 = !DIEnumerator(name: "DMFIELDTYPE_INT64LIST", value: 3)
!10 = !DIEnumerator(name: "DMFIELDTYPE_STRINGLIST", value: 4)
!11 = !DIEnumerator(name: "DMFIELDTYPE_MAX", value: 5)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "DMERR_SUCCESS", value: 0)
!15 = !DIEnumerator(name: "DMERR_NOT_FOUND", value: 1)
!16 = !DIEnumerator(name: "DMERR_ALREADY_EXIST", value: 2)
!17 = !DIEnumerator(name: "DMERR_DUPLICATED_FIELD_IDS", value: 3)
!18 = !DIEnumerator(name: "DMERR_INSUFFICIENT_MEM", value: 4)
!19 = !DIEnumerator(name: "DMERR_TYPE_MISMATCH", value: 5)
!20 = !DIEnumerator(name: "DMERR_INVALID_ARGS", value: 6)
!21 = !DIEnumerator(name: "DMERR_UNKNOWN_TYPE", value: 7)
!22 = !DIEnumerator(name: "DMERR_TRUNCATED_DATA", value: 8)
!23 = !DIEnumerator(name: "DMERR_BUFFER_TOO_SMALL", value: 9)
!24 = !DIEnumerator(name: "DMERR_INTEGER_OVERFLOW", value: 10)
!25 = !DIEnumerator(name: "DMERR_BAD_DATA", value: 11)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 46, size: 32, align: 32, elements: !28)
!27 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!29 = !DIEnumerator(name: "_ISupper", value: 256)
!30 = !DIEnumerator(name: "_ISlower", value: 512)
!31 = !DIEnumerator(name: "_ISalpha", value: 1024)
!32 = !DIEnumerator(name: "_ISdigit", value: 2048)
!33 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!34 = !DIEnumerator(name: "_ISspace", value: 8192)
!35 = !DIEnumerator(name: "_ISprint", value: 16384)
!36 = !DIEnumerator(name: "_ISgraph", value: 32768)
!37 = !DIEnumerator(name: "_ISblank", value: 1)
!38 = !DIEnumerator(name: "_IScntrl", value: 2)
!39 = !DIEnumerator(name: "_ISpunct", value: 4)
!40 = !DIEnumerator(name: "_ISalnum", value: 8)
!41 = !{!42, !43, !45, !60, !61, !101, !103, !93, !98, !100, !112, !127, !84, !76, !55, !62, !128, !86, !129}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataMap", file: !4, line: 77, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 74, size: 128, align: 64, elements: !48)
!48 = !{!49, !54}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !47, file: !4, line: 75, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMap", file: !52, line: 45, baseType: !53)
!52 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", file: !52, line: 45, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !47, file: !4, line: 76, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !56, line: 171, baseType: !57)
!56 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !58, line: 55, baseType: !59)
!58 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!59 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFieldType", file: !4, line: 72, baseType: !3)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataMapEntry", file: !64, line: 75, baseType: !65)
!64 = !DIFile(filename: "dataMap.c", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 72, size: 192, align: 64, elements: !66)
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !64, line: 73, baseType: !60, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !65, file: !64, line: 74, baseType: !69, size: 128, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFieldValue", file: !64, line: 70, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !64, line: 51, size: 128, align: 64, elements: !71)
!71 = !{!72, !80, !88, !94}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !70, file: !64, line: 54, baseType: !73, size: 64, align: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !64, line: 52, size: 64, align: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !73, file: !64, line: 53, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !56, line: 172, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !78, line: 197, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line112")
!79 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !70, file: !64, line: 59, baseType: !81, size: 128, align: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !64, line: 56, size: 128, align: 64, elements: !82)
!82 = !{!83, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !81, file: !64, line: 57, baseType: !84, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !56, line: 174, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !78, line: 196, baseType: !86)
!86 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !81, file: !64, line: 58, baseType: !43, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "numList", scope: !70, file: !64, line: 64, baseType: !89, size: 128, align: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !64, line: 61, size: 128, align: 64, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !89, file: !64, line: 62, baseType: !84, size: 32, align: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !89, file: !64, line: 63, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "strList", scope: !70, file: !64, line: 69, baseType: !95, size: 128, align: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !64, line: 66, size: 128, align: 64, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "strings", scope: !95, file: !64, line: 67, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !95, file: !64, line: 68, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMKeyType", file: !4, line: 42, baseType: !84)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClientData", file: !64, line: 91, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 78, size: 448, align: 64, elements: !106)
!106 = !{!107, !108, !110, !111, !115, !116, !117, !126}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !105, file: !64, line: 79, baseType: !45, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !105, file: !64, line: 80, baseType: !109, size: 32, align: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorCode", file: !4, line: 60, baseType: !12)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !105, file: !64, line: 85, baseType: !43, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "buffLen", scope: !105, file: !64, line: 86, baseType: !112, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !56, line: 173, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 51, baseType: !114)
!114 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "maxNumElems", scope: !105, file: !64, line: 87, baseType: !112, size: 32, align: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "maxStrLen", scope: !105, file: !64, line: 88, baseType: !112, size: 32, align: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fieldIdList", scope: !105, file: !64, line: 89, baseType: !118, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "FieldIdNameEntry", file: !4, line: 82, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 79, size: 128, align: 64, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fieldId", scope: !120, file: !4, line: 80, baseType: !102, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fieldName", scope: !120, file: !4, line: 81, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fieldIdListLen", scope: !105, file: !64, line: 90, baseType: !112, size: 32, align: 32, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!128 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!130 = !{!131}
!131 = distinct !DIGlobalVariable(name: "magic_cookie", scope: !0, file: !64, line: 93, type: !132, isLocal: true, isDefinition: true, variable: i64 331807672643)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!136 = distinct !DISubprogram(name: "DataMap_GetType", scope: !64, file: !64, line: 721, type: !137, isLocal: false, isDefinition: true, scopeLine: 723, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !141)
!137 = !DISubroutineType(types: !138)
!138 = !{!60, !139, !102}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!141 = !{}
!142 = !DILocalVariable(name: "that", arg: 1, scope: !136, file: !64, line: 721, type: !139)
!143 = !DIExpression()
!144 = !DILocation(line: 721, column: 32, scope: !136)
!145 = !DILocalVariable(name: "fieldId", arg: 2, scope: !136, file: !64, line: 722, type: !102)
!146 = !DILocation(line: 722, column: 27, scope: !136)
!147 = !DILocalVariable(name: "entry", scope: !136, file: !64, line: 724, type: !62)
!148 = !DILocation(line: 724, column: 18, scope: !136)
!149 = !DILocation(line: 728, column: 24, scope: !136)
!150 = !DILocation(line: 728, column: 30, scope: !136)
!151 = !DILocation(line: 728, column: 12, scope: !136)
!152 = !DILocation(line: 728, column: 10, scope: !136)
!153 = !DILocation(line: 729, column: 8, scope: !154)
!154 = distinct !DILexicalBlock(scope: !136, file: !64, line: 729, column: 8)
!155 = !DILocation(line: 729, column: 14, scope: !154)
!156 = !DILocation(line: 729, column: 8, scope: !136)
!157 = !DILocation(line: 730, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !154, file: !64, line: 729, column: 22)
!159 = !DILocation(line: 732, column: 14, scope: !160)
!160 = distinct !DILexicalBlock(scope: !154, file: !64, line: 731, column: 11)
!161 = !DILocation(line: 732, column: 21, scope: !160)
!162 = !DILocation(line: 732, column: 7, scope: !160)
!163 = !DILocation(line: 734, column: 1, scope: !136)
!164 = distinct !DISubprogram(name: "LookupEntry", scope: !64, file: !64, line: 687, type: !165, isLocal: true, isDefinition: true, scopeLine: 689, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !141)
!165 = !DISubroutineType(types: !166)
!166 = !{!62, !139, !102}
!167 = !DILocalVariable(name: "that", arg: 1, scope: !164, file: !64, line: 687, type: !139)
!168 = !DILocation(line: 687, column: 28, scope: !164)
!169 = !DILocalVariable(name: "fieldId", arg: 2, scope: !164, file: !64, line: 688, type: !102)
!170 = !DILocation(line: 688, column: 23, scope: !164)
!171 = !DILocation(line: 690, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !164, file: !64, line: 690, column: 8)
!173 = !DILocation(line: 690, column: 14, scope: !172)
!174 = !DILocation(line: 690, column: 22, scope: !172)
!175 = !DILocation(line: 690, column: 26, scope: !176)
!176 = !DILexicalBlockFile(scope: !172, file: !64, discriminator: 1)
!177 = !DILocation(line: 690, column: 32, scope: !176)
!178 = !DILocation(line: 690, column: 36, scope: !176)
!179 = !DILocation(line: 690, column: 8, scope: !176)
!180 = !DILocalVariable(name: "rv", scope: !181, file: !64, line: 691, type: !42)
!181 = distinct !DILexicalBlock(scope: !172, file: !64, line: 690, column: 46)
!182 = !DILocation(line: 691, column: 13, scope: !181)
!183 = !DILocation(line: 691, column: 30, scope: !181)
