; ModuleID = './vmware_guestproxycerttool-cert_util.o.i'
source_filename = "./vmware_guestproxycerttool-cert_util.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._GRegex = type opaque
%struct._GDir = type opaque
%struct._GError = type { i32, i32, i8* }
%struct._GMappedFile = type opaque
%struct._GMatchInfo = type opaque

@.str = private unnamed_addr constant [6 x i8] c"%s.%d\00", align 1
@CertUtil_GetToolDir.path = internal global i8* null, align 8
@.str.1 = private unnamed_addr constant [2 x i8] c"/\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"etc\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"vmware-tools\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [27 x i8] c"%s: Unable to map %s: %s.\0A\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.6 = private unnamed_addr constant [28 x i8] c"%s: Failed to open %s: %s.\0A\00", align 1
@.str.7 = private unnamed_addr constant [34 x i8] c"%s: Failed to copy %s to %s: %s.\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, globals: !27)
!1 = !DIFile(filename: "vmware_guestproxycerttool-cert_util.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 66, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gfileutils.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "G_FILE_TEST_IS_REGULAR", value: 1)
!7 = !DIEnumerator(name: "G_FILE_TEST_IS_SYMLINK", value: 2)
!8 = !DIEnumerator(name: "G_FILE_TEST_IS_DIR", value: 4)
!9 = !DIEnumerator(name: "G_FILE_TEST_IS_EXECUTABLE", value: 8)
!10 = !DIEnumerator(name: "G_FILE_TEST_EXISTS", value: 16)
!11 = !{!12, !13, !16, !18, !24}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !14, line: 49, baseType: !15)
!14 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !14, line: 48, baseType: !17)
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !20, line: 37, baseType: !21)
!20 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !20, line: 39, size: 192, align: 64, elements: !22)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !20, line: 41, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !14, line: 77, baseType: !12)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !20, line: 42, baseType: !18, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !20, line: 43, baseType: !18, size: 64, align: 64, offset: 128)
!27 = !{!28}
!28 = distinct !DIGlobalVariable(name: "path", scope: !29, file: !30, line: 360, type: !38, isLocal: true, isDefinition: true, variable: i8** @CertUtil_GetToolDir.path)
!29 = distinct !DISubprogram(name: "CertUtil_GetToolDir", scope: !30, file: !30, line: 358, type: !31, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!30 = !DIFile(filename: "cert_util.c", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!31 = !DISubroutineType(types: !32)
!32 = !{!33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !14, line: 46, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !{}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!39 = !{i32 2, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!42 = distinct !DISubprogram(name: "CertUtil_CreateCertFileName", scope: !30, file: !30, line: 122, type: !43, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!43 = !DISubroutineType(types: !44)
!44 = !{!38, !33, !33, !15}
!45 = !DILocalVariable(name: "certDir", arg: 1, scope: !42, file: !30, line: 122, type: !33)
!46 = !DIExpression()
!47 = !DILocation(line: 122, column: 42, scope: !42)
!48 = !DILocalVariable(name: "hash", arg: 2, scope: !42, file: !30, line: 123, type: !33)
!49 = !DILocation(line: 123, column: 42, scope: !42)
!50 = !DILocalVariable(name: "version", arg: 3, scope: !42, file: !30, line: 124, type: !15)
!51 = !DILocation(line: 124, column: 33, scope: !42)
!52 = !DILocalVariable(name: "ret", scope: !42, file: !30, line: 126, type: !38)
!53 = !DILocation(line: 126, column: 11, scope: !42)
!54 = !DILocalVariable(name: "tmp", scope: !42, file: !30, line: 127, type: !38)
!55 = !DILocation(line: 127, column: 11, scope: !42)
!56 = !DILocation(line: 129, column: 35, scope: !42)
!57 = !DILocation(line: 129, column: 41, scope: !42)
!58 = !DILocation(line: 129, column: 10, scope: !42)
!59 = !DILocation(line: 129, column: 8, scope: !42)
!60 = !DILocation(line: 130, column: 27, scope: !42)
!61 = !DILocation(line: 130, column: 36, scope: !42)
!62 = !DILocation(line: 130, column: 10, scope: !42)
!63 = !DILocation(line: 130, column: 8, scope: !42)
!64 = !DILocation(line: 132, column: 11, scope: !42)
!65 = !DILocation(line: 132, column: 4, scope: !42)
!66 = !DILocation(line: 133, column: 11, scope: !42)
!67 = !DILocation(line: 133, column: 4, scope: !42)
!68 = distinct !DISubprogram(name: "CertUtil_FindCert", scope: !30, file: !30, line: 286, type: !69, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !33, !33, !33, !72, !72}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !14, line: 50, baseType: !13)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!73 = !DILocalVariable(name: "certFile", arg: 1, scope: !68, file: !30, line: 286, type: !33)
!74 = !DILocation(line: 286, column: 32, scope: !68)
!75 = !DILocalVariable(name: "certDir", arg: 2, scope: !68, file: !30, line: 287, type: !33)
!76 = !DILocation(line: 287, column: 32, scope: !68)
!77 = !DILocalVariable(name: "hash", arg: 3, scope: !68, file: !30, line: 288, type: !33)
!78 = !DILocation(line: 288, column: 32, scope: !68)
!79 = !DILocalVariable(name: "num", arg: 4, scope: !68, file: !30, line: 289, type: !72)
!80 = !DILocation(line: 289, column: 24, scope: !68)
!81 = !DILocalVariable(name: "last", arg: 5, scope: !68, file: !30, line: 290, type: !72)
!82 = !DILocation(line: 290, column: 24, scope: !68)
!83 = !DILocalVariable(name: "ret", scope: !68, file: !30, line: 292, type: !71)
!84 = !DILocation(line: 292, column: 13, scope: !68)
!85 = !DILocalVariable(name: "node", scope: !68, file: !30, line: 293, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!88 = !DILocation(line: 293, column: 17, scope: !68)
!89 = !DILocalVariable(name: "list", scope: !68, file: !30, line: 294, type: !18)
!90 = !DILocation(line: 294, column: 11, scope: !68)
!91 = !DILocalVariable(name: "path", scope: !68, file: !30, line: 295, type: !38)
!92 = !DILocation(line: 295, column: 11, scope: !68)
!93 = !DILocation(line: 297, column: 13, scope: !68)
!94 = !DILocation(line: 297, column: 17, scope: !68)
!95 = !DILocation(line: 297, column: 5, scope: !68)
!96 = !DILocation(line: 297, column: 10, scope: !68)
!97 = !DILocation(line: 298, column: 20, scope: !98)
!98 = distinct !DILexicalBlock(scope: !68, file: !30, line: 298, column: 8)
!99 = !DILocation(line: 298, column: 29, scope: !98)
!100 = !DILocation(line: 298, column: 9, scope: !98)
!101 = !DILocation(line: 298, column: 8, scope: !68)
!102 = !DILocation(line: 299, column: 7, scope: !103)
!103 = distinct !DILexicalBlock(scope: !98, file: !30, line: 298, column: 43)
!104 = !DILocation(line: 302, column: 8, scope: !68)
!105 = !DILocation(line: 303, column: 9, scope: !106)
!106 = distinct !DILexicalBlock(scope: !68, file: !30, line: 303, column: 8)
!107 = !DILocation(line: 303, column: 8, scope: !68)
!108 = !DILocation(line: 304, column: 7, scope: !109)
!109 = distinct !DILexicalBlock(scope: !106, file: !30, line: 303, column: 15)
!110 = !DILocation(line: 308, column: 23, scope: !68)
!111 = !DILocation(line: 308, column: 11, scope: !68)
!112 = !DILocation(line: 308, column: 9, scope: !68)
!113 = !DILocation(line: 309, column: 29, scope: !68)
!114 = !DILocation(line: 309, column: 35, scope: !68)
!115 = !DILocation(line: 309, column: 20, scope: !68)
!116 = !DILocation(line: 309, column: 13, scope: !68)
!117 = !DILocation(line: 309, column: 5, scope: !68)
!118 = !DILocation(line: 309, column: 10, scope: !68)
!119 = !DILocation(line: 311, column: 29, scope: !120)
!120 = distinct !DILexicalBlock(scope: !68, file: !30, line: 311, column: 4)
!121 = !DILocation(line: 311, column: 16, scope: !120)
!122 = !DILocation(line: 311, column: 14, scope: !120)
!123 = !DILocation(line: 311, column: 9, scope: !120)
!124 = !DILocation(line: 311, column: 36, scope: !125)
!125 = !DILexicalBlockFile(scope: !126, file: !30, discriminator: 1)
!126 = distinct !DILexicalBlock(scope: !120, file: !30, line: 311, column: 4)
!127 = !DILocation(line: 311, column: 4, scope: !125)
!128 = !DILocalVariable(name: "same", scope: !129, file: !30, line: 312, type: !71)
!129 = distinct !DILexicalBlock(scope: !126, file: !30, line: 311, column: 51)
!130 = !DILocation(line: 312, column: 16, scope: !129)
!131 = !DILocalVariable(name: "ext", scope: !129, file: !30, line: 313, type: !15)
!132 = !DILocation(line: 313, column: 11, scope: !129)
!133 = !DILocation(line: 313, column: 34, scope: !129)
!134 = !DILocation(line: 313, column: 40, scope: !129)
!135 = !DILocation(line: 313, column: 25, scope: !129)
!136 = !DILocation(line: 313, column: 18, scope: !129)
!137 = !DILocation(line: 315, column: 14, scope: !129)
!138 = !DILocation(line: 315, column: 7, scope: !129)
!139 = !DILocation(line: 316, column: 42, scope: !129)
!140 = !DILocation(line: 316, column: 51, scope: !129)
!141 = !DILocation(line: 316, column: 57, scope: !129)
!142 = !DILocation(line: 316, column: 14, scope: !129)
!143 = !DILocation(line: 316, column: 12, scope: !129)
!144 = !DILocation(line: 318, column: 24, scope: !145)
!145 = distinct !DILexicalBlock(scope: !129, file: !30, line: 318, column: 11)
!146 = !DILocation(line: 318, column: 34, scope: !145)
!147 = !DILocation(line: 318, column: 12, scope: !145)
!148 = !DILocation(line: 318, column: 11, scope: !129)
!149 = !DILocation(line: 319, column: 14, scope: !150)
!150 = distinct !DILexicalBlock(scope: !145, file: !30, line: 318, column: 48)
!151 = !DILocation(line: 320, column: 10, scope: !150)
!152 = !DILocation(line: 323, column: 11, scope: !153)
!153 = distinct !DILexicalBlock(scope: !129, file: !30, line: 323, column: 11)
!154 = !DILocation(line: 323, column: 11, scope: !129)
!155 = !DILocation(line: 324, column: 17, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !30, line: 323, column: 17)
!157 = !DILocation(line: 324, column: 11, scope: !156)
!158 = !DILocation(line: 324, column: 15, scope: !156)
!159 = !DILocation(line: 325, column: 10, scope: !156)
!160 = !DILocation(line: 327, column: 4, scope: !129)
!161 = !DILocation(line: 311, column: 51, scope: !162)
!162 = !DILexicalBlockFile(scope: !126, file: !30, discriminator: 2)
!163 = !DILocation(line: 311, column: 50, scope: !162)
!164 = !DILocation(line: 311, column: 71, scope: !165)
!165 = !DILexicalBlockFile(scope: !126, file: !30, discriminator: 3)
!166 = !DILocation(line: 311, column: 79, scope: !165)
!167 = !DILocation(line: 311, column: 50, scope: !165)
!168 = !DILocation(line: 311, column: 50, scope: !169)
!169 = !DILexicalBlockFile(scope: !126, file: !30, discriminator: 4)
!170 = !DILocation(line: 311, column: 50, scope: !171)
!171 = !DILexicalBlockFile(scope: !126, file: !30, discriminator: 5)
!172 = !DILocation(line: 311, column: 47, scope: !171)
!173 = !DILocation(line: 311, column: 4, scope: !171)
!174 = distinct !{!174, !175}
!175 = !DILocation(line: 311, column: 4, scope: !68)
!176 = !DILocation(line: 327, column: 4, scope: !177)
!177 = !DILexicalBlockFile(scope: !120, file: !30, discriminator: 1)
!178 = !DILocation(line: 330, column: 11, scope: !68)
!179 = !DILocation(line: 330, column: 4, scope: !68)
!180 = !DILocation(line: 331, column: 8, scope: !181)
!181 = distinct !DILexicalBlock(scope: !68, file: !30, line: 331, column: 8)
!182 = !DILocation(line: 331, column: 8, scope: !68)
!183 = !DILocation(line: 332, column: 19, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !30, line: 331, column: 14)
!185 = !DILocation(line: 332, column: 7, scope: !184)
!186 = !DILocation(line: 333, column: 4, scope: !184)
!187 = !DILocation(line: 335, column: 11, scope: !68)
!188 = !DILocation(line: 335, column: 4, scope: !68)
!189 = distinct !DISubprogram(name: "SearchFile", scope: !30, file: !30, line: 223, type: !190, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!190 = !DISubroutineType(types: !191)
!191 = !{!71, !33, !33, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!193 = !DILocalVariable(name: "path", arg: 1, scope: !189, file: !30, line: 223, type: !33)
!194 = !DILocation(line: 223, column: 25, scope: !189)
!195 = !DILocalVariable(name: "fname", arg: 2, scope: !189, file: !30, line: 224, type: !33)
!196 = !DILocation(line: 224, column: 25, scope: !189)
!197 = !DILocalVariable(name: "list", arg: 3, scope: !189, file: !30, line: 225, type: !192)
!198 = !DILocation(line: 225, column: 20, scope: !189)
!199 = !DILocalVariable(name: "ret", scope: !189, file: !30, line: 227, type: !71)
!200 = !DILocation(line: 227, column: 13, scope: !189)
!201 = !DILocalVariable(name: "pattern", scope: !189, file: !30, line: 228, type: !38)
!202 = !DILocation(line: 228, column: 11, scope: !189)
!203 = !DILocalVariable(name: "regExpr", scope: !189, file: !30, line: 229, type: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRegex", file: !206, line: 414, baseType: !207)
!206 = !DIFile(filename: "/usr/include/glib-2.0/glib/gregex.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GRegex", file: !206, line: 414, flags: DIFlagFwdDecl)
!208 = !DILocation(line: 229, column: 12, scope: !189)
!209 = !DILocalVariable(name: "dir", scope: !189, file: !30, line: 230, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDir", file: !212, line: 37, baseType: !213)
!212 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdir.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GDir", file: !212, line: 37, flags: DIFlagFwdDecl)
!214 = !DILocation(line: 230, column: 10, scope: !189)
!215 = !DILocalVariable(name: "error", scope: !189, file: !30, line: 231, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !218, line: 42, baseType: !219)
!218 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !218, line: 44, size: 128, align: 64, elements: !220)
!220 = !{!221, !227, !228}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !219, file: !218, line: 46, baseType: !222, size: 32, align: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !223, line: 36, baseType: !224)
!223 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !225, line: 45, baseType: !226)
!225 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!226 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !219, file: !218, line: 47, baseType: !13, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !219, file: !218, line: 48, baseType: !38, size: 64, align: 64, offset: 64)
!229 = !DILocation(line: 231, column: 12, scope: !189)
!230 = !DILocation(line: 233, column: 43, scope: !189)
!231 = !DILocation(line: 233, column: 14, scope: !189)
!232 = !DILocation(line: 233, column: 12, scope: !189)
!233 = !DILocation(line: 234, column: 26, scope: !189)
!234 = !DILocation(line: 234, column: 14, scope: !189)
!235 = !DILocation(line: 234, column: 12, scope: !189)
!236 = !DILocation(line: 235, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !189, file: !30, line: 235, column: 8)
!238 = !DILocation(line: 235, column: 8, scope: !189)
!239 = !DILocation(line: 236, column: 6, scope: !240)
!240 = distinct !DILexicalBlock(scope: !237, file: !30, line: 235, column: 18)
!241 = !DILocation(line: 236, column: 46, scope: !240)
!242 = !DILocation(line: 236, column: 63, scope: !240)
!243 = !DILocation(line: 236, column: 72, scope: !240)
!244 = !DILocation(line: 236, column: 79, scope: !240)
!245 = !DILocation(line: 236, column: 7, scope: !246)
!246 = !DILexicalBlockFile(scope: !240, file: !30, discriminator: 1)
!247 = !DILocation(line: 237, column: 7, scope: !240)
!248 = !DILocation(line: 240, column: 21, scope: !189)
!249 = !DILocation(line: 240, column: 10, scope: !189)
!250 = !DILocation(line: 240, column: 8, scope: !189)
!251 = !DILocation(line: 241, column: 9, scope: !252)
!252 = distinct !DILexicalBlock(scope: !189, file: !30, line: 241, column: 8)
!253 = !DILocation(line: 241, column: 8, scope: !189)
!254 = !DILocation(line: 242, column: 6, scope: !255)
!255 = distinct !DILexicalBlock(scope: !252, file: !30, line: 241, column: 14)
!256 = !DILocation(line: 242, column: 43, scope: !255)
!257 = !DILocation(line: 242, column: 60, scope: !255)
!258 = !DILocation(line: 242, column: 66, scope: !255)
!259 = !DILocation(line: 242, column: 73, scope: !255)
!260 = !DILocation(line: 242, column: 7, scope: !261)
!261 = !DILexicalBlockFile(scope: !255, file: !30, discriminator: 1)
!262 = !DILocation(line: 243, column: 7, scope: !255)
!263 = !DILocation(line: 246, column: 22, scope: !189)
!264 = !DILocation(line: 246, column: 27, scope: !189)
!265 = !DILocation(line: 246, column: 12, scope: !189)
!266 = !DILocation(line: 246, column: 5, scope: !189)
!267 = !DILocation(line: 246, column: 10, scope: !189)
!268 = !DILocation(line: 247, column: 8, scope: !189)
!269 = !DILocation(line: 247, column: 4, scope: !189)
!270 = !DILocation(line: 250, column: 11, scope: !189)
!271 = !DILocation(line: 250, column: 4, scope: !189)
!272 = !DILocation(line: 251, column: 4, scope: !189)
!273 = !DILocation(line: 252, column: 8, scope: !274)
!274 = distinct !DILexicalBlock(scope: !189, file: !30, line: 252, column: 8)
!275 = !DILocation(line: 252, column: 8, scope: !189)
!276 = !DILocation(line: 253, column: 19, scope: !277)
!277 = distinct !DILexicalBlock(scope: !274, file: !30, line: 252, column: 13)
!278 = !DILocation(line: 253, column: 7, scope: !277)
!279 = !DILocation(line: 254, column: 4, scope: !277)
!280 = !DILocation(line: 255, column: 8, scope: !281)
!281 = distinct !DILexicalBlock(scope: !189, file: !30, line: 255, column: 8)
!282 = !DILocation(line: 255, column: 8, scope: !189)
!283 = !DILocation(line: 256, column: 21, scope: !284)
!284 = distinct !DILexicalBlock(scope: !281, file: !30, line: 255, column: 17)
!285 = !DILocation(line: 256, column: 7, scope: !284)
!286 = !DILocation(line: 257, column: 4, scope: !284)
!287 = !DILocation(line: 259, column: 11, scope: !189)
!288 = !DILocation(line: 259, column: 4, scope: !189)
!289 = distinct !DISubprogram(name: "CompareFile", scope: !30, file: !30, line: 51, type: !290, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!290 = !DISubroutineType(types: !291)
!291 = !{!71, !33, !33, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!293 = !DILocalVariable(name: "fname1", arg: 1, scope: !289, file: !30, line: 51, type: !33)
!294 = !DILocation(line: 51, column: 26, scope: !289)
!295 = !DILocalVariable(name: "fname2", arg: 2, scope: !289, file: !30, line: 52, type: !33)
!296 = !DILocation(line: 52, column: 26, scope: !289)
!297 = !DILocalVariable(name: "same", arg: 3, scope: !289, file: !30, line: 53, type: !292)
!298 = !DILocation(line: 53, column: 23, scope: !289)
!299 = !DILocalVariable(name: "num", scope: !289, file: !30, line: 55, type: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !225, line: 66, baseType: !301)
!301 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!302 = !DILocation(line: 55, column: 10, scope: !289)
!303 = !DILocalVariable(name: "ret", scope: !289, file: !30, line: 56, type: !71)
!304 = !DILocation(line: 56, column: 13, scope: !289)
!305 = !DILocalVariable(name: "m1", scope: !289, file: !30, line: 57, type: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMappedFile", file: !308, line: 32, baseType: !309)
!308 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmappedfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMappedFile", file: !308, line: 32, flags: DIFlagFwdDecl)
!310 = !DILocation(line: 57, column: 17, scope: !289)
!311 = !DILocalVariable(name: "m2", scope: !289, file: !30, line: 58, type: !306)
!312 = !DILocation(line: 58, column: 17, scope: !289)
!313 = !DILocalVariable(name: "error", scope: !289, file: !30, line: 59, type: !216)
!314 = !DILocation(line: 59, column: 12, scope: !289)
!315 = !DILocation(line: 61, column: 27, scope: !289)
!316 = !DILocation(line: 61, column: 9, scope: !289)
!317 = !DILocation(line: 61, column: 7, scope: !289)
!318 = !DILocation(line: 62, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !289, file: !30, line: 62, column: 8)
!320 = !DILocation(line: 62, column: 11, scope: !319)
!321 = !DILocation(line: 62, column: 8, scope: !289)
!322 = !DILocation(line: 63, column: 6, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !30, line: 62, column: 19)
!324 = !DILocation(line: 63, column: 42, scope: !323)
!325 = !DILocation(line: 63, column: 59, scope: !323)
!326 = !DILocation(line: 63, column: 67, scope: !323)
!327 = !DILocation(line: 63, column: 74, scope: !323)
!328 = !DILocation(line: 63, column: 7, scope: !329)
!329 = !DILexicalBlockFile(scope: !323, file: !30, discriminator: 1)
!330 = !DILocation(line: 64, column: 7, scope: !323)
!331 = !DILocation(line: 67, column: 27, scope: !289)
!332 = !DILocation(line: 67, column: 9, scope: !289)
!333 = !DILocation(line: 67, column: 7, scope: !289)
!334 = !DILocation(line: 68, column: 8, scope: !335)
!335 = distinct !DILexicalBlock(scope: !289, file: !30, line: 68, column: 8)
!336 = !DILocation(line: 68, column: 11, scope: !335)
!337 = !DILocation(line: 68, column: 8, scope: !289)
!338 = !DILocation(line: 69, column: 6, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !30, line: 68, column: 19)
!340 = !DILocation(line: 69, column: 42, scope: !339)
!341 = !DILocation(line: 69, column: 59, scope: !339)
!342 = !DILocation(line: 69, column: 67, scope: !339)
!343 = !DILocation(line: 69, column: 74, scope: !339)
!344 = !DILocation(line: 69, column: 7, scope: !345)
!345 = !DILexicalBlockFile(scope: !339, file: !30, discriminator: 1)
!346 = !DILocation(line: 70, column: 7, scope: !339)
!347 = !DILocation(line: 73, column: 8, scope: !289)
!348 = !DILocation(line: 74, column: 5, scope: !289)
!349 = !DILocation(line: 74, column: 10, scope: !289)
!350 = !DILocation(line: 76, column: 35, scope: !289)
!351 = !DILocation(line: 76, column: 10, scope: !289)
!352 = !DILocation(line: 76, column: 8, scope: !289)
!353 = !DILocation(line: 77, column: 33, scope: !354)
!354 = distinct !DILexicalBlock(scope: !289, file: !30, line: 77, column: 8)
!355 = !DILocation(line: 77, column: 8, scope: !354)
!356 = !DILocation(line: 77, column: 40, scope: !354)
!357 = !DILocation(line: 77, column: 37, scope: !354)
!358 = !DILocation(line: 77, column: 8, scope: !289)
!359 = !DILocation(line: 78, column: 11, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !30, line: 78, column: 11)
!361 = distinct !DILexicalBlock(scope: !354, file: !30, line: 77, column: 45)
!362 = !DILocation(line: 78, column: 11, scope: !361)
!363 = !DILocation(line: 79, column: 48, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !30, line: 79, column: 14)
!365 = distinct !DILexicalBlock(scope: !360, file: !30, line: 78, column: 16)
!366 = !DILocation(line: 79, column: 21, scope: !364)
!367 = !DILocation(line: 80, column: 48, scope: !364)
!368 = !DILocation(line: 80, column: 21, scope: !364)
!369 = !DILocation(line: 80, column: 53, scope: !364)
!370 = !DILocation(line: 79, column: 14, scope: !371)
!371 = !DILexicalBlockFile(scope: !364, file: !30, discriminator: 1)
!372 = !DILocation(line: 80, column: 58, scope: !364)
!373 = !DILocation(line: 79, column: 14, scope: !365)
!374 = !DILocation(line: 81, column: 14, scope: !375)
!375 = distinct !DILexicalBlock(scope: !364, file: !30, line: 80, column: 64)
!376 = !DILocation(line: 81, column: 19, scope: !375)
!377 = !DILocation(line: 82, column: 10, scope: !375)
!378 = !DILocation(line: 83, column: 7, scope: !365)
!379 = !DILocation(line: 85, column: 11, scope: !380)
!380 = distinct !DILexicalBlock(scope: !360, file: !30, line: 83, column: 14)
!381 = !DILocation(line: 85, column: 16, scope: !380)
!382 = !DILocation(line: 87, column: 4, scope: !361)
!383 = !DILocation(line: 77, column: 40, scope: !384)
!384 = !DILexicalBlockFile(scope: !354, file: !30, discriminator: 1)
!385 = !DILocation(line: 90, column: 4, scope: !289)
!386 = !DILocation(line: 91, column: 8, scope: !387)
!387 = distinct !DILexicalBlock(scope: !289, file: !30, line: 91, column: 8)
!388 = !DILocation(line: 91, column: 8, scope: !289)
!389 = !DILocation(line: 92, column: 27, scope: !390)
!390 = distinct !DILexicalBlock(scope: !387, file: !30, line: 91, column: 12)
!391 = !DILocation(line: 92, column: 7, scope: !390)
!392 = !DILocation(line: 93, column: 4, scope: !390)
!393 = !DILocation(line: 94, column: 8, scope: !394)
!394 = distinct !DILexicalBlock(scope: !289, file: !30, line: 94, column: 8)
!395 = !DILocation(line: 94, column: 8, scope: !289)
!396 = !DILocation(line: 95, column: 27, scope: !397)
!397 = distinct !DILexicalBlock(scope: !394, file: !30, line: 94, column: 12)
!398 = !DILocation(line: 95, column: 7, scope: !397)
!399 = !DILocation(line: 96, column: 4, scope: !397)
!400 = !DILocation(line: 98, column: 11, scope: !289)
!401 = !DILocation(line: 98, column: 4, scope: !289)
!402 = !DILocation(line: 362, column: 9, scope: !403)
!403 = distinct !DILexicalBlock(scope: !29, file: !30, line: 362, column: 8)
!404 = !DILocation(line: 362, column: 8, scope: !29)
!405 = !DILocation(line: 363, column: 14, scope: !406)
!406 = distinct !DILexicalBlock(scope: !403, file: !30, line: 362, column: 15)
!407 = !DILocation(line: 363, column: 12, scope: !406)
!408 = !DILocation(line: 364, column: 4, scope: !406)
!409 = !DILocation(line: 366, column: 11, scope: !29)
!410 = !DILocation(line: 366, column: 4, scope: !29)
!411 = distinct !DISubprogram(name: "CertUtil_CopyFile", scope: !30, file: !30, line: 388, type: !412, isLocal: false, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !37)
!412 = !DISubroutineType(types: !413)
!413 = !{!71, !33, !33}
!414 = !DILocalVariable(name: "src", arg: 1, scope: !411, file: !30, line: 388, type: !33)
!415 = !DILocation(line: 388, column: 32, scope: !411)
!416 = !DILocalVariable(name: "dst", arg: 2, scope: !411, file: !30, line: 389, type: !33)
!417 = !DILocation(line: 389, column: 32, scope: !411)
!418 = !DILocalVariable(name: "length", scope: !411, file: !30, line: 391, type: !300)
!419 = !DILocation(line: 391, column: 10, scope: !411)
!420 = !DILocalVariable(name: "ret", scope: !411, file: !30, line: 392, type: !71)
!421 = !DILocation(line: 392, column: 13, scope: !411)
!422 = !DILocalVariable(name: "smap", scope: !411, file: !30, line: 393, type: !306)
!423 = !DILocation(line: 393, column: 17, scope: !411)
!424 = !DILocalVariable(name: "error", scope: !411, file: !30, line: 394, type: !216)
!425 = !DILocation(line: 394, column: 12, scope: !411)
!426 = !DILocalVariable(name: "file", scope: !411, file: !30, line: 395, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !429, line: 48, baseType: !430)
!429 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !431, line: 241, size: 1728, align: 64, elements: !432)
!431 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!432 = !{!433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !454, !455, !456, !457, !460, !462, !464, !468, !471, !473, !474, !475, !476, !477, !480, !481}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !430, file: !431, line: 242, baseType: !15, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !430, file: !431, line: 247, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !430, file: !431, line: 248, baseType: !435, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !430, file: !431, line: 249, baseType: !435, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !430, file: !431, line: 250, baseType: !435, size: 64, align: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !430, file: !431, line: 251, baseType: !435, size: 64, align: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !430, file: !431, line: 252, baseType: !435, size: 64, align: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !430, file: !431, line: 253, baseType: !435, size: 64, align: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !430, file: !431, line: 254, baseType: !435, size: 64, align: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !430, file: !431, line: 256, baseType: !435, size: 64, align: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !430, file: !431, line: 257, baseType: !435, size: 64, align: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !430, file: !431, line: 258, baseType: !435, size: 64, align: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !430, file: !431, line: 260, baseType: !447, size: 64, align: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !431, line: 156, size: 192, align: 64, elements: !449)
!449 = !{!450, !451, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !448, file: !431, line: 157, baseType: !447, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !448, file: !431, line: 158, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !448, file: !431, line: 162, baseType: !15, size: 32, align: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !430, file: !431, line: 262, baseType: !452, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !430, file: !431, line: 264, baseType: !15, size: 32, align: 32, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !430, file: !431, line: 268, baseType: !15, size: 32, align: 32, offset: 928)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !430, file: !431, line: 270, baseType: !458, size: 64, align: 64, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !459, line: 131, baseType: !17)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !430, file: !431, line: 274, baseType: !461, size: 16, align: 16, offset: 1024)
!461 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !430, file: !431, line: 275, baseType: !463, size: 8, align: 8, offset: 1040)
!463 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !430, file: !431, line: 276, baseType: !465, size: 8, align: 8, offset: 1048)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 1)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !430, file: !431, line: 280, baseType: !469, size: 64, align: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !431, line: 150, baseType: null)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !430, file: !431, line: 289, baseType: !472, size: 64, align: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !459, line: 132, baseType: !17)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !430, file: !431, line: 297, baseType: !12, size: 64, align: 64, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !430, file: !431, line: 298, baseType: !12, size: 64, align: 64, offset: 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !430, file: !431, line: 299, baseType: !12, size: 64, align: 64, offset: 1344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !430, file: !431, line: 300, baseType: !12, size: 64, align: 64, offset: 1408)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !430, file: !431, line: 302, baseType: !478, size: 64, align: 64, offset: 1472)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !479, line: 216, baseType: !301)
!479 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1364")
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !430, file: !431, line: 303, baseType: !15, size: 32, align: 32, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !430, file: !431, line: 305, baseType: !482, size: 160, align: 8, offset: 1568)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, align: 8, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 20)
!485 = !DILocation(line: 395, column: 10, scope: !411)
!486 = !DILocalVariable(name: "content", scope: !411, file: !30, line: 396, type: !33)
!487 = !DILocation(line: 396, column: 17, scope: !411)
!488 = !DILocation(line: 398, column: 29, scope: !411)
!489 = !DILocation(line: 398, column: 11, scope: !411)
!490 = !DILocation(line: 398, column: 9, scope: !411)
!491 = !DILocation(line: 399, column: 9, scope: !492)
!492 = distinct !DILexicalBlock(scope: !411, file: !30, line: 399, column: 8)
!493 = !DILocation(line: 399, column: 8, scope: !411)
!494 = !DILocation(line: 400, column: 6, scope: !495)
!495 = distinct !DILexicalBlock(scope: !492, file: !30, line: 399, column: 15)
!496 = !DILocation(line: 400, column: 42, scope: !495)
!497 = !DILocation(line: 400, column: 59, scope: !495)
!498 = !DILocation(line: 400, column: 64, scope: !495)
!499 = !DILocation(line: 400, column: 71, scope: !495)
!500 = !DILocation(line: 400, column: 7, scope: !501)
!501 = !DILexicalBlockFile(scope: !495, file: !30, discriminator: 1)
!502 = !DILocation(line: 401, column: 7, scope: !495)
!503 = !DILocation(line: 404, column: 17, scope: !411)
!504 = !DILocation(line: 404, column: 11, scope: !411)
!505 = !DILocation(line: 404, column: 9, scope: !411)
!506 = !DILocation(line: 405, column: 9, scope: !507)
!507 = distinct !DILexicalBlock(scope: !411, file: !30, line: 405, column: 8)
!508 = !DILocation(line: 405, column: 8, scope: !411)
!509 = !DILocation(line: 406, column: 6, scope: !510)
!510 = distinct !DILexicalBlock(scope: !507, file: !30, line: 405, column: 15)
!511 = !DILocation(line: 406, column: 43, scope: !510)
!512 = !DILocation(line: 406, column: 60, scope: !510)
!513 = !DILocation(line: 406, column: 8, scope: !514)
!514 = !DILexicalBlockFile(scope: !510, file: !30, discriminator: 1)
!515 = !DILocation(line: 406, column: 7, scope: !510)
!516 = !DILocation(line: 406, column: 65, scope: !517)
!517 = !DILexicalBlockFile(scope: !510, file: !30, discriminator: 2)
!518 = !DILocation(line: 406, column: 7, scope: !519)
!519 = !DILexicalBlockFile(scope: !510, file: !30, discriminator: 3)
!520 = !DILocation(line: 407, column: 7, scope: !510)
!521 = !DILocation(line: 410, column: 38, scope: !411)
!522 = !DILocation(line: 410, column: 13, scope: !411)
!523 = !DILocation(line: 410, column: 11, scope: !411)
!524 = !DILocation(line: 411, column: 41, scope: !411)
!525 = !DILocation(line: 411, column: 14, scope: !411)
!526 = !DILocation(line: 411, column: 12, scope: !411)
!527 = !DILocation(line: 412, column: 15, scope: !528)
!528 = distinct !DILexicalBlock(scope: !411, file: !30, line: 412, column: 8)
!529 = !DILocation(line: 412, column: 27, scope: !528)
!530 = !DILocation(line: 412, column: 35, scope: !528)
!531 = !DILocation(line: 412, column: 8, scope: !528)
!532 = !DILocation(line: 412, column: 43, scope: !528)
!533 = !DILocation(line: 412, column: 41, scope: !528)
!534 = !DILocation(line: 412, column: 8, scope: !411)
!535 = !DILocation(line: 413, column: 6, scope: !536)
!536 = distinct !DILexicalBlock(scope: !528, file: !30, line: 412, column: 51)
!537 = !DILocation(line: 413, column: 49, scope: !536)
!538 = !DILocation(line: 413, column: 66, scope: !536)
!539 = !DILocation(line: 413, column: 71, scope: !536)
!540 = !DILocation(line: 413, column: 8, scope: !541)
!541 = !DILexicalBlockFile(scope: !536, file: !30, discriminator: 1)
!542 = !DILocation(line: 413, column: 7, scope: !536)
!543 = !DILocation(line: 413, column: 76, scope: !544)
!544 = !DILexicalBlockFile(scope: !536, file: !30, discriminator: 2)
!545 = !DILocation(line: 413, column: 7, scope: !546)
!546 = !DILexicalBlockFile(scope: !536, file: !30, discriminator: 3)
!547 = !DILocation(line: 414, column: 7, scope: !536)
