; ModuleID = './[inter]keepalived--check--check_smtp.o.i'
source_filename = "./[inter]keepalived--check--check_smtp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._conn_opts = type { %struct.sockaddr_storage, %struct.sockaddr_storage, [16 x i8], i32, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !80, globals: !437)
!1 = !DIFile(filename: "[inter]keepalived--check--check_smtp.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !24, !31, !39, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "connect_result", file: !25, line: 34, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "connect_error", value: 0)
!28 = !DIEnumerator(name: "connect_in_progress", value: 1)
!29 = !DIEnumerator(name: "connect_timeout", value: 2)
!30 = !DIEnumerator(name: "connect_success", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 57, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!35 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!36 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!37 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!38 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !40, line: 24, size: 32, align: 32, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50}
!42 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!43 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!44 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!45 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!46 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!47 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!48 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!49 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!50 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 40, size: 32, align: 32, elements: !53)
!52 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!54 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!55 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!56 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!57 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!58 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!59 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!60 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!61 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!62 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!63 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!64 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!65 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!66 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!67 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!68 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!69 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!70 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!71 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!72 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!73 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!74 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!75 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!76 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!77 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!78 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!79 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!80 = !{!81, !92, !306, !178, !122, !87, !421}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "smtp_checker_t", file: !83, line: 62, baseType: !84)
!83 = !DIFile(filename: "./../include/check_smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_smtp_checker", file: !83, line: 47, size: 4544, align: 64, elements: !85)
!85 = !{!86, !89, !91, !117, !121, !124, !304, !305}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "helo_name", scope: !84, file: !83, line: 49, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "host_ctr", scope: !84, file: !83, line: 50, baseType: !90, size: 32, align: 32, offset: 64)
!90 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "host_ptr", scope: !84, file: !83, line: 51, baseType: !92, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !25, line: 50, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !25, line: 42, size: 2240, align: 64, elements: !95)
!95 = !{!96, !110, !111, !115, !116}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !94, file: !25, line: 43, baseType: !97, size: 1024, align: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !98, line: 166, size: 1024, align: 64, elements: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!99 = !{!100, !104, !108}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !97, file: !98, line: 168, baseType: !101, size: 16, align: 16)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !102, line: 28, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!103 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !97, file: !98, line: 169, baseType: !105, size: 944, align: 8, offset: 16)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 944, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 118)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !97, file: !98, line: 170, baseType: !109, size: 64, align: 64, offset: 960)
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !94, file: !25, line: 44, baseType: !97, size: 1024, align: 64, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !94, file: !25, line: 45, baseType: !112, size: 128, align: 8, offset: 2048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !94, file: !25, line: 46, baseType: !90, size: 32, align: 32, offset: 2176)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !94, file: !25, line: 48, baseType: !90, size: 32, align: 32, offset: 2208)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !84, file: !83, line: 54, baseType: !118, size: 4096, align: 8, offset: 192)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 4096, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "buff_ctr", scope: !84, file: !83, line: 55, baseType: !122, size: 64, align: 64, offset: 4288)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 216, baseType: !109)
!123 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buff_cb", scope: !84, file: !83, line: 56, baseType: !125, size: 64, align: 64, offset: 4352)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!128, !129}
!128 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !132)
!132 = !{!133, !134, !136, !268, !273, !274, !284, !297, !299}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !4, line: 79, baseType: !109, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !4, line: 80, baseType: !135, size: 32, align: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !131, file: !4, line: 81, baseType: !137, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !139)
!139 = !{!140, !152, !153, !154, !155, !163, !164, !165, !244, !245, !248, !259, !260, !261, !262, !263, !264, !265, !266}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !138, file: !4, line: 113, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !142, line: 109, baseType: !143)
!142 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !142, line: 106, size: 64, align: 64, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !143, file: !142, line: 108, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !142, line: 97, size: 192, align: 64, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !147, file: !142, line: 99, baseType: !109, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !147, file: !142, line: 102, baseType: !146, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !147, file: !142, line: 103, baseType: !146, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !138, file: !4, line: 114, baseType: !141, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !138, file: !4, line: 115, baseType: !141, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !138, file: !4, line: 116, baseType: !141, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !138, file: !4, line: 117, baseType: !156, size: 128, align: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !157, line: 62, baseType: !158)
!157 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !157, line: 60, size: 128, align: 64, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !157, line: 61, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !158, file: !157, line: 61, baseType: !161, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !138, file: !4, line: 121, baseType: !156, size: 128, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !138, file: !4, line: 122, baseType: !156, size: 128, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !138, file: !4, line: 124, baseType: !166, size: 64, align: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !167, line: 31, baseType: !168)
!167 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !167, line: 39, size: 320, align: 64, elements: !170)
!170 = !{!171, !179, !180, !181, !185}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !169, file: !167, line: 40, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !167, line: 33, size: 192, align: 64, elements: !174)
!174 = !{!175, !176, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !167, line: 34, baseType: !172, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !167, line: 35, baseType: !172, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !167, line: 36, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !169, file: !167, line: 41, baseType: !172, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !169, file: !167, line: 42, baseType: !90, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !169, file: !167, line: 43, baseType: !182, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !178}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !169, file: !167, line: 44, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189, !178}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !191, line: 48, baseType: !192)
!191 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !193, line: 241, size: 1728, align: 64, elements: !194)
!193 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !215, !216, !217, !218, !222, !223, !225, !229, !232, !234, !235, !236, !237, !238, !239, !240}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !193, line: 242, baseType: !128, size: 32, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !193, line: 247, baseType: !87, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !193, line: 248, baseType: !87, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !193, line: 249, baseType: !87, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !193, line: 250, baseType: !87, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !193, line: 251, baseType: !87, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !193, line: 252, baseType: !87, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !193, line: 253, baseType: !87, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !193, line: 254, baseType: !87, size: 64, align: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !193, line: 256, baseType: !87, size: 64, align: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !193, line: 257, baseType: !87, size: 64, align: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !193, line: 258, baseType: !87, size: 64, align: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !193, line: 260, baseType: !208, size: 64, align: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !193, line: 156, size: 192, align: 64, elements: !210)
!210 = !{!211, !212, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !209, file: !193, line: 157, baseType: !208, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !209, file: !193, line: 158, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !209, file: !193, line: 162, baseType: !128, size: 32, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !193, line: 262, baseType: !213, size: 64, align: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !193, line: 264, baseType: !128, size: 32, align: 32, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !193, line: 268, baseType: !128, size: 32, align: 32, offset: 928)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !193, line: 270, baseType: !219, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !220, line: 131, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!221 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !193, line: 274, baseType: !103, size: 16, align: 16, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !193, line: 275, baseType: !224, size: 8, align: 8, offset: 1040)
!224 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !193, line: 276, baseType: !226, size: 8, align: 8, offset: 1048)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8, align: 8, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 1)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !193, line: 280, baseType: !230, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !193, line: 150, baseType: null)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !193, line: 289, baseType: !233, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !220, line: 132, baseType: !221)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !192, file: !193, line: 297, baseType: !178, size: 64, align: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !192, file: !193, line: 298, baseType: !178, size: 64, align: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !192, file: !193, line: 299, baseType: !178, size: 64, align: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !192, file: !193, line: 300, baseType: !178, size: 64, align: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !193, line: 302, baseType: !122, size: 64, align: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !193, line: 303, baseType: !128, size: 32, align: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !193, line: 305, baseType: !241, size: 160, align: 8, offset: 1568)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 160, align: 8, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 20)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !138, file: !4, line: 127, baseType: !141, size: 64, align: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !138, file: !4, line: 128, baseType: !246, size: 64, align: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !138, file: !4, line: 129, baseType: !249, size: 64, align: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !251, file: !4, line: 103, baseType: !129, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !251, file: !4, line: 104, baseType: !129, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !4, line: 105, baseType: !109, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !251, file: !4, line: 106, baseType: !128, size: 32, align: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !251, file: !4, line: 108, baseType: !258, size: 192, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !142, line: 104, baseType: !147)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !138, file: !4, line: 130, baseType: !90, size: 32, align: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !138, file: !4, line: 131, baseType: !90, size: 32, align: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !138, file: !4, line: 132, baseType: !128, size: 32, align: 32, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !138, file: !4, line: 135, baseType: !128, size: 32, align: 32, offset: 992)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !138, file: !4, line: 136, baseType: !129, size: 64, align: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !138, file: !4, line: 146, baseType: !109, size: 64, align: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !138, file: !4, line: 147, baseType: !109, size: 64, align: 64, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !138, file: !4, line: 148, baseType: !267, size: 8, align: 8, offset: 1216)
!267 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !131, file: !4, line: 82, baseType: !269, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!128, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !131, file: !4, line: 83, baseType: !178, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !131, file: !4, line: 84, baseType: !275, size: 128, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !276, line: 31, baseType: !277)
!276 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !278, line: 30, size: 128, align: 64, elements: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!279 = !{!280, !282}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !277, file: !278, line: 32, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !220, line: 139, baseType: !221)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !277, file: !278, line: 33, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !220, line: 141, baseType: !221)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !131, file: !4, line: 92, baseType: !285, size: 64, align: 32, offset: 448)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !4, line: 85, size: 64, align: 32, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !285, file: !4, line: 86, baseType: !128, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !285, file: !4, line: 87, baseType: !128, size: 32, align: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !285, file: !4, line: 91, baseType: !290, size: 64, align: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !4, line: 88, size: 64, align: 32, elements: !291)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !290, file: !4, line: 89, baseType: !293, size: 32, align: 32)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !294, line: 263, baseType: !295)
!294 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !220, line: 133, baseType: !128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !290, file: !4, line: 90, baseType: !128, size: 32, align: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !131, file: !4, line: 93, baseType: !298, size: 64, align: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, scope: !131, file: !4, line: 95, baseType: !300, size: 192, align: 64, offset: 576)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !4, line: 95, size: 192, align: 64, elements: !301)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !300, file: !4, line: 96, baseType: !258, size: 192, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !4, line: 97, baseType: !156, size: 128, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !84, file: !83, line: 58, baseType: !128, size: 32, align: 32, offset: 4416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !84, file: !83, line: 61, baseType: !166, size: 64, align: 64, offset: 4480)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !308, line: 60, baseType: !309)
!308 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !308, line: 40, size: 1024, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !318, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !309, file: !308, line: 41, baseType: !182, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !309, file: !308, line: 42, baseType: !186, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !309, file: !308, line: 43, baseType: !269, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !309, file: !308, line: 44, baseType: !315, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!267, !178, !178}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !309, file: !308, line: 45, baseType: !319, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !321, line: 180, baseType: !322)
!321 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !321, line: 131, size: 2560, align: 64, elements: !323)
!323 = !{!324, !325, !333, !334, !337, !378, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !322, file: !321, line: 132, baseType: !87, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !322, file: !321, line: 133, baseType: !326, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !321, line: 128, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !321, line: 124, size: 192, align: 64, elements: !329)
!329 = !{!330, !331, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !328, file: !321, line: 125, baseType: !87, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !328, file: !321, line: 126, baseType: !166, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !328, file: !321, line: 127, baseType: !166, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !322, file: !321, line: 134, baseType: !97, size: 1024, align: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !322, file: !321, line: 135, baseType: !335, size: 32, align: 32, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !336, line: 51, baseType: !90)
!336 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !322, file: !321, line: 136, baseType: !338, size: 64, align: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !321, line: 102, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !321, line: 62, size: 1920, align: 64, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !340, file: !321, line: 63, baseType: !97, size: 1024, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !340, file: !321, line: 64, baseType: !128, size: 32, align: 32, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !340, file: !321, line: 65, baseType: !128, size: 32, align: 32, offset: 1056)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !340, file: !321, line: 66, baseType: !128, size: 32, align: 32, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !340, file: !321, line: 68, baseType: !90, size: 32, align: 32, offset: 1120)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !340, file: !321, line: 69, baseType: !335, size: 32, align: 32, offset: 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !340, file: !321, line: 70, baseType: !335, size: 32, align: 32, offset: 1184)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !340, file: !321, line: 71, baseType: !128, size: 32, align: 32, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !340, file: !321, line: 74, baseType: !351, size: 64, align: 64, offset: 1280)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !353, line: 65, baseType: !354)
!353 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !353, line: 59, size: 192, align: 64, elements: !355)
!355 = !{!356, !358, !359, !360, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !354, file: !353, line: 60, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !354, file: !353, line: 61, baseType: !128, size: 32, align: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !353, line: 62, baseType: !128, size: 32, align: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !354, file: !353, line: 63, baseType: !361, size: 32, align: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !294, line: 240, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !220, line: 125, baseType: !90)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !354, file: !353, line: 64, baseType: !364, size: 32, align: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !294, line: 235, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !220, line: 126, baseType: !90)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !340, file: !321, line: 75, baseType: !351, size: 64, align: 64, offset: 1344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !340, file: !321, line: 76, baseType: !128, size: 32, align: 32, offset: 1408)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !340, file: !321, line: 77, baseType: !109, size: 64, align: 64, offset: 1472)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !340, file: !321, line: 78, baseType: !109, size: 64, align: 64, offset: 1536)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !340, file: !321, line: 79, baseType: !90, size: 32, align: 32, offset: 1600)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !340, file: !321, line: 80, baseType: !109, size: 64, align: 64, offset: 1664)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !340, file: !321, line: 81, baseType: !128, size: 32, align: 32, offset: 1728)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !340, file: !321, line: 83, baseType: !267, size: 8, align: 8, offset: 1760)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !340, file: !321, line: 84, baseType: !90, size: 32, align: 32, offset: 1792)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !340, file: !321, line: 85, baseType: !267, size: 8, align: 8, offset: 1824)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !340, file: !321, line: 86, baseType: !267, size: 8, align: 8, offset: 1832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !340, file: !321, line: 87, baseType: !87, size: 64, align: 64, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !322, file: !321, line: 137, baseType: !379, size: 16, align: 16, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !336, line: 49, baseType: !103)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !322, file: !321, line: 138, baseType: !379, size: 16, align: 16, offset: 1296)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !322, file: !321, line: 139, baseType: !267, size: 8, align: 8, offset: 1312)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !322, file: !321, line: 140, baseType: !128, size: 32, align: 32, offset: 1344)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !322, file: !321, line: 142, baseType: !112, size: 128, align: 8, offset: 1376)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !322, file: !321, line: 143, baseType: !335, size: 32, align: 32, offset: 1504)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !322, file: !321, line: 144, baseType: !335, size: 32, align: 32, offset: 1536)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !322, file: !321, line: 146, baseType: !112, size: 128, align: 8, offset: 1568)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !322, file: !321, line: 148, baseType: !90, size: 32, align: 32, offset: 1696)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !322, file: !321, line: 149, baseType: !335, size: 32, align: 32, offset: 1728)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !322, file: !321, line: 151, baseType: !87, size: 64, align: 64, offset: 1792)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !322, file: !321, line: 153, baseType: !128, size: 32, align: 32, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !322, file: !321, line: 154, baseType: !166, size: 64, align: 64, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !322, file: !321, line: 155, baseType: !128, size: 32, align: 32, offset: 1984)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !322, file: !321, line: 156, baseType: !267, size: 8, align: 8, offset: 2016)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !322, file: !321, line: 157, baseType: !267, size: 8, align: 8, offset: 2024)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !322, file: !321, line: 158, baseType: !267, size: 8, align: 8, offset: 2032)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !322, file: !321, line: 160, baseType: !109, size: 64, align: 64, offset: 2048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !322, file: !321, line: 161, baseType: !109, size: 64, align: 64, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !322, file: !321, line: 162, baseType: !90, size: 32, align: 32, offset: 2176)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !322, file: !321, line: 163, baseType: !109, size: 64, align: 64, offset: 2240)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !322, file: !321, line: 164, baseType: !351, size: 64, align: 64, offset: 2304)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !322, file: !321, line: 165, baseType: !351, size: 64, align: 64, offset: 2368)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !322, file: !321, line: 166, baseType: !90, size: 32, align: 32, offset: 2432)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !322, file: !321, line: 167, baseType: !90, size: 32, align: 32, offset: 2464)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !322, file: !321, line: 168, baseType: !128, size: 32, align: 32, offset: 2496)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !322, file: !321, line: 169, baseType: !267, size: 8, align: 8, offset: 2528)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !322, file: !321, line: 170, baseType: !267, size: 8, align: 8, offset: 2536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !309, file: !308, line: 46, baseType: !338, size: 64, align: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !308, line: 47, baseType: !178, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !309, file: !308, line: 48, baseType: !267, size: 8, align: 8, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !309, file: !308, line: 49, baseType: !267, size: 8, align: 8, offset: 456)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !309, file: !308, line: 50, baseType: !267, size: 8, align: 8, offset: 464)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !309, file: !308, line: 51, baseType: !92, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !309, file: !308, line: 52, baseType: !128, size: 32, align: 32, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !309, file: !308, line: 53, baseType: !109, size: 64, align: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !309, file: !308, line: 54, baseType: !109, size: 64, align: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !309, file: !308, line: 55, baseType: !90, size: 32, align: 32, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !309, file: !308, line: 56, baseType: !109, size: 64, align: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !309, file: !308, line: 57, baseType: !90, size: 32, align: 32, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !309, file: !308, line: 58, baseType: !90, size: 32, align: 32, offset: 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !309, file: !308, line: 59, baseType: !109, size: 64, align: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !52, line: 239, size: 128, align: 32, elements: !423)
!423 = !{!424, !425, !427, !432}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !422, file: !52, line: 241, baseType: !101, size: 16, align: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !422, file: !52, line: 242, baseType: !426, size: 16, align: 16, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !52, line: 119, baseType: !379)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !422, file: !52, line: 243, baseType: !428, size: 32, align: 32, offset: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !52, line: 31, size: 32, align: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !428, file: !52, line: 33, baseType: !431, size: 32, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !52, line: 30, baseType: !335)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !422, file: !52, line: 246, baseType: !433, size: 64, align: 8, offset: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 64, align: 8, elements: !435)
!434 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!435 = !{!436}
!436 = !DISubrange(count: 8)
!437 = !{!438, !440, !442}
!438 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !439, line: 150, type: !166, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!439 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!440 = distinct !DIGlobalVariable(name: "default_co", scope: !0, file: !441, line: 45, type: !92, isLocal: true, isDefinition: true, variable: %struct._conn_opts** @default_co)
!441 = !DIFile(filename: "check_smtp.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!442 = distinct !DIGlobalVariable(name: "sav_co", scope: !0, file: !441, line: 46, type: !92, isLocal: true, isDefinition: true, variable: %struct._conn_opts** @sav_co)
!443 = !{i32 2, !"Dwarf Version", i32 4}
!444 = !{i32 2, !"Debug Info Version", i32 3}
!445 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!446 = distinct !DISubprogram(name: "install_smtp_check_keyword", scope: !441, file: !441, line: 243, type: !447, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{null}
!449 = !{}
!450 = !DILocation(line: 250, column: 2, scope: !446)
!451 = !DILocation(line: 251, column: 2, scope: !446)
!452 = !DILocation(line: 252, column: 2, scope: !446)
!453 = !DILocation(line: 254, column: 2, scope: !446)
!454 = !DILocation(line: 263, column: 2, scope: !446)
!455 = !DILocation(line: 264, column: 2, scope: !446)
!456 = !DILocation(line: 265, column: 2, scope: !446)
!457 = !DILocation(line: 266, column: 2, scope: !446)
!458 = !DILocation(line: 267, column: 2, scope: !446)
!459 = !DILocation(line: 269, column: 2, scope: !446)
!460 = !DILocation(line: 270, column: 2, scope: !446)
!461 = !DILocation(line: 271, column: 1, scope: !446)
!462 = distinct !DISubprogram(name: "smtp_check_handler", scope: !441, file: !441, line: 126, type: !463, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !467, line: 34, baseType: !468)
!467 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !467, line: 30, size: 128, align: 64, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !468, file: !467, line: 31, baseType: !90, size: 32, align: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !468, file: !467, line: 32, baseType: !90, size: 32, align: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !468, file: !467, line: 33, baseType: !473, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!474 = !DILocalVariable(name: "strvec", arg: 1, scope: !462, file: !441, line: 126, type: !465)
!475 = !DIExpression()
!476 = !DILocation(line: 126, column: 54, scope: !462)
!477 = !DILocalVariable(name: "smtp_checker", scope: !462, file: !441, line: 128, type: !81)
!478 = !DILocation(line: 128, column: 18, scope: !462)
!479 = !DILocation(line: 128, column: 52, scope: !462)
!480 = !DILocation(line: 128, column: 33, scope: !462)
!481 = !DILocation(line: 131, column: 30, scope: !462)
!482 = !DILocation(line: 131, column: 15, scope: !462)
!483 = !DILocation(line: 131, column: 13, scope: !462)
!484 = !DILocation(line: 135, column: 29, scope: !462)
!485 = !DILocation(line: 135, column: 43, scope: !462)
!486 = !DILocation(line: 134, column: 2, scope: !462)
!487 = !DILocation(line: 138, column: 65, scope: !462)
!488 = !DILocation(line: 138, column: 50, scope: !462)
!489 = !DILocation(line: 138, column: 16, scope: !462)
!490 = !DILocation(line: 138, column: 32, scope: !462)
!491 = !DILocation(line: 138, column: 38, scope: !462)
!492 = !DILocation(line: 138, column: 3, scope: !462)
!493 = !DILocation(line: 138, column: 45, scope: !462)
!494 = !DILocation(line: 138, column: 48, scope: !462)
!495 = !DILocation(line: 148, column: 23, scope: !462)
!496 = !DILocation(line: 148, column: 2, scope: !462)
!497 = !DILocation(line: 148, column: 16, scope: !462)
!498 = !DILocation(line: 148, column: 21, scope: !462)
!499 = !DILocation(line: 149, column: 1, scope: !462)
!500 = distinct !DISubprogram(name: "smtp_helo_name_handler", scope: !441, file: !441, line: 233, type: !463, isLocal: true, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!501 = !DILocalVariable(name: "strvec", arg: 1, scope: !500, file: !441, line: 233, type: !465)
!502 = !DILocation(line: 233, column: 34, scope: !500)
!503 = !DILocalVariable(name: "smtp_checker", scope: !500, file: !441, line: 235, type: !81)
!504 = !DILocation(line: 235, column: 18, scope: !500)
!505 = !DILocation(line: 235, column: 52, scope: !500)
!506 = !DILocation(line: 235, column: 69, scope: !500)
!507 = !DILocation(line: 235, column: 75, scope: !500)
!508 = !DILocation(line: 235, column: 36, scope: !500)
!509 = !DILocation(line: 235, column: 84, scope: !500)
!510 = !DILocation(line: 235, column: 33, scope: !500)
!511 = !DILocation(line: 236, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !500, file: !441, line: 236, column: 6)
!513 = !DILocation(line: 236, column: 20, scope: !512)
!514 = !DILocation(line: 236, column: 6, scope: !500)
!515 = !DILocation(line: 237, column: 9, scope: !512)
!516 = !DILocation(line: 237, column: 23, scope: !512)
!517 = !DILocation(line: 237, column: 4, scope: !512)
!518 = !DILocation(line: 237, column: 36, scope: !512)
!519 = !DILocation(line: 237, column: 50, scope: !512)
!520 = !DILocation(line: 237, column: 61, scope: !512)
!521 = !DILocation(line: 237, column: 3, scope: !512)
!522 = !DILocation(line: 238, column: 39, scope: !500)
!523 = !DILocation(line: 238, column: 29, scope: !500)
!524 = !DILocation(line: 238, column: 2, scope: !500)
!525 = !DILocation(line: 238, column: 16, scope: !500)
!526 = !DILocation(line: 238, column: 26, scope: !500)
!527 = !DILocation(line: 239, column: 1, scope: !500)
!528 = distinct !DISubprogram(name: "smtp_host_handler", scope: !441, file: !441, line: 205, type: !463, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!529 = !DILocalVariable(name: "strvec", arg: 1, scope: !528, file: !441, line: 205, type: !465)
!530 = !DILocation(line: 205, column: 53, scope: !528)
!531 = !DILocalVariable(name: "checker", scope: !528, file: !441, line: 207, type: !306)
!532 = !DILocation(line: 207, column: 13, scope: !528)
!533 = !DILocation(line: 207, column: 26, scope: !528)
!534 = !DILocation(line: 207, column: 43, scope: !528)
!535 = !DILocation(line: 207, column: 49, scope: !528)
!536 = !DILocation(line: 207, column: 23, scope: !528)
!537 = !DILocation(line: 210, column: 11, scope: !528)
!538 = !DILocation(line: 210, column: 20, scope: !528)
!539 = !DILocation(line: 210, column: 9, scope: !528)
!540 = !DILocation(line: 211, column: 31, scope: !528)
!541 = !DILocation(line: 211, column: 16, scope: !528)
!542 = !DILocation(line: 211, column: 2, scope: !528)
!543 = !DILocation(line: 211, column: 11, scope: !528)
!544 = !DILocation(line: 211, column: 14, scope: !528)
!545 = !DILocation(line: 212, column: 9, scope: !528)
!546 = !DILocation(line: 212, column: 18, scope: !528)
!547 = !DILocation(line: 212, column: 2, scope: !528)
!548 = !DILocation(line: 212, column: 22, scope: !528)
!549 = !DILocation(line: 214, column: 2, scope: !528)
!550 = !DILocation(line: 215, column: 1, scope: !528)
!551 = distinct !DISubprogram(name: "smtp_host_end_handler", scope: !441, file: !441, line: 218, type: !447, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!552 = !DILocalVariable(name: "checker", scope: !551, file: !441, line: 220, type: !306)
!553 = !DILocation(line: 220, column: 13, scope: !551)
!554 = !DILocation(line: 220, column: 26, scope: !551)
!555 = !DILocation(line: 220, column: 43, scope: !551)
!556 = !DILocation(line: 220, column: 49, scope: !551)
!557 = !DILocation(line: 220, column: 23, scope: !551)
!558 = !DILocalVariable(name: "smtp_checker", scope: !551, file: !441, line: 221, type: !81)
!559 = !DILocation(line: 221, column: 18, scope: !551)
!560 = !DILocation(line: 221, column: 51, scope: !551)
!561 = !DILocation(line: 221, column: 60, scope: !551)
!562 = !DILocation(line: 221, column: 33, scope: !551)
!563 = !DILocation(line: 223, column: 23, scope: !564)
!564 = distinct !DILexicalBlock(scope: !551, file: !441, line: 223, column: 6)
!565 = !DILocation(line: 223, column: 32, scope: !564)
!566 = !DILocation(line: 223, column: 7, scope: !564)
!567 = !DILocation(line: 223, column: 6, scope: !551)
!568 = !DILocation(line: 224, column: 9, scope: !564)
!569 = !DILocation(line: 224, column: 18, scope: !564)
!570 = !DILocation(line: 224, column: 4, scope: !564)
!571 = !DILocation(line: 224, column: 24, scope: !564)
!572 = !DILocation(line: 224, column: 33, scope: !564)
!573 = !DILocation(line: 224, column: 37, scope: !564)
!574 = !DILocation(line: 224, column: 3, scope: !564)
!575 = !DILocation(line: 226, column: 12, scope: !564)
!576 = !DILocation(line: 226, column: 26, scope: !564)
!577 = !DILocation(line: 226, column: 32, scope: !564)
!578 = !DILocation(line: 226, column: 41, scope: !564)
!579 = !DILocation(line: 226, column: 3, scope: !564)
!580 = !DILocation(line: 228, column: 16, scope: !551)
!581 = !DILocation(line: 228, column: 2, scope: !551)
!582 = !DILocation(line: 228, column: 11, scope: !551)
!583 = !DILocation(line: 228, column: 14, scope: !551)
!584 = !DILocation(line: 229, column: 1, scope: !551)
!585 = distinct !DISubprogram(name: "smtp_check_end_handler", scope: !441, file: !441, line: 152, type: !447, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!586 = !DILocalVariable(name: "smtp_checker", scope: !585, file: !441, line: 154, type: !81)
!587 = !DILocation(line: 154, column: 18, scope: !585)
!588 = !DILocation(line: 154, column: 52, scope: !585)
!589 = !DILocation(line: 154, column: 69, scope: !585)
!590 = !DILocation(line: 154, column: 75, scope: !585)
!591 = !DILocation(line: 154, column: 36, scope: !585)
!592 = !DILocation(line: 154, column: 84, scope: !585)
!593 = !DILocation(line: 154, column: 33, scope: !585)
!594 = !DILocalVariable(name: "co", scope: !585, file: !441, line: 155, type: !92)
!595 = !DILocation(line: 155, column: 15, scope: !585)
!596 = !DILocation(line: 155, column: 38, scope: !585)
!597 = !DILocation(line: 155, column: 55, scope: !585)
!598 = !DILocation(line: 155, column: 61, scope: !585)
!599 = !DILocation(line: 155, column: 22, scope: !585)
!600 = !DILocation(line: 155, column: 70, scope: !585)
!601 = !DILocation(line: 157, column: 7, scope: !602)
!602 = distinct !DILexicalBlock(scope: !585, file: !441, line: 157, column: 6)
!603 = !DILocation(line: 157, column: 21, scope: !602)
!604 = !DILocation(line: 157, column: 6, scope: !585)
!605 = !DILocation(line: 158, column: 38, scope: !606)
!606 = distinct !DILexicalBlock(scope: !602, file: !441, line: 157, column: 32)
!607 = !DILocation(line: 158, column: 3, scope: !606)
!608 = !DILocation(line: 158, column: 17, scope: !606)
!609 = !DILocation(line: 158, column: 27, scope: !606)
!610 = !DILocation(line: 159, column: 10, scope: !606)
!611 = !DILocation(line: 159, column: 24, scope: !606)
!612 = !DILocation(line: 159, column: 3, scope: !606)
!613 = !DILocation(line: 160, column: 2, scope: !606)
!614 = !DILocation(line: 163, column: 6, scope: !615)
!615 = distinct !DILexicalBlock(scope: !585, file: !441, line: 163, column: 6)
!616 = !DILocation(line: 163, column: 10, scope: !615)
!617 = !DILocation(line: 163, column: 14, scope: !615)
!618 = !DILocation(line: 163, column: 24, scope: !615)
!619 = !DILocation(line: 163, column: 36, scope: !615)
!620 = !DILocation(line: 164, column: 7, scope: !615)
!621 = !DILocation(line: 164, column: 11, scope: !615)
!622 = !DILocation(line: 164, column: 15, scope: !615)
!623 = !DILocation(line: 164, column: 25, scope: !615)
!624 = !DILocation(line: 164, column: 37, scope: !615)
!625 = !DILocation(line: 164, column: 64, scope: !626)
!626 = !DILexicalBlockFile(scope: !615, file: !441, discriminator: 1)
!627 = !DILocation(line: 164, column: 68, scope: !626)
!628 = !DILocation(line: 164, column: 74, scope: !626)
!629 = !DILocation(line: 164, column: 40, scope: !626)
!630 = !DILocation(line: 164, column: 84, scope: !626)
!631 = !DILocation(line: 165, column: 6, scope: !615)
!632 = !DILocation(line: 165, column: 10, scope: !615)
!633 = !DILocation(line: 165, column: 17, scope: !615)
!634 = !DILocation(line: 165, column: 27, scope: !615)
!635 = !DILocation(line: 165, column: 39, scope: !615)
!636 = !DILocation(line: 166, column: 7, scope: !615)
!637 = !DILocation(line: 166, column: 11, scope: !615)
!638 = !DILocation(line: 166, column: 18, scope: !615)
!639 = !DILocation(line: 166, column: 28, scope: !615)
!640 = !DILocation(line: 166, column: 40, scope: !615)
!641 = !DILocation(line: 166, column: 67, scope: !626)
!642 = !DILocation(line: 166, column: 71, scope: !626)
!643 = !DILocation(line: 166, column: 80, scope: !626)
!644 = !DILocation(line: 166, column: 43, scope: !626)
!645 = !DILocation(line: 166, column: 90, scope: !626)
!646 = !DILocation(line: 167, column: 6, scope: !615)
!647 = !DILocation(line: 167, column: 10, scope: !615)
!648 = !DILocation(line: 167, column: 21, scope: !615)
!649 = !DILocation(line: 169, column: 6, scope: !615)
!650 = !DILocation(line: 169, column: 10, scope: !615)
!651 = !DILocation(line: 169, column: 17, scope: !615)
!652 = !DILocation(line: 171, column: 6, scope: !615)
!653 = !DILocation(line: 171, column: 10, scope: !615)
!654 = !DILocation(line: 163, column: 6, scope: !655)
!655 = !DILexicalBlockFile(scope: !585, file: !441, discriminator: 1)
!656 = !DILocation(line: 173, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !658, file: !441, line: 173, column: 7)
!658 = distinct !DILexicalBlock(scope: !615, file: !441, line: 171, column: 25)
!659 = !DILocation(line: 173, column: 11, scope: !657)
!660 = !DILocation(line: 173, column: 15, scope: !657)
!661 = !DILocation(line: 173, column: 25, scope: !657)
!662 = !DILocation(line: 173, column: 7, scope: !658)
!663 = !DILocation(line: 174, column: 32, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !441, line: 174, column: 8)
!665 = distinct !DILexicalBlock(scope: !657, file: !441, line: 173, column: 38)
!666 = !DILocation(line: 174, column: 36, scope: !664)
!667 = !DILocation(line: 174, column: 42, scope: !664)
!668 = !DILocation(line: 174, column: 8, scope: !664)
!669 = !DILocation(line: 174, column: 8, scope: !665)
!670 = !DILocalVariable(name: "saved_port", scope: !671, file: !441, line: 175, type: !379)
!671 = distinct !DILexicalBlock(scope: !664, file: !441, line: 174, column: 52)
!672 = !DILocation(line: 175, column: 14, scope: !671)
!673 = !DILocation(line: 175, column: 51, scope: !671)
!674 = !DILocation(line: 175, column: 55, scope: !671)
!675 = !DILocation(line: 175, column: 61, scope: !671)
!676 = !DILocation(line: 176, column: 5, scope: !671)
!677 = !DILocation(line: 176, column: 9, scope: !671)
!678 = !DILocation(line: 176, column: 15, scope: !671)
!679 = !DILocation(line: 176, column: 27, scope: !671)
!680 = !DILocation(line: 177, column: 27, scope: !671)
!681 = !DILocation(line: 177, column: 31, scope: !671)
!682 = !DILocation(line: 177, column: 36, scope: !671)
!683 = !DILocation(line: 177, column: 5, scope: !671)
!684 = !DILocation(line: 178, column: 4, scope: !671)
!685 = !DILocation(line: 180, column: 5, scope: !664)
!686 = !DILocation(line: 180, column: 9, scope: !664)
!687 = !DILocation(line: 180, column: 15, scope: !664)
!688 = !DILocation(line: 180, column: 27, scope: !664)
!689 = !DILocation(line: 181, column: 3, scope: !665)
!690 = !DILocation(line: 182, column: 8, scope: !691)
!691 = distinct !DILexicalBlock(scope: !658, file: !441, line: 182, column: 7)
!692 = !DILocation(line: 182, column: 12, scope: !691)
!693 = !DILocation(line: 182, column: 7, scope: !658)
!694 = !DILocation(line: 183, column: 4, scope: !691)
!695 = !DILocation(line: 183, column: 8, scope: !691)
!696 = !DILocation(line: 183, column: 22, scope: !691)
!697 = !DILocation(line: 185, column: 24, scope: !698)
!698 = distinct !DILexicalBlock(scope: !658, file: !441, line: 185, column: 7)
!699 = !DILocation(line: 185, column: 8, scope: !698)
!700 = !DILocation(line: 185, column: 7, scope: !658)
!701 = !DILocation(line: 186, column: 4, scope: !702)
!702 = distinct !DILexicalBlock(scope: !698, file: !441, line: 185, column: 29)
!703 = !DILocation(line: 187, column: 10, scope: !702)
!704 = !DILocation(line: 187, column: 5, scope: !702)
!705 = !DILocation(line: 187, column: 20, scope: !702)
!706 = !DILocation(line: 188, column: 3, scope: !702)
!707 = !DILocation(line: 189, column: 13, scope: !698)
!708 = !DILocation(line: 189, column: 27, scope: !698)
!709 = !DILocation(line: 189, column: 33, scope: !698)
!710 = !DILocation(line: 189, column: 4, scope: !698)
!711 = !DILocation(line: 190, column: 2, scope: !658)
!712 = !DILocation(line: 192, column: 9, scope: !615)
!713 = !DILocation(line: 192, column: 4, scope: !615)
!714 = !DILocation(line: 192, column: 19, scope: !615)
!715 = !DILocation(line: 193, column: 20, scope: !585)
!716 = !DILocation(line: 193, column: 37, scope: !585)
!717 = !DILocation(line: 193, column: 43, scope: !585)
!718 = !DILocation(line: 193, column: 4, scope: !585)
!719 = !DILocation(line: 193, column: 52, scope: !585)
!720 = !DILocation(line: 193, column: 56, scope: !585)
!721 = !DILocation(line: 196, column: 8, scope: !722)
!722 = distinct !DILexicalBlock(scope: !585, file: !441, line: 196, column: 6)
!723 = !DILocation(line: 196, column: 22, scope: !722)
!724 = !DILocation(line: 196, column: 28, scope: !722)
!725 = !DILocation(line: 196, column: 5, scope: !722)
!726 = !DILocation(line: 196, column: 10, scope: !727)
!727 = !DILexicalBlockFile(scope: !722, file: !441, discriminator: 1)
!728 = !DILocation(line: 196, column: 24, scope: !727)
!729 = !DILocation(line: 196, column: 31, scope: !727)
!730 = !DILocation(line: 196, column: 36, scope: !727)
!731 = !DILocation(line: 196, column: 5, scope: !727)
!732 = !DILocation(line: 196, column: 9, scope: !733)
!733 = !DILexicalBlockFile(scope: !722, file: !441, discriminator: 2)
!734 = !DILocation(line: 196, column: 23, scope: !733)
!735 = !DILocation(line: 196, column: 30, scope: !733)
!736 = !DILocation(line: 196, column: 35, scope: !733)
!737 = !DILocation(line: 196, column: 6, scope: !733)
!738 = !DILocation(line: 197, column: 12, scope: !739)
!739 = distinct !DILexicalBlock(scope: !722, file: !441, line: 196, column: 9)
!740 = !DILocation(line: 197, column: 26, scope: !739)
!741 = !DILocation(line: 197, column: 32, scope: !739)
!742 = !DILocation(line: 197, column: 3, scope: !739)
!743 = !DILocation(line: 198, column: 2, scope: !739)
!744 = !DILocation(line: 199, column: 9, scope: !722)
!745 = !DILocation(line: 199, column: 4, scope: !722)
!746 = !DILocation(line: 199, column: 35, scope: !722)
!747 = !DILocation(line: 200, column: 13, scope: !585)
!748 = !DILocation(line: 201, column: 1, scope: !585)
!749 = distinct !DISubprogram(name: "free_smtp_check", scope: !441, file: !441, line: 67, type: !183, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!750 = !DILocalVariable(name: "data", arg: 1, scope: !749, file: !441, line: 67, type: !178)
!751 = !DILocation(line: 67, column: 23, scope: !749)
!752 = !DILocalVariable(name: "smtp_checker", scope: !749, file: !441, line: 69, type: !81)
!753 = !DILocation(line: 69, column: 18, scope: !749)
!754 = !DILocation(line: 69, column: 48, scope: !749)
!755 = !DILocation(line: 69, column: 35, scope: !749)
!756 = !DILocation(line: 69, column: 55, scope: !749)
!757 = !DILocation(line: 69, column: 33, scope: !749)
!758 = !DILocation(line: 70, column: 13, scope: !749)
!759 = !DILocation(line: 70, column: 27, scope: !749)
!760 = !DILocation(line: 70, column: 2, scope: !749)
!761 = !DILocation(line: 71, column: 8, scope: !749)
!762 = !DILocation(line: 71, column: 22, scope: !749)
!763 = !DILocation(line: 71, column: 3, scope: !749)
!764 = !DILocation(line: 71, column: 35, scope: !749)
!765 = !DILocation(line: 71, column: 49, scope: !749)
!766 = !DILocation(line: 71, column: 60, scope: !749)
!767 = !DILocation(line: 72, column: 8, scope: !749)
!768 = !DILocation(line: 72, column: 3, scope: !749)
!769 = !DILocation(line: 72, column: 38, scope: !749)
!770 = !DILocation(line: 73, column: 8, scope: !749)
!771 = !DILocation(line: 73, column: 3, scope: !749)
!772 = !DILocation(line: 73, column: 22, scope: !749)
!773 = !DILocation(line: 74, column: 1, scope: !749)
!774 = distinct !DISubprogram(name: "dump_smtp_check", scope: !441, file: !441, line: 81, type: !187, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!775 = !DILocalVariable(name: "fp", arg: 1, scope: !774, file: !441, line: 81, type: !189)
!776 = !DILocation(line: 81, column: 23, scope: !774)
!777 = !DILocalVariable(name: "data", arg: 2, scope: !774, file: !441, line: 81, type: !178)
!778 = !DILocation(line: 81, column: 33, scope: !774)
!779 = !DILocalVariable(name: "checker", scope: !774, file: !441, line: 83, type: !306)
!780 = !DILocation(line: 83, column: 13, scope: !774)
!781 = !DILocation(line: 83, column: 23, scope: !774)
!782 = !DILocalVariable(name: "smtp_checker", scope: !774, file: !441, line: 84, type: !81)
!783 = !DILocation(line: 84, column: 18, scope: !774)
!784 = !DILocation(line: 84, column: 33, scope: !774)
!785 = !DILocation(line: 84, column: 42, scope: !774)
!786 = !DILocation(line: 86, column: 13, scope: !774)
!787 = !DILocation(line: 86, column: 2, scope: !774)
!788 = !DILocation(line: 87, column: 13, scope: !774)
!789 = !DILocation(line: 87, column: 33, scope: !774)
!790 = !DILocation(line: 87, column: 47, scope: !774)
!791 = !DILocation(line: 87, column: 2, scope: !774)
!792 = !DILocation(line: 88, column: 20, scope: !774)
!793 = !DILocation(line: 88, column: 24, scope: !774)
!794 = !DILocation(line: 88, column: 2, scope: !774)
!795 = !DILocation(line: 90, column: 6, scope: !796)
!796 = distinct !DILexicalBlock(scope: !774, file: !441, line: 90, column: 6)
!797 = !DILocation(line: 90, column: 20, scope: !796)
!798 = !DILocation(line: 90, column: 6, scope: !774)
!799 = !DILocation(line: 91, column: 14, scope: !800)
!800 = distinct !DILexicalBlock(scope: !796, file: !441, line: 90, column: 26)
!801 = !DILocation(line: 91, column: 3, scope: !800)
!802 = !DILocation(line: 92, column: 13, scope: !800)
!803 = !DILocation(line: 92, column: 17, scope: !800)
!804 = !DILocation(line: 92, column: 31, scope: !800)
!805 = !DILocation(line: 92, column: 3, scope: !800)
!806 = !DILocation(line: 93, column: 2, scope: !800)
!807 = !DILocation(line: 94, column: 1, scope: !774)
!808 = distinct !DISubprogram(name: "smtp_connect_thread", scope: !441, file: !441, line: 722, type: !126, isLocal: true, isDefinition: true, scopeLine: 723, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!809 = !DILocalVariable(name: "thread", arg: 1, scope: !808, file: !441, line: 722, type: !129)
!810 = !DILocation(line: 722, column: 31, scope: !808)
!811 = !DILocalVariable(name: "checker", scope: !808, file: !441, line: 724, type: !306)
!812 = !DILocation(line: 724, column: 13, scope: !808)
!813 = !DILocation(line: 724, column: 25, scope: !808)
!814 = !DILocation(line: 724, column: 34, scope: !808)
!815 = !DILocation(line: 724, column: 23, scope: !808)
!816 = !DILocalVariable(name: "smtp_checker", scope: !808, file: !441, line: 725, type: !81)
!817 = !DILocation(line: 725, column: 18, scope: !808)
!818 = !DILocation(line: 725, column: 35, scope: !808)
!819 = !DILocation(line: 725, column: 45, scope: !808)
!820 = !DILocation(line: 725, column: 33, scope: !808)
!821 = !DILocalVariable(name: "smtp_host", scope: !808, file: !441, line: 726, type: !92)
!822 = !DILocation(line: 726, column: 15, scope: !808)
!823 = !DILocalVariable(name: "status", scope: !808, file: !441, line: 727, type: !24)
!824 = !DILocation(line: 727, column: 22, scope: !808)
!825 = !DILocalVariable(name: "sd", scope: !808, file: !441, line: 728, type: !128)
!826 = !DILocation(line: 728, column: 6, scope: !808)
!827 = !DILocalVariable(name: "checker_was_up", scope: !808, file: !441, line: 729, type: !267)
!828 = !DILocation(line: 729, column: 6, scope: !808)
!829 = !DILocalVariable(name: "rs_was_alive", scope: !808, file: !441, line: 730, type: !267)
!830 = !DILocation(line: 730, column: 6, scope: !808)
!831 = !DILocation(line: 762, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !808, file: !441, line: 762, column: 6)
!833 = !DILocation(line: 762, column: 16, scope: !832)
!834 = !DILocation(line: 762, column: 6, scope: !808)
!835 = !DILocation(line: 763, column: 20, scope: !836)
!836 = distinct !DILexicalBlock(scope: !832, file: !441, line: 762, column: 25)
!837 = !DILocation(line: 763, column: 28, scope: !836)
!838 = !DILocation(line: 763, column: 57, scope: !836)
!839 = !DILocation(line: 764, column: 6, scope: !836)
!840 = !DILocation(line: 764, column: 15, scope: !836)
!841 = !DILocation(line: 763, column: 3, scope: !836)
!842 = !DILocation(line: 765, column: 3, scope: !836)
!843 = !DILocation(line: 775, column: 45, scope: !844)
!844 = distinct !DILexicalBlock(scope: !808, file: !441, line: 775, column: 6)
!845 = !DILocation(line: 775, column: 59, scope: !844)
!846 = !DILocation(line: 775, column: 65, scope: !844)
!847 = !DILocation(line: 775, column: 79, scope: !844)
!848 = !DILocation(line: 775, column: 32, scope: !844)
!849 = !DILocation(line: 775, column: 7, scope: !844)
!850 = !DILocation(line: 775, column: 21, scope: !844)
!851 = !DILocation(line: 775, column: 30, scope: !844)
!852 = !DILocation(line: 775, column: 90, scope: !844)
!853 = !DILocation(line: 775, column: 6, scope: !808)
!854 = !DILocation(line: 776, column: 8, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !441, line: 776, column: 7)
!856 = distinct !DILexicalBlock(scope: !844, file: !441, line: 775, column: 98)
!857 = !DILocation(line: 776, column: 17, scope: !855)
!858 = !DILocation(line: 776, column: 23, scope: !855)
!859 = !DILocation(line: 776, column: 27, scope: !860)
!860 = !DILexicalBlockFile(scope: !855, file: !441, discriminator: 1)
!861 = !DILocation(line: 776, column: 36, scope: !860)
!862 = !DILocation(line: 776, column: 7, scope: !860)
!863 = !DILocation(line: 778, column: 37, scope: !864)
!864 = distinct !DILexicalBlock(scope: !855, file: !441, line: 776, column: 45)
!865 = !DILocation(line: 778, column: 47, scope: !864)
!866 = !DILocation(line: 778, column: 52, scope: !864)
!867 = !DILocation(line: 778, column: 60, scope: !864)
!868 = !DILocation(line: 778, column: 70, scope: !864)
!869 = !DILocation(line: 778, column: 75, scope: !864)
!870 = !DILocation(line: 778, column: 13, scope: !864)
!871 = !DILocation(line: 777, column: 4, scope: !864)
!872 = !DILocation(line: 780, column: 21, scope: !864)
!873 = !DILocation(line: 780, column: 30, scope: !864)
!874 = !DILocation(line: 780, column: 19, scope: !864)
!875 = !DILocation(line: 781, column: 19, scope: !864)
!876 = !DILocation(line: 781, column: 28, scope: !864)
!877 = !DILocation(line: 781, column: 32, scope: !864)
!878 = !DILocation(line: 781, column: 17, scope: !864)
!879 = !DILocation(line: 782, column: 32, scope: !864)
!880 = !DILocation(line: 782, column: 4, scope: !864)
!881 = !DILocation(line: 783, column: 8, scope: !882)
!882 = distinct !DILexicalBlock(scope: !864, file: !441, line: 783, column: 8)
!883 = !DILocation(line: 783, column: 17, scope: !882)
!884 = !DILocation(line: 783, column: 21, scope: !882)
!885 = !DILocation(line: 783, column: 32, scope: !882)
!886 = !DILocation(line: 783, column: 36, scope: !887)
!887 = !DILexicalBlockFile(scope: !882, file: !441, discriminator: 1)
!888 = !DILocation(line: 783, column: 51, scope: !887)
!889 = !DILocation(line: 784, column: 9, scope: !882)
!890 = !DILocation(line: 784, column: 25, scope: !882)
!891 = !DILocation(line: 784, column: 34, scope: !882)
!892 = !DILocation(line: 784, column: 38, scope: !882)
!893 = !DILocation(line: 784, column: 22, scope: !882)
!894 = !DILocation(line: 784, column: 44, scope: !882)
!895 = !DILocation(line: 784, column: 48, scope: !887)
!896 = !DILocation(line: 784, column: 61, scope: !887)
!897 = !DILocation(line: 783, column: 8, scope: !898)
!898 = !DILexicalBlockFile(scope: !864, file: !441, discriminator: 2)
!899 = !DILocation(line: 785, column: 29, scope: !882)
!900 = !DILocation(line: 785, column: 5, scope: !882)
!901 = !DILocation(line: 787, column: 3, scope: !864)
!902 = !DILocation(line: 789, column: 3, scope: !856)
!903 = !DILocation(line: 789, column: 12, scope: !856)
!904 = !DILocation(line: 789, column: 21, scope: !856)
!905 = !DILocation(line: 790, column: 3, scope: !856)
!906 = !DILocation(line: 790, column: 17, scope: !856)
!907 = !DILocation(line: 790, column: 26, scope: !856)
!908 = !DILocation(line: 791, column: 41, scope: !856)
!909 = !DILocation(line: 791, column: 55, scope: !856)
!910 = !DILocation(line: 791, column: 28, scope: !856)
!911 = !DILocation(line: 791, column: 3, scope: !856)
!912 = !DILocation(line: 791, column: 17, scope: !856)
!913 = !DILocation(line: 791, column: 26, scope: !856)
!914 = !DILocation(line: 793, column: 20, scope: !856)
!915 = !DILocation(line: 793, column: 28, scope: !856)
!916 = !DILocation(line: 793, column: 57, scope: !856)
!917 = !DILocation(line: 793, column: 66, scope: !856)
!918 = !DILocation(line: 793, column: 75, scope: !856)
!919 = !DILocation(line: 793, column: 3, scope: !856)
!920 = !DILocation(line: 794, column: 3, scope: !856)
!921 = !DILocation(line: 797, column: 14, scope: !808)
!922 = !DILocation(line: 797, column: 28, scope: !808)
!923 = !DILocation(line: 797, column: 12, scope: !808)
!924 = !DILocation(line: 800, column: 19, scope: !925)
!925 = distinct !DILexicalBlock(scope: !808, file: !441, line: 800, column: 6)
!926 = !DILocation(line: 800, column: 30, scope: !925)
!927 = !DILocation(line: 800, column: 34, scope: !925)
!928 = !DILocation(line: 800, column: 12, scope: !925)
!929 = !DILocation(line: 800, column: 10, scope: !925)
!930 = !DILocation(line: 800, column: 102, scope: !925)
!931 = !DILocation(line: 800, column: 6, scope: !808)
!932 = !DILocation(line: 801, column: 3, scope: !933)
!933 = distinct !DILexicalBlock(scope: !925, file: !441, line: 800, column: 109)
!934 = !DILocation(line: 802, column: 20, scope: !933)
!935 = !DILocation(line: 802, column: 28, scope: !933)
!936 = !DILocation(line: 802, column: 57, scope: !933)
!937 = !DILocation(line: 803, column: 6, scope: !933)
!938 = !DILocation(line: 803, column: 15, scope: !933)
!939 = !DILocation(line: 802, column: 3, scope: !933)
!940 = !DILocation(line: 804, column: 3, scope: !933)
!941 = !DILocation(line: 817, column: 28, scope: !808)
!942 = !DILocation(line: 817, column: 32, scope: !808)
!943 = !DILocation(line: 817, column: 11, scope: !808)
!944 = !DILocation(line: 817, column: 9, scope: !808)
!945 = !DILocation(line: 820, column: 26, scope: !946)
!946 = distinct !DILexicalBlock(scope: !808, file: !441, line: 820, column: 5)
!947 = !DILocation(line: 820, column: 30, scope: !946)
!948 = !DILocation(line: 820, column: 38, scope: !946)
!949 = !DILocation(line: 820, column: 65, scope: !946)
!950 = !DILocation(line: 820, column: 76, scope: !946)
!951 = !DILocation(line: 820, column: 5, scope: !946)
!952 = !DILocation(line: 820, column: 5, scope: !808)
!953 = !DILocation(line: 821, column: 9, scope: !954)
!954 = distinct !DILexicalBlock(scope: !946, file: !441, line: 820, column: 92)
!955 = !DILocation(line: 821, column: 3, scope: !954)
!956 = !DILocation(line: 822, column: 3, scope: !954)
!957 = !DILocation(line: 823, column: 20, scope: !954)
!958 = !DILocation(line: 823, column: 28, scope: !954)
!959 = !DILocation(line: 823, column: 57, scope: !954)
!960 = !DILocation(line: 824, column: 4, scope: !954)
!961 = !DILocation(line: 824, column: 13, scope: !954)
!962 = !DILocation(line: 823, column: 3, scope: !954)
!963 = !DILocation(line: 825, column: 2, scope: !954)
!964 = !DILocation(line: 827, column: 2, scope: !808)
!965 = !DILocation(line: 828, column: 1, scope: !808)
!966 = distinct !DISubprogram(name: "smtp_check_compare", scope: !441, file: !441, line: 97, type: !316, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!967 = !DILocalVariable(name: "a", arg: 1, scope: !966, file: !441, line: 97, type: !178)
!968 = !DILocation(line: 97, column: 26, scope: !966)
!969 = !DILocalVariable(name: "b", arg: 2, scope: !966, file: !441, line: 97, type: !178)
!970 = !DILocation(line: 97, column: 35, scope: !966)
!971 = !DILocalVariable(name: "old", scope: !966, file: !441, line: 99, type: !81)
!972 = !DILocation(line: 99, column: 18, scope: !966)
!973 = !DILocation(line: 99, column: 39, scope: !966)
!974 = !DILocation(line: 99, column: 26, scope: !966)
!975 = !DILocation(line: 99, column: 43, scope: !966)
!976 = !DILocation(line: 99, column: 24, scope: !966)
!977 = !DILocalVariable(name: "new", scope: !966, file: !441, line: 100, type: !81)
!978 = !DILocation(line: 100, column: 18, scope: !966)
!979 = !DILocation(line: 100, column: 39, scope: !966)
!980 = !DILocation(line: 100, column: 26, scope: !966)
!981 = !DILocation(line: 100, column: 43, scope: !966)
!982 = !DILocation(line: 100, column: 24, scope: !966)
!983 = !DILocalVariable(name: "n", scope: !966, file: !441, line: 101, type: !122)
!984 = !DILocation(line: 101, column: 9, scope: !966)
!985 = !DILocalVariable(name: "h1", scope: !966, file: !441, line: 102, type: !92)
!986 = !DILocation(line: 102, column: 15, scope: !966)
!987 = !DILocalVariable(name: "h2", scope: !966, file: !441, line: 102, type: !92)
!988 = !DILocation(line: 102, column: 20, scope: !966)
!989 = !DILocation(line: 104, column: 13, scope: !990)
!990 = distinct !DILexicalBlock(scope: !966, file: !441, line: 104, column: 6)
!991 = !DILocation(line: 104, column: 18, scope: !990)
!992 = !DILocation(line: 104, column: 29, scope: !990)
!993 = !DILocation(line: 104, column: 34, scope: !990)
!994 = !DILocation(line: 104, column: 6, scope: !990)
!995 = !DILocation(line: 104, column: 45, scope: !990)
!996 = !DILocation(line: 104, column: 6, scope: !966)
!997 = !DILocation(line: 105, column: 3, scope: !990)
!998 = !DILocation(line: 106, column: 40, scope: !999)
!999 = distinct !DILexicalBlock(scope: !966, file: !441, line: 106, column: 6)
!1000 = !DILocation(line: 106, column: 27, scope: !999)
!1001 = !DILocation(line: 106, column: 44, scope: !999)
!1002 = !DILocation(line: 106, column: 64, scope: !999)
!1003 = !DILocation(line: 106, column: 51, scope: !999)
!1004 = !DILocation(line: 106, column: 68, scope: !999)
!1005 = !DILocation(line: 106, column: 7, scope: !999)
!1006 = !DILocation(line: 106, column: 6, scope: !966)
!1007 = !DILocation(line: 107, column: 3, scope: !999)
!1008 = !DILocation(line: 108, column: 8, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !966, file: !441, line: 108, column: 6)
!1010 = !DILocation(line: 108, column: 13, scope: !1009)
!1011 = !DILocation(line: 108, column: 20, scope: !1009)
!1012 = !DILocation(line: 108, column: 32, scope: !1009)
!1013 = !DILocation(line: 108, column: 37, scope: !1009)
!1014 = !DILocation(line: 108, column: 44, scope: !1009)
!1015 = !DILocation(line: 108, column: 27, scope: !1009)
!1016 = !DILocation(line: 108, column: 6, scope: !966)
!1017 = !DILocation(line: 109, column: 3, scope: !1009)
!1018 = !DILocation(line: 110, column: 9, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !966, file: !441, line: 110, column: 2)
!1020 = !DILocation(line: 110, column: 7, scope: !1019)
!1021 = !DILocation(line: 110, column: 14, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1023, file: !441, discriminator: 1)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !441, line: 110, column: 2)
!1024 = !DILocation(line: 110, column: 20, scope: !1022)
!1025 = !DILocation(line: 110, column: 25, scope: !1022)
!1026 = !DILocation(line: 110, column: 32, scope: !1022)
!1027 = !DILocation(line: 110, column: 18, scope: !1022)
!1028 = !DILocation(line: 110, column: 16, scope: !1022)
!1029 = !DILocation(line: 110, column: 2, scope: !1022)
!1030 = !DILocation(line: 111, column: 36, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1023, file: !441, line: 110, column: 45)
!1032 = !DILocation(line: 111, column: 41, scope: !1031)
!1033 = !DILocation(line: 111, column: 47, scope: !1031)
!1034 = !DILocation(line: 111, column: 23, scope: !1031)
!1035 = !DILocation(line: 111, column: 8, scope: !1031)
!1036 = !DILocation(line: 111, column: 6, scope: !1031)
!1037 = !DILocation(line: 112, column: 36, scope: !1031)
!1038 = !DILocation(line: 112, column: 41, scope: !1031)
!1039 = !DILocation(line: 112, column: 47, scope: !1031)
!1040 = !DILocation(line: 112, column: 23, scope: !1031)
!1041 = !DILocation(line: 112, column: 8, scope: !1031)
!1042 = !DILocation(line: 112, column: 6, scope: !1031)
!1043 = !DILocation(line: 113, column: 26, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1031, file: !441, line: 113, column: 7)
!1045 = !DILocation(line: 113, column: 30, scope: !1044)
!1046 = !DILocation(line: 113, column: 8, scope: !1044)
!1047 = !DILocation(line: 113, column: 7, scope: !1031)
!1048 = !DILocation(line: 114, column: 4, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1044, file: !441, line: 113, column: 35)
!1050 = !DILocation(line: 116, column: 2, scope: !1031)
!1051 = !DILocation(line: 110, column: 41, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1023, file: !441, discriminator: 2)
!1053 = !DILocation(line: 110, column: 2, scope: !1052)
!1054 = distinct !{!1054, !1055}
!1055 = !DILocation(line: 110, column: 2, scope: !966)
!1056 = !DILocation(line: 118, column: 2, scope: !966)
!1057 = !DILocation(line: 119, column: 1, scope: !966)
!1058 = distinct !DISubprogram(name: "smtp_free_host", scope: !441, file: !441, line: 58, type: !183, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1059 = !DILocalVariable(name: "data", arg: 1, scope: !1058, file: !441, line: 58, type: !178)
!1060 = !DILocation(line: 58, column: 22, scope: !1058)
!1061 = !DILocation(line: 60, column: 8, scope: !1058)
!1062 = !DILocation(line: 60, column: 3, scope: !1058)
!1063 = !DILocation(line: 60, column: 22, scope: !1058)
!1064 = !DILocation(line: 61, column: 1, scope: !1058)
!1065 = distinct !DISubprogram(name: "tcp_bind_connect", scope: !25, file: !25, line: 74, type: !1066, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!24, !128, !92}
!1068 = !DILocalVariable(name: "fd", arg: 1, scope: !1065, file: !25, line: 74, type: !128)
!1069 = !DILocation(line: 74, column: 22, scope: !1065)
!1070 = !DILocalVariable(name: "co", arg: 2, scope: !1065, file: !25, line: 74, type: !92)
!1071 = !DILocation(line: 74, column: 39, scope: !1065)
!1072 = !DILocation(line: 76, column: 29, scope: !1065)
!1073 = !DILocation(line: 76, column: 33, scope: !1065)
!1074 = !DILocation(line: 76, column: 9, scope: !1065)
!1075 = !DILocation(line: 76, column: 2, scope: !1065)
!1076 = distinct !DISubprogram(name: "tcp_connection_state", scope: !25, file: !25, line: 94, type: !1077, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!267, !128, !24, !129, !125, !109}
!1079 = !DILocalVariable(name: "fd", arg: 1, scope: !1076, file: !25, line: 94, type: !128)
!1080 = !DILocation(line: 94, column: 26, scope: !1076)
!1081 = !DILocalVariable(name: "status", arg: 2, scope: !1076, file: !25, line: 94, type: !24)
!1082 = !DILocation(line: 94, column: 50, scope: !1076)
!1083 = !DILocalVariable(name: "thread", arg: 3, scope: !1076, file: !25, line: 94, type: !129)
!1084 = !DILocation(line: 94, column: 69, scope: !1076)
!1085 = !DILocalVariable(name: "func", arg: 4, scope: !1076, file: !25, line: 95, type: !125)
!1086 = !DILocation(line: 95, column: 14, scope: !1076)
!1087 = !DILocalVariable(name: "timeout", arg: 5, scope: !1076, file: !25, line: 95, type: !109)
!1088 = !DILocation(line: 95, column: 48, scope: !1076)
!1089 = !DILocation(line: 97, column: 33, scope: !1076)
!1090 = !DILocation(line: 97, column: 37, scope: !1076)
!1091 = !DILocation(line: 97, column: 45, scope: !1076)
!1092 = !DILocation(line: 97, column: 53, scope: !1076)
!1093 = !DILocation(line: 97, column: 59, scope: !1076)
!1094 = !DILocation(line: 97, column: 9, scope: !1076)
!1095 = !DILocation(line: 97, column: 2, scope: !1076)
!1096 = distinct !DISubprogram(name: "smtp_check_thread", scope: !441, file: !441, line: 673, type: !126, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1097 = !DILocalVariable(name: "thread", arg: 1, scope: !1096, file: !441, line: 673, type: !129)
!1098 = !DILocation(line: 673, column: 29, scope: !1096)
!1099 = !DILocalVariable(name: "checker", scope: !1096, file: !441, line: 675, type: !306)
!1100 = !DILocation(line: 675, column: 13, scope: !1096)
!1101 = !DILocation(line: 675, column: 25, scope: !1096)
!1102 = !DILocation(line: 675, column: 34, scope: !1096)
!1103 = !DILocation(line: 675, column: 23, scope: !1096)
!1104 = !DILocalVariable(name: "smtp_checker", scope: !1096, file: !441, line: 676, type: !81)
!1105 = !DILocation(line: 676, column: 18, scope: !1096)
!1106 = !DILocation(line: 676, column: 35, scope: !1096)
!1107 = !DILocation(line: 676, column: 45, scope: !1096)
!1108 = !DILocation(line: 676, column: 33, scope: !1096)
!1109 = !DILocalVariable(name: "smtp_host", scope: !1096, file: !441, line: 677, type: !92)
!1110 = !DILocation(line: 677, column: 15, scope: !1096)
!1111 = !DILocation(line: 677, column: 27, scope: !1096)
!1112 = !DILocation(line: 677, column: 41, scope: !1096)
!1113 = !DILocalVariable(name: "status", scope: !1096, file: !441, line: 678, type: !128)
!1114 = !DILocation(line: 678, column: 6, scope: !1096)
!1115 = !DILocation(line: 680, column: 28, scope: !1096)
!1116 = !DILocation(line: 680, column: 11, scope: !1096)
!1117 = !DILocation(line: 680, column: 9, scope: !1096)
!1118 = !DILocation(line: 681, column: 10, scope: !1096)
!1119 = !DILocation(line: 681, column: 2, scope: !1096)
!1120 = !DILocation(line: 683, column: 15, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1096, file: !441, line: 681, column: 18)
!1122 = !DILocation(line: 684, column: 37, scope: !1121)
!1123 = !DILocation(line: 684, column: 49, scope: !1121)
!1124 = !DILocation(line: 684, column: 14, scope: !1121)
!1125 = !DILocation(line: 683, column: 4, scope: !1121)
!1126 = !DILocation(line: 685, column: 4, scope: !1121)
!1127 = !DILocation(line: 688, column: 15, scope: !1121)
!1128 = !DILocation(line: 689, column: 37, scope: !1121)
!1129 = !DILocation(line: 689, column: 49, scope: !1121)
!1130 = !DILocation(line: 689, column: 14, scope: !1121)
!1131 = !DILocation(line: 688, column: 4, scope: !1121)
!1132 = !DILocation(line: 690, column: 4, scope: !1121)
!1133 = !DILocation(line: 697, column: 4, scope: !1121)
!1134 = !DILocation(line: 697, column: 18, scope: !1121)
!1135 = !DILocation(line: 697, column: 24, scope: !1121)
!1136 = !DILocation(line: 698, column: 23, scope: !1121)
!1137 = !DILocation(line: 698, column: 4, scope: !1121)
!1138 = !DILocation(line: 699, column: 4, scope: !1121)
!1139 = !DILocation(line: 703, column: 15, scope: !1121)
!1140 = !DILocation(line: 704, column: 37, scope: !1121)
!1141 = !DILocation(line: 704, column: 49, scope: !1121)
!1142 = !DILocation(line: 704, column: 14, scope: !1121)
!1143 = !DILocation(line: 703, column: 4, scope: !1121)
!1144 = !DILocation(line: 705, column: 4, scope: !1121)
!1145 = !DILocation(line: 708, column: 2, scope: !1096)
!1146 = distinct !DISubprogram(name: "tcp_socket_state", scope: !25, file: !25, line: 87, type: !1147, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!24, !129, !125}
!1149 = !DILocalVariable(name: "thread", arg: 1, scope: !1146, file: !25, line: 87, type: !129)
!1150 = !DILocation(line: 87, column: 29, scope: !1146)
!1151 = !DILocalVariable(name: "func", arg: 2, scope: !1146, file: !25, line: 87, type: !125)
!1152 = !DILocation(line: 87, column: 43, scope: !1146)
!1153 = !DILocation(line: 89, column: 22, scope: !1146)
!1154 = !DILocation(line: 89, column: 30, scope: !1146)
!1155 = !DILocation(line: 89, column: 9, scope: !1146)
!1156 = !DILocation(line: 89, column: 2, scope: !1146)
!1157 = distinct !DISubprogram(name: "smtp_final", scope: !441, file: !441, line: 279, type: !1158, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !449)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!128, !129, !128, !1160, null}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!1162 = !DILocalVariable(name: "thread", arg: 1, scope: !1157, file: !441, line: 279, type: !129)
!1163 = !DILocation(line: 279, column: 22, scope: !1157)
!1164 = !DILocalVariable(name: "error", arg: 2, scope: !1157, file: !441, line: 279, type: !128)
!1165 = !DILocation(line: 279, column: 34, scope: !1157)
!1166 = !DILocalVariable(name: "format", arg: 3, scope: !1157, file: !441, line: 279, type: !1160)
!1167 = !DILocation(line: 279, column: 53, scope: !1157)
!1168 = !DILocalVariable(name: "checker", scope: !1157, file: !441, line: 281, type: !306)
!1169 = !DILocation(line: 281, column: 13, scope: !1157)
!1170 = !DILocation(line: 281, column: 25, scope: !1157)
!1171 = !DILocation(line: 281, column: 34, scope: !1157)
!1172 = !DILocation(line: 281, column: 23, scope: !1157)
!1173 = !DILocalVariable(name: "smtp_checker", scope: !1157, file: !441, line: 282, type: !81)
!1174 = !DILocation(line: 282, column: 18, scope: !1157)
!1175 = !DILocation(line: 282, column: 35, scope: !1157)
!1176 = !DILocation(line: 282, column: 45, scope: !1157)
!1177 = !DILocation(line: 282, column: 33, scope: !1157)
!1178 = !DILocalVariable(name: "error_buff", scope: !1157, file: !441, line: 283, type: !118)
!1179 = !DILocation(line: 283, column: 7, scope: !1157)
!1180 = !DILocalVariable(name: "smtp_buff", scope: !1157, file: !441, line: 284, type: !1181)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 4336, align: 8, elements: !1182)
!1182 = !{!1183}
!1183 = !DISubrange(count: 542)
!1184 = !DILocation(line: 284, column: 7, scope: !1157)
!1185 = !DILocalVariable(name: "varg_list", scope: !1157, file: !441, line: 285, type: !1186)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !191, line: 79, baseType: !1187)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1188, line: 40, baseType: !1189)
!1188 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 285, baseType: !1190)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 192, align: 64, elements: !227)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 285, size: 192, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1191, file: !1, line: 285, baseType: !90, size: 32, align: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1191, file: !1, line: 285, baseType: !90, size: 32, align: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1191, file: !1, line: 285, baseType: !178, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1191, file: !1, line: 285, baseType: !178, size: 64, align: 64, offset: 128)
!1197 = !DILocation(line: 285, column: 10, scope: !1157)
!1198 = !DILocalVariable(name: "checker_was_up", scope: !1157, file: !441, line: 286, type: !267)
!1199 = !DILocation(line: 286, column: 6, scope: !1157)
!1200 = !DILocalVariable(name: "rs_was_alive", scope: !1157, file: !441, line: 287, type: !267)
!1201 = !DILocation(line: 287, column: 6, scope: !1157)
!1202 = !DILocation(line: 290, column: 18, scope: !1157)
!1203 = !DILocation(line: 290, column: 2, scope: !1157)
!1204 = !DILocation(line: 293, column: 2, scope: !1157)
!1205 = !DILocation(line: 293, column: 11, scope: !1157)
!1206 = !DILocation(line: 293, column: 19, scope: !1157)
!1207 = !DILocation(line: 295, column: 6, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1157, file: !441, line: 295, column: 6)
!1209 = !DILocation(line: 295, column: 6, scope: !1157)
!1210 = !DILocation(line: 297, column: 7, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1212, file: !441, line: 297, column: 7)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !441, line: 295, column: 13)
!1213 = !DILocation(line: 297, column: 16, scope: !1211)
!1214 = !DILocation(line: 297, column: 7, scope: !1212)
!1215 = !DILocation(line: 298, column: 8, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1217, file: !441, line: 298, column: 8)
!1217 = distinct !DILexicalBlock(scope: !1211, file: !441, line: 297, column: 23)
!1218 = !DILocation(line: 298, column: 15, scope: !1216)
!1219 = !DILocation(line: 298, column: 8, scope: !1217)
!1220 = !DILocation(line: 300, column: 13, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1216, file: !441, line: 298, column: 23)
!1222 = !DILocation(line: 300, column: 5, scope: !1221)
!1223 = !DILocation(line: 301, column: 13, scope: !1221)
!1224 = !DILocation(line: 301, column: 25, scope: !1221)
!1225 = !DILocation(line: 301, column: 5, scope: !1221)
!1226 = !DILocation(line: 303, column: 4, scope: !1221)
!1227 = !DILocation(line: 304, column: 27, scope: !1221)
!1228 = !DILocation(line: 304, column: 39, scope: !1221)
!1229 = !DILocation(line: 304, column: 5, scope: !1221)
