; ModuleID = './[inter]keepalived--check--check_parser.o.i'
source_filename = "./[inter]keepalived--check--check_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._vector = type { i32, i32, i8** }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._check_data = type { i8, %struct._ssl_data*, %struct._list*, %struct._list* }
%struct._ssl_data = type { i32, i32, %struct.ssl_ctx_st*, %struct.ssl_method_st*, i8*, i8*, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !48, globals: !55)
!1 = !DIFile(filename: "[inter]keepalived--check--check_parser.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !19}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!7 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!8 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!9 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!10 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!11 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!12 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!13 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!14 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!15 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!16 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!17 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!18 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 40, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!22 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!23 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!24 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!25 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!26 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!27 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!28 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!29 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!30 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!31 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!32 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!33 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!34 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!35 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!36 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!37 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!38 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!39 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!40 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!41 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!42 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!43 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!44 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!45 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!46 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!47 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!48 = !{!49, !50, !52, !54}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !53, line: 51, baseType: !54)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!54 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!55 = !{!56, !61}
!56 = distinct !DIGlobalVariable(name: "lvs_schedulers", scope: !0, file: !57, line: 50, type: !58, isLocal: false, isDefinition: true, variable: [14 x i8*]* @lvs_schedulers)
!57 = !DIFile(filename: "check_parser.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 896, align: 64, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 14)
!61 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !62, line: 150, type: !63, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!62 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !64, line: 31, baseType: !65)
!64 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !64, line: 39, size: 320, align: 64, elements: !67)
!67 = !{!68, !75, !76, !77, !81}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !66, file: !64, line: 40, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !64, line: 33, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !70, file: !64, line: 34, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !70, file: !64, line: 35, baseType: !69, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !64, line: 36, baseType: !49, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !66, file: !64, line: 41, baseType: !69, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !66, file: !64, line: 42, baseType: !54, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !66, file: !64, line: 43, baseType: !78, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !49}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !66, file: !64, line: 44, baseType: !82, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85, !49}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 48, baseType: !88)
!87 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 241, size: 1728, align: 64, elements: !90)
!89 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!90 = !{!91, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !112, !113, !114, !115, !119, !121, !123, !127, !130, !132, !133, !134, !135, !136, !140, !141}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 242, baseType: !92, size: 32, align: 32)
!92 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 247, baseType: !50, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 248, baseType: !50, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 249, baseType: !50, size: 64, align: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 250, baseType: !50, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 251, baseType: !50, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 252, baseType: !50, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 253, baseType: !50, size: 64, align: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 254, baseType: !50, size: 64, align: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 256, baseType: !50, size: 64, align: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 257, baseType: !50, size: 64, align: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 258, baseType: !50, size: 64, align: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 260, baseType: !105, size: 64, align: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 156, size: 192, align: 64, elements: !107)
!107 = !{!108, !109, !111}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !106, file: !89, line: 157, baseType: !105, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !106, file: !89, line: 158, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !106, file: !89, line: 162, baseType: !92, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 262, baseType: !110, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 264, baseType: !92, size: 32, align: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 268, baseType: !92, size: 32, align: 32, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 270, baseType: !116, size: 64, align: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !117, line: 131, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!118 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 274, baseType: !120, size: 16, align: 16, offset: 1024)
!120 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 275, baseType: !122, size: 8, align: 8, offset: 1040)
!122 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 276, baseType: !124, size: 8, align: 8, offset: 1048)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 1)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 280, baseType: !128, size: 64, align: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 150, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 289, baseType: !131, size: 64, align: 64, offset: 1152)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !117, line: 132, baseType: !118)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !88, file: !89, line: 297, baseType: !49, size: 64, align: 64, offset: 1216)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !88, file: !89, line: 298, baseType: !49, size: 64, align: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !88, file: !89, line: 299, baseType: !49, size: 64, align: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !88, file: !89, line: 300, baseType: !49, size: 64, align: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 302, baseType: !137, size: 64, align: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 216, baseType: !139)
!138 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!139 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 303, baseType: !92, size: 32, align: 32, offset: 1536)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 305, baseType: !142, size: 160, align: 8, offset: 1568)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, align: 8, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 20)
!145 = !{i32 2, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!148 = distinct !DISubprogram(name: "init_check_keywords", scope: !57, file: !57, line: 786, type: !149, isLocal: false, isDefinition: true, scopeLine: 787, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151}
!151 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!152 = !{}
!153 = !DILocalVariable(name: "active", arg: 1, scope: !148, file: !57, line: 786, type: !151)
!154 = !DIExpression()
!155 = !DILocation(line: 786, column: 25, scope: !148)
!156 = !DILocation(line: 789, column: 44, scope: !148)
!157 = !DILocation(line: 789, column: 2, scope: !148)
!158 = !DILocation(line: 790, column: 2, scope: !148)
!159 = !DILocation(line: 791, column: 2, scope: !148)
!160 = !DILocation(line: 792, column: 2, scope: !148)
!161 = !DILocation(line: 793, column: 2, scope: !148)
!162 = !DILocation(line: 796, column: 61, scope: !148)
!163 = !DILocation(line: 796, column: 2, scope: !148)
!164 = !DILocation(line: 797, column: 54, scope: !148)
!165 = !DILocation(line: 797, column: 2, scope: !148)
!166 = !DILocation(line: 798, column: 2, scope: !148)
!167 = !DILocation(line: 799, column: 2, scope: !148)
!168 = !DILocation(line: 800, column: 2, scope: !148)
!169 = !DILocation(line: 801, column: 2, scope: !148)
!170 = !DILocation(line: 802, column: 2, scope: !148)
!171 = !DILocation(line: 803, column: 2, scope: !148)
!172 = !DILocation(line: 804, column: 2, scope: !148)
!173 = !DILocation(line: 805, column: 2, scope: !148)
!174 = !DILocation(line: 806, column: 2, scope: !148)
!175 = !DILocation(line: 808, column: 2, scope: !148)
!176 = !DILocation(line: 810, column: 2, scope: !148)
!177 = !DILocation(line: 813, column: 2, scope: !148)
!178 = !DILocation(line: 814, column: 2, scope: !148)
!179 = !DILocation(line: 815, column: 2, scope: !148)
!180 = !DILocation(line: 816, column: 2, scope: !148)
!181 = !DILocation(line: 817, column: 2, scope: !148)
!182 = !DILocation(line: 819, column: 2, scope: !148)
!183 = !DILocation(line: 820, column: 2, scope: !148)
!184 = !DILocation(line: 822, column: 2, scope: !148)
!185 = !DILocation(line: 824, column: 2, scope: !148)
!186 = !DILocation(line: 825, column: 2, scope: !148)
!187 = !DILocation(line: 826, column: 2, scope: !148)
!188 = !DILocation(line: 827, column: 2, scope: !148)
!189 = !DILocation(line: 828, column: 2, scope: !148)
!190 = !DILocation(line: 829, column: 2, scope: !148)
!191 = !DILocation(line: 832, column: 2, scope: !148)
!192 = !DILocation(line: 833, column: 2, scope: !148)
!193 = !DILocation(line: 834, column: 2, scope: !148)
!194 = !DILocation(line: 835, column: 2, scope: !148)
!195 = !DILocation(line: 836, column: 2, scope: !148)
!196 = !DILocation(line: 837, column: 2, scope: !148)
!197 = !DILocation(line: 838, column: 2, scope: !148)
!198 = !DILocation(line: 841, column: 2, scope: !148)
!199 = !DILocation(line: 842, column: 2, scope: !148)
!200 = !DILocation(line: 843, column: 2, scope: !148)
!201 = !DILocation(line: 844, column: 2, scope: !148)
!202 = !DILocation(line: 845, column: 2, scope: !148)
!203 = !DILocation(line: 846, column: 2, scope: !148)
!204 = !DILocation(line: 847, column: 2, scope: !148)
!205 = !DILocation(line: 848, column: 2, scope: !148)
!206 = !DILocation(line: 849, column: 2, scope: !148)
!207 = !DILocation(line: 850, column: 2, scope: !148)
!208 = !DILocation(line: 851, column: 2, scope: !148)
!209 = !DILocation(line: 852, column: 2, scope: !148)
!210 = !DILocation(line: 853, column: 2, scope: !148)
!211 = !DILocation(line: 854, column: 2, scope: !148)
!212 = !DILocation(line: 855, column: 2, scope: !148)
!213 = !DILocation(line: 856, column: 2, scope: !148)
!214 = !DILocation(line: 857, column: 2, scope: !148)
!215 = !DILocation(line: 858, column: 2, scope: !148)
!216 = !DILocation(line: 859, column: 2, scope: !148)
!217 = !DILocation(line: 861, column: 2, scope: !148)
!218 = !DILocation(line: 864, column: 2, scope: !148)
!219 = !DILocation(line: 865, column: 2, scope: !148)
!220 = !DILocation(line: 866, column: 1, scope: !148)
!221 = distinct !DISubprogram(name: "ssl_handler", scope: !57, file: !57, line: 55, type: !222, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !226, line: 34, baseType: !227)
!226 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !226, line: 30, size: 128, align: 64, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !227, file: !226, line: 31, baseType: !54, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !227, file: !226, line: 32, baseType: !54, size: 32, align: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !227, file: !226, line: 33, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!233 = !DILocalVariable(name: "strvec", arg: 1, scope: !221, file: !57, line: 55, type: !224)
!234 = !DILocation(line: 55, column: 23, scope: !221)
!235 = !DILocation(line: 57, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !221, file: !57, line: 57, column: 6)
!237 = !DILocation(line: 57, column: 6, scope: !221)
!238 = !DILocation(line: 58, column: 3, scope: !236)
!239 = !DILocation(line: 60, column: 6, scope: !240)
!240 = distinct !DILexicalBlock(scope: !221, file: !57, line: 60, column: 6)
!241 = !DILocation(line: 60, column: 18, scope: !240)
!242 = !DILocation(line: 60, column: 6, scope: !221)
!243 = !DILocation(line: 61, column: 3, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !57, line: 60, column: 23)
!245 = !DILocation(line: 62, column: 3, scope: !244)
!246 = !DILocation(line: 63, column: 2, scope: !244)
!247 = !DILocation(line: 64, column: 20, scope: !221)
!248 = !DILocation(line: 64, column: 2, scope: !221)
!249 = !DILocation(line: 64, column: 14, scope: !221)
!250 = !DILocation(line: 64, column: 18, scope: !221)
!251 = !DILocation(line: 65, column: 1, scope: !221)
!252 = !DILocation(line: 65, column: 1, scope: !253)
!253 = !DILexicalBlockFile(scope: !221, file: !57, discriminator: 1)
!254 = distinct !DISubprogram(name: "sslpass_handler", scope: !57, file: !57, line: 67, type: !222, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!255 = !DILocalVariable(name: "strvec", arg: 1, scope: !254, file: !57, line: 67, type: !224)
!256 = !DILocation(line: 67, column: 27, scope: !254)
!257 = !DILocation(line: 69, column: 6, scope: !258)
!258 = distinct !DILexicalBlock(scope: !254, file: !57, line: 69, column: 6)
!259 = !DILocation(line: 69, column: 18, scope: !258)
!260 = !DILocation(line: 69, column: 23, scope: !258)
!261 = !DILocation(line: 69, column: 6, scope: !254)
!262 = !DILocation(line: 70, column: 3, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !57, line: 69, column: 33)
!264 = !DILocation(line: 71, column: 9, scope: !263)
!265 = !DILocation(line: 71, column: 21, scope: !263)
!266 = !DILocation(line: 71, column: 26, scope: !263)
!267 = !DILocation(line: 71, column: 4, scope: !263)
!268 = !DILocation(line: 71, column: 38, scope: !263)
!269 = !DILocation(line: 71, column: 50, scope: !263)
!270 = !DILocation(line: 71, column: 55, scope: !263)
!271 = !DILocation(line: 71, column: 65, scope: !263)
!272 = !DILocation(line: 72, column: 2, scope: !263)
!273 = !DILocation(line: 73, column: 40, scope: !254)
!274 = !DILocation(line: 73, column: 30, scope: !254)
!275 = !DILocation(line: 73, column: 2, scope: !254)
!276 = !DILocation(line: 73, column: 14, scope: !254)
!277 = !DILocation(line: 73, column: 19, scope: !254)
!278 = !DILocation(line: 73, column: 28, scope: !254)
!279 = !DILocation(line: 74, column: 1, scope: !254)
!280 = distinct !DISubprogram(name: "sslca_handler", scope: !57, file: !57, line: 76, type: !222, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!281 = !DILocalVariable(name: "strvec", arg: 1, scope: !280, file: !57, line: 76, type: !224)
!282 = !DILocation(line: 76, column: 25, scope: !280)
!283 = !DILocation(line: 78, column: 6, scope: !284)
!284 = distinct !DILexicalBlock(scope: !280, file: !57, line: 78, column: 6)
!285 = !DILocation(line: 78, column: 18, scope: !284)
!286 = !DILocation(line: 78, column: 23, scope: !284)
!287 = !DILocation(line: 78, column: 6, scope: !280)
!288 = !DILocation(line: 79, column: 3, scope: !289)
!289 = distinct !DILexicalBlock(scope: !284, file: !57, line: 78, column: 31)
!290 = !DILocation(line: 80, column: 9, scope: !289)
!291 = !DILocation(line: 80, column: 21, scope: !289)
!292 = !DILocation(line: 80, column: 26, scope: !289)
!293 = !DILocation(line: 80, column: 4, scope: !289)
!294 = !DILocation(line: 80, column: 36, scope: !289)
!295 = !DILocation(line: 80, column: 48, scope: !289)
!296 = !DILocation(line: 80, column: 53, scope: !289)
!297 = !DILocation(line: 80, column: 61, scope: !289)
!298 = !DILocation(line: 81, column: 2, scope: !289)
!299 = !DILocation(line: 82, column: 38, scope: !280)
!300 = !DILocation(line: 82, column: 28, scope: !280)
!301 = !DILocation(line: 82, column: 2, scope: !280)
!302 = !DILocation(line: 82, column: 14, scope: !280)
!303 = !DILocation(line: 82, column: 19, scope: !280)
!304 = !DILocation(line: 82, column: 26, scope: !280)
!305 = !DILocation(line: 83, column: 1, scope: !280)
!306 = distinct !DISubprogram(name: "sslcert_handler", scope: !57, file: !57, line: 85, type: !222, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!307 = !DILocalVariable(name: "strvec", arg: 1, scope: !306, file: !57, line: 85, type: !224)
!308 = !DILocation(line: 85, column: 27, scope: !306)
!309 = !DILocation(line: 87, column: 6, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !57, line: 87, column: 6)
!311 = !DILocation(line: 87, column: 18, scope: !310)
!312 = !DILocation(line: 87, column: 23, scope: !310)
!313 = !DILocation(line: 87, column: 6, scope: !306)
!314 = !DILocation(line: 88, column: 3, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !57, line: 87, column: 33)
!316 = !DILocation(line: 89, column: 9, scope: !315)
!317 = !DILocation(line: 89, column: 21, scope: !315)
!318 = !DILocation(line: 89, column: 26, scope: !315)
!319 = !DILocation(line: 89, column: 4, scope: !315)
!320 = !DILocation(line: 89, column: 38, scope: !315)
!321 = !DILocation(line: 89, column: 50, scope: !315)
!322 = !DILocation(line: 89, column: 55, scope: !315)
!323 = !DILocation(line: 89, column: 65, scope: !315)
!324 = !DILocation(line: 90, column: 2, scope: !315)
!325 = !DILocation(line: 91, column: 40, scope: !306)
!326 = !DILocation(line: 91, column: 30, scope: !306)
!327 = !DILocation(line: 91, column: 2, scope: !306)
!328 = !DILocation(line: 91, column: 14, scope: !306)
!329 = !DILocation(line: 91, column: 19, scope: !306)
!330 = !DILocation(line: 91, column: 28, scope: !306)
!331 = !DILocation(line: 92, column: 1, scope: !306)
!332 = distinct !DISubprogram(name: "sslkey_handler", scope: !57, file: !57, line: 94, type: !222, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!333 = !DILocalVariable(name: "strvec", arg: 1, scope: !332, file: !57, line: 94, type: !224)
!334 = !DILocation(line: 94, column: 26, scope: !332)
!335 = !DILocation(line: 96, column: 6, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !57, line: 96, column: 6)
!337 = !DILocation(line: 96, column: 18, scope: !336)
!338 = !DILocation(line: 96, column: 23, scope: !336)
!339 = !DILocation(line: 96, column: 6, scope: !332)
!340 = !DILocation(line: 97, column: 3, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !57, line: 96, column: 32)
!342 = !DILocation(line: 98, column: 9, scope: !341)
!343 = !DILocation(line: 98, column: 21, scope: !341)
!344 = !DILocation(line: 98, column: 26, scope: !341)
!345 = !DILocation(line: 98, column: 4, scope: !341)
!346 = !DILocation(line: 98, column: 37, scope: !341)
!347 = !DILocation(line: 98, column: 49, scope: !341)
!348 = !DILocation(line: 98, column: 54, scope: !341)
!349 = !DILocation(line: 98, column: 63, scope: !341)
!350 = !DILocation(line: 99, column: 2, scope: !341)
!351 = !DILocation(line: 100, column: 39, scope: !332)
!352 = !DILocation(line: 100, column: 29, scope: !332)
!353 = !DILocation(line: 100, column: 2, scope: !332)
!354 = !DILocation(line: 100, column: 14, scope: !332)
!355 = !DILocation(line: 100, column: 19, scope: !332)
!356 = !DILocation(line: 100, column: 27, scope: !332)
!357 = !DILocation(line: 101, column: 1, scope: !332)
!358 = distinct !DISubprogram(name: "vsg_handler", scope: !57, file: !57, line: 105, type: !222, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!359 = !DILocalVariable(name: "strvec", arg: 1, scope: !358, file: !57, line: 105, type: !224)
!360 = !DILocation(line: 105, column: 23, scope: !358)
!361 = !DILocalVariable(name: "vsg", scope: !358, file: !57, line: 107, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !364, line: 128, baseType: !365)
!364 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !364, line: 124, size: 192, align: 64, elements: !366)
!366 = !{!367, !368, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !365, file: !364, line: 125, baseType: !50, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !365, file: !364, line: 126, baseType: !63, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !365, file: !364, line: 127, baseType: !63, size: 64, align: 64, offset: 128)
!370 = !DILocation(line: 107, column: 26, scope: !358)
!371 = !DILocation(line: 109, column: 7, scope: !372)
!372 = distinct !DILexicalBlock(scope: !358, file: !57, line: 109, column: 6)
!373 = !DILocation(line: 109, column: 6, scope: !358)
!374 = !DILocation(line: 110, column: 3, scope: !372)
!375 = !DILocation(line: 113, column: 24, scope: !358)
!376 = !DILocation(line: 113, column: 12, scope: !358)
!377 = !DILocation(line: 113, column: 2, scope: !378)
!378 = !DILexicalBlockFile(scope: !358, file: !57, discriminator: 1)
!379 = !DILocation(line: 114, column: 49, scope: !358)
!380 = !DILocation(line: 114, column: 37, scope: !358)
!381 = !DILocation(line: 114, column: 2, scope: !378)
!382 = !DILocation(line: 117, column: 10, scope: !358)
!383 = !DILocation(line: 117, column: 22, scope: !358)
!384 = !DILocation(line: 117, column: 33, scope: !358)
!385 = !DILocation(line: 117, column: 39, scope: !358)
!386 = !DILocation(line: 117, column: 8, scope: !358)
!387 = !DILocation(line: 117, column: 6, scope: !358)
!388 = !DILocation(line: 118, column: 8, scope: !389)
!389 = distinct !DILexicalBlock(scope: !358, file: !57, line: 118, column: 6)
!390 = !DILocation(line: 118, column: 13, scope: !389)
!391 = !DILocation(line: 118, column: 22, scope: !389)
!392 = !DILocation(line: 118, column: 5, scope: !389)
!393 = !DILocation(line: 118, column: 10, scope: !394)
!394 = !DILexicalBlockFile(scope: !389, file: !57, discriminator: 1)
!395 = !DILocation(line: 118, column: 15, scope: !394)
!396 = !DILocation(line: 118, column: 25, scope: !394)
!397 = !DILocation(line: 118, column: 30, scope: !394)
!398 = !DILocation(line: 118, column: 5, scope: !394)
!399 = !DILocation(line: 118, column: 9, scope: !400)
!400 = !DILexicalBlockFile(scope: !389, file: !57, discriminator: 2)
!401 = !DILocation(line: 118, column: 14, scope: !400)
!402 = !DILocation(line: 118, column: 24, scope: !400)
!403 = !DILocation(line: 118, column: 29, scope: !400)
!404 = !DILocation(line: 118, column: 8, scope: !400)
!405 = !DILocation(line: 118, column: 13, scope: !406)
!406 = !DILexicalBlockFile(scope: !389, file: !57, discriminator: 3)
!407 = !DILocation(line: 118, column: 18, scope: !406)
!408 = !DILocation(line: 118, column: 30, scope: !406)
!409 = !DILocation(line: 118, column: 35, scope: !406)
!410 = !DILocation(line: 118, column: 40, scope: !411)
!411 = !DILexicalBlockFile(scope: !389, file: !57, discriminator: 4)
!412 = !DILocation(line: 118, column: 45, scope: !411)
!413 = !DILocation(line: 118, column: 58, scope: !411)
!414 = !DILocation(line: 118, column: 63, scope: !411)
!415 = !DILocation(line: 118, column: 35, scope: !411)
!416 = !DILocation(line: 118, column: 39, scope: !417)
!417 = !DILexicalBlockFile(scope: !389, file: !57, discriminator: 5)
!418 = !DILocation(line: 118, column: 44, scope: !417)
!419 = !DILocation(line: 118, column: 57, scope: !417)
!420 = !DILocation(line: 118, column: 62, scope: !417)
!421 = !DILocation(line: 118, column: 6, scope: !417)
!422 = !DILocation(line: 119, column: 98, scope: !423)
!423 = distinct !DILexicalBlock(scope: !389, file: !57, line: 118, column: 39)
!424 = !DILocation(line: 119, column: 103, scope: !423)
!425 = !DILocation(line: 119, column: 3, scope: !423)
!426 = !DILocation(line: 120, column: 21, scope: !423)
!427 = !DILocation(line: 120, column: 33, scope: !423)
!428 = !DILocation(line: 120, column: 43, scope: !423)
!429 = !DILocation(line: 120, column: 55, scope: !423)
!430 = !DILocation(line: 120, column: 65, scope: !423)
!431 = !DILocation(line: 120, column: 3, scope: !423)
!432 = !DILocation(line: 121, column: 2, scope: !423)
!433 = !DILocation(line: 122, column: 1, scope: !358)
!434 = distinct !DISubprogram(name: "vs_handler", scope: !57, file: !57, line: 124, type: !222, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!435 = !DILocalVariable(name: "strvec", arg: 1, scope: !434, file: !57, line: 124, type: !224)
!436 = !DILocation(line: 124, column: 22, scope: !434)
!437 = !DILocation(line: 126, column: 2, scope: !434)
!438 = !DILocation(line: 126, column: 15, scope: !434)
!439 = !DILocation(line: 126, column: 35, scope: !434)
!440 = !DILocation(line: 129, column: 7, scope: !441)
!441 = distinct !DILexicalBlock(scope: !434, file: !57, line: 129, column: 6)
!442 = !DILocation(line: 129, column: 6, scope: !434)
!443 = !DILocation(line: 130, column: 3, scope: !441)
!444 = !DILocation(line: 132, column: 23, scope: !434)
!445 = !DILocation(line: 132, column: 11, scope: !434)
!446 = !DILocation(line: 132, column: 37, scope: !434)
!447 = !DILocation(line: 132, column: 46, scope: !434)
!448 = !DILocation(line: 132, column: 57, scope: !434)
!449 = !DILocation(line: 132, column: 35, scope: !434)
!450 = !DILocation(line: 132, column: 76, scope: !451)
!451 = !DILexicalBlockFile(scope: !434, file: !57, discriminator: 1)
!452 = !DILocation(line: 132, column: 64, scope: !451)
!453 = !DILocation(line: 132, column: 35, scope: !451)
!454 = !DILocation(line: 132, column: 35, scope: !455)
!455 = !DILexicalBlockFile(scope: !434, file: !57, discriminator: 2)
!456 = !DILocation(line: 132, column: 35, scope: !457)
!457 = !DILexicalBlockFile(scope: !434, file: !57, discriminator: 3)
!458 = !DILocation(line: 132, column: 2, scope: !457)
!459 = !DILocation(line: 133, column: 1, scope: !434)
!460 = !DILocation(line: 133, column: 1, scope: !451)
!461 = distinct !DISubprogram(name: "vs_end_handler", scope: !57, file: !57, line: 135, type: !462, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !152)
!462 = !DISubroutineType(types: !463)
!463 = !{null}
!464 = !DILocalVariable(name: "vs", scope: !461, file: !57, line: 137, type: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !364, line: 180, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !364, line: 131, size: 2560, align: 64, elements: !468)
!468 = !{!469, !470, !471, !483, !484, !526, !528, !529, !530, !531, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !467, file: !364, line: 132, baseType: !50, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !467, file: !364, line: 133, baseType: !362, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !467, file: !364, line: 134, baseType: !472, size: 1024, align: 64, offset: 128)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !473, line: 166, size: 1024, align: 64, elements: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!474 = !{!475, !478, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !472, file: !473, line: 168, baseType: !476, size: 16, align: 16)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !477, line: 28, baseType: !120)
!477 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !472, file: !473, line: 169, baseType: !479, size: 944, align: 8, offset: 16)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 944, align: 8, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 118)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !472, file: !473, line: 170, baseType: !139, size: 64, align: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !467, file: !364, line: 135, baseType: !52, size: 32, align: 32, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !467, file: !364, line: 136, baseType: !485, size: 64, align: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !364, line: 102, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !364, line: 62, size: 1920, align: 64, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !487, file: !364, line: 63, baseType: !472, size: 1024, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !487, file: !364, line: 64, baseType: !92, size: 32, align: 32, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !487, file: !364, line: 65, baseType: !92, size: 32, align: 32, offset: 1056)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !487, file: !364, line: 66, baseType: !92, size: 32, align: 32, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !487, file: !364, line: 68, baseType: !54, size: 32, align: 32, offset: 1120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !487, file: !364, line: 69, baseType: !52, size: 32, align: 32, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !487, file: !364, line: 70, baseType: !52, size: 32, align: 32, offset: 1184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !487, file: !364, line: 71, baseType: !92, size: 32, align: 32, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !487, file: !364, line: 74, baseType: !498, size: 64, align: 64, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !500, line: 65, baseType: !501)
!500 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !500, line: 59, size: 192, align: 64, elements: !502)
!502 = !{!503, !505, !506, !507, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !501, file: !500, line: 60, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !501, file: !500, line: 61, baseType: !92, size: 32, align: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !501, file: !500, line: 62, baseType: !92, size: 32, align: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !501, file: !500, line: 63, baseType: !508, size: 32, align: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !509, line: 80, baseType: !510)
!509 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !117, line: 125, baseType: !54)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !501, file: !500, line: 64, baseType: !512, size: 32, align: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !509, line: 65, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !117, line: 126, baseType: !54)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !487, file: !364, line: 75, baseType: !498, size: 64, align: 64, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !487, file: !364, line: 76, baseType: !92, size: 32, align: 32, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !487, file: !364, line: 77, baseType: !139, size: 64, align: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !487, file: !364, line: 78, baseType: !139, size: 64, align: 64, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !487, file: !364, line: 79, baseType: !54, size: 32, align: 32, offset: 1600)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !487, file: !364, line: 80, baseType: !139, size: 64, align: 64, offset: 1664)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !487, file: !364, line: 81, baseType: !92, size: 32, align: 32, offset: 1728)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !487, file: !364, line: 83, baseType: !151, size: 8, align: 8, offset: 1760)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !487, file: !364, line: 84, baseType: !54, size: 32, align: 32, offset: 1792)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !487, file: !364, line: 85, baseType: !151, size: 8, align: 8, offset: 1824)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !487, file: !364, line: 86, baseType: !151, size: 8, align: 8, offset: 1832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !487, file: !364, line: 87, baseType: !50, size: 64, align: 64, offset: 1856)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !467, file: !364, line: 137, baseType: !527, size: 16, align: 16, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !53, line: 49, baseType: !120)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !467, file: !364, line: 138, baseType: !527, size: 16, align: 16, offset: 1296)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !467, file: !364, line: 139, baseType: !151, size: 8, align: 8, offset: 1312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !467, file: !364, line: 140, baseType: !92, size: 32, align: 32, offset: 1344)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !467, file: !364, line: 142, baseType: !532, size: 128, align: 8, offset: 1376)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, align: 8, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !364, line: 143, baseType: !52, size: 32, align: 32, offset: 1504)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !467, file: !364, line: 144, baseType: !52, size: 32, align: 32, offset: 1536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !467, file: !364, line: 146, baseType: !532, size: 128, align: 8, offset: 1568)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !467, file: !364, line: 148, baseType: !54, size: 32, align: 32, offset: 1696)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !467, file: !364, line: 149, baseType: !52, size: 32, align: 32, offset: 1728)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !467, file: !364, line: 151, baseType: !50, size: 64, align: 64, offset: 1792)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !467, file: !364, line: 153, baseType: !92, size: 32, align: 32, offset: 1856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !467, file: !364, line: 154, baseType: !63, size: 64, align: 64, offset: 1920)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !467, file: !364, line: 155, baseType: !92, size: 32, align: 32, offset: 1984)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !467, file: !364, line: 156, baseType: !151, size: 8, align: 8, offset: 2016)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !467, file: !364, line: 157, baseType: !151, size: 8, align: 8, offset: 2024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !467, file: !364, line: 158, baseType: !151, size: 8, align: 8, offset: 2032)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !467, file: !364, line: 160, baseType: !139, size: 64, align: 64, offset: 2048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !467, file: !364, line: 161, baseType: !139, size: 64, align: 64, offset: 2112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !467, file: !364, line: 162, baseType: !54, size: 32, align: 32, offset: 2176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !467, file: !364, line: 163, baseType: !139, size: 64, align: 64, offset: 2240)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !467, file: !364, line: 164, baseType: !498, size: 64, align: 64, offset: 2304)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !467, file: !364, line: 165, baseType: !498, size: 64, align: 64, offset: 2368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !467, file: !364, line: 166, baseType: !54, size: 32, align: 32, offset: 2432)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !467, file: !364, line: 167, baseType: !54, size: 32, align: 32, offset: 2464)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !467, file: !364, line: 168, baseType: !92, size: 32, align: 32, offset: 2496)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !467, file: !364, line: 169, baseType: !151, size: 8, align: 8, offset: 2528)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !467, file: !364, line: 170, baseType: !151, size: 8, align: 8, offset: 2536)
!558 = !DILocation(line: 137, column: 20, scope: !461)
!559 = !DILocation(line: 137, column: 27, scope: !461)
!560 = !DILocation(line: 137, column: 39, scope: !461)
!561 = !DILocation(line: 137, column: 44, scope: !461)
!562 = !DILocation(line: 137, column: 50, scope: !461)
!563 = !DILocation(line: 137, column: 25, scope: !461)
!564 = !DILocalVariable(name: "rs", scope: !461, file: !57, line: 138, type: !485)
!565 = !DILocation(line: 138, column: 17, scope: !461)
!566 = !DILocalVariable(name: "e", scope: !461, file: !57, line: 139, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !64, line: 30, baseType: !69)
!568 = !DILocation(line: 139, column: 10, scope: !461)
!569 = !DILocation(line: 143, column: 6, scope: !570)
!570 = distinct !DILexicalBlock(scope: !461, file: !57, line: 143, column: 6)
!571 = !DILocation(line: 143, column: 10, scope: !570)
!572 = !DILocation(line: 145, column: 9, scope: !570)
!573 = !DILocation(line: 145, column: 12, scope: !574)
!574 = !DILexicalBlockFile(scope: !570, file: !57, discriminator: 1)
!575 = !DILocation(line: 145, column: 16, scope: !574)
!576 = !DILocation(line: 145, column: 23, scope: !574)
!577 = !DILocation(line: 145, column: 41, scope: !574)
!578 = !DILocation(line: 143, column: 6, scope: !579)
!579 = !DILexicalBlockFile(scope: !461, file: !57, discriminator: 1)
!580 = !DILocation(line: 149, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !57, line: 149, column: 7)
!582 = distinct !DILexicalBlock(scope: !570, file: !57, line: 148, column: 2)
!583 = !DILocation(line: 149, column: 11, scope: !581)
!584 = !DILocation(line: 149, column: 14, scope: !581)
!585 = !DILocation(line: 149, column: 7, scope: !582)
!586 = !DILocation(line: 150, column: 13, scope: !581)
!587 = !DILocation(line: 150, column: 17, scope: !581)
!588 = !DILocation(line: 150, column: 24, scope: !581)
!589 = !DILocation(line: 150, column: 29, scope: !581)
!590 = !DILocation(line: 150, column: 4, scope: !581)
!591 = !DILocation(line: 150, column: 8, scope: !581)
!592 = !DILocation(line: 150, column: 11, scope: !581)
!593 = !DILocation(line: 151, column: 12, scope: !594)
!594 = distinct !DILexicalBlock(scope: !581, file: !57, line: 151, column: 12)
!595 = !DILocation(line: 151, column: 16, scope: !594)
!596 = !DILocation(line: 151, column: 22, scope: !594)
!597 = !DILocation(line: 151, column: 26, scope: !594)
!598 = !DILocation(line: 151, column: 33, scope: !594)
!599 = !DILocation(line: 151, column: 38, scope: !594)
!600 = !DILocation(line: 151, column: 19, scope: !594)
!601 = !DILocation(line: 151, column: 12, scope: !581)
!602 = !DILocation(line: 152, column: 157, scope: !603)
!603 = distinct !DILexicalBlock(scope: !594, file: !57, line: 151, column: 49)
!604 = !DILocation(line: 152, column: 161, scope: !603)
!605 = !DILocation(line: 152, column: 168, scope: !603)
!606 = !DILocation(line: 152, column: 139, scope: !603)
!607 = !DILocation(line: 152, column: 4, scope: !608)
!608 = !DILexicalBlockFile(scope: !603, file: !57, discriminator: 1)
!609 = !DILocation(line: 153, column: 10, scope: !603)
!610 = !DILocation(line: 153, column: 14, scope: !603)
!611 = !DILocation(line: 153, column: 5, scope: !603)
!612 = !DILocation(line: 153, column: 23, scope: !603)
!613 = !DILocation(line: 153, column: 27, scope: !603)
!614 = !DILocation(line: 153, column: 34, scope: !603)
!615 = !DILocation(line: 154, column: 4, scope: !603)
!616 = !DILocation(line: 154, column: 8, scope: !603)
!617 = !DILocation(line: 154, column: 14, scope: !603)
!618 = !DILocation(line: 155, column: 3, scope: !603)
!619 = !DILocation(line: 156, column: 2, scope: !582)
!620 = !DILocation(line: 158, column: 6, scope: !621)
!621 = distinct !DILexicalBlock(scope: !461, file: !57, line: 158, column: 6)
!622 = !DILocation(line: 158, column: 10, scope: !621)
