; ModuleID = './[inter]keepalived--check--check_daemon.o.i'
source_filename = "./[inter]keepalived--check--check_daemon.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._thread_master = type { %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.rb_root, %struct.list_head, %struct.list_head, %struct.list_head, %struct._list*, %struct.rb_root, %struct.epoll_event*, %struct._thread_event*, i32, i32, i32, i32, %struct._thread*, i64, i64, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.rb_root = type { %struct.rb_node* }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }
%struct.epoll_event = type opaque
%struct._thread_event = type { %struct._thread*, %struct._thread*, i64, i32, %struct.rb_node }
%struct._thread = type { i64, i32, %struct._thread_master*, i32 (%struct._thread*)*, i8*, %struct.timeval, %union.anon, %struct._thread_event*, %union.anon.0 }
%struct.timeval = type { i64, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, globals: !234)
!1 = !DIFile(filename: "[inter]keepalived--check--check_daemon.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !9, !24, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 152, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PROG_TYPE_PARENT", value: 0)
!7 = !DIEnumerator(name: "PROG_TYPE_VRRP", value: 1)
!8 = !DIEnumerator(name: "PROG_TYPE_CHECKER", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !10, line: 53, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "../../lib/bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!13 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!14 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!15 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!16 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!17 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!18 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!19 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!20 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!21 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!22 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!23 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!26 = !DIEnumerator(name: "THREAD_READ", value: 0)
!27 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!28 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!29 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!30 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!31 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!32 = !DIEnumerator(name: "THREAD_READY", value: 6)
!33 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!34 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!35 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!36 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!37 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!38 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!39 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!40 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!41 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!42 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!43 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rusage_who", file: !45, line: 158, size: 32, align: 32, elements: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/resource.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "RUSAGE_SELF", value: 0)
!48 = !DIEnumerator(name: "RUSAGE_CHILDREN", value: -1)
!49 = !DIEnumerator(name: "RUSAGE_THREAD", value: 1)
!50 = !{!51, !52, !122}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !55)
!55 = !{!56, !58, !60, !198, !203, !204, !214, !227, !229}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !54, file: !4, line: 79, baseType: !57, size: 64, align: 64)
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !4, line: 80, baseType: !59, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !24)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !54, file: !4, line: 81, baseType: !61, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !63)
!63 = !{!64, !76, !77, !78, !79, !87, !88, !89, !174, !175, !178, !189, !190, !191, !192, !193, !194, !195, !196}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !62, file: !4, line: 113, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !66, line: 109, baseType: !67)
!66 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !66, line: 106, size: 64, align: 64, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !67, file: !66, line: 108, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !66, line: 97, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !71, file: !66, line: 99, baseType: !57, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !71, file: !66, line: 102, baseType: !70, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !71, file: !66, line: 103, baseType: !70, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !62, file: !4, line: 114, baseType: !65, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !62, file: !4, line: 115, baseType: !65, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !62, file: !4, line: 116, baseType: !65, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !62, file: !4, line: 117, baseType: !80, size: 128, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !81, line: 62, baseType: !82)
!81 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !81, line: 60, size: 128, align: 64, elements: !83)
!83 = !{!84, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !81, line: 61, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !81, line: 61, baseType: !85, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !62, file: !4, line: 121, baseType: !80, size: 128, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !62, file: !4, line: 122, baseType: !80, size: 128, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !62, file: !4, line: 124, baseType: !90, size: 64, align: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !91, line: 31, baseType: !92)
!91 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !91, line: 39, size: 320, align: 64, elements: !94)
!94 = !{!95, !102, !103, !105, !109}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !93, file: !91, line: 40, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !91, line: 33, size: 192, align: 64, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !97, file: !91, line: 34, baseType: !96, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !97, file: !91, line: 35, baseType: !96, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !91, line: 36, baseType: !51, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !93, file: !91, line: 41, baseType: !96, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !93, file: !91, line: 42, baseType: !104, size: 32, align: 32, offset: 128)
!104 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !93, file: !91, line: 43, baseType: !106, size: 64, align: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !51}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !93, file: !91, line: 44, baseType: !110, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !51}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !115, line: 48, baseType: !116)
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !117, line: 241, size: 1728, align: 64, elements: !118)
!117 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!118 = !{!119, !121, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !142, !143, !144, !145, !149, !151, !153, !157, !160, !162, !163, !164, !165, !166, !169, !170}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !116, file: !117, line: 242, baseType: !120, size: 32, align: 32)
!120 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !116, file: !117, line: 247, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !116, file: !117, line: 248, baseType: !122, size: 64, align: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !116, file: !117, line: 249, baseType: !122, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !116, file: !117, line: 250, baseType: !122, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !116, file: !117, line: 251, baseType: !122, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !116, file: !117, line: 252, baseType: !122, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !116, file: !117, line: 253, baseType: !122, size: 64, align: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !116, file: !117, line: 254, baseType: !122, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !116, file: !117, line: 256, baseType: !122, size: 64, align: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !116, file: !117, line: 257, baseType: !122, size: 64, align: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !116, file: !117, line: 258, baseType: !122, size: 64, align: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !116, file: !117, line: 260, baseType: !135, size: 64, align: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !117, line: 156, size: 192, align: 64, elements: !137)
!137 = !{!138, !139, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !136, file: !117, line: 157, baseType: !135, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !136, file: !117, line: 158, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !136, file: !117, line: 162, baseType: !120, size: 32, align: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !116, file: !117, line: 262, baseType: !140, size: 64, align: 64, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !116, file: !117, line: 264, baseType: !120, size: 32, align: 32, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !116, file: !117, line: 268, baseType: !120, size: 32, align: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !116, file: !117, line: 270, baseType: !146, size: 64, align: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !147, line: 131, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!148 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !116, file: !117, line: 274, baseType: !150, size: 16, align: 16, offset: 1024)
!150 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !116, file: !117, line: 275, baseType: !152, size: 8, align: 8, offset: 1040)
!152 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !116, file: !117, line: 276, baseType: !154, size: 8, align: 8, offset: 1048)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8, align: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !116, file: !117, line: 280, baseType: !158, size: 64, align: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !117, line: 150, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !116, file: !117, line: 289, baseType: !161, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !147, line: 132, baseType: !148)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !116, file: !117, line: 297, baseType: !51, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !116, file: !117, line: 298, baseType: !51, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !116, file: !117, line: 299, baseType: !51, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !116, file: !117, line: 300, baseType: !51, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !116, file: !117, line: 302, baseType: !167, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 216, baseType: !57)
!168 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !116, file: !117, line: 303, baseType: !120, size: 32, align: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !116, file: !117, line: 305, baseType: !171, size: 160, align: 8, offset: 1568)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 160, align: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 20)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !62, file: !4, line: 127, baseType: !65, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !62, file: !4, line: 128, baseType: !176, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !62, file: !4, line: 129, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !181, file: !4, line: 103, baseType: !52, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !181, file: !4, line: 104, baseType: !52, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !4, line: 105, baseType: !57, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !181, file: !4, line: 106, baseType: !120, size: 32, align: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !181, file: !4, line: 108, baseType: !188, size: 192, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !66, line: 104, baseType: !71)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !62, file: !4, line: 130, baseType: !104, size: 32, align: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !62, file: !4, line: 131, baseType: !104, size: 32, align: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !62, file: !4, line: 132, baseType: !120, size: 32, align: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !62, file: !4, line: 135, baseType: !120, size: 32, align: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !62, file: !4, line: 136, baseType: !52, size: 64, align: 64, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 146, baseType: !57, size: 64, align: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !62, file: !4, line: 147, baseType: !57, size: 64, align: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !62, file: !4, line: 148, baseType: !197, size: 8, align: 8, offset: 1216)
!197 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !54, file: !4, line: 82, baseType: !199, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!120, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !54, file: !4, line: 83, baseType: !51, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !54, file: !4, line: 84, baseType: !205, size: 128, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !206, line: 31, baseType: !207)
!206 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !208, line: 30, size: 128, align: 64, elements: !209)
!208 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!209 = !{!210, !212}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !207, file: !208, line: 32, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !147, line: 139, baseType: !148)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !207, file: !208, line: 33, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !147, line: 141, baseType: !148)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !54, file: !4, line: 92, baseType: !215, size: 64, align: 32, offset: 448)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !54, file: !4, line: 85, size: 64, align: 32, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !215, file: !4, line: 86, baseType: !120, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !215, file: !4, line: 87, baseType: !120, size: 32, align: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !215, file: !4, line: 91, baseType: !220, size: 64, align: 32)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !4, line: 88, size: 64, align: 32, elements: !221)
!221 = !{!222, !226}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !220, file: !4, line: 89, baseType: !223, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !224, line: 37, baseType: !225)
!224 = !DIFile(filename: "/usr/include/sched.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !147, line: 133, baseType: !120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !220, file: !4, line: 90, baseType: !120, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !54, file: !4, line: 93, baseType: !228, size: 64, align: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !54, file: !4, line: 95, baseType: !230, size: 192, align: 64, offset: 576)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !54, file: !4, line: 95, size: 192, align: 64, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !230, file: !4, line: 96, baseType: !188, size: 192, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !4, line: 97, baseType: !80, size: 128, align: 64)
!234 = !{!235, !237, !239, !240}
!235 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !236, line: 150, type: !90, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!236 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!237 = distinct !DIGlobalVariable(name: "using_ha_suspend", scope: !0, file: !238, line: 71, type: !197, isLocal: false, isDefinition: true, variable: i8* @using_ha_suspend)
!238 = !DIFile(filename: "check_daemon.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!239 = distinct !DIGlobalVariable(name: "check_syslog_ident", scope: !0, file: !238, line: 74, type: !122, isLocal: true, isDefinition: true, variable: i8** @check_syslog_ident)
!240 = distinct !DIGlobalVariable(name: "two_phase_terminate", scope: !0, file: !238, line: 75, type: !197, isLocal: true, isDefinition: true, variable: i8* @two_phase_terminate)
!241 = !{i32 2, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!244 = distinct !DISubprogram(name: "checker_dispatcher_release", scope: !238, file: !238, line: 86, type: !245, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!245 = !DISubroutineType(types: !246)
!246 = !{null}
!247 = !{}
!248 = !DILocation(line: 91, column: 2, scope: !244)
!249 = !DILocation(line: 92, column: 1, scope: !244)
!250 = distinct !DISubprogram(name: "check_validate_config", scope: !238, file: !238, line: 338, type: !245, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!251 = !DILocation(line: 340, column: 2, scope: !250)
!252 = !DILocation(line: 341, column: 1, scope: !250)
!253 = distinct !DISubprogram(name: "start_check", scope: !238, file: !238, line: 234, type: !254, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !90}
!256 = !DILocalVariable(name: "old_checkers_queue", arg: 1, scope: !253, file: !238, line: 234, type: !90)
!257 = !DIExpression()
!258 = !DILocation(line: 234, column: 18, scope: !253)
!259 = !DILocation(line: 236, column: 2, scope: !253)
!260 = !DILocation(line: 239, column: 6, scope: !261)
!261 = distinct !DILexicalBlock(scope: !253, file: !238, line: 239, column: 6)
!262 = !DILocation(line: 239, column: 6, scope: !253)
!263 = !DILocation(line: 240, column: 17, scope: !261)
!264 = !DILocation(line: 240, column: 15, scope: !261)
!265 = !DILocation(line: 240, column: 3, scope: !261)
!266 = !DILocation(line: 241, column: 15, scope: !253)
!267 = !DILocation(line: 241, column: 13, scope: !253)
!268 = !DILocation(line: 242, column: 7, scope: !269)
!269 = distinct !DILexicalBlock(scope: !253, file: !238, line: 242, column: 6)
!270 = !DILocation(line: 242, column: 6, scope: !253)
!271 = !DILocation(line: 243, column: 3, scope: !272)
!272 = distinct !DILexicalBlock(scope: !269, file: !238, line: 242, column: 19)
!273 = !DILocation(line: 244, column: 3, scope: !272)
!274 = !DILocation(line: 247, column: 12, scope: !253)
!275 = !DILocation(line: 247, column: 2, scope: !253)
!276 = !DILocation(line: 249, column: 6, scope: !277)
!277 = distinct !DILexicalBlock(scope: !253, file: !238, line: 249, column: 6)
!278 = !DILocation(line: 249, column: 6, scope: !253)
!279 = !DILocation(line: 250, column: 20, scope: !277)
!280 = !DILocation(line: 250, column: 3, scope: !277)
!281 = !DILocation(line: 257, column: 2, scope: !253)
!282 = !DILocation(line: 260, column: 7, scope: !283)
!283 = distinct !DILexicalBlock(scope: !253, file: !238, line: 260, column: 6)
!284 = !DILocation(line: 260, column: 6, scope: !253)
!285 = !DILocation(line: 261, column: 3, scope: !286)
!286 = distinct !DILexicalBlock(scope: !283, file: !238, line: 260, column: 32)
!287 = !DILocation(line: 262, column: 3, scope: !286)
!288 = !DILocation(line: 270, column: 6, scope: !289)
!289 = distinct !DILexicalBlock(scope: !253, file: !238, line: 270, column: 6)
!290 = !DILocation(line: 270, column: 6, scope: !253)
!291 = !DILocation(line: 271, column: 3, scope: !289)
!292 = !DILocation(line: 274, column: 10, scope: !293)
!293 = distinct !DILexicalBlock(scope: !253, file: !238, line: 274, column: 6)
!294 = !DILocation(line: 274, column: 22, scope: !293)
!295 = !DILocation(line: 274, column: 26, scope: !293)
!296 = !DILocation(line: 274, column: 7, scope: !293)
!297 = !DILocation(line: 274, column: 12, scope: !298)
!298 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 1)
!299 = !DILocation(line: 274, column: 24, scope: !298)
!300 = !DILocation(line: 274, column: 29, scope: !298)
!301 = !DILocation(line: 274, column: 34, scope: !298)
!302 = !DILocation(line: 274, column: 7, scope: !298)
!303 = !DILocation(line: 274, column: 11, scope: !304)
!304 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 2)
!305 = !DILocation(line: 274, column: 23, scope: !304)
!306 = !DILocation(line: 274, column: 28, scope: !304)
!307 = !DILocation(line: 274, column: 33, scope: !304)
!308 = !DILocation(line: 274, column: 10, scope: !304)
!309 = !DILocation(line: 274, column: 14, scope: !310)
!310 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 3)
!311 = !DILocation(line: 274, column: 21, scope: !310)
!312 = !DILocation(line: 274, column: 27, scope: !313)
!313 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 4)
!314 = !DILocation(line: 274, column: 43, scope: !313)
!315 = !DILocation(line: 274, column: 47, scope: !313)
!316 = !DILocation(line: 274, column: 51, scope: !313)
!317 = !DILocation(line: 274, column: 56, scope: !318)
!318 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 5)
!319 = !DILocation(line: 274, column: 72, scope: !318)
!320 = !DILocation(line: 274, column: 77, scope: !318)
!321 = !DILocation(line: 274, column: 82, scope: !318)
!322 = !DILocation(line: 274, column: 51, scope: !318)
!323 = !DILocation(line: 274, column: 55, scope: !324)
!324 = !DILexicalBlockFile(scope: !293, file: !238, discriminator: 6)
!325 = !DILocation(line: 274, column: 71, scope: !324)
!326 = !DILocation(line: 274, column: 76, scope: !324)
!327 = !DILocation(line: 274, column: 81, scope: !324)
!328 = !DILocation(line: 274, column: 56, scope: !324)
!329 = !DILocation(line: 275, column: 6, scope: !293)
!330 = !DILocation(line: 275, column: 19, scope: !293)
!331 = !DILocation(line: 274, column: 6, scope: !332)
!332 = !DILexicalBlockFile(scope: !253, file: !238, discriminator: 7)
!333 = !DILocation(line: 276, column: 3, scope: !334)
!334 = distinct !DILexicalBlock(scope: !293, file: !238, line: 275, column: 25)
!335 = !DILocation(line: 277, column: 3, scope: !334)
!336 = !DILocation(line: 281, column: 20, scope: !253)
!337 = !DILocation(line: 281, column: 33, scope: !253)
!338 = !DILocation(line: 281, column: 47, scope: !253)
!339 = !DILocation(line: 281, column: 60, scope: !253)
!340 = !DILocation(line: 281, column: 2, scope: !253)
!341 = !DILocation(line: 284, column: 6, scope: !342)
!342 = distinct !DILexicalBlock(scope: !253, file: !238, line: 284, column: 6)
!343 = !DILocation(line: 284, column: 23, scope: !342)
!344 = !DILocation(line: 284, column: 26, scope: !345)
!345 = !DILexicalBlockFile(scope: !342, file: !238, discriminator: 1)
!346 = !DILocation(line: 284, column: 6, scope: !345)
!347 = !DILocation(line: 285, column: 7, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !238, line: 285, column: 7)
!349 = distinct !DILexicalBlock(scope: !342, file: !238, line: 284, column: 67)
!350 = !DILocation(line: 285, column: 7, scope: !349)
!351 = !DILocation(line: 286, column: 4, scope: !348)
!352 = !DILocation(line: 288, column: 4, scope: !348)
!353 = !DILocation(line: 289, column: 2, scope: !349)
!354 = !DILocation(line: 290, column: 11, scope: !355)
!355 = distinct !DILexicalBlock(scope: !342, file: !238, line: 290, column: 11)
!356 = !DILocation(line: 290, column: 11, scope: !342)
!357 = !DILocation(line: 291, column: 3, scope: !355)
!358 = !DILocation(line: 294, column: 7, scope: !359)
!359 = distinct !DILexicalBlock(scope: !253, file: !238, line: 294, column: 6)
!360 = !DILocation(line: 294, column: 14, scope: !359)
!361 = !DILocation(line: 294, column: 17, scope: !362)
!362 = !DILexicalBlockFile(scope: !359, file: !238, discriminator: 1)
!363 = !DILocation(line: 294, column: 30, scope: !362)
!364 = !DILocation(line: 294, column: 6, scope: !362)
!365 = !DILocation(line: 295, column: 3, scope: !359)
!366 = !DILocation(line: 303, column: 6, scope: !367)
!367 = distinct !DILexicalBlock(scope: !253, file: !238, line: 303, column: 6)
!368 = !DILocation(line: 303, column: 18, scope: !367)
!369 = !DILocation(line: 303, column: 31, scope: !367)
!370 = !DILocation(line: 303, column: 35, scope: !371)
!371 = !DILexicalBlockFile(scope: !367, file: !238, discriminator: 1)
!372 = !DILocation(line: 303, column: 6, scope: !371)
!373 = !DILocation(line: 304, column: 3, scope: !367)
!374 = !DILocation(line: 307, column: 6, scope: !375)
!375 = distinct !DILexicalBlock(scope: !253, file: !238, line: 307, column: 6)
!376 = !DILocation(line: 307, column: 6, scope: !253)
!377 = !DILocation(line: 308, column: 23, scope: !375)
!378 = !DILocation(line: 308, column: 3, scope: !375)
!379 = !DILocation(line: 311, column: 2, scope: !253)
!380 = !DILocation(line: 314, column: 7, scope: !381)
!381 = distinct !DILexicalBlock(scope: !253, file: !238, line: 314, column: 6)
!382 = !DILocation(line: 314, column: 6, scope: !253)
!383 = !DILocation(line: 315, column: 3, scope: !381)
!384 = !DILocation(line: 318, column: 6, scope: !385)
!385 = distinct !DILexicalBlock(scope: !253, file: !238, line: 318, column: 6)
!386 = !DILocation(line: 318, column: 6, scope: !253)
!387 = !DILocation(line: 319, column: 25, scope: !388)
!388 = distinct !DILexicalBlock(scope: !385, file: !238, line: 318, column: 41)
!389 = !DILocation(line: 319, column: 3, scope: !388)
!390 = !DILocation(line: 320, column: 24, scope: !388)
!391 = !DILocation(line: 320, column: 3, scope: !388)
!392 = !DILocation(line: 321, column: 2, scope: !388)
!393 = !DILocation(line: 324, column: 2, scope: !253)
!394 = !DILocation(line: 329, column: 11, scope: !253)
!395 = !DILocation(line: 329, column: 24, scope: !253)
!396 = !DILocation(line: 331, column: 11, scope: !253)
!397 = !DILocation(line: 331, column: 24, scope: !253)
!398 = !DILocation(line: 334, column: 11, scope: !253)
!399 = !DILocation(line: 334, column: 24, scope: !253)
!400 = !DILocation(line: 334, column: 50, scope: !253)
!401 = !DILocation(line: 334, column: 63, scope: !253)
!402 = !DILocation(line: 327, column: 2, scope: !253)
!403 = !DILocation(line: 335, column: 1, scope: !253)
!404 = !DILocation(line: 335, column: 1, scope: !405)
!405 = !DILexicalBlockFile(scope: !253, file: !238, discriminator: 1)
!406 = distinct !DISubprogram(name: "start_check_child", scope: !238, file: !238, line: 485, type: !407, isLocal: false, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!407 = !DISubroutineType(types: !408)
!408 = !{!120}
!409 = !DILocalVariable(name: "pid", scope: !406, file: !238, line: 488, type: !223)
!410 = !DILocation(line: 488, column: 8, scope: !406)
!411 = !DILocalVariable(name: "syslog_ident", scope: !406, file: !238, line: 489, type: !122)
!412 = !DILocation(line: 489, column: 8, scope: !406)
!413 = !DILocation(line: 492, column: 6, scope: !414)
!414 = distinct !DILexicalBlock(scope: !406, file: !238, line: 492, column: 6)
!415 = !DILocation(line: 492, column: 6, scope: !406)
!416 = !DILocation(line: 493, column: 3, scope: !414)
!417 = !DILocation(line: 495, column: 8, scope: !406)
!418 = !DILocation(line: 495, column: 6, scope: !406)
!419 = !DILocation(line: 497, column: 6, scope: !420)
!420 = distinct !DILexicalBlock(scope: !406, file: !238, line: 497, column: 6)
!421 = !DILocation(line: 497, column: 10, scope: !420)
!422 = !DILocation(line: 497, column: 6, scope: !406)
!423 = !DILocation(line: 499, column: 23, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !238, line: 497, column: 15)
!425 = !DILocation(line: 499, column: 22, scope: !424)
!426 = !DILocation(line: 499, column: 13, scope: !427)
!427 = !DILexicalBlockFile(scope: !424, file: !238, discriminator: 1)
!428 = !DILocation(line: 498, column: 3, scope: !424)
!429 = !DILocation(line: 500, column: 3, scope: !424)
!430 = !DILocation(line: 501, column: 13, scope: !431)
!431 = distinct !DILexicalBlock(scope: !420, file: !238, line: 501, column: 13)
!432 = !DILocation(line: 501, column: 13, scope: !420)
!433 = !DILocation(line: 502, column: 20, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !238, line: 501, column: 18)
!435 = !DILocation(line: 502, column: 18, scope: !434)
!436 = !DILocation(line: 504, column: 13, scope: !434)
!437 = !DILocation(line: 503, column: 3, scope: !434)
!438 = !DILocation(line: 507, column: 20, scope: !434)
!439 = !DILocation(line: 508, column: 6, scope: !434)
!440 = !DILocation(line: 507, column: 3, scope: !434)
!441 = !DILocation(line: 510, column: 3, scope: !434)
!442 = !DILocation(line: 512, column: 2, scope: !406)
!443 = !DILocation(line: 515, column: 2, scope: !406)
!444 = !DILocation(line: 516, column: 2, scope: !406)
!445 = !DILocation(line: 518, column: 12, scope: !406)
!446 = !DILocation(line: 520, column: 2, scope: !406)
!447 = !DILocation(line: 532, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !406, file: !238, line: 532, column: 6)
!449 = !DILocation(line: 532, column: 20, scope: !448)
!450 = !DILocation(line: 534, column: 7, scope: !448)
!451 = !DILocation(line: 534, column: 10, scope: !452)
!452 = !DILexicalBlockFile(scope: !448, file: !238, discriminator: 1)
!453 = !DILocation(line: 534, column: 23, scope: !452)
!454 = !DILocation(line: 536, column: 15, scope: !448)
!455 = !DILocation(line: 537, column: 29, scope: !448)
!456 = !DILocation(line: 537, column: 27, scope: !448)
!457 = !DILocation(line: 532, column: 6, scope: !458)
!458 = !DILexicalBlockFile(scope: !406, file: !238, discriminator: 1)
!459 = !DILocation(line: 538, column: 18, scope: !448)
!460 = !DILocation(line: 538, column: 16, scope: !448)
!461 = !DILocation(line: 538, column: 3, scope: !448)
!462 = !DILocation(line: 540, column: 16, scope: !448)
!463 = !DILocation(line: 543, column: 7, scope: !464)
!464 = distinct !DILexicalBlock(scope: !406, file: !238, line: 543, column: 6)
!465 = !DILocation(line: 543, column: 6, scope: !406)
!466 = !DILocation(line: 544, column: 11, scope: !464)
!467 = !DILocation(line: 544, column: 36, scope: !464)
!468 = !DILocation(line: 544, column: 35, scope: !464)
!469 = !DILocation(line: 544, column: 32, scope: !464)
!470 = !DILocation(line: 545, column: 12, scope: !464)
!471 = !DILocation(line: 545, column: 24, scope: !464)
!472 = !DILocation(line: 545, column: 11, scope: !464)
!473 = !DILocation(line: 545, column: 11, scope: !474)
!474 = !DILexicalBlockFile(scope: !464, file: !238, discriminator: 1)
!475 = !DILocation(line: 545, column: 52, scope: !476)
!476 = !DILexicalBlockFile(scope: !464, file: !238, discriminator: 2)
!477 = !DILocation(line: 545, column: 11, scope: !476)
!478 = !DILocation(line: 545, column: 11, scope: !479)
!479 = !DILexicalBlockFile(scope: !464, file: !238, discriminator: 3)
!480 = !DILocation(line: 544, column: 3, scope: !474)
!481 = !DILocation(line: 547, column: 6, scope: !482)
!482 = distinct !DILexicalBlock(scope: !406, file: !238, line: 547, column: 6)
!483 = !DILocation(line: 547, column: 6, scope: !406)
!484 = !DILocation(line: 548, column: 17, scope: !482)
!485 = !DILocation(line: 551, column: 5, scope: !482)
!486 = !DILocation(line: 551, column: 18, scope: !482)
!487 = !DILocation(line: 555, column: 5, scope: !482)
!488 = !DILocation(line: 555, column: 18, scope: !482)
!489 = !DILocation(line: 548, column: 3, scope: !482)
!490 = !DILocation(line: 561, column: 2, scope: !406)
!491 = !DILocation(line: 564, column: 21, scope: !492)
!492 = distinct !DILexicalBlock(scope: !406, file: !238, line: 564, column: 6)
!493 = !DILocation(line: 564, column: 39, scope: !492)
!494 = !DILocation(line: 564, column: 7, scope: !495)
!495 = !DILexicalBlockFile(scope: !492, file: !238, discriminator: 1)
!496 = !DILocation(line: 564, column: 7, scope: !492)
!497 = !DILocation(line: 564, column: 6, scope: !406)
!498 = !DILocation(line: 565, column: 3, scope: !499)
!499 = distinct !DILexicalBlock(scope: !492, file: !238, line: 564, column: 50)
!500 = !DILocation(line: 566, column: 3, scope: !499)
!501 = !DILocation(line: 570, column: 24, scope: !406)
!502 = !DILocation(line: 570, column: 2, scope: !406)
!503 = !DILocation(line: 571, column: 11, scope: !406)
!504 = !DILocation(line: 571, column: 9, scope: !406)
!505 = !DILocation(line: 577, column: 10, scope: !406)
!506 = !DILocation(line: 581, column: 2, scope: !406)
!507 = !DILocation(line: 585, column: 2, scope: !406)
!508 = !DILocation(line: 596, column: 26, scope: !406)
!509 = !DILocation(line: 596, column: 2, scope: !406)
!510 = !DILocation(line: 599, column: 6, scope: !511)
!511 = distinct !DILexicalBlock(scope: !406, file: !238, line: 599, column: 6)
!512 = !DILocation(line: 599, column: 6, scope: !406)
!513 = !DILocation(line: 600, column: 3, scope: !511)
!514 = !DILocation(line: 602, column: 3, scope: !511)
!515 = !DILocation(line: 609, column: 2, scope: !406)
!516 = !DILocation(line: 610, column: 1, scope: !406)
!517 = distinct !DISubprogram(name: "check_respawn_thread", scope: !238, file: !238, line: 422, type: !518, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!518 = !DISubroutineType(types: !519)
!519 = !{!120, !52}
!520 = !DILocalVariable(name: "thread", arg: 1, scope: !517, file: !238, line: 422, type: !52)
!521 = !DILocation(line: 422, column: 33, scope: !517)
!522 = !DILocalVariable(name: "pid", scope: !517, file: !238, line: 424, type: !223)
!523 = !DILocation(line: 424, column: 8, scope: !517)
!524 = !DILocation(line: 427, column: 10, scope: !517)
!525 = !DILocation(line: 427, column: 19, scope: !517)
!526 = !DILocation(line: 427, column: 21, scope: !517)
!527 = !DILocation(line: 427, column: 23, scope: !517)
!528 = !DILocation(line: 427, column: 6, scope: !517)
!529 = !DILocation(line: 430, column: 6, scope: !530)
!530 = distinct !DILexicalBlock(scope: !517, file: !238, line: 430, column: 6)
!531 = !DILocation(line: 430, column: 14, scope: !530)
!532 = !DILocation(line: 430, column: 19, scope: !530)
!533 = !DILocation(line: 430, column: 6, scope: !517)
!534 = !DILocation(line: 431, column: 20, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !238, line: 430, column: 44)
!536 = !DILocation(line: 432, column: 6, scope: !535)
!537 = !DILocation(line: 431, column: 3, scope: !535)
!538 = !DILocation(line: 433, column: 3, scope: !535)
!539 = !DILocation(line: 437, column: 7, scope: !540)
!540 = distinct !DILexicalBlock(scope: !517, file: !238, line: 437, column: 6)
!541 = !DILocation(line: 437, column: 6, scope: !517)
!542 = !DILocation(line: 438, column: 75, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !238, line: 437, column: 45)
!544 = !DILocation(line: 438, column: 3, scope: !543)
!545 = !DILocation(line: 439, column: 3, scope: !543)
!546 = !DILocation(line: 440, column: 2, scope: !543)
!547 = !DILocation(line: 441, column: 72, scope: !548)
!548 = distinct !DILexicalBlock(scope: !540, file: !238, line: 440, column: 9)
!549 = !DILocation(line: 441, column: 3, scope: !548)
!550 = !DILocation(line: 442, column: 18, scope: !548)
!551 = !DILocation(line: 443, column: 3, scope: !548)
!552 = !DILocation(line: 445, column: 2, scope: !517)
!553 = !DILocation(line: 446, column: 1, scope: !517)
!554 = distinct !DISubprogram(name: "__test_bit", scope: !10, file: !10, line: 47, type: !555, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!555 = !DISubroutineType(types: !556)
!556 = !{!197, !104, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!559 = !DILocalVariable(name: "idx", arg: 1, scope: !554, file: !10, line: 47, type: !104)
!560 = !DILocation(line: 47, column: 39, scope: !554)
!561 = !DILocalVariable(name: "bmap", arg: 2, scope: !554, file: !10, line: 47, type: !557)
!562 = !DILocation(line: 47, column: 65, scope: !554)
!563 = !DILocation(line: 49, column: 19, scope: !554)
!564 = !DILocation(line: 49, column: 18, scope: !554)
!565 = !DILocation(line: 49, column: 24, scope: !554)
!566 = !DILocation(line: 49, column: 12, scope: !554)
!567 = !DILocation(line: 49, column: 68, scope: !554)
!568 = !DILocation(line: 49, column: 67, scope: !554)
!569 = !DILocation(line: 49, column: 73, scope: !554)
!570 = !DILocation(line: 49, column: 63, scope: !554)
!571 = !DILocation(line: 49, column: 56, scope: !554)
!572 = !DILocation(line: 49, column: 10, scope: !554)
!573 = !DILocation(line: 49, column: 9, scope: !554)
!574 = !DILocation(line: 49, column: 2, scope: !554)
!575 = distinct !DISubprogram(name: "check_signal_init", scope: !238, file: !238, line: 412, type: !245, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!576 = !DILocation(line: 414, column: 2, scope: !575)
!577 = !DILocation(line: 415, column: 2, scope: !575)
!578 = !DILocation(line: 416, column: 2, scope: !575)
!579 = !DILocation(line: 417, column: 2, scope: !575)
!580 = !DILocation(line: 418, column: 1, scope: !575)
!581 = distinct !DISubprogram(name: "checker_terminate_phase2", scope: !238, file: !238, line: 97, type: !407, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !247)
!582 = !DILocalVariable(name: "usage", scope: !581, file: !238, line: 99, type: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", file: !45, line: 187, size: 1152, align: 64, elements: !584)
!584 = !{!585, !586, !587, !593, !598, !603, !608, !613, !618, !623, !628, !633, !638, !643, !648, !653}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !583, file: !45, line: 190, baseType: !207, size: 128, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !583, file: !45, line: 192, baseType: !207, size: 128, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 194, baseType: !588, size: 64, align: 64, offset: 256)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 194, size: 64, align: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !588, file: !45, line: 196, baseType: !148, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_maxrss_word", scope: !588, file: !45, line: 197, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !147, line: 175, baseType: !148)
!593 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 202, baseType: !594, size: 64, align: 64, offset: 320)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 202, size: 64, align: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !594, file: !45, line: 204, baseType: !148, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_ixrss_word", scope: !594, file: !45, line: 205, baseType: !592, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 208, baseType: !599, size: 64, align: 64, offset: 384)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 208, size: 64, align: 64, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !599, file: !45, line: 210, baseType: !148, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_idrss_word", scope: !599, file: !45, line: 211, baseType: !592, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 214, baseType: !604, size: 64, align: 64, offset: 448)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 214, size: 64, align: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !604, file: !45, line: 216, baseType: !148, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_isrss_word", scope: !604, file: !45, line: 217, baseType: !592, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 221, baseType: !609, size: 64, align: 64, offset: 512)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 221, size: 64, align: 64, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !609, file: !45, line: 223, baseType: !148, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_minflt_word", scope: !609, file: !45, line: 224, baseType: !592, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 227, baseType: !614, size: 64, align: 64, offset: 576)
!614 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 227, size: 64, align: 64, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !614, file: !45, line: 229, baseType: !148, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__ru_majflt_word", scope: !614, file: !45, line: 230, baseType: !592, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, scope: !583, file: !45, line: 233, baseType: !619, size: 64, align: 64, offset: 640)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !583, file: !45, line: 233, size: 64, align: 64, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !619, file: !45, line: 235, baseType: !148, size: 64, align: 64)
