; ModuleID = './[inter]keepalived--check--ipwrapper.o.i'
source_filename = "./[inter]keepalived--check--ipwrapper.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._check_data = type { i8, %struct._ssl_data*, %struct._list*, %struct._list* }
%struct._ssl_data = type { i32, i32, %struct.ssl_ctx_st*, %struct.ssl_method_st*, i8*, i8*, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, globals: !82)
!1 = !DIFile(filename: "[inter]keepalived--check--ipwrapper.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 57, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30, !31}
!27 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!28 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!29 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!30 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!31 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!32 = !{!33, !34, !58}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !36, line: 239, size: 128, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!37 = !{!38, !42, !46, !53}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !35, file: !36, line: 241, baseType: !39, size: 16, align: 16)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !40, line: 28, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!41 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !35, file: !36, line: 242, baseType: !43, size: 16, align: 16, offset: 16)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !36, line: 119, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !45, line: 49, baseType: !41)
!45 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !35, file: !36, line: 243, baseType: !47, size: 32, align: 32, offset: 32)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !36, line: 31, size: 32, align: 32, elements: !48)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !47, file: !36, line: 33, baseType: !50, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !36, line: 30, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !45, line: 51, baseType: !52)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !35, file: !36, line: 246, baseType: !54, size: 64, align: 8, offset: 64)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, align: 8, elements: !56)
!55 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!56 = !{!57}
!57 = !DISubrange(count: 8)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !36, line: 254, size: 224, align: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !81}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !59, file: !36, line: 256, baseType: !39, size: 16, align: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !59, file: !36, line: 257, baseType: !43, size: 16, align: 16, offset: 16)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !59, file: !36, line: 258, baseType: !51, size: 32, align: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !59, file: !36, line: 259, baseType: !65, size: 128, align: 32, offset: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !36, line: 211, size: 128, align: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !65, file: !36, line: 220, baseType: !68, size: 128, align: 32)
!68 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !65, file: !36, line: 213, size: 128, align: 32, elements: !69)
!69 = !{!70, !75, !77}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !68, file: !36, line: 215, baseType: !71, size: 128, align: 8)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, align: 8, elements: !73)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 48, baseType: !55)
!73 = !{!74}
!74 = !DISubrange(count: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !68, file: !36, line: 217, baseType: !76, size: 128, align: 16)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 128, align: 16, elements: !56)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !68, file: !36, line: 218, baseType: !78, size: 128, align: 32)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, align: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 4)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !59, file: !36, line: 260, baseType: !51, size: 32, align: 32, offset: 192)
!82 = !{!83}
!83 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !84, line: 150, type: !85, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!84 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !86, line: 31, baseType: !87)
!86 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !86, line: 39, size: 320, align: 64, elements: !89)
!89 = !{!90, !97, !98, !99, !103}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !88, file: !86, line: 40, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !86, line: 33, size: 192, align: 64, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !86, line: 34, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !92, file: !86, line: 35, baseType: !91, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !86, line: 36, baseType: !33, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !88, file: !86, line: 41, baseType: !91, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !88, file: !86, line: 42, baseType: !52, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !88, file: !86, line: 43, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !33}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !88, file: !86, line: 44, baseType: !104, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !33}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !109, line: 48, baseType: !110)
!109 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !111, line: 241, size: 1728, align: 64, elements: !112)
!111 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!112 = !{!113, !115, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !136, !137, !138, !139, !143, !144, !146, !150, !153, !155, !156, !157, !158, !159, !163, !164}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !110, file: !111, line: 242, baseType: !114, size: 32, align: 32)
!114 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !110, file: !111, line: 247, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !110, file: !111, line: 248, baseType: !116, size: 64, align: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !110, file: !111, line: 249, baseType: !116, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !110, file: !111, line: 250, baseType: !116, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !110, file: !111, line: 251, baseType: !116, size: 64, align: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !110, file: !111, line: 252, baseType: !116, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !110, file: !111, line: 253, baseType: !116, size: 64, align: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !110, file: !111, line: 254, baseType: !116, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !110, file: !111, line: 256, baseType: !116, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !110, file: !111, line: 257, baseType: !116, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !110, file: !111, line: 258, baseType: !116, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !110, file: !111, line: 260, baseType: !129, size: 64, align: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !111, line: 156, size: 192, align: 64, elements: !131)
!131 = !{!132, !133, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !130, file: !111, line: 157, baseType: !129, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !130, file: !111, line: 158, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !130, file: !111, line: 162, baseType: !114, size: 32, align: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !110, file: !111, line: 262, baseType: !134, size: 64, align: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !110, file: !111, line: 264, baseType: !114, size: 32, align: 32, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !110, file: !111, line: 268, baseType: !114, size: 32, align: 32, offset: 928)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !110, file: !111, line: 270, baseType: !140, size: 64, align: 64, offset: 960)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 131, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!142 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !110, file: !111, line: 274, baseType: !41, size: 16, align: 16, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !110, file: !111, line: 275, baseType: !145, size: 8, align: 8, offset: 1040)
!145 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !110, file: !111, line: 276, baseType: !147, size: 8, align: 8, offset: 1048)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 8, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !110, file: !111, line: 280, baseType: !151, size: 64, align: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !111, line: 150, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !110, file: !111, line: 289, baseType: !154, size: 64, align: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 132, baseType: !142)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !110, file: !111, line: 297, baseType: !33, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !110, file: !111, line: 298, baseType: !33, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !110, file: !111, line: 299, baseType: !33, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !110, file: !111, line: 300, baseType: !33, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !110, file: !111, line: 302, baseType: !160, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 216, baseType: !162)
!161 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!162 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !110, file: !111, line: 303, baseType: !114, size: 32, align: 32, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !110, file: !111, line: 305, baseType: !165, size: 160, align: 8, offset: 1568)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 160, align: 8, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 20)
!168 = !{i32 2, !"Dwarf Version", i32 4}
!169 = !{i32 2, !"Debug Info Version", i32 3}
!170 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!171 = distinct !DISubprogram(name: "clear_services", scope: !172, file: !172, line: 284, type: !173, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!172 = !DIFile(filename: "ipwrapper.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !{}
!176 = !DILocalVariable(name: "e", scope: !171, file: !172, line: 286, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !86, line: 30, baseType: !91)
!178 = !DIExpression()
!179 = !DILocation(line: 286, column: 10, scope: !171)
!180 = !DILocalVariable(name: "vs", scope: !171, file: !172, line: 287, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !183, line: 180, baseType: !184)
!183 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !183, line: 131, size: 2560, align: 64, elements: !185)
!185 = !{!186, !187, !195, !205, !206, !249, !250, !251, !252, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !184, file: !183, line: 132, baseType: !116, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !184, file: !183, line: 133, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !183, line: 128, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !183, line: 124, size: 192, align: 64, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !190, file: !183, line: 125, baseType: !116, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !190, file: !183, line: 126, baseType: !85, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !190, file: !183, line: 127, baseType: !85, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !184, file: !183, line: 134, baseType: !196, size: 1024, align: 64, offset: 128)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !197, line: 166, size: 1024, align: 64, elements: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!198 = !{!199, !200, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !196, file: !197, line: 168, baseType: !39, size: 16, align: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !196, file: !197, line: 169, baseType: !201, size: 944, align: 8, offset: 16)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 944, align: 8, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 118)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !196, file: !197, line: 170, baseType: !162, size: 64, align: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !184, file: !183, line: 135, baseType: !51, size: 32, align: 32, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !184, file: !183, line: 136, baseType: !207, size: 64, align: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !183, line: 102, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !183, line: 62, size: 1920, align: 64, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !236, !237, !238, !239, !240, !241, !242, !243, !245, !246, !247, !248}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !209, file: !183, line: 63, baseType: !196, size: 1024, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !209, file: !183, line: 64, baseType: !114, size: 32, align: 32, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !209, file: !183, line: 65, baseType: !114, size: 32, align: 32, offset: 1056)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !209, file: !183, line: 66, baseType: !114, size: 32, align: 32, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !209, file: !183, line: 68, baseType: !52, size: 32, align: 32, offset: 1120)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !209, file: !183, line: 69, baseType: !51, size: 32, align: 32, offset: 1152)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !209, file: !183, line: 70, baseType: !51, size: 32, align: 32, offset: 1184)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !209, file: !183, line: 71, baseType: !114, size: 32, align: 32, offset: 1216)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !209, file: !183, line: 74, baseType: !220, size: 64, align: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !222, line: 65, baseType: !223)
!222 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !222, line: 59, size: 192, align: 64, elements: !224)
!224 = !{!225, !227, !228, !229, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !223, file: !222, line: 60, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !223, file: !222, line: 61, baseType: !114, size: 32, align: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !222, line: 62, baseType: !114, size: 32, align: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !223, file: !222, line: 63, baseType: !230, size: 32, align: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !231, line: 240, baseType: !232)
!231 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !141, line: 125, baseType: !52)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !223, file: !222, line: 64, baseType: !234, size: 32, align: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !231, line: 235, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !141, line: 126, baseType: !52)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !209, file: !183, line: 75, baseType: !220, size: 64, align: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !209, file: !183, line: 76, baseType: !114, size: 32, align: 32, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !209, file: !183, line: 77, baseType: !162, size: 64, align: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !209, file: !183, line: 78, baseType: !162, size: 64, align: 64, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !209, file: !183, line: 79, baseType: !52, size: 32, align: 32, offset: 1600)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !209, file: !183, line: 80, baseType: !162, size: 64, align: 64, offset: 1664)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !209, file: !183, line: 81, baseType: !114, size: 32, align: 32, offset: 1728)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !209, file: !183, line: 83, baseType: !244, size: 8, align: 8, offset: 1760)
!244 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !209, file: !183, line: 84, baseType: !52, size: 32, align: 32, offset: 1792)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !209, file: !183, line: 85, baseType: !244, size: 8, align: 8, offset: 1824)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !209, file: !183, line: 86, baseType: !244, size: 8, align: 8, offset: 1832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !209, file: !183, line: 87, baseType: !116, size: 64, align: 64, offset: 1856)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !184, file: !183, line: 137, baseType: !44, size: 16, align: 16, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !184, file: !183, line: 138, baseType: !44, size: 16, align: 16, offset: 1296)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !184, file: !183, line: 139, baseType: !244, size: 8, align: 8, offset: 1312)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !184, file: !183, line: 140, baseType: !114, size: 32, align: 32, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !184, file: !183, line: 142, baseType: !254, size: 128, align: 8, offset: 1376)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, align: 8, elements: !73)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !184, file: !183, line: 143, baseType: !51, size: 32, align: 32, offset: 1504)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !184, file: !183, line: 144, baseType: !51, size: 32, align: 32, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !184, file: !183, line: 146, baseType: !254, size: 128, align: 8, offset: 1568)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !184, file: !183, line: 148, baseType: !52, size: 32, align: 32, offset: 1696)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !184, file: !183, line: 149, baseType: !51, size: 32, align: 32, offset: 1728)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !184, file: !183, line: 151, baseType: !116, size: 64, align: 64, offset: 1792)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !184, file: !183, line: 153, baseType: !114, size: 32, align: 32, offset: 1856)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !184, file: !183, line: 154, baseType: !85, size: 64, align: 64, offset: 1920)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !184, file: !183, line: 155, baseType: !114, size: 32, align: 32, offset: 1984)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !184, file: !183, line: 156, baseType: !244, size: 8, align: 8, offset: 2016)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !184, file: !183, line: 157, baseType: !244, size: 8, align: 8, offset: 2024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !184, file: !183, line: 158, baseType: !244, size: 8, align: 8, offset: 2032)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !184, file: !183, line: 160, baseType: !162, size: 64, align: 64, offset: 2048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !184, file: !183, line: 161, baseType: !162, size: 64, align: 64, offset: 2112)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !184, file: !183, line: 162, baseType: !52, size: 32, align: 32, offset: 2176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !184, file: !183, line: 163, baseType: !162, size: 64, align: 64, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !184, file: !183, line: 164, baseType: !220, size: 64, align: 64, offset: 2304)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !184, file: !183, line: 165, baseType: !220, size: 64, align: 64, offset: 2368)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !184, file: !183, line: 166, baseType: !52, size: 32, align: 32, offset: 2432)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !184, file: !183, line: 167, baseType: !52, size: 32, align: 32, offset: 2464)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !184, file: !183, line: 168, baseType: !114, size: 32, align: 32, offset: 2496)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !184, file: !183, line: 169, baseType: !244, size: 8, align: 8, offset: 2528)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !184, file: !183, line: 170, baseType: !244, size: 8, align: 8, offset: 2536)
!278 = !DILocation(line: 287, column: 20, scope: !171)
!279 = !DILocation(line: 289, column: 7, scope: !280)
!280 = distinct !DILexicalBlock(scope: !171, file: !172, line: 289, column: 6)
!281 = !DILocation(line: 289, column: 18, scope: !280)
!282 = !DILocation(line: 289, column: 22, scope: !283)
!283 = !DILexicalBlockFile(scope: !280, file: !172, discriminator: 1)
!284 = !DILocation(line: 289, column: 34, scope: !283)
!285 = !DILocation(line: 289, column: 6, scope: !283)
!286 = !DILocation(line: 290, column: 3, scope: !280)
!287 = !DILocation(line: 292, column: 15, scope: !288)
!288 = distinct !DILexicalBlock(scope: !171, file: !172, line: 292, column: 2)
!289 = !DILocation(line: 292, column: 27, scope: !288)
!290 = !DILocation(line: 292, column: 14, scope: !288)
!291 = !DILocation(line: 292, column: 36, scope: !292)
!292 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 1)
!293 = !DILocation(line: 292, column: 48, scope: !292)
!294 = !DILocation(line: 292, column: 35, scope: !292)
!295 = !DILocation(line: 292, column: 34, scope: !292)
!296 = !DILocation(line: 292, column: 34, scope: !297)
!297 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 2)
!298 = !DILocation(line: 292, column: 4, scope: !299)
!299 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 3)
!300 = !DILocation(line: 292, column: 16, scope: !299)
!301 = !DILocation(line: 292, column: 21, scope: !299)
!302 = !DILocation(line: 292, column: 34, scope: !299)
!303 = !DILocation(line: 292, column: 34, scope: !304)
!304 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 4)
!305 = !DILocation(line: 292, column: 14, scope: !304)
!306 = !DILocation(line: 292, column: 14, scope: !307)
!307 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 5)
!308 = !DILocation(line: 292, column: 14, scope: !309)
!309 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 6)
!310 = !DILocation(line: 292, column: 11, scope: !309)
!311 = !DILocation(line: 292, column: 7, scope: !309)
!312 = !DILocation(line: 292, column: 5, scope: !313)
!313 = !DILexicalBlockFile(scope: !314, file: !172, discriminator: 7)
!314 = distinct !DILexicalBlock(scope: !288, file: !172, line: 292, column: 2)
!315 = !DILocation(line: 292, column: 4, scope: !313)
!316 = !DILocation(line: 292, column: 8, scope: !313)
!317 = !DILocation(line: 292, column: 21, scope: !318)
!318 = !DILexicalBlockFile(scope: !314, file: !172, discriminator: 8)
!319 = !DILocation(line: 292, column: 25, scope: !318)
!320 = !DILocation(line: 292, column: 19, scope: !318)
!321 = !DILocation(line: 292, column: 17, scope: !318)
!322 = !DILocation(line: 292, column: 2, scope: !323)
!323 = !DILexicalBlockFile(scope: !288, file: !172, discriminator: 9)
!324 = !DILocation(line: 296, column: 20, scope: !325)
!325 = distinct !DILexicalBlock(scope: !314, file: !172, line: 292, column: 55)
!326 = !DILocation(line: 296, column: 3, scope: !325)
!327 = !DILocation(line: 297, column: 2, scope: !325)
!328 = !DILocation(line: 292, column: 44, scope: !329)
!329 = !DILexicalBlockFile(scope: !314, file: !172, discriminator: 10)
!330 = !DILocation(line: 292, column: 48, scope: !329)
!331 = !DILocation(line: 292, column: 41, scope: !329)
!332 = !DILocation(line: 292, column: 2, scope: !329)
!333 = distinct !{!333, !334}
!334 = !DILocation(line: 292, column: 2, scope: !171)
!335 = !DILocation(line: 298, column: 1, scope: !171)
!336 = distinct !DISubprogram(name: "clear_service_vs", scope: !172, file: !172, line: 254, type: !337, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !181, !244}
!339 = !DILocalVariable(name: "vs", arg: 1, scope: !336, file: !172, line: 254, type: !181)
!340 = !DILocation(line: 254, column: 37, scope: !336)
!341 = !DILocalVariable(name: "stopping", arg: 2, scope: !336, file: !172, line: 254, type: !244)
!342 = !DILocation(line: 254, column: 45, scope: !336)
!343 = !DILocalVariable(name: "sav_inhibit", scope: !336, file: !172, line: 256, type: !244)
!344 = !DILocation(line: 256, column: 6, scope: !336)
!345 = !DILocation(line: 259, column: 6, scope: !346)
!346 = distinct !DILexicalBlock(scope: !336, file: !172, line: 259, column: 6)
!347 = !DILocation(line: 259, column: 10, scope: !346)
!348 = !DILocation(line: 259, column: 16, scope: !346)
!349 = !DILocation(line: 259, column: 19, scope: !350)
!350 = !DILexicalBlockFile(scope: !346, file: !172, discriminator: 1)
!351 = !DILocation(line: 259, column: 23, scope: !350)
!352 = !DILocation(line: 259, column: 30, scope: !350)
!353 = !DILocation(line: 259, column: 6, scope: !350)
!354 = !DILocation(line: 261, column: 17, scope: !355)
!355 = distinct !DILexicalBlock(scope: !346, file: !172, line: 259, column: 35)
!356 = !DILocation(line: 261, column: 21, scope: !355)
!357 = !DILocation(line: 261, column: 28, scope: !355)
!358 = !DILocation(line: 261, column: 15, scope: !355)
!359 = !DILocation(line: 262, column: 3, scope: !355)
!360 = !DILocation(line: 262, column: 7, scope: !355)
!361 = !DILocation(line: 262, column: 14, scope: !355)
!362 = !DILocation(line: 262, column: 22, scope: !355)
!363 = !DILocation(line: 264, column: 29, scope: !355)
!364 = !DILocation(line: 264, column: 33, scope: !355)
!365 = !DILocation(line: 264, column: 37, scope: !355)
!366 = !DILocation(line: 264, column: 3, scope: !355)
!367 = !DILocation(line: 266, column: 24, scope: !355)
!368 = !DILocation(line: 266, column: 3, scope: !355)
!369 = !DILocation(line: 266, column: 7, scope: !355)
!370 = !DILocation(line: 266, column: 14, scope: !355)
!371 = !DILocation(line: 266, column: 22, scope: !355)
!372 = !DILocation(line: 268, column: 5, scope: !355)
!373 = !DILocation(line: 268, column: 9, scope: !355)
!374 = !DILocation(line: 268, column: 17, scope: !355)
!375 = !DILocation(line: 268, column: 23, scope: !355)
!376 = !DILocation(line: 269, column: 2, scope: !355)
!377 = !DILocation(line: 273, column: 19, scope: !336)
!378 = !DILocation(line: 273, column: 23, scope: !336)
!379 = !DILocation(line: 273, column: 27, scope: !336)
!380 = !DILocation(line: 273, column: 31, scope: !336)
!381 = !DILocation(line: 273, column: 2, scope: !336)
!382 = !DILocation(line: 277, column: 23, scope: !336)
!383 = !DILocation(line: 277, column: 2, scope: !336)
!384 = !DILocation(line: 279, column: 4, scope: !336)
!385 = !DILocation(line: 279, column: 9, scope: !336)
!386 = !DILocation(line: 279, column: 15, scope: !336)
!387 = !DILocation(line: 280, column: 1, scope: !336)
!388 = distinct !DISubprogram(name: "set_quorum_states", scope: !172, file: !172, line: 387, type: !173, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!389 = !DILocalVariable(name: "vs", scope: !388, file: !172, line: 389, type: !181)
!390 = !DILocation(line: 389, column: 20, scope: !388)
!391 = !DILocalVariable(name: "e", scope: !388, file: !172, line: 390, type: !177)
!392 = !DILocation(line: 390, column: 10, scope: !388)
!393 = !DILocation(line: 392, column: 8, scope: !394)
!394 = distinct !DILexicalBlock(scope: !388, file: !172, line: 392, column: 6)
!395 = !DILocation(line: 392, column: 20, scope: !394)
!396 = !DILocation(line: 392, column: 24, scope: !394)
!397 = !DILocation(line: 392, column: 5, scope: !394)
!398 = !DILocation(line: 392, column: 10, scope: !399)
!399 = !DILexicalBlockFile(scope: !394, file: !172, discriminator: 1)
!400 = !DILocation(line: 392, column: 22, scope: !399)
!401 = !DILocation(line: 392, column: 27, scope: !399)
!402 = !DILocation(line: 392, column: 32, scope: !399)
!403 = !DILocation(line: 392, column: 5, scope: !399)
!404 = !DILocation(line: 392, column: 9, scope: !405)
!405 = !DILexicalBlockFile(scope: !394, file: !172, discriminator: 2)
!406 = !DILocation(line: 392, column: 21, scope: !405)
!407 = !DILocation(line: 392, column: 26, scope: !405)
!408 = !DILocation(line: 392, column: 31, scope: !405)
!409 = !DILocation(line: 392, column: 6, scope: !405)
!410 = !DILocation(line: 393, column: 3, scope: !394)
!411 = !DILocation(line: 395, column: 14, scope: !412)
!412 = distinct !DILexicalBlock(scope: !388, file: !172, line: 395, column: 2)
!413 = !DILocation(line: 395, column: 26, scope: !412)
!414 = !DILocation(line: 395, column: 13, scope: !412)
!415 = !DILocation(line: 395, column: 12, scope: !412)
!416 = !DILocation(line: 395, column: 12, scope: !417)
!417 = !DILexicalBlockFile(scope: !412, file: !172, discriminator: 1)
!418 = !DILocation(line: 395, column: 13, scope: !419)
!419 = !DILexicalBlockFile(scope: !412, file: !172, discriminator: 2)
!420 = !DILocation(line: 395, column: 25, scope: !419)
!421 = !DILocation(line: 395, column: 30, scope: !419)
!422 = !DILocation(line: 395, column: 12, scope: !419)
!423 = !DILocation(line: 395, column: 12, scope: !424)
!424 = !DILexicalBlockFile(scope: !412, file: !172, discriminator: 3)
!425 = !DILocation(line: 395, column: 9, scope: !424)
!426 = !DILocation(line: 395, column: 7, scope: !424)
!427 = !DILocation(line: 395, column: 37, scope: !428)
!428 = !DILexicalBlockFile(scope: !429, file: !172, discriminator: 4)
!429 = distinct !DILexicalBlock(scope: !412, file: !172, line: 395, column: 2)
!430 = !DILocation(line: 395, column: 2, scope: !428)
!431 = !DILocation(line: 396, column: 10, scope: !432)
!432 = distinct !DILexicalBlock(scope: !429, file: !172, line: 395, column: 59)
!433 = !DILocation(line: 396, column: 14, scope: !432)
!434 = !DILocation(line: 396, column: 8, scope: !432)
!435 = !DILocation(line: 396, column: 6, scope: !432)
!436 = !DILocation(line: 398, column: 49, scope: !432)
!437 = !DILocation(line: 398, column: 26, scope: !432)
!438 = !DILocation(line: 398, column: 56, scope: !432)
!439 = !DILocation(line: 398, column: 60, scope: !432)
!440 = !DILocation(line: 398, column: 69, scope: !432)
!441 = !DILocation(line: 398, column: 73, scope: !432)
!442 = !DILocation(line: 398, column: 67, scope: !432)
!443 = !DILocation(line: 398, column: 53, scope: !432)
!444 = !DILocation(line: 398, column: 3, scope: !432)
!445 = !DILocation(line: 398, column: 7, scope: !432)
!446 = !DILocation(line: 398, column: 23, scope: !432)
!447 = !DILocation(line: 399, column: 2, scope: !432)
!448 = !DILocation(line: 395, column: 48, scope: !449)
!449 = !DILexicalBlockFile(scope: !429, file: !172, discriminator: 5)
!450 = !DILocation(line: 395, column: 52, scope: !449)
!451 = !DILocation(line: 395, column: 45, scope: !449)
!452 = !DILocation(line: 395, column: 2, scope: !449)
!453 = distinct !{!453, !454}
!454 = !DILocation(line: 395, column: 2, scope: !388)
!455 = !DILocation(line: 400, column: 1, scope: !388)
!456 = distinct !DISubprogram(name: "weigh_live_realservers", scope: !172, file: !172, line: 41, type: !457, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!457 = !DISubroutineType(types: !458)
!458 = !{!162, !181}
!459 = !DILocalVariable(name: "vs", arg: 1, scope: !456, file: !172, line: 41, type: !181)
!460 = !DILocation(line: 41, column: 43, scope: !456)
!461 = !DILocalVariable(name: "e", scope: !456, file: !172, line: 43, type: !177)
!462 = !DILocation(line: 43, column: 10, scope: !456)
!463 = !DILocalVariable(name: "svr", scope: !456, file: !172, line: 44, type: !207)
!464 = !DILocation(line: 44, column: 17, scope: !456)
!465 = !DILocalVariable(name: "count", scope: !456, file: !172, line: 45, type: !142)
!466 = !DILocation(line: 45, column: 7, scope: !456)
!467 = !DILocation(line: 47, column: 14, scope: !468)
!468 = distinct !DILexicalBlock(scope: !456, file: !172, line: 47, column: 2)
!469 = !DILocation(line: 47, column: 18, scope: !468)
!470 = !DILocation(line: 47, column: 13, scope: !468)
!471 = !DILocation(line: 47, column: 12, scope: !468)
!472 = !DILocation(line: 47, column: 12, scope: !473)
!473 = !DILexicalBlockFile(scope: !468, file: !172, discriminator: 1)
!474 = !DILocation(line: 47, column: 13, scope: !475)
!475 = !DILexicalBlockFile(scope: !468, file: !172, discriminator: 2)
!476 = !DILocation(line: 47, column: 17, scope: !475)
!477 = !DILocation(line: 47, column: 22, scope: !475)
!478 = !DILocation(line: 47, column: 12, scope: !475)
!479 = !DILocation(line: 47, column: 12, scope: !480)
!480 = !DILexicalBlockFile(scope: !468, file: !172, discriminator: 3)
!481 = !DILocation(line: 47, column: 9, scope: !480)
!482 = !DILocation(line: 47, column: 7, scope: !480)
!483 = !DILocation(line: 47, column: 29, scope: !484)
!484 = !DILexicalBlockFile(scope: !485, file: !172, discriminator: 4)
!485 = distinct !DILexicalBlock(scope: !468, file: !172, line: 47, column: 2)
!486 = !DILocation(line: 47, column: 2, scope: !484)
!487 = !DILocation(line: 48, column: 11, scope: !488)
!488 = distinct !DILexicalBlock(scope: !485, file: !172, line: 47, column: 51)
!489 = !DILocation(line: 48, column: 15, scope: !488)
!490 = !DILocation(line: 48, column: 9, scope: !488)
!491 = !DILocation(line: 48, column: 7, scope: !488)
!492 = !DILocation(line: 49, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !488, file: !172, line: 49, column: 7)
!494 = !DILocation(line: 49, column: 15, scope: !493)
!495 = !DILocation(line: 49, column: 7, scope: !488)
!496 = !DILocation(line: 50, column: 13, scope: !493)
!497 = !DILocation(line: 50, column: 18, scope: !493)
!498 = !DILocation(line: 50, column: 10, scope: !493)
!499 = !DILocation(line: 50, column: 4, scope: !493)
!500 = !DILocation(line: 51, column: 2, scope: !488)
!501 = !DILocation(line: 47, column: 40, scope: !502)
!502 = !DILexicalBlockFile(scope: !485, file: !172, discriminator: 5)
!503 = !DILocation(line: 47, column: 44, scope: !502)
!504 = !DILocation(line: 47, column: 37, scope: !502)
!505 = !DILocation(line: 47, column: 2, scope: !502)
!506 = distinct !{!506, !507}
!507 = !DILocation(line: 47, column: 2, scope: !456)
!508 = !DILocation(line: 52, column: 9, scope: !456)
!509 = !DILocation(line: 52, column: 2, scope: !456)
!510 = distinct !DISubprogram(name: "init_services", scope: !172, file: !172, line: 551, type: !511, isLocal: false, isDefinition: true, scopeLine: 552, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!511 = !DISubroutineType(types: !512)
!512 = !{!244}
!513 = !DILocalVariable(name: "e", scope: !510, file: !172, line: 553, type: !177)
!514 = !DILocation(line: 553, column: 10, scope: !510)
!515 = !DILocalVariable(name: "vs", scope: !510, file: !172, line: 554, type: !181)
!516 = !DILocation(line: 554, column: 20, scope: !510)
!517 = !DILocation(line: 556, column: 15, scope: !518)
!518 = distinct !DILexicalBlock(scope: !510, file: !172, line: 556, column: 2)
!519 = !DILocation(line: 556, column: 27, scope: !518)
!520 = !DILocation(line: 556, column: 14, scope: !518)
!521 = !DILocation(line: 556, column: 36, scope: !522)
!522 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 1)
!523 = !DILocation(line: 556, column: 48, scope: !522)
!524 = !DILocation(line: 556, column: 35, scope: !522)
!525 = !DILocation(line: 556, column: 34, scope: !522)
!526 = !DILocation(line: 556, column: 34, scope: !527)
!527 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 2)
!528 = !DILocation(line: 556, column: 4, scope: !529)
!529 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 3)
!530 = !DILocation(line: 556, column: 16, scope: !529)
!531 = !DILocation(line: 556, column: 21, scope: !529)
!532 = !DILocation(line: 556, column: 34, scope: !529)
!533 = !DILocation(line: 556, column: 34, scope: !534)
!534 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 4)
!535 = !DILocation(line: 556, column: 14, scope: !534)
!536 = !DILocation(line: 556, column: 14, scope: !537)
!537 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 5)
!538 = !DILocation(line: 556, column: 14, scope: !539)
!539 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 6)
!540 = !DILocation(line: 556, column: 11, scope: !539)
!541 = !DILocation(line: 556, column: 7, scope: !539)
!542 = !DILocation(line: 556, column: 5, scope: !543)
!543 = !DILexicalBlockFile(scope: !544, file: !172, discriminator: 7)
!544 = distinct !DILexicalBlock(scope: !518, file: !172, line: 556, column: 2)
!545 = !DILocation(line: 556, column: 4, scope: !543)
!546 = !DILocation(line: 556, column: 8, scope: !543)
!547 = !DILocation(line: 556, column: 21, scope: !548)
!548 = !DILexicalBlockFile(scope: !544, file: !172, discriminator: 8)
!549 = !DILocation(line: 556, column: 25, scope: !548)
!550 = !DILocation(line: 556, column: 19, scope: !548)
!551 = !DILocation(line: 556, column: 17, scope: !548)
!552 = !DILocation(line: 556, column: 2, scope: !553)
!553 = !DILexicalBlockFile(scope: !518, file: !172, discriminator: 9)
!554 = !DILocation(line: 557, column: 24, scope: !555)
!555 = distinct !DILexicalBlock(scope: !556, file: !172, line: 557, column: 7)
!556 = distinct !DILexicalBlock(scope: !544, file: !172, line: 556, column: 55)
!557 = !DILocation(line: 557, column: 8, scope: !555)
!558 = !DILocation(line: 557, column: 7, scope: !556)
!559 = !DILocation(line: 558, column: 4, scope: !555)
!560 = !DILocation(line: 559, column: 2, scope: !556)
!561 = !DILocation(line: 556, column: 44, scope: !562)
!562 = !DILexicalBlockFile(scope: !544, file: !172, discriminator: 10)
!563 = !DILocation(line: 556, column: 48, scope: !562)
!564 = !DILocation(line: 556, column: 41, scope: !562)
!565 = !DILocation(line: 556, column: 2, scope: !562)
!566 = distinct !{!566, !567}
!567 = !DILocation(line: 556, column: 2, scope: !510)
!568 = !DILocation(line: 561, column: 2, scope: !510)
!569 = !DILocation(line: 562, column: 1, scope: !510)
!570 = distinct !DISubprogram(name: "init_service_vs", scope: !172, file: !172, line: 515, type: !571, isLocal: true, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!571 = !DISubroutineType(types: !572)
!572 = !{!244, !181}
!573 = !DILocalVariable(name: "vs", arg: 1, scope: !570, file: !172, line: 515, type: !181)
!574 = !DILocation(line: 515, column: 36, scope: !570)
!575 = !DILocation(line: 518, column: 9, scope: !576)
!576 = distinct !DILexicalBlock(scope: !570, file: !172, line: 518, column: 6)
!577 = !DILocation(line: 518, column: 14, scope: !576)
!578 = !DILocation(line: 518, column: 7, scope: !576)
!579 = !DILocation(line: 518, column: 21, scope: !576)
!580 = !DILocation(line: 518, column: 24, scope: !581)
!581 = !DILexicalBlockFile(scope: !576, file: !172, discriminator: 1)
!582 = !DILocation(line: 518, column: 28, scope: !581)
!583 = !DILocation(line: 518, column: 6, scope: !581)
!584 = !DILocation(line: 519, column: 24, scope: !585)
!585 = distinct !DILexicalBlock(scope: !576, file: !172, line: 518, column: 33)
!586 = !DILocation(line: 519, column: 3, scope: !585)
!587 = !DILocation(line: 520, column: 5, scope: !585)
!588 = !DILocation(line: 520, column: 10, scope: !585)
!589 = !DILocation(line: 520, column: 16, scope: !585)
!590 = !DILocation(line: 521, column: 2, scope: !585)
!591 = !DILocation(line: 524, column: 23, scope: !592)
!592 = distinct !DILexicalBlock(scope: !570, file: !172, line: 524, column: 6)
!593 = !DILocation(line: 524, column: 7, scope: !592)
!594 = !DILocation(line: 524, column: 6, scope: !570)
!595 = !DILocation(line: 525, column: 3, scope: !592)
!596 = !DILocation(line: 527, column: 6, scope: !597)
!597 = distinct !DILexicalBlock(scope: !570, file: !172, line: 527, column: 6)
!598 = !DILocation(line: 527, column: 10, scope: !597)
!599 = !DILocation(line: 527, column: 19, scope: !597)
!600 = !DILocation(line: 527, column: 22, scope: !601)
!601 = !DILexicalBlockFile(scope: !597, file: !172, discriminator: 1)
!602 = !DILocation(line: 527, column: 26, scope: !601)
!603 = !DILocation(line: 527, column: 6, scope: !601)
!604 = !DILocation(line: 529, column: 20, scope: !605)
!605 = distinct !DILexicalBlock(scope: !597, file: !172, line: 527, column: 35)
!606 = !DILocation(line: 529, column: 3, scope: !605)
!607 = !DILocation(line: 530, column: 2, scope: !605)
!608 = !DILocation(line: 534, column: 22, scope: !570)
!609 = !DILocation(line: 534, column: 2, scope: !570)
!610 = !DILocation(line: 537, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !570, file: !172, line: 537, column: 6)
!612 = !DILocation(line: 537, column: 10, scope: !611)
!613 = !DILocation(line: 537, column: 16, scope: !611)
!614 = !DILocation(line: 537, column: 19, scope: !615)
!615 = !DILexicalBlockFile(scope: !611, file: !172, discriminator: 1)
!616 = !DILocation(line: 537, column: 23, scope: !615)
!617 = !DILocation(line: 537, column: 30, scope: !615)
!618 = !DILocation(line: 537, column: 38, scope: !615)
!619 = !DILocation(line: 537, column: 42, scope: !620)
!620 = !DILexicalBlockFile(scope: !611, file: !172, discriminator: 2)
!621 = !DILocation(line: 537, column: 46, scope: !620)
!622 = !DILocation(line: 537, column: 53, scope: !620)
!623 = !DILocation(line: 537, column: 6, scope: !620)
!624 = !DILocation(line: 539, column: 3, scope: !625)
!625 = distinct !DILexicalBlock(scope: !611, file: !172, line: 537, column: 58)
!626 = !DILocation(line: 539, column: 7, scope: !625)
!627 = !DILocation(line: 539, column: 14, scope: !625)
!628 = !DILocation(line: 539, column: 34, scope: !625)
!629 = !DILocation(line: 541, column: 29, scope: !625)
!630 = !DILocation(line: 541, column: 33, scope: !625)
!631 = !DILocation(line: 541, column: 37, scope: !625)
!632 = !DILocation(line: 541, column: 3, scope: !625)
!633 = !DILocation(line: 543, column: 3, scope: !625)
!634 = !DILocation(line: 543, column: 7, scope: !625)
!635 = !DILocation(line: 543, column: 14, scope: !625)
!636 = !DILocation(line: 543, column: 34, scope: !625)
!637 = !DILocation(line: 544, column: 2, scope: !625)
!638 = !DILocation(line: 546, column: 2, scope: !570)
!639 = !DILocation(line: 547, column: 1, scope: !570)
!640 = distinct !DISubprogram(name: "update_svr_wgt", scope: !172, file: !172, line: 566, type: !641, isLocal: false, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !114, !181, !207, !244}
!643 = !DILocalVariable(name: "weight", arg: 1, scope: !640, file: !172, line: 566, type: !114)
!644 = !DILocation(line: 566, column: 20, scope: !640)
!645 = !DILocalVariable(name: "vs", arg: 2, scope: !640, file: !172, line: 566, type: !181)
!646 = !DILocation(line: 566, column: 47, scope: !640)
!647 = !DILocalVariable(name: "rs", arg: 3, scope: !640, file: !172, line: 566, type: !207)
!648 = !DILocation(line: 566, column: 67, scope: !640)
!649 = !DILocalVariable(name: "update_quorum", arg: 4, scope: !640, file: !172, line: 567, type: !244)
!650 = !DILocation(line: 567, column: 9, scope: !640)
!651 = !DILocation(line: 569, column: 6, scope: !652)
!652 = distinct !DILexicalBlock(scope: !640, file: !172, line: 569, column: 6)
!653 = !DILocation(line: 569, column: 16, scope: !652)
!654 = !DILocation(line: 569, column: 20, scope: !652)
!655 = !DILocation(line: 569, column: 13, scope: !652)
!656 = !DILocation(line: 569, column: 6, scope: !640)
!657 = !DILocation(line: 571, column: 11, scope: !658)
!658 = distinct !DILexicalBlock(scope: !652, file: !172, line: 569, column: 28)
!659 = !DILocation(line: 571, column: 15, scope: !658)
!660 = !DILocation(line: 572, column: 11, scope: !658)
!661 = !DILocation(line: 573, column: 13, scope: !658)
!662 = !DILocation(line: 573, column: 18, scope: !658)
!663 = !DILocation(line: 573, column: 11, scope: !658)
!664 = !DILocation(line: 574, column: 35, scope: !658)
!665 = !DILocation(line: 574, column: 40, scope: !658)
!666 = !DILocation(line: 574, column: 47, scope: !658)
!667 = !DILocation(line: 574, column: 52, scope: !658)
!668 = !DILocation(line: 574, column: 12, scope: !658)
!669 = !DILocation(line: 575, column: 23, scope: !658)
!670 = !DILocation(line: 575, column: 12, scope: !658)
!671 = !DILocation(line: 570, column: 3, scope: !658)
!672 = !DILocation(line: 576, column: 16, scope: !658)
!673 = !DILocation(line: 576, column: 3, scope: !658)
!674 = !DILocation(line: 576, column: 7, scope: !658)
!675 = !DILocation(line: 576, column: 14, scope: !658)
!676 = !DILocation(line: 583, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !658, file: !172, line: 583, column: 7)
!678 = !DILocation(line: 583, column: 11, scope: !677)
!679 = !DILocation(line: 583, column: 15, scope: !677)
!680 = !DILocation(line: 583, column: 20, scope: !681)
!681 = !DILexicalBlockFile(scope: !677, file: !172, discriminator: 1)
!682 = !DILocation(line: 583, column: 25, scope: !681)
!683 = !DILocation(line: 583, column: 32, scope: !681)
!684 = !DILocation(line: 584, column: 8, scope: !677)
!685 = !DILocation(line: 584, column: 12, scope: !677)
!686 = !DILocation(line: 584, column: 28, scope: !677)
!687 = !DILocation(line: 584, column: 32, scope: !681)
!688 = !DILocation(line: 584, column: 36, scope: !681)
!689 = !DILocation(line: 584, column: 42, scope: !681)
!690 = !DILocation(line: 584, column: 48, scope: !691)
!691 = !DILexicalBlockFile(scope: !677, file: !172, discriminator: 2)
!692 = !DILocation(line: 584, column: 52, scope: !691)
!693 = !DILocation(line: 584, column: 60, scope: !691)
!694 = !DILocation(line: 583, column: 7, scope: !695)
!695 = !DILexicalBlockFile(scope: !658, file: !172, discriminator: 2)
!696 = !DILocation(line: 585, column: 31, scope: !677)
!697 = !DILocation(line: 585, column: 35, scope: !677)
!698 = !DILocation(line: 585, column: 4, scope: !677)
!699 = !DILocation(line: 586, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !658, file: !172, line: 586, column: 7)
!701 = !DILocation(line: 586, column: 7, scope: !658)
!702 = !DILocation(line: 587, column: 24, scope: !700)
!703 = !DILocation(line: 587, column: 4, scope: !700)
!704 = !DILocation(line: 588, column: 2, scope: !658)
!705 = !DILocation(line: 589, column: 1, scope: !640)
!706 = distinct !DISubprogram(name: "update_quorum_state", scope: !172, file: !172, line: 404, type: !337, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!707 = !DILocalVariable(name: "vs", arg: 1, scope: !706, file: !172, line: 404, type: !181)
!708 = !DILocation(line: 404, column: 40, scope: !706)
!709 = !DILocalVariable(name: "init", arg: 2, scope: !706, file: !172, line: 404, type: !244)
!710 = !DILocation(line: 404, column: 48, scope: !706)
!711 = !DILocalVariable(name: "weight_sum", scope: !706, file: !172, line: 406, type: !142)
!712 = !DILocation(line: 406, column: 7, scope: !706)
!713 = !DILocation(line: 406, column: 43, scope: !706)
!714 = !DILocation(line: 406, column: 20, scope: !706)
!715 = !DILocalVariable(name: "threshold", scope: !706, file: !172, line: 407, type: !142)
!716 = !DILocation(line: 407, column: 7, scope: !706)
!717 = !DILocation(line: 409, column: 14, scope: !706)
!718 = !DILocation(line: 409, column: 18, scope: !706)
!719 = !DILocation(line: 409, column: 28, scope: !706)
!720 = !DILocation(line: 409, column: 32, scope: !706)
!721 = !DILocation(line: 409, column: 60, scope: !706)
!722 = !DILocation(line: 409, column: 64, scope: !706)
!723 = !DILocation(line: 409, column: 58, scope: !706)
!724 = !DILocation(line: 409, column: 25, scope: !706)
!725 = !DILocation(line: 409, column: 12, scope: !706)
!726 = !DILocation(line: 412, column: 7, scope: !727)
!727 = distinct !DILexicalBlock(scope: !706, file: !172, line: 412, column: 6)
!728 = !DILocation(line: 412, column: 11, scope: !727)
!729 = !DILocation(line: 412, column: 27, scope: !727)
!730 = !DILocation(line: 413, column: 6, scope: !727)
!731 = !DILocation(line: 413, column: 20, scope: !727)
!732 = !DILocation(line: 413, column: 17, scope: !727)
!733 = !DILocation(line: 412, column: 6, scope: !734)
!734 = !DILexicalBlockFile(scope: !706, file: !172, discriminator: 1)
!735 = !DILocation(line: 414, column: 3, scope: !736)
!736 = distinct !DILexicalBlock(scope: !727, file: !172, line: 413, column: 31)
!737 = !DILocation(line: 414, column: 7, scope: !736)
!738 = !DILocation(line: 414, column: 23, scope: !736)
!739 = !DILocation(line: 416, column: 11, scope: !736)
!740 = !DILocation(line: 416, column: 15, scope: !736)
!741 = !DILocation(line: 417, column: 11, scope: !736)
!742 = !DILocation(line: 417, column: 15, scope: !736)
!743 = !DILocation(line: 418, column: 11, scope: !736)
!744 = !DILocation(line: 419, column: 11, scope: !736)
!745 = !DILocation(line: 420, column: 23, scope: !736)
!746 = !DILocation(line: 420, column: 12, scope: !736)
!747 = !DILocation(line: 415, column: 3, scope: !736)
!748 = !DILocation(line: 421, column: 7, scope: !749)
!749 = distinct !DILexicalBlock(scope: !736, file: !172, line: 421, column: 7)
!750 = !DILocation(line: 421, column: 11, scope: !749)
!751 = !DILocation(line: 421, column: 17, scope: !749)
!752 = !DILocation(line: 421, column: 22, scope: !753)
!753 = !DILexicalBlockFile(scope: !749, file: !172, discriminator: 1)
!754 = !DILocation(line: 421, column: 26, scope: !753)
!755 = !DILocation(line: 421, column: 34, scope: !753)
!756 = !DILocation(line: 421, column: 7, scope: !753)
!757 = !DILocation(line: 423, column: 25, scope: !758)
!758 = distinct !DILexicalBlock(scope: !749, file: !172, line: 421, column: 42)
!759 = !DILocation(line: 423, column: 4, scope: !758)
!760 = !DILocation(line: 426, column: 13, scope: !758)
!761 = !DILocation(line: 426, column: 17, scope: !758)
!762 = !DILocation(line: 426, column: 24, scope: !758)
!763 = !DILocation(line: 427, column: 36, scope: !758)
!764 = !DILocation(line: 427, column: 40, scope: !758)
!765 = !DILocation(line: 427, column: 48, scope: !758)
!766 = !DILocation(line: 427, column: 55, scope: !758)
!767 = !DILocation(line: 427, column: 60, scope: !758)
!768 = !DILocation(line: 427, column: 13, scope: !758)
!769 = !DILocation(line: 428, column: 24, scope: !758)
!770 = !DILocation(line: 428, column: 13, scope: !758)
!771 = !DILocation(line: 425, column: 4, scope: !758)
!772 = !DILocation(line: 430, column: 30, scope: !758)
!773 = !DILocation(line: 430, column: 34, scope: !758)
!774 = !DILocation(line: 430, column: 38, scope: !758)
!775 = !DILocation(line: 430, column: 4, scope: !758)
!776 = !DILocation(line: 431, column: 4, scope: !758)
!777 = !DILocation(line: 431, column: 8, scope: !758)
!778 = !DILocation(line: 431, column: 15, scope: !758)
!779 = !DILocation(line: 431, column: 21, scope: !758)
!780 = !DILocation(line: 432, column: 3, scope: !758)
!781 = !DILocation(line: 434, column: 18, scope: !736)
!782 = !DILocation(line: 434, column: 22, scope: !736)
!783 = !DILocation(line: 434, column: 28, scope: !736)
!784 = !DILocation(line: 434, column: 39, scope: !736)
!785 = !DILocation(line: 434, column: 3, scope: !736)
!786 = !DILocation(line: 436, column: 3, scope: !736)
!787 = !DILocation(line: 438, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !727, file: !172, line: 438, column: 11)
!789 = !DILocation(line: 438, column: 16, scope: !788)
!790 = !DILocation(line: 438, column: 32, scope: !788)
!791 = !DILocation(line: 439, column: 7, scope: !788)
!792 = !DILocation(line: 439, column: 18, scope: !788)
!793 = !DILocation(line: 439, column: 21, scope: !794)
!794 = !DILexicalBlockFile(scope: !788, file: !172, discriminator: 1)
!795 = !DILocation(line: 439, column: 34, scope: !794)
!796 = !DILocation(line: 439, column: 32, scope: !794)
!797 = !DILocation(line: 439, column: 46, scope: !794)
!798 = !DILocation(line: 440, column: 5, scope: !788)
!799 = !DILocation(line: 440, column: 10, scope: !788)
!800 = !DILocation(line: 440, column: 14, scope: !794)
!801 = !DILocation(line: 440, column: 18, scope: !794)
!802 = !DILocation(line: 440, column: 34, scope: !794)
!803 = !DILocation(line: 441, column: 5, scope: !788)
!804 = !DILocation(line: 441, column: 9, scope: !788)
!805 = !DILocation(line: 441, column: 15, scope: !788)
!806 = !DILocation(line: 441, column: 21, scope: !794)
!807 = !DILocation(line: 441, column: 25, scope: !794)
!808 = !DILocation(line: 441, column: 33, scope: !794)
!809 = !DILocation(line: 438, column: 11, scope: !810)
!810 = !DILexicalBlockFile(scope: !727, file: !172, discriminator: 1)
!811 = !DILocation(line: 447, column: 3, scope: !812)
!812 = distinct !DILexicalBlock(scope: !788, file: !172, line: 441, column: 42)
!813 = !DILocation(line: 447, column: 7, scope: !812)
!814 = !DILocation(line: 447, column: 23, scope: !812)
!815 = !DILocation(line: 449, column: 11, scope: !812)
!816 = !DILocation(line: 450, column: 11, scope: !812)
!817 = !DILocation(line: 450, column: 15, scope: !812)
!818 = !DILocation(line: 451, column: 11, scope: !812)
!819 = !DILocation(line: 451, column: 15, scope: !812)
!820 = !DILocation(line: 452, column: 11, scope: !812)
!821 = !DILocation(line: 453, column: 11, scope: !812)
!822 = !DILocation(line: 454, column: 23, scope: !812)
!823 = !DILocation(line: 454, column: 12, scope: !812)
!824 = !DILocation(line: 448, column: 3, scope: !812)
!825 = !DILocation(line: 456, column: 7, scope: !826)
!826 = distinct !DILexicalBlock(scope: !812, file: !172, line: 456, column: 7)
!827 = !DILocation(line: 456, column: 11, scope: !826)
!828 = !DILocation(line: 456, column: 17, scope: !826)
!829 = !DILocation(line: 456, column: 23, scope: !830)
!830 = !DILexicalBlockFile(scope: !826, file: !172, discriminator: 1)
!831 = !DILocation(line: 456, column: 27, scope: !830)
!832 = !DILocation(line: 456, column: 35, scope: !830)
!833 = !DILocation(line: 456, column: 7, scope: !830)
!834 = !DILocation(line: 458, column: 13, scope: !835)
!835 = distinct !DILexicalBlock(scope: !826, file: !172, line: 456, column: 43)
!836 = !DILocation(line: 458, column: 17, scope: !835)
!837 = !DILocation(line: 458, column: 24, scope: !835)
!838 = !DILocation(line: 459, column: 36, scope: !835)
!839 = !DILocation(line: 459, column: 40, scope: !835)
!840 = !DILocation(line: 459, column: 48, scope: !835)
!841 = !DILocation(line: 459, column: 55, scope: !835)
!842 = !DILocation(line: 459, column: 60, scope: !835)
!843 = !DILocation(line: 459, column: 13, scope: !835)
!844 = !DILocation(line: 460, column: 24, scope: !835)
!845 = !DILocation(line: 460, column: 13, scope: !835)
!846 = !DILocation(line: 457, column: 4, scope: !835)
!847 = !DILocation(line: 463, column: 30, scope: !835)
!848 = !DILocation(line: 463, column: 34, scope: !835)
!849 = !DILocation(line: 463, column: 38, scope: !835)
!850 = !DILocation(line: 463, column: 4, scope: !835)
!851 = !DILocation(line: 464, column: 4, scope: !835)
!852 = !DILocation(line: 464, column: 8, scope: !835)
!853 = !DILocation(line: 464, column: 15, scope: !835)
!854 = !DILocation(line: 464, column: 21, scope: !835)
!855 = !DILocation(line: 467, column: 25, scope: !835)
!856 = !DILocation(line: 467, column: 4, scope: !835)
!857 = !DILocation(line: 468, column: 3, scope: !835)
!858 = !DILocation(line: 470, column: 18, scope: !812)
!859 = !DILocation(line: 470, column: 22, scope: !812)
!860 = !DILocation(line: 470, column: 28, scope: !812)
!861 = !DILocation(line: 470, column: 39, scope: !812)
!862 = !DILocation(line: 470, column: 3, scope: !812)
!863 = !DILocation(line: 471, column: 2, scope: !812)
!864 = !DILocation(line: 472, column: 1, scope: !706)
!865 = distinct !DISubprogram(name: "set_checker_state", scope: !172, file: !172, line: 592, type: !866, isLocal: false, isDefinition: true, scopeLine: 593, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !868, !244}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !870, line: 60, baseType: !871)
!870 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !870, line: 40, size: 1024, align: 64, elements: !872)
!872 = !{!873, !874, !875, !971, !975, !976, !977, !978, !979, !980, !981, !992, !993, !994, !995, !996, !997, !998, !999}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !871, file: !870, line: 41, baseType: !100, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !871, file: !870, line: 42, baseType: !104, size: 64, align: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !871, file: !870, line: 43, baseType: !876, size: 64, align: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64, align: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!114, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64, align: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !881)
!881 = !{!882, !883, !885, !940, !941, !942, !952, !964, !966}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !880, file: !4, line: 79, baseType: !162, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !880, file: !4, line: 80, baseType: !884, size: 32, align: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !880, file: !4, line: 81, baseType: !886, size: 64, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64, align: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !888)
!888 = !{!889, !901, !902, !903, !904, !912, !913, !914, !915, !916, !919, !932, !933, !934, !935, !936, !937, !938, !939}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !887, file: !4, line: 113, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !891, line: 109, baseType: !892)
!891 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !891, line: 106, size: 64, align: 64, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !892, file: !891, line: 108, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !891, line: 97, size: 192, align: 64, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !896, file: !891, line: 99, baseType: !162, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !896, file: !891, line: 102, baseType: !895, size: 64, align: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !896, file: !891, line: 103, baseType: !895, size: 64, align: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !887, file: !4, line: 114, baseType: !890, size: 64, align: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !887, file: !4, line: 115, baseType: !890, size: 64, align: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !887, file: !4, line: 116, baseType: !890, size: 64, align: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !887, file: !4, line: 117, baseType: !905, size: 128, align: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !906, line: 62, baseType: !907)
!906 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !906, line: 60, size: 128, align: 64, elements: !908)
!908 = !{!909, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !907, file: !906, line: 61, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !907, file: !906, line: 61, baseType: !910, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !887, file: !4, line: 121, baseType: !905, size: 128, align: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !887, file: !4, line: 122, baseType: !905, size: 128, align: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !887, file: !4, line: 124, baseType: !85, size: 64, align: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !887, file: !4, line: 127, baseType: !890, size: 64, align: 64, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !887, file: !4, line: 128, baseType: !917, size: 64, align: 64, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !887, file: !4, line: 129, baseType: !920, size: 64, align: 64, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !923)
!923 = !{!924, !927, !928, !929, !930}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !922, file: !4, line: 103, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !880)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !922, file: !4, line: 104, baseType: !925, size: 64, align: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !922, file: !4, line: 105, baseType: !162, size: 64, align: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !922, file: !4, line: 106, baseType: !114, size: 32, align: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !922, file: !4, line: 108, baseType: !931, size: 192, align: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !891, line: 104, baseType: !896)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !887, file: !4, line: 130, baseType: !52, size: 32, align: 32, offset: 896)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !887, file: !4, line: 131, baseType: !52, size: 32, align: 32, offset: 928)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !887, file: !4, line: 132, baseType: !114, size: 32, align: 32, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !887, file: !4, line: 135, baseType: !114, size: 32, align: 32, offset: 992)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !887, file: !4, line: 136, baseType: !925, size: 64, align: 64, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !887, file: !4, line: 146, baseType: !162, size: 64, align: 64, offset: 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !887, file: !4, line: 147, baseType: !162, size: 64, align: 64, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !887, file: !4, line: 148, baseType: !244, size: 8, align: 8, offset: 1216)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !880, file: !4, line: 82, baseType: !876, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !880, file: !4, line: 83, baseType: !33, size: 64, align: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !880, file: !4, line: 84, baseType: !943, size: 128, align: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !944, line: 31, baseType: !945)
!944 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !946, line: 30, size: 128, align: 64, elements: !947)
!946 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!947 = !{!948, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !945, file: !946, line: 32, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !141, line: 139, baseType: !142)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !945, file: !946, line: 33, baseType: !951, size: 64, align: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !141, line: 141, baseType: !142)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !880, file: !4, line: 92, baseType: !953, size: 64, align: 32, offset: 448)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !4, line: 85, size: 64, align: 32, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !953, file: !4, line: 86, baseType: !114, size: 32, align: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !953, file: !4, line: 87, baseType: !114, size: 32, align: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !953, file: !4, line: 91, baseType: !958, size: 64, align: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !953, file: !4, line: 88, size: 64, align: 32, elements: !959)
!959 = !{!960, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !958, file: !4, line: 89, baseType: !961, size: 32, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !231, line: 263, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !141, line: 133, baseType: !114)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !958, file: !4, line: 90, baseType: !114, size: 32, align: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !880, file: !4, line: 93, baseType: !965, size: 64, align: 64, offset: 512)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, scope: !880, file: !4, line: 95, baseType: !967, size: 192, align: 64, offset: 576)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !4, line: 95, size: 192, align: 64, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !967, file: !4, line: 96, baseType: !931, size: 192, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !967, file: !4, line: 97, baseType: !905, size: 128, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !871, file: !870, line: 44, baseType: !972, size: 64, align: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!244, !33, !33}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !871, file: !870, line: 45, baseType: !181, size: 64, align: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !871, file: !870, line: 46, baseType: !207, size: 64, align: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !871, file: !870, line: 47, baseType: !33, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !871, file: !870, line: 48, baseType: !244, size: 8, align: 8, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !871, file: !870, line: 49, baseType: !244, size: 8, align: 8, offset: 456)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !871, file: !870, line: 50, baseType: !244, size: 8, align: 8, offset: 464)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !871, file: !870, line: 51, baseType: !982, size: 64, align: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !984, line: 50, baseType: !985)
!984 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !984, line: 42, size: 2240, align: 64, elements: !986)
!986 = !{!987, !988, !989, !990, !991}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !985, file: !984, line: 43, baseType: !196, size: 1024, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !985, file: !984, line: 44, baseType: !196, size: 1024, align: 64, offset: 1024)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !985, file: !984, line: 45, baseType: !254, size: 128, align: 8, offset: 2048)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !985, file: !984, line: 46, baseType: !52, size: 32, align: 32, offset: 2176)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !985, file: !984, line: 48, baseType: !52, size: 32, align: 32, offset: 2208)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !871, file: !870, line: 52, baseType: !114, size: 32, align: 32, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !871, file: !870, line: 53, baseType: !162, size: 64, align: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !871, file: !870, line: 54, baseType: !162, size: 64, align: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !871, file: !870, line: 55, baseType: !52, size: 32, align: 32, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !871, file: !870, line: 56, baseType: !162, size: 64, align: 64, offset: 832)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !871, file: !870, line: 57, baseType: !52, size: 32, align: 32, offset: 896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !871, file: !870, line: 58, baseType: !52, size: 32, align: 32, offset: 928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !871, file: !870, line: 59, baseType: !162, size: 64, align: 64, offset: 960)
!1000 = !DILocalVariable(name: "checker", arg: 1, scope: !865, file: !172, line: 592, type: !868)
!1001 = !DILocation(line: 592, column: 30, scope: !865)
!1002 = !DILocalVariable(name: "up", arg: 2, scope: !865, file: !172, line: 592, type: !244)
!1003 = !DILocation(line: 592, column: 43, scope: !865)
!1004 = !DILocation(line: 594, column: 6, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !865, file: !172, line: 594, column: 6)
!1006 = !DILocation(line: 594, column: 15, scope: !1005)
!1007 = !DILocation(line: 594, column: 24, scope: !1005)
!1008 = !DILocation(line: 594, column: 21, scope: !1005)
!1009 = !DILocation(line: 594, column: 6, scope: !865)
!1010 = !DILocation(line: 595, column: 3, scope: !1005)
!1011 = !DILocation(line: 597, column: 19, scope: !865)
!1012 = !DILocation(line: 597, column: 2, scope: !865)
!1013 = !DILocation(line: 597, column: 11, scope: !865)
!1014 = !DILocation(line: 597, column: 17, scope: !865)
!1015 = !DILocation(line: 599, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !865, file: !172, line: 599, column: 6)
!1017 = !DILocation(line: 599, column: 6, scope: !865)
!1018 = !DILocation(line: 600, column: 3, scope: !1016)
!1019 = !DILocation(line: 600, column: 12, scope: !1016)
!1020 = !DILocation(line: 600, column: 16, scope: !1016)
!1021 = !DILocation(line: 600, column: 35, scope: !1016)
!1022 = !DILocation(line: 601, column: 11, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1016, file: !172, line: 601, column: 11)
!1024 = !DILocation(line: 601, column: 20, scope: !1023)
!1025 = !DILocation(line: 601, column: 24, scope: !1023)
!1026 = !DILocation(line: 601, column: 11, scope: !1016)
!1027 = !DILocation(line: 602, column: 3, scope: !1023)
!1028 = !DILocation(line: 602, column: 12, scope: !1023)
!1029 = !DILocation(line: 602, column: 16, scope: !1023)
!1030 = !DILocation(line: 602, column: 35, scope: !1023)
!1031 = !DILocation(line: 603, column: 1, scope: !865)
!1032 = distinct !DISubprogram(name: "update_svr_checker_state", scope: !172, file: !172, line: 607, type: !1033, isLocal: false, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !244, !868}
!1035 = !DILocalVariable(name: "alive", arg: 1, scope: !1032, file: !172, line: 607, type: !244)
!1036 = !DILocation(line: 607, column: 30, scope: !1032)
!1037 = !DILocalVariable(name: "checker", arg: 2, scope: !1032, file: !172, line: 607, type: !868)
!1038 = !DILocation(line: 607, column: 48, scope: !1032)
!1039 = !DILocation(line: 609, column: 6, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1032, file: !172, line: 609, column: 6)
!1041 = !DILocation(line: 609, column: 15, scope: !1040)
!1042 = !DILocation(line: 609, column: 24, scope: !1040)
!1043 = !DILocation(line: 609, column: 21, scope: !1040)
!1044 = !DILocation(line: 609, column: 6, scope: !1032)
!1045 = !DILocation(line: 610, column: 8, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !172, line: 610, column: 7)
!1047 = distinct !DILexicalBlock(scope: !1040, file: !172, line: 609, column: 31)
!1048 = !DILocation(line: 610, column: 17, scope: !1046)
!1049 = !DILocation(line: 610, column: 7, scope: !1047)
!1050 = !DILocation(line: 611, column: 8, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !172, line: 611, column: 8)
!1052 = distinct !DILexicalBlock(scope: !1046, file: !172, line: 610, column: 26)
!1053 = !DILocation(line: 611, column: 17, scope: !1051)
!1054 = !DILocation(line: 611, column: 23, scope: !1051)
!1055 = !DILocation(line: 611, column: 27, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !1051, file: !172, discriminator: 1)
!1057 = !DILocation(line: 611, column: 8, scope: !1056)
!1058 = !DILocation(line: 612, column: 20, scope: !1051)
!1059 = !DILocation(line: 612, column: 29, scope: !1051)
!1060 = !DILocation(line: 612, column: 33, scope: !1051)
!1061 = !DILocation(line: 612, column: 42, scope: !1051)
!1062 = !DILocation(line: 612, column: 5, scope: !1051)
!1063 = !DILocation(line: 613, column: 4, scope: !1052)
!1064 = !DILocation(line: 613, column: 13, scope: !1052)
!1065 = !DILocation(line: 613, column: 21, scope: !1052)
!1066 = !DILocation(line: 614, column: 3, scope: !1052)
!1067 = !DILocation(line: 615, column: 3, scope: !1047)
!1068 = !DILocation(line: 618, column: 2, scope: !1032)
!1069 = !DILocation(line: 618, column: 11, scope: !1032)
!1070 = !DILocation(line: 618, column: 19, scope: !1032)
!1071 = !DILocation(line: 620, column: 6, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1032, file: !172, line: 620, column: 6)
!1073 = !DILocation(line: 620, column: 6, scope: !1032)
!1074 = !DILocation(line: 622, column: 7, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !172, line: 622, column: 7)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !172, line: 620, column: 13)
!1077 = !DILocation(line: 622, column: 16, scope: !1075)
!1078 = !DILocation(line: 622, column: 20, scope: !1075)
!1079 = !DILocation(line: 622, column: 40, scope: !1075)
!1080 = !DILocation(line: 622, column: 7, scope: !1076)
!1081 = !DILocation(line: 623, column: 32, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !172, line: 623, column: 8)
!1083 = distinct !DILexicalBlock(scope: !1075, file: !172, line: 622, column: 46)
!1084 = !DILocation(line: 623, column: 9, scope: !1082)
!1085 = !DILocation(line: 623, column: 8, scope: !1083)
!1086 = !DILocation(line: 624, column: 5, scope: !1082)
!1087 = !DILocation(line: 625, column: 3, scope: !1083)
!1088 = !DILocation(line: 626, column: 2, scope: !1076)
!1089 = !DILocation(line: 629, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !172, line: 629, column: 7)
!1091 = distinct !DILexicalBlock(scope: !1072, file: !172, line: 627, column: 7)
!1092 = !DILocation(line: 629, column: 16, scope: !1090)
!1093 = !DILocation(line: 629, column: 20, scope: !1090)
!1094 = !DILocation(line: 629, column: 40, scope: !1090)
!1095 = !DILocation(line: 629, column: 7, scope: !1091)
!1096 = !DILocation(line: 630, column: 33, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !172, line: 630, column: 8)
!1098 = distinct !DILexicalBlock(scope: !1090, file: !172, line: 629, column: 46)
!1099 = !DILocation(line: 630, column: 9, scope: !1097)
!1100 = !DILocation(line: 630, column: 8, scope: !1098)
!1101 = !DILocation(line: 631, column: 5, scope: !1097)
!1102 = !DILocation(line: 632, column: 3, scope: !1098)
!1103 = !DILocation(line: 635, column: 20, scope: !1032)
!1104 = !DILocation(line: 635, column: 29, scope: !1032)
!1105 = !DILocation(line: 635, column: 2, scope: !1032)
!1106 = !DILocation(line: 636, column: 1, scope: !1032)
!1107 = !DILocation(line: 636, column: 1, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1032, file: !172, discriminator: 1)
!1109 = distinct !DISubprogram(name: "do_rs_notifies", scope: !172, file: !172, line: 163, type: !1110, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !181, !207, !244}
!1112 = !DILocalVariable(name: "vs", arg: 1, scope: !1109, file: !172, line: 163, type: !181)
!1113 = !DILocation(line: 163, column: 34, scope: !1109)
!1114 = !DILocalVariable(name: "rs", arg: 2, scope: !1109, file: !172, line: 163, type: !207)
!1115 = !DILocation(line: 163, column: 53, scope: !1109)
!1116 = !DILocalVariable(name: "stopping", arg: 3, scope: !1109, file: !172, line: 163, type: !244)
!1117 = !DILocation(line: 163, column: 61, scope: !1109)
!1118 = !DILocalVariable(name: "notify_script", scope: !1109, file: !172, line: 165, type: !220)
!1119 = !DILocation(line: 165, column: 19, scope: !1109)
!1120 = !DILocation(line: 165, column: 35, scope: !1109)
!1121 = !DILocation(line: 165, column: 39, scope: !1109)
!1122 = !DILocation(line: 165, column: 47, scope: !1123)
!1123 = !DILexicalBlockFile(scope: !1109, file: !172, discriminator: 1)
!1124 = !DILocation(line: 165, column: 51, scope: !1123)
!1125 = !DILocation(line: 165, column: 35, scope: !1123)
!1126 = !DILocation(line: 165, column: 63, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1109, file: !172, discriminator: 2)
!1128 = !DILocation(line: 165, column: 67, scope: !1127)
!1129 = !DILocation(line: 165, column: 35, scope: !1127)
!1130 = !DILocation(line: 165, column: 35, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1109, file: !172, discriminator: 3)
!1132 = !DILocation(line: 165, column: 19, scope: !1131)
!1133 = !DILocation(line: 167, column: 6, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1109, file: !172, line: 167, column: 6)
!1135 = !DILocation(line: 167, column: 6, scope: !1109)
!1136 = !DILocation(line: 168, column: 7, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !172, line: 168, column: 7)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !172, line: 167, column: 21)
!1139 = !DILocation(line: 168, column: 7, scope: !1138)
!1140 = !DILocation(line: 169, column: 23, scope: !1137)
!1141 = !DILocation(line: 169, column: 67, scope: !1137)
!1142 = !DILocation(line: 169, column: 4, scope: !1137)
!1143 = !DILocation(line: 171, column: 16, scope: !1137)
!1144 = !DILocation(line: 171, column: 4, scope: !1137)
!1145 = !DILocation(line: 172, column: 2, scope: !1138)
!1146 = !DILocation(line: 174, column: 17, scope: !1109)
!1147 = !DILocation(line: 174, column: 21, scope: !1109)
!1148 = !DILocation(line: 174, column: 2, scope: !1109)
!1149 = !DILocation(line: 182, column: 1, scope: !1109)
!1150 = distinct !DISubprogram(name: "perform_svr_state", scope: !172, file: !172, line: 476, type: !1151, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!244, !244, !868}
!1153 = !DILocalVariable(name: "alive", arg: 1, scope: !1150, file: !172, line: 476, type: !244)
!1154 = !DILocation(line: 476, column: 23, scope: !1150)
!1155 = !DILocalVariable(name: "checker", arg: 2, scope: !1150, file: !172, line: 476, type: !868)
!1156 = !DILocation(line: 476, column: 41, scope: !1150)
!1157 = !DILocalVariable(name: "vs", scope: !1150, file: !172, line: 486, type: !181)
!1158 = !DILocation(line: 486, column: 21, scope: !1150)
!1159 = !DILocation(line: 486, column: 26, scope: !1150)
!1160 = !DILocation(line: 486, column: 35, scope: !1150)
!1161 = !DILocalVariable(name: "rs", scope: !1150, file: !172, line: 487, type: !207)
!1162 = !DILocation(line: 487, column: 18, scope: !1150)
!1163 = !DILocation(line: 487, column: 23, scope: !1150)
!1164 = !DILocation(line: 487, column: 32, scope: !1150)
!1165 = !DILocation(line: 489, column: 8, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1150, file: !172, line: 489, column: 6)
!1167 = !DILocation(line: 489, column: 13, scope: !1166)
!1168 = !DILocation(line: 489, column: 6, scope: !1166)
!1169 = !DILocation(line: 489, column: 23, scope: !1166)
!1170 = !DILocation(line: 489, column: 20, scope: !1166)
!1171 = !DILocation(line: 489, column: 6, scope: !1150)
!1172 = !DILocation(line: 490, column: 3, scope: !1166)
!1173 = !DILocation(line: 493, column: 10, scope: !1150)
!1174 = !DILocation(line: 493, column: 19, scope: !1175)
!1175 = !DILexicalBlockFile(scope: !1150, file: !172, discriminator: 1)
!1176 = !DILocation(line: 493, column: 23, scope: !1175)
!1177 = !DILocation(line: 493, column: 18, scope: !1175)
!1178 = !DILocation(line: 493, column: 10, scope: !1175)
!1179 = !DILocation(line: 494, column: 12, scope: !1150)
!1180 = !DILocation(line: 494, column: 16, scope: !1150)
!1181 = !DILocation(line: 494, column: 11, scope: !1150)
!1182 = !DILocation(line: 493, column: 10, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1150, file: !172, discriminator: 2)
!1184 = !DILocation(line: 493, column: 10, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1150, file: !172, discriminator: 3)
!1186 = !DILocation(line: 495, column: 34, scope: !1150)
!1187 = !DILocation(line: 495, column: 39, scope: !1150)
!1188 = !DILocation(line: 495, column: 46, scope: !1150)
!1189 = !DILocation(line: 495, column: 51, scope: !1150)
!1190 = !DILocation(line: 495, column: 11, scope: !1150)
!1191 = !DILocation(line: 496, column: 22, scope: !1150)
!1192 = !DILocation(line: 496, column: 11, scope: !1150)
!1193 = !DILocation(line: 492, column: 2, scope: !1150)
!1194 = !DILocation(line: 499, column: 6, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1150, file: !172, line: 499, column: 6)
!1196 = !DILocation(line: 499, column: 10, scope: !1195)
!1197 = !DILocation(line: 499, column: 26, scope: !1195)
!1198 = !DILocation(line: 499, column: 30, scope: !1199)
!1199 = !DILexicalBlockFile(scope: !1195, file: !172, discriminator: 1)
!1200 = !DILocation(line: 499, column: 34, scope: !1199)
!1201 = !DILocation(line: 499, column: 40, scope: !1199)
!1202 = !DILocation(line: 499, column: 46, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1195, file: !172, discriminator: 2)
!1204 = !DILocation(line: 499, column: 50, scope: !1203)
!1205 = !DILocation(line: 499, column: 58, scope: !1203)
!1206 = !DILocation(line: 499, column: 6, scope: !1203)
!1207 = !DILocation(line: 500, column: 16, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !172, line: 500, column: 7)
!1209 = distinct !DILexicalBlock(scope: !1195, file: !172, line: 499, column: 66)
!1210 = !DILocation(line: 500, column: 60, scope: !1208)
!1211 = !DILocation(line: 500, column: 64, scope: !1208)
!1212 = !DILocation(line: 500, column: 7, scope: !1208)
!1213 = !DILocation(line: 500, column: 7, scope: !1209)
!1214 = !DILocation(line: 501, column: 4, scope: !1208)
!1215 = !DILocation(line: 502, column: 2, scope: !1209)
!1216 = !DILocation(line: 503, column: 14, scope: !1150)
!1217 = !DILocation(line: 503, column: 2, scope: !1150)
!1218 = !DILocation(line: 503, column: 6, scope: !1150)
!1219 = !DILocation(line: 503, column: 12, scope: !1150)
!1220 = !DILocation(line: 504, column: 17, scope: !1150)
!1221 = !DILocation(line: 504, column: 21, scope: !1150)
!1222 = !DILocation(line: 504, column: 2, scope: !1150)
!1223 = !DILocation(line: 508, column: 22, scope: !1150)
!1224 = !DILocation(line: 508, column: 2, scope: !1150)
!1225 = !DILocation(line: 510, column: 2, scope: !1150)
!1226 = !DILocation(line: 511, column: 1, scope: !1150)
!1227 = distinct !DISubprogram(name: "clear_diff_services", scope: !172, file: !172, line: 860, type: !1228, isLocal: false, isDefinition: true, scopeLine: 861, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !175)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !85}
!1230 = !DILocalVariable(name: "old_checkers_queue", arg: 1, scope: !1227, file: !172, line: 860, type: !85)
!1231 = !DILocation(line: 860, column: 26, scope: !1227)
!1232 = !DILocalVariable(name: "e", scope: !1227, file: !172, line: 862, type: !177)
!1233 = !DILocation(line: 862, column: 10, scope: !1227)
!1234 = !DILocalVariable(name: "vs", scope: !1227, file: !172, line: 863, type: !181)
!1235 = !DILocation(line: 863, column: 20, scope: !1227)
!1236 = !DILocalVariable(name: "new_vs", scope: !1227, file: !172, line: 863, type: !181)
!1237 = !DILocation(line: 863, column: 25, scope: !1227)
!1238 = !DILocation(line: 866, column: 15, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1227, file: !172, line: 866, column: 2)
!1240 = !DILocation(line: 866, column: 31, scope: !1239)
!1241 = !DILocation(line: 866, column: 14, scope: !1239)
!1242 = !DILocation(line: 866, column: 40, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 1)
!1244 = !DILocation(line: 866, column: 56, scope: !1243)
!1245 = !DILocation(line: 866, column: 39, scope: !1243)
!1246 = !DILocation(line: 866, column: 38, scope: !1243)
!1247 = !DILocation(line: 866, column: 38, scope: !1248)
!1248 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 2)
!1249 = !DILocation(line: 866, column: 4, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 3)
!1251 = !DILocation(line: 866, column: 20, scope: !1250)
!1252 = !DILocation(line: 866, column: 25, scope: !1250)
!1253 = !DILocation(line: 866, column: 38, scope: !1250)
!1254 = !DILocation(line: 866, column: 38, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 4)
!1256 = !DILocation(line: 866, column: 14, scope: !1255)
!1257 = !DILocation(line: 866, column: 14, scope: !1258)
!1258 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 5)
!1259 = !DILocation(line: 866, column: 14, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 6)
!1261 = !DILocation(line: 866, column: 11, scope: !1260)
!1262 = !DILocation(line: 866, column: 7, scope: !1260)
!1263 = !DILocation(line: 866, column: 5, scope: !1264)
!1264 = !DILexicalBlockFile(scope: !1265, file: !172, discriminator: 7)
!1265 = distinct !DILexicalBlock(scope: !1239, file: !172, line: 866, column: 2)
!1266 = !DILocation(line: 866, column: 4, scope: !1264)
!1267 = !DILocation(line: 866, column: 8, scope: !1264)
!1268 = !DILocation(line: 866, column: 21, scope: !1269)
!1269 = !DILexicalBlockFile(scope: !1265, file: !172, discriminator: 8)
!1270 = !DILocation(line: 866, column: 25, scope: !1269)
!1271 = !DILocation(line: 866, column: 19, scope: !1269)
!1272 = !DILocation(line: 866, column: 17, scope: !1269)
!1273 = !DILocation(line: 866, column: 2, scope: !1274)
!1274 = !DILexicalBlockFile(scope: !1239, file: !172, discriminator: 9)
!1275 = !DILocation(line: 871, column: 21, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1265, file: !172, line: 866, column: 55)
!1277 = !DILocation(line: 871, column: 12, scope: !1276)
!1278 = !DILocation(line: 871, column: 10, scope: !1276)
!1279 = !DILocation(line: 872, column: 8, scope: !1280)
