; ModuleID = './[inter]keepalived--check--ipvswrapper.o.i'
source_filename = "./[inter]keepalived--check--ipvswrapper.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._virtual_server_group = type { i8*, %struct._list*, %struct._list* }
%struct.sigaction = type { %union.anon.5, %struct.__sigset_t, i32, void ()* }
%union.anon.5 = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%union.anon.15 = type { i32 }
%union.anon.16 = type { i32 }
%struct.ip_vs_timeout_user = type { i32, i32, i32 }
%struct.lvs_syncd_config = type { i8*, %struct._vrrp_t*, i32, i16, %struct.sockaddr_storage, i16, i8, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !61, globals: !115)
!1 = !DIFile(filename: "[inter]keepalived--check--ipvswrapper.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !11, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chksum_compatibility", file: !4, line: 173, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./../include/vrrp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NONE", value: 0)
!7 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_NEVER", value: 1)
!8 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_MIN_COMPAT", value: 2)
!9 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_CONFIG", value: 3)
!10 = !DIEnumerator(name: "CHKSUM_COMPATIBILITY_AUTO", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 41, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!14 = !DIEnumerator(name: "THREAD_READ", value: 0)
!15 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!16 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!17 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!18 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!19 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!20 = !DIEnumerator(name: "THREAD_READY", value: 6)
!21 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!22 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!23 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!24 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!25 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!26 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!27 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!28 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!29 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!30 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!31 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 40, size: 32, align: 32, elements: !34)
!33 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!35 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!36 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!37 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!38 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!39 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!40 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!41 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!42 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!43 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!44 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!45 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!46 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!47 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!48 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!49 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!50 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!51 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!52 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!53 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!54 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!55 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!56 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!57 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!58 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!59 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!60 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!61 = !{!62, !63, !86, !110, !79}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !33, line: 239, size: 128, align: 32, elements: !65)
!65 = !{!66, !70, !74, !81}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !64, file: !33, line: 241, baseType: !67, size: 16, align: 16)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !68, line: 28, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!69 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !64, file: !33, line: 242, baseType: !71, size: 16, align: 16, offset: 16)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !33, line: 119, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !73, line: 49, baseType: !69)
!73 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !64, file: !33, line: 243, baseType: !75, size: 32, align: 32, offset: 32)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !33, line: 31, size: 32, align: 32, elements: !76)
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !75, file: !33, line: 33, baseType: !78, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !33, line: 30, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !73, line: 51, baseType: !80)
!80 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !64, file: !33, line: 246, baseType: !82, size: 64, align: 8, offset: 64)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, align: 8, elements: !84)
!83 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!84 = !{!85}
!85 = !DISubrange(count: 8)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !33, line: 254, size: 224, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !109}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !87, file: !33, line: 256, baseType: !67, size: 16, align: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !87, file: !33, line: 257, baseType: !71, size: 16, align: 16, offset: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !87, file: !33, line: 258, baseType: !79, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !87, file: !33, line: 259, baseType: !93, size: 128, align: 32, offset: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !33, line: 211, size: 128, align: 32, elements: !94)
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !93, file: !33, line: 220, baseType: !96, size: 128, align: 32)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !93, file: !33, line: 213, size: 128, align: 32, elements: !97)
!97 = !{!98, !103, !105}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !96, file: !33, line: 215, baseType: !99, size: 128, align: 8)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, align: 8, elements: !101)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !73, line: 48, baseType: !83)
!101 = !{!102}
!102 = !DISubrange(count: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !96, file: !33, line: 217, baseType: !104, size: 128, align: 16)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, align: 16, elements: !84)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !96, file: !33, line: 218, baseType: !106, size: 128, align: 32)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 128, align: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 4)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !87, file: !33, line: 260, baseType: !79, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !111, line: 85, baseType: !112)
!111 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !62}
!115 = !{!116, !201}
!116 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !117, line: 150, type: !118, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!117 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !119, line: 31, baseType: !120)
!119 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !119, line: 39, size: 320, align: 64, elements: !122)
!122 = !{!123, !131, !132, !133, !137}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !121, file: !119, line: 40, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !119, line: 33, size: 192, align: 64, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !119, line: 34, baseType: !124, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !119, line: 35, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !119, line: 36, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !121, file: !119, line: 41, baseType: !124, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !121, file: !119, line: 42, baseType: !80, size: 32, align: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !121, file: !119, line: 43, baseType: !134, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !130}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !121, file: !119, line: 44, baseType: !138, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141, !130}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 48, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 241, size: 1728, align: 64, elements: !146)
!145 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!146 = !{!147, !148, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !169, !170, !171, !172, !176, !177, !179, !183, !186, !188, !189, !190, !191, !192, !196, !197}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 242, baseType: !62, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 247, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 248, baseType: !149, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 249, baseType: !149, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 250, baseType: !149, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 251, baseType: !149, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 252, baseType: !149, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 253, baseType: !149, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 254, baseType: !149, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 256, baseType: !149, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 257, baseType: !149, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 258, baseType: !149, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 260, baseType: !162, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 156, size: 192, align: 64, elements: !164)
!164 = !{!165, !166, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !163, file: !145, line: 157, baseType: !162, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !163, file: !145, line: 158, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !163, file: !145, line: 162, baseType: !62, size: 32, align: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 262, baseType: !167, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 264, baseType: !62, size: 32, align: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 268, baseType: !62, size: 32, align: 32, offset: 928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 270, baseType: !173, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !174, line: 131, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!175 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 274, baseType: !69, size: 16, align: 16, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 275, baseType: !178, size: 8, align: 8, offset: 1040)
!178 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 276, baseType: !180, size: 8, align: 8, offset: 1048)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 8, align: 8, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 1)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 280, baseType: !184, size: 64, align: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 150, baseType: null)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 289, baseType: !187, size: 64, align: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !174, line: 132, baseType: !175)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !144, file: !145, line: 297, baseType: !130, size: 64, align: 64, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !144, file: !145, line: 298, baseType: !130, size: 64, align: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !144, file: !145, line: 299, baseType: !130, size: 64, align: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !144, file: !145, line: 300, baseType: !130, size: 64, align: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 302, baseType: !193, size: 64, align: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 216, baseType: !195)
!194 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!195 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 303, baseType: !62, size: 32, align: 32, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 305, baseType: !198, size: 160, align: 8, offset: 1568)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, align: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 20)
!201 = distinct !DIGlobalVariable(name: "no_ipvs", scope: !0, file: !202, line: 44, type: !203, isLocal: true, isDefinition: true, variable: i8* @no_ipvs)
!202 = !DIFile(filename: "ipvswrapper.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!203 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!204 = !{i32 2, !"Dwarf Version", i32 4}
!205 = !{i32 2, !"Debug Info Version", i32 3}
!206 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!207 = distinct !DISubprogram(name: "ipvs_get_group_by_name", scope: !202, file: !202, line: 131, type: !208, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !149, !118}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !212, line: 128, baseType: !213)
!212 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !212, line: 124, size: 192, align: 64, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !213, file: !212, line: 125, baseType: !149, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !213, file: !212, line: 126, baseType: !118, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !213, file: !212, line: 127, baseType: !118, size: 64, align: 64, offset: 128)
!218 = !{}
!219 = !DILocalVariable(name: "gname", arg: 1, scope: !207, file: !202, line: 131, type: !149)
!220 = !DIExpression()
!221 = !DILocation(line: 131, column: 30, scope: !207)
!222 = !DILocalVariable(name: "l", arg: 2, scope: !207, file: !202, line: 131, type: !118)
!223 = !DILocation(line: 131, column: 42, scope: !207)
!224 = !DILocalVariable(name: "e", scope: !207, file: !202, line: 133, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "element", file: !119, line: 30, baseType: !124)
!226 = !DILocation(line: 133, column: 10, scope: !207)
!227 = !DILocalVariable(name: "vsg", scope: !207, file: !202, line: 134, type: !210)
!228 = !DILocation(line: 134, column: 26, scope: !207)
!229 = !DILocation(line: 136, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !207, file: !202, line: 136, column: 2)
!231 = !DILocation(line: 136, column: 13, scope: !230)
!232 = !DILocation(line: 136, column: 12, scope: !230)
!233 = !DILocation(line: 136, column: 12, scope: !234)
!234 = !DILexicalBlockFile(scope: !230, file: !202, discriminator: 1)
!235 = !DILocation(line: 136, column: 13, scope: !236)
!236 = !DILexicalBlockFile(scope: !230, file: !202, discriminator: 2)
!237 = !DILocation(line: 136, column: 17, scope: !236)
!238 = !DILocation(line: 136, column: 12, scope: !236)
!239 = !DILocation(line: 136, column: 12, scope: !240)
!240 = !DILexicalBlockFile(scope: !230, file: !202, discriminator: 3)
!241 = !DILocation(line: 136, column: 9, scope: !240)
!242 = !DILocation(line: 136, column: 7, scope: !240)
!243 = !DILocation(line: 136, column: 24, scope: !244)
!244 = !DILexicalBlockFile(scope: !245, file: !202, discriminator: 4)
!245 = distinct !DILexicalBlock(scope: !230, file: !202, line: 136, column: 2)
!246 = !DILocation(line: 136, column: 2, scope: !244)
!247 = !DILocation(line: 137, column: 11, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !202, line: 136, column: 46)
!249 = !DILocation(line: 137, column: 15, scope: !248)
!250 = !DILocation(line: 137, column: 9, scope: !248)
!251 = !DILocation(line: 137, column: 7, scope: !248)
!252 = !DILocation(line: 138, column: 15, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !202, line: 138, column: 7)
!254 = !DILocation(line: 138, column: 20, scope: !253)
!255 = !DILocation(line: 138, column: 27, scope: !253)
!256 = !DILocation(line: 138, column: 8, scope: !253)
!257 = !DILocation(line: 138, column: 7, scope: !248)
!258 = !DILocation(line: 139, column: 11, scope: !253)
!259 = !DILocation(line: 139, column: 4, scope: !253)
!260 = !DILocation(line: 140, column: 2, scope: !248)
!261 = !DILocation(line: 136, column: 35, scope: !262)
!262 = !DILexicalBlockFile(scope: !245, file: !202, discriminator: 5)
!263 = !DILocation(line: 136, column: 39, scope: !262)
!264 = !DILocation(line: 136, column: 32, scope: !262)
!265 = !DILocation(line: 136, column: 2, scope: !262)
!266 = distinct !{!266, !267}
!267 = !DILocation(line: 136, column: 2, scope: !207)
!268 = !DILocation(line: 141, column: 2, scope: !207)
!269 = !DILocation(line: 142, column: 1, scope: !207)
!270 = distinct !DISubprogram(name: "ipvs_start", scope: !202, file: !202, line: 146, type: !271, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!271 = !DISubroutineType(types: !272)
!272 = !{!62}
!273 = !DILocation(line: 148, column: 2, scope: !270)
!274 = !DILocation(line: 150, column: 6, scope: !275)
!275 = distinct !DILexicalBlock(scope: !270, file: !202, line: 150, column: 6)
!276 = !DILocation(line: 150, column: 6, scope: !270)
!277 = !DILocation(line: 151, column: 7, scope: !278)
!278 = distinct !DILexicalBlock(scope: !279, file: !202, line: 151, column: 7)
!279 = distinct !DILexicalBlock(scope: !275, file: !202, line: 150, column: 19)
!280 = !DILocation(line: 151, column: 23, scope: !278)
!281 = !DILocation(line: 151, column: 26, scope: !282)
!282 = !DILexicalBlockFile(scope: !278, file: !202, discriminator: 1)
!283 = !DILocation(line: 151, column: 7, scope: !282)
!284 = !DILocation(line: 153, column: 26, scope: !285)
!285 = distinct !DILexicalBlock(scope: !278, file: !202, line: 151, column: 39)
!286 = !DILocation(line: 153, column: 25, scope: !285)
!287 = !DILocation(line: 153, column: 11, scope: !288)
!288 = !DILexicalBlockFile(scope: !285, file: !202, discriminator: 1)
!289 = !DILocation(line: 152, column: 4, scope: !285)
!290 = !DILocation(line: 154, column: 12, scope: !285)
!291 = !DILocation(line: 155, column: 4, scope: !285)
!292 = !DILocation(line: 157, column: 2, scope: !279)
!293 = !DILocation(line: 159, column: 2, scope: !270)
!294 = !DILocation(line: 160, column: 1, scope: !270)
!295 = distinct !DISubprogram(name: "modprobe_ipvs", scope: !202, file: !202, line: 85, type: !296, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!296 = !DISubroutineType(types: !297)
!297 = !{!203}
!298 = !DILocalVariable(name: "argv", scope: !295, file: !202, line: 87, type: !299)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 320, align: 64, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 5)
!302 = !DILocation(line: 87, column: 8, scope: !295)
!303 = !DILocalVariable(name: "child", scope: !295, file: !202, line: 88, type: !62)
!304 = !DILocation(line: 88, column: 6, scope: !295)
!305 = !DILocalVariable(name: "status", scope: !295, file: !202, line: 89, type: !62)
!306 = !DILocation(line: 89, column: 6, scope: !295)
!307 = !DILocalVariable(name: "rc", scope: !295, file: !202, line: 90, type: !62)
!308 = !DILocation(line: 90, column: 6, scope: !295)
!309 = !DILocalVariable(name: "modprobe", scope: !295, file: !202, line: 91, type: !149)
!310 = !DILocation(line: 91, column: 8, scope: !295)
!311 = !DILocation(line: 91, column: 19, scope: !295)
!312 = !DILocalVariable(name: "act", scope: !295, file: !202, line: 92, type: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !314, line: 24, size: 1216, align: 64, elements: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!315 = !{!316, !395, !402, !403}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !313, file: !314, line: 35, baseType: !317, size: 64, align: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !313, file: !314, line: 28, size: 64, align: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !317, file: !314, line: 31, baseType: !110, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !317, file: !314, line: 33, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !62, !324, !130}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !326, line: 133, baseType: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 62, size: 1024, align: 64, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !327, file: !326, line: 64, baseType: !62, size: 32, align: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !327, file: !326, line: 65, baseType: !62, size: 32, align: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !327, file: !326, line: 67, baseType: !62, size: 32, align: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !327, file: !326, line: 132, baseType: !333, size: 896, align: 64, offset: 128)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !326, line: 69, size: 896, align: 64, elements: !334)
!334 = !{!335, !339, !346, !357, !363, !373, !384, !389}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !333, file: !326, line: 71, baseType: !336, size: 896, align: 32)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 896, align: 32, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 28)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !333, file: !326, line: 78, baseType: !340, size: 64, align: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 74, size: 64, align: 32, elements: !341)
!341 = !{!342, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !340, file: !326, line: 76, baseType: !343, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !174, line: 133, baseType: !62)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !340, file: !326, line: 77, baseType: !345, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !174, line: 125, baseType: !80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !333, file: !326, line: 86, baseType: !347, size: 128, align: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 81, size: 128, align: 64, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !347, file: !326, line: 83, baseType: !62, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !347, file: !326, line: 84, baseType: !62, size: 32, align: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !347, file: !326, line: 85, baseType: !352, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !326, line: 36, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !326, line: 32, size: 64, align: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !353, file: !326, line: 34, baseType: !62, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !353, file: !326, line: 35, baseType: !130, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !333, file: !326, line: 94, baseType: !358, size: 128, align: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 89, size: 128, align: 64, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !358, file: !326, line: 91, baseType: !343, size: 32, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !358, file: !326, line: 92, baseType: !345, size: 32, align: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !358, file: !326, line: 93, baseType: !352, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !333, file: !326, line: 104, baseType: !364, size: 256, align: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 97, size: 256, align: 64, elements: !365)
!365 = !{!366, !367, !368, !369, !372}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !364, file: !326, line: 99, baseType: !343, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !364, file: !326, line: 100, baseType: !345, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !364, file: !326, line: 101, baseType: !62, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !364, file: !326, line: 102, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !326, line: 58, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !174, line: 135, baseType: !175)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !364, file: !326, line: 103, baseType: !370, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !333, file: !326, line: 116, baseType: !374, size: 256, align: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 107, size: 256, align: 64, elements: !375)
!375 = !{!376, !377, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !374, file: !326, line: 109, baseType: !130, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !374, file: !326, line: 110, baseType: !378, size: 16, align: 16, offset: 64)
!378 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !374, file: !326, line: 115, baseType: !380, size: 128, align: 64, offset: 128)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !326, line: 111, size: 128, align: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !380, file: !326, line: 113, baseType: !130, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !380, file: !326, line: 114, baseType: !130, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !333, file: !326, line: 123, baseType: !385, size: 128, align: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 119, size: 128, align: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !385, file: !326, line: 121, baseType: !175, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !385, file: !326, line: 122, baseType: !62, size: 32, align: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !333, file: !326, line: 131, baseType: !390, size: 128, align: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !326, line: 126, size: 128, align: 64, elements: !391)
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !390, file: !326, line: 128, baseType: !130, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !390, file: !326, line: 129, baseType: !62, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !390, file: !326, line: 130, baseType: !80, size: 32, align: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !313, file: !314, line: 43, baseType: !396, size: 1024, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !397, line: 30, baseType: !398)
!397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 27, size: 1024, align: 64, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !398, file: !397, line: 29, baseType: !401, size: 1024, align: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1024, align: 64, elements: !101)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !313, file: !314, line: 46, baseType: !62, size: 32, align: 32, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !313, file: !314, line: 49, baseType: !404, size: 64, align: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null}
!407 = !DILocation(line: 92, column: 19, scope: !295)
!408 = !DILocalVariable(name: "old_act", scope: !295, file: !202, line: 92, type: !313)
!409 = !DILocation(line: 92, column: 24, scope: !295)
!410 = !DILocation(line: 94, column: 6, scope: !411)
!411 = distinct !DILexicalBlock(scope: !295, file: !202, line: 94, column: 6)
!412 = !DILocation(line: 94, column: 6, scope: !295)
!413 = !DILocation(line: 95, column: 13, scope: !411)
!414 = !DILocation(line: 95, column: 3, scope: !411)
!415 = !DILocation(line: 95, column: 11, scope: !411)
!416 = !DILocation(line: 97, column: 5, scope: !295)
!417 = !DILocation(line: 97, column: 25, scope: !295)
!418 = !DILocation(line: 97, column: 16, scope: !295)
!419 = !DILocation(line: 98, column: 19, scope: !295)
!420 = !DILocation(line: 98, column: 2, scope: !295)
!421 = !DILocation(line: 99, column: 6, scope: !295)
!422 = !DILocation(line: 99, column: 15, scope: !295)
!423 = !DILocation(line: 101, column: 2, scope: !295)
!424 = !DILocation(line: 103, column: 6, scope: !425)
!425 = distinct !DILexicalBlock(scope: !295, file: !202, line: 103, column: 6)
!426 = !DILocation(line: 103, column: 6, scope: !295)
!427 = !DILocation(line: 104, column: 3, scope: !425)
!428 = !DILocation(line: 106, column: 16, scope: !429)
!429 = distinct !DILexicalBlock(scope: !295, file: !202, line: 106, column: 6)
!430 = !DILocation(line: 106, column: 14, scope: !429)
!431 = !DILocation(line: 106, column: 6, scope: !295)
!432 = !DILocation(line: 107, column: 9, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !202, line: 106, column: 25)
!434 = !DILocation(line: 107, column: 18, scope: !433)
!435 = !DILocation(line: 107, column: 3, scope: !433)
!436 = !DILocation(line: 108, column: 3, scope: !433)
!437 = !DILocation(line: 111, column: 15, scope: !295)
!438 = !DILocation(line: 111, column: 7, scope: !295)
!439 = !DILocation(line: 111, column: 5, scope: !295)
!440 = !DILocation(line: 113, column: 2, scope: !295)
!441 = !DILocation(line: 115, column: 6, scope: !442)
!442 = distinct !DILexicalBlock(scope: !295, file: !202, line: 115, column: 6)
!443 = !DILocation(line: 115, column: 9, scope: !442)
!444 = !DILocation(line: 115, column: 6, scope: !295)
!445 = !DILocation(line: 117, column: 21, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !202, line: 115, column: 14)
!447 = !DILocation(line: 117, column: 20, scope: !446)
!448 = !DILocation(line: 117, column: 11, scope: !449)
!449 = !DILexicalBlockFile(scope: !446, file: !202, discriminator: 1)
!450 = !DILocation(line: 116, column: 3, scope: !446)
!451 = !DILocation(line: 118, column: 2, scope: !446)
!452 = !DILocation(line: 120, column: 6, scope: !453)
!453 = distinct !DILexicalBlock(scope: !295, file: !202, line: 120, column: 6)
!454 = !DILocation(line: 120, column: 6, scope: !295)
!455 = !DILocation(line: 121, column: 9, scope: !453)
!456 = !DILocation(line: 121, column: 4, scope: !453)
!457 = !DILocation(line: 121, column: 31, scope: !453)
!458 = !DILocation(line: 121, column: 3, scope: !453)
!459 = !DILocation(line: 123, column: 26, scope: !460)
!460 = distinct !DILexicalBlock(scope: !295, file: !202, line: 123, column: 6)
!461 = !DILocation(line: 123, column: 6, scope: !460)
!462 = !DILocation(line: 123, column: 11, scope: !460)
!463 = !DILocation(line: 123, column: 18, scope: !460)
!464 = !DILocation(line: 123, column: 24, scope: !460)
!465 = !DILocation(line: 123, column: 47, scope: !466)
!466 = !DILexicalBlockFile(scope: !460, file: !202, discriminator: 1)
!467 = !DILocation(line: 123, column: 27, scope: !466)
!468 = !DILocation(line: 123, column: 32, scope: !466)
!469 = !DILocation(line: 123, column: 39, scope: !466)
!470 = !DILocation(line: 123, column: 49, scope: !466)
!471 = !DILocation(line: 123, column: 6, scope: !466)
!472 = !DILocation(line: 124, column: 3, scope: !473)
!473 = distinct !DILexicalBlock(scope: !460, file: !202, line: 123, column: 48)
!474 = !DILocation(line: 127, column: 2, scope: !295)
!475 = !DILocation(line: 128, column: 1, scope: !295)
!476 = distinct !DISubprogram(name: "ipvs_stop", scope: !202, file: !202, line: 163, type: !405, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!477 = !DILocation(line: 165, column: 6, scope: !478)
!478 = distinct !DILexicalBlock(scope: !476, file: !202, line: 165, column: 6)
!479 = !DILocation(line: 165, column: 6, scope: !476)
!480 = !DILocation(line: 166, column: 3, scope: !478)
!481 = !DILocation(line: 168, column: 2, scope: !476)
!482 = !DILocation(line: 169, column: 1, scope: !476)
!483 = !DILocation(line: 169, column: 1, scope: !484)
!484 = !DILexicalBlockFile(scope: !476, file: !202, discriminator: 1)
!485 = distinct !DISubprogram(name: "ipvs_set_timeouts", scope: !202, file: !202, line: 172, type: !486, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !62, !62, !62}
!488 = !DILocalVariable(name: "tcp_timeout", arg: 1, scope: !485, file: !202, line: 172, type: !62)
!489 = !DILocation(line: 172, column: 23, scope: !485)
!490 = !DILocalVariable(name: "tcpfin_timeout", arg: 2, scope: !485, file: !202, line: 172, type: !62)
!491 = !DILocation(line: 172, column: 40, scope: !485)
!492 = !DILocalVariable(name: "udp_timeout", arg: 3, scope: !485, file: !202, line: 172, type: !62)
!493 = !DILocation(line: 172, column: 60, scope: !485)
!494 = !DILocalVariable(name: "to", scope: !485, file: !202, line: 174, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipvs_timeout_t", file: !496, line: 30, baseType: !497)
!496 = !DIFile(filename: "./../include/libipvs.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_vs_timeout_user", file: !498, line: 258, size: 96, align: 32, elements: !499)
!498 = !DIFile(filename: "/usr/include/linux/ip_vs.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_timeout", scope: !497, file: !498, line: 259, baseType: !62, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_fin_timeout", scope: !497, file: !498, line: 260, baseType: !62, size: 32, align: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "udp_timeout", scope: !497, file: !498, line: 261, baseType: !62, size: 32, align: 32, offset: 64)
!503 = !DILocation(line: 174, column: 17, scope: !485)
!504 = !DILocation(line: 176, column: 7, scope: !505)
!505 = distinct !DILexicalBlock(scope: !485, file: !202, line: 176, column: 6)
!506 = !DILocation(line: 176, column: 19, scope: !505)
!507 = !DILocation(line: 176, column: 23, scope: !508)
!508 = !DILexicalBlockFile(scope: !505, file: !202, discriminator: 1)
!509 = !DILocation(line: 176, column: 38, scope: !508)
!510 = !DILocation(line: 176, column: 42, scope: !511)
!511 = !DILexicalBlockFile(scope: !505, file: !202, discriminator: 2)
!512 = !DILocation(line: 176, column: 6, scope: !511)
!513 = !DILocation(line: 177, column: 3, scope: !505)
!514 = !DILocation(line: 179, column: 19, scope: !485)
!515 = !DILocation(line: 179, column: 5, scope: !485)
!516 = !DILocation(line: 179, column: 17, scope: !485)
!517 = !DILocation(line: 180, column: 23, scope: !485)
!518 = !DILocation(line: 180, column: 5, scope: !485)
!519 = !DILocation(line: 180, column: 21, scope: !485)
!520 = !DILocation(line: 181, column: 19, scope: !485)
!521 = !DILocation(line: 181, column: 5, scope: !485)
!522 = !DILocation(line: 181, column: 17, scope: !485)
!523 = !DILocation(line: 183, column: 2, scope: !485)
!524 = !DILocation(line: 184, column: 1, scope: !485)
!525 = !DILocation(line: 184, column: 1, scope: !526)
!526 = !DILexicalBlockFile(scope: !485, file: !202, discriminator: 1)
!527 = distinct !DISubprogram(name: "ipvs_syncd_cmd", scope: !202, file: !202, line: 249, type: !528, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !62, !530, !62, !203, !203}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lvs_syncd_config", file: !533, line: 56, size: 1344, align: 64, elements: !534)
!533 = !DIFile(filename: "./../include/ipvswrapper.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!534 = !{!535, !536, !861, !862, !863, !864, !865, !866}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !532, file: !533, line: 57, baseType: !149, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp", scope: !532, file: !533, line: 58, baseType: !537, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_t", file: !4, line: 310, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_t", file: !4, line: 183, size: 7040, align: 64, elements: !540)
!540 = !{!541, !542, !543, !591, !611, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !692, !693, !694, !695, !696, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !860}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !539, file: !4, line: 184, baseType: !67, size: 16, align: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !539, file: !4, line: 185, baseType: !149, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !539, file: !4, line: 186, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_sgroup_t", file: !4, line: 133, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_sgroup", file: !4, line: 109, size: 1024, align: 64, elements: !547)
!547 = !{!548, !549, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !585, !586, !587, !588, !589, !590}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !546, file: !4, line: 110, baseType: !149, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "iname", scope: !546, file: !4, line: 111, baseType: !550, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !552, line: 34, baseType: !553)
!552 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !552, line: 30, size: 128, align: 64, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !553, file: !552, line: 31, baseType: !80, size: 32, align: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !553, file: !552, line: 32, baseType: !80, size: 32, align: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !553, file: !552, line: 33, baseType: !558, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_instances", scope: !546, file: !4, line: 112, baseType: !118, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_fault", scope: !546, file: !4, line: 113, baseType: !80, size: 32, align: 32, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num_member_init", scope: !546, file: !4, line: 114, baseType: !80, size: 32, align: 32, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !4, line: 115, baseType: !62, size: 32, align: 32, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sgroup_tracking_weight", scope: !546, file: !4, line: 116, baseType: !203, size: 8, align: 8, offset: 288)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !546, file: !4, line: 119, baseType: !118, size: 64, align: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !546, file: !4, line: 120, baseType: !118, size: 64, align: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !546, file: !4, line: 121, baseType: !118, size: 64, align: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "track_bfd", scope: !546, file: !4, line: 122, baseType: !118, size: 64, align: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !546, file: !4, line: 125, baseType: !203, size: 8, align: 8, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !546, file: !4, line: 126, baseType: !570, size: 64, align: 64, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !572, line: 65, baseType: !573)
!572 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !572, line: 59, size: 192, align: 64, elements: !574)
!574 = !{!575, !577, !578, !579, !582}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !573, file: !572, line: 60, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !573, file: !572, line: 61, baseType: !62, size: 32, align: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !572, line: 62, baseType: !62, size: 32, align: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !573, file: !572, line: 63, baseType: !580, size: 32, align: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !581, line: 80, baseType: !345)
!581 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !573, file: !572, line: 64, baseType: !583, size: 32, align: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !581, line: 65, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !174, line: 126, baseType: !80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !546, file: !4, line: 127, baseType: !570, size: 64, align: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !546, file: !4, line: 128, baseType: !570, size: 64, align: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !546, file: !4, line: 129, baseType: !570, size: 64, align: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !546, file: !4, line: 130, baseType: !570, size: 64, align: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !546, file: !4, line: 131, baseType: !62, size: 32, align: 32, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !546, file: !4, line: 132, baseType: !62, size: 32, align: 32, offset: 992)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !539, file: !4, line: 187, baseType: !592, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "vrrp_stats", file: !4, line: 169, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vrrp_stats", file: !4, line: 136, size: 768, align: 64, elements: !595)
!595 = !{!596, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "advert_rcvd", scope: !594, file: !4, line: 137, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !73, line: 55, baseType: !195)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "advert_sent", scope: !594, file: !4, line: 138, baseType: !79, size: 32, align: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "become_master", scope: !594, file: !4, line: 140, baseType: !79, size: 32, align: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "release_master", scope: !594, file: !4, line: 141, baseType: !79, size: 32, align: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "packet_len_err", scope: !594, file: !4, line: 143, baseType: !597, size: 64, align: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "advert_interval_err", scope: !594, file: !4, line: 144, baseType: !597, size: 64, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ip_ttl_err", scope: !594, file: !4, line: 145, baseType: !597, size: 64, align: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_type_rcvd", scope: !594, file: !4, line: 146, baseType: !597, size: 64, align: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list_err", scope: !594, file: !4, line: 147, baseType: !597, size: 64, align: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_authtype", scope: !594, file: !4, line: 149, baseType: !79, size: 32, align: 32, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "authtype_mismatch", scope: !594, file: !4, line: 151, baseType: !79, size: 32, align: 32, offset: 544)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "auth_failure", scope: !594, file: !4, line: 152, baseType: !79, size: 32, align: 32, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_rcvd", scope: !594, file: !4, line: 155, baseType: !597, size: 64, align: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pri_zero_sent", scope: !594, file: !4, line: 156, baseType: !597, size: 64, align: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ifp", scope: !539, file: !4, line: 188, baseType: !612, size: 64, align: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "interface_t", file: !117, line: 111, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_interface", file: !117, line: 76, size: 1792, align: 64, elements: !615)
!615 = !{!616, !618, !620, !621, !622, !623, !624, !625, !626, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !663, !664, !665, !666, !667, !668, !669, !670}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ifname", scope: !614, file: !117, line: 77, baseType: !617, size: 128, align: 8)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, align: 8, elements: !101)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !614, file: !117, line: 78, baseType: !619, size: 32, align: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ifindex_t", file: !117, line: 62, baseType: !79)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !614, file: !117, line: 79, baseType: !75, size: 32, align: 32, offset: 160)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !614, file: !117, line: 80, baseType: !93, size: 128, align: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ifi_flags", scope: !614, file: !117, line: 81, baseType: !80, size: 32, align: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !614, file: !117, line: 82, baseType: !203, size: 8, align: 8, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mtu", scope: !614, file: !117, line: 83, baseType: !79, size: 32, align: 32, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !614, file: !117, line: 84, baseType: !69, size: 16, align: 16, offset: 416)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr", scope: !614, file: !117, line: 85, baseType: !627, size: 256, align: 8, offset: 432)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 256, align: 8, elements: !630)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !581, line: 33, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !174, line: 30, baseType: !83)
!630 = !{!631}
!631 = !DISubrange(count: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_bcast", scope: !614, file: !117, line: 86, baseType: !627, size: 256, align: 8, offset: 688)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "hw_addr_len", scope: !614, file: !117, line: 87, baseType: !193, size: 64, align: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !614, file: !117, line: 88, baseType: !62, size: 32, align: 32, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vmac", scope: !614, file: !117, line: 90, baseType: !203, size: 8, align: 8, offset: 1056)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifindex", scope: !614, file: !117, line: 91, baseType: !619, size: 32, align: 32, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "base_ifp", scope: !614, file: !117, line: 92, baseType: !638, size: 64, align: 64, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifindex", scope: !614, file: !117, line: 94, baseType: !619, size: 32, align: 32, offset: 1216)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master_ifp", scope: !614, file: !117, line: 96, baseType: !638, size: 64, align: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vrf_master", scope: !614, file: !117, line: 97, baseType: !203, size: 8, align: 8, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !614, file: !117, line: 100, baseType: !643, size: 64, align: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "garp_delay_t", file: !117, line: 73, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_garp_delay", file: !117, line: 65, size: 704, align: 64, elements: !646)
!646 = !{!647, !657, !658, !659, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "garp_interval", scope: !645, file: !117, line: 66, baseType: !648, size: 128, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !649, line: 31, baseType: !650)
!649 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !651, line: 30, size: 128, align: 64, elements: !652)
!651 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!652 = !{!653, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !650, file: !651, line: 32, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !174, line: 139, baseType: !175)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !650, file: !651, line: 33, baseType: !656, size: 64, align: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !174, line: 141, baseType: !175)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "have_garp_interval", scope: !645, file: !117, line: 67, baseType: !203, size: 8, align: 8, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gna_interval", scope: !645, file: !117, line: 68, baseType: !648, size: 128, align: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "have_gna_interval", scope: !645, file: !117, line: 69, baseType: !203, size: 8, align: 8, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "garp_next_time", scope: !645, file: !117, line: 70, baseType: !648, size: 128, align: 64, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gna_next_time", scope: !645, file: !117, line: 71, baseType: !648, size: 128, align: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aggregation_group", scope: !645, file: !117, line: 72, baseType: !62, size: 32, align: 32, offset: 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gna_router", scope: !614, file: !117, line: 101, baseType: !203, size: 8, align: 8, offset: 1472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_config", scope: !614, file: !117, line: 102, baseType: !62, size: 32, align: 32, offset: 1504)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_ignore_value", scope: !614, file: !117, line: 103, baseType: !79, size: 32, align: 32, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reset_arp_filter_value", scope: !614, file: !117, line: 104, baseType: !79, size: 32, align: 32, offset: 1568)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reset_promote_secondaries", scope: !614, file: !117, line: 105, baseType: !79, size: 32, align: 32, offset: 1600)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rp_filter", scope: !614, file: !117, line: 107, baseType: !80, size: 32, align: 32, offset: 1632)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries_already_set", scope: !614, file: !117, line: 109, baseType: !203, size: 8, align: 8, offset: 1664)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_vrrp", scope: !614, file: !117, line: 110, baseType: !118, size: 64, align: 64, offset: 1728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dont_track_primary", scope: !539, file: !4, line: 189, baseType: !203, size: 8, align: 8, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "linkbeat_use_polling", scope: !539, file: !4, line: 190, baseType: !203, size: 8, align: 8, offset: 328)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "skip_check_adv_addr", scope: !539, file: !4, line: 191, baseType: !203, size: 8, align: 8, offset: 336)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "strict_mode", scope: !539, file: !4, line: 193, baseType: !80, size: 32, align: 32, offset: 352)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_flags", scope: !539, file: !4, line: 195, baseType: !195, size: 64, align: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vmac_ifname", scope: !539, file: !4, line: 196, baseType: !617, size: 128, align: 8, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "track_ifp", scope: !539, file: !4, line: 198, baseType: !118, size: 64, align: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "track_script", scope: !539, file: !4, line: 199, baseType: !118, size: 64, align: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "track_file", scope: !539, file: !4, line: 200, baseType: !118, size: 64, align: 64, offset: 704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_if_fault", scope: !539, file: !4, line: 204, baseType: !80, size: 32, align: 32, offset: 768)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num_script_init", scope: !539, file: !4, line: 205, baseType: !80, size: 32, align: 32, offset: 800)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !539, file: !4, line: 206, baseType: !683, size: 1024, align: 64, offset: 832)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !684, line: 166, size: 1024, align: 64, elements: !685)
!684 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!685 = !{!686, !687, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !683, file: !684, line: 168, baseType: !67, size: 16, align: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !683, file: !684, line: 169, baseType: !688, size: 944, align: 8, offset: 16)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 944, align: 8, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 118)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !683, file: !684, line: 170, baseType: !195, size: 64, align: 64, offset: 960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "saddr_from_config", scope: !539, file: !4, line: 207, baseType: !203, size: 8, align: 8, offset: 1856)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "track_saddr", scope: !539, file: !4, line: 208, baseType: !203, size: 8, align: 8, offset: 1864)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_saddr", scope: !539, file: !4, line: 209, baseType: !683, size: 1024, align: 64, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_peer", scope: !539, file: !4, line: 210, baseType: !118, size: 64, align: 64, offset: 2944)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "unicast_chksum_compat", scope: !539, file: !4, line: 212, baseType: !697, size: 32, align: 32, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "chksum_compatibility_t", file: !4, line: 179, baseType: !3)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "master_saddr", scope: !539, file: !4, line: 214, baseType: !683, size: 1024, align: 64, offset: 3072)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "master_priority", scope: !539, file: !4, line: 215, baseType: !100, size: 8, align: 8, offset: 4096)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "last_transition", scope: !539, file: !4, line: 216, baseType: !648, size: 128, align: 64, offset: 4160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "garp_delay", scope: !539, file: !4, line: 217, baseType: !80, size: 32, align: 32, offset: 4288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh", scope: !539, file: !4, line: 218, baseType: !648, size: 128, align: 64, offset: 4352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_timer", scope: !539, file: !4, line: 219, baseType: !648, size: 128, align: 64, offset: 4480)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "garp_rep", scope: !539, file: !4, line: 220, baseType: !80, size: 32, align: 32, offset: 4608)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "garp_refresh_rep", scope: !539, file: !4, line: 221, baseType: !80, size: 32, align: 32, offset: 4640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_delay", scope: !539, file: !4, line: 222, baseType: !80, size: 32, align: 32, offset: 4672)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "garp_pending", scope: !539, file: !4, line: 223, baseType: !203, size: 8, align: 8, offset: 4704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gna_pending", scope: !539, file: !4, line: 224, baseType: !203, size: 8, align: 8, offset: 4712)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "garp_lower_prio_rep", scope: !539, file: !4, line: 225, baseType: !80, size: 32, align: 32, offset: 4736)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lower_prio_no_advert", scope: !539, file: !4, line: 226, baseType: !80, size: 32, align: 32, offset: 4768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "higher_prio_send_advert", scope: !539, file: !4, line: 227, baseType: !80, size: 32, align: 32, offset: 4800)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "vrid", scope: !539, file: !4, line: 228, baseType: !100, size: 8, align: 8, offset: 4832)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base_priority", scope: !539, file: !4, line: 229, baseType: !100, size: 8, align: 8, offset: 4840)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "effective_priority", scope: !539, file: !4, line: 230, baseType: !100, size: 8, align: 8, offset: 4848)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "total_priority", scope: !539, file: !4, line: 231, baseType: !62, size: 32, align: 32, offset: 4864)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vipset", scope: !539, file: !4, line: 233, baseType: !203, size: 8, align: 8, offset: 4896)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vip", scope: !539, file: !4, line: 234, baseType: !118, size: 64, align: 64, offset: 4928)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "evip", scope: !539, file: !4, line: 235, baseType: !118, size: 64, align: 64, offset: 4992)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "promote_secondaries", scope: !539, file: !4, line: 239, baseType: !203, size: 8, align: 8, offset: 5056)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "evip_add_ipv6", scope: !539, file: !4, line: 240, baseType: !203, size: 8, align: 8, offset: 5064)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vroutes", scope: !539, file: !4, line: 241, baseType: !118, size: 64, align: 64, offset: 5120)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vrules", scope: !539, file: !4, line: 242, baseType: !118, size: 64, align: 64, offset: 5184)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "adver_int", scope: !539, file: !4, line: 243, baseType: !80, size: 32, align: 32, offset: 5248)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "master_adver_int", scope: !539, file: !4, line: 244, baseType: !80, size: 32, align: 32, offset: 5280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "accept", scope: !539, file: !4, line: 249, baseType: !80, size: 32, align: 32, offset: 5312)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_rx_buf_size", scope: !539, file: !4, line: 252, baseType: !193, size: 64, align: 64, offset: 5376)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iptable_rules_set", scope: !539, file: !4, line: 254, baseType: !203, size: 8, align: 8, offset: 5440)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nopreempt", scope: !539, file: !4, line: 255, baseType: !203, size: 8, align: 8, offset: 5448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_delay", scope: !539, file: !4, line: 256, baseType: !195, size: 64, align: 64, offset: 5504)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_time", scope: !539, file: !4, line: 260, baseType: !648, size: 128, align: 64, offset: 5568)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !539, file: !4, line: 261, baseType: !62, size: 32, align: 32, offset: 5696)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "wantstate", scope: !539, file: !4, line: 265, baseType: !62, size: 32, align: 32, offset: 5728)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reload_master", scope: !539, file: !4, line: 266, baseType: !203, size: 8, align: 8, offset: 5760)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sockets", scope: !539, file: !4, line: 267, baseType: !735, size: 64, align: 64, offset: 5824)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_t", file: !737, line: 50, baseType: !738)
!737 = !DIFile(filename: "./../include/vrrp_sock.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sock", file: !737, line: 40, size: 1344, align: 64, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !738, file: !737, line: 41, baseType: !67, size: 16, align: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !738, file: !737, line: 42, baseType: !683, size: 1024, align: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !738, file: !737, line: 43, baseType: !62, size: 32, align: 32, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !738, file: !737, line: 44, baseType: !619, size: 32, align: 32, offset: 1120)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unicast", scope: !738, file: !737, line: 45, baseType: !203, size: 8, align: 8, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "fd_in", scope: !738, file: !737, line: 46, baseType: !62, size: 32, align: 32, offset: 1184)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fd_out", scope: !738, file: !737, line: 47, baseType: !62, size: 32, align: 32, offset: 1216)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_size", scope: !738, file: !737, line: 48, baseType: !62, size: 32, align: 32, offset: 1248)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !738, file: !737, line: 49, baseType: !749, size: 64, align: 64, offset: 1280)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !12, line: 99, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !12, line: 78, size: 768, align: 64, elements: !752)
!752 = !{!753, !754, !756, !809, !814, !815, !816, !827, !829}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !751, file: !12, line: 79, baseType: !195, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !12, line: 80, baseType: !755, size: 32, align: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !12, line: 63, baseType: !11)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !751, file: !12, line: 81, baseType: !757, size: 64, align: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !12, line: 112, size: 1280, align: 64, elements: !759)
!759 = !{!760, !772, !773, !774, !775, !783, !784, !785, !786, !787, !790, !801, !802, !803, !804, !805, !806, !807, !808}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !758, file: !12, line: 113, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !762, line: 109, baseType: !763)
!762 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !762, line: 106, size: 64, align: 64, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !763, file: !762, line: 108, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !762, line: 97, size: 192, align: 64, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !767, file: !762, line: 99, baseType: !195, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !767, file: !762, line: 102, baseType: !766, size: 64, align: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !767, file: !762, line: 103, baseType: !766, size: 64, align: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !758, file: !12, line: 114, baseType: !761, size: 64, align: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !758, file: !12, line: 115, baseType: !761, size: 64, align: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !758, file: !12, line: 116, baseType: !761, size: 64, align: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !758, file: !12, line: 117, baseType: !776, size: 128, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !777, line: 62, baseType: !778)
!777 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !777, line: 60, size: 128, align: 64, elements: !779)
!779 = !{!780, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !777, line: 61, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !777, line: 61, baseType: !781, size: 64, align: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !758, file: !12, line: 121, baseType: !776, size: 128, align: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !758, file: !12, line: 122, baseType: !776, size: 128, align: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !758, file: !12, line: 124, baseType: !118, size: 64, align: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !758, file: !12, line: 127, baseType: !761, size: 64, align: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !758, file: !12, line: 128, baseType: !788, size: 64, align: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64, align: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !12, line: 128, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !758, file: !12, line: 129, baseType: !791, size: 64, align: 64, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !12, line: 109, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !12, line: 102, size: 448, align: 64, elements: !794)
!794 = !{!795, !796, !797, !798, !799}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !793, file: !12, line: 103, baseType: !749, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !793, file: !12, line: 104, baseType: !749, size: 64, align: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !793, file: !12, line: 105, baseType: !195, size: 64, align: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !793, file: !12, line: 106, baseType: !62, size: 32, align: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !793, file: !12, line: 108, baseType: !800, size: 192, align: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !762, line: 104, baseType: !767)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !758, file: !12, line: 130, baseType: !80, size: 32, align: 32, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !758, file: !12, line: 131, baseType: !80, size: 32, align: 32, offset: 928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !758, file: !12, line: 132, baseType: !62, size: 32, align: 32, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !758, file: !12, line: 135, baseType: !62, size: 32, align: 32, offset: 992)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !758, file: !12, line: 136, baseType: !749, size: 64, align: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !758, file: !12, line: 146, baseType: !195, size: 64, align: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !758, file: !12, line: 147, baseType: !195, size: 64, align: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !758, file: !12, line: 148, baseType: !203, size: 8, align: 8, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !751, file: !12, line: 82, baseType: !810, size: 64, align: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!62, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !751, file: !12, line: 83, baseType: !130, size: 64, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !751, file: !12, line: 84, baseType: !648, size: 128, align: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !751, file: !12, line: 92, baseType: !817, size: 64, align: 32, offset: 448)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !12, line: 85, size: 64, align: 32, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !817, file: !12, line: 86, baseType: !62, size: 32, align: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !817, file: !12, line: 87, baseType: !62, size: 32, align: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !817, file: !12, line: 91, baseType: !822, size: 64, align: 32)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !817, file: !12, line: 88, size: 64, align: 32, elements: !823)
!823 = !{!824, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !822, file: !12, line: 89, baseType: !825, size: 32, align: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !581, line: 98, baseType: !343)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !822, file: !12, line: 90, baseType: !62, size: 32, align: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !751, file: !12, line: 93, baseType: !828, size: 64, align: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, scope: !751, file: !12, line: 95, baseType: !830, size: 192, align: 64, offset: 576)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !751, file: !12, line: 95, size: 192, align: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !830, file: !12, line: 96, baseType: !800, size: 192, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !12, line: 97, baseType: !776, size: 128, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !539, file: !4, line: 269, baseType: !62, size: 32, align: 32, offset: 5888)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !539, file: !4, line: 271, baseType: !62, size: 32, align: 32, offset: 5920)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !539, file: !4, line: 274, baseType: !62, size: 32, align: 32, offset: 5952)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "last_email_state", scope: !539, file: !4, line: 275, baseType: !62, size: 32, align: 32, offset: 5984)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "notify_exec", scope: !539, file: !4, line: 276, baseType: !203, size: 8, align: 8, offset: 6016)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "script_backup", scope: !539, file: !4, line: 277, baseType: !570, size: 64, align: 64, offset: 6080)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "script_master", scope: !539, file: !4, line: 278, baseType: !570, size: 64, align: 64, offset: 6144)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "script_fault", scope: !539, file: !4, line: 279, baseType: !570, size: 64, align: 64, offset: 6208)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "script_stop", scope: !539, file: !4, line: 280, baseType: !570, size: 64, align: 64, offset: 6272)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "script_master_rx_lower_pri", scope: !539, file: !4, line: 281, baseType: !570, size: 64, align: 64, offset: 6336)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !539, file: !4, line: 282, baseType: !570, size: 64, align: 64, offset: 6400)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ms_down_timer", scope: !539, file: !4, line: 285, baseType: !79, size: 32, align: 32, offset: 6464)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !539, file: !4, line: 286, baseType: !648, size: 128, align: 64, offset: 6528)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer", scope: !539, file: !4, line: 289, baseType: !149, size: 64, align: 64, offset: 6656)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "send_buffer_size", scope: !539, file: !4, line: 290, baseType: !193, size: 64, align: 64, offset: 6720)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_csum", scope: !539, file: !4, line: 291, baseType: !79, size: 32, align: 32, offset: 6784)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "auth_type", scope: !539, file: !4, line: 295, baseType: !100, size: 8, align: 8, offset: 6816)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "auth_data", scope: !539, file: !4, line: 296, baseType: !852, size: 64, align: 8, offset: 6824)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, align: 8, elements: !84)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ipsecah_counter", scope: !539, file: !4, line: 299, baseType: !854, size: 64, align: 32, offset: 6912)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_counter_t", file: !855, line: 58, baseType: !856)
!855 = !DIFile(filename: "./../include/vrrp_ipsecah.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_seq_counter", file: !855, line: 55, size: 64, align: 32, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !856, file: !855, line: 56, baseType: !203, size: 8, align: 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "seq_number", scope: !856, file: !855, line: 57, baseType: !79, size: 32, align: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ip_id", scope: !539, file: !4, line: 309, baseType: !62, size: 32, align: 32, offset: 6976)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "syncid", scope: !532, file: !533, line: 59, baseType: !80, size: 32, align: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sync_maxlen", scope: !532, file: !533, line: 61, baseType: !72, size: 16, align: 16, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_group", scope: !532, file: !533, line: 62, baseType: !683, size: 1024, align: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_port", scope: !532, file: !533, line: 63, baseType: !72, size: 16, align: 16, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !532, file: !533, line: 64, baseType: !100, size: 8, align: 8, offset: 1232)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vrrp_name", scope: !532, file: !533, line: 66, baseType: !149, size: 64, align: 64, offset: 1280)
!867 = !DILocalVariable(name: "cmd", arg: 1, scope: !527, file: !202, line: 249, type: !62)
!868 = !DILocation(line: 249, column: 20, scope: !527)
!869 = !DILocalVariable(name: "config", arg: 2, scope: !527, file: !202, line: 249, type: !530)
!870 = !DILocation(line: 249, column: 56, scope: !527)
!871 = !DILocalVariable(name: "state", arg: 3, scope: !527, file: !202, line: 249, type: !62)
!872 = !DILocation(line: 249, column: 68, scope: !527)
!873 = !DILocalVariable(name: "ignore_interface", arg: 4, scope: !527, file: !202, line: 249, type: !203)
!874 = !DILocation(line: 249, column: 79, scope: !527)
!875 = !DILocalVariable(name: "ignore_error", arg: 5, scope: !527, file: !202, line: 249, type: !203)
!876 = !DILocation(line: 249, column: 102, scope: !527)
!877 = !DILocalVariable(name: "daemonrule", scope: !527, file: !202, line: 251, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipvs_daemon_t", file: !496, line: 31, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_vs_daemon_app", file: !880, line: 126, size: 384, align: 32, elements: !881)
!880 = !DIFile(filename: "./../include/ip_vs.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !879, file: !880, line: 128, baseType: !62, size: 32, align: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ifn", scope: !879, file: !880, line: 131, baseType: !617, size: 128, align: 8, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "syncid", scope: !879, file: !880, line: 134, baseType: !62, size: 32, align: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sync_maxlen", scope: !879, file: !880, line: 138, baseType: !72, size: 16, align: 16, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_port", scope: !879, file: !880, line: 141, baseType: !72, size: 16, align: 16, offset: 208)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_ttl", scope: !879, file: !880, line: 144, baseType: !100, size: 8, align: 8, offset: 224)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_af", scope: !879, file: !880, line: 147, baseType: !72, size: 16, align: 16, offset: 240)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mcast_group", scope: !879, file: !880, line: 150, baseType: !890, size: 128, align: 32, offset: 256)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "nf_inet_addr", file: !891, line: 70, size: 128, align: 32, elements: !892)
!891 = !DIFile(filename: "/usr/include/linux/netfilter.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!892 = !{!893, !897, !900, !902, !903}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !890, file: !891, line: 71, baseType: !894, size: 128, align: 32)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, align: 32, elements: !107)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !896, line: 26, baseType: !80)
!896 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !890, file: !891, line: 72, baseType: !898, size: 32, align: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !899, line: 30, baseType: !895)
!899 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !890, file: !891, line: 73, baseType: !901, size: 128, align: 32)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 128, align: 32, elements: !107)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !890, file: !891, line: 74, baseType: !75, size: 32, align: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "in6", scope: !890, file: !891, line: 75, baseType: !93, size: 128, align: 32)
!904 = !DILocation(line: 251, column: 16, scope: !527)
!905 = !DILocation(line: 253, column: 2, scope: !527)
!906 = !DILocation(line: 256, column: 21, scope: !527)
!907 = !DILocation(line: 256, column: 13, scope: !527)
!908 = !DILocation(line: 256, column: 19, scope: !527)
!909 = !DILocation(line: 257, column: 6, scope: !910)
!910 = distinct !DILexicalBlock(scope: !527, file: !202, line: 257, column: 6)
!911 = !DILocation(line: 257, column: 6, scope: !527)
!912 = !DILocation(line: 258, column: 28, scope: !913)
!913 = distinct !DILexicalBlock(scope: !910, file: !202, line: 257, column: 14)
!914 = !DILocation(line: 258, column: 36, scope: !913)
!915 = !DILocation(line: 258, column: 14, scope: !913)
!916 = !DILocation(line: 258, column: 21, scope: !913)
!917 = !DILocation(line: 259, column: 8, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !202, line: 259, column: 7)
!919 = !DILocation(line: 259, column: 7, scope: !913)
!920 = !DILocation(line: 260, column: 22, scope: !918)
!921 = !DILocation(line: 260, column: 11, scope: !918)
!922 = !DILocation(line: 260, column: 33, scope: !918)
!923 = !DILocation(line: 260, column: 41, scope: !918)
!924 = !DILocation(line: 260, column: 4, scope: !918)
!925 = !DILocation(line: 262, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !913, file: !202, line: 262, column: 7)
!927 = !DILocation(line: 262, column: 11, scope: !926)
!928 = !DILocation(line: 262, column: 7, scope: !913)
!929 = !DILocation(line: 263, column: 8, scope: !930)
!930 = distinct !DILexicalBlock(scope: !931, file: !202, line: 263, column: 8)
!931 = distinct !DILexicalBlock(scope: !926, file: !202, line: 262, column: 31)
!932 = !DILocation(line: 263, column: 16, scope: !930)
!933 = !DILocation(line: 263, column: 8, scope: !931)
!934 = !DILocation(line: 264, column: 30, scope: !930)
!935 = !DILocation(line: 264, column: 38, scope: !930)
!936 = !DILocation(line: 264, column: 16, scope: !930)
!937 = !DILocation(line: 264, column: 28, scope: !930)
!938 = !DILocation(line: 264, column: 5, scope: !930)
!939 = !DILocation(line: 265, column: 8, scope: !940)
!940 = distinct !DILexicalBlock(scope: !931, file: !202, line: 265, column: 8)
!941 = !DILocation(line: 265, column: 16, scope: !940)
!942 = !DILocation(line: 265, column: 8, scope: !931)
!943 = !DILocation(line: 266, column: 29, scope: !940)
!944 = !DILocation(line: 266, column: 37, scope: !940)
!945 = !DILocation(line: 266, column: 16, scope: !940)
!946 = !DILocation(line: 266, column: 27, scope: !940)
!947 = !DILocation(line: 266, column: 5, scope: !940)
!948 = !DILocation(line: 267, column: 8, scope: !949)
!949 = distinct !DILexicalBlock(scope: !931, file: !202, line: 267, column: 8)
!950 = !DILocation(line: 267, column: 16, scope: !949)
!951 = !DILocation(line: 267, column: 8, scope: !931)
!952 = !DILocation(line: 268, column: 28, scope: !949)
!953 = !DILocation(line: 268, column: 36, scope: !949)
!954 = !DILocation(line: 268, column: 16, scope: !949)
!955 = !DILocation(line: 268, column: 26, scope: !949)
!956 = !DILocation(line: 268, column: 5, scope: !949)
!957 = !DILocation(line: 269, column: 8, scope: !958)
!958 = distinct !DILexicalBlock(scope: !931, file: !202, line: 269, column: 8)
!959 = !DILocation(line: 269, column: 16, scope: !958)
!960 = !DILocation(line: 269, column: 28, scope: !958)
!961 = !DILocation(line: 269, column: 38, scope: !958)
!962 = !DILocation(line: 269, column: 8, scope: !931)
!963 = !DILocation(line: 270, column: 16, scope: !964)
!964 = distinct !DILexicalBlock(scope: !958, file: !202, line: 269, column: 49)
!965 = !DILocation(line: 270, column: 25, scope: !964)
!966 = !DILocation(line: 271, column: 57, scope: !964)
!967 = !DILocation(line: 271, column: 65, scope: !964)
!968 = !DILocation(line: 271, column: 79, scope: !964)
!969 = !DILocation(line: 271, column: 88, scope: !964)
!970 = !DILocation(line: 271, column: 16, scope: !964)
!971 = !DILocation(line: 271, column: 28, scope: !964)
!972 = !DILocation(line: 271, column: 31, scope: !964)
!973 = !DILocation(line: 272, column: 4, scope: !964)
!974 = !DILocation(line: 273, column: 13, scope: !975)
!975 = distinct !DILexicalBlock(scope: !958, file: !202, line: 273, column: 13)
!976 = !DILocation(line: 273, column: 21, scope: !975)
!977 = !DILocation(line: 273, column: 33, scope: !975)
!978 = !DILocation(line: 273, column: 43, scope: !975)
!979 = !DILocation(line: 273, column: 13, scope: !958)
!980 = !DILocation(line: 274, column: 16, scope: !981)
!981 = distinct !DILexicalBlock(scope: !975, file: !202, line: 273, column: 55)
!982 = !DILocation(line: 274, column: 25, scope: !981)
!983 = !DILocation(line: 275, column: 24, scope: !981)
!984 = !DILocation(line: 275, column: 36, scope: !981)
!985 = !DILocation(line: 275, column: 5, scope: !981)
!986 = !DILocation(line: 275, column: 67, scope: !981)
!987 = !DILocation(line: 275, column: 75, scope: !981)
!988 = !DILocation(line: 275, column: 89, scope: !981)
!989 = !DILocation(line: 276, column: 4, scope: !981)
!990 = !DILocation(line: 277, column: 3, scope: !931)
!991 = !DILocation(line: 279, column: 2, scope: !913)
!992 = !DILocation(line: 282, column: 12, scope: !527)
!993 = !DILocation(line: 282, column: 41, scope: !527)
!994 = !DILocation(line: 282, column: 2, scope: !527)
!995 = !DILocation(line: 283, column: 1, scope: !527)
!996 = distinct !DISubprogram(name: "ipvs_talk", scope: !202, file: !202, line: 188, type: !997, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !218)
!997 = !DISubroutineType(types: !998)
!998 = !{!62, !62, !999, !1019, !1034, !203}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipvs_service_t", file: !496, line: 28, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ip_vs_service_app", file: !880, line: 44, size: 640, align: 32, elements: !1002)
