; ModuleID = './[inter]keepalived--check--check_api.o.i'
source_filename = "./[inter]keepalived--check--check_api.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._check_data = type { i8, %struct._ssl_data*, %struct._list*, %struct._list* }
%struct._ssl_data = type { i32, i32, %struct.ssl_ctx_st*, %struct.ssl_method_st*, i8*, i8*, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55, globals: !421)
!1 = !DIFile(filename: "[inter]keepalived--check--check_api.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !24, !40}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 44, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!27 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!28 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!29 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!30 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!31 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!32 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!33 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!34 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!35 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!36 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!37 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!38 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!39 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "global_bits", file: !41, line: 53, size: 32, align: 32, elements: !42)
!41 = !DIFile(filename: "../../lib/bitops.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!43 = !DIEnumerator(name: "LOG_CONSOLE_BIT", value: 0)
!44 = !DIEnumerator(name: "NO_SYSLOG_BIT", value: 1)
!45 = !DIEnumerator(name: "DONT_FORK_BIT", value: 2)
!46 = !DIEnumerator(name: "DUMP_CONF_BIT", value: 3)
!47 = !DIEnumerator(name: "DONT_RELEASE_VRRP_BIT", value: 4)
!48 = !DIEnumerator(name: "RELEASE_VIPS_BIT", value: 5)
!49 = !DIEnumerator(name: "DONT_RELEASE_IPVS_BIT", value: 6)
!50 = !DIEnumerator(name: "LOG_DETAIL_BIT", value: 7)
!51 = !DIEnumerator(name: "LOG_EXTRA_DETAIL_BIT", value: 8)
!52 = !DIEnumerator(name: "DONT_RESPAWN_BIT", value: 9)
!53 = !DIEnumerator(name: "LOG_ADDRESS_CHANGES", value: 10)
!54 = !DIEnumerator(name: "CONFIG_TEST_BIT", value: 11)
!55 = !{!56, !378, !398, !407, !65, !186, !79, !419, !420}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !58, line: 60, baseType: !59)
!58 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !58, line: 40, size: 1024, align: 64, elements: !60)
!60 = !{!61, !66, !132, !247, !251, !354, !355, !356, !357, !358, !359, !370, !371, !372, !373, !374, !375, !376, !377}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !59, file: !58, line: 41, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !59, file: !58, line: 42, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !65}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !72, line: 48, baseType: !73)
!72 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !74, line: 241, size: 1728, align: 64, elements: !75)
!74 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!75 = !{!76, !78, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !99, !100, !101, !102, !106, !108, !110, !114, !117, !119, !120, !121, !122, !123, !127, !128}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !74, line: 242, baseType: !77, size: 32, align: 32)
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !73, file: !74, line: 247, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !73, file: !74, line: 248, baseType: !79, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !73, file: !74, line: 249, baseType: !79, size: 64, align: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !73, file: !74, line: 250, baseType: !79, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !73, file: !74, line: 251, baseType: !79, size: 64, align: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !73, file: !74, line: 252, baseType: !79, size: 64, align: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !73, file: !74, line: 253, baseType: !79, size: 64, align: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !73, file: !74, line: 254, baseType: !79, size: 64, align: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !73, file: !74, line: 256, baseType: !79, size: 64, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !73, file: !74, line: 257, baseType: !79, size: 64, align: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !73, file: !74, line: 258, baseType: !79, size: 64, align: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !73, file: !74, line: 260, baseType: !92, size: 64, align: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !74, line: 156, size: 192, align: 64, elements: !94)
!94 = !{!95, !96, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !93, file: !74, line: 157, baseType: !92, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !93, file: !74, line: 158, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !93, file: !74, line: 162, baseType: !77, size: 32, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !73, file: !74, line: 262, baseType: !97, size: 64, align: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !73, file: !74, line: 264, baseType: !77, size: 32, align: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !73, file: !74, line: 268, baseType: !77, size: 32, align: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !73, file: !74, line: 270, baseType: !103, size: 64, align: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 131, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!105 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !73, file: !74, line: 274, baseType: !107, size: 16, align: 16, offset: 1024)
!107 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !73, file: !74, line: 275, baseType: !109, size: 8, align: 8, offset: 1040)
!109 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !73, file: !74, line: 276, baseType: !111, size: 8, align: 8, offset: 1048)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 8, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !73, file: !74, line: 280, baseType: !115, size: 64, align: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !74, line: 150, baseType: null)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !74, line: 289, baseType: !118, size: 64, align: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 132, baseType: !105)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !73, file: !74, line: 297, baseType: !65, size: 64, align: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !73, file: !74, line: 298, baseType: !65, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !73, file: !74, line: 299, baseType: !65, size: 64, align: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !73, file: !74, line: 300, baseType: !65, size: 64, align: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !73, file: !74, line: 302, baseType: !124, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 216, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !73, file: !74, line: 303, baseType: !77, size: 32, align: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !73, file: !74, line: 305, baseType: !129, size: 160, align: 8, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 160, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !59, file: !58, line: 43, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!77, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !138)
!138 = !{!139, !140, !142, !215, !216, !217, !227, !240, !242}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !4, line: 79, baseType: !126, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !4, line: 80, baseType: !141, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !137, file: !4, line: 81, baseType: !143, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !145)
!145 = !{!146, !158, !159, !160, !161, !169, !170, !171, !189, !190, !193, !206, !207, !208, !209, !210, !211, !212, !213}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !144, file: !4, line: 113, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !148, line: 109, baseType: !149)
!148 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !148, line: 106, size: 64, align: 64, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !149, file: !148, line: 108, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !148, line: 97, size: 192, align: 64, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !153, file: !148, line: 99, baseType: !126, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !153, file: !148, line: 102, baseType: !152, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !153, file: !148, line: 103, baseType: !152, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !144, file: !4, line: 114, baseType: !147, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !144, file: !4, line: 115, baseType: !147, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !144, file: !4, line: 116, baseType: !147, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !144, file: !4, line: 117, baseType: !162, size: 128, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !163, line: 62, baseType: !164)
!163 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !163, line: 60, size: 128, align: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !163, line: 61, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !163, line: 61, baseType: !167, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !144, file: !4, line: 121, baseType: !162, size: 128, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !144, file: !4, line: 122, baseType: !162, size: 128, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !144, file: !4, line: 124, baseType: !172, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !173, line: 31, baseType: !174)
!173 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !173, line: 39, size: 320, align: 64, elements: !176)
!176 = !{!177, !184, !185, !187, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !175, file: !173, line: 40, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !173, line: 33, size: 192, align: 64, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !173, line: 34, baseType: !178, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !173, line: 35, baseType: !178, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !173, line: 36, baseType: !65, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !175, file: !173, line: 41, baseType: !178, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !175, file: !173, line: 42, baseType: !186, size: 32, align: 32, offset: 128)
!186 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !175, file: !173, line: 43, baseType: !62, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !175, file: !173, line: 44, baseType: !67, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !144, file: !4, line: 127, baseType: !147, size: 64, align: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !144, file: !4, line: 128, baseType: !191, size: 64, align: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !144, file: !4, line: 129, baseType: !194, size: 64, align: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !197)
!197 = !{!198, !201, !202, !203, !204}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !196, file: !4, line: 103, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !137)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !196, file: !4, line: 104, baseType: !199, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !4, line: 105, baseType: !126, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !196, file: !4, line: 106, baseType: !77, size: 32, align: 32, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !196, file: !4, line: 108, baseType: !205, size: 192, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !148, line: 104, baseType: !153)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !144, file: !4, line: 130, baseType: !186, size: 32, align: 32, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !144, file: !4, line: 131, baseType: !186, size: 32, align: 32, offset: 928)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !144, file: !4, line: 132, baseType: !77, size: 32, align: 32, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !144, file: !4, line: 135, baseType: !77, size: 32, align: 32, offset: 992)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !144, file: !4, line: 136, baseType: !199, size: 64, align: 64, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !144, file: !4, line: 146, baseType: !126, size: 64, align: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !144, file: !4, line: 147, baseType: !126, size: 64, align: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !144, file: !4, line: 148, baseType: !214, size: 8, align: 8, offset: 1216)
!214 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !137, file: !4, line: 82, baseType: !133, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !137, file: !4, line: 83, baseType: !65, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !137, file: !4, line: 84, baseType: !218, size: 128, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !219, line: 31, baseType: !220)
!219 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !221, line: 30, size: 128, align: 64, elements: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!222 = !{!223, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !220, file: !221, line: 32, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 139, baseType: !105)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !220, file: !221, line: 33, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !104, line: 141, baseType: !105)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !137, file: !4, line: 92, baseType: !228, size: 64, align: 32, offset: 448)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !4, line: 85, size: 64, align: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !228, file: !4, line: 86, baseType: !77, size: 32, align: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !228, file: !4, line: 87, baseType: !77, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !228, file: !4, line: 91, baseType: !233, size: 64, align: 32)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !228, file: !4, line: 88, size: 64, align: 32, elements: !234)
!234 = !{!235, !239}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !233, file: !4, line: 89, baseType: !236, size: 32, align: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !237, line: 98, baseType: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !104, line: 133, baseType: !77)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !233, file: !4, line: 90, baseType: !77, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !137, file: !4, line: 93, baseType: !241, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !4, line: 95, baseType: !243, size: 192, align: 64, offset: 576)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !4, line: 95, size: 192, align: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !243, file: !4, line: 96, baseType: !205, size: 192, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !4, line: 97, baseType: !162, size: 128, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !59, file: !58, line: 44, baseType: !248, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!214, !65, !65}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !59, file: !58, line: 45, baseType: !252, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !254, line: 180, baseType: !255)
!254 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !254, line: 131, size: 2560, align: 64, elements: !256)
!256 = !{!257, !258, !266, !278, !281, !322, !324, !325, !326, !327, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !255, file: !254, line: 132, baseType: !79, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !255, file: !254, line: 133, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !254, line: 128, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !254, line: 124, size: 192, align: 64, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !261, file: !254, line: 125, baseType: !79, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !261, file: !254, line: 126, baseType: !172, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !261, file: !254, line: 127, baseType: !172, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !255, file: !254, line: 134, baseType: !267, size: 1024, align: 64, offset: 128)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !268, line: 166, size: 1024, align: 64, elements: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!269 = !{!270, !273, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !267, file: !268, line: 168, baseType: !271, size: 16, align: 16)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !272, line: 28, baseType: !107)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !267, file: !268, line: 169, baseType: !274, size: 944, align: 8, offset: 16)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 944, align: 8, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 118)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !267, file: !268, line: 170, baseType: !126, size: 64, align: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !255, file: !254, line: 135, baseType: !279, size: 32, align: 32, offset: 1152)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !280, line: 51, baseType: !186)
!280 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !255, file: !254, line: 136, baseType: !282, size: 64, align: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !254, line: 102, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !254, line: 62, size: 1920, align: 64, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !284, file: !254, line: 63, baseType: !267, size: 1024, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !284, file: !254, line: 64, baseType: !77, size: 32, align: 32, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !284, file: !254, line: 65, baseType: !77, size: 32, align: 32, offset: 1056)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !284, file: !254, line: 66, baseType: !77, size: 32, align: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !284, file: !254, line: 68, baseType: !186, size: 32, align: 32, offset: 1120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !284, file: !254, line: 69, baseType: !279, size: 32, align: 32, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !284, file: !254, line: 70, baseType: !279, size: 32, align: 32, offset: 1184)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !284, file: !254, line: 71, baseType: !77, size: 32, align: 32, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !284, file: !254, line: 74, baseType: !295, size: 64, align: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !297, line: 65, baseType: !298)
!297 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !297, line: 59, size: 192, align: 64, elements: !299)
!299 = !{!300, !302, !303, !304, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !298, file: !297, line: 60, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !298, file: !297, line: 61, baseType: !77, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !297, line: 62, baseType: !77, size: 32, align: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !298, file: !297, line: 63, baseType: !305, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !237, line: 80, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !104, line: 125, baseType: !186)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !298, file: !297, line: 64, baseType: !308, size: 32, align: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !237, line: 65, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !104, line: 126, baseType: !186)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !284, file: !254, line: 75, baseType: !295, size: 64, align: 64, offset: 1344)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !284, file: !254, line: 76, baseType: !77, size: 32, align: 32, offset: 1408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !284, file: !254, line: 77, baseType: !126, size: 64, align: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !284, file: !254, line: 78, baseType: !126, size: 64, align: 64, offset: 1536)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !284, file: !254, line: 79, baseType: !186, size: 32, align: 32, offset: 1600)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !284, file: !254, line: 80, baseType: !126, size: 64, align: 64, offset: 1664)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !284, file: !254, line: 81, baseType: !77, size: 32, align: 32, offset: 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !284, file: !254, line: 83, baseType: !214, size: 8, align: 8, offset: 1760)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !284, file: !254, line: 84, baseType: !186, size: 32, align: 32, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !284, file: !254, line: 85, baseType: !214, size: 8, align: 8, offset: 1824)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !284, file: !254, line: 86, baseType: !214, size: 8, align: 8, offset: 1832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !284, file: !254, line: 87, baseType: !79, size: 64, align: 64, offset: 1856)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !255, file: !254, line: 137, baseType: !323, size: 16, align: 16, offset: 1280)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !280, line: 49, baseType: !107)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !255, file: !254, line: 138, baseType: !323, size: 16, align: 16, offset: 1296)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !255, file: !254, line: 139, baseType: !214, size: 8, align: 8, offset: 1312)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !255, file: !254, line: 140, baseType: !77, size: 32, align: 32, offset: 1344)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !255, file: !254, line: 142, baseType: !328, size: 128, align: 8, offset: 1376)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 128, align: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !255, file: !254, line: 143, baseType: !279, size: 32, align: 32, offset: 1504)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !255, file: !254, line: 144, baseType: !279, size: 32, align: 32, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !255, file: !254, line: 146, baseType: !328, size: 128, align: 8, offset: 1568)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !255, file: !254, line: 148, baseType: !186, size: 32, align: 32, offset: 1696)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !255, file: !254, line: 149, baseType: !279, size: 32, align: 32, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !255, file: !254, line: 151, baseType: !79, size: 64, align: 64, offset: 1792)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !255, file: !254, line: 153, baseType: !77, size: 32, align: 32, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !255, file: !254, line: 154, baseType: !172, size: 64, align: 64, offset: 1920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !255, file: !254, line: 155, baseType: !77, size: 32, align: 32, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !255, file: !254, line: 156, baseType: !214, size: 8, align: 8, offset: 2016)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !255, file: !254, line: 157, baseType: !214, size: 8, align: 8, offset: 2024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !255, file: !254, line: 158, baseType: !214, size: 8, align: 8, offset: 2032)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !255, file: !254, line: 160, baseType: !126, size: 64, align: 64, offset: 2048)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !255, file: !254, line: 161, baseType: !126, size: 64, align: 64, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !255, file: !254, line: 162, baseType: !186, size: 32, align: 32, offset: 2176)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !255, file: !254, line: 163, baseType: !126, size: 64, align: 64, offset: 2240)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !255, file: !254, line: 164, baseType: !295, size: 64, align: 64, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !255, file: !254, line: 165, baseType: !295, size: 64, align: 64, offset: 2368)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !255, file: !254, line: 166, baseType: !186, size: 32, align: 32, offset: 2432)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !255, file: !254, line: 167, baseType: !186, size: 32, align: 32, offset: 2464)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !255, file: !254, line: 168, baseType: !77, size: 32, align: 32, offset: 2496)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !255, file: !254, line: 169, baseType: !214, size: 8, align: 8, offset: 2528)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !255, file: !254, line: 170, baseType: !214, size: 8, align: 8, offset: 2536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !59, file: !58, line: 46, baseType: !282, size: 64, align: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !58, line: 47, baseType: !65, size: 64, align: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !59, file: !58, line: 48, baseType: !214, size: 8, align: 8, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !59, file: !58, line: 49, baseType: !214, size: 8, align: 8, offset: 456)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !59, file: !58, line: 50, baseType: !214, size: 8, align: 8, offset: 464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !59, file: !58, line: 51, baseType: !360, size: 64, align: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !362, line: 50, baseType: !363)
!362 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !362, line: 42, size: 2240, align: 64, elements: !364)
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !363, file: !362, line: 43, baseType: !267, size: 1024, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !363, file: !362, line: 44, baseType: !267, size: 1024, align: 64, offset: 1024)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !363, file: !362, line: 45, baseType: !328, size: 128, align: 8, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !363, file: !362, line: 46, baseType: !186, size: 32, align: 32, offset: 2176)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !363, file: !362, line: 48, baseType: !186, size: 32, align: 32, offset: 2208)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !59, file: !58, line: 52, baseType: !77, size: 32, align: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !59, file: !58, line: 53, baseType: !126, size: 64, align: 64, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !59, file: !58, line: 54, baseType: !126, size: 64, align: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !59, file: !58, line: 55, baseType: !186, size: 32, align: 32, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !59, file: !58, line: 56, baseType: !126, size: 64, align: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !59, file: !58, line: 57, baseType: !186, size: 32, align: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !59, file: !58, line: 58, baseType: !186, size: 32, align: 32, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !59, file: !58, line: 59, baseType: !126, size: 64, align: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !381, line: 211, size: 128, align: 32, elements: !382)
!381 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !380, file: !381, line: 220, baseType: !384, size: 128, align: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !380, file: !381, line: 213, size: 128, align: 32, elements: !385)
!385 = !{!386, !390, !394}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !384, file: !381, line: 215, baseType: !387, size: 128, align: 8)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, align: 8, elements: !329)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !280, line: 48, baseType: !389)
!389 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !384, file: !381, line: 217, baseType: !391, size: 128, align: 16)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, align: 16, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !384, file: !381, line: 218, baseType: !395, size: 128, align: 32)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, align: 32, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 4)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !381, line: 254, size: 224, align: 32, elements: !400)
!400 = !{!401, !402, !404, !405, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !399, file: !381, line: 256, baseType: !271, size: 16, align: 16)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !399, file: !381, line: 257, baseType: !403, size: 16, align: 16, offset: 16)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !381, line: 119, baseType: !323)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !399, file: !381, line: 258, baseType: !279, size: 32, align: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !399, file: !381, line: 259, baseType: !380, size: 128, align: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !399, file: !381, line: 260, baseType: !279, size: 32, align: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !381, line: 239, size: 128, align: 32, elements: !409)
!409 = !{!410, !411, !412, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !408, file: !381, line: 241, baseType: !271, size: 16, align: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !408, file: !381, line: 242, baseType: !403, size: 16, align: 16, offset: 16)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !408, file: !381, line: 243, baseType: !413, size: 32, align: 32, offset: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !381, line: 31, size: 32, align: 32, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !413, file: !381, line: 33, baseType: !416, size: 32, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !381, line: 30, baseType: !279)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !408, file: !381, line: 246, baseType: !418, size: 64, align: 8, offset: 64)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, align: 8, elements: !392)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!421 = !{!422, !424}
!422 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !423, line: 150, type: !172, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!423 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!424 = distinct !DIGlobalVariable(name: "checkers_queue", scope: !0, file: !425, line: 53, type: !172, isLocal: false, isDefinition: true, variable: %struct._list** @checkers_queue)
!425 = !DIFile(filename: "check_api.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!426 = !{i32 2, !"Dwarf Version", i32 4}
!427 = !{i32 2, !"Debug Info Version", i32 3}
!428 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!429 = distinct !DISubprogram(name: "dump_connection_opts", scope: !425, file: !425, line: 82, type: !68, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!430 = !{}
!431 = !DILocalVariable(name: "fp", arg: 1, scope: !429, file: !425, line: 82, type: !70)
!432 = !DIExpression()
!433 = !DILocation(line: 82, column: 28, scope: !429)
!434 = !DILocalVariable(name: "data", arg: 2, scope: !429, file: !425, line: 82, type: !65)
!435 = !DILocation(line: 82, column: 38, scope: !429)
!436 = !DILocalVariable(name: "conn", scope: !429, file: !425, line: 84, type: !360)
!437 = !DILocation(line: 84, column: 15, scope: !429)
!438 = !DILocation(line: 84, column: 22, scope: !429)
!439 = !DILocation(line: 86, column: 13, scope: !429)
!440 = !DILocation(line: 86, column: 56, scope: !429)
!441 = !DILocation(line: 86, column: 62, scope: !429)
!442 = !DILocation(line: 86, column: 35, scope: !429)
!443 = !DILocation(line: 86, column: 2, scope: !444)
!444 = !DILexicalBlockFile(scope: !429, file: !425, discriminator: 1)
!445 = !DILocation(line: 87, column: 6, scope: !446)
!446 = distinct !DILexicalBlock(scope: !429, file: !425, line: 87, column: 6)
!447 = !DILocation(line: 87, column: 12, scope: !446)
!448 = !DILocation(line: 87, column: 19, scope: !446)
!449 = !DILocation(line: 87, column: 6, scope: !429)
!450 = !DILocation(line: 88, column: 14, scope: !446)
!451 = !DILocation(line: 88, column: 60, scope: !446)
!452 = !DILocation(line: 88, column: 66, scope: !446)
!453 = !DILocation(line: 88, column: 39, scope: !446)
!454 = !DILocation(line: 88, column: 3, scope: !455)
!455 = !DILexicalBlockFile(scope: !446, file: !425, discriminator: 1)
!456 = !DILocation(line: 88, column: 3, scope: !446)
!457 = !DILocation(line: 89, column: 6, scope: !458)
!458 = distinct !DILexicalBlock(scope: !429, file: !425, line: 89, column: 6)
!459 = !DILocation(line: 89, column: 12, scope: !458)
!460 = !DILocation(line: 89, column: 6, scope: !429)
!461 = !DILocation(line: 90, column: 14, scope: !458)
!462 = !DILocation(line: 90, column: 40, scope: !458)
!463 = !DILocation(line: 90, column: 46, scope: !458)
!464 = !DILocation(line: 90, column: 3, scope: !458)
!465 = !DILocation(line: 92, column: 6, scope: !466)
!466 = distinct !DILexicalBlock(scope: !429, file: !425, line: 92, column: 6)
!467 = !DILocation(line: 92, column: 12, scope: !466)
!468 = !DILocation(line: 92, column: 19, scope: !466)
!469 = !DILocation(line: 92, column: 6, scope: !429)
!470 = !DILocation(line: 93, column: 14, scope: !466)
!471 = !DILocation(line: 93, column: 36, scope: !466)
!472 = !DILocation(line: 93, column: 42, scope: !466)
!473 = !DILocation(line: 93, column: 3, scope: !466)
!474 = !DILocation(line: 95, column: 13, scope: !429)
!475 = !DILocation(line: 95, column: 38, scope: !429)
!476 = !DILocation(line: 95, column: 44, scope: !429)
!477 = !DILocation(line: 95, column: 57, scope: !429)
!478 = !DILocation(line: 95, column: 2, scope: !429)
!479 = !DILocation(line: 96, column: 1, scope: !429)
!480 = distinct !DISubprogram(name: "dump_checker_opts", scope: !425, file: !425, line: 99, type: !68, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!481 = !DILocalVariable(name: "fp", arg: 1, scope: !480, file: !425, line: 99, type: !70)
!482 = !DILocation(line: 99, column: 25, scope: !480)
!483 = !DILocalVariable(name: "data", arg: 2, scope: !480, file: !425, line: 99, type: !65)
!484 = !DILocation(line: 99, column: 35, scope: !480)
!485 = !DILocalVariable(name: "checker", scope: !480, file: !425, line: 101, type: !56)
!486 = !DILocation(line: 101, column: 13, scope: !480)
!487 = !DILocation(line: 101, column: 23, scope: !480)
!488 = !DILocalVariable(name: "conn", scope: !480, file: !425, line: 102, type: !360)
!489 = !DILocation(line: 102, column: 15, scope: !480)
!490 = !DILocation(line: 102, column: 22, scope: !480)
!491 = !DILocation(line: 102, column: 31, scope: !480)
!492 = !DILocation(line: 104, column: 6, scope: !493)
!493 = distinct !DILexicalBlock(scope: !480, file: !425, line: 104, column: 6)
!494 = !DILocation(line: 104, column: 6, scope: !480)
!495 = !DILocation(line: 105, column: 14, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !425, line: 104, column: 12)
!497 = !DILocation(line: 105, column: 3, scope: !496)
!498 = !DILocation(line: 106, column: 24, scope: !496)
!499 = !DILocation(line: 106, column: 28, scope: !496)
!500 = !DILocation(line: 106, column: 3, scope: !496)
!501 = !DILocation(line: 107, column: 2, scope: !496)
!502 = !DILocation(line: 109, column: 13, scope: !480)
!503 = !DILocation(line: 109, column: 35, scope: !480)
!504 = !DILocation(line: 109, column: 44, scope: !480)
!505 = !DILocation(line: 109, column: 2, scope: !480)
!506 = !DILocation(line: 110, column: 13, scope: !480)
!507 = !DILocation(line: 110, column: 41, scope: !480)
!508 = !DILocation(line: 110, column: 50, scope: !480)
!509 = !DILocation(line: 110, column: 61, scope: !480)
!510 = !DILocation(line: 110, column: 2, scope: !480)
!511 = !DILocation(line: 111, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !480, file: !425, line: 111, column: 6)
!513 = !DILocation(line: 111, column: 15, scope: !512)
!514 = !DILocation(line: 111, column: 6, scope: !480)
!515 = !DILocation(line: 112, column: 14, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !425, line: 111, column: 22)
!517 = !DILocation(line: 112, column: 42, scope: !516)
!518 = !DILocation(line: 112, column: 51, scope: !516)
!519 = !DILocation(line: 112, column: 3, scope: !516)
!520 = !DILocation(line: 113, column: 14, scope: !516)
!521 = !DILocation(line: 113, column: 43, scope: !516)
!522 = !DILocation(line: 113, column: 52, scope: !516)
!523 = !DILocation(line: 113, column: 71, scope: !516)
!524 = !DILocation(line: 113, column: 3, scope: !516)
!525 = !DILocation(line: 114, column: 2, scope: !516)
!526 = !DILocation(line: 115, column: 13, scope: !480)
!527 = !DILocation(line: 115, column: 36, scope: !480)
!528 = !DILocation(line: 115, column: 45, scope: !480)
!529 = !DILocation(line: 115, column: 52, scope: !480)
!530 = !DILocation(line: 115, column: 2, scope: !480)
!531 = !DILocation(line: 116, column: 1, scope: !480)
!532 = distinct !DISubprogram(name: "queue_checker", scope: !425, file: !425, line: 120, type: !533, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!533 = !DISubroutineType(types: !534)
!534 = !{!56, !62, !67, !535, !248, !65, !360}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!77, !199}
!538 = !DILocalVariable(name: "free_func", arg: 1, scope: !532, file: !425, line: 120, type: !62)
!539 = !DILocation(line: 120, column: 22, scope: !532)
!540 = !DILocalVariable(name: "dump_func", arg: 2, scope: !532, file: !425, line: 120, type: !67)
!541 = !DILocation(line: 120, column: 50, scope: !532)
!542 = !DILocalVariable(name: "launch", arg: 3, scope: !532, file: !425, line: 121, type: !535)
!543 = !DILocation(line: 121, column: 16, scope: !532)
!544 = !DILocalVariable(name: "compare", arg: 4, scope: !532, file: !425, line: 122, type: !248)
!545 = !DILocation(line: 122, column: 16, scope: !532)
!546 = !DILocalVariable(name: "data", arg: 5, scope: !532, file: !425, line: 123, type: !65)
!547 = !DILocation(line: 123, column: 16, scope: !532)
!548 = !DILocalVariable(name: "co", arg: 6, scope: !532, file: !425, line: 124, type: !360)
!549 = !DILocation(line: 124, column: 23, scope: !532)
!550 = !DILocalVariable(name: "vs", scope: !532, file: !425, line: 126, type: !252)
!551 = !DILocation(line: 126, column: 20, scope: !532)
!552 = !DILocation(line: 126, column: 27, scope: !532)
!553 = !DILocation(line: 126, column: 39, scope: !532)
!554 = !DILocation(line: 126, column: 44, scope: !532)
!555 = !DILocation(line: 126, column: 50, scope: !532)
!556 = !DILocation(line: 126, column: 25, scope: !532)
!557 = !DILocalVariable(name: "rs", scope: !532, file: !425, line: 127, type: !282)
!558 = !DILocation(line: 127, column: 17, scope: !532)
!559 = !DILocation(line: 127, column: 24, scope: !532)
!560 = !DILocation(line: 127, column: 28, scope: !532)
!561 = !DILocation(line: 127, column: 33, scope: !532)
!562 = !DILocation(line: 127, column: 39, scope: !532)
!563 = !DILocation(line: 127, column: 22, scope: !532)
!564 = !DILocalVariable(name: "checker", scope: !532, file: !425, line: 128, type: !56)
!565 = !DILocation(line: 128, column: 13, scope: !532)
!566 = !DILocation(line: 128, column: 38, scope: !532)
!567 = !DILocation(line: 128, column: 23, scope: !532)
!568 = !DILocation(line: 131, column: 6, scope: !569)
!569 = distinct !DILexicalBlock(scope: !532, file: !425, line: 131, column: 6)
!570 = !DILocation(line: 131, column: 6, scope: !532)
!571 = !DILocation(line: 132, column: 3, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !425, line: 131, column: 10)
!573 = !DILocation(line: 132, column: 7, scope: !572)
!574 = !DILocation(line: 132, column: 13, scope: !572)
!575 = !DILocation(line: 132, column: 17, scope: !572)
!576 = !DILocation(line: 133, column: 3, scope: !572)
!577 = !DILocation(line: 133, column: 7, scope: !572)
!578 = !DILocation(line: 133, column: 21, scope: !572)
!579 = !DILocation(line: 134, column: 2, scope: !572)
!580 = !DILocation(line: 136, column: 23, scope: !532)
!581 = !DILocation(line: 136, column: 2, scope: !532)
!582 = !DILocation(line: 136, column: 11, scope: !532)
!583 = !DILocation(line: 136, column: 21, scope: !532)
!584 = !DILocation(line: 137, column: 23, scope: !532)
!585 = !DILocation(line: 137, column: 2, scope: !532)
!586 = !DILocation(line: 137, column: 11, scope: !532)
!587 = !DILocation(line: 137, column: 21, scope: !532)
!588 = !DILocation(line: 138, column: 20, scope: !532)
!589 = !DILocation(line: 138, column: 2, scope: !532)
!590 = !DILocation(line: 138, column: 11, scope: !532)
!591 = !DILocation(line: 138, column: 18, scope: !532)
!592 = !DILocation(line: 139, column: 21, scope: !532)
!593 = !DILocation(line: 139, column: 2, scope: !532)
!594 = !DILocation(line: 139, column: 11, scope: !532)
!595 = !DILocation(line: 139, column: 19, scope: !532)
!596 = !DILocation(line: 140, column: 16, scope: !532)
!597 = !DILocation(line: 140, column: 2, scope: !532)
!598 = !DILocation(line: 140, column: 11, scope: !532)
!599 = !DILocation(line: 140, column: 14, scope: !532)
!600 = !DILocation(line: 141, column: 16, scope: !532)
!601 = !DILocation(line: 141, column: 2, scope: !532)
!602 = !DILocation(line: 141, column: 11, scope: !532)
!603 = !DILocation(line: 141, column: 14, scope: !532)
!604 = !DILocation(line: 142, column: 18, scope: !532)
!605 = !DILocation(line: 142, column: 2, scope: !532)
!606 = !DILocation(line: 142, column: 11, scope: !532)
!607 = !DILocation(line: 142, column: 16, scope: !532)
!608 = !DILocation(line: 143, column: 16, scope: !532)
!609 = !DILocation(line: 143, column: 2, scope: !532)
!610 = !DILocation(line: 143, column: 11, scope: !532)
!611 = !DILocation(line: 143, column: 14, scope: !532)
!612 = !DILocation(line: 144, column: 2, scope: !532)
!613 = !DILocation(line: 144, column: 11, scope: !532)
!614 = !DILocation(line: 144, column: 19, scope: !532)
!615 = !DILocation(line: 145, column: 2, scope: !532)
!616 = !DILocation(line: 145, column: 11, scope: !532)
!617 = !DILocation(line: 145, column: 17, scope: !532)
!618 = !DILocation(line: 146, column: 2, scope: !532)
!619 = !DILocation(line: 146, column: 11, scope: !532)
!620 = !DILocation(line: 146, column: 22, scope: !532)
!621 = !DILocation(line: 147, column: 2, scope: !532)
!622 = !DILocation(line: 147, column: 11, scope: !532)
!623 = !DILocation(line: 147, column: 18, scope: !532)
!624 = !DILocation(line: 148, column: 2, scope: !532)
!625 = !DILocation(line: 148, column: 11, scope: !532)
!626 = !DILocation(line: 148, column: 17, scope: !532)
!627 = !DILocation(line: 149, column: 2, scope: !532)
!628 = !DILocation(line: 149, column: 11, scope: !532)
!629 = !DILocation(line: 149, column: 30, scope: !532)
!630 = !DILocation(line: 150, column: 2, scope: !532)
!631 = !DILocation(line: 150, column: 11, scope: !532)
!632 = !DILocation(line: 150, column: 20, scope: !532)
!633 = !DILocation(line: 151, column: 2, scope: !532)
!634 = !DILocation(line: 151, column: 11, scope: !532)
!635 = !DILocation(line: 151, column: 17, scope: !532)
!636 = !DILocation(line: 152, column: 2, scope: !532)
!637 = !DILocation(line: 152, column: 11, scope: !532)
!638 = !DILocation(line: 152, column: 38, scope: !532)
!639 = !DILocation(line: 153, column: 2, scope: !532)
!640 = !DILocation(line: 153, column: 11, scope: !532)
!641 = !DILocation(line: 153, column: 25, scope: !532)
!642 = !DILocation(line: 156, column: 11, scope: !532)
!643 = !DILocation(line: 156, column: 27, scope: !532)
!644 = !DILocation(line: 156, column: 2, scope: !532)
!645 = !DILocation(line: 158, column: 9, scope: !532)
!646 = !DILocation(line: 158, column: 2, scope: !532)
!647 = distinct !DISubprogram(name: "dequeue_new_checker", scope: !425, file: !425, line: 162, type: !648, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!648 = !DISubroutineType(types: !649)
!649 = !{null}
!650 = !DILocalVariable(name: "checker", scope: !647, file: !425, line: 164, type: !56)
!651 = !DILocation(line: 164, column: 13, scope: !647)
!652 = !DILocation(line: 164, column: 25, scope: !647)
!653 = !DILocation(line: 164, column: 41, scope: !647)
!654 = !DILocation(line: 164, column: 48, scope: !647)
!655 = !DILocation(line: 164, column: 23, scope: !647)
!656 = !DILocation(line: 166, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !647, file: !425, line: 166, column: 6)
!658 = !DILocation(line: 166, column: 16, scope: !657)
!659 = !DILocation(line: 166, column: 6, scope: !647)
!660 = !DILocation(line: 167, column: 21, scope: !657)
!661 = !DILocation(line: 167, column: 3, scope: !657)
!662 = !DILocation(line: 169, column: 20, scope: !647)
!663 = !DILocation(line: 169, column: 36, scope: !647)
!664 = !DILocation(line: 169, column: 52, scope: !647)
!665 = !DILocation(line: 169, column: 2, scope: !647)
!666 = !DILocation(line: 170, column: 1, scope: !647)
!667 = distinct !DISubprogram(name: "check_conn_opts", scope: !425, file: !425, line: 173, type: !668, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!668 = !DISubroutineType(types: !669)
!669 = !{!214, !360}
!670 = !DILocalVariable(name: "co", arg: 1, scope: !667, file: !425, line: 173, type: !360)
!671 = !DILocation(line: 173, column: 30, scope: !667)
!672 = !DILocation(line: 175, column: 6, scope: !673)
!673 = distinct !DILexicalBlock(scope: !667, file: !425, line: 175, column: 6)
!674 = !DILocation(line: 175, column: 10, scope: !673)
!675 = !DILocation(line: 175, column: 14, scope: !673)
!676 = !DILocation(line: 175, column: 24, scope: !673)
!677 = !DILocation(line: 175, column: 35, scope: !673)
!678 = !DILocalVariable(name: "__a", scope: !679, file: !425, line: 176, type: !378)
!679 = distinct !DILexicalBlock(scope: !673, file: !425, line: 176, column: 21)
!680 = !DILocation(line: 176, column: 46, scope: !679)
!681 = !DILocation(line: 176, column: 30, scope: !679)
!682 = !DILocation(line: 176, column: 34, scope: !679)
!683 = !DILocation(line: 176, column: 40, scope: !679)
!684 = !DILocation(line: 176, column: 9, scope: !679)
!685 = !DILocation(line: 176, column: 14, scope: !679)
!686 = !DILocation(line: 176, column: 22, scope: !679)
!687 = !DILocation(line: 176, column: 39, scope: !679)
!688 = !DILocation(line: 176, column: 37, scope: !679)
!689 = !DILocation(line: 176, column: 62, scope: !690)
!690 = !DILexicalBlockFile(scope: !679, file: !425, discriminator: 1)
!691 = !DILocation(line: 176, column: 59, scope: !679)
!692 = !DILocation(line: 176, column: 23, scope: !679)
!693 = !DILocation(line: 176, column: 82, scope: !679)
!694 = !DILocation(line: 176, column: 20, scope: !673)
!695 = !DILocation(line: 176, column: 73, scope: !673)
!696 = !DILocation(line: 177, column: 7, scope: !673)
!697 = !DILocation(line: 177, column: 11, scope: !673)
!698 = !DILocation(line: 175, column: 6, scope: !699)
!699 = !DILexicalBlockFile(scope: !667, file: !425, discriminator: 1)
!700 = !DILocation(line: 178, column: 115, scope: !701)
!701 = distinct !DILexicalBlock(scope: !673, file: !425, line: 177, column: 23)
!702 = !DILocation(line: 178, column: 119, scope: !701)
!703 = !DILocation(line: 178, column: 97, scope: !701)
!704 = !DILocation(line: 178, column: 3, scope: !705)
!705 = !DILexicalBlockFile(scope: !701, file: !425, discriminator: 1)
!706 = !DILocation(line: 179, column: 3, scope: !701)
!707 = !DILocation(line: 182, column: 2, scope: !667)
!708 = !DILocation(line: 183, column: 1, scope: !667)
!709 = distinct !DISubprogram(name: "compare_conn_opts", scope: !425, file: !425, line: 186, type: !710, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!710 = !DISubroutineType(types: !711)
!711 = !{!214, !360, !360}
!712 = !DILocalVariable(name: "a", arg: 1, scope: !709, file: !425, line: 186, type: !360)
!713 = !DILocation(line: 186, column: 32, scope: !709)
!714 = !DILocalVariable(name: "b", arg: 2, scope: !709, file: !425, line: 186, type: !360)
!715 = !DILocation(line: 186, column: 48, scope: !709)
!716 = !DILocation(line: 188, column: 6, scope: !717)
!717 = distinct !DILexicalBlock(scope: !709, file: !425, line: 188, column: 6)
!718 = !DILocation(line: 188, column: 11, scope: !717)
!719 = !DILocation(line: 188, column: 8, scope: !717)
!720 = !DILocation(line: 188, column: 6, scope: !709)
!721 = !DILocation(line: 189, column: 3, scope: !717)
!722 = !DILocation(line: 191, column: 7, scope: !723)
!723 = distinct !DILexicalBlock(scope: !709, file: !425, line: 191, column: 6)
!724 = !DILocation(line: 191, column: 9, scope: !723)
!725 = !DILocation(line: 191, column: 13, scope: !726)
!726 = !DILexicalBlockFile(scope: !723, file: !425, discriminator: 1)
!727 = !DILocation(line: 191, column: 6, scope: !726)
!728 = !DILocation(line: 192, column: 3, scope: !723)
!729 = !DILocation(line: 193, column: 26, scope: !730)
!730 = distinct !DILexicalBlock(scope: !709, file: !425, line: 193, column: 6)
!731 = !DILocation(line: 193, column: 29, scope: !730)
!732 = !DILocation(line: 193, column: 35, scope: !730)
!733 = !DILocation(line: 193, column: 38, scope: !730)
!734 = !DILocation(line: 193, column: 7, scope: !730)
!735 = !DILocation(line: 193, column: 6, scope: !709)
!736 = !DILocation(line: 194, column: 3, scope: !730)
!737 = !DILocation(line: 195, column: 26, scope: !738)
!738 = distinct !DILexicalBlock(scope: !709, file: !425, line: 195, column: 6)
!739 = !DILocation(line: 195, column: 29, scope: !738)
!740 = !DILocation(line: 195, column: 38, scope: !738)
!741 = !DILocation(line: 195, column: 41, scope: !738)
!742 = !DILocation(line: 195, column: 7, scope: !738)
!743 = !DILocation(line: 195, column: 6, scope: !709)
!744 = !DILocation(line: 196, column: 3, scope: !738)
!745 = !DILocation(line: 197, column: 13, scope: !746)
!746 = distinct !DILexicalBlock(scope: !709, file: !425, line: 197, column: 6)
!747 = !DILocation(line: 197, column: 16, scope: !746)
!748 = !DILocation(line: 197, column: 25, scope: !746)
!749 = !DILocation(line: 197, column: 28, scope: !746)
!750 = !DILocation(line: 197, column: 6, scope: !746)
!751 = !DILocation(line: 197, column: 6, scope: !709)
!752 = !DILocation(line: 198, column: 3, scope: !746)
!753 = !DILocation(line: 199, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !709, file: !425, line: 199, column: 6)
!755 = !DILocation(line: 199, column: 9, scope: !754)
!756 = !DILocation(line: 199, column: 26, scope: !754)
!757 = !DILocation(line: 199, column: 29, scope: !754)
!758 = !DILocation(line: 199, column: 23, scope: !754)
!759 = !DILocation(line: 199, column: 6, scope: !709)
!760 = !DILocation(line: 200, column: 3, scope: !754)
!761 = !DILocation(line: 202, column: 6, scope: !762)
!762 = distinct !DILexicalBlock(scope: !709, file: !425, line: 202, column: 6)
!763 = !DILocation(line: 202, column: 9, scope: !762)
!764 = !DILocation(line: 202, column: 19, scope: !762)
!765 = !DILocation(line: 202, column: 22, scope: !762)
!766 = !DILocation(line: 202, column: 16, scope: !762)
!767 = !DILocation(line: 202, column: 6, scope: !709)
!768 = !DILocation(line: 203, column: 3, scope: !762)
!769 = !DILocation(line: 206, column: 2, scope: !709)
!770 = !DILocation(line: 207, column: 1, scope: !709)
!771 = distinct !DISubprogram(name: "sockstorage_equal", scope: !772, file: !772, line: 69, type: !773, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!772 = !DIFile(filename: "../../lib/utils.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!773 = !DISubroutineType(types: !774)
!774 = !{!214, !775, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!777 = !DILocalVariable(name: "s1", arg: 1, scope: !771, file: !772, line: 69, type: !775)
!778 = !DILocation(line: 69, column: 68, scope: !771)
!779 = !DILocalVariable(name: "s2", arg: 2, scope: !771, file: !772, line: 70, type: !775)
!780 = !DILocation(line: 70, column: 40, scope: !771)
!781 = !DILocation(line: 72, column: 6, scope: !782)
!782 = distinct !DILexicalBlock(scope: !771, file: !772, line: 72, column: 6)
!783 = !DILocation(line: 72, column: 10, scope: !782)
!784 = !DILocation(line: 72, column: 23, scope: !782)
!785 = !DILocation(line: 72, column: 27, scope: !782)
!786 = !DILocation(line: 72, column: 20, scope: !782)
!787 = !DILocation(line: 72, column: 6, scope: !771)
!788 = !DILocation(line: 73, column: 3, scope: !782)
!789 = !DILocation(line: 75, column: 6, scope: !790)
!790 = distinct !DILexicalBlock(scope: !771, file: !772, line: 75, column: 6)
!791 = !DILocation(line: 75, column: 10, scope: !790)
!792 = !DILocation(line: 75, column: 20, scope: !790)
!793 = !DILocation(line: 75, column: 6, scope: !771)
!794 = !DILocalVariable(name: "a1", scope: !795, file: !772, line: 76, type: !398)
!795 = distinct !DILexicalBlock(scope: !790, file: !772, line: 75, column: 32)
!796 = !DILocation(line: 76, column: 24, scope: !795)
!797 = !DILocation(line: 76, column: 53, scope: !795)
!798 = !DILocation(line: 76, column: 29, scope: !795)
!799 = !DILocalVariable(name: "a2", scope: !795, file: !772, line: 77, type: !398)
!800 = !DILocation(line: 77, column: 24, scope: !795)
!801 = !DILocation(line: 77, column: 53, scope: !795)
!802 = !DILocation(line: 77, column: 29, scope: !795)
!803 = !DILocation(line: 80, column: 25, scope: !804)
!804 = distinct !DILexicalBlock(scope: !795, file: !772, line: 80, column: 7)
!805 = !DILocation(line: 80, column: 29, scope: !804)
!806 = !DILocation(line: 80, column: 41, scope: !804)
!807 = !DILocation(line: 80, column: 45, scope: !804)
!808 = !DILocation(line: 80, column: 7, scope: !804)
!809 = !DILocation(line: 80, column: 56, scope: !804)
!810 = !DILocation(line: 81, column: 8, scope: !804)
!811 = !DILocation(line: 81, column: 12, scope: !804)
!812 = !DILocation(line: 81, column: 25, scope: !804)
!813 = !DILocation(line: 81, column: 29, scope: !804)
!814 = !DILocation(line: 81, column: 22, scope: !804)
!815 = !DILocation(line: 80, column: 7, scope: !816)
!816 = !DILexicalBlockFile(scope: !795, file: !772, discriminator: 1)
!817 = !DILocation(line: 82, column: 4, scope: !804)
!818 = !DILocation(line: 83, column: 2, scope: !795)
!819 = !DILocation(line: 83, column: 13, scope: !820)
!820 = !DILexicalBlockFile(scope: !821, file: !772, discriminator: 1)
!821 = distinct !DILexicalBlock(scope: !790, file: !772, line: 83, column: 13)
!822 = !DILocation(line: 83, column: 17, scope: !820)
!823 = !DILocation(line: 83, column: 27, scope: !820)
!824 = !DILocalVariable(name: "a1", scope: !825, file: !772, line: 84, type: !407)
!825 = distinct !DILexicalBlock(scope: !821, file: !772, line: 83, column: 38)
!826 = !DILocation(line: 84, column: 23, scope: !825)
!827 = !DILocation(line: 84, column: 51, scope: !825)
!828 = !DILocation(line: 84, column: 28, scope: !825)
!829 = !DILocalVariable(name: "a2", scope: !825, file: !772, line: 85, type: !407)
!830 = !DILocation(line: 85, column: 23, scope: !825)
!831 = !DILocation(line: 85, column: 51, scope: !825)
!832 = !DILocation(line: 85, column: 28, scope: !825)
!833 = !DILocation(line: 87, column: 8, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !772, line: 87, column: 7)
!835 = !DILocation(line: 87, column: 12, scope: !834)
!836 = !DILocation(line: 87, column: 21, scope: !834)
!837 = !DILocation(line: 87, column: 31, scope: !834)
!838 = !DILocation(line: 87, column: 35, scope: !834)
!839 = !DILocation(line: 87, column: 44, scope: !834)
!840 = !DILocation(line: 87, column: 28, scope: !834)
!841 = !DILocation(line: 87, column: 52, scope: !834)
!842 = !DILocation(line: 88, column: 8, scope: !834)
!843 = !DILocation(line: 88, column: 12, scope: !834)
!844 = !DILocation(line: 88, column: 24, scope: !834)
!845 = !DILocation(line: 88, column: 28, scope: !834)
!846 = !DILocation(line: 88, column: 21, scope: !834)
!847 = !DILocation(line: 87, column: 7, scope: !848)
!848 = !DILexicalBlockFile(scope: !825, file: !772, discriminator: 1)
!849 = !DILocation(line: 89, column: 4, scope: !834)
!850 = !DILocation(line: 90, column: 2, scope: !825)
!851 = !DILocation(line: 90, column: 13, scope: !852)
!852 = !DILexicalBlockFile(scope: !853, file: !772, discriminator: 1)
!853 = distinct !DILexicalBlock(scope: !821, file: !772, line: 90, column: 13)
!854 = !DILocation(line: 90, column: 17, scope: !852)
!855 = !DILocation(line: 90, column: 27, scope: !852)
!856 = !DILocation(line: 91, column: 3, scope: !853)
!857 = !DILocation(line: 93, column: 2, scope: !771)
!858 = !DILocation(line: 94, column: 1, scope: !771)
!859 = distinct !DISubprogram(name: "checker_set_dst_port", scope: !425, file: !425, line: 210, type: !860, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !862, !323}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!863 = !DILocalVariable(name: "dst", arg: 1, scope: !859, file: !425, line: 210, type: !862)
!864 = !DILocation(line: 210, column: 47, scope: !859)
!865 = !DILocalVariable(name: "port", arg: 2, scope: !859, file: !425, line: 210, type: !323)
!866 = !DILocation(line: 210, column: 61, scope: !859)
!867 = !DILocation(line: 214, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !859, file: !425, line: 214, column: 6)
!869 = !DILocation(line: 214, column: 11, scope: !868)
!870 = !DILocation(line: 214, column: 21, scope: !868)
!871 = !DILocation(line: 214, column: 6, scope: !859)
!872 = !DILocalVariable(name: "addr6", scope: !873, file: !425, line: 215, type: !398)
!873 = distinct !DILexicalBlock(scope: !868, file: !425, line: 214, column: 33)
!874 = !DILocation(line: 215, column: 24, scope: !873)
!875 = !DILocation(line: 215, column: 56, scope: !873)
!876 = !DILocation(line: 215, column: 32, scope: !873)
!877 = !DILocation(line: 216, column: 22, scope: !873)
!878 = !DILocation(line: 216, column: 3, scope: !873)
!879 = !DILocation(line: 216, column: 10, scope: !873)
!880 = !DILocation(line: 216, column: 20, scope: !873)
!881 = !DILocation(line: 217, column: 2, scope: !873)
!882 = !DILocalVariable(name: "addr4", scope: !883, file: !425, line: 218, type: !407)
!883 = distinct !DILexicalBlock(scope: !868, file: !425, line: 217, column: 9)
!884 = !DILocation(line: 218, column: 23, scope: !883)
!885 = !DILocation(line: 218, column: 54, scope: !883)
!886 = !DILocation(line: 218, column: 31, scope: !883)
!887 = !DILocation(line: 219, column: 21, scope: !883)
!888 = !DILocation(line: 219, column: 3, scope: !883)
!889 = !DILocation(line: 219, column: 10, scope: !883)
!890 = !DILocation(line: 219, column: 19, scope: !883)
!891 = !DILocation(line: 221, column: 1, scope: !859)
!892 = distinct !DISubprogram(name: "install_checker_common_keywords", scope: !425, file: !425, line: 397, type: !893, isLocal: false, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !214}
!895 = !DILocalVariable(name: "connection_keywords", arg: 1, scope: !892, file: !425, line: 397, type: !214)
!896 = !DILocation(line: 397, column: 37, scope: !892)
!897 = !DILocation(line: 399, column: 6, scope: !898)
!898 = distinct !DILexicalBlock(scope: !892, file: !425, line: 399, column: 6)
!899 = !DILocation(line: 399, column: 6, scope: !892)
!900 = !DILocation(line: 400, column: 3, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !425, line: 399, column: 27)
!902 = !DILocation(line: 401, column: 3, scope: !901)
!903 = !DILocation(line: 402, column: 3, scope: !901)
!904 = !DILocation(line: 403, column: 3, scope: !901)
!905 = !DILocation(line: 404, column: 3, scope: !901)
!906 = !DILocation(line: 405, column: 3, scope: !901)
!907 = !DILocation(line: 407, column: 3, scope: !901)
!908 = !DILocation(line: 409, column: 2, scope: !901)
!909 = !DILocation(line: 410, column: 2, scope: !892)
!910 = !DILocation(line: 411, column: 2, scope: !892)
!911 = !DILocation(line: 412, column: 2, scope: !892)
!912 = !DILocation(line: 413, column: 2, scope: !892)
!913 = !DILocation(line: 414, column: 2, scope: !892)
!914 = !DILocation(line: 415, column: 1, scope: !892)
!915 = distinct !DISubprogram(name: "co_ip_handler", scope: !425, file: !425, line: 225, type: !916, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !920, line: 34, baseType: !921)
!920 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !920, line: 30, size: 128, align: 64, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !921, file: !920, line: 31, baseType: !186, size: 32, align: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !921, file: !920, line: 32, baseType: !186, size: 32, align: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !921, file: !920, line: 33, baseType: !926, size: 64, align: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!927 = !DILocalVariable(name: "strvec", arg: 1, scope: !915, file: !425, line: 225, type: !918)
!928 = !DILocation(line: 225, column: 25, scope: !915)
!929 = !DILocalVariable(name: "co", scope: !915, file: !425, line: 227, type: !360)
!930 = !DILocation(line: 227, column: 15, scope: !915)
!931 = !DILocation(line: 227, column: 38, scope: !915)
!932 = !DILocation(line: 227, column: 55, scope: !915)
!933 = !DILocation(line: 227, column: 61, scope: !915)
!934 = !DILocation(line: 227, column: 22, scope: !915)
!935 = !DILocation(line: 227, column: 70, scope: !915)
!936 = !DILocation(line: 229, column: 35, scope: !937)
!937 = distinct !DILexicalBlock(scope: !915, file: !425, line: 229, column: 6)
!938 = !DILocation(line: 229, column: 23, scope: !937)
!939 = !DILocation(line: 229, column: 53, scope: !937)
!940 = !DILocation(line: 229, column: 57, scope: !937)
!941 = !DILocation(line: 229, column: 6, scope: !942)
!942 = !DILexicalBlockFile(scope: !937, file: !425, discriminator: 1)
!943 = !DILocation(line: 229, column: 6, scope: !937)
!944 = !DILocation(line: 229, column: 6, scope: !915)
!945 = !DILocation(line: 230, column: 109, scope: !937)
!946 = !DILocation(line: 230, column: 97, scope: !937)
!947 = !DILocation(line: 230, column: 3, scope: !942)
!948 = !DILocation(line: 230, column: 3, scope: !937)
!949 = !DILocation(line: 231, column: 11, scope: !950)
!950 = distinct !DILexicalBlock(scope: !937, file: !425, line: 231, column: 11)
!951 = !DILocation(line: 231, column: 15, scope: !950)
!952 = !DILocation(line: 231, column: 22, scope: !950)
!953 = !DILocation(line: 231, column: 32, scope: !950)
!954 = !DILocation(line: 231, column: 44, scope: !950)
!955 = !DILocation(line: 232, column: 4, scope: !950)
!956 = !DILocation(line: 232, column: 8, scope: !950)
!957 = !DILocation(line: 232, column: 15, scope: !950)
!958 = !DILocation(line: 232, column: 28, scope: !950)
!959 = !DILocation(line: 232, column: 32, scope: !950)
!960 = !DILocation(line: 232, column: 36, scope: !950)
!961 = !DILocation(line: 232, column: 25, scope: !950)
!962 = !DILocation(line: 231, column: 11, scope: !942)
!963 = !DILocation(line: 233, column: 141, scope: !964)
!964 = distinct !DILexicalBlock(scope: !950, file: !425, line: 232, column: 47)
!965 = !DILocation(line: 233, column: 129, scope: !964)
!966 = !DILocation(line: 233, column: 3, scope: !967)
!967 = !DILexicalBlockFile(scope: !964, file: !425, discriminator: 1)
!968 = !DILocation(line: 234, column: 3, scope: !964)
!969 = !DILocation(line: 234, column: 7, scope: !964)
!970 = !DILocation(line: 234, column: 11, scope: !964)
!971 = !DILocation(line: 234, column: 21, scope: !964)
!972 = !DILocation(line: 235, column: 2, scope: !964)
!973 = !DILocation(line: 236, column: 1, scope: !915)
!974 = distinct !DISubprogram(name: "co_port_handler", scope: !425, file: !425, line: 240, type: !916, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!975 = !DILocalVariable(name: "strvec", arg: 1, scope: !974, file: !425, line: 240, type: !918)
!976 = !DILocation(line: 240, column: 27, scope: !974)
!977 = !DILocalVariable(name: "co", scope: !974, file: !425, line: 242, type: !360)
!978 = !DILocation(line: 242, column: 15, scope: !974)
!979 = !DILocation(line: 242, column: 38, scope: !974)
!980 = !DILocation(line: 242, column: 55, scope: !974)
!981 = !DILocation(line: 242, column: 61, scope: !974)
!982 = !DILocation(line: 242, column: 22, scope: !974)
!983 = !DILocation(line: 242, column: 70, scope: !974)
!984 = !DILocalVariable(name: "port", scope: !974, file: !425, line: 243, type: !186)
!985 = !DILocation(line: 243, column: 11, scope: !974)
!986 = !DILocation(line: 245, column: 28, scope: !987)
!987 = distinct !DILexicalBlock(scope: !974, file: !425, line: 245, column: 6)
!988 = !DILocation(line: 245, column: 7, scope: !987)
!989 = !DILocation(line: 245, column: 6, scope: !974)
!990 = !DILocation(line: 246, column: 102, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !425, line: 245, column: 62)
!992 = !DILocation(line: 246, column: 90, scope: !991)
!993 = !DILocation(line: 246, column: 3, scope: !994)
!994 = !DILexicalBlockFile(scope: !991, file: !425, discriminator: 1)
!995 = !DILocation(line: 247, column: 3, scope: !991)
!996 = !DILocation(line: 250, column: 24, scope: !974)
!997 = !DILocation(line: 250, column: 28, scope: !974)
!998 = !DILocation(line: 250, column: 39, scope: !974)
!999 = !DILocation(line: 250, column: 33, scope: !974)
!1000 = !DILocation(line: 250, column: 2, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !974, file: !425, discriminator: 1)
!1002 = !DILocation(line: 251, column: 1, scope: !974)
!1003 = !DILocation(line: 251, column: 1, scope: !1001)
!1004 = distinct !DISubprogram(name: "co_srcip_handler", scope: !425, file: !425, line: 255, type: !916, isLocal: true, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1005 = !DILocalVariable(name: "strvec", arg: 1, scope: !1004, file: !425, line: 255, type: !918)
!1006 = !DILocation(line: 255, column: 28, scope: !1004)
!1007 = !DILocalVariable(name: "co", scope: !1004, file: !425, line: 257, type: !360)
!1008 = !DILocation(line: 257, column: 15, scope: !1004)
!1009 = !DILocation(line: 257, column: 38, scope: !1004)
!1010 = !DILocation(line: 257, column: 55, scope: !1004)
!1011 = !DILocation(line: 257, column: 61, scope: !1004)
!1012 = !DILocation(line: 257, column: 22, scope: !1004)
!1013 = !DILocation(line: 257, column: 70, scope: !1004)
!1014 = !DILocation(line: 258, column: 35, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1004, file: !425, line: 258, column: 6)
!1016 = !DILocation(line: 258, column: 23, scope: !1015)
!1017 = !DILocation(line: 258, column: 53, scope: !1015)
!1018 = !DILocation(line: 258, column: 57, scope: !1015)
!1019 = !DILocation(line: 258, column: 6, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1015, file: !425, discriminator: 1)
!1021 = !DILocation(line: 258, column: 6, scope: !1015)
!1022 = !DILocation(line: 258, column: 6, scope: !1004)
!1023 = !DILocation(line: 259, column: 105, scope: !1015)
!1024 = !DILocation(line: 259, column: 93, scope: !1015)
!1025 = !DILocation(line: 259, column: 3, scope: !1020)
!1026 = !DILocation(line: 259, column: 3, scope: !1015)
!1027 = !DILocation(line: 260, column: 11, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1015, file: !425, line: 260, column: 11)
!1029 = !DILocation(line: 260, column: 15, scope: !1028)
!1030 = !DILocation(line: 260, column: 19, scope: !1028)
!1031 = !DILocation(line: 260, column: 29, scope: !1028)
!1032 = !DILocation(line: 260, column: 41, scope: !1028)
!1033 = !DILocation(line: 261, column: 4, scope: !1028)
!1034 = !DILocation(line: 261, column: 8, scope: !1028)
!1035 = !DILocation(line: 261, column: 12, scope: !1028)
!1036 = !DILocation(line: 261, column: 25, scope: !1028)
!1037 = !DILocation(line: 261, column: 29, scope: !1028)
!1038 = !DILocation(line: 261, column: 36, scope: !1028)
!1039 = !DILocation(line: 261, column: 22, scope: !1028)
!1040 = !DILocation(line: 260, column: 11, scope: !1020)
!1041 = !DILocation(line: 262, column: 141, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1028, file: !425, line: 261, column: 47)
!1043 = !DILocation(line: 262, column: 129, scope: !1042)
!1044 = !DILocation(line: 262, column: 3, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1042, file: !425, discriminator: 1)
!1046 = !DILocation(line: 263, column: 3, scope: !1042)
!1047 = !DILocation(line: 263, column: 7, scope: !1042)
!1048 = !DILocation(line: 263, column: 14, scope: !1042)
!1049 = !DILocation(line: 263, column: 24, scope: !1042)
!1050 = !DILocation(line: 264, column: 2, scope: !1042)
!1051 = !DILocation(line: 265, column: 1, scope: !1004)
!1052 = distinct !DISubprogram(name: "co_srcport_handler", scope: !425, file: !425, line: 269, type: !916, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1053 = !DILocalVariable(name: "strvec", arg: 1, scope: !1052, file: !425, line: 269, type: !918)
!1054 = !DILocation(line: 269, column: 30, scope: !1052)
!1055 = !DILocalVariable(name: "co", scope: !1052, file: !425, line: 271, type: !360)
!1056 = !DILocation(line: 271, column: 15, scope: !1052)
!1057 = !DILocation(line: 271, column: 38, scope: !1052)
!1058 = !DILocation(line: 271, column: 55, scope: !1052)
!1059 = !DILocation(line: 271, column: 61, scope: !1052)
!1060 = !DILocation(line: 271, column: 22, scope: !1052)
!1061 = !DILocation(line: 271, column: 70, scope: !1052)
!1062 = !DILocalVariable(name: "port", scope: !1052, file: !425, line: 272, type: !186)
!1063 = !DILocation(line: 272, column: 11, scope: !1052)
!1064 = !DILocation(line: 274, column: 28, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1052, file: !425, line: 274, column: 6)
!1066 = !DILocation(line: 274, column: 7, scope: !1065)
!1067 = !DILocation(line: 274, column: 6, scope: !1052)
!1068 = !DILocation(line: 275, column: 99, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !425, line: 274, column: 62)
!1070 = !DILocation(line: 275, column: 87, scope: !1069)
!1071 = !DILocation(line: 275, column: 3, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1069, file: !425, discriminator: 1)
!1073 = !DILocation(line: 276, column: 3, scope: !1069)
!1074 = !DILocation(line: 279, column: 24, scope: !1052)
!1075 = !DILocation(line: 279, column: 28, scope: !1052)
!1076 = !DILocation(line: 279, column: 42, scope: !1052)
!1077 = !DILocation(line: 279, column: 36, scope: !1052)
!1078 = !DILocation(line: 279, column: 2, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1052, file: !425, discriminator: 1)
!1080 = !DILocation(line: 280, column: 1, scope: !1052)
!1081 = !DILocation(line: 280, column: 1, scope: !1079)
!1082 = distinct !DISubprogram(name: "co_srcif_handler", scope: !425, file: !425, line: 284, type: !916, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1083 = !DILocalVariable(name: "strvec", arg: 1, scope: !1082, file: !425, line: 284, type: !918)
!1084 = !DILocation(line: 284, column: 28, scope: !1082)
!1085 = !DILocalVariable(name: "co", scope: !1082, file: !425, line: 287, type: !360)
!1086 = !DILocation(line: 287, column: 15, scope: !1082)
!1087 = !DILocation(line: 287, column: 38, scope: !1082)
!1088 = !DILocation(line: 287, column: 55, scope: !1082)
!1089 = !DILocation(line: 287, column: 61, scope: !1082)
!1090 = !DILocation(line: 287, column: 22, scope: !1082)
!1091 = !DILocation(line: 287, column: 70, scope: !1082)
!1092 = !DILocation(line: 289, column: 25, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !425, line: 289, column: 6)
!1094 = !DILocation(line: 289, column: 13, scope: !1093)
!1095 = !DILocation(line: 289, column: 6, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !1093, file: !425, discriminator: 1)
!1097 = !DILocation(line: 289, column: 37, scope: !1093)
!1098 = !DILocation(line: 289, column: 6, scope: !1082)
!1099 = !DILocation(line: 290, column: 109, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1093, file: !425, line: 289, column: 64)
!1101 = !DILocation(line: 290, column: 97, scope: !1100)
!1102 = !DILocation(line: 290, column: 3, scope: !1103)
!1103 = !DILexicalBlockFile(scope: !1100, file: !425, discriminator: 1)
!1104 = !DILocation(line: 291, column: 3, scope: !1100)
!1105 = !DILocation(line: 293, column: 9, scope: !1082)
!1106 = !DILocation(line: 293, column: 13, scope: !1082)
!1107 = !DILocation(line: 293, column: 34, scope: !1082)
!1108 = !DILocation(line: 293, column: 22, scope: !1082)
!1109 = !DILocation(line: 293, column: 2, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1082, file: !425, discriminator: 1)
!1111 = !DILocation(line: 294, column: 1, scope: !1082)
!1112 = !DILocation(line: 294, column: 1, scope: !1110)
!1113 = distinct !DISubprogram(name: "co_timeout_handler", scope: !425, file: !425, line: 298, type: !916, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1114 = !DILocalVariable(name: "strvec", arg: 1, scope: !1113, file: !425, line: 298, type: !918)
!1115 = !DILocation(line: 298, column: 30, scope: !1113)
!1116 = !DILocalVariable(name: "co", scope: !1113, file: !425, line: 300, type: !360)
!1117 = !DILocation(line: 300, column: 15, scope: !1113)
!1118 = !DILocation(line: 300, column: 38, scope: !1113)
!1119 = !DILocation(line: 300, column: 55, scope: !1113)
!1120 = !DILocation(line: 300, column: 61, scope: !1113)
!1121 = !DILocation(line: 300, column: 22, scope: !1113)
!1122 = !DILocation(line: 300, column: 70, scope: !1113)
!1123 = !DILocalVariable(name: "timer", scope: !1113, file: !425, line: 301, type: !126)
!1124 = !DILocation(line: 301, column: 16, scope: !1113)
!1125 = !DILocation(line: 303, column: 18, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1113, file: !425, line: 303, column: 6)
!1127 = !DILocation(line: 303, column: 7, scope: !1126)
!1128 = !DILocation(line: 303, column: 6, scope: !1113)
!1129 = !DILocation(line: 304, column: 106, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !425, line: 303, column: 67)
!1131 = !DILocation(line: 304, column: 94, scope: !1130)
!1132 = !DILocation(line: 304, column: 3, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1130, file: !425, discriminator: 1)
!1134 = !DILocation(line: 305, column: 3, scope: !1130)
!1135 = !DILocation(line: 307, column: 22, scope: !1113)
!1136 = !DILocation(line: 307, column: 2, scope: !1113)
!1137 = !DILocation(line: 307, column: 6, scope: !1113)
!1138 = !DILocation(line: 307, column: 20, scope: !1113)
!1139 = !DILocation(line: 308, column: 1, scope: !1113)
!1140 = !DILocation(line: 308, column: 1, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1113, file: !425, discriminator: 1)
!1142 = distinct !DISubprogram(name: "co_fwmark_handler", scope: !425, file: !425, line: 313, type: !916, isLocal: true, isDefinition: true, scopeLine: 314, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1143 = !DILocalVariable(name: "strvec", arg: 1, scope: !1142, file: !425, line: 313, type: !918)
!1144 = !DILocation(line: 313, column: 29, scope: !1142)
!1145 = !DILocalVariable(name: "co", scope: !1142, file: !425, line: 315, type: !360)
!1146 = !DILocation(line: 315, column: 15, scope: !1142)
!1147 = !DILocation(line: 315, column: 38, scope: !1142)
!1148 = !DILocation(line: 315, column: 55, scope: !1142)
!1149 = !DILocation(line: 315, column: 61, scope: !1142)
!1150 = !DILocation(line: 315, column: 22, scope: !1142)
!1151 = !DILocation(line: 315, column: 70, scope: !1142)
!1152 = !DILocalVariable(name: "fwmark", scope: !1142, file: !425, line: 316, type: !186)
!1153 = !DILocation(line: 316, column: 11, scope: !1142)
!1154 = !DILocation(line: 318, column: 28, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1142, file: !425, line: 318, column: 6)
!1156 = !DILocation(line: 318, column: 7, scope: !1155)
!1157 = !DILocation(line: 318, column: 6, scope: !1142)
!1158 = !DILocation(line: 319, column: 105, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !425, line: 318, column: 67)
!1160 = !DILocation(line: 319, column: 93, scope: !1159)
!1161 = !DILocation(line: 319, column: 3, scope: !1162)
!1162 = !DILexicalBlockFile(scope: !1159, file: !425, discriminator: 1)
!1163 = !DILocation(line: 320, column: 3, scope: !1159)
!1164 = !DILocation(line: 322, column: 15, scope: !1142)
!1165 = !DILocation(line: 322, column: 2, scope: !1142)
!1166 = !DILocation(line: 322, column: 6, scope: !1142)
!1167 = !DILocation(line: 322, column: 13, scope: !1142)
!1168 = !DILocation(line: 323, column: 1, scope: !1142)
!1169 = !DILocation(line: 323, column: 1, scope: !1170)
!1170 = !DILexicalBlockFile(scope: !1142, file: !425, discriminator: 1)
!1171 = distinct !DISubprogram(name: "retry_handler", scope: !425, file: !425, line: 327, type: !916, isLocal: true, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1172 = !DILocalVariable(name: "strvec", arg: 1, scope: !1171, file: !425, line: 327, type: !918)
!1173 = !DILocation(line: 327, column: 25, scope: !1171)
!1174 = !DILocalVariable(name: "checker", scope: !1171, file: !425, line: 329, type: !56)
!1175 = !DILocation(line: 329, column: 13, scope: !1171)
!1176 = !DILocation(line: 329, column: 26, scope: !1171)
!1177 = !DILocation(line: 329, column: 43, scope: !1171)
!1178 = !DILocation(line: 329, column: 49, scope: !1171)
!1179 = !DILocation(line: 329, column: 23, scope: !1171)
!1180 = !DILocalVariable(name: "retry", scope: !1171, file: !425, line: 330, type: !186)
!1181 = !DILocation(line: 330, column: 11, scope: !1171)
!1182 = !DILocation(line: 332, column: 28, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1171, file: !425, line: 332, column: 6)
!1184 = !DILocation(line: 332, column: 7, scope: !1183)
!1185 = !DILocation(line: 332, column: 6, scope: !1171)
!1186 = !DILocation(line: 333, column: 104, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !425, line: 332, column: 66)
!1188 = !DILocation(line: 333, column: 92, scope: !1187)
!1189 = !DILocation(line: 333, column: 3, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1187, file: !425, discriminator: 1)
!1191 = !DILocation(line: 334, column: 3, scope: !1187)
!1192 = !DILocation(line: 337, column: 19, scope: !1171)
!1193 = !DILocation(line: 337, column: 2, scope: !1171)
!1194 = !DILocation(line: 337, column: 11, scope: !1171)
!1195 = !DILocation(line: 337, column: 17, scope: !1171)
!1196 = !DILocation(line: 338, column: 1, scope: !1171)
!1197 = !DILocation(line: 338, column: 1, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1171, file: !425, discriminator: 1)
!1199 = distinct !DISubprogram(name: "delay_before_retry_handler", scope: !425, file: !425, line: 341, type: !916, isLocal: true, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1200 = !DILocalVariable(name: "strvec", arg: 1, scope: !1199, file: !425, line: 341, type: !918)
!1201 = !DILocation(line: 341, column: 38, scope: !1199)
!1202 = !DILocalVariable(name: "checker", scope: !1199, file: !425, line: 343, type: !56)
!1203 = !DILocation(line: 343, column: 13, scope: !1199)
!1204 = !DILocation(line: 343, column: 26, scope: !1199)
!1205 = !DILocation(line: 343, column: 43, scope: !1199)
!1206 = !DILocation(line: 343, column: 49, scope: !1199)
!1207 = !DILocation(line: 343, column: 23, scope: !1199)
!1208 = !DILocalVariable(name: "delay", scope: !1199, file: !425, line: 344, type: !186)
!1209 = !DILocation(line: 344, column: 11, scope: !1199)
!1210 = !DILocation(line: 346, column: 28, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1199, file: !425, line: 346, column: 6)
!1212 = !DILocation(line: 346, column: 7, scope: !1211)
!1213 = !DILocation(line: 346, column: 6, scope: !1199)
!1214 = !DILocation(line: 347, column: 117, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !425, line: 346, column: 77)
!1216 = !DILocation(line: 347, column: 105, scope: !1215)
!1217 = !DILocation(line: 347, column: 3, scope: !1218)
!1218 = !DILexicalBlockFile(scope: !1215, file: !425, discriminator: 1)
!1219 = !DILocation(line: 348, column: 3, scope: !1215)
!1220 = !DILocation(line: 351, column: 32, scope: !1199)
!1221 = !DILocation(line: 351, column: 38, scope: !1199)
!1222 = !DILocation(line: 351, column: 2, scope: !1199)
!1223 = !DILocation(line: 351, column: 11, scope: !1199)
!1224 = !DILocation(line: 351, column: 30, scope: !1199)
!1225 = !DILocation(line: 352, column: 1, scope: !1199)
!1226 = !DILocation(line: 352, column: 1, scope: !1227)
!1227 = !DILexicalBlockFile(scope: !1199, file: !425, discriminator: 1)
!1228 = distinct !DISubprogram(name: "warmup_handler", scope: !425, file: !425, line: 356, type: !916, isLocal: true, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !430)
!1229 = !DILocalVariable(name: "strvec", arg: 1, scope: !1228, file: !425, line: 356, type: !918)
!1230 = !DILocation(line: 356, column: 26, scope: !1228)
!1231 = !DILocalVariable(name: "checker", scope: !1228, file: !425, line: 358, type: !56)
!1232 = !DILocation(line: 358, column: 13, scope: !1228)
!1233 = !DILocation(line: 358, column: 26, scope: !1228)
!1234 = !DILocation(line: 358, column: 43, scope: !1228)
!1235 = !DILocation(line: 358, column: 49, scope: !1228)
!1236 = !DILocation(line: 358, column: 23, scope: !1228)
!1237 = !DILocalVariable(name: "warmup", scope: !1228, file: !425, line: 359, type: !186)
!1238 = !DILocation(line: 359, column: 11, scope: !1228)
!1239 = !DILocation(line: 361, column: 28, scope: !1240)
