; ModuleID = './[inter]keepalived--check--check_misc.o.i'
source_filename = "./[inter]keepalived--check--check_misc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._misc_checker = type { %struct._notify_script, i64, i8, i32, %struct.timeval }
%struct._notify_script = type { i8**, i32, i32, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55, globals: !389)
!1 = !DIFile(filename: "[inter]keepalived--check--check_misc.o.i", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!2 = !{!3, !24, !31, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../lib/scheduler.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 45, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "SCRIPT_STATE_IDLE", value: 0)
!28 = !DIEnumerator(name: "SCRIPT_STATE_RUNNING", value: 1)
!29 = !DIEnumerator(name: "SCRIPT_STATE_REQUESTING_TERMINATION", value: 2)
!30 = !DIEnumerator(name: "SCRIPT_STATE_FORCING_TERMINATION", value: 3)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 44, size: 32, align: 32, elements: !33)
!32 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!34 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!35 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!36 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!37 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!38 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!39 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!40 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!41 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!42 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!43 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!44 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!45 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!46 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 57, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!51 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!52 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!53 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!54 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!55 = !{!56, !57, !100, !68, !147, !84}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "misc_checker_t", file: !59, line: 42, baseType: !60)
!59 = !DIFile(filename: "./../include/check_misc.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_checker", file: !59, line: 36, size: 448, align: 64, elements: !61)
!61 = !{!62, !83, !85, !87, !89}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !60, file: !59, line: 37, baseType: !63, size: 192, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !25, line: 65, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !25, line: 59, size: 192, align: 64, elements: !65)
!65 = !{!66, !70, !72, !73, !79}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !64, file: !25, line: 60, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !64, file: !25, line: 61, baseType: !71, size: 32, align: 32, offset: 64)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !25, line: 62, baseType: !71, size: 32, align: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !64, file: !25, line: 63, baseType: !74, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !75, line: 67, baseType: !76)
!75 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !77, line: 125, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!78 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !64, file: !25, line: 64, baseType: !80, size: 32, align: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !81, line: 65, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !77, line: 126, baseType: !78)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !60, file: !59, line: 38, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic", scope: !60, file: !59, line: 39, baseType: !86, size: 8, align: 8, offset: 256)
!86 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !60, file: !59, line: 40, baseType: !88, size: 32, align: 32, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "script_state_t", file: !25, line: 50, baseType: !24)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "last_ran", scope: !60, file: !59, line: 41, baseType: !90, size: 128, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !91, line: 31, baseType: !92)
!91 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !93, line: 30, size: 128, align: 64, elements: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!94 = !{!95, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !92, file: !93, line: 32, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !77, line: 139, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !92, file: !93, line: 33, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !77, line: 141, baseType: !97)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !102, line: 60, baseType: !103)
!102 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !102, line: 40, size: 1024, align: 64, elements: !104)
!104 = !{!105, !109, !169, !272, !276, !365, !366, !367, !368, !369, !370, !381, !382, !383, !384, !385, !386, !387, !388}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !103, file: !102, line: 41, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !56}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !103, file: !102, line: 42, baseType: !110, size: 64, align: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !56}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !115, line: 48, baseType: !116)
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !117, line: 241, size: 1728, align: 64, elements: !118)
!117 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !139, !140, !141, !142, !144, !146, !148, !152, !155, !157, !158, !159, !160, !161, !164, !165}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !116, file: !117, line: 242, baseType: !71, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !116, file: !117, line: 247, baseType: !68, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !116, file: !117, line: 248, baseType: !68, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !116, file: !117, line: 249, baseType: !68, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !116, file: !117, line: 250, baseType: !68, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !116, file: !117, line: 251, baseType: !68, size: 64, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !116, file: !117, line: 252, baseType: !68, size: 64, align: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !116, file: !117, line: 253, baseType: !68, size: 64, align: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !116, file: !117, line: 254, baseType: !68, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !116, file: !117, line: 256, baseType: !68, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !116, file: !117, line: 257, baseType: !68, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !116, file: !117, line: 258, baseType: !68, size: 64, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !116, file: !117, line: 260, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !117, line: 156, size: 192, align: 64, elements: !134)
!134 = !{!135, !136, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !133, file: !117, line: 157, baseType: !132, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !133, file: !117, line: 158, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !133, file: !117, line: 162, baseType: !71, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !116, file: !117, line: 262, baseType: !137, size: 64, align: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !116, file: !117, line: 264, baseType: !71, size: 32, align: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !116, file: !117, line: 268, baseType: !71, size: 32, align: 32, offset: 928)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !116, file: !117, line: 270, baseType: !143, size: 64, align: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !77, line: 131, baseType: !97)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !116, file: !117, line: 274, baseType: !145, size: 16, align: 16, offset: 1024)
!145 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !116, file: !117, line: 275, baseType: !147, size: 8, align: 8, offset: 1040)
!147 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !116, file: !117, line: 276, baseType: !149, size: 8, align: 8, offset: 1048)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, align: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 1)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !116, file: !117, line: 280, baseType: !153, size: 64, align: 64, offset: 1088)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !117, line: 150, baseType: null)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !116, file: !117, line: 289, baseType: !156, size: 64, align: 64, offset: 1152)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !77, line: 132, baseType: !97)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !116, file: !117, line: 297, baseType: !56, size: 64, align: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !116, file: !117, line: 298, baseType: !56, size: 64, align: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !116, file: !117, line: 299, baseType: !56, size: 64, align: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !116, file: !117, line: 300, baseType: !56, size: 64, align: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !116, file: !117, line: 302, baseType: !162, size: 64, align: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 216, baseType: !84)
!163 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !116, file: !117, line: 303, baseType: !71, size: 32, align: 32, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !116, file: !117, line: 305, baseType: !166, size: 160, align: 8, offset: 1568)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, align: 8, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 20)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !103, file: !102, line: 43, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!71, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !175)
!175 = !{!176, !177, !179, !250, !251, !252, !253, !265, !267}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !174, file: !4, line: 79, baseType: !84, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !4, line: 80, baseType: !178, size: 32, align: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !174, file: !4, line: 81, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !182)
!182 = !{!183, !195, !196, !197, !198, !206, !207, !208, !225, !226, !229, !242, !243, !244, !245, !246, !247, !248, !249}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !181, file: !4, line: 113, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !185, line: 109, baseType: !186)
!185 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !185, line: 106, size: 64, align: 64, elements: !187)
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !186, file: !185, line: 108, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !185, line: 97, size: 192, align: 64, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !190, file: !185, line: 99, baseType: !84, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !190, file: !185, line: 102, baseType: !189, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !190, file: !185, line: 103, baseType: !189, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !181, file: !4, line: 114, baseType: !184, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !181, file: !4, line: 115, baseType: !184, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !181, file: !4, line: 116, baseType: !184, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !181, file: !4, line: 117, baseType: !199, size: 128, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !200, line: 62, baseType: !201)
!200 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !200, line: 60, size: 128, align: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !200, line: 61, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !200, line: 61, baseType: !204, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !181, file: !4, line: 121, baseType: !199, size: 128, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !181, file: !4, line: 122, baseType: !199, size: 128, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !181, file: !4, line: 124, baseType: !209, size: 64, align: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !210, line: 31, baseType: !211)
!210 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !210, line: 39, size: 320, align: 64, elements: !213)
!213 = !{!214, !221, !222, !223, !224}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !212, file: !210, line: 40, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !210, line: 33, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !210, line: 34, baseType: !215, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !216, file: !210, line: 35, baseType: !215, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !210, line: 36, baseType: !56, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !212, file: !210, line: 41, baseType: !215, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !212, file: !210, line: 42, baseType: !78, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !212, file: !210, line: 43, baseType: !106, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !212, file: !210, line: 44, baseType: !110, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !181, file: !4, line: 127, baseType: !184, size: 64, align: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !181, file: !4, line: 128, baseType: !227, size: 64, align: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !181, file: !4, line: 129, baseType: !230, size: 64, align: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !233)
!233 = !{!234, !237, !238, !239, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !232, file: !4, line: 103, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !174)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !232, file: !4, line: 104, baseType: !235, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !4, line: 105, baseType: !84, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !232, file: !4, line: 106, baseType: !71, size: 32, align: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !232, file: !4, line: 108, baseType: !241, size: 192, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !185, line: 104, baseType: !190)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !181, file: !4, line: 130, baseType: !78, size: 32, align: 32, offset: 896)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !181, file: !4, line: 131, baseType: !78, size: 32, align: 32, offset: 928)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !181, file: !4, line: 132, baseType: !71, size: 32, align: 32, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !181, file: !4, line: 135, baseType: !71, size: 32, align: 32, offset: 992)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !181, file: !4, line: 136, baseType: !235, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !181, file: !4, line: 146, baseType: !84, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !181, file: !4, line: 147, baseType: !84, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !181, file: !4, line: 148, baseType: !86, size: 8, align: 8, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !174, file: !4, line: 82, baseType: !170, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !174, file: !4, line: 83, baseType: !56, size: 64, align: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !174, file: !4, line: 84, baseType: !90, size: 128, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !174, file: !4, line: 92, baseType: !254, size: 64, align: 32, offset: 448)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !4, line: 85, size: 64, align: 32, elements: !255)
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !254, file: !4, line: 86, baseType: !71, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !254, file: !4, line: 87, baseType: !71, size: 32, align: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !254, file: !4, line: 91, baseType: !259, size: 64, align: 32)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !4, line: 88, size: 64, align: 32, elements: !260)
!260 = !{!261, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !259, file: !4, line: 89, baseType: !262, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !75, line: 61, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !77, line: 133, baseType: !71)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !259, file: !4, line: 90, baseType: !71, size: 32, align: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !174, file: !4, line: 93, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !4, line: 95, baseType: !268, size: 192, align: 64, offset: 576)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !4, line: 95, size: 192, align: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !268, file: !4, line: 96, baseType: !241, size: 192, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !4, line: 97, baseType: !199, size: 128, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !103, file: !102, line: 44, baseType: !273, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!86, !56, !56}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !103, file: !102, line: 45, baseType: !277, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !279, line: 180, baseType: !280)
!279 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !279, line: 131, size: 2560, align: 64, elements: !281)
!281 = !{!282, !283, !291, !303, !306, !333, !335, !336, !337, !338, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !280, file: !279, line: 132, baseType: !68, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !280, file: !279, line: 133, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !279, line: 128, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !279, line: 124, size: 192, align: 64, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !286, file: !279, line: 125, baseType: !68, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !286, file: !279, line: 126, baseType: !209, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !286, file: !279, line: 127, baseType: !209, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !280, file: !279, line: 134, baseType: !292, size: 1024, align: 64, offset: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !293, line: 166, size: 1024, align: 64, elements: !294)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!294 = !{!295, !298, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !292, file: !293, line: 168, baseType: !296, size: 16, align: 16)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !297, line: 28, baseType: !145)
!297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !292, file: !293, line: 169, baseType: !299, size: 944, align: 8, offset: 16)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 944, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 118)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !292, file: !293, line: 170, baseType: !84, size: 64, align: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !280, file: !279, line: 135, baseType: !304, size: 32, align: 32, offset: 1152)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !305, line: 51, baseType: !78)
!305 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !280, file: !279, line: 136, baseType: !307, size: 64, align: 64, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !279, line: 102, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !279, line: 62, size: 1920, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !309, file: !279, line: 63, baseType: !292, size: 1024, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !309, file: !279, line: 64, baseType: !71, size: 32, align: 32, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !309, file: !279, line: 65, baseType: !71, size: 32, align: 32, offset: 1056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !309, file: !279, line: 66, baseType: !71, size: 32, align: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !309, file: !279, line: 68, baseType: !78, size: 32, align: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !309, file: !279, line: 69, baseType: !304, size: 32, align: 32, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !309, file: !279, line: 70, baseType: !304, size: 32, align: 32, offset: 1184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !309, file: !279, line: 71, baseType: !71, size: 32, align: 32, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !309, file: !279, line: 74, baseType: !320, size: 64, align: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !309, file: !279, line: 75, baseType: !320, size: 64, align: 64, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !309, file: !279, line: 76, baseType: !71, size: 32, align: 32, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !309, file: !279, line: 77, baseType: !84, size: 64, align: 64, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !309, file: !279, line: 78, baseType: !84, size: 64, align: 64, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !309, file: !279, line: 79, baseType: !78, size: 32, align: 32, offset: 1600)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !309, file: !279, line: 80, baseType: !84, size: 64, align: 64, offset: 1664)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !309, file: !279, line: 81, baseType: !71, size: 32, align: 32, offset: 1728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !309, file: !279, line: 83, baseType: !86, size: 8, align: 8, offset: 1760)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !309, file: !279, line: 84, baseType: !78, size: 32, align: 32, offset: 1792)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !309, file: !279, line: 85, baseType: !86, size: 8, align: 8, offset: 1824)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !309, file: !279, line: 86, baseType: !86, size: 8, align: 8, offset: 1832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !309, file: !279, line: 87, baseType: !68, size: 64, align: 64, offset: 1856)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !280, file: !279, line: 137, baseType: !334, size: 16, align: 16, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !305, line: 49, baseType: !145)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !280, file: !279, line: 138, baseType: !334, size: 16, align: 16, offset: 1296)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !280, file: !279, line: 139, baseType: !86, size: 8, align: 8, offset: 1312)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !280, file: !279, line: 140, baseType: !71, size: 32, align: 32, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !280, file: !279, line: 142, baseType: !339, size: 128, align: 8, offset: 1376)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, align: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !280, file: !279, line: 143, baseType: !304, size: 32, align: 32, offset: 1504)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !280, file: !279, line: 144, baseType: !304, size: 32, align: 32, offset: 1536)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !280, file: !279, line: 146, baseType: !339, size: 128, align: 8, offset: 1568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !280, file: !279, line: 148, baseType: !78, size: 32, align: 32, offset: 1696)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !280, file: !279, line: 149, baseType: !304, size: 32, align: 32, offset: 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !280, file: !279, line: 151, baseType: !68, size: 64, align: 64, offset: 1792)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !280, file: !279, line: 153, baseType: !71, size: 32, align: 32, offset: 1856)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !280, file: !279, line: 154, baseType: !209, size: 64, align: 64, offset: 1920)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !280, file: !279, line: 155, baseType: !71, size: 32, align: 32, offset: 1984)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !280, file: !279, line: 156, baseType: !86, size: 8, align: 8, offset: 2016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !280, file: !279, line: 157, baseType: !86, size: 8, align: 8, offset: 2024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !280, file: !279, line: 158, baseType: !86, size: 8, align: 8, offset: 2032)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !280, file: !279, line: 160, baseType: !84, size: 64, align: 64, offset: 2048)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !280, file: !279, line: 161, baseType: !84, size: 64, align: 64, offset: 2112)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !280, file: !279, line: 162, baseType: !78, size: 32, align: 32, offset: 2176)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !280, file: !279, line: 163, baseType: !84, size: 64, align: 64, offset: 2240)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !280, file: !279, line: 164, baseType: !320, size: 64, align: 64, offset: 2304)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !280, file: !279, line: 165, baseType: !320, size: 64, align: 64, offset: 2368)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !280, file: !279, line: 166, baseType: !78, size: 32, align: 32, offset: 2432)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !280, file: !279, line: 167, baseType: !78, size: 32, align: 32, offset: 2464)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !280, file: !279, line: 168, baseType: !71, size: 32, align: 32, offset: 2496)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !280, file: !279, line: 169, baseType: !86, size: 8, align: 8, offset: 2528)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !280, file: !279, line: 170, baseType: !86, size: 8, align: 8, offset: 2536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !103, file: !102, line: 46, baseType: !307, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !102, line: 47, baseType: !56, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !103, file: !102, line: 48, baseType: !86, size: 8, align: 8, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !103, file: !102, line: 49, baseType: !86, size: 8, align: 8, offset: 456)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !103, file: !102, line: 50, baseType: !86, size: 8, align: 8, offset: 464)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !103, file: !102, line: 51, baseType: !371, size: 64, align: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !373, line: 50, baseType: !374)
!373 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !373, line: 42, size: 2240, align: 64, elements: !375)
!375 = !{!376, !377, !378, !379, !380}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !374, file: !373, line: 43, baseType: !292, size: 1024, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !374, file: !373, line: 44, baseType: !292, size: 1024, align: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !374, file: !373, line: 45, baseType: !339, size: 128, align: 8, offset: 2048)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !374, file: !373, line: 46, baseType: !78, size: 32, align: 32, offset: 2176)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !374, file: !373, line: 48, baseType: !78, size: 32, align: 32, offset: 2208)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !103, file: !102, line: 52, baseType: !71, size: 32, align: 32, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !103, file: !102, line: 53, baseType: !84, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !103, file: !102, line: 54, baseType: !84, size: 64, align: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !103, file: !102, line: 55, baseType: !78, size: 32, align: 32, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !103, file: !102, line: 56, baseType: !84, size: 64, align: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !103, file: !102, line: 57, baseType: !78, size: 32, align: 32, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !103, file: !102, line: 58, baseType: !78, size: 32, align: 32, offset: 928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !103, file: !102, line: 59, baseType: !84, size: 64, align: 64, offset: 960)
!389 = !{!390, !392, !394, !395}
!390 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !391, line: 150, type: !209, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!391 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!392 = distinct !DIGlobalVariable(name: "have_dynamic_misc_checker", scope: !0, file: !393, line: 53, type: !86, isLocal: true, isDefinition: true, variable: i8* @have_dynamic_misc_checker)
!393 = !DIFile(filename: "check_misc.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!394 = distinct !DIGlobalVariable(name: "new_misck_checker", scope: !0, file: !393, line: 52, type: !57, isLocal: true, isDefinition: true, variable: %struct._misc_checker** @new_misck_checker)
!395 = distinct !DIGlobalVariable(name: "script_user_set", scope: !0, file: !393, line: 51, type: !86, isLocal: true, isDefinition: true, variable: i8* @script_user_set)
!396 = !{i32 2, !"Dwarf Version", i32 4}
!397 = !{i32 2, !"Debug Info Version", i32 3}
!398 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!399 = distinct !DISubprogram(name: "clear_dynamic_misc_check_flag", scope: !393, file: !393, line: 56, type: !400, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{null}
!402 = !{}
!403 = !DILocation(line: 58, column: 28, scope: !399)
!404 = !DILocation(line: 59, column: 1, scope: !399)
!405 = distinct !DISubprogram(name: "install_misc_check_keyword", scope: !393, file: !393, line: 208, type: !400, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !402)
!406 = !DILocation(line: 210, column: 2, scope: !405)
!407 = !DILocation(line: 211, column: 2, scope: !405)
!408 = !DILocation(line: 212, column: 2, scope: !405)
!409 = !DILocation(line: 213, column: 2, scope: !405)
!410 = !DILocation(line: 214, column: 2, scope: !405)
!411 = !DILocation(line: 215, column: 2, scope: !405)
!412 = !DILocation(line: 216, column: 2, scope: !405)
!413 = !DILocation(line: 217, column: 2, scope: !405)
!414 = !DILocation(line: 218, column: 2, scope: !405)
!415 = !DILocation(line: 219, column: 1, scope: !405)
!416 = distinct !DISubprogram(name: "misc_check_handler", scope: !393, file: !393, line: 96, type: !417, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !402)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !421, line: 34, baseType: !422)
!421 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !421, line: 30, size: 128, align: 64, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !422, file: !421, line: 31, baseType: !78, size: 32, align: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !422, file: !421, line: 32, baseType: !78, size: 32, align: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !422, file: !421, line: 33, baseType: !427, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!428 = !DILocalVariable(name: "strvec", arg: 1, scope: !416, file: !393, line: 96, type: !419)
!429 = !DIExpression()
!430 = !DILocation(line: 96, column: 54, scope: !416)
!431 = !DILocalVariable(name: "checker", scope: !416, file: !393, line: 98, type: !100)
!432 = !DILocation(line: 98, column: 13, scope: !416)
!433 = !DILocation(line: 100, column: 42, scope: !416)
!434 = !DILocation(line: 100, column: 22, scope: !416)
!435 = !DILocation(line: 100, column: 20, scope: !416)
!436 = !DILocation(line: 101, column: 2, scope: !416)
!437 = !DILocation(line: 101, column: 21, scope: !416)
!438 = !DILocation(line: 101, column: 27, scope: !416)
!439 = !DILocation(line: 103, column: 18, scope: !416)
!440 = !DILocation(line: 106, column: 99, scope: !416)
!441 = !DILocation(line: 106, column: 12, scope: !416)
!442 = !DILocation(line: 106, column: 10, scope: !416)
!443 = !DILocation(line: 109, column: 2, scope: !416)
!444 = !DILocation(line: 109, column: 11, scope: !416)
!445 = !DILocation(line: 109, column: 25, scope: !416)
!446 = !DILocation(line: 110, column: 1, scope: !416)
!447 = distinct !DISubprogram(name: "misc_path_handler", scope: !393, file: !393, line: 113, type: !417, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !402)
!448 = !DILocalVariable(name: "strvec", arg: 1, scope: !447, file: !393, line: 113, type: !419)
!449 = !DILocation(line: 113, column: 53, scope: !447)
!450 = !DILocalVariable(name: "strvec_qe", scope: !447, file: !393, line: 115, type: !419)
!451 = !DILocation(line: 115, column: 12, scope: !447)
!452 = !DILocation(line: 117, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !447, file: !393, line: 117, column: 6)
!454 = !DILocation(line: 117, column: 6, scope: !447)
!455 = !DILocation(line: 118, column: 3, scope: !453)
!456 = !DILocation(line: 121, column: 14, scope: !447)
!457 = !DILocation(line: 121, column: 12, scope: !447)
!458 = !DILocation(line: 123, column: 26, scope: !447)
!459 = !DILocation(line: 123, column: 38, scope: !447)
!460 = !DILocation(line: 123, column: 57, scope: !447)
!461 = !DILocation(line: 123, column: 2, scope: !447)
!462 = !DILocation(line: 125, column: 14, scope: !447)
!463 = !DILocation(line: 125, column: 2, scope: !447)
!464 = !DILocation(line: 126, column: 1, scope: !447)
!465 = !DILocation(line: 126, column: 1, scope: !466)
!466 = !DILexicalBlockFile(scope: !447, file: !393, discriminator: 1)
!467 = distinct !DISubprogram(name: "misc_timeout_handler", scope: !393, file: !393, line: 129, type: !417, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !402)
!468 = !DILocalVariable(name: "strvec", arg: 1, scope: !467, file: !393, line: 129, type: !419)
!469 = !DILocation(line: 129, column: 32, scope: !467)
!470 = !DILocalVariable(name: "timeout", scope: !467, file: !393, line: 131, type: !78)
!471 = !DILocation(line: 131, column: 11, scope: !467)
!472 = !DILocation(line: 133, column: 7, scope: !473)
!473 = distinct !DILexicalBlock(scope: !467, file: !393, line: 133, column: 6)
!474 = !DILocation(line: 133, column: 6, scope: !467)
!475 = !DILocation(line: 134, column: 3, scope: !473)
!476 = !DILocation(line: 136, column: 28, scope: !477)
!477 = distinct !DILexicalBlock(scope: !467, file: !393, line: 136, column: 6)
!478 = !DILocation(line: 136, column: 7, scope: !477)
!479 = !DILocation(line: 136, column: 6, scope: !467)
!480 = !DILocation(line: 137, column: 100, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !393, line: 136, column: 79)
!482 = !DILocation(line: 137, column: 88, scope: !481)
!483 = !DILocation(line: 137, column: 3, scope: !484)
!484 = !DILexicalBlockFile(scope: !481, file: !393, discriminator: 1)
