; ModuleID = './[inter]keepalived--check--check_tcp.o.i'
source_filename = "./[inter]keepalived--check--check_tcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!6 = !DIEnumerator(name: "THREAD_READ", value: 0)
!7 = !DIEnumerator(name: "THREAD_WRITE", value: 1)
!8 = !DIEnumerator(name: "THREAD_TIMER", value: 2)
!9 = !DIEnumerator(name: "THREAD_TIMER_SHUTDOWN", value: 3)
!10 = !DIEnumerator(name: "THREAD_EVENT", value: 4)
!11 = !DIEnumerator(name: "THREAD_CHILD", value: 5)
!12 = !DIEnumerator(name: "THREAD_READY", value: 6)
!13 = !DIEnumerator(name: "THREAD_UNUSED", value: 7)
!14 = !DIEnumerator(name: "THREAD_WRITE_TIMEOUT", value: 8)
!15 = !DIEnumerator(name: "THREAD_READ_TIMEOUT", value: 9)
!16 = !DIEnumerator(name: "THREAD_CHILD_TIMEOUT", value: 10)
!17 = !DIEnumerator(name: "THREAD_TERMINATE_START", value: 11)
!18 = !DIEnumerator(name: "THREAD_TERMINATE", value: 12)
!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !25, line: 24, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!28 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!29 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!30 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!31 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!32 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!33 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!34 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!35 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 40, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!39 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!40 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!41 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!42 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!43 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!44 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!45 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!46 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!47 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!48 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!49 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!50 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!51 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!52 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!53 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!54 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!55 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!56 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!57 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!58 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!59 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!60 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!61 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!62 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!63 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!64 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "connect_result", file: !66, line: 34, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "connect_error", value: 0)
!69 = !DIEnumerator(name: "connect_in_progress", value: 1)
!70 = !DIEnumerator(name: "connect_timeout", value: 2)
!71 = !DIEnumerator(name: "connect_success", value: 3)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 57, size: 32, align: 32, elements: !74)
!73 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!76 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!77 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!78 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!79 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!80 = !{!81, !82, !109}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !66, line: 50, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !66, line: 42, size: 2240, align: 64, elements: !85)
!85 = !{!86, !101, !102, !106, !108}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !84, file: !66, line: 43, baseType: !87, size: 1024, align: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !88, line: 166, size: 1024, align: 64, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!89 = !{!90, !94, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !87, file: !88, line: 168, baseType: !91, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !92, line: 28, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !87, file: !88, line: 169, baseType: !95, size: 944, align: 8, offset: 16)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 944, align: 8, elements: !97)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !{!98}
!98 = !DISubrange(count: 118)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !87, file: !88, line: 170, baseType: !100, size: 64, align: 64, offset: 960)
!100 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !84, file: !66, line: 44, baseType: !87, size: 1024, align: 64, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !84, file: !66, line: 45, baseType: !103, size: 128, align: 8, offset: 2048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !84, file: !66, line: 46, baseType: !107, size: 32, align: 32, offset: 2176)
!107 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !84, file: !66, line: 48, baseType: !107, size: 32, align: 32, offset: 2208)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !111, line: 60, baseType: !112)
!111 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !111, line: 40, size: 1024, align: 64, elements: !113)
!113 = !{!114, !118, !181, !295, !299, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !112, file: !111, line: 41, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !81}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !112, file: !111, line: 42, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !81}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !124, line: 48, baseType: !125)
!124 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !126, line: 241, size: 1728, align: 64, elements: !127)
!126 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!127 = !{!128, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !150, !151, !152, !153, !157, !158, !160, !164, !167, !169, !170, !171, !172, !173, !176, !177}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !125, file: !126, line: 242, baseType: !129, size: 32, align: 32)
!129 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !125, file: !126, line: 247, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !125, file: !126, line: 248, baseType: !131, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !125, file: !126, line: 249, baseType: !131, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !125, file: !126, line: 250, baseType: !131, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !125, file: !126, line: 251, baseType: !131, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !125, file: !126, line: 252, baseType: !131, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !125, file: !126, line: 253, baseType: !131, size: 64, align: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !125, file: !126, line: 254, baseType: !131, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !125, file: !126, line: 256, baseType: !131, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !125, file: !126, line: 257, baseType: !131, size: 64, align: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !125, file: !126, line: 258, baseType: !131, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !125, file: !126, line: 260, baseType: !143, size: 64, align: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !126, line: 156, size: 192, align: 64, elements: !145)
!145 = !{!146, !147, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !144, file: !126, line: 157, baseType: !143, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !144, file: !126, line: 158, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !144, file: !126, line: 162, baseType: !129, size: 32, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !125, file: !126, line: 262, baseType: !148, size: 64, align: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !125, file: !126, line: 264, baseType: !129, size: 32, align: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !125, file: !126, line: 268, baseType: !129, size: 32, align: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !125, file: !126, line: 270, baseType: !154, size: 64, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 131, baseType: !156)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!156 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !125, file: !126, line: 274, baseType: !93, size: 16, align: 16, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !125, file: !126, line: 275, baseType: !159, size: 8, align: 8, offset: 1040)
!159 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !125, file: !126, line: 276, baseType: !161, size: 8, align: 8, offset: 1048)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !125, file: !126, line: 280, baseType: !165, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !126, line: 150, baseType: null)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !125, file: !126, line: 289, baseType: !168, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 132, baseType: !156)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !125, file: !126, line: 297, baseType: !81, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !125, file: !126, line: 298, baseType: !81, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !125, file: !126, line: 299, baseType: !81, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !125, file: !126, line: 300, baseType: !81, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !125, file: !126, line: 302, baseType: !174, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !175, line: 216, baseType: !100)
!175 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !125, file: !126, line: 303, baseType: !129, size: 32, align: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !125, file: !126, line: 305, baseType: !178, size: 160, align: 8, offset: 1568)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 160, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 20)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !112, file: !111, line: 43, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!129, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !187)
!187 = !{!188, !189, !191, !263, !264, !265, !275, !288, !290}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !4, line: 79, baseType: !100, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !4, line: 80, baseType: !190, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !186, file: !4, line: 81, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !194)
!194 = !{!195, !207, !208, !209, !210, !218, !219, !220, !237, !238, !241, !254, !255, !256, !257, !258, !259, !260, !261}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !193, file: !4, line: 113, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !197, line: 109, baseType: !198)
!197 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !197, line: 106, size: 64, align: 64, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !198, file: !197, line: 108, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !197, line: 97, size: 192, align: 64, elements: !203)
!203 = !{!204, !205, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !202, file: !197, line: 99, baseType: !100, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !202, file: !197, line: 102, baseType: !201, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !202, file: !197, line: 103, baseType: !201, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !193, file: !4, line: 114, baseType: !196, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !193, file: !4, line: 115, baseType: !196, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !193, file: !4, line: 116, baseType: !196, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !193, file: !4, line: 117, baseType: !211, size: 128, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !212, line: 62, baseType: !213)
!212 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !212, line: 60, size: 128, align: 64, elements: !214)
!214 = !{!215, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !212, line: 61, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !212, line: 61, baseType: !216, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !193, file: !4, line: 121, baseType: !211, size: 128, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !193, file: !4, line: 122, baseType: !211, size: 128, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !193, file: !4, line: 124, baseType: !221, size: 64, align: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !222, line: 31, baseType: !223)
!222 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !222, line: 39, size: 320, align: 64, elements: !225)
!225 = !{!226, !233, !234, !235, !236}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !224, file: !222, line: 40, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !222, line: 33, size: 192, align: 64, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !222, line: 34, baseType: !227, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !222, line: 35, baseType: !227, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !222, line: 36, baseType: !81, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !224, file: !222, line: 41, baseType: !227, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !224, file: !222, line: 42, baseType: !107, size: 32, align: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !224, file: !222, line: 43, baseType: !115, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !224, file: !222, line: 44, baseType: !119, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !193, file: !4, line: 127, baseType: !196, size: 64, align: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !193, file: !4, line: 128, baseType: !239, size: 64, align: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !193, file: !4, line: 129, baseType: !242, size: 64, align: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !245)
!245 = !{!246, !249, !250, !251, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !244, file: !4, line: 103, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !186)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !244, file: !4, line: 104, baseType: !247, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !4, line: 105, baseType: !100, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !244, file: !4, line: 106, baseType: !129, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !244, file: !4, line: 108, baseType: !253, size: 192, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !197, line: 104, baseType: !202)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !193, file: !4, line: 130, baseType: !107, size: 32, align: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !193, file: !4, line: 131, baseType: !107, size: 32, align: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !193, file: !4, line: 132, baseType: !129, size: 32, align: 32, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !193, file: !4, line: 135, baseType: !129, size: 32, align: 32, offset: 992)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !193, file: !4, line: 136, baseType: !247, size: 64, align: 64, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !193, file: !4, line: 146, baseType: !100, size: 64, align: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !193, file: !4, line: 147, baseType: !100, size: 64, align: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !193, file: !4, line: 148, baseType: !262, size: 8, align: 8, offset: 1216)
!262 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !186, file: !4, line: 82, baseType: !182, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !186, file: !4, line: 83, baseType: !81, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !186, file: !4, line: 84, baseType: !266, size: 128, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !267, line: 31, baseType: !268)
!267 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !269, line: 30, size: 128, align: 64, elements: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!270 = !{!271, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !268, file: !269, line: 32, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !155, line: 139, baseType: !156)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !268, file: !269, line: 33, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !155, line: 141, baseType: !156)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !186, file: !4, line: 92, baseType: !276, size: 64, align: 32, offset: 448)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !4, line: 85, size: 64, align: 32, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !276, file: !4, line: 86, baseType: !129, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !276, file: !4, line: 87, baseType: !129, size: 32, align: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !276, file: !4, line: 91, baseType: !281, size: 64, align: 32)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !276, file: !4, line: 88, size: 64, align: 32, elements: !282)
!282 = !{!283, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !281, file: !4, line: 89, baseType: !284, size: 32, align: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !285, line: 263, baseType: !286)
!285 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !155, line: 133, baseType: !129)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !281, file: !4, line: 90, baseType: !129, size: 32, align: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !186, file: !4, line: 93, baseType: !289, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !186, file: !4, line: 95, baseType: !291, size: 192, align: 64, offset: 576)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !4, line: 95, size: 192, align: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !291, file: !4, line: 96, baseType: !253, size: 192, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !4, line: 97, baseType: !211, size: 128, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !112, file: !111, line: 44, baseType: !296, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!262, !81, !81}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !112, file: !111, line: 45, baseType: !300, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !302, line: 180, baseType: !303)
!302 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !302, line: 131, size: 2560, align: 64, elements: !304)
!304 = !{!305, !306, !314, !315, !318, !359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !303, file: !302, line: 132, baseType: !131, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !303, file: !302, line: 133, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !302, line: 128, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !302, line: 124, size: 192, align: 64, elements: !310)
!310 = !{!311, !312, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !309, file: !302, line: 125, baseType: !131, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !309, file: !302, line: 126, baseType: !221, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !309, file: !302, line: 127, baseType: !221, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !303, file: !302, line: 134, baseType: !87, size: 1024, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !303, file: !302, line: 135, baseType: !316, size: 32, align: 32, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !317, line: 51, baseType: !107)
!317 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !303, file: !302, line: 136, baseType: !319, size: 64, align: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !302, line: 102, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !302, line: 62, size: 1920, align: 64, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !321, file: !302, line: 63, baseType: !87, size: 1024, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !321, file: !302, line: 64, baseType: !129, size: 32, align: 32, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !321, file: !302, line: 65, baseType: !129, size: 32, align: 32, offset: 1056)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !321, file: !302, line: 66, baseType: !129, size: 32, align: 32, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !321, file: !302, line: 68, baseType: !107, size: 32, align: 32, offset: 1120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !321, file: !302, line: 69, baseType: !316, size: 32, align: 32, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !321, file: !302, line: 70, baseType: !316, size: 32, align: 32, offset: 1184)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !321, file: !302, line: 71, baseType: !129, size: 32, align: 32, offset: 1216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !321, file: !302, line: 74, baseType: !332, size: 64, align: 64, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !334, line: 65, baseType: !335)
!334 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !334, line: 59, size: 192, align: 64, elements: !336)
!336 = !{!337, !339, !340, !341, !344}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !335, file: !334, line: 60, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !335, file: !334, line: 61, baseType: !129, size: 32, align: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !334, line: 62, baseType: !129, size: 32, align: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !335, file: !334, line: 63, baseType: !342, size: 32, align: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !285, line: 240, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !155, line: 125, baseType: !107)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !335, file: !334, line: 64, baseType: !345, size: 32, align: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !285, line: 235, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !155, line: 126, baseType: !107)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !321, file: !302, line: 75, baseType: !332, size: 64, align: 64, offset: 1344)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !321, file: !302, line: 76, baseType: !129, size: 32, align: 32, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !321, file: !302, line: 77, baseType: !100, size: 64, align: 64, offset: 1472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !321, file: !302, line: 78, baseType: !100, size: 64, align: 64, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !321, file: !302, line: 79, baseType: !107, size: 32, align: 32, offset: 1600)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !321, file: !302, line: 80, baseType: !100, size: 64, align: 64, offset: 1664)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !321, file: !302, line: 81, baseType: !129, size: 32, align: 32, offset: 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !321, file: !302, line: 83, baseType: !262, size: 8, align: 8, offset: 1760)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !321, file: !302, line: 84, baseType: !107, size: 32, align: 32, offset: 1792)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !321, file: !302, line: 85, baseType: !262, size: 8, align: 8, offset: 1824)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !321, file: !302, line: 86, baseType: !262, size: 8, align: 8, offset: 1832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !321, file: !302, line: 87, baseType: !131, size: 64, align: 64, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !303, file: !302, line: 137, baseType: !360, size: 16, align: 16, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !317, line: 49, baseType: !93)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !303, file: !302, line: 138, baseType: !360, size: 16, align: 16, offset: 1296)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !303, file: !302, line: 139, baseType: !262, size: 8, align: 8, offset: 1312)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !303, file: !302, line: 140, baseType: !129, size: 32, align: 32, offset: 1344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !303, file: !302, line: 142, baseType: !103, size: 128, align: 8, offset: 1376)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !302, line: 143, baseType: !316, size: 32, align: 32, offset: 1504)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !303, file: !302, line: 144, baseType: !316, size: 32, align: 32, offset: 1536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !303, file: !302, line: 146, baseType: !103, size: 128, align: 8, offset: 1568)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !303, file: !302, line: 148, baseType: !107, size: 32, align: 32, offset: 1696)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !303, file: !302, line: 149, baseType: !316, size: 32, align: 32, offset: 1728)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !303, file: !302, line: 151, baseType: !131, size: 64, align: 64, offset: 1792)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !303, file: !302, line: 153, baseType: !129, size: 32, align: 32, offset: 1856)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !303, file: !302, line: 154, baseType: !221, size: 64, align: 64, offset: 1920)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !303, file: !302, line: 155, baseType: !129, size: 32, align: 32, offset: 1984)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !303, file: !302, line: 156, baseType: !262, size: 8, align: 8, offset: 2016)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !303, file: !302, line: 157, baseType: !262, size: 8, align: 8, offset: 2024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !303, file: !302, line: 158, baseType: !262, size: 8, align: 8, offset: 2032)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !303, file: !302, line: 160, baseType: !100, size: 64, align: 64, offset: 2048)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !303, file: !302, line: 161, baseType: !100, size: 64, align: 64, offset: 2112)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !303, file: !302, line: 162, baseType: !107, size: 32, align: 32, offset: 2176)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !303, file: !302, line: 163, baseType: !100, size: 64, align: 64, offset: 2240)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !303, file: !302, line: 164, baseType: !332, size: 64, align: 64, offset: 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !303, file: !302, line: 165, baseType: !332, size: 64, align: 64, offset: 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !303, file: !302, line: 166, baseType: !107, size: 32, align: 32, offset: 2432)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !303, file: !302, line: 167, baseType: !107, size: 32, align: 32, offset: 2464)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !303, file: !302, line: 168, baseType: !129, size: 32, align: 32, offset: 2496)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !303, file: !302, line: 169, baseType: !262, size: 8, align: 8, offset: 2528)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !303, file: !302, line: 170, baseType: !262, size: 8, align: 8, offset: 2536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !112, file: !111, line: 46, baseType: !319, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !111, line: 47, baseType: !81, size: 64, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !112, file: !111, line: 48, baseType: !262, size: 8, align: 8, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !112, file: !111, line: 49, baseType: !262, size: 8, align: 8, offset: 456)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !112, file: !111, line: 50, baseType: !262, size: 8, align: 8, offset: 464)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !112, file: !111, line: 51, baseType: !82, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !112, file: !111, line: 52, baseType: !129, size: 32, align: 32, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !112, file: !111, line: 53, baseType: !100, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !112, file: !111, line: 54, baseType: !100, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !112, file: !111, line: 55, baseType: !107, size: 32, align: 32, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !112, file: !111, line: 56, baseType: !100, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !112, file: !111, line: 57, baseType: !107, size: 32, align: 32, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !112, file: !111, line: 58, baseType: !107, size: 32, align: 32, offset: 928)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !112, file: !111, line: 59, baseType: !100, size: 64, align: 64, offset: 960)
!402 = !{!403}
!403 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !404, line: 150, type: !221, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!404 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!405 = !{i32 2, !"Dwarf Version", i32 4}
!406 = !{i32 2, !"Debug Info Version", i32 3}
!407 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!408 = distinct !DISubprogram(name: "install_tcp_check_keyword", scope: !409, file: !409, line: 86, type: !410, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!409 = !DIFile(filename: "check_tcp.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!410 = !DISubroutineType(types: !411)
!411 = !{null}
!412 = !{}
!413 = !DILocation(line: 88, column: 2, scope: !408)
!414 = !DILocation(line: 89, column: 2, scope: !408)
!415 = !DILocation(line: 90, column: 2, scope: !408)
!416 = !DILocation(line: 91, column: 2, scope: !408)
!417 = !DILocation(line: 92, column: 2, scope: !408)
!418 = !DILocation(line: 93, column: 1, scope: !408)
!419 = distinct !DISubprogram(name: "tcp_check_handler", scope: !409, file: !409, line: 70, type: !420, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !424, line: 34, baseType: !425)
!424 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !424, line: 30, size: 128, align: 64, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !425, file: !424, line: 31, baseType: !107, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !425, file: !424, line: 32, baseType: !107, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !425, file: !424, line: 33, baseType: !430, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!431 = !DILocalVariable(name: "strvec", arg: 1, scope: !419, file: !409, line: 70, type: !422)
!432 = !DIExpression()
!433 = !DILocation(line: 70, column: 53, scope: !419)
!434 = !DILocation(line: 74, column: 51, scope: !419)
!435 = !DILocation(line: 74, column: 34, scope: !419)
!436 = !DILocation(line: 73, column: 2, scope: !419)
!437 = !DILocation(line: 75, column: 1, scope: !419)
!438 = distinct !DISubprogram(name: "tcp_check_end_handler", scope: !409, file: !409, line: 78, type: !410, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!439 = !DILocation(line: 80, column: 41, scope: !440)
!440 = distinct !DILexicalBlock(scope: !438, file: !409, line: 80, column: 6)
!441 = !DILocation(line: 80, column: 58, scope: !440)
!442 = !DILocation(line: 80, column: 64, scope: !440)
!443 = !DILocation(line: 80, column: 25, scope: !440)
!444 = !DILocation(line: 80, column: 73, scope: !440)
!445 = !DILocation(line: 80, column: 7, scope: !440)
!446 = !DILocation(line: 80, column: 6, scope: !438)
!447 = !DILocation(line: 81, column: 3, scope: !448)
!448 = distinct !DILexicalBlock(scope: !440, file: !409, line: 80, column: 79)
!449 = !DILocation(line: 82, column: 2, scope: !448)
!450 = !DILocation(line: 83, column: 1, scope: !438)
!451 = distinct !DISubprogram(name: "free_tcp_check", scope: !409, file: !409, line: 48, type: !116, isLocal: true, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!452 = !DILocalVariable(name: "data", arg: 1, scope: !451, file: !409, line: 48, type: !81)
!453 = !DILocation(line: 48, column: 22, scope: !451)
!454 = !DILocation(line: 50, column: 23, scope: !451)
!455 = !DILocation(line: 50, column: 10, scope: !451)
!456 = !DILocation(line: 50, column: 30, scope: !451)
!457 = !DILocation(line: 50, column: 8, scope: !451)
!458 = !DILocation(line: 50, column: 3, scope: !451)
!459 = !DILocation(line: 50, column: 52, scope: !451)
!460 = !DILocation(line: 50, column: 39, scope: !451)
!461 = !DILocation(line: 50, column: 59, scope: !451)
!462 = !DILocation(line: 50, column: 64, scope: !451)
!463 = !DILocation(line: 51, column: 8, scope: !451)
!464 = !DILocation(line: 51, column: 3, scope: !451)
!465 = !DILocation(line: 51, column: 22, scope: !451)
!466 = !DILocation(line: 52, column: 1, scope: !451)
!467 = distinct !DISubprogram(name: "dump_tcp_check", scope: !409, file: !409, line: 55, type: !120, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!468 = !DILocalVariable(name: "fp", arg: 1, scope: !467, file: !409, line: 55, type: !122)
!469 = !DILocation(line: 55, column: 22, scope: !467)
!470 = !DILocalVariable(name: "data", arg: 2, scope: !467, file: !409, line: 55, type: !81)
!471 = !DILocation(line: 55, column: 32, scope: !467)
!472 = !DILocalVariable(name: "checker", scope: !467, file: !409, line: 57, type: !109)
!473 = !DILocation(line: 57, column: 13, scope: !467)
!474 = !DILocation(line: 57, column: 23, scope: !467)
!475 = !DILocation(line: 59, column: 13, scope: !467)
!476 = !DILocation(line: 59, column: 2, scope: !467)
!477 = !DILocation(line: 60, column: 20, scope: !467)
!478 = !DILocation(line: 60, column: 24, scope: !467)
!479 = !DILocation(line: 60, column: 2, scope: !467)
!480 = !DILocation(line: 61, column: 1, scope: !467)
!481 = distinct !DISubprogram(name: "tcp_connect_thread", scope: !409, file: !409, line: 183, type: !482, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !412)
!482 = !DISubroutineType(types: !483)
!483 = !{!129, !247}
!484 = !DILocalVariable(name: "thread", arg: 1, scope: !481, file: !409, line: 183, type: !247)
