; ModuleID = './[inter]keepalived--check--check_dns.o.i'
source_filename = "./[inter]keepalived--check--check_dns.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._dns_type = type { i16, i8* }
%struct._list = type { %struct._element*, %struct._element*, i32, void (i8*)*, void (%struct._IO_FILE*, i8*)* }
%struct._element = type { %struct._element*, %struct._element*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct._data = type { i8*, i8, i8*, i8, i8*, i8*, %struct.sockaddr_storage, i8*, i64, %struct._list*, i32, i8, i8, i32, i8*, %struct._interface*, i32, i32, i32, i32, %struct.lvs_syncd_config, i8, %struct.sockaddr_in, %struct.sockaddr_in6, i32, %struct.timeval, i32, i32, i32, i32, i32, i32, i8, i8, i32, [29 x i8], [29 x i8], i8, [32 x i8], [32 x i8], [32 x i8], i8, i8, i8, i8, i8, i8, i32, i64, i8, i8, i8, i32, i64, %struct._notify_fifo, %struct._notify_fifo, %struct._notify_fifo, i32, i8, i32, i8, i32, i8, i32, i8, i8, i8, i32, i64, i32 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }

!19 = !DIEnumerator(name: "THREAD_READY_FD", value: 13)
!20 = !DIEnumerator(name: "THREAD_READ_ERROR", value: 14)
!21 = !DIEnumerator(name: "THREAD_WRITE_ERROR", value: 15)
!22 = !DIEnumerator(name: "THREAD_IF_UP", value: 16)
!23 = !DIEnumerator(name: "THREAD_IF_DOWN", value: 17)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !25, line: 24, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35}
!27 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!28 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!29 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!30 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!31 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!32 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!33 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!34 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!35 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 40, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!39 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!40 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!41 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!42 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!43 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!44 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!45 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!46 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!47 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!48 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!49 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!50 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!51 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!52 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!53 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!54 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!55 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!56 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!57 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!58 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!59 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!60 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!61 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!62 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!63 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!64 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "connect_result", file: !66, line: 34, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "./../include/layer4.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "connect_error", value: 0)
!69 = !DIEnumerator(name: "connect_in_progress", value: 1)
!70 = !DIEnumerator(name: "connect_timeout", value: 2)
!71 = !DIEnumerator(name: "connect_success", value: 3)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 57, size: 32, align: 32, elements: !74)
!73 = !DIFile(filename: "./../include/smtp.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "SMTP_MSG_RS", value: 0)
!76 = !DIEnumerator(name: "SMTP_MSG_VS", value: 1)
!77 = !DIEnumerator(name: "SMTP_MSG_RS_SHUT", value: 2)
!78 = !DIEnumerator(name: "SMTP_MSG_VGROUP", value: 3)
!79 = !DIEnumerator(name: "SMTP_MSG_VRRP", value: 4)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 44, size: 32, align: 32, elements: !82)
!81 = !DIFile(filename: "../../lib/parser.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!83 = !DIEnumerator(name: "CONFIG_OK", value: 0)
!84 = !DIEnumerator(name: "CONFIG_FILE_NOT_FOUND", value: 1)
!85 = !DIEnumerator(name: "CONFIG_BAD_IF", value: 2)
!86 = !DIEnumerator(name: "CONFIG_FATAL", value: 3)
!87 = !DIEnumerator(name: "CONFIG_MULTIPLE_FILES", value: 4)
!88 = !DIEnumerator(name: "CONFIG_UNKNOWN_KEYWORD", value: 5)
!89 = !DIEnumerator(name: "CONFIG_UNEXPECTED_BOB", value: 6)
!90 = !DIEnumerator(name: "CONFIG_MISSING_BOB", value: 7)
!91 = !DIEnumerator(name: "CONFIG_UNMATCHED_QUOTE", value: 8)
!92 = !DIEnumerator(name: "CONFIG_MISSING_PARAMETER", value: 9)
!93 = !DIEnumerator(name: "CONFIG_INVALID_NUMBER", value: 10)
!94 = !DIEnumerator(name: "CONFIG_GENERAL_ERROR", value: 11)
!95 = !DIEnumerator(name: "CONFIG_SECURITY_ERROR", value: 12)
!96 = !{!97, !119, !143, !152, !432, !442, !116, !111, !443, !444, !118, !107}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_check_t", file: !99, line: 93, baseType: !100)
!99 = !DIFile(filename: "./../include/check_dns.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dns_check", file: !99, line: 88, size: 6336, align: 64, elements: !101)
!101 = !{!102, !106, !109, !115}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !99, line: 89, baseType: !103, size: 16, align: 16)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !104, line: 49, baseType: !105)
!104 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !99, line: 90, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sbuf", scope: !100, file: !99, line: 91, baseType: !110, size: 6144, align: 8, offset: 128)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 6144, align: 8, elements: !113)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !104, line: 48, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!113 = !{!114}
!114 = !DISubrange(count: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "slen", scope: !100, file: !99, line: 92, baseType: !116, size: 64, align: 64, offset: 6272)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !117, line: 216, baseType: !118)
!117 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!118 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "conn_opts_t", file: !66, line: 50, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_conn_opts", file: !66, line: 42, size: 2240, align: 64, elements: !122)
!122 = !{!123, !135, !136, !140, !142}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !121, file: !66, line: 43, baseType: !124, size: 1024, align: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !125, line: 166, size: 1024, align: 64, elements: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!126 = !{!127, !130, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !124, file: !125, line: 168, baseType: !128, size: 16, align: 16)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !129, line: 28, baseType: !105)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !124, file: !125, line: 169, baseType: !131, size: 944, align: 8, offset: 16)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 944, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 118)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !124, file: !125, line: 170, baseType: !118, size: 64, align: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "bindto", scope: !121, file: !66, line: 44, baseType: !124, size: 1024, align: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bind_if", scope: !121, file: !66, line: 45, baseType: !137, size: 128, align: 8, offset: 2048)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "connection_to", scope: !121, file: !66, line: 46, baseType: !141, size: 32, align: 32, offset: 2176)
!141 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fwmark", scope: !121, file: !66, line: 48, baseType: !141, size: 32, align: 32, offset: 2208)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "checker_t", file: !145, line: 60, baseType: !146)
!145 = !DIFile(filename: "./../include/check_api.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_checker", file: !145, line: 40, size: 1024, align: 64, elements: !147)
!147 = !{!148, !153, !213, !327, !331, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !146, file: !145, line: 41, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dump_func", scope: !146, file: !145, line: 42, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157, !152}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !159, line: 48, baseType: !160)
!159 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !161, line: 241, size: 1728, align: 64, elements: !162)
!161 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!162 = !{!163, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !184, !185, !186, !187, !191, !192, !194, !198, !201, !203, !204, !205, !206, !207, !208, !209}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !160, file: !161, line: 242, baseType: !164, size: 32, align: 32)
!164 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !160, file: !161, line: 247, baseType: !107, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !160, file: !161, line: 248, baseType: !107, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !160, file: !161, line: 249, baseType: !107, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !160, file: !161, line: 250, baseType: !107, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !160, file: !161, line: 251, baseType: !107, size: 64, align: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !160, file: !161, line: 252, baseType: !107, size: 64, align: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !160, file: !161, line: 253, baseType: !107, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !160, file: !161, line: 254, baseType: !107, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !160, file: !161, line: 256, baseType: !107, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !160, file: !161, line: 257, baseType: !107, size: 64, align: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !160, file: !161, line: 258, baseType: !107, size: 64, align: 64, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !160, file: !161, line: 260, baseType: !177, size: 64, align: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !161, line: 156, size: 192, align: 64, elements: !179)
!179 = !{!180, !181, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !178, file: !161, line: 157, baseType: !177, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !178, file: !161, line: 158, baseType: !182, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !178, file: !161, line: 162, baseType: !164, size: 32, align: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !160, file: !161, line: 262, baseType: !182, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !160, file: !161, line: 264, baseType: !164, size: 32, align: 32, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !160, file: !161, line: 268, baseType: !164, size: 32, align: 32, offset: 928)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !160, file: !161, line: 270, baseType: !188, size: 64, align: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !189, line: 131, baseType: !190)
!189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!190 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !160, file: !161, line: 274, baseType: !105, size: 16, align: 16, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !160, file: !161, line: 275, baseType: !193, size: 8, align: 8, offset: 1040)
!193 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !160, file: !161, line: 276, baseType: !195, size: 8, align: 8, offset: 1048)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !160, file: !161, line: 280, baseType: !199, size: 64, align: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !161, line: 150, baseType: null)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !160, file: !161, line: 289, baseType: !202, size: 64, align: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !189, line: 132, baseType: !190)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !160, file: !161, line: 297, baseType: !152, size: 64, align: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !160, file: !161, line: 298, baseType: !152, size: 64, align: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !160, file: !161, line: 299, baseType: !152, size: 64, align: 64, offset: 1344)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !160, file: !161, line: 300, baseType: !152, size: 64, align: 64, offset: 1408)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !160, file: !161, line: 302, baseType: !116, size: 64, align: 64, offset: 1472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !160, file: !161, line: 303, baseType: !164, size: 32, align: 32, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !160, file: !161, line: 305, baseType: !210, size: 160, align: 8, offset: 1568)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 160, align: 8, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 20)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "launch", scope: !146, file: !145, line: 43, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!164, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread", file: !4, line: 78, size: 768, align: 64, elements: !219)
!219 = !{!220, !221, !223, !295, !296, !297, !307, !320, !322}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !218, file: !4, line: 79, baseType: !118, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !4, line: 80, baseType: !222, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_type_t", file: !4, line: 63, baseType: !3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !218, file: !4, line: 81, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_master", file: !4, line: 112, size: 1280, align: 64, elements: !226)
!226 = !{!227, !239, !240, !241, !242, !250, !251, !252, !269, !270, !273, !286, !287, !288, !289, !290, !291, !292, !293}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !225, file: !4, line: 113, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_root_t", file: !229, line: 109, baseType: !230)
!229 = !DIFile(filename: "../../lib/rbtree.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !229, line: 106, size: 64, align: 64, elements: !231)
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !230, file: !229, line: 108, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !229, line: 97, size: 192, align: 64, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rb_parent_color", scope: !234, file: !229, line: 99, baseType: !118, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !234, file: !229, line: 102, baseType: !233, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !234, file: !229, line: 103, baseType: !233, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !225, file: !4, line: 114, baseType: !228, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !225, file: !4, line: 115, baseType: !228, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !225, file: !4, line: 116, baseType: !228, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !225, file: !4, line: 117, baseType: !243, size: 128, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_head_t", file: !244, line: 62, baseType: !245)
!244 = !DIFile(filename: "../../lib/list_head.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !244, line: 60, size: 128, align: 64, elements: !246)
!246 = !{!247, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !244, line: 61, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !244, line: 61, baseType: !248, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !225, file: !4, line: 121, baseType: !243, size: 128, align: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "unuse", scope: !225, file: !4, line: 122, baseType: !243, size: 128, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "child_pid_index", scope: !225, file: !4, line: 124, baseType: !253, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "list", file: !254, line: 31, baseType: !255)
!254 = !DIFile(filename: "../../lib/list.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_list", file: !254, line: 39, size: 320, align: 64, elements: !257)
!257 = !{!258, !265, !266, !267, !268}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !254, line: 40, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_element", file: !254, line: 33, size: 192, align: 64, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !254, line: 34, baseType: !259, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !254, line: 35, baseType: !259, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !254, line: 36, baseType: !152, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !256, file: !254, line: 41, baseType: !259, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !256, file: !254, line: 42, baseType: !141, size: 32, align: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !256, file: !254, line: 43, baseType: !149, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !256, file: !254, line: 44, baseType: !154, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_events", scope: !225, file: !4, line: 127, baseType: !228, size: 64, align: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_events", scope: !225, file: !4, line: 128, baseType: !271, size: 64, align: 64, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", file: !4, line: 128, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "current_event", scope: !225, file: !4, line: 129, baseType: !274, size: 64, align: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_event_t", file: !4, line: 109, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_event", file: !4, line: 102, size: 448, align: 64, elements: !277)
!277 = !{!278, !281, !282, !283, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !276, file: !4, line: 103, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "thread_t", file: !4, line: 99, baseType: !218)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !276, file: !4, line: 104, baseType: !279, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !4, line: 105, baseType: !118, size: 64, align: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !276, file: !4, line: 106, baseType: !164, size: 32, align: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !276, file: !4, line: 108, baseType: !285, size: 192, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "rb_node_t", file: !229, line: 104, baseType: !234)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_size", scope: !225, file: !4, line: 130, baseType: !141, size: 32, align: 32, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_count", scope: !225, file: !4, line: 131, baseType: !141, size: 32, align: 32, offset: 928)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "epoll_fd", scope: !225, file: !4, line: 132, baseType: !164, size: 32, align: 32, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "timer_fd", scope: !225, file: !4, line: 135, baseType: !164, size: 32, align: 32, offset: 992)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timer_thread", scope: !225, file: !4, line: 136, baseType: !279, size: 64, align: 64, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !225, file: !4, line: 146, baseType: !118, size: 64, align: 64, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !4, line: 147, baseType: !118, size: 64, align: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown_timer_running", scope: !225, file: !4, line: 148, baseType: !294, size: 8, align: 8, offset: 1216)
!294 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !218, file: !4, line: 82, baseType: !214, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !218, file: !4, line: 83, baseType: !152, size: 64, align: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sands", scope: !218, file: !4, line: 84, baseType: !298, size: 128, align: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "timeval_t", file: !299, line: 31, baseType: !300)
!299 = !DIFile(filename: "../../lib/timer.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !301, line: 30, size: 128, align: 64, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !300, file: !301, line: 32, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !189, line: 139, baseType: !190)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !300, file: !301, line: 33, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !189, line: 141, baseType: !190)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !218, file: !4, line: 92, baseType: !308, size: 64, align: 32, offset: 448)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 85, size: 64, align: 32, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !4, line: 86, baseType: !164, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !308, file: !4, line: 87, baseType: !164, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !308, file: !4, line: 91, baseType: !313, size: 64, align: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !308, file: !4, line: 88, size: 64, align: 32, elements: !314)
!314 = !{!315, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !313, file: !4, line: 89, baseType: !316, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !317, line: 263, baseType: !318)
!317 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !189, line: 133, baseType: !164)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !313, file: !4, line: 90, baseType: !164, size: 32, align: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !218, file: !4, line: 93, baseType: !321, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, scope: !218, file: !4, line: 95, baseType: !323, size: 192, align: 64, offset: 576)
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 95, size: 192, align: 64, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !323, file: !4, line: 96, baseType: !285, size: 192, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !4, line: 97, baseType: !243, size: 128, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !146, file: !145, line: 44, baseType: !328, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!294, !152, !152}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "vs", scope: !146, file: !145, line: 45, baseType: !332, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_t", file: !334, line: 180, baseType: !335)
!334 = !DIFile(filename: "./../include/check_data.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server", file: !334, line: 131, size: 2560, align: 64, elements: !336)
!336 = !{!337, !338, !346, !347, !349, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vsgname", scope: !335, file: !334, line: 132, baseType: !107, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vsg", scope: !335, file: !334, line: 133, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "virtual_server_group_t", file: !334, line: 128, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_virtual_server_group", file: !334, line: 124, size: 192, align: 64, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !341, file: !334, line: 125, baseType: !107, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "addr_range", scope: !341, file: !334, line: 126, baseType: !253, size: 64, align: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !341, file: !334, line: 127, baseType: !253, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !335, file: !334, line: 134, baseType: !124, size: 1024, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vfwmark", scope: !335, file: !334, line: 135, baseType: !348, size: 32, align: 32, offset: 1152)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !104, line: 51, baseType: !141)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "s_svr", scope: !335, file: !334, line: 136, baseType: !350, size: 64, align: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "real_server_t", file: !334, line: 102, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_real_server", file: !334, line: 62, size: 1920, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !352, file: !334, line: 63, baseType: !124, size: 1024, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !352, file: !334, line: 64, baseType: !164, size: 32, align: 32, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iweight", scope: !352, file: !334, line: 65, baseType: !164, size: 32, align: 32, offset: 1056)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pweight", scope: !352, file: !334, line: 66, baseType: !164, size: 32, align: 32, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !352, file: !334, line: 68, baseType: !141, size: 32, align: 32, offset: 1120)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "u_threshold", scope: !352, file: !334, line: 69, baseType: !348, size: 32, align: 32, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "l_threshold", scope: !352, file: !334, line: 70, baseType: !348, size: 32, align: 32, offset: 1184)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !352, file: !334, line: 71, baseType: !164, size: 32, align: 32, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "notify_up", scope: !352, file: !334, line: 74, baseType: !363, size: 64, align: 64, offset: 1280)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "notify_script_t", file: !365, line: 65, baseType: !366)
!365 = !DIFile(filename: "../../lib/notify.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_notify_script", file: !365, line: 59, size: 192, align: 64, elements: !367)
!367 = !{!368, !370, !371, !372, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !366, file: !365, line: 60, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !366, file: !365, line: 61, baseType: !164, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !365, line: 62, baseType: !164, size: 32, align: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !366, file: !365, line: 63, baseType: !373, size: 32, align: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !317, line: 240, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !189, line: 125, baseType: !141)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !366, file: !365, line: 64, baseType: !376, size: 32, align: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !317, line: 235, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !189, line: 126, baseType: !141)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "notify_down", scope: !352, file: !334, line: 75, baseType: !363, size: 64, align: 64, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !352, file: !334, line: 76, baseType: !164, size: 32, align: 32, offset: 1408)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !352, file: !334, line: 77, baseType: !118, size: 64, align: 64, offset: 1472)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !352, file: !334, line: 78, baseType: !118, size: 64, align: 64, offset: 1536)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !352, file: !334, line: 79, baseType: !141, size: 32, align: 32, offset: 1600)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !352, file: !334, line: 80, baseType: !118, size: 64, align: 64, offset: 1664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !352, file: !334, line: 81, baseType: !164, size: 32, align: 32, offset: 1728)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !352, file: !334, line: 83, baseType: !294, size: 8, align: 8, offset: 1760)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "num_failed_checkers", scope: !352, file: !334, line: 84, baseType: !141, size: 32, align: 32, offset: 1792)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !352, file: !334, line: 85, baseType: !294, size: 8, align: 8, offset: 1824)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !352, file: !334, line: 86, baseType: !294, size: 8, align: 8, offset: 1832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !352, file: !334, line: 87, baseType: !107, size: 64, align: 64, offset: 1856)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "af", scope: !335, file: !334, line: 137, baseType: !103, size: 16, align: 16, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "service_type", scope: !335, file: !334, line: 138, baseType: !103, size: 16, align: 16, offset: 1296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend", scope: !335, file: !334, line: 139, baseType: !294, size: 8, align: 8, offset: 1312)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ha_suspend_addr_count", scope: !335, file: !334, line: 140, baseType: !164, size: 32, align: 32, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sched", scope: !335, file: !334, line: 142, baseType: !137, size: 128, align: 8, offset: 1376)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !334, line: 143, baseType: !348, size: 32, align: 32, offset: 1504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_timeout", scope: !335, file: !334, line: 144, baseType: !348, size: 32, align: 32, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pe_name", scope: !335, file: !334, line: 146, baseType: !137, size: 128, align: 8, offset: 1568)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_method", scope: !335, file: !334, line: 148, baseType: !141, size: 32, align: 32, offset: 1696)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "persistence_granularity", scope: !335, file: !334, line: 149, baseType: !348, size: 32, align: 32, offset: 1728)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "virtualhost", scope: !335, file: !334, line: 151, baseType: !107, size: 64, align: 64, offset: 1792)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !335, file: !334, line: 153, baseType: !164, size: 32, align: 32, offset: 1856)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !335, file: !334, line: 154, baseType: !253, size: 64, align: 64, offset: 1920)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alive", scope: !335, file: !334, line: 155, baseType: !164, size: 32, align: 32, offset: 1984)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !335, file: !334, line: 156, baseType: !294, size: 8, align: 8, offset: 2016)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "omega", scope: !335, file: !334, line: 157, baseType: !294, size: 8, align: 8, offset: 2024)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "inhibit", scope: !335, file: !334, line: 158, baseType: !294, size: 8, align: 8, offset: 2032)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !335, file: !334, line: 160, baseType: !118, size: 64, align: 64, offset: 2048)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !335, file: !334, line: 161, baseType: !118, size: 64, align: 64, offset: 2112)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !335, file: !334, line: 162, baseType: !141, size: 32, align: 32, offset: 2176)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !335, file: !334, line: 163, baseType: !118, size: 64, align: 64, offset: 2240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_up", scope: !335, file: !334, line: 164, baseType: !363, size: 64, align: 64, offset: 2304)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "notify_quorum_down", scope: !335, file: !334, line: 165, baseType: !363, size: 64, align: 64, offset: 2368)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "quorum", scope: !335, file: !334, line: 166, baseType: !141, size: 32, align: 32, offset: 2432)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hysteresis", scope: !335, file: !334, line: 167, baseType: !141, size: 32, align: 32, offset: 2464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "smtp_alert", scope: !335, file: !334, line: 168, baseType: !164, size: 32, align: 32, offset: 2496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "quorum_state_up", scope: !335, file: !334, line: 169, baseType: !294, size: 8, align: 8, offset: 2528)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reloaded", scope: !335, file: !334, line: 170, baseType: !294, size: 8, align: 8, offset: 2536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rs", scope: !146, file: !145, line: 46, baseType: !350, size: 64, align: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !145, line: 47, baseType: !152, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !146, file: !145, line: 48, baseType: !294, size: 8, align: 8, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_up", scope: !146, file: !145, line: 49, baseType: !294, size: 8, align: 8, offset: 456)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "has_run", scope: !146, file: !145, line: 50, baseType: !294, size: 8, align: 8, offset: 464)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !146, file: !145, line: 51, baseType: !119, size: 64, align: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !146, file: !145, line: 52, baseType: !164, size: 32, align: 32, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "delay_loop", scope: !146, file: !145, line: 53, baseType: !118, size: 64, align: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "warmup", scope: !146, file: !145, line: 54, baseType: !118, size: 64, align: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "retry", scope: !146, file: !145, line: 55, baseType: !141, size: 32, align: 32, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "delay_before_retry", scope: !146, file: !145, line: 56, baseType: !118, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "retry_it", scope: !146, file: !145, line: 57, baseType: !141, size: 32, align: 32, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "default_retry", scope: !146, file: !145, line: 58, baseType: !141, size: 32, align: 32, offset: 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "default_delay_before_retry", scope: !146, file: !145, line: 59, baseType: !118, size: 64, align: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_header_t", file: !99, line: 86, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dns_header", file: !99, line: 79, size: 96, align: 16, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !434, file: !99, line: 80, baseType: !103, size: 16, align: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !434, file: !99, line: 81, baseType: !103, size: 16, align: 16, offset: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "qdcount", scope: !434, file: !99, line: 82, baseType: !103, size: 16, align: 16, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ancount", scope: !434, file: !99, line: 83, baseType: !103, size: 16, align: 16, offset: 48)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nscount", scope: !434, file: !99, line: 84, baseType: !103, size: 16, align: 16, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "arcount", scope: !434, file: !99, line: 85, baseType: !103, size: 16, align: 16, offset: 80)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !317, line: 223, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !189, line: 172, baseType: !190)
!446 = !{!447, !458}
!447 = distinct !DIGlobalVariable(name: "DNS_TYPE", scope: !0, file: !448, line: 52, type: !449, isLocal: false, isDefinition: true, variable: [10 x %struct._dns_type]* @DNS_TYPE)
!448 = !DIFile(filename: "check_dns.c", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 1280, align: 64, elements: !456)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "dns_type_t", file: !99, line: 75, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dns_type", file: !99, line: 72, size: 128, align: 64, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !99, line: 73, baseType: !103, size: 16, align: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !452, file: !99, line: 74, baseType: !107, size: 64, align: 64, offset: 64)
!456 = !{!457}
!457 = !DISubrange(count: 10)
!458 = distinct !DIGlobalVariable(name: "garp_delay", scope: !0, file: !459, line: 150, type: !253, isLocal: false, isDefinition: true, variable: %struct._list** @garp_delay)
!459 = !DIFile(filename: "./../include/vrrp_if.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!460 = !{i32 2, !"Dwarf Version", i32 4}
!461 = !{i32 2, !"Debug Info Version", i32 3}
!462 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!463 = distinct !DISubprogram(name: "install_dns_check_keyword", scope: !448, file: !448, line: 513, type: !464, isLocal: false, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{null}
!466 = !{}
!467 = !DILocation(line: 515, column: 2, scope: !463)
!468 = !DILocation(line: 516, column: 2, scope: !463)
!469 = !DILocation(line: 517, column: 2, scope: !463)
!470 = !DILocation(line: 518, column: 2, scope: !463)
!471 = !DILocation(line: 519, column: 2, scope: !463)
!472 = !DILocation(line: 520, column: 2, scope: !463)
!473 = !DILocation(line: 521, column: 2, scope: !463)
!474 = !DILocation(line: 522, column: 1, scope: !463)
!475 = distinct !DISubprogram(name: "dns_check_handler", scope: !448, file: !448, line: 466, type: !476, isLocal: true, isDefinition: true, scopeLine: 467, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_t", file: !480, line: 34, baseType: !481)
!480 = !DIFile(filename: "../../lib/vector.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vector", file: !480, line: 30, size: 128, align: 64, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !481, file: !480, line: 31, baseType: !141, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !481, file: !480, line: 32, baseType: !141, size: 32, align: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !481, file: !480, line: 33, baseType: !486, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!487 = !DILocalVariable(name: "strvec", arg: 1, scope: !475, file: !448, line: 466, type: !478)
!488 = !DIExpression()
!489 = !DILocation(line: 466, column: 54, scope: !475)
!490 = !DILocalVariable(name: "checker", scope: !475, file: !448, line: 468, type: !143)
!491 = !DILocation(line: 468, column: 13, scope: !475)
!492 = !DILocalVariable(name: "dns_check", scope: !475, file: !448, line: 470, type: !97)
!493 = !DILocation(line: 470, column: 15, scope: !475)
!494 = !DILocation(line: 470, column: 44, scope: !475)
!495 = !DILocation(line: 470, column: 27, scope: !475)
!496 = !DILocation(line: 471, column: 2, scope: !475)
!497 = !DILocation(line: 471, column: 13, scope: !475)
!498 = !DILocation(line: 471, column: 18, scope: !475)
!499 = !DILocation(line: 472, column: 2, scope: !475)
!500 = !DILocation(line: 472, column: 13, scope: !475)
!501 = !DILocation(line: 472, column: 18, scope: !475)
!502 = !DILocation(line: 474, column: 24, scope: !475)
!503 = !DILocation(line: 474, column: 53, scope: !475)
!504 = !DILocation(line: 474, column: 36, scope: !475)
!505 = !DILocation(line: 473, column: 12, scope: !475)
!506 = !DILocation(line: 473, column: 10, scope: !475)
!507 = !DILocation(line: 477, column: 2, scope: !475)
!508 = !DILocation(line: 477, column: 11, scope: !475)
!509 = !DILocation(line: 477, column: 25, scope: !475)
!510 = !DILocation(line: 478, column: 2, scope: !475)
!511 = !DILocation(line: 478, column: 11, scope: !475)
!512 = !DILocation(line: 478, column: 38, scope: !475)
!513 = !DILocation(line: 479, column: 1, scope: !475)
!514 = distinct !DISubprogram(name: "dns_type_handler", scope: !448, file: !448, line: 482, type: !476, isLocal: true, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!515 = !DILocalVariable(name: "strvec", arg: 1, scope: !514, file: !448, line: 482, type: !478)
!516 = !DILocation(line: 482, column: 29, scope: !514)
!517 = !DILocalVariable(name: "dns_type", scope: !514, file: !448, line: 484, type: !103)
!518 = !DILocation(line: 484, column: 11, scope: !514)
!519 = !DILocalVariable(name: "dns_check", scope: !514, file: !448, line: 485, type: !97)
!520 = !DILocation(line: 485, column: 15, scope: !514)
!521 = !DILocation(line: 485, column: 46, scope: !514)
!522 = !DILocation(line: 485, column: 63, scope: !514)
!523 = !DILocation(line: 485, column: 69, scope: !514)
!524 = !DILocation(line: 485, column: 30, scope: !514)
!525 = !DILocation(line: 485, column: 78, scope: !514)
!526 = !DILocation(line: 485, column: 27, scope: !514)
!527 = !DILocalVariable(name: "type_str", scope: !514, file: !448, line: 486, type: !107)
!528 = !DILocation(line: 486, column: 8, scope: !514)
!529 = !DILocation(line: 486, column: 30, scope: !514)
!530 = !DILocation(line: 486, column: 20, scope: !514)
!531 = !DILocation(line: 488, column: 29, scope: !514)
!532 = !DILocation(line: 488, column: 13, scope: !514)
!533 = !DILocation(line: 488, column: 11, scope: !514)
!534 = !DILocation(line: 489, column: 7, scope: !535)
!535 = distinct !DILexicalBlock(scope: !514, file: !448, line: 489, column: 6)
!536 = !DILocation(line: 489, column: 6, scope: !514)
!537 = !DILocation(line: 490, column: 96, scope: !535)
!538 = !DILocation(line: 490, column: 105, scope: !535)
!539 = !DILocation(line: 490, column: 116, scope: !535)
!540 = !DILocation(line: 490, column: 94, scope: !535)
!541 = !DILocation(line: 490, column: 94, scope: !542)
!542 = !DILexicalBlockFile(scope: !535, file: !448, discriminator: 1)
!543 = !DILocation(line: 490, column: 154, scope: !544)
!544 = !DILexicalBlockFile(scope: !535, file: !448, discriminator: 2)
!545 = !DILocation(line: 490, column: 142, scope: !544)
!546 = !DILocation(line: 490, column: 94, scope: !544)
!547 = !DILocation(line: 490, column: 94, scope: !548)
!548 = !DILexicalBlockFile(scope: !535, file: !448, discriminator: 3)
!549 = !DILocation(line: 490, column: 3, scope: !548)
!550 = !DILocation(line: 492, column: 21, scope: !535)
!551 = !DILocation(line: 492, column: 3, scope: !535)
!552 = !DILocation(line: 492, column: 14, scope: !535)
!553 = !DILocation(line: 492, column: 19, scope: !535)
!554 = !DILocation(line: 494, column: 8, scope: !514)
!555 = !DILocation(line: 494, column: 3, scope: !514)
!556 = !DILocation(line: 494, column: 30, scope: !514)
!557 = !DILocation(line: 495, column: 1, scope: !514)
!558 = distinct !DISubprogram(name: "dns_name_handler", scope: !448, file: !448, line: 498, type: !476, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!559 = !DILocalVariable(name: "strvec", arg: 1, scope: !558, file: !448, line: 498, type: !478)
!560 = !DILocation(line: 498, column: 29, scope: !558)
!561 = !DILocalVariable(name: "dns_check", scope: !558, file: !448, line: 500, type: !97)
!562 = !DILocation(line: 500, column: 15, scope: !558)
!563 = !DILocation(line: 500, column: 46, scope: !558)
!564 = !DILocation(line: 500, column: 63, scope: !558)
!565 = !DILocation(line: 500, column: 69, scope: !558)
!566 = !DILocation(line: 500, column: 30, scope: !558)
!567 = !DILocation(line: 500, column: 78, scope: !558)
!568 = !DILocation(line: 500, column: 27, scope: !558)
!569 = !DILocation(line: 501, column: 31, scope: !558)
!570 = !DILocation(line: 501, column: 21, scope: !558)
!571 = !DILocation(line: 501, column: 2, scope: !558)
!572 = !DILocation(line: 501, column: 13, scope: !558)
!573 = !DILocation(line: 501, column: 18, scope: !558)
!574 = !DILocation(line: 502, column: 1, scope: !558)
!575 = distinct !DISubprogram(name: "dns_check_end", scope: !448, file: !448, line: 505, type: !464, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!576 = !DILocation(line: 507, column: 41, scope: !577)
!577 = distinct !DILexicalBlock(scope: !575, file: !448, line: 507, column: 6)
!578 = !DILocation(line: 507, column: 58, scope: !577)
!579 = !DILocation(line: 507, column: 64, scope: !577)
!580 = !DILocation(line: 507, column: 25, scope: !577)
!581 = !DILocation(line: 507, column: 73, scope: !577)
!582 = !DILocation(line: 507, column: 7, scope: !577)
!583 = !DILocation(line: 507, column: 6, scope: !575)
!584 = !DILocation(line: 508, column: 3, scope: !585)
!585 = distinct !DILexicalBlock(scope: !577, file: !448, line: 507, column: 79)
!586 = !DILocation(line: 509, column: 2, scope: !585)
!587 = !DILocation(line: 510, column: 1, scope: !575)
!588 = distinct !DISubprogram(name: "dns_free", scope: !448, file: !448, line: 426, type: !150, isLocal: true, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!589 = !DILocalVariable(name: "data", arg: 1, scope: !588, file: !448, line: 426, type: !152)
!590 = !DILocation(line: 426, column: 16, scope: !588)
!591 = !DILocalVariable(name: "checker", scope: !588, file: !448, line: 428, type: !143)
!592 = !DILocation(line: 428, column: 13, scope: !588)
!593 = !DILocation(line: 428, column: 23, scope: !588)
!594 = !DILocalVariable(name: "dns_check", scope: !588, file: !448, line: 429, type: !97)
!595 = !DILocation(line: 429, column: 15, scope: !588)
!596 = !DILocation(line: 429, column: 27, scope: !588)
!597 = !DILocation(line: 429, column: 36, scope: !588)
!598 = !DILocation(line: 431, column: 8, scope: !588)
!599 = !DILocation(line: 431, column: 19, scope: !588)
!600 = !DILocation(line: 431, column: 3, scope: !588)
!601 = !DILocation(line: 431, column: 27, scope: !588)
!602 = !DILocation(line: 431, column: 38, scope: !588)
!603 = !DILocation(line: 431, column: 44, scope: !588)
!604 = !DILocation(line: 432, column: 23, scope: !588)
!605 = !DILocation(line: 432, column: 10, scope: !588)
!606 = !DILocation(line: 432, column: 30, scope: !588)
!607 = !DILocation(line: 432, column: 8, scope: !588)
!608 = !DILocation(line: 432, column: 3, scope: !588)
!609 = !DILocation(line: 432, column: 52, scope: !588)
!610 = !DILocation(line: 432, column: 39, scope: !588)
!611 = !DILocation(line: 432, column: 59, scope: !588)
!612 = !DILocation(line: 432, column: 64, scope: !588)
!613 = !DILocation(line: 433, column: 23, scope: !588)
!614 = !DILocation(line: 433, column: 10, scope: !588)
!615 = !DILocation(line: 433, column: 30, scope: !588)
!616 = !DILocation(line: 433, column: 3, scope: !588)
!617 = !DILocation(line: 433, column: 54, scope: !588)
!618 = !DILocation(line: 433, column: 41, scope: !588)
!619 = !DILocation(line: 433, column: 61, scope: !588)
!620 = !DILocation(line: 433, column: 68, scope: !588)
!621 = !DILocation(line: 434, column: 8, scope: !588)
!622 = !DILocation(line: 434, column: 3, scope: !588)
!623 = !DILocation(line: 434, column: 22, scope: !588)
!624 = !DILocation(line: 435, column: 1, scope: !588)
!625 = distinct !DISubprogram(name: "dns_dump", scope: !448, file: !448, line: 438, type: !155, isLocal: true, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!626 = !DILocalVariable(name: "fp", arg: 1, scope: !625, file: !448, line: 438, type: !157)
!627 = !DILocation(line: 438, column: 16, scope: !625)
!628 = !DILocalVariable(name: "data", arg: 2, scope: !625, file: !448, line: 438, type: !152)
!629 = !DILocation(line: 438, column: 26, scope: !625)
!630 = !DILocalVariable(name: "checker", scope: !625, file: !448, line: 440, type: !143)
!631 = !DILocation(line: 440, column: 13, scope: !625)
!632 = !DILocation(line: 440, column: 23, scope: !625)
!633 = !DILocalVariable(name: "dns_check", scope: !625, file: !448, line: 441, type: !97)
!634 = !DILocation(line: 441, column: 15, scope: !625)
!635 = !DILocation(line: 441, column: 27, scope: !625)
!636 = !DILocation(line: 441, column: 36, scope: !625)
!637 = !DILocation(line: 443, column: 13, scope: !625)
!638 = !DILocation(line: 443, column: 2, scope: !625)
!639 = !DILocation(line: 444, column: 20, scope: !625)
!640 = !DILocation(line: 444, column: 24, scope: !625)
!641 = !DILocation(line: 444, column: 2, scope: !625)
!642 = !DILocation(line: 445, column: 13, scope: !625)
!643 = !DILocation(line: 445, column: 47, scope: !625)
!644 = !DILocation(line: 445, column: 58, scope: !625)
!645 = !DILocation(line: 445, column: 33, scope: !625)
!646 = !DILocation(line: 445, column: 2, scope: !647)
!647 = !DILexicalBlockFile(scope: !625, file: !448, discriminator: 1)
!648 = !DILocation(line: 446, column: 13, scope: !625)
!649 = !DILocation(line: 446, column: 33, scope: !625)
!650 = !DILocation(line: 446, column: 44, scope: !625)
!651 = !DILocation(line: 446, column: 2, scope: !625)
!652 = !DILocation(line: 447, column: 1, scope: !625)
!653 = distinct !DISubprogram(name: "dns_connect_thread", scope: !448, file: !448, line: 368, type: !654, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!654 = !DISubroutineType(types: !655)
!655 = !{!164, !279}
!656 = !DILocalVariable(name: "thread", arg: 1, scope: !653, file: !448, line: 368, type: !279)
!657 = !DILocation(line: 368, column: 31, scope: !653)
!658 = !DILocalVariable(name: "fd", scope: !653, file: !448, line: 370, type: !164)
!659 = !DILocation(line: 370, column: 6, scope: !653)
!660 = !DILocalVariable(name: "status", scope: !653, file: !448, line: 370, type: !164)
!661 = !DILocation(line: 370, column: 10, scope: !653)
!662 = !DILocalVariable(name: "checker", scope: !653, file: !448, line: 372, type: !143)
!663 = !DILocation(line: 372, column: 13, scope: !653)
!664 = !DILocation(line: 372, column: 25, scope: !653)
!665 = !DILocation(line: 372, column: 34, scope: !653)
!666 = !DILocation(line: 372, column: 23, scope: !653)
!667 = !DILocalVariable(name: "co", scope: !653, file: !448, line: 373, type: !119)
!668 = !DILocation(line: 373, column: 15, scope: !653)
!669 = !DILocation(line: 373, column: 20, scope: !653)
!670 = !DILocation(line: 373, column: 29, scope: !653)
!671 = !DILocation(line: 375, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !653, file: !448, line: 375, column: 6)
!673 = !DILocation(line: 375, column: 16, scope: !672)
!674 = !DILocation(line: 375, column: 6, scope: !653)
!675 = !DILocation(line: 376, column: 20, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !448, line: 375, column: 25)
!677 = !DILocation(line: 376, column: 28, scope: !676)
!678 = !DILocation(line: 376, column: 56, scope: !676)
!679 = !DILocation(line: 377, column: 6, scope: !676)
!680 = !DILocation(line: 377, column: 15, scope: !676)
!681 = !DILocation(line: 376, column: 3, scope: !676)
!682 = !DILocation(line: 378, column: 3, scope: !676)
!683 = !DILocation(line: 381, column: 19, scope: !684)
!684 = distinct !DILexicalBlock(scope: !653, file: !448, line: 381, column: 6)
!685 = !DILocation(line: 381, column: 23, scope: !684)
!686 = !DILocation(line: 381, column: 27, scope: !684)
!687 = !DILocation(line: 381, column: 12, scope: !684)
!688 = !DILocation(line: 381, column: 10, scope: !684)
!689 = !DILocation(line: 381, column: 94, scope: !684)
!690 = !DILocation(line: 381, column: 6, scope: !653)
!691 = !DILocation(line: 382, column: 19, scope: !692)
!692 = distinct !DILexicalBlock(scope: !684, file: !448, line: 381, column: 101)
!693 = !DILocation(line: 382, column: 3, scope: !692)
!694 = !DILocation(line: 384, column: 20, scope: !692)
!695 = !DILocation(line: 384, column: 28, scope: !692)
!696 = !DILocation(line: 384, column: 56, scope: !692)
!697 = !DILocation(line: 385, column: 6, scope: !692)
!698 = !DILocation(line: 385, column: 15, scope: !692)
!699 = !DILocation(line: 384, column: 3, scope: !692)
!700 = !DILocation(line: 386, column: 3, scope: !692)
!701 = !DILocation(line: 403, column: 31, scope: !653)
!702 = !DILocation(line: 403, column: 35, scope: !653)
!703 = !DILocation(line: 403, column: 11, scope: !653)
!704 = !DILocation(line: 403, column: 9, scope: !653)
!705 = !DILocation(line: 405, column: 6, scope: !706)
!706 = distinct !DILexicalBlock(scope: !653, file: !448, line: 405, column: 6)
!707 = !DILocation(line: 405, column: 13, scope: !706)
!708 = !DILocation(line: 405, column: 6, scope: !653)
!709 = !DILocation(line: 406, column: 18, scope: !710)
!710 = distinct !DILexicalBlock(scope: !706, file: !448, line: 405, column: 33)
!711 = !DILocation(line: 406, column: 3, scope: !710)
!712 = !DILocation(line: 406, column: 11, scope: !710)
!713 = !DILocation(line: 406, column: 13, scope: !710)
!714 = !DILocation(line: 406, column: 16, scope: !710)
!715 = !DILocation(line: 407, column: 18, scope: !710)
!716 = !DILocation(line: 407, column: 3, scope: !710)
!717 = !DILocation(line: 408, column: 12, scope: !710)
!718 = !DILocation(line: 408, column: 3, scope: !710)
!719 = !DILocation(line: 410, column: 3, scope: !710)
!720 = !DILocation(line: 414, column: 30, scope: !721)
!721 = distinct !DILexicalBlock(scope: !653, file: !448, line: 414, column: 6)
!722 = !DILocation(line: 414, column: 34, scope: !721)
!723 = !DILocation(line: 414, column: 42, scope: !721)
!724 = !DILocation(line: 414, column: 68, scope: !721)
!725 = !DILocation(line: 414, column: 72, scope: !721)
!726 = !DILocation(line: 414, column: 6, scope: !721)
!727 = !DILocation(line: 414, column: 6, scope: !653)
!728 = !DILocation(line: 415, column: 9, scope: !729)
!729 = distinct !DILexicalBlock(scope: !721, file: !448, line: 414, column: 88)
!730 = !DILocation(line: 415, column: 3, scope: !729)
!731 = !DILocation(line: 416, column: 19, scope: !729)
!732 = !DILocation(line: 416, column: 3, scope: !729)
!733 = !DILocation(line: 418, column: 20, scope: !729)
!734 = !DILocation(line: 418, column: 28, scope: !729)
!735 = !DILocation(line: 418, column: 56, scope: !729)
!736 = !DILocation(line: 419, column: 6, scope: !729)
!737 = !DILocation(line: 419, column: 15, scope: !729)
!738 = !DILocation(line: 418, column: 3, scope: !729)
!739 = !DILocation(line: 420, column: 2, scope: !729)
!740 = !DILocation(line: 422, column: 2, scope: !653)
!741 = !DILocation(line: 423, column: 1, scope: !653)
!742 = distinct !DISubprogram(name: "dns_check_compare", scope: !448, file: !448, line: 450, type: !329, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!743 = !DILocalVariable(name: "a", arg: 1, scope: !742, file: !448, line: 450, type: !152)
!744 = !DILocation(line: 450, column: 25, scope: !742)
!745 = !DILocalVariable(name: "b", arg: 2, scope: !742, file: !448, line: 450, type: !152)
!746 = !DILocation(line: 450, column: 34, scope: !742)
!747 = !DILocalVariable(name: "old", scope: !742, file: !448, line: 452, type: !97)
!748 = !DILocation(line: 452, column: 15, scope: !742)
!749 = !DILocation(line: 452, column: 36, scope: !742)
!750 = !DILocation(line: 452, column: 23, scope: !742)
!751 = !DILocation(line: 452, column: 40, scope: !742)
!752 = !DILocation(line: 452, column: 21, scope: !742)
!753 = !DILocalVariable(name: "new", scope: !742, file: !448, line: 453, type: !97)
!754 = !DILocation(line: 453, column: 15, scope: !742)
!755 = !DILocation(line: 453, column: 36, scope: !742)
!756 = !DILocation(line: 453, column: 23, scope: !742)
!757 = !DILocation(line: 453, column: 40, scope: !742)
!758 = !DILocation(line: 453, column: 21, scope: !742)
!759 = !DILocation(line: 455, column: 40, scope: !760)
!760 = distinct !DILexicalBlock(scope: !742, file: !448, line: 455, column: 6)
!761 = !DILocation(line: 455, column: 27, scope: !760)
!762 = !DILocation(line: 455, column: 44, scope: !760)
!763 = !DILocation(line: 455, column: 64, scope: !760)
!764 = !DILocation(line: 455, column: 51, scope: !760)
!765 = !DILocation(line: 455, column: 68, scope: !760)
!766 = !DILocation(line: 455, column: 7, scope: !760)
!767 = !DILocation(line: 455, column: 6, scope: !742)
!768 = !DILocation(line: 456, column: 3, scope: !760)
!769 = !DILocation(line: 457, column: 6, scope: !770)
!770 = distinct !DILexicalBlock(scope: !742, file: !448, line: 457, column: 6)
!771 = !DILocation(line: 457, column: 11, scope: !770)
!772 = !DILocation(line: 457, column: 19, scope: !770)
!773 = !DILocation(line: 457, column: 24, scope: !770)
!774 = !DILocation(line: 457, column: 16, scope: !770)
!775 = !DILocation(line: 457, column: 6, scope: !742)
!776 = !DILocation(line: 458, column: 3, scope: !770)
!777 = !DILocation(line: 459, column: 13, scope: !778)
!778 = distinct !DILexicalBlock(scope: !742, file: !448, line: 459, column: 6)
!779 = !DILocation(line: 459, column: 18, scope: !778)
!780 = !DILocation(line: 459, column: 24, scope: !778)
!781 = !DILocation(line: 459, column: 29, scope: !778)
!782 = !DILocation(line: 459, column: 6, scope: !778)
!783 = !DILocation(line: 459, column: 35, scope: !778)
!784 = !DILocation(line: 459, column: 6, scope: !742)
!785 = !DILocation(line: 460, column: 3, scope: !778)
!786 = !DILocation(line: 462, column: 2, scope: !742)
!787 = !DILocation(line: 463, column: 1, scope: !742)
!788 = distinct !DISubprogram(name: "dns_type_name", scope: !448, file: !448, line: 82, type: !789, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!789 = !DISubroutineType(types: !790)
!790 = !{!791, !103}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!793 = !DILocalVariable(name: "type", arg: 1, scope: !788, file: !448, line: 82, type: !103)
!794 = !DILocation(line: 82, column: 24, scope: !788)
!795 = !DILocalVariable(name: "t", scope: !788, file: !448, line: 84, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!797 = !DILocation(line: 84, column: 20, scope: !788)
!798 = !DILocation(line: 86, column: 9, scope: !799)
!799 = distinct !DILexicalBlock(scope: !788, file: !448, line: 86, column: 2)
!800 = !DILocation(line: 86, column: 7, scope: !799)
!801 = !DILocation(line: 86, column: 21, scope: !802)
!802 = !DILexicalBlockFile(scope: !803, file: !448, discriminator: 1)
!803 = distinct !DILexicalBlock(scope: !799, file: !448, line: 86, column: 2)
!804 = !DILocation(line: 86, column: 24, scope: !802)
!805 = !DILocation(line: 86, column: 2, scope: !802)
!806 = !DILocation(line: 87, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !808, file: !448, line: 87, column: 7)
!808 = distinct !DILexicalBlock(scope: !803, file: !448, line: 86, column: 35)
!809 = !DILocation(line: 87, column: 15, scope: !807)
!810 = !DILocation(line: 87, column: 18, scope: !807)
!811 = !DILocation(line: 87, column: 12, scope: !807)
!812 = !DILocation(line: 87, column: 7, scope: !808)
!813 = !DILocation(line: 88, column: 11, scope: !814)
!814 = distinct !DILexicalBlock(scope: !807, file: !448, line: 87, column: 24)
!815 = !DILocation(line: 88, column: 14, scope: !814)
!816 = !DILocation(line: 88, column: 4, scope: !814)
!817 = !DILocation(line: 90, column: 2, scope: !808)
!818 = !DILocation(line: 86, column: 31, scope: !819)
!819 = !DILexicalBlockFile(scope: !803, file: !448, discriminator: 2)
!820 = !DILocation(line: 86, column: 2, scope: !819)
!821 = distinct !{!821, !822}
!822 = !DILocation(line: 86, column: 2, scope: !788)
!823 = !DILocation(line: 91, column: 2, scope: !788)
!824 = !DILocation(line: 92, column: 1, scope: !788)
!825 = distinct !DISubprogram(name: "dns_log_message", scope: !448, file: !448, line: 95, type: !826, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !279, !164, !791, null}
!828 = !DILocalVariable(name: "thread", arg: 1, scope: !825, file: !448, line: 95, type: !279)
!829 = !DILocation(line: 95, column: 28, scope: !825)
!830 = !DILocalVariable(name: "level", arg: 2, scope: !825, file: !448, line: 95, type: !164)
!831 = !DILocation(line: 95, column: 40, scope: !825)
!832 = !DILocalVariable(name: "fmt", arg: 3, scope: !825, file: !448, line: 95, type: !791)
!833 = !DILocation(line: 95, column: 59, scope: !825)
!834 = !DILocalVariable(name: "buf", scope: !825, file: !448, line: 97, type: !835)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 2040, align: 8, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 255)
!838 = !DILocation(line: 97, column: 7, scope: !825)
!839 = !DILocalVariable(name: "args", scope: !825, file: !448, line: 98, type: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !159, line: 79, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !842, line: 40, baseType: !843)
!842 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/keepalived/[lib]keepalived--check--libcheck.a")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 98, baseType: !844)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 192, align: 64, elements: !196)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 98, size: 192, align: 64, elements: !846)
!846 = !{!847, !848, !849, !850}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !845, file: !1, line: 98, baseType: !141, size: 32, align: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !845, file: !1, line: 98, baseType: !141, size: 32, align: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !845, file: !1, line: 98, baseType: !152, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !845, file: !1, line: 98, baseType: !152, size: 64, align: 64, offset: 128)
!851 = !DILocation(line: 98, column: 10, scope: !825)
!852 = !DILocalVariable(name: "checker", scope: !825, file: !448, line: 100, type: !143)
!853 = !DILocation(line: 100, column: 13, scope: !825)
!854 = !DILocation(line: 100, column: 25, scope: !825)
!855 = !DILocation(line: 100, column: 34, scope: !825)
!856 = !DILocation(line: 100, column: 23, scope: !825)
!857 = !DILocation(line: 102, column: 1, scope: !825)
!858 = !DILocation(line: 103, column: 12, scope: !825)
!859 = !DILocation(line: 103, column: 31, scope: !825)
!860 = !DILocation(line: 103, column: 36, scope: !825)
!861 = !DILocation(line: 103, column: 2, scope: !825)
!862 = !DILocation(line: 104, column: 1, scope: !825)
!863 = !DILocation(line: 106, column: 14, scope: !825)
!864 = !DILocation(line: 106, column: 67, scope: !825)
!865 = !DILocation(line: 106, column: 77, scope: !825)
!866 = !DILocation(line: 106, column: 82, scope: !825)
!867 = !DILocation(line: 106, column: 90, scope: !825)
!868 = !DILocation(line: 106, column: 100, scope: !825)
!869 = !DILocation(line: 106, column: 105, scope: !825)
!870 = !DILocation(line: 106, column: 43, scope: !825)
!871 = !DILocation(line: 106, column: 121, scope: !825)
!872 = !DILocation(line: 106, column: 2, scope: !873)
!873 = !DILexicalBlockFile(scope: !825, file: !448, discriminator: 1)
!874 = !DILocation(line: 107, column: 1, scope: !825)
!875 = distinct !DISubprogram(name: "dns_make_query", scope: !448, file: !448, line: 243, type: !654, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !466)
!876 = !DILocalVariable(name: "thread", arg: 1, scope: !875, file: !448, line: 243, type: !279)
!877 = !DILocation(line: 243, column: 27, scope: !875)
!878 = !DILocalVariable(name: "flags", scope: !875, file: !448, line: 245, type: !103)
!879 = !DILocation(line: 245, column: 11, scope: !875)
!880 = !DILocalVariable(name: "p", scope: !875, file: !448, line: 246, type: !442)
!881 = !DILocation(line: 246, column: 11, scope: !875)
!882 = !DILocalVariable(name: "s", scope: !875, file: !448, line: 247, type: !107)
!883 = !DILocation(line: 247, column: 8, scope: !875)
!884 = !DILocalVariable(name: "e", scope: !875, file: !448, line: 247, type: !107)
!885 = !DILocation(line: 247, column: 12, scope: !875)
!886 = !DILocalVariable(name: "n", scope: !875, file: !448, line: 248, type: !116)
!887 = !DILocation(line: 248, column: 9, scope: !875)
!888 = !DILocalVariable(name: "checker", scope: !875, file: !448, line: 249, type: !143)
!889 = !DILocation(line: 249, column: 13, scope: !875)
!890 = !DILocation(line: 249, column: 25, scope: !875)
!891 = !DILocation(line: 249, column: 34, scope: !875)
!892 = !DILocation(line: 249, column: 23, scope: !875)
!893 = !DILocalVariable(name: "dns_check", scope: !875, file: !448, line: 250, type: !97)
!894 = !DILocation(line: 250, column: 15, scope: !875)
!895 = !DILocation(line: 250, column: 29, scope: !875)
!896 = !DILocation(line: 250, column: 39, scope: !875)
!897 = !DILocation(line: 250, column: 27, scope: !875)
!898 = !DILocalVariable(name: "header", scope: !875, file: !448, line: 251, type: !432)
!899 = !DILocation(line: 251, column: 16, scope: !875)
!900 = !DILocation(line: 251, column: 42, scope: !875)
!901 = !DILocation(line: 251, column: 53, scope: !875)
!902 = !DILocation(line: 251, column: 25, scope: !875)
!903 = !DILocation(line: 253, column: 9, scope: !875)
!904 = !DILocation(line: 255, column: 21, scope: !875)
!905 = !DILocation(line: 255, column: 15, scope: !906)
!906 = !DILexicalBlockFile(scope: !875, file: !448, discriminator: 1)
!907 = !DILocation(line: 255, column: 2, scope: !875)
!908 = !DILocation(line: 255, column: 10, scope: !875)
!909 = !DILocation(line: 255, column: 13, scope: !875)
!910 = !DILocation(line: 256, column: 24, scope: !875)
!911 = !DILocation(line: 256, column: 18, scope: !875)
