; ModuleID = './vmware_hgfsclient-hgfsclient.o.i'
source_filename = "./vmware_hgfsclient-hgfsclient.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.RpcOut = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GKeyFile = type opaque
%struct.HgfsFileName = type <{ i32, [1 x i8] }>
%struct.HgfsRequestSearchOpen = type <{ %struct.HgfsRequest, %struct.HgfsFileName }>
%struct.HgfsRequest = type { i32, i32 }
%struct.HgfsReplySearchOpen = type { %struct.HgfsReply, i32 }
%struct.HgfsReply = type { i32, i32 }
%struct.HgfsRequestSearchRead = type { %struct.HgfsRequest, i32, i32 }
%struct.HgfsReplySearchRead = type <{ %struct.HgfsReply, %struct.HgfsAttr, %struct.HgfsFileName }>
%struct.HgfsAttr = type <{ i32, i64, i64, i64, i64, i64, i8 }>
%struct.HgfsRequestSearchClose = type { %struct.HgfsRequest, i32 }
%struct.HgfsReplySearchClose = type { %struct.HgfsReply }

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@gChannel = global %struct.RpcOut* null, align 8
@gPacketBuffer = global i8* null, align 8
@.str = private unnamed_addr constant [3 x i8] c"-h\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"--help\00", align 1

!44 = !DIEnumerator(name: "HGFS_OP_SETATTR_V3", value: 32)
!45 = !DIEnumerator(name: "HGFS_OP_CREATE_DIR_V3", value: 33)
!46 = !DIEnumerator(name: "HGFS_OP_DELETE_FILE_V3", value: 34)
!47 = !DIEnumerator(name: "HGFS_OP_DELETE_DIR_V3", value: 35)
!48 = !DIEnumerator(name: "HGFS_OP_RENAME_V3", value: 36)
!49 = !DIEnumerator(name: "HGFS_OP_QUERY_VOLUME_INFO_V3", value: 37)
!50 = !DIEnumerator(name: "HGFS_OP_CREATE_SYMLINK_V3", value: 38)
!51 = !DIEnumerator(name: "HGFS_OP_SERVER_LOCK_CHANGE_V3", value: 39)
!52 = !DIEnumerator(name: "HGFS_OP_WRITE_WIN32_STREAM_V3", value: 40)
!53 = !DIEnumerator(name: "HGFS_OP_CREATE_SESSION_V4", value: 41)
!54 = !DIEnumerator(name: "HGFS_OP_DESTROY_SESSION_V4", value: 42)
!55 = !DIEnumerator(name: "HGFS_OP_READ_FAST_V4", value: 43)
!56 = !DIEnumerator(name: "HGFS_OP_WRITE_FAST_V4", value: 44)
!57 = !DIEnumerator(name: "HGFS_OP_SET_WATCH_V4", value: 45)
!58 = !DIEnumerator(name: "HGFS_OP_REMOVE_WATCH_V4", value: 46)
!59 = !DIEnumerator(name: "HGFS_OP_NOTIFY_V4", value: 47)
!60 = !DIEnumerator(name: "HGFS_OP_SEARCH_READ_V4", value: 48)
!61 = !DIEnumerator(name: "HGFS_OP_OPEN_V4", value: 49)
!62 = !DIEnumerator(name: "HGFS_OP_ENUMERATE_STREAMS_V4", value: 50)
!63 = !DIEnumerator(name: "HGFS_OP_GETATTR_V4", value: 51)
!64 = !DIEnumerator(name: "HGFS_OP_SETATTR_V4", value: 52)
!65 = !DIEnumerator(name: "HGFS_OP_DELETE_V4", value: 53)
!66 = !DIEnumerator(name: "HGFS_OP_LINKMOVE_V4", value: 54)
!67 = !DIEnumerator(name: "HGFS_OP_FSCTL_V4", value: 55)
!68 = !DIEnumerator(name: "HGFS_OP_ACCESS_CHECK_V4", value: 56)
!69 = !DIEnumerator(name: "HGFS_OP_FSYNC_V4", value: 57)
!70 = !DIEnumerator(name: "HGFS_OP_QUERY_VOLUME_INFO_V4", value: 58)
!71 = !DIEnumerator(name: "HGFS_OP_OPLOCK_ACQUIRE_V4", value: 59)
!72 = !DIEnumerator(name: "HGFS_OP_OPLOCK_BREAK_V4", value: 60)
!73 = !DIEnumerator(name: "HGFS_OP_LOCK_BYTE_RANGE_V4", value: 61)
!74 = !DIEnumerator(name: "HGFS_OP_UNLOCK_BYTE_RANGE_V4", value: 62)
!75 = !DIEnumerator(name: "HGFS_OP_QUERY_EAS_V4", value: 63)
!76 = !DIEnumerator(name: "HGFS_OP_SET_EAS_V4", value: 64)
!77 = !DIEnumerator(name: "HGFS_OP_MAX", value: 65)
!78 = !DIEnumerator(name: "HGFS_OP_NEW_HEADER", value: 255)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 177, size: 32, align: 32, elements: !81)
!80 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfs.h", directory: "/home/lichi/Desktop/open-vm-tools/line1279")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!82 = !DIEnumerator(name: "HGFS_STATUS_SUCCESS", value: 0)
!83 = !DIEnumerator(name: "HGFS_STATUS_NO_SUCH_FILE_OR_DIR", value: 1)
!84 = !DIEnumerator(name: "HGFS_STATUS_INVALID_HANDLE", value: 2)
!85 = !DIEnumerator(name: "HGFS_STATUS_OPERATION_NOT_PERMITTED", value: 3)
!86 = !DIEnumerator(name: "HGFS_STATUS_FILE_EXISTS", value: 4)
!87 = !DIEnumerator(name: "HGFS_STATUS_NOT_DIRECTORY", value: 5)
!88 = !DIEnumerator(name: "HGFS_STATUS_DIR_NOT_EMPTY", value: 6)
!89 = !DIEnumerator(name: "HGFS_STATUS_PROTOCOL_ERROR", value: 7)
!90 = !DIEnumerator(name: "HGFS_STATUS_ACCESS_DENIED", value: 8)
!91 = !DIEnumerator(name: "HGFS_STATUS_INVALID_NAME", value: 9)
!92 = !DIEnumerator(name: "HGFS_STATUS_GENERIC_ERROR", value: 10)
!93 = !DIEnumerator(name: "HGFS_STATUS_SHARING_VIOLATION", value: 11)
!94 = !DIEnumerator(name: "HGFS_STATUS_NO_SPACE", value: 12)
!95 = !DIEnumerator(name: "HGFS_STATUS_OPERATION_NOT_SUPPORTED", value: 13)
!96 = !DIEnumerator(name: "HGFS_STATUS_NAME_TOO_LONG", value: 14)
!97 = !DIEnumerator(name: "HGFS_STATUS_INVALID_PARAMETER", value: 15)
!98 = !DIEnumerator(name: "HGFS_STATUS_NOT_SAME_DEVICE", value: 16)
!99 = !DIEnumerator(name: "HGFS_STATUS_STALE_SESSION", value: 17)
!100 = !DIEnumerator(name: "HGFS_STATUS_TOO_MANY_SESSIONS", value: 18)
!101 = !DIEnumerator(name: "HGFS_STATUS_TRANSPORT_ERROR", value: 19)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 95, size: 32, align: 32, elements: !103)
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "HGFS_FILE_TYPE_REGULAR", value: 0)
!105 = !DIEnumerator(name: "HGFS_FILE_TYPE_DIRECTORY", value: 1)
!106 = !DIEnumerator(name: "HGFS_FILE_TYPE_SYMLINK", value: 2)
!107 = !{!108, !109, !136, !137, !149, !156, !181, !187}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestSearchOpen", file: !10, line: 998, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestSearchOpen", file: !10, line: 993, size: 104, align: 8, elements: !112)
!112 = !{!113, !126}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !111, file: !10, line: 994, baseType: !114, size: 64, align: 8)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequest", file: !10, line: 671, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequest", file: !10, line: 666, size: 64, align: 8, elements: !116)
!116 = !{!117, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !10, line: 667, baseType: !118, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsHandle", file: !10, line: 58, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !120, line: 173, baseType: !121)
!120 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1279")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !122, line: 51, baseType: !123)
!122 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1279")
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !115, file: !10, line: 668, baseType: !125, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsOp", file: !10, line: 152, baseType: !9)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dirName", scope: !111, file: !10, line: 995, baseType: !127, size: 40, align: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileName", file: !10, line: 606, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsFileName", file: !10, line: 601, size: 40, align: 8, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !128, file: !10, line: 602, baseType: !119, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !10, line: 603, baseType: !132, size: 8, align: 8, offset: 32)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8, align: 8, elements: !134)
!133 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsReplySearchOpen", file: !10, line: 1020, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsReplySearchOpen", file: !10, line: 1015, size: 96, align: 8, elements: !140)
!140 = !{!141, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !139, file: !10, line: 1016, baseType: !142, size: 64, align: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsReply", file: !10, line: 681, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsReply", file: !10, line: 676, size: 64, align: 8, elements: !144)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !10, line: 677, baseType: !118, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !143, file: !10, line: 678, baseType: !147, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStatus", file: !80, line: 203, baseType: !79)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !139, file: !10, line: 1017, baseType: !118, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestSearchRead", file: !10, line: 1043, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestSearchRead", file: !10, line: 1037, size: 128, align: 8, elements: !152)
!152 = !{!153, !154, !155}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !151, file: !10, line: 1038, baseType: !114, size: 64, align: 8)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !151, file: !10, line: 1039, baseType: !118, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !151, file: !10, line: 1040, baseType: !119, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsReplySearchRead", file: !10, line: 1081, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsReplySearchRead", file: !10, line: 1074, size: 464, align: 8, elements: !159)
!159 = !{!160, !161, !180}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !158, file: !10, line: 1075, baseType: !142, size: 64, align: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !158, file: !10, line: 1076, baseType: !162, size: 360, align: 8, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsAttr", file: !10, line: 380, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsAttr", file: !10, line: 369, size: 360, align: 8, elements: !164)
!164 = !{!165, !167, !171, !172, !173, !174, !175}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !10, line: 370, baseType: !166, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsFileType", file: !80, line: 99, baseType: !102)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !10, line: 371, baseType: !168, size: 64, align: 64, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !120, line: 171, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !122, line: 55, baseType: !170)
!170 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "creationTime", scope: !163, file: !10, line: 372, baseType: !168, size: 64, align: 64, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "accessTime", scope: !163, file: !10, line: 373, baseType: !168, size: 64, align: 64, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "writeTime", scope: !163, file: !10, line: 374, baseType: !168, size: 64, align: 64, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "attrChangeTime", scope: !163, file: !10, line: 375, baseType: !168, size: 64, align: 64, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !163, file: !10, line: 377, baseType: !176, size: 8, align: 8, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPermissions", file: !10, line: 220, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !120, line: 177, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !122, line: 48, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fileName", scope: !158, file: !10, line: 1077, baseType: !127, size: 40, align: 8, offset: 424)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsRequestSearchClose", file: !10, line: 1137, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsRequestSearchClose", file: !10, line: 1132, size: 96, align: 8, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !183, file: !10, line: 1133, baseType: !114, size: 64, align: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "search", scope: !183, file: !10, line: 1134, baseType: !118, size: 32, align: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsReplySearchClose", file: !10, line: 1148, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsReplySearchClose", file: !10, line: 1144, size: 64, align: 8, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !189, file: !10, line: 1145, baseType: !142, size: 64, align: 8)
!192 = !{!193, !199, !204}
!193 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !194, line: 44, type: !195, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!194 = !DIFile(filename: "hgfsclient.c", directory: "/home/lichi/Desktop/open-vm-tools/line1279")
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 160, align: 8, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!197 = !{!198}
!198 = !DISubrange(count: 20)
!199 = distinct !DIGlobalVariable(name: "gChannel", scope: !0, file: !194, line: 52, type: !200, isLocal: false, isDefinition: true, variable: %struct.RpcOut** @gChannel)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcOut", file: !202, line: 48, baseType: !203)
!202 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/rpcout.h", directory: "/home/lichi/Desktop/open-vm-tools/line1279")
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "RpcOut", file: !202, line: 48, flags: DIFlagFwdDecl)
!204 = distinct !DIGlobalVariable(name: "gPacketBuffer", scope: !0, file: !194, line: 53, type: !136, isLocal: false, isDefinition: true, variable: i8** @gPacketBuffer)
!205 = !{i32 2, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!208 = distinct !DISubprogram(name: "main", scope: !194, file: !194, line: 415, type: !209, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !213)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !211, !212}
!211 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!213 = !{}
!214 = !DILocalVariable(name: "argc", arg: 1, scope: !208, file: !194, line: 415, type: !211)
!215 = !DIExpression()
!216 = !DILocation(line: 415, column: 10, scope: !208)
!217 = !DILocalVariable(name: "argv", arg: 2, scope: !208, file: !194, line: 416, type: !212)
!218 = !DILocation(line: 416, column: 12, scope: !208)
!219 = !DILocation(line: 418, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !208, file: !194, line: 418, column: 8)
!221 = !DILocation(line: 418, column: 13, scope: !220)
!222 = !DILocation(line: 418, column: 18, scope: !220)
!223 = !DILocation(line: 419, column: 18, scope: !220)
!224 = !DILocation(line: 419, column: 10, scope: !220)
!225 = !DILocation(line: 419, column: 36, scope: !220)
!226 = !DILocation(line: 420, column: 18, scope: !220)
!227 = !DILocation(line: 420, column: 10, scope: !220)
!228 = !DILocation(line: 418, column: 8, scope: !229)
!229 = !DILexicalBlockFile(scope: !208, file: !194, discriminator: 1)
!230 = !DILocation(line: 421, column: 14, scope: !231)
!231 = distinct !DILexicalBlock(scope: !220, file: !194, line: 420, column: 42)
!232 = !DILocation(line: 421, column: 7, scope: !231)
!233 = !DILocation(line: 422, column: 7, scope: !231)
!234 = !DILocation(line: 425, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !208, file: !194, line: 425, column: 8)
!236 = !DILocation(line: 425, column: 8, scope: !208)
!237 = !DILocation(line: 426, column: 7, scope: !238)
