; ModuleID = './vmtoolsd-mainLoop.o.i'
source_filename = "./vmtoolsd-mainLoop.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsServiceProperty = type { i8* }
%struct.ToolsServiceState = type { i8*, i8*, i64, i32, i32, i32, i8*, i8*, %struct._GPtrArray*, i8*, %struct._GModule*, i8*, %struct.RpcDebugLibData*, %struct.ToolsAppCtx, %struct._GArray*, i32, i32 }
%struct._GPtrArray = type { i8**, i32 }
%struct._GModule = type opaque
%struct.RpcDebugLibData = type { %struct._RpcChannel* (%struct.ToolsAppCtx*, %struct.RpcDebugLibData*)*, i32 (%struct.ToolsAppCtx*, i8*, i8*, %struct.RpcDebugLibData*)*, %struct.RpcDebugPlugin* }
%struct._RpcChannel = type opaque
%struct.RpcDebugPlugin = type { %struct.RpcDebugRecvMapping*, i32 (i8*, i64, i8**, i64*)*, i32 (%struct.RpcDebugMsgMapping*)*, void (%struct.ToolsAppCtx*, %struct.RpcDebugPlugin*)*, %struct.ToolsPluginData* }
%struct.RpcDebugRecvMapping = type { i8*, i32 (i8*, i64, i8**, i64*)*, i8*, i64 }
%struct.RpcDebugMsgMapping = type { i8*, i64, i32 (%struct.RpcInData*, i32)*, i32 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._GKeyFile = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !49, globals: !178)
!1 = !DIFile(filename: "vmtoolsd-mainLoop.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!2 = !{!3, !7, !13, !20, !26, !38, !44}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, size: 32, align: 32, elements: !8)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!10 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 53, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "toolsCoreInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "TOOLS_PROVIDER_IDLE", value: 0)
!17 = !DIEnumerator(name: "TOOLS_PROVIDER_ACTIVE", value: 1)
!18 = !DIEnumerator(name: "TOOLS_PROVIDER_ERROR", value: 2)
!19 = !DIEnumerator(name: "TOOLS_PROVIDER_MAX", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 50, size: 32, align: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!22 = !{!23, !24, !25}
!23 = !DIEnumerator(name: "G_KEY_FILE_NONE", value: 0)
!24 = !DIEnumerator(name: "G_KEY_FILE_KEEP_COMMENTS", value: 1)
!25 = !DIEnumerator(name: "G_KEY_FILE_KEEP_TRANSLATIONS", value: 2)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 51, size: 32, align: 32, elements: !28)
!27 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37}
!29 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!30 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!31 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!32 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!33 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!34 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!35 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!36 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!37 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 42, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/gmodule.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "G_MODULE_BIND_LAZY", value: 1)
!42 = !DIEnumerator(name: "G_MODULE_BIND_LOCAL", value: 2)
!43 = !DIEnumerator(name: "G_MODULE_BIND_MASK", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 155, size: 32, align: 32, elements: !46)
!45 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gsignal.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!46 = !{!47, !48}
!47 = !DIEnumerator(name: "G_CONNECT_AFTER", value: 1)
!48 = !DIEnumerator(name: "G_CONNECT_SWAPPED", value: 2)
!49 = !{!50, !109, !158, !159, !167, !172, !177}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProviderReg", file: !14, line: 66, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppProviderReg", file: !14, line: 63, size: 128, align: 64, elements: !53)
!53 = !{!54, !156}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prov", scope: !52, file: !14, line: 64, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProvider", file: !4, line: 434, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppProvider", file: !4, line: 373, size: 448, align: 64, elements: !58)
!58 = !{!59, !65, !67, !71, !126, !148, !152}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !57, file: !4, line: 375, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!64 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "regType", scope: !57, file: !4, line: 382, baseType: !66, size: 32, align: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "regSize", scope: !57, file: !4, line: 384, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 216, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!70 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !57, file: !4, line: 394, baseType: !72, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !110, !111}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !78)
!78 = !{!79, !81, !82, !86, !87, !92, !97, !101, !102, !103, !107}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !4, line: 243, baseType: !80, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !4, line: 245, baseType: !60, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !77, file: !4, line: 247, baseType: !83, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !63, line: 50, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !63, line: 49, baseType: !85)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !77, file: !4, line: 249, baseType: !85, size: 32, align: 32, offset: 160)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !77, file: !4, line: 251, baseType: !88, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !90, line: 56, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !90, line: 56, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !77, file: !4, line: 253, baseType: !93, size: 64, align: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !95, line: 48, baseType: !96)
!95 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !95, line: 48, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !77, file: !4, line: 255, baseType: !98, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !21, line: 48, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !21, line: 48, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !77, file: !4, line: 261, baseType: !85, size: 32, align: 32, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !77, file: !4, line: 263, baseType: !85, size: 32, align: 32, offset: 416)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !77, file: !4, line: 265, baseType: !104, size: 64, align: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !77, file: !4, line: 273, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !63, line: 77, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !114, line: 42, baseType: !115)
!114 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !114, line: 44, size: 128, align: 64, elements: !116)
!116 = !{!117, !123, !124}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !115, file: !114, line: 46, baseType: !118, size: 32, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !119, line: 36, baseType: !120)
!119 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !121, line: 45, baseType: !122)
!121 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!122 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !115, file: !114, line: 47, baseType: !84, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !115, file: !114, line: 48, baseType: !125, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "registerApp", scope: !57, file: !4, line: 406, baseType: !127, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!83, !75, !110, !130, !108}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !132)
!132 = !{!133, !134, !143, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !4, line: 503, baseType: !105, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !131, file: !4, line: 508, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !137, line: 37, baseType: !138)
!137 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !137, line: 41, size: 128, align: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !137, line: 43, baseType: !125, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !137, line: 44, baseType: !142, size: 32, align: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !63, line: 55, baseType: !122)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !131, file: !4, line: 539, baseType: !144, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!83, !75, !66, !108, !130}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !131, file: !4, line: 544, baseType: !108, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !57, file: !4, line: 420, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !75, !110}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dumpState", scope: !57, file: !4, line: 433, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !75, !110, !108}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !52, file: !14, line: 65, baseType: !157, size: 32, align: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppProviderState", file: !14, line: 60, baseType: !13)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !161, line: 389, baseType: !162)
!161 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !161, line: 406, size: 64, align: 64, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !162, file: !161, line: 409, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !161, line: 382, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !121, line: 66, baseType: !70)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !161, line: 391, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !161, line: 416, size: 64, align: 64, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !169, file: !161, line: 419, baseType: !159, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCallback", file: !173, line: 86, baseType: !174)
!173 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gclosure.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GConnectFlags", file: !45, line: 159, baseType: !44)
!178 = !{!179}
!179 = distinct !DIGlobalVariable(name: "cmdPrefix", scope: !180, file: !181, line: 193, type: !294, isLocal: true, isDefinition: true, variable: [28 x i8]* @ToolsCoreReportVersionData.cmdPrefix)
!180 = distinct !DISubprogram(name: "ToolsCoreReportVersionData", scope: !181, file: !181, line: 190, type: !182, isLocal: true, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !293)
!181 = !DIFile(filename: "mainLoop.c", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceState", file: !14, line: 100, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceState", file: !14, line: 69, size: 1472, align: 64, elements: !187)
!187 = !{!188, !189, !190, !196, !197, !198, !199, !200, !201, !208, !209, !213, !214, !289, !290, !291, !292}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !14, line: 70, baseType: !125, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "configFile", scope: !186, file: !14, line: 71, baseType: !125, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "configMtime", scope: !186, file: !14, line: 72, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !192, line: 75, baseType: !193)
!192 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !194, line: 139, baseType: !195)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!195 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "configCheckTask", scope: !186, file: !14, line: 73, baseType: !142, size: 32, align: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mainService", scope: !186, file: !14, line: 74, baseType: !83, size: 32, align: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "capsRegistered", scope: !186, file: !14, line: 75, baseType: !83, size: 32, align: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "commonPath", scope: !186, file: !14, line: 76, baseType: !125, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pluginPath", scope: !186, file: !14, line: 77, baseType: !125, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !186, file: !14, line: 78, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !137, line: 39, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !137, line: 53, size: 128, align: 64, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !204, file: !137, line: 55, baseType: !158, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !204, file: !137, line: 56, baseType: !142, size: 32, align: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pidFile", scope: !186, file: !14, line: 82, baseType: !125, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "debugLib", scope: !186, file: !14, line: 84, baseType: !210, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GModule", file: !39, line: 49, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GModule", file: !39, line: 49, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !186, file: !14, line: 85, baseType: !125, size: 64, align: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "debugData", scope: !186, file: !14, line: 86, baseType: !215, size: 64, align: 64, offset: 704)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugLibData", file: !217, line: 150, baseType: !218)
!217 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/rpcdebug.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugLibData", file: !217, line: 142, size: 192, align: 64, elements: !219)
!219 = !{!220, !225, !229}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "newDebugChannel", scope: !218, file: !217, line: 143, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!93, !75, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !218, file: !217, line: 145, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!85, !75, !108, !108, !224}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !218, file: !217, line: 149, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugPlugin", file: !217, line: 126, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugPlugin", file: !217, line: 112, size: 320, align: 64, elements: !233)
!233 = !{!234, !250, !251, !280, !286}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "recvFns", scope: !232, file: !217, line: 114, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvMapping", file: !217, line: 69, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugRecvMapping", file: !217, line: 59, size: 256, align: 64, elements: !238)
!238 = !{!239, !240, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !237, file: !217, line: 60, baseType: !125, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !237, file: !217, line: 61, baseType: !241, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvFn", file: !217, line: 53, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!83, !245, !68, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "xdrProc", scope: !237, file: !217, line: 66, baseType: !108, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "xdrSize", scope: !237, file: !217, line: 68, baseType: !68, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dfltRecvFn", scope: !232, file: !217, line: 119, baseType: !241, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "sendFn", scope: !232, file: !217, line: 121, baseType: !252, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugSendFn", file: !217, line: 102, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!83, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugMsgMapping", file: !217, line: 86, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugMsgMapping", file: !217, line: 81, size: 256, align: 64, elements: !259)
!259 = !{!260, !261, !262, !279}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !258, file: !217, line: 82, baseType: !125, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "messageLen", scope: !258, file: !217, line: 83, baseType: !68, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "validateFn", scope: !258, file: !217, line: 84, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugValidateFn", file: !217, line: 77, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!83, !267, !83}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !95, line: 77, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !95, line: 51, size: 512, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !95, line: 53, baseType: !105, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !269, file: !95, line: 58, baseType: !105, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !269, file: !95, line: 60, baseType: !68, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !269, file: !95, line: 65, baseType: !245, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !269, file: !95, line: 67, baseType: !68, size: 64, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !269, file: !95, line: 72, baseType: !83, size: 32, align: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !269, file: !95, line: 74, baseType: !109, size: 64, align: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !269, file: !95, line: 76, baseType: !109, size: 64, align: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "freeMsg", scope: !258, file: !217, line: 85, baseType: !83, size: 32, align: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownFn", scope: !232, file: !217, line: 123, baseType: !281, size: 64, align: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugShutdownFn", file: !217, line: 105, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !75, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !232, file: !217, line: 125, baseType: !287, size: 64, align: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !131)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !186, file: !14, line: 87, baseType: !76, size: 576, align: 64, offset: 768)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !186, file: !14, line: 88, baseType: !135, size: 64, align: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vsockDev", scope: !186, file: !14, line: 97, baseType: !85, size: 32, align: 32, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vsockFamily", scope: !186, file: !14, line: 98, baseType: !85, size: 32, align: 32, offset: 1440)
!293 = !{}
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 224, align: 8, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 28)
!297 = !{i32 2, !"Dwarf Version", i32 4}
!298 = !{i32 2, !"Debug Info Version", i32 3}
!299 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!300 = distinct !DISubprogram(name: "ToolsCore_DumpState", scope: !181, file: !181, line: 358, type: !182, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !293)
!301 = !DILocalVariable(name: "state", arg: 1, scope: !300, file: !181, line: 358, type: !184)
!302 = !DIExpression()
!303 = !DILocation(line: 358, column: 40, scope: !300)
!304 = !DILocalVariable(name: "i", scope: !300, file: !181, line: 360, type: !142)
!305 = !DILocation(line: 360, column: 10, scope: !300)
!306 = !DILocalVariable(name: "providerStates", scope: !300, file: !181, line: 361, type: !307)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 192, align: 64, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 3)
!310 = !DILocation(line: 361, column: 16, scope: !300)
!311 = !DILocation(line: 367, column: 4, scope: !300)
!312 = distinct !{!312, !311}
!313 = !DILocation(line: 367, column: 152, scope: !314)
!314 = !DILexicalBlockFile(scope: !315, file: !181, discriminator: 1)
!315 = distinct !DILexicalBlock(scope: !300, file: !181, line: 367, column: 7)
!316 = !DILocation(line: 369, column: 32, scope: !317)
!317 = distinct !DILexicalBlock(scope: !300, file: !181, line: 369, column: 8)
!318 = !DILocation(line: 369, column: 39, scope: !317)
!319 = !DILocation(line: 369, column: 43, scope: !317)
!320 = !DILocation(line: 369, column: 9, scope: !317)
!321 = !DILocation(line: 369, column: 8, scope: !300)
!322 = !DILocation(line: 372, column: 26, scope: !323)
!323 = distinct !DILexicalBlock(scope: !317, file: !181, line: 369, column: 54)
!324 = !DILocation(line: 372, column: 33, scope: !323)
!325 = !DILocation(line: 370, column: 7, scope: !323)
!326 = !DILocation(line: 373, column: 7, scope: !323)
!327 = !DILocation(line: 378, column: 23, scope: !300)
!328 = !DILocation(line: 378, column: 30, scope: !300)
!329 = !DILocation(line: 376, column: 4, scope: !300)
!330 = !DILocation(line: 381, column: 23, scope: !300)
!331 = !DILocation(line: 381, column: 30, scope: !300)
!332 = !DILocation(line: 379, column: 4, scope: !300)
!333 = !DILocation(line: 383, column: 11, scope: !334)
!334 = distinct !DILexicalBlock(scope: !300, file: !181, line: 383, column: 4)
!335 = !DILocation(line: 383, column: 9, scope: !334)
!336 = !DILocation(line: 383, column: 16, scope: !337)
!337 = !DILexicalBlockFile(scope: !338, file: !181, discriminator: 1)
!338 = distinct !DILexicalBlock(scope: !334, file: !181, line: 383, column: 4)
!339 = !DILocation(line: 383, column: 20, scope: !337)
!340 = !DILocation(line: 383, column: 27, scope: !337)
!341 = !DILocation(line: 383, column: 38, scope: !337)
!342 = !DILocation(line: 383, column: 18, scope: !337)
!343 = !DILocation(line: 383, column: 4, scope: !337)
!344 = !DILocalVariable(name: "prov", scope: !345, file: !181, line: 384, type: !50)
!345 = distinct !DILexicalBlock(scope: !338, file: !181, line: 383, column: 48)
!346 = !DILocation(line: 384, column: 28, scope: !345)
!347 = !DILocation(line: 384, column: 98, scope: !345)
!348 = !DILocation(line: 384, column: 37, scope: !345)
!349 = !DILocation(line: 384, column: 71, scope: !345)
!350 = !DILocation(line: 384, column: 78, scope: !345)
!351 = !DILocation(line: 384, column: 90, scope: !345)
!352 = !DILocation(line: 384, column: 38, scope: !345)
!353 = !DILocation(line: 389, column: 26, scope: !345)
!354 = !DILocation(line: 389, column: 32, scope: !345)
!355 = !DILocation(line: 389, column: 38, scope: !345)
!356 = !DILocation(line: 390, column: 41, scope: !345)
!357 = !DILocation(line: 390, column: 47, scope: !345)
!358 = !DILocation(line: 390, column: 26, scope: !345)
!359 = !DILocation(line: 387, column: 7, scope: !345)
!360 = !DILocation(line: 391, column: 11, scope: !361)
!361 = distinct !DILexicalBlock(scope: !345, file: !181, line: 391, column: 11)
!362 = !DILocation(line: 391, column: 17, scope: !361)
!363 = !DILocation(line: 391, column: 23, scope: !361)
!364 = !DILocation(line: 391, column: 33, scope: !361)
!365 = !DILocation(line: 391, column: 11, scope: !345)
!366 = !DILocation(line: 392, column: 10, scope: !367)
!367 = distinct !DILexicalBlock(scope: !361, file: !181, line: 391, column: 41)
!368 = !DILocation(line: 392, column: 16, scope: !367)
!369 = !DILocation(line: 392, column: 22, scope: !367)
!370 = !DILocation(line: 392, column: 33, scope: !367)
!371 = !DILocation(line: 392, column: 40, scope: !367)
!372 = !DILocation(line: 392, column: 45, scope: !367)
!373 = !DILocation(line: 392, column: 51, scope: !367)
!374 = !DILocation(line: 393, column: 7, scope: !367)
!375 = !DILocation(line: 394, column: 4, scope: !345)
!376 = !DILocation(line: 383, column: 44, scope: !377)
!377 = !DILexicalBlockFile(scope: !338, file: !181, discriminator: 2)
!378 = !DILocation(line: 383, column: 4, scope: !377)
!379 = distinct !{!379, !380}
!380 = !DILocation(line: 383, column: 4, scope: !300)
!381 = !DILocation(line: 396, column: 29, scope: !300)
!382 = !DILocation(line: 396, column: 4, scope: !300)
!383 = !DILocation(line: 398, column: 26, scope: !300)
!384 = !DILocation(line: 398, column: 33, scope: !300)
!385 = !DILocation(line: 398, column: 37, scope: !300)
!386 = !DILocation(line: 400, column: 27, scope: !300)
!387 = !DILocation(line: 400, column: 34, scope: !300)
!388 = !DILocation(line: 398, column: 4, scope: !300)
!389 = !DILocation(line: 401, column: 1, scope: !300)
!390 = !DILocation(line: 401, column: 1, scope: !391)
!391 = !DILexicalBlockFile(scope: !300, file: !181, discriminator: 1)
!392 = distinct !DISubprogram(name: "ToolsCore_LogState", scope: !4, file: !4, line: 101, type: !393, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !293)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !142, !105, null}
!395 = !DILocalVariable(name: "level", arg: 1, scope: !392, file: !4, line: 101, type: !142)
!396 = !DILocation(line: 101, column: 26, scope: !392)
!397 = !DILocalVariable(name: "fmt", arg: 2, scope: !392, file: !4, line: 102, type: !105)
!398 = !DILocation(line: 102, column: 32, scope: !392)
!399 = !DILocalVariable(name: "indented", scope: !392, file: !4, line: 105, type: !125)
!400 = !DILocation(line: 105, column: 11, scope: !392)
!401 = !DILocation(line: 105, column: 51, scope: !392)
!402 = !DILocation(line: 105, column: 49, scope: !392)
!403 = !DILocation(line: 105, column: 62, scope: !392)
!404 = !DILocation(line: 105, column: 22, scope: !392)
!405 = !DILocalVariable(name: "args", scope: !392, file: !4, line: 107, type: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !407, line: 98, baseType: !408)
!407 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/open-vm-tools/line1383")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !407, line: 40, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 107, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 192, align: 64, elements: !417)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 107, size: 192, align: 64, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !411, file: !1, line: 107, baseType: !122, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !411, file: !1, line: 107, baseType: !122, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !411, file: !1, line: 107, baseType: !109, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !411, file: !1, line: 107, baseType: !109, size: 64, align: 64, offset: 128)
!417 = !{!418}
!418 = !DISubrange(count: 1)
!419 = !DILocation(line: 107, column: 12, scope: !392)
!420 = !DILocation(line: 108, column: 3, scope: !392)
!421 = !DILocation(line: 109, column: 38, scope: !392)
!422 = !DILocation(line: 109, column: 48, scope: !392)
!423 = !DILocation(line: 109, column: 4, scope: !392)
!424 = !DILocation(line: 110, column: 3, scope: !392)
!425 = !DILocation(line: 112, column: 11, scope: !392)
!426 = !DILocation(line: 112, column: 4, scope: !392)
!427 = !DILocation(line: 113, column: 1, scope: !392)
!428 = distinct !DISubprogram(name: "ToolsCore_GetTcloName", scope: !181, file: !181, line: 414, type: !429, isLocal: false, isDefinition: true, scopeLine: 415, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !293)
!429 = !DISubroutineType(types: !430)
!430 = !{!105, !184}
!431 = !DILocalVariable(name: "state", arg: 1, scope: !428, file: !181, line: 414, type: !184)
!432 = !DILocation(line: 414, column: 42, scope: !428)
!433 = !DILocation(line: 416, column: 8, scope: !434)
!434 = distinct !DILexicalBlock(scope: !428, file: !181, line: 416, column: 8)
!435 = !DILocation(line: 416, column: 15, scope: !434)
!436 = !DILocation(line: 416, column: 8, scope: !428)
!437 = !DILocation(line: 417, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !181, line: 416, column: 28)
!439 = !DILocation(line: 418, column: 24, scope: !440)
!440 = distinct !DILexicalBlock(scope: !434, file: !181, line: 418, column: 15)
!441 = !DILocation(line: 418, column: 32, scope: !440)
!442 = !DILocation(line: 418, column: 16, scope: !440)
!443 = !DILocation(line: 418, column: 47, scope: !440)
!444 = !DILocation(line: 418, column: 15, scope: !434)
!445 = !DILocation(line: 419, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !440, file: !181, line: 418, column: 54)
!447 = !DILocation(line: 421, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !440, file: !181, line: 420, column: 11)
!449 = !DILocation(line: 423, column: 1, scope: !428)
!450 = distinct !DISubprogram(name: "ToolsCore_ReloadConfig", scope: !181, file: !181, line: 437, type: !451, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !293)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !184, !83}
!453 = !DILocalVariable(name: "state", arg: 1, scope: !450, file: !181, line: 437, type: !184)
!454 = !DILocation(line: 437, column: 43, scope: !450)
!455 = !DILocalVariable(name: "reset", arg: 2, scope: !450, file: !181, line: 438, type: !83)
!456 = !DILocation(line: 438, column: 33, scope: !450)
!457 = !DILocalVariable(name: "first", scope: !450, file: !181, line: 440, type: !83)
!458 = !DILocation(line: 440, column: 13, scope: !450)
!459 = !DILocation(line: 440, column: 21, scope: !450)
!460 = !DILocation(line: 440, column: 28, scope: !450)
!461 = !DILocation(line: 440, column: 32, scope: !450)
!462 = !DILocation(line: 440, column: 39, scope: !450)
!463 = !DILocalVariable(name: "loaded", scope: !450, file: !181, line: 441, type: !83)
!464 = !DILocation(line: 441, column: 13, scope: !450)
!465 = !DILocation(line: 443, column: 32, scope: !450)
!466 = !DILocation(line: 443, column: 39, scope: !450)
!467 = !DILocation(line: 445, column: 33, scope: !450)
!468 = !DILocation(line: 445, column: 40, scope: !450)
!469 = !DILocation(line: 445, column: 44, scope: !450)
!470 = !DILocation(line: 446, column: 33, scope: !450)
!471 = !DILocation(line: 446, column: 40, scope: !450)
!472 = !DILocation(line: 443, column: 13, scope: !450)
!473 = !DILocation(line: 443, column: 11, scope: !450)
!474 = !DILocation(line: 448, column: 9, scope: !475)
!475 = distinct !DILexicalBlock(scope: !450, file: !181, line: 448, column: 8)
!476 = !DILocation(line: 448, column: 15, scope: !475)
!477 = !DILocation(line: 448, column: 18, scope: !478)
