; ModuleID = './hostinfoPosix.o.i'
source_filename = "./hostinfoPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Atomic_uint64 = type { i64 }
%struct.Atomic_uint32 = type { i32 }
%struct.DistroInfo = type { i8*, i8* }
%struct.DistroNameScan = type { i8*, i8* }
%struct.hostinfoOSVersion = type { [4 x i32], i8* }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.timespec = type { i64, i64 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct.rlimit = type { i64, i64 }
%struct.itimerval = type { %struct.timeval, %struct.timeval }
%union.anon.8 = type { i32 }
%union.anon.9 = type { i32 }
%union.anon.10 = type { i32 }
%union.anon.11 = type { i32 }
%union.anon.12 = type { i32 }
%struct.vmware_sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }

!579 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!580 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!581 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!582 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!583 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!584 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!585 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!586 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!587 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!588 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!589 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!590 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!591 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!592 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!593 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!594 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!595 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!596 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 42, size: 32, align: 32, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIEnumerator(name: "HOSTINFO_PROCESS_QUERY_DEAD", value: 0)
!599 = !DIEnumerator(name: "HOSTINFO_PROCESS_QUERY_ALIVE", value: 1)
!600 = !DIEnumerator(name: "HOSTINFO_PROCESS_QUERY_UNKNOWN", value: 2)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 46, size: 32, align: 32, elements: !603)
!602 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!604 = !DIEnumerator(name: "_ISupper", value: 256)
!605 = !DIEnumerator(name: "_ISlower", value: 512)
!606 = !DIEnumerator(name: "_ISalpha", value: 1024)
!607 = !DIEnumerator(name: "_ISdigit", value: 2048)
!608 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!609 = !DIEnumerator(name: "_ISspace", value: 8192)
!610 = !DIEnumerator(name: "_ISprint", value: 16384)
!611 = !DIEnumerator(name: "_ISgraph", value: 32768)
!612 = !DIEnumerator(name: "_ISblank", value: 1)
!613 = !DIEnumerator(name: "_IScntrl", value: 2)
!614 = !DIEnumerator(name: "_ISpunct", value: 4)
!615 = !DIEnumerator(name: "_ISalnum", value: 8)
!616 = !{!617, !622, !623, !627, !628, !633, !634, !626, !635, !638, !639, !640, !641, !644, !645}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !618, line: 172, baseType: !619)
!618 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !620, line: 197, baseType: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!621 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !618, line: 173, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !625, line: 51, baseType: !626)
!625 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!626 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !618, line: 354, baseType: !617)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !629, line: 85, baseType: !630)
!629 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !633}
!633 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!634 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !618, line: 171, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !625, line: 55, baseType: !637)
!637 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!638 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !625, line: 122, baseType: !637)
!640 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !620, line: 80, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !643, line: 125, baseType: !626)
!643 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysinfo", file: !647, line: 7, size: 896, align: 64, elements: !648)
!647 = !DIFile(filename: "/usr/include/linux/sysinfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!648 = !{!649, !652, !657, !658, !659, !660, !661, !662, !663, !666, !667, !668, !669, !671}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "uptime", scope: !646, file: !647, line: 8, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !651, line: 14, baseType: !621)
!651 = !DIFile(filename: "/usr/include/asm-generic/posix_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "loads", scope: !646, file: !647, line: 9, baseType: !653, size: 192, align: 64, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 192, align: 64, elements: !655)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !651, line: 15, baseType: !637)
!655 = !{!656}
!656 = !DISubrange(count: 3)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "totalram", scope: !646, file: !647, line: 10, baseType: !654, size: 64, align: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "freeram", scope: !646, file: !647, line: 11, baseType: !654, size: 64, align: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sharedram", scope: !646, file: !647, line: 12, baseType: !654, size: 64, align: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bufferram", scope: !646, file: !647, line: 13, baseType: !654, size: 64, align: 64, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "totalswap", scope: !646, file: !647, line: 14, baseType: !654, size: 64, align: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "freeswap", scope: !646, file: !647, line: 15, baseType: !654, size: 64, align: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "procs", scope: !646, file: !647, line: 16, baseType: !664, size: 16, align: 16, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !665, line: 23, baseType: !638)
!665 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !646, file: !647, line: 17, baseType: !664, size: 16, align: 16, offset: 656)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "totalhigh", scope: !646, file: !647, line: 18, baseType: !654, size: 64, align: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "freehigh", scope: !646, file: !647, line: 19, baseType: !654, size: 64, align: 64, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mem_unit", scope: !646, file: !647, line: 20, baseType: !670, size: 32, align: 32, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !665, line: 26, baseType: !626)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_f", scope: !646, file: !647, line: 21, baseType: !672, align: 8, offset: 864)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, align: 8, elements: !674)
!673 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!674 = !{!675}
!675 = !DISubrange(count: 0)
!676 = !{!677, !683, !695, !705, !706, !707, !717, !727, !731}
!677 = distinct !DIGlobalVariable(name: "count", scope: !678, file: !679, line: 1629, type: !633, isLocal: true, isDefinition: true, variable: i32* @Hostinfo_NumCPUs.count)
!678 = distinct !DISubprogram(name: "Hostinfo_NumCPUs", scope: !679, file: !679, line: 1572, type: !680, isLocal: false, isDefinition: true, scopeLine: 1573, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!679 = !DIFile(filename: "hostinfoPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!680 = !DISubroutineType(types: !681)
!681 = !{!623}
!682 = !{}
!683 = distinct !DIGlobalVariable(name: "state", scope: !684, file: !679, line: 1695, type: !688, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint64* @Hostinfo_NameGet.state)
!684 = distinct !DISubprogram(name: "Hostinfo_NameGet", scope: !679, file: !679, line: 1691, type: !685, isLocal: false, isDefinition: true, scopeLine: 1692, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!685 = !DISubroutineType(types: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !689, line: 3829, baseType: !690)
!689 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !689, line: 139, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !689, line: 137, size: 64, align: 64, elements: !692)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !691, file: !689, line: 138, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !635)
!695 = distinct !DIGlobalVariable(name: "fdStorage", scope: !696, file: !679, line: 3055, type: !699, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @Hostinfo_SystemUpTime.fdStorage)
!696 = distinct !DISubprogram(name: "Hostinfo_SystemUpTime", scope: !679, file: !679, line: 3045, type: !697, isLocal: false, isDefinition: true, scopeLine: 3046, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!697 = !DISubroutineType(types: !698)
!698 = !{!627}
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Int", file: !689, line: 3833, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !689, line: 135, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !689, line: 133, size: 32, align: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !701, file: !689, line: 134, baseType: !704, size: 32, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!705 = distinct !DIGlobalVariable(name: "logFailedPread", scope: !696, file: !679, line: 3056, type: !700, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @Hostinfo_SystemUpTime.logFailedPread)
!706 = distinct !DIGlobalVariable(name: "hostinfoOSVersion", scope: !0, file: !679, line: 152, type: !688, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint64* @hostinfoOSVersion)
!707 = distinct !DIGlobalVariable(name: "distroArray", scope: !0, file: !679, line: 181, type: !708, isLocal: true, isDefinition: true, variable: [41 x %struct.DistroInfo]* @distroArray)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 5248, align: 64, elements: !715)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistroInfo", file: !679, line: 178, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !679, line: 175, size: 128, align: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !679, line: 176, baseType: !687, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !711, file: !679, line: 177, baseType: !687, size: 64, align: 64, offset: 64)
!715 = !{!716}
!716 = !DISubrange(count: 41)
!717 = distinct !DIGlobalVariable(name: "lsbFields", scope: !0, file: !679, line: 162, type: !718, isLocal: true, isDefinition: true, variable: [5 x %struct.DistroNameScan]* @lsbFields)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 640, align: 64, elements: !725)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistroNameScan", file: !679, line: 160, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !679, line: 157, size: 128, align: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !679, line: 158, baseType: !687, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scanString", scope: !721, file: !679, line: 159, baseType: !687, size: 64, align: 64, offset: 64)
!725 = !{!726}
!726 = !DISubrange(count: 5)
!727 = distinct !DIGlobalVariable(name: "osReleaseFields", scope: !0, file: !679, line: 170, type: !728, isLocal: true, isDefinition: true, variable: [2 x %struct.DistroNameScan]* @osReleaseFields)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 256, align: 64, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 2)
!731 = distinct !DIGlobalVariable(name: "mutex", scope: !732, file: !679, line: 490, type: !700, isLocal: true, isDefinition: true, variable: %struct.Atomic_uint32* @HostinfoPostData.mutex)
!732 = distinct !DISubprogram(name: "HostinfoPostData", scope: !679, file: !679, line: 486, type: !733, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !735, !687}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!737 = !{i32 2, !"Dwarf Version", i32 4}
!738 = !{i32 2, !"Debug Info Version", i32 3}
!739 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!740 = distinct !DISubprogram(name: "Hostinfo_OSVersionString", scope: !679, file: !679, line: 327, type: !741, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!741 = !DISubroutineType(types: !742)
!742 = !{!735}
!743 = !DILocalVariable(name: "version", scope: !740, file: !679, line: 329, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hostinfoOSVersion", file: !679, line: 147, size: 192, align: 64, elements: !746)
!746 = !{!747, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfoOSVersion", scope: !745, file: !679, line: 148, baseType: !748, size: 128, align: 32)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 128, align: 32, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 4)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hostinfoOSVersionString", scope: !745, file: !679, line: 149, baseType: !687, size: 64, align: 64, offset: 128)
!752 = !DIExpression()
!753 = !DILocation(line: 329, column: 30, scope: !740)
!754 = !DILocation(line: 331, column: 4, scope: !740)
!755 = !DILocation(line: 333, column: 14, scope: !740)
!756 = !DILocation(line: 333, column: 12, scope: !740)
!757 = !DILocation(line: 335, column: 11, scope: !740)
!758 = !DILocation(line: 335, column: 20, scope: !740)
!759 = !DILocation(line: 335, column: 4, scope: !740)
!760 = distinct !DISubprogram(name: "HostinfoOSVersionInit", scope: !679, file: !679, line: 252, type: !761, isLocal: true, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!761 = !DISubroutineType(types: !762)
!762 = !{null}
!763 = !DILocalVariable(name: "version", scope: !760, file: !679, line: 254, type: !744)
!764 = !DILocation(line: 254, column: 30, scope: !760)
!765 = !DILocalVariable(name: "u", scope: !760, file: !679, line: 255, type: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !767, line: 48, size: 3120, align: 8, elements: !768)
!767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!768 = !{!769, !773, !774, !775, !776, !777}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !766, file: !767, line: 51, baseType: !770, size: 520, align: 8)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 520, align: 8, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 65)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !766, file: !767, line: 54, baseType: !770, size: 520, align: 8, offset: 520)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !766, file: !767, line: 57, baseType: !770, size: 520, align: 8, offset: 1040)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !766, file: !767, line: 59, baseType: !770, size: 520, align: 8, offset: 1560)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !766, file: !767, line: 62, baseType: !770, size: 520, align: 8, offset: 2080)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !766, file: !767, line: 67, baseType: !770, size: 520, align: 8, offset: 2600)
!778 = !DILocation(line: 255, column: 19, scope: !760)
!779 = !DILocalVariable(name: "extra", scope: !760, file: !679, line: 256, type: !687)
!780 = !DILocation(line: 256, column: 10, scope: !760)
!781 = !DILocalVariable(name: "p", scope: !760, file: !679, line: 257, type: !687)
!782 = !DILocation(line: 257, column: 10, scope: !760)
!783 = !DILocation(line: 259, column: 8, scope: !784)
!784 = distinct !DILexicalBlock(scope: !760, file: !679, line: 259, column: 8)
!785 = !DILocation(line: 259, column: 8, scope: !760)
!786 = !DILocation(line: 260, column: 7, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !679, line: 259, column: 44)
!788 = !DILocation(line: 263, column: 8, scope: !789)
!789 = distinct !DILexicalBlock(scope: !760, file: !679, line: 263, column: 8)
!790 = !DILocation(line: 263, column: 18, scope: !789)
!791 = !DILocation(line: 263, column: 8, scope: !760)
!792 = !DILocation(line: 265, column: 40, scope: !793)
!793 = distinct !DILexicalBlock(scope: !789, file: !679, line: 263, column: 23)
!794 = !DILocation(line: 265, column: 39, scope: !793)
!795 = !DILocation(line: 265, column: 22, scope: !796)
!796 = !DILexicalBlockFile(scope: !793, file: !679, discriminator: 1)
!797 = !DILocation(line: 264, column: 7, scope: !793)
!798 = !DILocation(line: 266, column: 7, scope: !793)
!799 = !DILocation(line: 269, column: 14, scope: !760)
!800 = !DILocation(line: 269, column: 12, scope: !760)
!801 = !DILocation(line: 270, column: 59, scope: !760)
!802 = !DILocation(line: 270, column: 56, scope: !760)
!803 = !DILocation(line: 270, column: 39, scope: !760)
!804 = !DILocation(line: 270, column: 4, scope: !760)
!805 = !DILocation(line: 270, column: 13, scope: !760)
!806 = !DILocation(line: 270, column: 37, scope: !760)
!807 = !DILocation(line: 281, column: 12, scope: !760)
!808 = !DILocation(line: 281, column: 10, scope: !760)
!809 = !DILocation(line: 282, column: 17, scope: !810)
!810 = distinct !DILexicalBlock(scope: !760, file: !679, line: 282, column: 8)
!811 = !DILocation(line: 282, column: 15, scope: !810)
!812 = !DILocation(line: 283, column: 9, scope: !810)
!813 = !DILocation(line: 283, column: 18, scope: !810)
!814 = !DILocation(line: 283, column: 41, scope: !810)
!815 = !DILocation(line: 283, column: 50, scope: !810)
!816 = !DILocation(line: 284, column: 9, scope: !810)
!817 = !DILocation(line: 284, column: 18, scope: !810)
!818 = !DILocation(line: 284, column: 40, scope: !810)
!819 = !DILocation(line: 282, column: 8, scope: !810)
!820 = !DILocation(line: 284, column: 47, scope: !810)
!821 = !DILocation(line: 282, column: 8, scope: !760)
!822 = !DILocation(line: 286, column: 31, scope: !823)
!823 = distinct !DILexicalBlock(scope: !810, file: !679, line: 284, column: 52)
!824 = !DILocation(line: 286, column: 29, scope: !823)
!825 = !DILocation(line: 285, column: 7, scope: !823)
!826 = !DILocation(line: 287, column: 7, scope: !823)
!827 = !DILocation(line: 295, column: 8, scope: !760)
!828 = !DILocation(line: 295, column: 6, scope: !760)
!829 = !DILocation(line: 296, column: 4, scope: !760)
!830 = !DILocation(line: 296, column: 12, scope: !831)
!831 = !DILexicalBlockFile(scope: !760, file: !679, discriminator: 1)
!832 = !DILocation(line: 296, column: 11, scope: !831)
!833 = !DILocation(line: 296, column: 14, scope: !831)
!834 = !DILocation(line: 296, column: 18, scope: !835)
!835 = !DILexicalBlockFile(scope: !760, file: !679, discriminator: 2)
!836 = !DILocation(line: 296, column: 17, scope: !835)
!837 = !DILocation(line: 296, column: 38, scope: !835)
!838 = !DILocation(line: 296, column: 20, scope: !835)
!839 = !DILocation(line: 296, column: 19, scope: !835)
!840 = !DILocation(line: 296, column: 21, scope: !835)
!841 = !DILocation(line: 296, column: 4, scope: !842)
!842 = !DILexicalBlockFile(scope: !760, file: !679, discriminator: 3)
!843 = !DILocation(line: 297, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !760, file: !679, line: 296, column: 30)
!845 = !DILocation(line: 296, column: 4, scope: !846)
!846 = !DILexicalBlockFile(scope: !760, file: !679, discriminator: 4)
!847 = distinct !{!847, !829}
!848 = !DILocation(line: 299, column: 11, scope: !760)
!849 = !DILocation(line: 299, column: 21, scope: !760)
!850 = !DILocation(line: 299, column: 30, scope: !760)
!851 = !DILocation(line: 299, column: 4, scope: !760)
!852 = !DILocation(line: 300, column: 9, scope: !760)
!853 = !DILocation(line: 300, column: 4, scope: !760)
!854 = !DILocation(line: 302, column: 60, scope: !855)
!855 = distinct !DILexicalBlock(scope: !760, file: !679, line: 302, column: 8)
!856 = !DILocation(line: 302, column: 8, scope: !855)
!857 = !DILocation(line: 302, column: 8, scope: !760)
!858 = !DILocation(line: 303, column: 12, scope: !859)
!859 = distinct !DILexicalBlock(scope: !855, file: !679, line: 302, column: 70)
!860 = !DILocation(line: 303, column: 21, scope: !859)
!861 = !DILocation(line: 303, column: 7, scope: !859)
!862 = !DILocation(line: 304, column: 12, scope: !859)
!863 = !DILocation(line: 304, column: 7, scope: !859)
!864 = !DILocation(line: 305, column: 4, scope: !859)
!865 = !DILocation(line: 306, column: 1, scope: !760)
!866 = distinct !DISubprogram(name: "Atomic_ReadPtr", scope: !689, file: !689, line: 3829, type: !867, isLocal: true, isDefinition: true, scopeLine: 3829, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!867 = !DISubroutineType(types: !868)
!868 = !{!622, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!871 = !DILocalVariable(name: "var", arg: 1, scope: !866, file: !689, line: 3829, type: !869)
!872 = !DILocation(line: 3829, column: 368, scope: !866)
!873 = !DILocation(line: 3829, column: 415, scope: !866)
!874 = !DILocation(line: 3829, column: 401, scope: !866)
!875 = !DILocation(line: 3829, column: 382, scope: !866)
!876 = !DILocation(line: 3829, column: 375, scope: !866)
!877 = distinct !DISubprogram(name: "Hostinfo_OSVersion", scope: !679, file: !679, line: 357, type: !878, isLocal: false, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!878 = !DISubroutineType(types: !879)
!879 = !{!633, !626}
!880 = !DILocalVariable(name: "i", arg: 1, scope: !877, file: !679, line: 357, type: !626)
!881 = !DILocation(line: 357, column: 33, scope: !877)
!882 = !DILocalVariable(name: "version", scope: !877, file: !679, line: 359, type: !744)
!883 = !DILocation(line: 359, column: 30, scope: !877)
!884 = !DILocation(line: 361, column: 4, scope: !877)
!885 = !DILocation(line: 363, column: 14, scope: !877)
!886 = !DILocation(line: 363, column: 12, scope: !877)
!887 = !DILocation(line: 365, column: 12, scope: !877)
!888 = !DILocation(line: 365, column: 14, scope: !877)
!889 = !DILocation(line: 365, column: 11, scope: !877)
!890 = !DILocation(line: 366, column: 39, scope: !877)
!891 = !DILocation(line: 366, column: 12, scope: !877)
!892 = !DILocation(line: 366, column: 21, scope: !877)
!893 = !DILocation(line: 365, column: 11, scope: !894)
!894 = !DILexicalBlockFile(scope: !877, file: !679, discriminator: 1)
!895 = !DILocation(line: 365, column: 11, scope: !896)
!896 = !DILexicalBlockFile(scope: !877, file: !679, discriminator: 2)
!897 = !DILocation(line: 365, column: 11, scope: !898)
!898 = !DILexicalBlockFile(scope: !877, file: !679, discriminator: 3)
!899 = !DILocation(line: 365, column: 4, scope: !898)
!900 = distinct !DISubprogram(name: "Hostinfo_GetTimeOfDay", scope: !679, file: !679, line: 388, type: !901, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!904 = !DILocalVariable(name: "time", arg: 1, scope: !900, file: !679, line: 388, type: !903)
!905 = !DILocation(line: 388, column: 35, scope: !900)
!906 = !DILocalVariable(name: "tv", scope: !900, file: !679, line: 390, type: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !908, line: 30, size: 128, align: 64, elements: !909)
!908 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!909 = !{!910, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !907, file: !908, line: 32, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !643, line: 139, baseType: !621)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !907, file: !908, line: 33, baseType: !913, size: 64, align: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !643, line: 141, baseType: !621)
!914 = !DILocation(line: 390, column: 19, scope: !900)
!915 = !DILocation(line: 392, column: 4, scope: !900)
!916 = !DILocation(line: 394, column: 23, scope: !900)
!917 = !DILocation(line: 394, column: 30, scope: !900)
!918 = !DILocation(line: 394, column: 46, scope: !900)
!919 = !DILocation(line: 394, column: 41, scope: !900)
!920 = !DILocation(line: 394, column: 5, scope: !900)
!921 = !DILocation(line: 394, column: 10, scope: !900)
!922 = !DILocation(line: 395, column: 1, scope: !900)
!923 = distinct !DISubprogram(name: "Hostinfo_GetSystemBitness", scope: !679, file: !679, line: 416, type: !924, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!924 = !DISubroutineType(types: !925)
!925 = !{!633}
!926 = !DILocalVariable(name: "u", scope: !923, file: !679, line: 419, type: !766)
!927 = !DILocation(line: 419, column: 19, scope: !923)
!928 = !DILocation(line: 421, column: 8, scope: !929)
!929 = distinct !DILexicalBlock(scope: !923, file: !679, line: 421, column: 8)
!930 = !DILocation(line: 421, column: 18, scope: !929)
!931 = !DILocation(line: 421, column: 8, scope: !923)
!932 = !DILocation(line: 422, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !929, file: !679, line: 421, column: 23)
!934 = !DILocation(line: 425, column: 17, scope: !935)
!935 = distinct !DILexicalBlock(scope: !923, file: !679, line: 425, column: 8)
!936 = !DILocation(line: 425, column: 15, scope: !935)
!937 = !DILocation(line: 425, column: 8, scope: !935)
!938 = !DILocation(line: 425, column: 8, scope: !923)
!939 = !DILocation(line: 426, column: 7, scope: !940)
!940 = distinct !DILexicalBlock(scope: !935, file: !679, line: 425, column: 37)
!941 = !DILocation(line: 428, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !935, file: !679, line: 427, column: 11)
!943 = !DILocation(line: 466, column: 1, scope: !923)
!944 = distinct !DISubprogram(name: "HostinfoOSData", scope: !679, file: !679, line: 1511, type: !945, isLocal: false, isDefinition: true, scopeLine: 1512, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!945 = !DISubroutineType(types: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !618, line: 230, baseType: !673)
!948 = !DILocalVariable(name: "success", scope: !944, file: !679, line: 1513, type: !947)
!949 = !DILocation(line: 1513, column: 9, scope: !944)
!950 = !DILocalVariable(name: "buf", scope: !944, file: !679, line: 1514, type: !766)
!951 = !DILocation(line: 1514, column: 19, scope: !944)
!952 = !DILocation(line: 1520, column: 8, scope: !953)
!953 = distinct !DILexicalBlock(scope: !944, file: !679, line: 1520, column: 8)
!954 = !DILocation(line: 1520, column: 20, scope: !953)
!955 = !DILocation(line: 1520, column: 8, scope: !944)
!956 = !DILocation(line: 1521, column: 55, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !679, line: 1520, column: 25)
!958 = !DILocation(line: 1521, column: 54, scope: !957)
!959 = !DILocation(line: 1521, column: 7, scope: !960)
!960 = !DILexicalBlockFile(scope: !957, file: !679, discriminator: 1)
!961 = !DILocation(line: 1523, column: 7, scope: !957)
!962 = !DILocation(line: 1531, column: 19, scope: !963)
!963 = distinct !DILexicalBlock(scope: !944, file: !679, line: 1531, column: 8)
!964 = !DILocation(line: 1531, column: 15, scope: !963)
!965 = !DILocation(line: 1531, column: 8, scope: !963)
!966 = !DILocation(line: 1531, column: 8, scope: !944)
!967 = !DILocation(line: 1532, column: 17, scope: !968)
!968 = distinct !DILexicalBlock(scope: !963, file: !679, line: 1531, column: 38)
!969 = !DILocation(line: 1532, column: 15, scope: !968)
!970 = !DILocation(line: 1533, column: 4, scope: !968)
!971 = !DILocation(line: 1533, column: 26, scope: !972)
!972 = !DILexicalBlockFile(scope: !973, file: !679, discriminator: 1)
!973 = distinct !DILexicalBlock(scope: !963, file: !679, line: 1533, column: 15)
!974 = !DILocation(line: 1533, column: 22, scope: !972)
!975 = !DILocation(line: 1533, column: 15, scope: !972)
!976 = !DILocation(line: 1534, column: 17, scope: !977)
!977 = distinct !DILexicalBlock(scope: !973, file: !679, line: 1533, column: 47)
!978 = !DILocation(line: 1534, column: 15, scope: !977)
!979 = !DILocation(line: 1535, column: 4, scope: !977)
!980 = !DILocation(line: 1535, column: 26, scope: !981)
!981 = !DILexicalBlockFile(scope: !982, file: !679, discriminator: 1)
!982 = distinct !DILexicalBlock(scope: !973, file: !679, line: 1535, column: 15)
!983 = !DILocation(line: 1535, column: 22, scope: !981)
!984 = !DILocation(line: 1535, column: 15, scope: !981)
!985 = !DILocation(line: 1536, column: 17, scope: !986)
!986 = distinct !DILexicalBlock(scope: !982, file: !679, line: 1535, column: 45)
!987 = !DILocation(line: 1536, column: 15, scope: !986)
!988 = !DILocation(line: 1537, column: 4, scope: !986)
!989 = !DILocation(line: 1538, column: 15, scope: !990)
!990 = distinct !DILexicalBlock(scope: !982, file: !679, line: 1537, column: 11)
!991 = !DILocation(line: 1542, column: 11, scope: !944)
!992 = !DILocation(line: 1542, column: 4, scope: !944)
!993 = !DILocation(line: 1543, column: 1, scope: !944)
!994 = distinct !DISubprogram(name: "HostinfoLinux", scope: !679, file: !679, line: 1317, type: !995, isLocal: true, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!995 = !DISubroutineType(types: !996)
!996 = !{!947, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!998 = !DILocalVariable(name: "buf", arg: 1, scope: !994, file: !679, line: 1317, type: !997)
!999 = !DILocation(line: 1317, column: 31, scope: !994)
!1000 = !DILocalVariable(name: "len", scope: !994, file: !679, line: 1319, type: !633)
!1001 = !DILocation(line: 1319, column: 8, scope: !994)
!1002 = !DILocalVariable(name: "distro", scope: !994, file: !679, line: 1320, type: !1003)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 8192, align: 8, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 1024)
!1006 = !DILocation(line: 1320, column: 9, scope: !994)
!1007 = !DILocalVariable(name: "distroShort", scope: !994, file: !679, line: 1321, type: !1003)
!1008 = !DILocation(line: 1321, column: 9, scope: !994)
!1009 = !DILocalVariable(name: "osName", scope: !994, file: !679, line: 1322, type: !1010)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 1024, align: 8, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 128)
!1013 = !DILocation(line: 1322, column: 9, scope: !994)
!1014 = !DILocalVariable(name: "osNameFull", scope: !994, file: !679, line: 1323, type: !1015)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 4096, align: 8, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 512)
!1018 = !DILocation(line: 1323, column: 9, scope: !994)
!1019 = !DILocation(line: 1326, column: 20, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !994, file: !679, line: 1326, column: 8)
!1021 = !DILocation(line: 1326, column: 8, scope: !1020)
!1022 = !DILocation(line: 1326, column: 8, scope: !994)
!1023 = !DILocation(line: 1327, column: 36, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1020, file: !679, line: 1326, column: 44)
!1025 = !DILocation(line: 1327, column: 7, scope: !1024)
!1026 = !DILocation(line: 1328, column: 30, scope: !1024)
!1027 = !DILocation(line: 1328, column: 38, scope: !1024)
!1028 = !DILocation(line: 1328, column: 7, scope: !1024)
!1029 = !DILocation(line: 1329, column: 7, scope: !1024)
!1030 = !DILocation(line: 1333, column: 26, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !994, file: !679, line: 1333, column: 8)
!1032 = !DILocation(line: 1333, column: 8, scope: !1031)
!1033 = !DILocation(line: 1333, column: 8, scope: !994)
!1034 = !DILocation(line: 1334, column: 36, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !679, line: 1333, column: 50)
!1036 = !DILocation(line: 1334, column: 7, scope: !1035)
!1037 = !DILocation(line: 1335, column: 30, scope: !1035)
!1038 = !DILocation(line: 1335, column: 38, scope: !1035)
!1039 = !DILocation(line: 1335, column: 7, scope: !1035)
!1040 = !DILocation(line: 1336, column: 7, scope: !1035)
!1041 = !DILocation(line: 1340, column: 25, scope: !994)
!1042 = !DILocation(line: 1341, column: 25, scope: !994)
!1043 = !DILocation(line: 1340, column: 4, scope: !994)
!1044 = !DILocation(line: 1345, column: 23, scope: !994)
!1045 = !DILocation(line: 1345, column: 66, scope: !994)
!1046 = !DILocation(line: 1345, column: 71, scope: !994)
!1047 = !DILocation(line: 1346, column: 23, scope: !994)
!1048 = !DILocation(line: 1346, column: 28, scope: !994)
!1049 = !DILocation(line: 1346, column: 37, scope: !994)
!1050 = !DILocation(line: 1345, column: 10, scope: !994)
!1051 = !DILocation(line: 1345, column: 8, scope: !994)
!1052 = !DILocation(line: 1348, column: 8, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !994, file: !679, line: 1348, column: 8)
!1054 = !DILocation(line: 1348, column: 12, scope: !1053)
!1055 = !DILocation(line: 1348, column: 8, scope: !994)
!1056 = !DILocation(line: 1349, column: 11, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !679, line: 1349, column: 11)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !679, line: 1348, column: 19)
!1059 = !DILocation(line: 1349, column: 39, scope: !1057)
!1060 = !DILocation(line: 1349, column: 11, scope: !1058)
!1061 = !DILocation(line: 1350, column: 29, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !679, line: 1349, column: 46)
!1063 = !DILocation(line: 1350, column: 60, scope: !1062)
!1064 = !DILocation(line: 1350, column: 16, scope: !1062)
!1065 = !DILocation(line: 1350, column: 14, scope: !1062)
!1066 = !DILocation(line: 1352, column: 7, scope: !1062)
!1067 = !DILocation(line: 1353, column: 29, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1057, file: !679, line: 1352, column: 14)
!1069 = !DILocation(line: 1353, column: 58, scope: !1068)
!1070 = !DILocation(line: 1353, column: 16, scope: !1068)
!1071 = !DILocation(line: 1353, column: 14, scope: !1068)
!1072 = !DILocation(line: 1355, column: 4, scope: !1058)
!1073 = !DILocation(line: 1357, column: 8, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !994, file: !679, line: 1357, column: 8)
!1075 = !DILocation(line: 1357, column: 12, scope: !1074)
!1076 = !DILocation(line: 1357, column: 8, scope: !994)
!1077 = !DILocation(line: 1358, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !679, line: 1357, column: 19)
!1079 = !DILocation(line: 1359, column: 4, scope: !1078)
!1080 = !DILocation(line: 1360, column: 24, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1074, file: !679, line: 1359, column: 11)
!1082 = !DILocation(line: 1360, column: 32, scope: !1081)
!1083 = !DILocation(line: 1360, column: 7, scope: !1081)
!1084 = !DILocation(line: 1363, column: 12, scope: !994)
!1085 = !DILocation(line: 1363, column: 16, scope: !994)
!1086 = !DILocation(line: 1363, column: 11, scope: !994)
!1087 = !DILocation(line: 1363, column: 4, scope: !994)
!1088 = distinct !DISubprogram(name: "HostinfoBSD", scope: !679, file: !679, line: 1385, type: !995, isLocal: true, isDefinition: true, scopeLine: 1386, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1089 = !DILocalVariable(name: "buf", arg: 1, scope: !1088, file: !679, line: 1385, type: !997)
!1090 = !DILocation(line: 1385, column: 29, scope: !1088)
!1091 = !DILocalVariable(name: "len", scope: !1088, file: !679, line: 1387, type: !633)
!1092 = !DILocation(line: 1387, column: 8, scope: !1088)
!1093 = !DILocalVariable(name: "majorVersion", scope: !1088, file: !679, line: 1388, type: !633)
!1094 = !DILocation(line: 1388, column: 8, scope: !1088)
!1095 = !DILocalVariable(name: "distroShort", scope: !1088, file: !679, line: 1389, type: !1003)
!1096 = !DILocation(line: 1389, column: 9, scope: !1088)
!1097 = !DILocalVariable(name: "osName", scope: !1088, file: !679, line: 1390, type: !1010)
!1098 = !DILocation(line: 1390, column: 9, scope: !1088)
!1099 = !DILocalVariable(name: "osNameFull", scope: !1088, file: !679, line: 1391, type: !1015)
!1100 = !DILocation(line: 1391, column: 9, scope: !1088)
!1101 = !DILocation(line: 1397, column: 19, scope: !1088)
!1102 = !DILocation(line: 1397, column: 17, scope: !1088)
!1103 = !DILocation(line: 1402, column: 8, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1088, file: !679, line: 1402, column: 8)
!1105 = !DILocation(line: 1402, column: 21, scope: !1104)
!1106 = !DILocation(line: 1402, column: 8, scope: !1088)
!1107 = !DILocation(line: 1403, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !679, line: 1403, column: 11)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !679, line: 1402, column: 28)
!1110 = !DILocation(line: 1403, column: 24, scope: !1108)
!1111 = !DILocation(line: 1403, column: 11, scope: !1109)
!1112 = !DILocation(line: 1404, column: 21, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !679, line: 1403, column: 31)
!1114 = !DILocation(line: 1404, column: 10, scope: !1113)
!1115 = !DILocation(line: 1405, column: 7, scope: !1113)
!1116 = !DILocation(line: 1406, column: 21, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1108, file: !679, line: 1405, column: 14)
!1118 = !DILocation(line: 1406, column: 10, scope: !1117)
!1119 = !DILocation(line: 1408, column: 4, scope: !1109)
!1120 = !DILocation(line: 1409, column: 18, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1104, file: !679, line: 1408, column: 11)
!1122 = !DILocation(line: 1409, column: 7, scope: !1121)
!1123 = !DILocation(line: 1412, column: 23, scope: !1088)
!1124 = !DILocation(line: 1412, column: 63, scope: !1088)
!1125 = !DILocation(line: 1412, column: 68, scope: !1088)
!1126 = !DILocation(line: 1413, column: 23, scope: !1088)
!1127 = !DILocation(line: 1413, column: 28, scope: !1088)
!1128 = !DILocation(line: 1412, column: 10, scope: !1088)
!1129 = !DILocation(line: 1412, column: 8, scope: !1088)
!1130 = !DILocation(line: 1415, column: 8, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1088, file: !679, line: 1415, column: 8)
!1132 = !DILocation(line: 1415, column: 12, scope: !1131)
!1133 = !DILocation(line: 1415, column: 8, scope: !1088)
!1134 = !DILocation(line: 1416, column: 11, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !679, line: 1416, column: 11)
!1136 = distinct !DILexicalBlock(scope: !1131, file: !679, line: 1415, column: 19)
!1137 = !DILocation(line: 1416, column: 39, scope: !1135)
!1138 = !DILocation(line: 1416, column: 11, scope: !1136)
!1139 = !DILocation(line: 1417, column: 29, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1135, file: !679, line: 1416, column: 46)
!1141 = !DILocation(line: 1417, column: 60, scope: !1140)
!1142 = !DILocation(line: 1417, column: 16, scope: !1140)
!1143 = !DILocation(line: 1417, column: 14, scope: !1140)
!1144 = !DILocation(line: 1419, column: 7, scope: !1140)
!1145 = !DILocation(line: 1420, column: 29, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1135, file: !679, line: 1419, column: 14)
!1147 = !DILocation(line: 1420, column: 58, scope: !1146)
!1148 = !DILocation(line: 1420, column: 16, scope: !1146)
!1149 = !DILocation(line: 1420, column: 14, scope: !1146)
!1150 = !DILocation(line: 1422, column: 4, scope: !1136)
!1151 = !DILocation(line: 1424, column: 8, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1088, file: !679, line: 1424, column: 8)
!1153 = !DILocation(line: 1424, column: 12, scope: !1152)
!1154 = !DILocation(line: 1424, column: 8, scope: !1088)
!1155 = !DILocation(line: 1425, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !679, line: 1424, column: 19)
!1157 = !DILocation(line: 1426, column: 4, scope: !1156)
!1158 = !DILocation(line: 1427, column: 24, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1152, file: !679, line: 1426, column: 11)
!1160 = !DILocation(line: 1427, column: 32, scope: !1159)
!1161 = !DILocation(line: 1427, column: 7, scope: !1159)
!1162 = !DILocation(line: 1430, column: 12, scope: !1088)
!1163 = !DILocation(line: 1430, column: 16, scope: !1088)
!1164 = !DILocation(line: 1430, column: 11, scope: !1088)
!1165 = !DILocation(line: 1430, column: 4, scope: !1088)
!1166 = distinct !DISubprogram(name: "HostinfoSun", scope: !679, file: !679, line: 1452, type: !995, isLocal: true, isDefinition: true, scopeLine: 1453, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1167 = !DILocalVariable(name: "buf", arg: 1, scope: !1166, file: !679, line: 1452, type: !997)
!1168 = !DILocation(line: 1452, column: 29, scope: !1166)
!1169 = !DILocalVariable(name: "len", scope: !1166, file: !679, line: 1454, type: !633)
!1170 = !DILocation(line: 1454, column: 8, scope: !1166)
!1171 = !DILocalVariable(name: "osName", scope: !1166, file: !679, line: 1455, type: !1010)
!1172 = !DILocation(line: 1455, column: 9, scope: !1166)
!1173 = !DILocalVariable(name: "osNameFull", scope: !1166, file: !679, line: 1456, type: !1015)
!1174 = !DILocation(line: 1456, column: 9, scope: !1166)
!1175 = !DILocalVariable(name: "solarisRelease", scope: !1166, file: !679, line: 1457, type: !1176)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 24, align: 8, elements: !655)
!1177 = !DILocation(line: 1457, column: 9, scope: !1166)
!1178 = !DILocation(line: 1465, column: 15, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1166, file: !679, line: 1465, column: 8)
!1180 = !DILocation(line: 1465, column: 20, scope: !1179)
!1181 = !DILocation(line: 1465, column: 42, scope: !1179)
!1182 = !DILocation(line: 1465, column: 8, scope: !1179)
!1183 = !DILocation(line: 1465, column: 58, scope: !1179)
!1184 = !DILocation(line: 1465, column: 8, scope: !1166)
!1185 = !DILocation(line: 1466, column: 7, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !679, line: 1465, column: 64)
!1187 = !DILocation(line: 1469, column: 23, scope: !1166)
!1188 = !DILocation(line: 1469, column: 63, scope: !1166)
!1189 = !DILocation(line: 1469, column: 68, scope: !1166)
!1190 = !DILocation(line: 1470, column: 23, scope: !1166)
!1191 = !DILocation(line: 1470, column: 28, scope: !1166)
!1192 = !DILocation(line: 1469, column: 10, scope: !1166)
!1193 = !DILocation(line: 1469, column: 8, scope: !1166)
!1194 = !DILocation(line: 1472, column: 8, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1166, file: !679, line: 1472, column: 8)
!1196 = !DILocation(line: 1472, column: 12, scope: !1195)
!1197 = !DILocation(line: 1472, column: 8, scope: !1166)
!1198 = !DILocation(line: 1473, column: 11, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !679, line: 1473, column: 11)
!1200 = distinct !DILexicalBlock(scope: !1195, file: !679, line: 1472, column: 19)
!1201 = !DILocation(line: 1473, column: 39, scope: !1199)
!1202 = !DILocation(line: 1473, column: 11, scope: !1200)
!1203 = !DILocation(line: 1474, column: 29, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !679, line: 1473, column: 46)
!1205 = !DILocation(line: 1475, column: 29, scope: !1204)
!1206 = !DILocation(line: 1474, column: 16, scope: !1204)
!1207 = !DILocation(line: 1474, column: 14, scope: !1204)
!1208 = !DILocation(line: 1476, column: 7, scope: !1204)
!1209 = !DILocation(line: 1477, column: 29, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1199, file: !679, line: 1476, column: 14)
!1211 = !DILocation(line: 1478, column: 29, scope: !1210)
!1212 = !DILocation(line: 1477, column: 16, scope: !1210)
!1213 = !DILocation(line: 1477, column: 14, scope: !1210)
!1214 = !DILocation(line: 1480, column: 4, scope: !1200)
!1215 = !DILocation(line: 1482, column: 8, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1166, file: !679, line: 1482, column: 8)
!1217 = !DILocation(line: 1482, column: 12, scope: !1216)
!1218 = !DILocation(line: 1482, column: 8, scope: !1166)
!1219 = !DILocation(line: 1483, column: 7, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1216, file: !679, line: 1482, column: 19)
!1221 = !DILocation(line: 1484, column: 4, scope: !1220)
!1222 = !DILocation(line: 1485, column: 24, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1216, file: !679, line: 1484, column: 11)
!1224 = !DILocation(line: 1485, column: 32, scope: !1223)
!1225 = !DILocation(line: 1485, column: 7, scope: !1223)
!1226 = !DILocation(line: 1488, column: 12, scope: !1166)
!1227 = !DILocation(line: 1488, column: 16, scope: !1166)
!1228 = !DILocation(line: 1488, column: 11, scope: !1166)
!1229 = !DILocation(line: 1488, column: 4, scope: !1166)
!1230 = !DILocation(line: 1489, column: 1, scope: !1166)
!1231 = !DILocation(line: 1631, column: 8, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !678, file: !679, line: 1631, column: 8)
!1233 = !DILocation(line: 1631, column: 14, scope: !1232)
!1234 = !DILocation(line: 1631, column: 8, scope: !678)
!1235 = !DILocalVariable(name: "f", scope: !1236, file: !679, line: 1632, type: !1237)
!1236 = distinct !DILexicalBlock(scope: !1232, file: !679, line: 1631, column: 20)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1239, line: 48, baseType: !1240)
!1239 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1241, line: 241, size: 1728, align: 64, elements: !1242)
!1241 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1263, !1264, !1265, !1266, !1268, !1269, !1270, !1274, !1277, !1279, !1280, !1281, !1282, !1283, !1286, !1287}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1240, file: !1241, line: 242, baseType: !633, size: 32, align: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1240, file: !1241, line: 247, baseType: !687, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1240, file: !1241, line: 248, baseType: !687, size: 64, align: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1240, file: !1241, line: 249, baseType: !687, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1240, file: !1241, line: 250, baseType: !687, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1240, file: !1241, line: 251, baseType: !687, size: 64, align: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1240, file: !1241, line: 252, baseType: !687, size: 64, align: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1240, file: !1241, line: 253, baseType: !687, size: 64, align: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1240, file: !1241, line: 254, baseType: !687, size: 64, align: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1240, file: !1241, line: 256, baseType: !687, size: 64, align: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1240, file: !1241, line: 257, baseType: !687, size: 64, align: 64, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1240, file: !1241, line: 258, baseType: !687, size: 64, align: 64, offset: 704)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1240, file: !1241, line: 260, baseType: !1256, size: 64, align: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1241, line: 156, size: 192, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1262}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1257, file: !1241, line: 157, baseType: !1256, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1257, file: !1241, line: 158, baseType: !1261, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1257, file: !1241, line: 162, baseType: !633, size: 32, align: 32, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1240, file: !1241, line: 262, baseType: !1261, size: 64, align: 64, offset: 832)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1240, file: !1241, line: 264, baseType: !633, size: 32, align: 32, offset: 896)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1240, file: !1241, line: 268, baseType: !633, size: 32, align: 32, offset: 928)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1240, file: !1241, line: 270, baseType: !1267, size: 64, align: 64, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !643, line: 131, baseType: !621)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1240, file: !1241, line: 274, baseType: !638, size: 16, align: 16, offset: 1024)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1240, file: !1241, line: 275, baseType: !634, size: 8, align: 8, offset: 1040)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1240, file: !1241, line: 276, baseType: !1271, size: 8, align: 8, offset: 1048)
!1271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 8, align: 8, elements: !1272)
!1272 = !{!1273}
!1273 = !DISubrange(count: 1)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1240, file: !1241, line: 280, baseType: !1275, size: 64, align: 64, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1241, line: 150, baseType: null)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1240, file: !1241, line: 289, baseType: !1278, size: 64, align: 64, offset: 1152)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !643, line: 132, baseType: !621)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1240, file: !1241, line: 297, baseType: !622, size: 64, align: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1240, file: !1241, line: 298, baseType: !622, size: 64, align: 64, offset: 1280)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1240, file: !1241, line: 299, baseType: !622, size: 64, align: 64, offset: 1344)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1240, file: !1241, line: 300, baseType: !622, size: 64, align: 64, offset: 1408)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1240, file: !1241, line: 302, baseType: !1284, size: 64, align: 64, offset: 1472)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1285, line: 216, baseType: !637)
!1285 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1240, file: !1241, line: 303, baseType: !633, size: 32, align: 32, offset: 1536)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1240, file: !1241, line: 305, baseType: !1288, size: 160, align: 8, offset: 1568)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 160, align: 8, elements: !1289)
!1289 = !{!1290}
!1290 = !DISubrange(count: 20)
!1291 = !DILocation(line: 1632, column: 13, scope: !1236)
!1292 = !DILocalVariable(name: "line", scope: !1236, file: !679, line: 1633, type: !687)
!1293 = !DILocation(line: 1633, column: 13, scope: !1236)
!1294 = !DILocation(line: 1648, column: 11, scope: !1236)
!1295 = !DILocation(line: 1648, column: 9, scope: !1236)
!1296 = !DILocation(line: 1649, column: 11, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1236, file: !679, line: 1649, column: 11)
!1298 = !DILocation(line: 1649, column: 13, scope: !1297)
!1299 = !DILocation(line: 1649, column: 11, scope: !1236)
!1300 = !DILocation(line: 1650, column: 3, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1297, file: !679, line: 1649, column: 21)
!1302 = !DILocation(line: 1653, column: 7, scope: !1236)
!1303 = !DILocation(line: 1653, column: 33, scope: !1304)
!1304 = !DILexicalBlockFile(scope: !1236, file: !679, discriminator: 1)
!1305 = !DILocation(line: 1653, column: 14, scope: !1304)
!1306 = !DILocation(line: 1653, column: 51, scope: !1304)
!1307 = !DILocation(line: 1653, column: 7, scope: !1304)
!1308 = !DILocation(line: 1654, column: 15, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1310, file: !679, line: 1654, column: 7)
!1310 = distinct !DILexicalBlock(scope: !1236, file: !679, line: 1653, column: 69)
!1311 = !DILocation(line: 1654, column: 7, scope: !1309)
!1312 = !DILocation(line: 1654, column: 55, scope: !1309)
!1313 = !DILocation(line: 1654, column: 7, scope: !1310)
!1314 = !DILocation(line: 1655, column: 11, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1309, file: !679, line: 1654, column: 61)
!1316 = !DILocation(line: 1656, column: 3, scope: !1315)
!1317 = !DILocation(line: 1657, column: 8, scope: !1310)
!1318 = !DILocation(line: 1657, column: 3, scope: !1310)
!1319 = !DILocation(line: 1653, column: 7, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1236, file: !679, discriminator: 2)
!1321 = distinct !{!1321, !1302}
!1322 = !DILocation(line: 1660, column: 14, scope: !1236)
!1323 = !DILocation(line: 1660, column: 7, scope: !1236)
!1324 = !DILocation(line: 1662, column: 11, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1236, file: !679, line: 1662, column: 11)
!1326 = !DILocation(line: 1662, column: 17, scope: !1325)
!1327 = !DILocation(line: 1662, column: 11, scope: !1236)
!1328 = !DILocation(line: 1663, column: 3, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1325, file: !679, line: 1662, column: 23)
!1330 = !DILocation(line: 1665, column: 4, scope: !1236)
!1331 = !DILocation(line: 1667, column: 11, scope: !678)
!1332 = !DILocation(line: 1667, column: 4, scope: !678)
!1333 = !DILocation(line: 1669, column: 1, scope: !678)
!1334 = !DILocalVariable(name: "result", scope: !684, file: !679, line: 1693, type: !687)
!1335 = !DILocation(line: 1693, column: 10, scope: !684)
!1336 = !DILocation(line: 1697, column: 13, scope: !684)
!1337 = !DILocation(line: 1697, column: 11, scope: !684)
!1338 = !DILocation(line: 1699, column: 26, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !684, file: !679, line: 1699, column: 8)
!1340 = !DILocation(line: 1699, column: 33, scope: !1339)
!1341 = !DILocation(line: 1699, column: 25, scope: !1339)
!1342 = !DILocation(line: 1699, column: 8, scope: !1339)
!1343 = !DILocation(line: 1699, column: 8, scope: !684)
!1344 = !DILocalVariable(name: "before", scope: !1345, file: !679, line: 1700, type: !687)
!1345 = distinct !DILexicalBlock(scope: !1339, file: !679, line: 1699, column: 14)
!1346 = !DILocation(line: 1700, column: 13, scope: !1345)
!1347 = !DILocation(line: 1702, column: 16, scope: !1345)
!1348 = !DILocation(line: 1702, column: 14, scope: !1345)
!1349 = !DILocation(line: 1704, column: 56, scope: !1345)
!1350 = !DILocation(line: 1704, column: 16, scope: !1345)
!1351 = !DILocation(line: 1704, column: 14, scope: !1345)
!1352 = !DILocation(line: 1706, column: 11, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1345, file: !679, line: 1706, column: 11)
!1354 = !DILocation(line: 1706, column: 11, scope: !1345)
!1355 = !DILocation(line: 1707, column: 15, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1353, file: !679, line: 1706, column: 19)
!1357 = !DILocation(line: 1707, column: 10, scope: !1356)
!1358 = !DILocation(line: 1709, column: 19, scope: !1356)
!1359 = !DILocation(line: 1709, column: 17, scope: !1356)
!1360 = !DILocation(line: 1710, column: 7, scope: !1356)
!1361 = !DILocation(line: 1711, column: 4, scope: !1345)
!1362 = !DILocation(line: 1713, column: 11, scope: !684)
!1363 = !DILocation(line: 1713, column: 4, scope: !684)
!1364 = distinct !DISubprogram(name: "Atomic_ReadIfEqualWritePtr", scope: !689, file: !689, line: 3829, type: !1365, isLocal: true, isDefinition: true, scopeLine: 3829, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!622, !1367, !1368, !1368}
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1370 = !DILocalVariable(name: "var", arg: 1, scope: !1364, file: !689, line: 3829, type: !1367)
!1371 = !DILocation(line: 3829, column: 757, scope: !1364)
!1372 = !DILocalVariable(name: "oldVal", arg: 2, scope: !1364, file: !689, line: 3829, type: !1368)
!1373 = !DILocation(line: 3829, column: 775, scope: !1364)
!1374 = !DILocalVariable(name: "newVal", arg: 3, scope: !1364, file: !689, line: 3829, type: !1368)
!1375 = !DILocation(line: 3829, column: 796, scope: !1364)
!1376 = !DILocation(line: 3829, column: 858, scope: !1364)
!1377 = !DILocation(line: 3829, column: 882, scope: !1364)
!1378 = !DILocation(line: 3829, column: 871, scope: !1364)
!1379 = !DILocation(line: 3829, column: 909, scope: !1364)
!1380 = !DILocation(line: 3829, column: 898, scope: !1364)
!1381 = !DILocation(line: 3829, column: 832, scope: !1364)
!1382 = !DILocation(line: 3829, column: 813, scope: !1364)
!1383 = !DILocation(line: 3829, column: 806, scope: !1364)
!1384 = distinct !DISubprogram(name: "Hostinfo_GetUser", scope: !679, file: !679, line: 1735, type: !685, isLocal: false, isDefinition: true, scopeLine: 1736, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1385 = !DILocalVariable(name: "buffer", scope: !1384, file: !679, line: 1737, type: !1386)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 65536, align: 8, elements: !1387)
!1387 = !{!1388}
!1388 = !DISubrange(count: 8192)
!1389 = !DILocation(line: 1737, column: 9, scope: !1384)
!1390 = !DILocalVariable(name: "pw", scope: !1384, file: !679, line: 1738, type: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1392, line: 49, size: 384, align: 64, elements: !1393)
!1392 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1393 = !{!1394, !1395, !1396, !1397, !1399, !1400, !1401}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1391, file: !1392, line: 51, baseType: !687, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1391, file: !1392, line: 52, baseType: !687, size: 64, align: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1391, file: !1392, line: 53, baseType: !642, size: 32, align: 32, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1391, file: !1392, line: 54, baseType: !1398, size: 32, align: 32, offset: 160)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !643, line: 126, baseType: !626)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1391, file: !1392, line: 55, baseType: !687, size: 64, align: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1391, file: !1392, line: 56, baseType: !687, size: 64, align: 64, offset: 256)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1391, file: !1392, line: 57, baseType: !687, size: 64, align: 64, offset: 320)
!1402 = !DILocation(line: 1738, column: 18, scope: !1384)
!1403 = !DILocalVariable(name: "ppw", scope: !1384, file: !679, line: 1739, type: !1404)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1405 = !DILocation(line: 1739, column: 19, scope: !1384)
!1406 = !DILocalVariable(name: "env", scope: !1384, file: !679, line: 1740, type: !687)
!1407 = !DILocation(line: 1740, column: 10, scope: !1384)
!1408 = !DILocalVariable(name: "name", scope: !1384, file: !679, line: 1741, type: !687)
!1409 = !DILocation(line: 1741, column: 10, scope: !1384)
!1410 = !DILocation(line: 1743, column: 26, scope: !1411)
!1411 = distinct !DILexicalBlock(scope: !1384, file: !679, line: 1743, column: 8)
!1412 = !DILocation(line: 1743, column: 41, scope: !1411)
!1413 = !DILocation(line: 1743, column: 9, scope: !1414)
!1414 = !DILexicalBlockFile(scope: !1411, file: !679, discriminator: 2)
!1415 = !DILocation(line: 1743, column: 70, scope: !1411)
!1416 = !DILocation(line: 1743, column: 76, scope: !1411)
!1417 = !DILocation(line: 1744, column: 9, scope: !1411)
!1418 = !DILocation(line: 1744, column: 13, scope: !1411)
!1419 = !DILocation(line: 1743, column: 8, scope: !1420)
!1420 = !DILexicalBlockFile(scope: !1384, file: !679, discriminator: 1)
!1421 = !DILocation(line: 1745, column: 11, scope: !1422)
!1422 = distinct !DILexicalBlock(scope: !1423, file: !679, line: 1745, column: 11)
!1423 = distinct !DILexicalBlock(scope: !1411, file: !679, line: 1744, column: 22)
!1424 = !DILocation(line: 1745, column: 16, scope: !1422)
!1425 = !DILocation(line: 1745, column: 11, scope: !1423)
!1426 = !DILocation(line: 1746, column: 35, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1422, file: !679, line: 1745, column: 25)
!1428 = !DILocation(line: 1746, column: 40, scope: !1427)
!1429 = !DILocation(line: 1746, column: 17, scope: !1427)
!1430 = !DILocation(line: 1746, column: 15, scope: !1427)
!1431 = !DILocation(line: 1747, column: 7, scope: !1427)
!1432 = !DILocation(line: 1748, column: 4, scope: !1423)
!1433 = !DILocation(line: 1750, column: 9, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1384, file: !679, line: 1750, column: 8)
!1435 = !DILocation(line: 1750, column: 8, scope: !1384)
!1436 = !DILocation(line: 1751, column: 13, scope: !1437)
!1437 = distinct !DILexicalBlock(scope: !1434, file: !679, line: 1750, column: 15)
!1438 = !DILocation(line: 1751, column: 11, scope: !1437)
!1439 = !DILocation(line: 1753, column: 11, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1437, file: !679, line: 1753, column: 11)
!1441 = !DILocation(line: 1753, column: 11, scope: !1437)
!1442 = !DILocation(line: 1754, column: 35, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1440, file: !679, line: 1753, column: 16)
!1444 = !DILocation(line: 1754, column: 17, scope: !1443)
!1445 = !DILocation(line: 1754, column: 15, scope: !1443)
!1446 = !DILocation(line: 1755, column: 7, scope: !1443)
!1447 = !DILocation(line: 1756, column: 4, scope: !1437)
!1448 = !DILocation(line: 1758, column: 11, scope: !1384)
!1449 = !DILocation(line: 1758, column: 4, scope: !1384)
!1450 = distinct !DISubprogram(name: "Hostinfo_GetLoadAverage", scope: !679, file: !679, line: 1837, type: !1451, isLocal: false, isDefinition: true, scopeLine: 1838, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!947, !1453}
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!1454 = !DILocalVariable(name: "avg", arg: 1, scope: !1450, file: !679, line: 1837, type: !1453)
!1455 = !DILocation(line: 1837, column: 33, scope: !1450)
!1456 = !DILocalVariable(name: "avg0", scope: !1450, file: !679, line: 1839, type: !640)
!1457 = !DILocation(line: 1839, column: 10, scope: !1450)
!1458 = !DILocation(line: 1841, column: 9, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1450, file: !679, line: 1841, column: 8)
!1460 = !DILocation(line: 1841, column: 8, scope: !1450)
!1461 = !DILocation(line: 1842, column: 7, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1459, file: !679, line: 1841, column: 51)
!1463 = !DILocation(line: 1845, column: 26, scope: !1450)
!1464 = !DILocation(line: 1845, column: 24, scope: !1450)
!1465 = !DILocation(line: 1845, column: 11, scope: !1450)
!1466 = !DILocation(line: 1845, column: 5, scope: !1450)
!1467 = !DILocation(line: 1845, column: 9, scope: !1450)
!1468 = !DILocation(line: 1847, column: 4, scope: !1450)
!1469 = !DILocation(line: 1848, column: 1, scope: !1450)
!1470 = distinct !DISubprogram(name: "HostinfoGetLoadAverage", scope: !679, file: !679, line: 1779, type: !1471, isLocal: true, isDefinition: true, scopeLine: 1782, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!947, !1473, !1473, !1473}
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!1474 = !DILocalVariable(name: "avg0", arg: 1, scope: !1470, file: !679, line: 1779, type: !1473)
!1475 = !DILocation(line: 1779, column: 31, scope: !1470)
!1476 = !DILocalVariable(name: "avg1", arg: 2, scope: !1470, file: !679, line: 1780, type: !1473)
!1477 = !DILocation(line: 1780, column: 31, scope: !1470)
!1478 = !DILocalVariable(name: "avg2", arg: 3, scope: !1470, file: !679, line: 1781, type: !1473)
!1479 = !DILocation(line: 1781, column: 31, scope: !1470)
!1480 = !DILocalVariable(name: "avg", scope: !1470, file: !679, line: 1784, type: !1481)
!1481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1482, size: 192, align: 64, elements: !655)
!1482 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1483 = !DILocation(line: 1784, column: 11, scope: !1470)
!1484 = !DILocalVariable(name: "res", scope: !1470, file: !679, line: 1785, type: !633)
!1485 = !DILocation(line: 1785, column: 8, scope: !1470)
!1486 = !DILocation(line: 1787, column: 21, scope: !1470)
!1487 = !DILocation(line: 1787, column: 10, scope: !1470)
!1488 = !DILocation(line: 1787, column: 8, scope: !1470)
!1489 = !DILocation(line: 1788, column: 8, scope: !1490)
!1490 = distinct !DILexicalBlock(scope: !1470, file: !679, line: 1788, column: 8)
!1491 = !DILocation(line: 1788, column: 12, scope: !1490)
!1492 = !DILocation(line: 1788, column: 8, scope: !1470)
!1493 = !DILocation(line: 1791, column: 7, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1490, file: !679, line: 1788, column: 17)
!1495 = !DILocation(line: 1794, column: 8, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1470, file: !679, line: 1794, column: 8)
!1497 = !DILocation(line: 1794, column: 8, scope: !1470)
!1498 = !DILocation(line: 1795, column: 23, scope: !1499)
!1499 = distinct !DILexicalBlock(scope: !1496, file: !679, line: 1794, column: 14)
!1500 = !DILocation(line: 1795, column: 15, scope: !1499)
!1501 = !DILocation(line: 1795, column: 8, scope: !1499)
!1502 = !DILocation(line: 1795, column: 13, scope: !1499)
!1503 = !DILocation(line: 1796, column: 4, scope: !1499)
!1504 = !DILocation(line: 1797, column: 8, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1470, file: !679, line: 1797, column: 8)
!1506 = !DILocation(line: 1797, column: 8, scope: !1470)
!1507 = !DILocation(line: 1798, column: 23, scope: !1508)
!1508 = distinct !DILexicalBlock(scope: !1505, file: !679, line: 1797, column: 14)
!1509 = !DILocation(line: 1798, column: 15, scope: !1508)
!1510 = !DILocation(line: 1798, column: 8, scope: !1508)
!1511 = !DILocation(line: 1798, column: 13, scope: !1508)
!1512 = !DILocation(line: 1799, column: 4, scope: !1508)
!1513 = !DILocation(line: 1800, column: 8, scope: !1514)
!1514 = distinct !DILexicalBlock(scope: !1470, file: !679, line: 1800, column: 8)
!1515 = !DILocation(line: 1800, column: 8, scope: !1470)
!1516 = !DILocation(line: 1801, column: 23, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1514, file: !679, line: 1800, column: 14)
!1518 = !DILocation(line: 1801, column: 15, scope: !1517)
!1519 = !DILocation(line: 1801, column: 8, scope: !1517)
!1520 = !DILocation(line: 1801, column: 13, scope: !1517)
!1521 = !DILocation(line: 1802, column: 4, scope: !1517)
!1522 = !DILocation(line: 1804, column: 4, scope: !1470)
!1523 = !DILocation(line: 1817, column: 1, scope: !1470)
!1524 = distinct !DISubprogram(name: "Hostinfo_LogLoadAverage", scope: !679, file: !679, line: 1868, type: !761, isLocal: false, isDefinition: true, scopeLine: 1869, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1525 = !DILocalVariable(name: "avg0", scope: !1524, file: !679, line: 1870, type: !640)
!1526 = !DILocation(line: 1870, column: 10, scope: !1524)
!1527 = !DILocalVariable(name: "avg1", scope: !1524, file: !679, line: 1870, type: !640)
!1528 = !DILocation(line: 1870, column: 20, scope: !1524)
!1529 = !DILocalVariable(name: "avg2", scope: !1524, file: !679, line: 1870, type: !640)
!1530 = !DILocation(line: 1870, column: 30, scope: !1524)
!1531 = !DILocation(line: 1872, column: 8, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1524, file: !679, line: 1872, column: 8)
!1533 = !DILocation(line: 1872, column: 8, scope: !1524)
!1534 = !DILocation(line: 1873, column: 40, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1532, file: !679, line: 1872, column: 53)
!1536 = !DILocation(line: 1873, column: 46, scope: !1535)
!1537 = !DILocation(line: 1873, column: 52, scope: !1535)
!1538 = !DILocation(line: 1873, column: 7, scope: !1535)
!1539 = !DILocation(line: 1874, column: 4, scope: !1535)
!1540 = !DILocation(line: 1875, column: 1, scope: !1524)
!1541 = distinct !DISubprogram(name: "Hostinfo_SystemTimerNS", scope: !679, file: !679, line: 2009, type: !697, isLocal: false, isDefinition: true, scopeLine: 2010, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1542 = !DILocalVariable(name: "ts", scope: !1541, file: !679, line: 2014, type: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1544, line: 120, size: 128, align: 64, elements: !1545)
!1544 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1545 = !{!1546, !1547}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1543, file: !1544, line: 122, baseType: !911, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1543, file: !1544, line: 123, baseType: !1548, size: 64, align: 64, offset: 64)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !643, line: 175, baseType: !621)
!1549 = !DILocation(line: 2014, column: 20, scope: !1541)
!1550 = !DILocalVariable(name: "ret", scope: !1541, file: !679, line: 2015, type: !633)
!1551 = !DILocation(line: 2015, column: 8, scope: !1541)
!1552 = !DILocation(line: 2024, column: 10, scope: !1541)
!1553 = !DILocation(line: 2024, column: 8, scope: !1541)
!1554 = !DILocation(line: 2027, column: 26, scope: !1541)
!1555 = !DILocation(line: 2027, column: 33, scope: !1541)
!1556 = !DILocation(line: 2027, column: 40, scope: !1541)
!1557 = !DILocation(line: 2027, column: 47, scope: !1541)
!1558 = !DILocation(line: 2027, column: 59, scope: !1541)
!1559 = !DILocation(line: 2027, column: 54, scope: !1541)
!1560 = !DILocation(line: 2027, column: 4, scope: !1541)
!1561 = distinct !DISubprogram(name: "Hostinfo_LogMemUsage", scope: !679, file: !679, line: 2048, type: !761, isLocal: false, isDefinition: true, scopeLine: 2049, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1562 = !DILocalVariable(name: "fd", scope: !1561, file: !679, line: 2050, type: !633)
!1563 = !DILocation(line: 2050, column: 8, scope: !1561)
!1564 = !DILocation(line: 2050, column: 13, scope: !1561)
!1565 = !DILocation(line: 2052, column: 8, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !1561, file: !679, line: 2052, column: 8)
!1567 = !DILocation(line: 2052, column: 11, scope: !1566)
!1568 = !DILocation(line: 2052, column: 8, scope: !1561)
!1569 = !DILocalVariable(name: "len", scope: !1570, file: !679, line: 2053, type: !1284)
!1570 = distinct !DILexicalBlock(scope: !1566, file: !679, line: 2052, column: 18)
!1571 = !DILocation(line: 2053, column: 14, scope: !1570)
!1572 = !DILocalVariable(name: "buf", scope: !1570, file: !679, line: 2054, type: !1573)
!1573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 512, align: 8, elements: !1574)
!1574 = !{!1575}
!1575 = !DISubrange(count: 64)
!1576 = !DILocation(line: 2054, column: 12, scope: !1570)
!1577 = !DILocation(line: 2056, column: 18, scope: !1570)
!1578 = !DILocation(line: 2056, column: 22, scope: !1570)
!1579 = !DILocation(line: 2056, column: 13, scope: !1570)
!1580 = !DILocation(line: 2056, column: 11, scope: !1570)
!1581 = !DILocation(line: 2057, column: 13, scope: !1570)
!1582 = !DILocation(line: 2057, column: 7, scope: !1570)
!1583 = !DILocation(line: 2059, column: 11, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1570, file: !679, line: 2059, column: 11)
!1585 = !DILocation(line: 2059, column: 15, scope: !1584)
!1586 = !DILocation(line: 2059, column: 11, scope: !1570)
!1587 = !DILocalVariable(name: "a", scope: !1588, file: !679, line: 2060, type: !1589)
!1588 = distinct !DILexicalBlock(scope: !1584, file: !679, line: 2059, column: 22)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 224, align: 32, elements: !1590)
!1590 = !{!1591}
!1591 = !DISubrange(count: 7)
!1592 = !DILocation(line: 2060, column: 14, scope: !1588)
!1593 = !DILocation(line: 2062, column: 14, scope: !1588)
!1594 = !DILocation(line: 2062, column: 18, scope: !1588)
!1595 = !DILocation(line: 2062, column: 33, scope: !1596)
!1596 = !DILexicalBlockFile(scope: !1588, file: !679, discriminator: 1)
!1597 = !DILocation(line: 2062, column: 14, scope: !1596)
!1598 = !DILocation(line: 2062, column: 14, scope: !1599)
!1599 = !DILexicalBlockFile(scope: !1588, file: !679, discriminator: 2)
!1600 = !DILocation(line: 2062, column: 14, scope: !1601)
!1601 = !DILexicalBlockFile(scope: !1588, file: !679, discriminator: 3)
!1602 = !DILocation(line: 2062, column: 10, scope: !1601)
!1603 = !DILocation(line: 2062, column: 55, scope: !1601)
!1604 = !DILocation(line: 2064, column: 17, scope: !1588)
!1605 = !DILocation(line: 2065, column: 18, scope: !1588)
!1606 = !DILocation(line: 2065, column: 25, scope: !1588)
!1607 = !DILocation(line: 2065, column: 32, scope: !1588)
!1608 = !DILocation(line: 2065, column: 39, scope: !1588)
!1609 = !DILocation(line: 2065, column: 46, scope: !1588)
!1610 = !DILocation(line: 2065, column: 53, scope: !1588)
!1611 = !DILocation(line: 2065, column: 60, scope: !1588)
!1612 = !DILocation(line: 2064, column: 10, scope: !1588)
!1613 = !DILocation(line: 2068, column: 14, scope: !1588)
!1614 = !DILocation(line: 2068, column: 20, scope: !1588)
!1615 = !DILocation(line: 2068, column: 26, scope: !1588)
!1616 = !DILocation(line: 2068, column: 32, scope: !1588)
!1617 = !DILocation(line: 2068, column: 38, scope: !1588)
!1618 = !DILocation(line: 2068, column: 44, scope: !1588)
!1619 = !DILocation(line: 2068, column: 50, scope: !1588)
!1620 = !DILocation(line: 2067, column: 10, scope: !1588)
!1621 = !DILocation(line: 2069, column: 7, scope: !1588)
!1622 = !DILocation(line: 2070, column: 4, scope: !1570)
!1623 = !DILocation(line: 2071, column: 1, scope: !1561)
!1624 = distinct !DISubprogram(name: "Hostinfo_ResetProcessState", scope: !679, file: !679, line: 2092, type: !1625, isLocal: false, isDefinition: true, scopeLine: 2094, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !682)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !1627, !1284}
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!1629 = !DILocalVariable(name: "keepFds", arg: 1, scope: !1624, file: !679, line: 2092, type: !1627)
!1630 = !DILocation(line: 2092, column: 39, scope: !1624)
!1631 = !DILocalVariable(name: "numKeepFds", arg: 2, scope: !1624, file: !679, line: 2093, type: !1284)
!1632 = !DILocation(line: 2093, column: 35, scope: !1624)
!1633 = !DILocalVariable(name: "s", scope: !1624, file: !679, line: 2095, type: !633)
!1634 = !DILocation(line: 2095, column: 8, scope: !1624)
!1635 = !DILocalVariable(name: "fd", scope: !1624, file: !679, line: 2095, type: !633)
!1636 = !DILocation(line: 2095, column: 11, scope: !1624)
!1637 = !DILocalVariable(name: "sa", scope: !1624, file: !679, line: 2096, type: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1639, line: 24, size: 1216, align: 64, elements: !1640)
!1639 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1640 = !{!1641, !1719, !1728, !1729}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1638, file: !1639, line: 35, baseType: !1642, size: 64, align: 64)
!1642 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1638, file: !1639, line: 28, size: 64, align: 64, elements: !1643)
!1643 = !{!1644, !1645}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1642, file: !1639, line: 31, baseType: !628, size: 64, align: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1642, file: !1639, line: 33, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !633, !1649, !622}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1651, line: 133, baseType: !1652)
!1651 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1651, line: 62, size: 1024, align: 64, elements: !1653)
!1653 = !{!1654, !1655, !1656, !1657}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1652, file: !1651, line: 64, baseType: !633, size: 32, align: 32)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1652, file: !1651, line: 65, baseType: !633, size: 32, align: 32, offset: 32)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1652, file: !1651, line: 67, baseType: !633, size: 32, align: 32, offset: 64)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1652, file: !1651, line: 132, baseType: !1658, size: 896, align: 64, offset: 128)
!1658 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1652, file: !1651, line: 69, size: 896, align: 64, elements: !1659)
!1659 = !{!1660, !1664, !1670, !1681, !1687, !1697, !1708, !1713}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1658, file: !1651, line: 71, baseType: !1661, size: 896, align: 32)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 896, align: 32, elements: !1662)
!1662 = !{!1663}
!1663 = !DISubrange(count: 28)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1658, file: !1651, line: 78, baseType: !1665, size: 64, align: 32)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 74, size: 64, align: 32, elements: !1666)
!1666 = !{!1667, !1669}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1665, file: !1651, line: 76, baseType: !1668, size: 32, align: 32)
!1668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !643, line: 133, baseType: !633)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1665, file: !1651, line: 77, baseType: !642, size: 32, align: 32, offset: 32)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1658, file: !1651, line: 86, baseType: !1671, size: 128, align: 64)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 81, size: 128, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1671, file: !1651, line: 83, baseType: !633, size: 32, align: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1671, file: !1651, line: 84, baseType: !633, size: 32, align: 32, offset: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1671, file: !1651, line: 85, baseType: !1676, size: 64, align: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1651, line: 36, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1651, line: 32, size: 64, align: 64, elements: !1678)
!1678 = !{!1679, !1680}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1677, file: !1651, line: 34, baseType: !633, size: 32, align: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1677, file: !1651, line: 35, baseType: !622, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1658, file: !1651, line: 94, baseType: !1682, size: 128, align: 64)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 89, size: 128, align: 64, elements: !1683)
!1683 = !{!1684, !1685, !1686}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1682, file: !1651, line: 91, baseType: !1668, size: 32, align: 32)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1682, file: !1651, line: 92, baseType: !642, size: 32, align: 32, offset: 32)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1682, file: !1651, line: 93, baseType: !1676, size: 64, align: 64, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1658, file: !1651, line: 104, baseType: !1688, size: 256, align: 64)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 97, size: 256, align: 64, elements: !1689)
!1689 = !{!1690, !1691, !1692, !1693, !1696}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1688, file: !1651, line: 99, baseType: !1668, size: 32, align: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1688, file: !1651, line: 100, baseType: !642, size: 32, align: 32, offset: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1688, file: !1651, line: 101, baseType: !633, size: 32, align: 32, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1688, file: !1651, line: 102, baseType: !1694, size: 64, align: 64, offset: 128)
!1694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !1651, line: 58, baseType: !1695)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !643, line: 135, baseType: !621)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1688, file: !1651, line: 103, baseType: !1694, size: 64, align: 64, offset: 192)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !1658, file: !1651, line: 116, baseType: !1698, size: 256, align: 64)
!1698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 107, size: 256, align: 64, elements: !1699)
!1699 = !{!1700, !1701, !1703}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !1698, file: !1651, line: 109, baseType: !622, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !1698, file: !1651, line: 110, baseType: !1702, size: 16, align: 16, offset: 64)
!1702 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !1698, file: !1651, line: 115, baseType: !1704, size: 128, align: 64, offset: 128)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1698, file: !1651, line: 111, size: 128, align: 64, elements: !1705)
!1705 = !{!1706, !1707}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !1704, file: !1651, line: 113, baseType: !622, size: 64, align: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !1704, file: !1651, line: 114, baseType: !622, size: 64, align: 64, offset: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !1658, file: !1651, line: 123, baseType: !1709, size: 128, align: 64)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 119, size: 128, align: 64, elements: !1710)
!1710 = !{!1711, !1712}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !1709, file: !1651, line: 121, baseType: !621, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !1709, file: !1651, line: 122, baseType: !633, size: 32, align: 32, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !1658, file: !1651, line: 131, baseType: !1714, size: 128, align: 64)
!1714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1658, file: !1651, line: 126, size: 128, align: 64, elements: !1715)
!1715 = !{!1716, !1717, !1718}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1714, file: !1651, line: 128, baseType: !622, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1714, file: !1651, line: 129, baseType: !633, size: 32, align: 32, offset: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1714, file: !1651, line: 130, baseType: !626, size: 32, align: 32, offset: 96)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !1638, file: !1639, line: 43, baseType: !1720, size: 1024, align: 64, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !1721, line: 30, baseType: !1722)
!1721 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/open-vm-tools/line610")
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1721, line: 27, size: 1024, align: 64, elements: !1723)
!1723 = !{!1724}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !1722, file: !1721, line: 29, baseType: !1725, size: 1024, align: 64)
!1725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 1024, align: 64, elements: !1726)
!1726 = !{!1727}
!1727 = !DISubrange(count: 16)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !1638, file: !1639, line: 46, baseType: !633, size: 32, align: 32, offset: 1088)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !1638, file: !1639, line: 49, baseType: !1730, size: 64, align: 64, offset: 1152)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!1731 = !DILocation(line: 2096, column: 21, scope: !1624)
!1732 = !DILocalVariable(name: "rlim", scope: !1624, file: !679, line: 2097, type: !1733)
!1733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !234, line: 139, size: 128, align: 64, elements: !1734)
!1734 = !{!1735, !1738}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !1733, file: !234, line: 142, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !234, line: 133, baseType: !1737)
!1737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim64_t", file: !643, line: 137, baseType: !637)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !1733, file: !234, line: 144, baseType: !1736, size: 64, align: 64, offset: 64)
!1739 = !DILocation(line: 2097, column: 18, scope: !1624)
!1740 = !DILocalVariable(name: "it", scope: !1624, file: !679, line: 2105, type: !1741)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", file: !10, line: 107, size: 256, align: 64, elements: !1742)
!1742 = !{!1743, !1744}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !1741, file: !10, line: 110, baseType: !907, size: 128, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !1741, file: !10, line: 112, baseType: !907, size: 128, align: 64, offset: 128)
!1745 = !DILocation(line: 2105, column: 21, scope: !1624)
!1746 = !DILocation(line: 2106, column: 28, scope: !1624)
!1747 = !DILocation(line: 2106, column: 37, scope: !1624)
!1748 = !DILocation(line: 2106, column: 45, scope: !1624)
!1749 = !DILocation(line: 2106, column: 7, scope: !1624)
!1750 = !DILocation(line: 2106, column: 16, scope: !1624)
!1751 = !DILocation(line: 2106, column: 23, scope: !1624)
!1752 = !DILocation(line: 2107, column: 31, scope: !1624)
!1753 = !DILocation(line: 2107, column: 43, scope: !1624)
!1754 = !DILocation(line: 2107, column: 51, scope: !1624)
!1755 = !DILocation(line: 2107, column: 7, scope: !1624)
!1756 = !DILocation(line: 2107, column: 19, scope: !1624)
!1757 = !DILocation(line: 2107, column: 26, scope: !1624)
!1758 = !DILocation(line: 2108, column: 4, scope: !1624)
!1759 = !DILocation(line: 2109, column: 4, scope: !1624)
!1760 = !DILocation(line: 2110, column: 4, scope: !1624)
!1761 = !DILocation(line: 2112, column: 11, scope: !1762)
!1762 = distinct !DILexicalBlock(scope: !1624, file: !679, line: 2112, column: 4)
!1763 = !DILocation(line: 2112, column: 9, scope: !1762)
!1764 = !DILocation(line: 2112, column: 16, scope: !1765)
!1765 = !DILexicalBlockFile(scope: !1766, file: !679, discriminator: 1)
!1766 = distinct !DILexicalBlock(scope: !1762, file: !679, line: 2112, column: 4)
!1767 = !DILocation(line: 2112, column: 18, scope: !1765)
!1768 = !DILocation(line: 2112, column: 4, scope: !1765)
!1769 = !DILocation(line: 2113, column: 9, scope: !1770)
!1770 = distinct !DILexicalBlock(scope: !1766, file: !679, line: 2112, column: 31)
!1771 = !DILocation(line: 2113, column: 29, scope: !1770)
!1772 = !DILocation(line: 2113, column: 20, scope: !1770)
!1773 = !DILocation(line: 2114, column: 22, scope: !1770)
!1774 = !DILocation(line: 2114, column: 7, scope: !1770)
!1775 = !DILocation(line: 2115, column: 10, scope: !1770)
!1776 = !DILocation(line: 2115, column: 19, scope: !1770)
!1777 = !DILocation(line: 2116, column: 17, scope: !1770)
!1778 = !DILocation(line: 2116, column: 7, scope: !1770)
!1779 = !DILocation(line: 2117, column: 4, scope: !1770)
!1780 = !DILocation(line: 2112, column: 27, scope: !1781)
!1781 = !DILexicalBlockFile(scope: !1766, file: !679, discriminator: 2)
!1782 = !DILocation(line: 2112, column: 4, scope: !1781)
!1783 = distinct !{!1783, !1784}
!1784 = !DILocation(line: 2112, column: 4, scope: !1624)
!1785 = !DILocation(line: 2119, column: 20, scope: !1786)
!1786 = distinct !DILexicalBlock(scope: !1624, file: !679, line: 2119, column: 4)
!1787 = !DILocation(line: 2119, column: 14, scope: !1786)
!1788 = !DILocation(line: 2119, column: 41, scope: !1786)
!1789 = !DILocation(line: 2119, column: 12, scope: !1786)
!1790 = !DILocation(line: 2119, column: 9, scope: !1786)
!1791 = !DILocation(line: 2119, column: 46, scope: !1792)
!1792 = !DILexicalBlockFile(scope: !1793, file: !679, discriminator: 1)
!1793 = distinct !DILexicalBlock(scope: !1786, file: !679, line: 2119, column: 4)
!1794 = !DILocation(line: 2119, column: 49, scope: !1792)
!1795 = !DILocation(line: 2119, column: 4, scope: !1792)
!1796 = !DILocalVariable(name: "i", scope: !1797, file: !679, line: 2120, type: !1284)
!1797 = distinct !DILexicalBlock(scope: !1793, file: !679, line: 2119, column: 72)
!1798 = !DILocation(line: 2120, column: 14, scope: !1797)
!1799 = !DILocation(line: 2122, column: 14, scope: !1800)
!1800 = distinct !DILexicalBlock(scope: !1797, file: !679, line: 2122, column: 7)
!1801 = !DILocation(line: 2122, column: 12, scope: !1800)
!1802 = !DILocation(line: 2122, column: 19, scope: !1803)
!1803 = !DILexicalBlockFile(scope: !1804, file: !679, discriminator: 1)
!1804 = distinct !DILexicalBlock(scope: !1800, file: !679, line: 2122, column: 7)
!1805 = !DILocation(line: 2122, column: 23, scope: !1803)
!1806 = !DILocation(line: 2122, column: 21, scope: !1803)
!1807 = !DILocation(line: 2122, column: 7, scope: !1803)
!1808 = !DILocation(line: 2123, column: 14, scope: !1809)
!1809 = distinct !DILexicalBlock(scope: !1810, file: !679, line: 2123, column: 14)
!1810 = distinct !DILexicalBlock(scope: !1804, file: !679, line: 2122, column: 40)
!1811 = !DILocation(line: 2123, column: 28, scope: !1809)
!1812 = !DILocation(line: 2123, column: 20, scope: !1809)
!1813 = !DILocation(line: 2123, column: 17, scope: !1809)
!1814 = !DILocation(line: 2123, column: 14, scope: !1810)
!1815 = !DILocation(line: 2124, column: 13, scope: !1816)
!1816 = distinct !DILexicalBlock(scope: !1809, file: !679, line: 2123, column: 32)
!1817 = !DILocation(line: 2126, column: 7, scope: !1810)
!1818 = !DILocation(line: 2122, column: 36, scope: !1819)
!1819 = !DILexicalBlockFile(scope: !1804, file: !679, discriminator: 2)
!1820 = !DILocation(line: 2122, column: 7, scope: !1819)
!1821 = distinct !{!1821, !1822}
!1822 = !DILocation(line: 2122, column: 7, scope: !1797)
!1823 = !DILocation(line: 2127, column: 11, scope: !1824)
!1824 = distinct !DILexicalBlock(scope: !1797, file: !679, line: 2127, column: 11)
!1825 = !DILocation(line: 2127, column: 16, scope: !1824)
!1826 = !DILocation(line: 2127, column: 13, scope: !1824)
!1827 = !DILocation(line: 2127, column: 11, scope: !1797)
!1828 = !DILocation(line: 2128, column: 23, scope: !1829)
!1829 = distinct !DILexicalBlock(scope: !1824, file: !679, line: 2127, column: 28)
!1830 = !DILocation(line: 2128, column: 17, scope: !1829)
!1831 = !DILocation(line: 2129, column: 7, scope: !1829)
!1832 = !DILocation(line: 2130, column: 4, scope: !1797)
!1833 = !DILocation(line: 2119, column: 68, scope: !1834)
!1834 = !DILexicalBlockFile(scope: !1793, file: !679, discriminator: 2)
!1835 = !DILocation(line: 2119, column: 4, scope: !1834)
!1836 = distinct !{!1836, !1837}
!1837 = !DILocation(line: 2119, column: 4, scope: !1624)
!1838 = !DILocation(line: 2132, column: 8, scope: !1839)
!1839 = distinct !DILexicalBlock(scope: !1624, file: !679, line: 2132, column: 8)
!1840 = !DILocation(line: 2132, column: 35, scope: !1839)
!1841 = !DILocation(line: 2132, column: 8, scope: !1624)
!1842 = !DILocation(line: 2133, column: 28, scope: !1843)
!1843 = distinct !DILexicalBlock(scope: !1839, file: !679, line: 2132, column: 41)
!1844 = !DILocation(line: 2133, column: 12, scope: !1843)
!1845 = !DILocation(line: 2133, column: 21, scope: !1843)
!1846 = !DILocation(line: 2134, column: 7, scope: !1843)
!1847 = !DILocation(line: 2135, column: 4, scope: !1843)
!1848 = !DILocalVariable(name: "err", scope: !1849, file: !679, line: 2143, type: !633)
!1849 = distinct !DILexicalBlock(scope: !1850, file: !679, line: 2142, column: 12)
!1850 = distinct !DILexicalBlock(scope: !1624, file: !679, line: 2142, column: 8)
!1851 = !DILocation(line: 2143, column: 11, scope: !1849)
!1852 = !DILocalVariable(name: "euid", scope: !1849, file: !679, line: 2144, type: !641)
!1853 = !DILocation(line: 2144, column: 13, scope: !1849)
!1854 = !DILocation(line: 2146, column: 14, scope: !1849)
!1855 = !DILocation(line: 2146, column: 12, scope: !1849)
!1856 = !DILocation(line: 2150, column: 7, scope: !1849)
!1857 = !DILocation(line: 2155, column: 13, scope: !1849)
