; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpdconv.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpdconv.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.swap_me = type { i32 }
%struct.anon.0 = type { [4 x i8] }

@verbose_flag = global i32 0, align 4
@_dbg_flag = global i32 0, align 4
@.str = private unnamed_addr constant [8 x i8] c"i:o:vVh\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !11)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpdconv.o.i", directory: "/home/lichi/Desktop")
!2 = !{}
!3 = !{!4, !5, !6, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !10, line: 30, baseType: !6)
!10 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!11 = !{!12, !14, !15, !30, !31, !32}
!12 = distinct !DIGlobalVariable(name: "verbose_flag", scope: !0, file: !13, line: 43, type: !5, isLocal: false, isDefinition: true, variable: i32* @verbose_flag)
!13 = !DIFile(filename: "genwqe_vpdconv.c", directory: "/home/lichi/Desktop")
!14 = distinct !DIGlobalVariable(name: "_dbg_flag", scope: !0, file: !13, line: 44, type: !5, isLocal: false, isDefinition: true, variable: i32* @_dbg_flag)
!15 = distinct !DIGlobalVariable(name: "long_options", scope: !0, file: !13, line: 69, type: !16, isLocal: true, isDefinition: true, variable: [8 x %struct.option]* @long_options)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, align: 64, elements: !28)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !18, line: 104, size: 256, align: 64, elements: !19)
!18 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop")
!19 = !{!20, !24, !25, !27}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !18, line: 106, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !17, file: !18, line: 109, baseType: !5, size: 32, align: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !17, file: !18, line: 110, baseType: !26, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !17, file: !18, line: 111, baseType: !5, size: 32, align: 32, offset: 192)
!28 = !{!29}
!29 = !DISubrange(count: 8)
!30 = distinct !DIGlobalVariable(name: "version", scope: !0, file: !13, line: 42, type: !21, isLocal: true, isDefinition: true, variable: i8** @version)
!31 = distinct !DIGlobalVariable(name: "reverse_mode", scope: !0, file: !13, line: 67, type: !5, isLocal: true, isDefinition: true, variable: i32* @reverse_mode)
!32 = distinct !DIGlobalVariable(name: "make_crc", scope: !0, file: !13, line: 66, type: !5, isLocal: true, isDefinition: true, variable: i32* @make_crc)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!36 = distinct !DISubprogram(name: "main", scope: !13, file: !13, line: 83, type: !37, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!37 = !DISubroutineType(types: !38)
!38 = !{!5, !5, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!41 = !DILocalVariable(name: "argc", arg: 1, scope: !36, file: !13, line: 83, type: !5)
!42 = !DIExpression()
!43 = !DILocation(line: 83, column: 14, scope: !36)
!44 = !DILocalVariable(name: "argv", arg: 2, scope: !36, file: !13, line: 83, type: !39)
!45 = !DILocation(line: 83, column: 26, scope: !36)
!46 = !DILocalVariable(name: "option", scope: !36, file: !13, line: 85, type: !5)
!47 = !DILocation(line: 85, column: 9, scope: !36)
!48 = !DILocalVariable(name: "input_file", scope: !36, file: !13, line: 86, type: !40)
!49 = !DILocation(line: 86, column: 11, scope: !36)
!50 = !DILocalVariable(name: "output_file", scope: !36, file: !13, line: 87, type: !40)
!51 = !DILocation(line: 87, column: 11, scope: !36)
!52 = !DILocalVariable(name: "ip", scope: !36, file: !13, line: 88, type: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !55, line: 48, baseType: !56)
!55 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 241, size: 1728, align: 64, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !86, !88, !90, !94, !97, !99, !100, !101, !102, !103, !107, !108}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 242, baseType: !5, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 247, baseType: !40, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 248, baseType: !40, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 249, baseType: !40, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 250, baseType: !40, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 251, baseType: !40, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 252, baseType: !40, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 253, baseType: !40, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 254, baseType: !40, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 256, baseType: !40, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 257, baseType: !40, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 258, baseType: !40, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 260, baseType: !72, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 156, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !57, line: 157, baseType: !72, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !57, line: 158, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !57, line: 162, baseType: !5, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 262, baseType: !77, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 264, baseType: !5, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 268, baseType: !5, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 270, baseType: !83, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 131, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!85 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 274, baseType: !87, size: 16, align: 16, offset: 1024)
!87 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 275, baseType: !89, size: 8, align: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 276, baseType: !91, size: 8, align: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 280, baseType: !95, size: 64, align: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 150, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 289, baseType: !98, size: 64, align: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 132, baseType: !85)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !56, file: !57, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !56, file: !57, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 302, baseType: !104, size: 64, align: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 216, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!106 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 303, baseType: !5, size: 32, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 305, baseType: !109, size: 160, align: 8, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DILocation(line: 88, column: 11, scope: !36)
!113 = !DILocalVariable(name: "op", scope: !36, file: !13, line: 88, type: !53)
!114 = !DILocation(line: 88, column: 22, scope: !36)
!115 = !DILocalVariable(name: "buffer", scope: !36, file: !13, line: 89, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !118, line: 48, baseType: !119)
!118 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!119 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!120 = !DILocation(line: 89, column: 14, scope: !36)
!121 = !DILocalVariable(name: "crc32", scope: !36, file: !13, line: 90, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !118, line: 51, baseType: !8)
!123 = !DILocation(line: 90, column: 14, scope: !36)
!124 = !DILocalVariable(name: "crc32_from_csv", scope: !36, file: !13, line: 90, type: !122)
!125 = !DILocation(line: 90, column: 21, scope: !36)
!126 = !DILocalVariable(name: "size", scope: !36, file: !13, line: 91, type: !5)
!127 = !DILocation(line: 91, column: 9, scope: !36)
!128 = !DILocalVariable(name: "rc", scope: !36, file: !13, line: 91, type: !5)
!129 = !DILocation(line: 91, column: 15, scope: !36)
!130 = !DILocalVariable(name: "new_crc32", scope: !36, file: !13, line: 92, type: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "swap_me", file: !132, line: 69, size: 32, align: 32, elements: !133)
!132 = !DIFile(filename: "../include/genwqe_vpd.h", directory: "/home/lichi/Desktop")
!133 = !{!134, !135, !143}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ui32", scope: !131, file: !132, line: 70, baseType: !122, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "WORD", scope: !131, file: !132, line: 73, baseType: !136, size: 32, align: 16)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !132, line: 71, size: 32, align: 16, elements: !137)
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "uw16", scope: !136, file: !132, line: 72, baseType: !139, size: 32, align: 16)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 32, align: 16, elements: !141)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !118, line: 49, baseType: !87)
!141 = !{!142}
!142 = !DISubrange(count: 2)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "BYTE", scope: !131, file: !132, line: 76, baseType: !144, size: 32, align: 8)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !132, line: 74, size: 32, align: 8, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ub8", scope: !144, file: !132, line: 75, baseType: !147, size: 32, align: 8)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, align: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DILocation(line: 92, column: 19, scope: !36)
!151 = !DILocalVariable(name: "file_size", scope: !36, file: !13, line: 93, type: !104)
!152 = !DILocation(line: 93, column: 12, scope: !36)
!153 = !DILocation(line: 96, column: 5, scope: !36)
!154 = !DILocalVariable(name: "option_index", scope: !155, file: !13, line: 97, type: !5)
!155 = distinct !DILexicalBlock(scope: !36, file: !13, line: 96, column: 15)
!156 = !DILocation(line: 97, column: 6, scope: !155)
!157 = !DILocation(line: 98, column: 23, scope: !155)
!158 = !DILocation(line: 98, column: 29, scope: !155)
!159 = !DILocation(line: 98, column: 11, scope: !155)
!160 = !DILocation(line: 98, column: 9, scope: !155)
!161 = !DILocation(line: 100, column: 12, scope: !162)
