; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpd_common.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpd_common.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.vpd_layout = type { i8*, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.swap_me = type { i32 }
%struct.anon.0 = type { [4 x i8] }

@genwqe_crc32_lut = internal global [256 x i32] zeroinitializer, align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !30)
!1 = !DIFile(filename: "/home/lichi/Desktop/genwqe/[task]tools--genwqe_vpdconv/[inter]tools--genwqe_vpd_common.o.i", directory: "/home/lichi/Desktop")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !21, !24, !26, !27}
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !22, line: 26, baseType: !23)
!22 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/lichi/Desktop")
!23 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !25, line: 30, baseType: !21)
!25 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/lichi/Desktop")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !28, line: 48, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop")
!29 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!30 = !{!31, !37, !52}
!31 = distinct !DIGlobalVariable(name: "genwqe_crc32_lut", scope: !0, file: !32, line: 45, type: !33, isLocal: true, isDefinition: true, variable: [256 x i32]* @genwqe_crc32_lut)
!32 = !DIFile(filename: "genwqe_vpd_common.c", directory: "/home/lichi/Desktop")
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8192, align: 32, elements: !35)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !28, line: 51, baseType: !23)
!35 = !{!36}
!36 = !DISubrange(count: 256)
!37 = distinct !DIGlobalVariable(name: "vpd_ref_102", scope: !0, file: !38, line: 51, type: !39, isLocal: true, isDefinition: true, variable: [10 x %struct.vpd_layout]* @vpd_ref_102)
!38 = !DIFile(filename: "../include/genwqe_vpd.h", directory: "/home/lichi/Desktop")
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1920, align: 64, elements: !50)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vpd_layout", file: !38, line: 43, size: 192, align: 64, elements: !42)
!42 = !{!43, !47, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !41, file: !38, line: 44, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !41, file: !38, line: 45, baseType: !48, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !41, file: !38, line: 46, baseType: !44, size: 64, align: 64, offset: 128)
!50 = !{!51}
!51 = !DISubrange(count: 10)
!52 = distinct !DIGlobalVariable(name: "crc_token", scope: !0, file: !32, line: 48, type: !53, isLocal: true, isDefinition: true, variable: [3 x i8]* @crc_token)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 24, align: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 3)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!59 = distinct !DISubprogram(name: "genwqe_crc32_setup_lut", scope: !32, file: !32, line: 50, type: !60, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{null}
!62 = !{}
!63 = !DILocalVariable(name: "i", scope: !59, file: !32, line: 52, type: !23)
!64 = !DIExpression()
!65 = !DILocation(line: 52, column: 15, scope: !59)
!66 = !DILocalVariable(name: "j", scope: !59, file: !32, line: 52, type: !23)
!67 = !DILocation(line: 52, column: 18, scope: !59)
!68 = !DILocalVariable(name: "crc", scope: !59, file: !32, line: 53, type: !34)
!69 = !DILocation(line: 53, column: 11, scope: !59)
!70 = !DILocation(line: 55, column: 9, scope: !71)
!71 = distinct !DILexicalBlock(scope: !59, file: !32, line: 55, column: 2)
!72 = !DILocation(line: 55, column: 7, scope: !71)
!73 = !DILocation(line: 55, column: 14, scope: !74)
!74 = !DILexicalBlockFile(scope: !75, file: !32, discriminator: 1)
!75 = distinct !DILexicalBlock(scope: !71, file: !32, line: 55, column: 2)
!76 = !DILocation(line: 55, column: 16, scope: !74)
!77 = !DILocation(line: 55, column: 2, scope: !74)
!78 = !DILocation(line: 56, column: 9, scope: !79)
!79 = distinct !DILexicalBlock(scope: !75, file: !32, line: 55, column: 85)
!80 = !DILocation(line: 56, column: 11, scope: !79)
!81 = !DILocation(line: 56, column: 7, scope: !79)
!82 = !DILocation(line: 57, column: 11, scope: !83)
!83 = distinct !DILexicalBlock(scope: !79, file: !32, line: 57, column: 3)
!84 = !DILocation(line: 57, column: 9, scope: !83)
!85 = !DILocation(line: 57, column: 16, scope: !86)
!86 = !DILexicalBlockFile(scope: !87, file: !32, discriminator: 1)
!87 = distinct !DILexicalBlock(scope: !83, file: !32, line: 57, column: 3)
!88 = !DILocation(line: 57, column: 18, scope: !86)
!89 = !DILocation(line: 57, column: 3, scope: !86)
!90 = !DILocation(line: 58, column: 8, scope: !91)
!91 = distinct !DILexicalBlock(scope: !92, file: !32, line: 58, column: 8)
!92 = distinct !DILexicalBlock(scope: !87, file: !32, line: 57, column: 29)
!93 = !DILocation(line: 58, column: 12, scope: !91)
!94 = !DILocation(line: 58, column: 8, scope: !92)
!95 = !DILocation(line: 59, column: 12, scope: !91)
!96 = !DILocation(line: 59, column: 16, scope: !91)
!97 = !DILocation(line: 59, column: 22, scope: !91)
!98 = !DILocation(line: 59, column: 9, scope: !91)
!99 = !DILocation(line: 59, column: 5, scope: !91)
!100 = !DILocation(line: 61, column: 12, scope: !91)
!101 = !DILocation(line: 61, column: 16, scope: !91)
!102 = !DILocation(line: 61, column: 9, scope: !91)
!103 = !DILocation(line: 62, column: 3, scope: !92)
!104 = !DILocation(line: 57, column: 24, scope: !105)
!105 = !DILexicalBlockFile(scope: !87, file: !32, discriminator: 2)
!106 = !DILocation(line: 57, column: 3, scope: !105)
!107 = distinct !{!107, !108}
!108 = !DILocation(line: 57, column: 3, scope: !79)
!109 = !DILocation(line: 63, column: 25, scope: !79)
!110 = !DILocation(line: 63, column: 20, scope: !79)
!111 = !DILocation(line: 63, column: 3, scope: !79)
!112 = !DILocation(line: 63, column: 23, scope: !79)
!113 = !DILocation(line: 64, column: 2, scope: !79)
!114 = !DILocation(line: 55, column: 81, scope: !115)
!115 = !DILexicalBlockFile(scope: !75, file: !32, discriminator: 2)
!116 = !DILocation(line: 55, column: 2, scope: !115)
!117 = distinct !{!117, !118}
!118 = !DILocation(line: 55, column: 2, scope: !59)
!119 = !DILocation(line: 65, column: 1, scope: !59)
!120 = distinct !DISubprogram(name: "genwqe_crc32_gen", scope: !32, file: !32, line: 67, type: !121, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!121 = !DISubroutineType(types: !122)
!122 = !{!34, !123, !124, !34}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 216, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DILocalVariable(name: "buff", arg: 1, scope: !120, file: !32, line: 67, type: !123)
!128 = !DILocation(line: 67, column: 36, scope: !120)
!129 = !DILocalVariable(name: "len", arg: 2, scope: !120, file: !32, line: 67, type: !124)
!130 = !DILocation(line: 67, column: 49, scope: !120)
!131 = !DILocalVariable(name: "init", arg: 3, scope: !120, file: !32, line: 67, type: !34)
!132 = !DILocation(line: 67, column: 63, scope: !120)
!133 = !DILocalVariable(name: "i", scope: !120, file: !32, line: 69, type: !19)
!134 = !DILocation(line: 69, column: 6, scope: !120)
!135 = !DILocalVariable(name: "crc", scope: !120, file: !32, line: 70, type: !34)
!136 = !DILocation(line: 70, column: 11, scope: !120)
!137 = !DILocation(line: 72, column: 8, scope: !120)
!138 = !DILocation(line: 72, column: 6, scope: !120)
!139 = !DILocation(line: 73, column: 2, scope: !120)
!140 = !DILocation(line: 73, column: 11, scope: !141)
!141 = !DILexicalBlockFile(scope: !120, file: !32, discriminator: 1)
!142 = !DILocation(line: 73, column: 2, scope: !141)
!143 = !DILocation(line: 74, column: 9, scope: !144)
!144 = distinct !DILexicalBlock(scope: !120, file: !32, line: 73, column: 15)
!145 = !DILocation(line: 74, column: 13, scope: !144)
!146 = !DILocation(line: 74, column: 27, scope: !144)
!147 = !DILocation(line: 74, column: 22, scope: !144)
!148 = !DILocation(line: 74, column: 20, scope: !144)
!149 = !DILocation(line: 74, column: 31, scope: !144)
!150 = !DILocation(line: 74, column: 5, scope: !144)
!151 = !DILocation(line: 75, column: 10, scope: !144)
!152 = !DILocation(line: 75, column: 14, scope: !144)
!153 = !DILocation(line: 75, column: 39, scope: !144)
!154 = !DILocation(line: 75, column: 22, scope: !144)
!155 = !DILocation(line: 75, column: 20, scope: !144)
!156 = !DILocation(line: 75, column: 7, scope: !144)
!157 = !DILocation(line: 73, column: 2, scope: !158)
!158 = !DILexicalBlockFile(scope: !120, file: !32, discriminator: 2)
!159 = distinct !{!159, !139}
!160 = !DILocation(line: 77, column: 9, scope: !120)
!161 = !DILocation(line: 77, column: 2, scope: !120)
!162 = distinct !DISubprogram(name: "bin_2_csv", scope: !32, file: !32, line: 95, type: !163, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !166, !19, !123}
!165 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 48, baseType: !169)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 241, size: 1728, align: 64, elements: !171)
!170 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!171 = !{!172, !173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !193, !194, !195, !196, !200, !201, !203, !207, !210, !212, !213, !214, !215, !216, !217, !218}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 242, baseType: !19, size: 32, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 247, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 248, baseType: !174, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 249, baseType: !174, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 250, baseType: !174, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 251, baseType: !174, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 252, baseType: !174, size: 64, align: 64, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 253, baseType: !174, size: 64, align: 64, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 254, baseType: !174, size: 64, align: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 256, baseType: !174, size: 64, align: 64, offset: 576)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 257, baseType: !174, size: 64, align: 64, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 258, baseType: !174, size: 64, align: 64, offset: 704)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 260, baseType: !186, size: 64, align: 64, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 156, size: 192, align: 64, elements: !188)
!188 = !{!189, !190, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !187, file: !170, line: 157, baseType: !186, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !187, file: !170, line: 158, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !187, file: !170, line: 162, baseType: !19, size: 32, align: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 262, baseType: !191, size: 64, align: 64, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 264, baseType: !19, size: 32, align: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 268, baseType: !19, size: 32, align: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 270, baseType: !197, size: 64, align: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 131, baseType: !199)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 274, baseType: !20, size: 16, align: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 275, baseType: !202, size: 8, align: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 276, baseType: !204, size: 8, align: 8, offset: 1048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 280, baseType: !208, size: 64, align: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 150, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 289, baseType: !211, size: 64, align: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 132, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !169, file: !170, line: 297, baseType: !26, size: 64, align: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !169, file: !170, line: 298, baseType: !26, size: 64, align: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !169, file: !170, line: 299, baseType: !26, size: 64, align: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !169, file: !170, line: 300, baseType: !26, size: 64, align: 64, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 302, baseType: !124, size: 64, align: 64, offset: 1472)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 303, baseType: !19, size: 32, align: 32, offset: 1536)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 305, baseType: !219, size: 160, align: 8, offset: 1568)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 8, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 20)
!222 = !DILocalVariable(name: "op", arg: 1, scope: !162, file: !32, line: 95, type: !166)
!223 = !DILocation(line: 95, column: 21, scope: !162)
!224 = !DILocalVariable(name: "fs", arg: 2, scope: !162, file: !32, line: 95, type: !19)
!225 = !DILocation(line: 95, column: 29, scope: !162)
!226 = !DILocalVariable(name: "buffer", arg: 3, scope: !162, file: !32, line: 95, type: !123)
!227 = !DILocation(line: 95, column: 42, scope: !162)
!228 = !DILocalVariable(name: "mode", scope: !162, file: !32, line: 97, type: !46)
!229 = !DILocation(line: 97, column: 7, scope: !162)
!230 = !DILocalVariable(name: "label", scope: !162, file: !32, line: 98, type: !231)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, align: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DILocation(line: 98, column: 7, scope: !162)
!235 = !DILocalVariable(name: "length", scope: !162, file: !32, line: 99, type: !19)
!236 = !DILocation(line: 99, column: 6, scope: !162)
!237 = !DILocalVariable(name: "n", scope: !162, file: !32, line: 100, type: !19)
!238 = !DILocation(line: 100, column: 6, scope: !162)
!239 = !DILocalVariable(name: "vpd_check_line", scope: !162, file: !32, line: 101, type: !19)
!240 = !DILocation(line: 101, column: 6, scope: !162)
!241 = !DILocalVariable(name: "swap", scope: !162, file: !32, line: 102, type: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "swap_me", file: !38, line: 69, size: 32, align: 32, elements: !243)
!243 = !{!244, !245, !253}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ui32", scope: !242, file: !38, line: 70, baseType: !34, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "WORD", scope: !242, file: !38, line: 73, baseType: !246, size: 32, align: 16)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !38, line: 71, size: 32, align: 16, elements: !247)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "uw16", scope: !246, file: !38, line: 72, baseType: !249, size: 32, align: 16)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 32, align: 16, elements: !251)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !28, line: 49, baseType: !20)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "BYTE", scope: !242, file: !38, line: 76, baseType: !254, size: 32, align: 8)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !38, line: 74, size: 32, align: 8, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ub8", scope: !254, file: !38, line: 75, baseType: !257, size: 32, align: 8)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, align: 8, elements: !232)
!258 = !DILocation(line: 102, column: 16, scope: !162)
!259 = !DILocation(line: 104, column: 7, scope: !162)
!260 = !DILocation(line: 104, column: 12, scope: !162)
!261 = !DILocation(line: 105, column: 2, scope: !162)
!262 = !DILocation(line: 105, column: 9, scope: !263)
!263 = !DILexicalBlockFile(scope: !162, file: !32, discriminator: 1)
!264 = !DILocation(line: 105, column: 2, scope: !263)
!265 = !DILocation(line: 106, column: 21, scope: !266)
!266 = distinct !DILexicalBlock(scope: !162, file: !32, line: 105, column: 13)
!267 = !DILocation(line: 106, column: 14, scope: !266)
!268 = !DILocation(line: 106, column: 3, scope: !266)
!269 = !DILocation(line: 106, column: 12, scope: !266)
!270 = !DILocation(line: 107, column: 21, scope: !266)
!271 = !DILocation(line: 107, column: 14, scope: !266)
!272 = !DILocation(line: 107, column: 3, scope: !266)
!273 = !DILocation(line: 107, column: 12, scope: !266)
