; ModuleID = './libNicInfo_la-nicInfoPosix.o.i'
source_filename = "./libNicInfo_la-nicInfoPosix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.NicInfoV3 = type { %struct.anon, %struct.anon.3, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon = type { i32, %struct.GuestNicV3* }
%struct.GuestNicV3 = type { i8*, %struct.anon.0, %struct.DnsConfigInfo*, %struct.WinsConfigInfo*, %struct.DhcpConfigInfo*, %struct.DhcpConfigInfo* }
%struct.anon.0 = type { i32, %struct.IpAddressEntry* }
%struct.IpAddressEntry = type { %struct.TypedIpAddress, i32, i32*, i32* }
%struct.TypedIpAddress = type { i32, %struct.InetAddress }
%struct.InetAddress = type { i32, i8* }
%struct.anon.3 = type { i32, %struct.InetCidrRouteEntry* }
%struct.InetCidrRouteEntry = type { %struct.TypedIpAddress, i32, %struct.TypedIpAddress*, i32, i32, i32 }
%struct.DnsConfigInfo = type { i8**, i8**, %struct.anon.1, %struct.anon.2 }
%struct.anon.1 = type { i32, %struct.TypedIpAddress* }
%struct.anon.2 = type { i32, i8** }
%struct.WinsConfigInfo = type { %struct.TypedIpAddress, %struct.TypedIpAddress }
%struct.DhcpConfigInfo = type { i32, i8* }
%struct.ifaddrs = type { %struct.ifaddrs*, i8*, i32, %struct.sockaddr*, %struct.sockaddr*, %union.anon, i8* }
%struct.sockaddr = type { i16, [14 x i8] }
%union.anon = type { %struct.sockaddr* }

!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InetAddressType", file: !16, line: 65, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guestrpc/nicinfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "IAT_UNKNOWN", value: 0)
!19 = !DIEnumerator(name: "IAT_IPV4", value: 1)
!20 = !DIEnumerator(name: "IAT_IPV6", value: 2)
!21 = !DIEnumerator(name: "IAT_IPV4Z", value: 3)
!22 = !DIEnumerator(name: "IAT_IPV6Z", value: 4)
!23 = !DIEnumerator(name: "IAT_DNS", value: 16)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpAddressOrigin", file: !16, line: 77, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30}
!26 = !DIEnumerator(name: "IAO_OTHER", value: 1)
!27 = !DIEnumerator(name: "IAO_MANUAL", value: 2)
!28 = !DIEnumerator(name: "IAO_DHCP", value: 4)
!29 = !DIEnumerator(name: "IAO_LINKLAYER", value: 5)
!30 = !DIEnumerator(name: "IAO_RANDOM", value: 6)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IpAddressStatus", file: !16, line: 86, size: 32, align: 32, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40}
!33 = !DIEnumerator(name: "IAS_PREFERRED", value: 1)
!34 = !DIEnumerator(name: "IAS_DEPRECATED", value: 2)
!35 = !DIEnumerator(name: "IAS_INVALID", value: 3)
!36 = !DIEnumerator(name: "IAS_INACCESSIBLE", value: 4)
!37 = !DIEnumerator(name: "IAS_UNKNOWN", value: 5)
!38 = !DIEnumerator(name: "IAS_TENTATIVE", value: 6)
!39 = !DIEnumerator(name: "IAS_DUPLICATE", value: 7)
!40 = !DIEnumerator(name: "IAS_OPTIMISTIC", value: 8)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "InetCidrRouteType", file: !16, line: 138, size: 32, align: 32, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "ICRT_OTHER", value: 1)
!44 = !DIEnumerator(name: "ICRT_REJECT", value: 2)
!45 = !DIEnumerator(name: "ICRT_LOCAL", value: 3)
!46 = !DIEnumerator(name: "ICRT_REMOTE", value: 4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 34, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/nicInfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "NICINFO_PRIORITY_PRIMARY", value: 0)
!51 = !DIEnumerator(name: "NICINFO_PRIORITY_NORMAL", value: 1)
!52 = !DIEnumerator(name: "NICINFO_PRIORITY_LOW", value: 2)
!53 = !DIEnumerator(name: "NICINFO_PRIORITY_MAX", value: 3)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 42, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!57 = !DIEnumerator(name: "IFF_UP", value: 1)
!58 = !DIEnumerator(name: "IFF_BROADCAST", value: 2)
!59 = !DIEnumerator(name: "IFF_DEBUG", value: 4)
!60 = !DIEnumerator(name: "IFF_LOOPBACK", value: 8)
!61 = !DIEnumerator(name: "IFF_POINTOPOINT", value: 16)
!62 = !DIEnumerator(name: "IFF_NOTRAILERS", value: 32)
!63 = !DIEnumerator(name: "IFF_RUNNING", value: 64)
!64 = !DIEnumerator(name: "IFF_NOARP", value: 128)
!65 = !DIEnumerator(name: "IFF_PROMISC", value: 256)
!66 = !DIEnumerator(name: "IFF_ALLMULTI", value: 512)
!67 = !DIEnumerator(name: "IFF_MASTER", value: 1024)
!68 = !DIEnumerator(name: "IFF_SLAVE", value: 2048)
!69 = !DIEnumerator(name: "IFF_MULTICAST", value: 4096)
!70 = !DIEnumerator(name: "IFF_PORTSEL", value: 8192)
!71 = !DIEnumerator(name: "IFF_AUTOMEDIA", value: 16384)
!72 = !DIEnumerator(name: "IFF_DYNAMIC", value: 32768)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !74, line: 81, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!75 = !{!76, !77, !78}
!76 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!77 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!78 = !DIEnumerator(name: "XDR_FREE", value: 2)
!79 = !{!80, !84, !85, !99, !115, !123, !140, !164, !166, !168, !171, !172, !170, !249, !261, !136}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !82, line: 46, baseType: !83)
!82 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!83 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !87, line: 166, size: 1024, align: 64, elements: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!88 = !{!89, !93, !97}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !86, file: !87, line: 168, baseType: !90, size: 16, align: 16)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !91, line: 28, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !86, file: !87, line: 169, baseType: !94, size: 944, align: 8, offset: 16)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 944, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 118)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !86, file: !87, line: 170, baseType: !98, size: 64, align: 64, offset: 960)
!98 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ll", file: !101, line: 22, size: 160, align: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/netpacket/packet.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!102 = !{!103, !104, !105, !107, !108, !110, !111}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sll_family", scope: !100, file: !101, line: 24, baseType: !92, size: 16, align: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sll_protocol", scope: !100, file: !101, line: 25, baseType: !92, size: 16, align: 16, offset: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sll_ifindex", scope: !100, file: !101, line: 26, baseType: !106, size: 32, align: 32, offset: 32)
!106 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sll_hatype", scope: !100, file: !101, line: 27, baseType: !92, size: 16, align: 16, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sll_pkttype", scope: !100, file: !101, line: 28, baseType: !109, size: 8, align: 8, offset: 80)
!109 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sll_halen", scope: !100, file: !101, line: 29, baseType: !109, size: 8, align: 8, offset: 88)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sll_addr", scope: !100, file: !101, line: 30, baseType: !112, size: 64, align: 8, offset: 96)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 8)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !87, line: 153, size: 128, align: 16, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !116, file: !87, line: 155, baseType: !90, size: 16, align: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !116, file: !87, line: 156, baseType: !120, size: 112, align: 8, offset: 16)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 112, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 14)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !125, line: 239, size: 128, align: 32, elements: !126)
!125 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!126 = !{!127, !128, !132, !139}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !124, file: !125, line: 241, baseType: !90, size: 16, align: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !124, file: !125, line: 242, baseType: !129, size: 16, align: 16, offset: 16)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !125, line: 119, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !131, line: 49, baseType: !92)
!131 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !124, file: !125, line: 243, baseType: !133, size: 32, align: 32, offset: 32)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !125, line: 31, size: 32, align: 32, elements: !134)
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !133, file: !125, line: 33, baseType: !136, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !125, line: 30, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !131, line: 51, baseType: !138)
!138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !124, file: !125, line: 246, baseType: !112, size: 64, align: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !125, line: 254, size: 224, align: 32, elements: !142)
!142 = !{!143, !144, !145, !146, !163}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !141, file: !125, line: 256, baseType: !90, size: 16, align: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !141, file: !125, line: 257, baseType: !129, size: 16, align: 16, offset: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !141, file: !125, line: 258, baseType: !137, size: 32, align: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !141, file: !125, line: 259, baseType: !147, size: 128, align: 32, offset: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !125, line: 211, size: 128, align: 32, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !147, file: !125, line: 220, baseType: !150, size: 128, align: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !125, line: 213, size: 128, align: 32, elements: !151)
!151 = !{!152, !157, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !150, file: !125, line: 215, baseType: !153, size: 128, align: 8)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, align: 8, elements: !155)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !131, line: 48, baseType: !109)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !150, file: !125, line: 217, baseType: !158, size: 128, align: 16)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 16, elements: !113)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !150, file: !125, line: 218, baseType: !160, size: 128, align: 32)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, align: 32, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 4)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !141, file: !125, line: 260, baseType: !137, size: 32, align: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !131, line: 55, baseType: !98)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsHostname", file: !16, line: 113, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !74, line: 152, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !178, !84, null}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !177, line: 37, baseType: !106)
!177 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !74, line: 109, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !74, line: 110, size: 384, align: 64, elements: !181)
!181 = !{!182, !183, !245, !246, !247, !248}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !180, file: !74, line: 112, baseType: !73, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !180, file: !74, line: 136, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !74, line: 113, size: 640, align: 64, elements: !186)
!186 = !{!187, !193, !199, !209, !215, !221, !225, !231, !235, !239}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !185, file: !74, line: 115, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!176, !178, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !185, file: !74, line: 117, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!176, !178, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !185, file: !74, line: 119, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!176, !178, !203, !207}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !204, line: 116, baseType: !205)
!204 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !206, line: 183, baseType: !170)
!206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !204, line: 35, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !206, line: 32, baseType: !138)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !185, file: !74, line: 121, baseType: !210, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!176, !178, !213, !207}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !185, file: !74, line: 123, baseType: !216, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!207, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !185, file: !74, line: 125, baseType: !222, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!176, !178, !207}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !185, file: !74, line: 127, baseType: !226, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !178, !207}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !204, line: 196, baseType: !106)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !185, file: !74, line: 129, baseType: !232, size: 64, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !178}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !185, file: !74, line: 131, baseType: !236, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!176, !178, !229}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !185, file: !74, line: 133, baseType: !240, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!176, !178, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !180, file: !74, line: 137, baseType: !203, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !180, file: !74, line: 138, baseType: !203, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !180, file: !74, line: 139, baseType: !203, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !180, file: !74, line: 140, baseType: !207, size: 32, align: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypedIpAddress", file: !16, line: 102, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TypedIpAddress", file: !16, line: 98, size: 192, align: 64, elements: !252)
!252 = !{!253, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddrType", scope: !251, file: !16, line: 99, baseType: !254, size: 32, align: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressType", file: !16, line: 73, baseType: !15)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !251, file: !16, line: 100, baseType: !256, size: 128, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddress", file: !16, line: 63, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 60, size: 128, align: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_len", scope: !257, file: !16, line: 61, baseType: !207, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "InetAddress_val", scope: !257, file: !16, line: 62, baseType: !170, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteEntry", file: !16, line: 154, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InetCidrRouteEntry", file: !16, line: 146, size: 448, align: 64, elements: !264)
!264 = !{!265, !266, !268, !269, !272, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteDest", scope: !263, file: !16, line: 147, baseType: !250, size: 192, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRoutePfxLen", scope: !263, file: !16, line: 148, baseType: !267, size: 32, align: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetAddressPrefixLength", file: !16, line: 75, baseType: !207)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteNextHop", scope: !263, file: !16, line: 149, baseType: !249, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteIfIndex", scope: !263, file: !16, line: 150, baseType: !270, size: 32, align: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !271, line: 173, baseType: !137)
!271 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteType", scope: !263, file: !16, line: 151, baseType: !273, size: 32, align: 32, offset: 352)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "InetCidrRouteType", file: !16, line: 144, baseType: !41)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "inetCidrRouteMetric", scope: !263, file: !16, line: 152, baseType: !270, size: 32, align: 32, offset: 384)
!275 = !{i32 2, !"Dwarf Version", i32 4}
!276 = !{i32 2, !"Debug Info Version", i32 3}
!277 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!278 = distinct !DISubprogram(name: "GuestInfoGetFqdn", scope: !279, file: !279, line: 180, type: !280, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!279 = !DIFile(filename: "nicInfoPosix.c", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!280 = !DISubroutineType(types: !281)
!281 = !{!282, !106, !170}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !271, line: 230, baseType: !83)
!283 = !{}
!284 = !DILocalVariable(name: "outBufLen", arg: 1, scope: !278, file: !279, line: 180, type: !106)
!285 = !DIExpression()
!286 = !DILocation(line: 180, column: 22, scope: !278)
!287 = !DILocalVariable(name: "fqdn", arg: 2, scope: !278, file: !279, line: 181, type: !170)
!288 = !DILocation(line: 181, column: 23, scope: !278)
!289 = !DILocation(line: 184, column: 20, scope: !290)
!290 = distinct !DILexicalBlock(scope: !278, file: !279, line: 184, column: 8)
!291 = !DILocation(line: 184, column: 26, scope: !290)
!292 = !DILocation(line: 184, column: 8, scope: !290)
!293 = !DILocation(line: 184, column: 37, scope: !290)
!294 = !DILocation(line: 184, column: 8, scope: !278)
!295 = !DILocation(line: 185, column: 7, scope: !296)
!296 = distinct !DILexicalBlock(scope: !290, file: !279, line: 184, column: 42)
!297 = !DILocation(line: 186, column: 7, scope: !296)
!298 = !DILocation(line: 189, column: 4, scope: !278)
!299 = !DILocation(line: 190, column: 1, scope: !278)
!300 = distinct !DISubprogram(name: "GuestInfoGetNicInfo", scope: !279, file: !279, line: 353, type: !301, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!301 = !DISubroutineType(types: !302)
!302 = !{!282, !138, !138, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoV3", file: !16, line: 190, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NicInfoV3", file: !16, line: 176, size: 512, align: 64, elements: !306)
!306 = !{!307, !366, !371, !372, !373, !374}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nics", scope: !305, file: !16, line: 180, baseType: !308, size: 128, align: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !16, line: 177, size: 128, align: 64, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nics_len", scope: !308, file: !16, line: 178, baseType: !207, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nics_val", scope: !308, file: !16, line: 179, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestNicV3", file: !16, line: 174, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestNicV3", file: !16, line: 163, size: 448, align: 64, elements: !315)
!315 = !{!316, !317, !334, !351, !358, !365}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "macAddress", scope: !314, file: !16, line: 164, baseType: !170, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ips", scope: !314, file: !16, line: 168, baseType: !318, size: 128, align: 64, offset: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !16, line: 165, size: 128, align: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ips_len", scope: !318, file: !16, line: 166, baseType: !207, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ips_val", scope: !318, file: !16, line: 167, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressEntry", file: !16, line: 110, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IpAddressEntry", file: !16, line: 104, size: 384, align: 64, elements: !325)
!325 = !{!326, !327, !328, !331}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressAddr", scope: !324, file: !16, line: 105, baseType: !250, size: 192, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressPrefixLength", scope: !324, file: !16, line: 106, baseType: !267, size: 32, align: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressOrigin", scope: !324, file: !16, line: 107, baseType: !329, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressOrigin", file: !16, line: 84, baseType: !24)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ipAddressStatus", scope: !324, file: !16, line: 108, baseType: !332, size: 64, align: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "IpAddressStatus", file: !16, line: 96, baseType: !31)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !314, file: !16, line: 169, baseType: !335, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "DnsConfigInfo", file: !16, line: 129, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DnsConfigInfo", file: !16, line: 117, size: 384, align: 64, elements: !338)
!338 = !{!339, !340, !341, !346}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hostName", scope: !337, file: !16, line: 118, baseType: !168, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "domainName", scope: !337, file: !16, line: 119, baseType: !168, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "serverList", scope: !337, file: !16, line: 123, baseType: !342, size: 128, align: 64, offset: 128)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !16, line: 120, size: 128, align: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_len", scope: !342, file: !16, line: 121, baseType: !207, size: 32, align: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "serverList_val", scope: !342, file: !16, line: 122, baseType: !249, size: 64, align: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes", scope: !337, file: !16, line: 127, baseType: !347, size: 128, align: 64, offset: 256)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !16, line: 124, size: 128, align: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_len", scope: !347, file: !16, line: 125, baseType: !207, size: 32, align: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "searchSuffixes_val", scope: !347, file: !16, line: 126, baseType: !168, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !314, file: !16, line: 170, baseType: !352, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "WinsConfigInfo", file: !16, line: 135, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WinsConfigInfo", file: !16, line: 131, size: 384, align: 64, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !354, file: !16, line: 132, baseType: !250, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !354, file: !16, line: 133, baseType: !250, size: 192, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !314, file: !16, line: 171, baseType: !359, size: 64, align: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DhcpConfigInfo", file: !16, line: 161, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DhcpConfigInfo", file: !16, line: 157, size: 128, align: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !361, file: !16, line: 158, baseType: !176, size: 32, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpSettings", scope: !361, file: !16, line: 159, baseType: !170, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !314, file: !16, line: 172, baseType: !359, size: 64, align: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "routes", scope: !305, file: !16, line: 184, baseType: !367, size: 128, align: 64, offset: 128)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !305, file: !16, line: 181, size: 128, align: 64, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "routes_len", scope: !367, file: !16, line: 182, baseType: !207, size: 32, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "routes_val", scope: !367, file: !16, line: 183, baseType: !261, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dnsConfigInfo", scope: !305, file: !16, line: 185, baseType: !335, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "winsConfigInfo", scope: !305, file: !16, line: 186, baseType: !352, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov4", scope: !305, file: !16, line: 187, baseType: !359, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dhcpConfigInfov6", scope: !305, file: !16, line: 188, baseType: !359, size: 64, align: 64, offset: 448)
!375 = !DILocalVariable(name: "maxIPv4Routes", arg: 1, scope: !300, file: !279, line: 353, type: !138)
!376 = !DILocation(line: 353, column: 34, scope: !300)
!377 = !DILocalVariable(name: "maxIPv6Routes", arg: 2, scope: !300, file: !279, line: 354, type: !138)
!378 = !DILocation(line: 354, column: 34, scope: !300)
!379 = !DILocalVariable(name: "nicInfo", arg: 3, scope: !300, file: !279, line: 355, type: !303)
!380 = !DILocation(line: 355, column: 32, scope: !300)
!381 = !DILocalVariable(name: "ifaddrs", scope: !300, file: !279, line: 395, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrs", file: !384, line: 29, size: 448, align: 64, elements: !385)
!384 = !DIFile(filename: "/usr/include/ifaddrs.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!385 = !{!386, !387, !388, !389, !390, !391, !396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_next", scope: !383, file: !384, line: 31, baseType: !382, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_name", scope: !383, file: !384, line: 33, baseType: !170, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !383, file: !384, line: 34, baseType: !138, size: 32, align: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_addr", scope: !383, file: !384, line: 36, baseType: !115, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_netmask", scope: !383, file: !384, line: 37, baseType: !115, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_ifu", scope: !383, file: !384, line: 46, baseType: !392, size: 64, align: 64, offset: 320)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !384, line: 38, size: 64, align: 64, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ifu_broadaddr", scope: !392, file: !384, line: 44, baseType: !115, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ifu_dstaddr", scope: !392, file: !384, line: 45, baseType: !115, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_data", scope: !383, file: !384, line: 56, baseType: !84, size: 64, align: 64, offset: 384)
!397 = !DILocation(line: 395, column: 20, scope: !300)
!398 = !DILocation(line: 397, column: 8, scope: !399)
!399 = distinct !DILexicalBlock(scope: !300, file: !279, line: 397, column: 8)
!400 = !DILocation(line: 397, column: 29, scope: !399)
!401 = !DILocation(line: 397, column: 34, scope: !399)
!402 = !DILocation(line: 397, column: 37, scope: !403)
!403 = !DILexicalBlockFile(scope: !399, file: !279, discriminator: 1)
!404 = !DILocation(line: 397, column: 45, scope: !403)
!405 = !DILocation(line: 397, column: 8, scope: !403)
!406 = !DILocalVariable(name: "priority", scope: !407, file: !279, line: 398, type: !408)
!407 = distinct !DILexicalBlock(scope: !399, file: !279, line: 397, column: 53)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "NicInfoPriority", file: !48, line: 39, baseType: !47)
!409 = !DILocation(line: 398, column: 23, scope: !407)
!410 = !DILocation(line: 403, column: 21, scope: !411)
!411 = distinct !DILexicalBlock(scope: !407, file: !279, line: 403, column: 7)
!412 = !DILocation(line: 403, column: 12, scope: !411)
!413 = !DILocation(line: 404, column: 12, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !279, line: 403, column: 7)
!415 = !DILocation(line: 404, column: 21, scope: !414)
!416 = !DILocation(line: 403, column: 7, scope: !417)
!417 = !DILexicalBlockFile(scope: !411, file: !279, discriminator: 1)
!418 = !DILocation(line: 406, column: 32, scope: !419)
!419 = distinct !DILexicalBlock(scope: !414, file: !279, line: 405, column: 24)
!420 = !DILocation(line: 406, column: 41, scope: !419)
!421 = !DILocation(line: 406, column: 51, scope: !419)
!422 = !DILocation(line: 406, column: 10, scope: !419)
!423 = !DILocation(line: 407, column: 7, scope: !419)
!424 = !DILocation(line: 405, column: 20, scope: !414)
!425 = !DILocation(line: 403, column: 7, scope: !426)
!426 = !DILexicalBlockFile(scope: !414, file: !279, discriminator: 2)
!427 = distinct !{!427, !428}
!428 = !DILocation(line: 403, column: 7, scope: !407)
!429 = !DILocation(line: 408, column: 19, scope: !407)
!430 = !DILocation(line: 408, column: 7, scope: !407)
!431 = !DILocation(line: 409, column: 4, scope: !407)
!432 = !DILocation(line: 412, column: 28, scope: !433)
!433 = distinct !DILexicalBlock(scope: !300, file: !279, line: 412, column: 8)
!434 = !DILocation(line: 412, column: 9, scope: !433)
!435 = !DILocation(line: 412, column: 8, scope: !300)
!436 = !DILocation(line: 413, column: 7, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !279, line: 412, column: 38)
!438 = !DILocation(line: 417, column: 9, scope: !439)
!439 = distinct !DILexicalBlock(scope: !300, file: !279, line: 417, column: 8)
!440 = !DILocation(line: 417, column: 23, scope: !439)
!441 = !DILocation(line: 417, column: 27, scope: !439)
!442 = !DILocation(line: 417, column: 30, scope: !443)
!443 = !DILexicalBlockFile(scope: !439, file: !279, discriminator: 1)
!444 = !DILocation(line: 417, column: 44, scope: !443)
!445 = !DILocation(line: 417, column: 49, scope: !443)
!446 = !DILocation(line: 418, column: 27, scope: !439)
!447 = !DILocation(line: 418, column: 42, scope: !439)
!448 = !DILocation(line: 418, column: 57, scope: !439)
!449 = !DILocation(line: 418, column: 9, scope: !439)
!450 = !DILocation(line: 417, column: 8, scope: !451)
!451 = !DILexicalBlockFile(scope: !300, file: !279, discriminator: 2)
!452 = !DILocation(line: 419, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !439, file: !279, line: 418, column: 67)
!454 = !DILocation(line: 422, column: 4, scope: !300)
!455 = !DILocation(line: 430, column: 1, scope: !300)
!456 = distinct !DISubprogram(name: "GuestInfoGetInterface", scope: !279, file: !279, line: 258, type: !457, isLocal: true, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !382, !408, !303}
!459 = !DILocalVariable(name: "ifaddrs", arg: 1, scope: !456, file: !279, line: 258, type: !382)
!460 = !DILocation(line: 258, column: 39, scope: !456)
!461 = !DILocalVariable(name: "priority", arg: 2, scope: !456, file: !279, line: 259, type: !408)
!462 = !DILocation(line: 259, column: 39, scope: !456)
!463 = !DILocalVariable(name: "nicInfo", arg: 3, scope: !456, file: !279, line: 260, type: !303)
!464 = !DILocation(line: 260, column: 34, scope: !456)
!465 = !DILocalVariable(name: "pkt", scope: !456, file: !279, line: 262, type: !382)
!466 = !DILocation(line: 262, column: 20, scope: !456)
!467 = !DILocation(line: 268, column: 15, scope: !468)
!468 = distinct !DILexicalBlock(scope: !456, file: !279, line: 268, column: 4)
!469 = !DILocation(line: 268, column: 13, scope: !468)
!470 = !DILocation(line: 268, column: 9, scope: !468)
!471 = !DILocation(line: 268, column: 24, scope: !472)
!472 = !DILexicalBlockFile(scope: !473, file: !279, discriminator: 1)
!473 = distinct !DILexicalBlock(scope: !468, file: !279, line: 268, column: 4)
!474 = !DILocation(line: 268, column: 28, scope: !472)
!475 = !DILocation(line: 268, column: 4, scope: !472)
!476 = !DILocalVariable(name: "nic", scope: !477, file: !279, line: 269, type: !312)
!477 = distinct !DILexicalBlock(scope: !473, file: !279, line: 268, column: 57)
!478 = !DILocation(line: 269, column: 19, scope: !477)
!479 = !DILocalVariable(name: "ip", scope: !477, file: !279, line: 270, type: !382)
!480 = !DILocation(line: 270, column: 23, scope: !477)
!481 = !DILocalVariable(name: "sll", scope: !477, file: !279, line: 271, type: !99)
!482 = !DILocation(line: 271, column: 27, scope: !477)
!483 = !DILocation(line: 271, column: 55, scope: !477)
!484 = !DILocation(line: 271, column: 60, scope: !477)
!485 = !DILocation(line: 271, column: 33, scope: !477)
!486 = !DILocation(line: 273, column: 38, scope: !487)
!487 = distinct !DILexicalBlock(scope: !477, file: !279, line: 273, column: 11)
!488 = !DILocation(line: 273, column: 43, scope: !487)
!489 = !DILocation(line: 273, column: 11, scope: !487)
!490 = !DILocation(line: 273, column: 56, scope: !487)
!491 = !DILocation(line: 273, column: 53, scope: !487)
!492 = !DILocation(line: 273, column: 65, scope: !487)
!493 = !DILocation(line: 274, column: 37, scope: !487)
!494 = !DILocation(line: 274, column: 42, scope: !487)
!495 = !DILocation(line: 274, column: 11, scope: !487)
!496 = !DILocation(line: 273, column: 11, scope: !497)
!497 = !DILexicalBlockFile(scope: !477, file: !279, discriminator: 1)
!498 = !DILocation(line: 275, column: 10, scope: !499)
!499 = distinct !DILexicalBlock(scope: !487, file: !279, line: 274, column: 53)
!500 = !DILocation(line: 278, column: 11, scope: !501)
!501 = distinct !DILexicalBlock(scope: !477, file: !279, line: 278, column: 11)
!502 = !DILocation(line: 278, column: 15, scope: !501)
!503 = !DILocation(line: 278, column: 22, scope: !501)
!504 = !DILocation(line: 278, column: 25, scope: !505)
!505 = !DILexicalBlockFile(scope: !501, file: !279, discriminator: 1)
!506 = !DILocation(line: 278, column: 30, scope: !505)
!507 = !DILocation(line: 278, column: 41, scope: !505)
!508 = !DILocation(line: 278, column: 11, scope: !505)
!509 = !DILocalVariable(name: "macAddress", scope: !510, file: !279, line: 279, type: !511)
!510 = distinct !DILexicalBlock(scope: !501, file: !279, line: 278, column: 55)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 144, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 18)
!514 = !DILocation(line: 279, column: 15, scope: !510)
!515 = !DILocation(line: 280, column: 22, scope: !510)
!516 = !DILocation(line: 282, column: 22, scope: !510)
!517 = !DILocation(line: 282, column: 27, scope: !510)
!518 = !DILocation(line: 282, column: 40, scope: !510)
!519 = !DILocation(line: 282, column: 45, scope: !510)
!520 = !DILocation(line: 282, column: 58, scope: !510)
!521 = !DILocation(line: 282, column: 63, scope: !510)
!522 = !DILocation(line: 283, column: 22, scope: !510)
!523 = !DILocation(line: 283, column: 27, scope: !510)
!524 = !DILocation(line: 283, column: 40, scope: !510)
!525 = !DILocation(line: 283, column: 45, scope: !510)
!526 = !DILocation(line: 283, column: 58, scope: !510)
!527 = !DILocation(line: 283, column: 63, scope: !510)
!528 = !DILocation(line: 280, column: 10, scope: !510)
!529 = !DILocation(line: 284, column: 37, scope: !510)
!530 = !DILocation(line: 284, column: 46, scope: !510)
!531 = !DILocation(line: 284, column: 16, scope: !510)
!532 = !DILocation(line: 284, column: 14, scope: !510)
!533 = !DILocation(line: 285, column: 14, scope: !534)
!534 = distinct !DILexicalBlock(scope: !510, file: !279, line: 285, column: 14)
!535 = !DILocation(line: 285, column: 18, scope: !534)
!536 = !DILocation(line: 285, column: 14, scope: !510)
!537 = !DILocation(line: 289, column: 13, scope: !538)
!538 = distinct !DILexicalBlock(scope: !534, file: !279, line: 285, column: 26)
!539 = !DILocation(line: 295, column: 20, scope: !540)
!540 = distinct !DILexicalBlock(scope: !510, file: !279, line: 295, column: 10)
!541 = !DILocation(line: 295, column: 18, scope: !540)
!542 = !DILocation(line: 295, column: 15, scope: !540)
!543 = !DILocation(line: 295, column: 29, scope: !544)
!544 = !DILexicalBlockFile(scope: !545, file: !279, discriminator: 1)
!545 = distinct !DILexicalBlock(scope: !540, file: !279, line: 295, column: 10)
!546 = !DILocation(line: 295, column: 32, scope: !544)
!547 = !DILocation(line: 295, column: 10, scope: !544)
!548 = !DILocalVariable(name: "sa", scope: !549, file: !279, line: 296, type: !115)
!549 = distinct !DILexicalBlock(scope: !545, file: !279, line: 295, column: 59)
!550 = !DILocation(line: 296, column: 30, scope: !549)
!551 = !DILocation(line: 296, column: 54, scope: !549)
!552 = !DILocation(line: 296, column: 58, scope: !549)
!553 = !DILocation(line: 297, column: 17, scope: !554)
!554 = distinct !DILexicalBlock(scope: !549, file: !279, line: 297, column: 17)
!555 = !DILocation(line: 297, column: 20, scope: !554)
!556 = !DILocation(line: 297, column: 27, scope: !554)
!557 = !DILocation(line: 298, column: 25, scope: !554)
!558 = !DILocation(line: 298, column: 29, scope: !554)
!559 = !DILocation(line: 298, column: 39, scope: !554)
!560 = !DILocation(line: 298, column: 44, scope: !554)
!561 = !DILocation(line: 298, column: 17, scope: !554)
!562 = !DILocation(line: 298, column: 63, scope: !554)
!563 = !DILocation(line: 297, column: 17, scope: !564)
!564 = !DILexicalBlockFile(scope: !549, file: !279, discriminator: 1)
!565 = !DILocalVariable(name: "family", scope: !566, file: !279, line: 299, type: !106)
!566 = distinct !DILexicalBlock(scope: !554, file: !279, line: 298, column: 69)
!567 = !DILocation(line: 299, column: 20, scope: !566)
!568 = !DILocation(line: 299, column: 29, scope: !566)
!569 = !DILocation(line: 299, column: 33, scope: !566)
!570 = !DILocalVariable(name: "goodAddress", scope: !566, file: !279, line: 300, type: !282)
!571 = !DILocation(line: 300, column: 21, scope: !566)
!572 = !DILocalVariable(name: "nBits", scope: !566, file: !279, line: 301, type: !138)
!573 = !DILocation(line: 301, column: 25, scope: !566)
!574 = !DILocation(line: 305, column: 20, scope: !575)
!575 = distinct !DILexicalBlock(scope: !566, file: !279, line: 305, column: 20)
!576 = !DILocation(line: 305, column: 27, scope: !575)
!577 = !DILocation(line: 305, column: 20, scope: !566)
!578 = !DILocalVariable(name: "sin", scope: !579, file: !279, line: 306, type: !123)
!579 = distinct !DILexicalBlock(scope: !575, file: !279, line: 305, column: 38)
!580 = !DILocation(line: 306, column: 39, scope: !579)
!581 = !DILocation(line: 306, column: 67, scope: !579)
!582 = !DILocation(line: 306, column: 45, scope: !579)
!583 = !DILocation(line: 307, column: 30, scope: !584)
!584 = distinct !DILexicalBlock(scope: !579, file: !279, line: 307, column: 23)
!585 = !DILocation(line: 307, column: 35, scope: !584)
!586 = !DILocation(line: 307, column: 44, scope: !584)
!587 = !DILocation(line: 307, column: 24, scope: !584)
!588 = !DILocation(line: 307, column: 52, scope: !584)
!589 = !DILocation(line: 307, column: 72, scope: !584)
!590 = !DILocation(line: 307, column: 23, scope: !579)
!591 = !DILocation(line: 309, column: 49, scope: !592)
!592 = distinct !DILexicalBlock(scope: !584, file: !279, line: 308, column: 38)
!593 = !DILocation(line: 309, column: 53, scope: !592)
!594 = !DILocation(line: 309, column: 30, scope: !592)
!595 = !DILocation(line: 309, column: 28, scope: !592)
!596 = !DILocation(line: 310, column: 34, scope: !592)
!597 = !DILocation(line: 311, column: 19, scope: !592)
!598 = !DILocation(line: 312, column: 16, scope: !579)
!599 = !DILocation(line: 312, column: 27, scope: !600)
!600 = !DILexicalBlockFile(scope: !601, file: !279, discriminator: 1)
!601 = distinct !DILexicalBlock(scope: !575, file: !279, line: 312, column: 27)
!602 = !DILocation(line: 312, column: 34, scope: !600)
!603 = !DILocalVariable(name: "sin6", scope: !604, file: !279, line: 313, type: !140)
!604 = distinct !DILexicalBlock(scope: !601, file: !279, line: 312, column: 46)
!605 = !DILocation(line: 313, column: 40, scope: !604)
!606 = !DILocation(line: 313, column: 70, scope: !604)
!607 = !DILocation(line: 313, column: 47, scope: !604)
!608 = !DILocalVariable(name: "__a", scope: !609, file: !279, line: 314, type: !164)
!609 = distinct !DILexicalBlock(scope: !610, file: !279, line: 314, column: 39)
!610 = distinct !DILexicalBlock(scope: !604, file: !279, line: 314, column: 23)
!611 = !DILocation(line: 314, column: 64, scope: !609)
!612 = !DILocation(line: 314, column: 24, scope: !609)
!613 = !DILocation(line: 314, column: 30, scope: !609)
!614 = !DILocation(line: 314, column: 26, scope: !609)
!615 = !DILocation(line: 314, column: 31, scope: !609)
!616 = !DILocation(line: 314, column: 39, scope: !609)
!617 = !DILocation(line: 314, column: 54, scope: !609)
!618 = !DILocation(line: 314, column: 59, scope: !609)
!619 = !DILocation(line: 314, column: 62, scope: !620)
!620 = !DILexicalBlockFile(scope: !609, file: !279, discriminator: 1)
!621 = !DILocation(line: 314, column: 67, scope: !620)
!622 = !DILocation(line: 314, column: 75, scope: !620)
!623 = !DILocation(line: 314, column: 90, scope: !620)
!624 = !DILocation(line: 314, column: 95, scope: !620)
!625 = !DILocation(line: 314, column: 98, scope: !626)
!626 = !DILexicalBlockFile(scope: !609, file: !279, discriminator: 2)
!627 = !DILocation(line: 314, column: 103, scope: !626)
!628 = !DILocation(line: 314, column: 111, scope: !626)
!629 = !DILocation(line: 314, column: 126, scope: !626)
!630 = !DILocation(line: 314, column: 131, scope: !626)
!631 = !DILocation(line: 314, column: 134, scope: !632)
!632 = !DILexicalBlockFile(scope: !609, file: !279, discriminator: 3)
!633 = !DILocation(line: 314, column: 139, scope: !632)
!634 = !DILocation(line: 314, column: 147, scope: !632)
!635 = !DILocation(line: 314, column: 165, scope: !632)
!636 = !DILocation(line: 314, column: 162, scope: !632)
!637 = !DILocation(line: 314, column: 131, scope: !638)
!638 = !DILexicalBlockFile(scope: !609, file: !279, discriminator: 4)
!639 = !DILocation(line: 314, column: 41, scope: !638)
!640 = !DILocation(line: 314, column: 176, scope: !638)
!641 = !DILocation(line: 314, column: 38, scope: !638)
!642 = !DILocation(line: 314, column: 23, scope: !638)
!643 = !DILocation(line: 315, column: 49, scope: !644)
!644 = distinct !DILexicalBlock(scope: !610, file: !279, line: 314, column: 63)
!645 = !DILocation(line: 315, column: 53, scope: !644)
!646 = !DILocation(line: 315, column: 30, scope: !644)
!647 = !DILocation(line: 315, column: 28, scope: !644)
!648 = !DILocation(line: 316, column: 34, scope: !644)
!649 = !DILocation(line: 317, column: 19, scope: !644)
!650 = !DILocation(line: 318, column: 16, scope: !604)
!651 = !DILocation(line: 319, column: 20, scope: !652)
!652 = distinct !DILexicalBlock(scope: !566, file: !279, line: 319, column: 20)
!653 = !DILocation(line: 319, column: 20, scope: !566)
!654 = !DILocalVariable(name: "ent", scope: !655, file: !279, line: 320, type: !322)
!655 = distinct !DILexicalBlock(scope: !652, file: !279, line: 319, column: 33)
!656 = !DILocation(line: 320, column: 35, scope: !655)
!657 = !DILocation(line: 320, column: 63, scope: !655)
!658 = !DILocation(line: 321, column: 63, scope: !655)
!659 = !DILocation(line: 321, column: 67, scope: !655)
!660 = !DILocation(line: 322, column: 63, scope: !655)
!661 = !DILocation(line: 320, column: 41, scope: !655)
!662 = !DILocation(line: 324, column: 30, scope: !663)
!663 = distinct !DILexicalBlock(scope: !655, file: !279, line: 324, column: 22)
!664 = !DILocation(line: 324, column: 27, scope: !663)
!665 = !DILocation(line: 324, column: 22, scope: !655)
!666 = !DILocation(line: 328, column: 22, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !279, line: 324, column: 35)
!668 = !DILocation(line: 330, column: 16, scope: !655)
!669 = !DILocation(line: 331, column: 13, scope: !566)
!670 = !DILocation(line: 332, column: 10, scope: !549)
!671 = !DILocation(line: 295, column: 45, scope: !672)
!672 = !DILexicalBlockFile(scope: !545, file: !279, discriminator: 2)
!673 = !DILocation(line: 295, column: 49, scope: !672)
!674 = !DILocation(line: 295, column: 43, scope: !672)
!675 = !DILocation(line: 295, column: 10, scope: !672)
!676 = distinct !{!676, !677}
!677 = !DILocation(line: 295, column: 10, scope: !510)
!678 = !DILocation(line: 333, column: 7, scope: !510)
!679 = !DILocation(line: 334, column: 4, scope: !477)
!680 = !DILocation(line: 268, column: 42, scope: !681)
!681 = !DILexicalBlockFile(scope: !473, file: !279, discriminator: 2)
!682 = !DILocation(line: 268, column: 47, scope: !681)
!683 = !DILocation(line: 268, column: 40, scope: !681)
!684 = !DILocation(line: 268, column: 4, scope: !681)
!685 = distinct !{!685, !686}
!686 = !DILocation(line: 268, column: 4, scope: !456)
!687 = !DILocation(line: 335, column: 1, scope: !456)
!688 = distinct !DISubprogram(name: "RecordResolverInfo", scope: !279, file: !279, line: 764, type: !689, isLocal: true, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!689 = !DISubroutineType(types: !690)
!690 = !{!282, !303}
!691 = !DILocalVariable(name: "nicInfo", arg: 1, scope: !688, file: !279, line: 764, type: !303)
!692 = !DILocation(line: 764, column: 31, scope: !688)
!693 = !DILocalVariable(name: "dnsConfigInfo", scope: !688, file: !279, line: 766, type: !335)
!694 = !DILocation(line: 766, column: 19, scope: !688)
!695 = !DILocalVariable(name: "namebuf", scope: !688, file: !279, line: 767, type: !696)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 2048, align: 8, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 256)
!699 = !DILocation(line: 767, column: 9, scope: !688)
!700 = !DILocalVariable(name: "s", scope: !688, file: !279, line: 768, type: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!702 = !DILocation(line: 768, column: 11, scope: !688)
!703 = !DILocation(line: 770, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !688, file: !279, line: 770, column: 7)
!705 = !DILocation(line: 770, column: 18, scope: !704)
!706 = !DILocation(line: 770, column: 7, scope: !688)
!707 = !DILocation(line: 771, column: 7, scope: !708)
!708 = distinct !DILexicalBlock(scope: !704, file: !279, line: 770, column: 25)
!709 = !DILocation(line: 774, column: 20, scope: !688)
!710 = !DILocation(line: 774, column: 18, scope: !688)
!711 = !DILocation(line: 779, column: 42, scope: !712)
!712 = distinct !DILexicalBlock(scope: !688, file: !279, line: 779, column: 8)
!713 = !DILocation(line: 779, column: 9, scope: !712)
!714 = !DILocation(line: 779, column: 8, scope: !688)
!715 = !DILocation(line: 780, column: 1, scope: !716)
!716 = distinct !DILexicalBlock(scope: !712, file: !279, line: 779, column: 52)
!717 = !DILocation(line: 781, column: 7, scope: !716)
!718 = !DILocation(line: 784, column: 7, scope: !688)
!719 = !DILocation(line: 783, column: 4, scope: !688)
!720 = !DILocation(line: 783, column: 19, scope: !688)
!721 = !DILocation(line: 783, column: 28, scope: !688)
!722 = !DILocation(line: 785, column: 47, scope: !688)
!723 = !DILocation(line: 785, column: 31, scope: !688)
!724 = !DILocation(line: 785, column: 5, scope: !688)
!725 = !DILocation(line: 785, column: 20, scope: !688)
!726 = !DILocation(line: 785, column: 29, scope: !688)
!727 = !DILocation(line: 791, column: 7, scope: !688)
!728 = !DILocation(line: 790, column: 4, scope: !688)
!729 = !DILocation(line: 790, column: 19, scope: !688)
!730 = !DILocation(line: 790, column: 30, scope: !688)
!731 = !DILocation(line: 791, column: 34, scope: !732)
!732 = !DILexicalBlockFile(scope: !688, file: !279, discriminator: 1)
!733 = !DILocation(line: 791, column: 33, scope: !688)
!734 = !DILocation(line: 792, column: 49, scope: !688)
!735 = !DILocation(line: 792, column: 33, scope: !688)
!736 = !DILocation(line: 792, column: 5, scope: !688)
!737 = !DILocation(line: 792, column: 20, scope: !688)
!738 = !DILocation(line: 792, column: 31, scope: !688)
!739 = !DILocation(line: 796, column: 21, scope: !688)
!740 = !DILocation(line: 796, column: 4, scope: !688)
!741 = !DILocation(line: 801, column: 14, scope: !742)
!742 = distinct !DILexicalBlock(scope: !688, file: !279, line: 801, column: 4)
!743 = !DILocation(line: 801, column: 17, scope: !742)
!744 = !DILocation(line: 801, column: 12, scope: !742)
!745 = !DILocation(line: 801, column: 11, scope: !742)
!746 = !DILocation(line: 801, column: 9, scope: !742)
!747 = !DILocation(line: 801, column: 26, scope: !748)
!748 = !DILexicalBlockFile(scope: !749, file: !279, discriminator: 1)
!749 = distinct !DILexicalBlock(scope: !742, file: !279, line: 801, column: 4)
!750 = !DILocation(line: 801, column: 25, scope: !748)
!751 = !DILocation(line: 801, column: 4, scope: !748)
!752 = !DILocalVariable(name: "suffix", scope: !753, file: !279, line: 802, type: !168)
!753 = distinct !DILexicalBlock(scope: !749, file: !279, line: 801, column: 34)
!754 = !DILocation(line: 802, column: 20, scope: !753)
!755 = !DILocation(line: 805, column: 11, scope: !756)
!756 = distinct !DILexicalBlock(scope: !753, file: !279, line: 805, column: 11)
!757 = !DILocation(line: 805, column: 26, scope: !756)
!758 = !DILocation(line: 805, column: 41, scope: !756)
!759 = !DILocation(line: 805, column: 60, scope: !756)
!760 = !DILocation(line: 805, column: 11, scope: !753)
!761 = !DILocation(line: 806, column: 10, scope: !762)
!762 = distinct !DILexicalBlock(scope: !756, file: !279, line: 805, column: 67)
!763 = !DILocation(line: 808, column: 10, scope: !762)
!764 = !DILocation(line: 811, column: 110, scope: !753)
!765 = !DILocation(line: 811, column: 126, scope: !753)
!766 = !DILocation(line: 811, column: 141, scope: !753)
!767 = !DILocation(line: 811, column: 98, scope: !753)
!768 = !DILocation(line: 811, column: 163, scope: !753)
!769 = !DILocation(line: 811, column: 179, scope: !753)
!770 = !DILocation(line: 811, column: 194, scope: !753)
!771 = !DILocation(line: 811, column: 78, scope: !753)
!772 = !DILocation(line: 811, column: 16, scope: !753)
!773 = !DILocation(line: 811, column: 14, scope: !753)
!774 = !DILocation(line: 812, column: 33, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !279, line: 812, column: 13)
!776 = distinct !DILexicalBlock(scope: !753, file: !279, line: 812, column: 8)
!777 = !DILocation(line: 812, column: 31, scope: !775)
!778 = !DILocation(line: 812, column: 30, scope: !775)
!779 = !DILocation(line: 812, column: 13, scope: !775)
!780 = !DILocation(line: 812, column: 13, scope: !776)
!781 = !DILocation(line: 812, column: 49, scope: !782)
!782 = !DILexicalBlockFile(scope: !783, file: !279, discriminator: 1)
!783 = distinct !DILexicalBlock(scope: !775, file: !279, line: 812, column: 47)
!784 = !DILocation(line: 813, column: 35, scope: !753)
!785 = !DILocation(line: 813, column: 34, scope: !753)
!786 = !DILocation(line: 813, column: 17, scope: !753)
!787 = !DILocation(line: 813, column: 8, scope: !753)
!788 = !DILocation(line: 813, column: 15, scope: !753)
!789 = !DILocation(line: 814, column: 4, scope: !753)
!790 = !DILocation(line: 801, column: 30, scope: !791)
!791 = !DILexicalBlockFile(scope: !749, file: !279, discriminator: 2)
!792 = !DILocation(line: 801, column: 4, scope: !791)
!793 = distinct !{!793, !794}
!794 = !DILocation(line: 801, column: 4, scope: !688)
!795 = !DILocation(line: 819, column: 29, scope: !688)
!796 = !DILocation(line: 819, column: 4, scope: !688)
!797 = !DILocation(line: 819, column: 13, scope: !688)
!798 = !DILocation(line: 819, column: 27, scope: !688)
!799 = !DILocation(line: 821, column: 4, scope: !688)
!800 = !DILocation(line: 824, column: 54, scope: !688)
!801 = !DILocation(line: 824, column: 45, scope: !688)
!802 = !DILocation(line: 824, column: 4, scope: !688)
!803 = !DILocation(line: 825, column: 9, scope: !688)
!804 = !DILocation(line: 825, column: 4, scope: !688)
!805 = !DILocation(line: 826, column: 4, scope: !688)
!806 = !DILocation(line: 827, column: 1, scope: !688)
!807 = distinct !DISubprogram(name: "RecordRoutingInfo", scope: !279, file: !279, line: 1140, type: !301, isLocal: true, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!808 = !DILocalVariable(name: "maxIPv4Routes", arg: 1, scope: !807, file: !279, line: 1140, type: !138)
!809 = !DILocation(line: 1140, column: 32, scope: !807)
!810 = !DILocalVariable(name: "maxIPv6Routes", arg: 2, scope: !807, file: !279, line: 1141, type: !138)
!811 = !DILocation(line: 1141, column: 32, scope: !807)
!812 = !DILocalVariable(name: "nicInfo", arg: 3, scope: !807, file: !279, line: 1142, type: !303)
!813 = !DILocation(line: 1142, column: 30, scope: !807)
!814 = !DILocalVariable(name: "retIPv4", scope: !807, file: !279, line: 1144, type: !282)
!815 = !DILocation(line: 1144, column: 9, scope: !807)
!816 = !DILocalVariable(name: "retIPv6", scope: !807, file: !279, line: 1145, type: !282)
!817 = !DILocation(line: 1145, column: 9, scope: !807)
!818 = !DILocation(line: 1156, column: 8, scope: !819)
!819 = distinct !DILexicalBlock(scope: !807, file: !279, line: 1156, column: 8)
!820 = !DILocation(line: 1156, column: 22, scope: !819)
!821 = !DILocation(line: 1156, column: 8, scope: !807)
!822 = !DILocation(line: 1157, column: 33, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !279, line: 1157, column: 11)
!824 = distinct !DILexicalBlock(scope: !819, file: !279, line: 1156, column: 27)
!825 = !DILocation(line: 1157, column: 48, scope: !823)
!826 = !DILocation(line: 1157, column: 11, scope: !823)
!827 = !DILocation(line: 1157, column: 11, scope: !824)
!828 = !DILocation(line: 1158, column: 18, scope: !829)
!829 = distinct !DILexicalBlock(scope: !823, file: !279, line: 1157, column: 58)
!830 = !DILocation(line: 1159, column: 7, scope: !829)
!831 = !DILocation(line: 1160, column: 10, scope: !832)
!832 = distinct !DILexicalBlock(scope: !823, file: !279, line: 1159, column: 14)
!833 = !DILocation(line: 1162, column: 4, scope: !824)
!834 = !DILocation(line: 1164, column: 8, scope: !835)
!835 = distinct !DILexicalBlock(scope: !807, file: !279, line: 1164, column: 8)
!836 = !DILocation(line: 1164, column: 22, scope: !835)
!837 = !DILocation(line: 1164, column: 26, scope: !835)
!838 = !DILocation(line: 1164, column: 29, scope: !839)
!839 = !DILexicalBlockFile(scope: !835, file: !279, discriminator: 1)
!840 = !DILocation(line: 1164, column: 38, scope: !839)
!841 = !DILocation(line: 1164, column: 45, scope: !839)
!842 = !DILocation(line: 1164, column: 56, scope: !839)
!843 = !DILocation(line: 1164, column: 8, scope: !839)
!844 = !DILocation(line: 1165, column: 33, scope: !845)
!845 = distinct !DILexicalBlock(scope: !846, file: !279, line: 1165, column: 11)
!846 = distinct !DILexicalBlock(scope: !835, file: !279, line: 1164, column: 63)
!847 = !DILocation(line: 1165, column: 48, scope: !845)
!848 = !DILocation(line: 1165, column: 11, scope: !845)
!849 = !DILocation(line: 1165, column: 11, scope: !846)
!850 = !DILocation(line: 1166, column: 18, scope: !851)
!851 = distinct !DILexicalBlock(scope: !845, file: !279, line: 1165, column: 58)
!852 = !DILocation(line: 1167, column: 7, scope: !851)
!853 = !DILocation(line: 1168, column: 10, scope: !854)
!854 = distinct !DILexicalBlock(scope: !845, file: !279, line: 1167, column: 14)
!855 = !DILocation(line: 1170, column: 4, scope: !846)
!856 = !DILocation(line: 1172, column: 12, scope: !807)
!857 = !DILocation(line: 1172, column: 20, scope: !807)
!858 = !DILocation(line: 1172, column: 23, scope: !859)
!859 = !DILexicalBlockFile(scope: !807, file: !279, discriminator: 1)
!860 = !DILocation(line: 1172, column: 20, scope: !859)
!861 = !DILocation(line: 1172, column: 20, scope: !862)
!862 = !DILexicalBlockFile(scope: !807, file: !279, discriminator: 2)
!863 = !DILocation(line: 1172, column: 11, scope: !862)
!864 = !DILocation(line: 1172, column: 4, scope: !862)
!865 = distinct !DISubprogram(name: "GuestInfoGetPrimaryIP", scope: !279, file: !279, line: 447, type: !866, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!866 = !DISubroutineType(types: !867)
!867 = !{!170}
!868 = !DILocalVariable(name: "ifaces", scope: !865, file: !279, line: 449, type: !382)
!869 = !DILocation(line: 449, column: 20, scope: !865)
!870 = !DILocalVariable(name: "curr", scope: !865, file: !279, line: 450, type: !382)
!871 = !DILocation(line: 450, column: 20, scope: !865)
!872 = !DILocalVariable(name: "ipstr", scope: !865, file: !279, line: 451, type: !170)
!873 = !DILocation(line: 451, column: 10, scope: !865)
!874 = !DILocalVariable(name: "currIpstr", scope: !865, file: !279, line: 452, type: !170)
!875 = !DILocation(line: 452, column: 10, scope: !865)
!876 = !DILocalVariable(name: "currPri", scope: !865, file: !279, line: 453, type: !408)
!877 = !DILocation(line: 453, column: 20, scope: !865)
!878 = !DILocation(line: 459, column: 8, scope: !879)
!879 = distinct !DILexicalBlock(scope: !865, file: !279, line: 459, column: 8)
!880 = !DILocation(line: 459, column: 28, scope: !879)
!881 = !DILocation(line: 459, column: 8, scope: !865)
!882 = !DILocation(line: 460, column: 14, scope: !883)
!883 = distinct !DILexicalBlock(scope: !879, file: !279, line: 459, column: 33)
!884 = !DILocation(line: 460, column: 7, scope: !883)
!885 = !DILocation(line: 468, column: 16, scope: !886)
!886 = distinct !DILexicalBlock(scope: !865, file: !279, line: 468, column: 4)
!887 = !DILocation(line: 468, column: 14, scope: !886)
!888 = !DILocation(line: 468, column: 9, scope: !886)
!889 = !DILocation(line: 468, column: 24, scope: !890)
!890 = !DILexicalBlockFile(scope: !891, file: !279, discriminator: 1)
!891 = distinct !DILexicalBlock(scope: !886, file: !279, line: 468, column: 4)
!892 = !DILocation(line: 468, column: 29, scope: !890)
!893 = !DILocation(line: 468, column: 4, scope: !890)
!894 = !DILocalVariable(name: "currFamily", scope: !895, file: !279, line: 469, type: !106)
!895 = distinct !DILexicalBlock(scope: !891, file: !279, line: 468, column: 60)
!896 = !DILocation(line: 469, column: 11, scope: !895)
!897 = !DILocation(line: 469, column: 52, scope: !895)
!898 = !DILocation(line: 469, column: 58, scope: !895)
!899 = !DILocation(line: 469, column: 69, scope: !895)
!900 = !DILocation(line: 469, column: 24, scope: !895)
!901 = !DILocation(line: 471, column: 13, scope: !902)
!902 = distinct !DILexicalBlock(scope: !895, file: !279, line: 471, column: 11)
!903 = !DILocation(line: 471, column: 19, scope: !902)
!904 = !DILocation(line: 471, column: 29, scope: !902)
!905 = !DILocation(line: 471, column: 38, scope: !902)
!906 = !DILocation(line: 471, column: 41, scope: !907)
!907 = !DILexicalBlockFile(scope: !902, file: !279, discriminator: 1)
!908 = !DILocation(line: 471, column: 47, scope: !907)
!909 = !DILocation(line: 471, column: 57, scope: !907)
!910 = !DILocation(line: 471, column: 11, scope: !907)
!911 = !DILocation(line: 472, column: 10, scope: !912)
!912 = distinct !DILexicalBlock(scope: !902, file: !279, line: 471, column: 73)
!913 = !DILocation(line: 473, column: 44, scope: !914)
!914 = distinct !DILexicalBlock(scope: !902, file: !279, line: 473, column: 18)
!915 = !DILocation(line: 473, column: 50, scope: !914)
!916 = !DILocation(line: 473, column: 18, scope: !914)
!917 = !DILocation(line: 473, column: 18, scope: !902)
!918 = !DILocation(line: 474, column: 10, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !279, line: 473, column: 61)
!920 = !DILocation(line: 475, column: 18, scope: !921)
!921 = distinct !DILexicalBlock(scope: !914, file: !279, line: 475, column: 18)
!922 = !DILocation(line: 475, column: 29, scope: !921)
!923 = !DILocation(line: 475, column: 39, scope: !921)
!924 = !DILocation(line: 475, column: 42, scope: !925)
!925 = !DILexicalBlockFile(scope: !921, file: !279, discriminator: 1)
!926 = !DILocation(line: 475, column: 53, scope: !925)
!927 = !DILocation(line: 475, column: 18, scope: !925)
!928 = !DILocation(line: 476, column: 41, scope: !929)
!929 = distinct !DILexicalBlock(scope: !921, file: !279, line: 475, column: 66)
!930 = !DILocation(line: 476, column: 47, scope: !929)
!931 = !DILocation(line: 476, column: 18, scope: !929)
!932 = !DILocation(line: 476, column: 16, scope: !929)
!933 = !DILocation(line: 477, column: 7, scope: !929)
!934 = !DILocation(line: 478, column: 10, scope: !935)
!935 = distinct !DILexicalBlock(scope: !921, file: !279, line: 477, column: 14)
!936 = !DILocation(line: 481, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !895, file: !279, line: 481, column: 11)
!938 = !DILocation(line: 481, column: 17, scope: !937)
!939 = !DILocation(line: 481, column: 11, scope: !895)
!940 = !DILocalVariable(name: "pri", scope: !941, file: !279, line: 482, type: !408)
!941 = distinct !DILexicalBlock(scope: !937, file: !279, line: 481, column: 25)
!942 = !DILocation(line: 482, column: 26, scope: !941)
!943 = !DILocation(line: 482, column: 59, scope: !941)
!944 = !DILocation(line: 482, column: 65, scope: !941)
!945 = !DILocation(line: 482, column: 32, scope: !941)
!946 = !DILocation(line: 483, column: 14, scope: !947)
!947 = distinct !DILexicalBlock(scope: !941, file: !279, line: 483, column: 14)
!948 = !DILocation(line: 483, column: 20, scope: !947)
!949 = !DILocation(line: 483, column: 18, scope: !947)
!950 = !DILocation(line: 483, column: 14, scope: !941)
!951 = !DILocation(line: 484, column: 116, scope: !952)
!952 = distinct !DILexicalBlock(scope: !947, file: !279, line: 483, column: 29)
!953 = !DILocation(line: 484, column: 122, scope: !952)
!954 = !DILocation(line: 484, column: 132, scope: !952)
!955 = !DILocation(line: 484, column: 137, scope: !952)
!956 = !DILocation(line: 484, column: 146, scope: !952)
!957 = !DILocation(line: 484, column: 13, scope: !952)
!958 = !DILocation(line: 486, column: 20, scope: !952)
!959 = !DILocation(line: 486, column: 13, scope: !952)
!960 = !DILocation(line: 487, column: 25, scope: !952)
!961 = !DILocation(line: 487, column: 23, scope: !952)
!962 = !DILocation(line: 488, column: 23, scope: !952)
!963 = !DILocation(line: 488, column: 21, scope: !952)
!964 = !DILocation(line: 489, column: 17, scope: !965)
!965 = distinct !DILexicalBlock(scope: !952, file: !279, line: 489, column: 17)
!966 = !DILocation(line: 489, column: 21, scope: !965)
!967 = !DILocation(line: 489, column: 17, scope: !952)
!968 = !DILocation(line: 491, column: 16, scope: !969)
!969 = distinct !DILexicalBlock(scope: !965, file: !279, line: 489, column: 50)
!970 = !DILocation(line: 493, column: 10, scope: !952)
!971 = !DILocation(line: 494, column: 7, scope: !941)
!972 = !DILocation(line: 495, column: 4, scope: !895)
!973 = !DILocation(line: 468, column: 44, scope: !974)
!974 = !DILexicalBlockFile(scope: !891, file: !279, discriminator: 2)
!975 = !DILocation(line: 468, column: 50, scope: !974)
!976 = !DILocation(line: 468, column: 42, scope: !974)
!977 = !DILocation(line: 468, column: 4, scope: !974)
!978 = distinct !{!978, !979}
!979 = !DILocation(line: 468, column: 4, scope: !865)
!980 = !DILocation(line: 497, column: 16, scope: !865)
!981 = !DILocation(line: 497, column: 4, scope: !865)
!982 = !DILocation(line: 499, column: 11, scope: !865)
!983 = !DILocation(line: 499, column: 4, scope: !865)
!984 = !DILocation(line: 500, column: 1, scope: !865)
!985 = distinct !DISubprogram(name: "ValidateConvertAddress", scope: !279, file: !279, line: 1256, type: !986, isLocal: true, isDefinition: true, scopeLine: 1257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!986 = !DISubroutineType(types: !987)
!987 = !{!170, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!990 = !DILocalVariable(name: "addr", arg: 1, scope: !985, file: !279, line: 1256, type: !988)
!991 = !DILocation(line: 1256, column: 47, scope: !985)
!992 = !DILocalVariable(name: "ipstr", scope: !985, file: !279, line: 1258, type: !993)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 368, align: 8, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 46)
!996 = !DILocation(line: 1258, column: 9, scope: !985)
!997 = !DILocation(line: 1260, column: 8, scope: !998)
!998 = distinct !DILexicalBlock(scope: !985, file: !279, line: 1260, column: 8)
!999 = !DILocation(line: 1260, column: 14, scope: !998)
!1000 = !DILocation(line: 1260, column: 24, scope: !998)
!1001 = !DILocation(line: 1260, column: 8, scope: !985)
!1002 = !DILocalVariable(name: "addr4", scope: !1003, file: !279, line: 1261, type: !123)
!1003 = distinct !DILexicalBlock(scope: !998, file: !279, line: 1260, column: 35)
!1004 = !DILocation(line: 1261, column: 27, scope: !1003)
!1005 = !DILocation(line: 1261, column: 57, scope: !1003)
!1006 = !DILocation(line: 1261, column: 35, scope: !1003)
!1007 = !DILocation(line: 1263, column: 11, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1003, file: !279, line: 1263, column: 11)
!1009 = !DILocation(line: 1263, column: 18, scope: !1008)
!1010 = !DILocation(line: 1263, column: 27, scope: !1008)
!1011 = !DILocation(line: 1263, column: 37, scope: !1008)
!1012 = !DILocation(line: 1263, column: 34, scope: !1008)
!1013 = !DILocation(line: 1263, column: 59, scope: !1008)
!1014 = !DILocation(line: 1264, column: 11, scope: !1008)
!1015 = !DILocation(line: 1264, column: 18, scope: !1008)
!1016 = !DILocation(line: 1264, column: 27, scope: !1008)
!1017 = !DILocation(line: 1264, column: 37, scope: !1008)
!1018 = !DILocation(line: 1264, column: 34, scope: !1008)
!1019 = !DILocation(line: 1264, column: 54, scope: !1008)
!1020 = !DILocation(line: 1265, column: 22, scope: !1008)
!1021 = !DILocation(line: 1265, column: 28, scope: !1008)
!1022 = !DILocation(line: 1265, column: 40, scope: !1008)
!1023 = !DILocation(line: 1265, column: 47, scope: !1008)
!1024 = !DILocation(line: 1265, column: 39, scope: !1008)
!1025 = !DILocation(line: 1265, column: 57, scope: !1008)
!1026 = !DILocation(line: 1265, column: 12, scope: !1008)
!1027 = !DILocation(line: 1263, column: 11, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !1003, file: !279, discriminator: 1)
!1029 = !DILocation(line: 1266, column: 10, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1008, file: !279, line: 1265, column: 79)
!1031 = !DILocation(line: 1268, column: 4, scope: !1003)
!1032 = !DILocation(line: 1268, column: 15, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1034, file: !279, discriminator: 1)
!1034 = distinct !DILexicalBlock(scope: !998, file: !279, line: 1268, column: 15)
!1035 = !DILocation(line: 1268, column: 21, scope: !1033)
!1036 = !DILocation(line: 1268, column: 31, scope: !1033)
!1037 = !DILocalVariable(name: "addr6", scope: !1038, file: !279, line: 1269, type: !140)
!1038 = distinct !DILexicalBlock(scope: !1034, file: !279, line: 1268, column: 43)
!1039 = !DILocation(line: 1269, column: 28, scope: !1038)
!1040 = !DILocation(line: 1269, column: 59, scope: !1038)
!1041 = !DILocation(line: 1269, column: 36, scope: !1038)
!1042 = !DILocalVariable(name: "__a", scope: !1043, file: !279, line: 1271, type: !164)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !279, line: 1271, column: 26)
!1044 = distinct !DILexicalBlock(scope: !1038, file: !279, line: 1271, column: 10)
!1045 = !DILocation(line: 1271, column: 51, scope: !1043)
!1046 = !DILocation(line: 1271, column: 11, scope: !1043)
!1047 = !DILocation(line: 1271, column: 18, scope: !1043)
!1048 = !DILocation(line: 1271, column: 13, scope: !1043)
!1049 = !DILocation(line: 1271, column: 26, scope: !1043)
!1050 = !DILocation(line: 1271, column: 41, scope: !1043)
!1051 = !DILocation(line: 1271, column: 46, scope: !1043)
!1052 = !DILocation(line: 1271, column: 49, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1043, file: !279, discriminator: 1)
!1054 = !DILocation(line: 1271, column: 54, scope: !1053)
!1055 = !DILocation(line: 1271, column: 62, scope: !1053)
!1056 = !DILocation(line: 1271, column: 77, scope: !1053)
!1057 = !DILocation(line: 1271, column: 82, scope: !1053)
!1058 = !DILocation(line: 1271, column: 85, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1043, file: !279, discriminator: 2)
!1060 = !DILocation(line: 1271, column: 90, scope: !1059)
!1061 = !DILocation(line: 1271, column: 98, scope: !1059)
!1062 = !DILocation(line: 1271, column: 113, scope: !1059)
!1063 = !DILocation(line: 1271, column: 118, scope: !1059)
!1064 = !DILocation(line: 1271, column: 121, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1043, file: !279, discriminator: 3)
!1066 = !DILocation(line: 1271, column: 126, scope: !1065)
!1067 = !DILocation(line: 1271, column: 134, scope: !1065)
!1068 = !DILocation(line: 1271, column: 152, scope: !1065)
!1069 = !DILocation(line: 1271, column: 149, scope: !1065)
!1070 = !DILocation(line: 1271, column: 118, scope: !1071)
!1071 = !DILexicalBlockFile(scope: !1043, file: !279, discriminator: 4)
!1072 = !DILocation(line: 1271, column: 28, scope: !1071)
!1073 = !DILocation(line: 1271, column: 163, scope: !1071)
!1074 = !DILocation(line: 1271, column: 25, scope: !1071)
!1075 = !DILocation(line: 1271, column: 50, scope: !1071)
!1076 = !DILocalVariable(name: "__a", scope: !1077, file: !279, line: 1272, type: !164)
!1077 = distinct !DILexicalBlock(scope: !1044, file: !279, line: 1272, column: 26)
!1078 = !DILocation(line: 1272, column: 51, scope: !1077)
!1079 = !DILocation(line: 1272, column: 11, scope: !1077)
!1080 = !DILocation(line: 1272, column: 18, scope: !1077)
!1081 = !DILocation(line: 1272, column: 14, scope: !1077)
!1082 = !DILocation(line: 1272, column: 19, scope: !1077)
!1083 = !DILocation(line: 1272, column: 27, scope: !1077)
!1084 = !DILocation(line: 1272, column: 44, scope: !1077)
!1085 = !DILocation(line: 1272, column: 42, scope: !1077)
!1086 = !DILocation(line: 1272, column: 67, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1077, file: !279, discriminator: 1)
!1088 = !DILocation(line: 1272, column: 64, scope: !1077)
!1089 = !DILocation(line: 1272, column: 28, scope: !1077)
!1090 = !DILocation(line: 1272, column: 87, scope: !1077)
!1091 = !DILocation(line: 1272, column: 25, scope: !1044)
!1092 = !DILocation(line: 1272, column: 51, scope: !1044)
!1093 = !DILocalVariable(name: "__a", scope: !1094, file: !279, line: 1273, type: !164)
!1094 = distinct !DILexicalBlock(scope: !1044, file: !279, line: 1273, column: 26)
!1095 = !DILocation(line: 1273, column: 51, scope: !1094)
!1096 = !DILocation(line: 1273, column: 11, scope: !1094)
!1097 = !DILocation(line: 1273, column: 18, scope: !1094)
!1098 = !DILocation(line: 1273, column: 14, scope: !1094)
!1099 = !DILocation(line: 1273, column: 19, scope: !1094)
!1100 = !DILocation(line: 1273, column: 27, scope: !1094)
!1101 = !DILocation(line: 1273, column: 44, scope: !1094)
!1102 = !DILocation(line: 1273, column: 42, scope: !1094)
!1103 = !DILocation(line: 1273, column: 67, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1094, file: !279, discriminator: 1)
!1105 = !DILocation(line: 1273, column: 64, scope: !1094)
!1106 = !DILocation(line: 1273, column: 28, scope: !1094)
!1107 = !DILocation(line: 1273, column: 87, scope: !1094)
!1108 = !DILocation(line: 1273, column: 25, scope: !1044)
!1109 = !DILocation(line: 1273, column: 51, scope: !1044)
!1110 = !DILocation(line: 1274, column: 15, scope: !1044)
!1111 = !DILocation(line: 1274, column: 22, scope: !1044)
!1112 = !DILocation(line: 1274, column: 10, scope: !1044)
!1113 = !DILocation(line: 1274, column: 18, scope: !1044)
!1114 = !DILocation(line: 1274, column: 13, scope: !1044)
!1115 = !DILocation(line: 1274, column: 14, scope: !1044)
!1116 = !DILocation(line: 1274, column: 23, scope: !1044)
!1117 = !DILocation(line: 1274, column: 30, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1044, file: !279, discriminator: 1)
!1119 = !DILocation(line: 1274, column: 37, scope: !1118)
!1120 = !DILocation(line: 1274, column: 10, scope: !1118)
!1121 = !DILocation(line: 1274, column: 18, scope: !1118)
!1122 = !DILocation(line: 1274, column: 28, scope: !1118)
!1123 = !DILocation(line: 1274, column: 14, scope: !1118)
!1124 = !DILocation(line: 1274, column: 22, scope: !1118)
!1125 = !DILocation(line: 1274, column: 32, scope: !1118)
!1126 = !DILocalVariable(name: "__a", scope: !1127, file: !279, line: 1275, type: !164)
!1127 = distinct !DILexicalBlock(scope: !1044, file: !279, line: 1275, column: 26)
!1128 = !DILocation(line: 1275, column: 51, scope: !1127)
!1129 = !DILocation(line: 1275, column: 11, scope: !1127)
!1130 = !DILocation(line: 1275, column: 18, scope: !1127)
!1131 = !DILocation(line: 1275, column: 13, scope: !1127)
!1132 = !DILocation(line: 1275, column: 26, scope: !1127)
!1133 = !DILocation(line: 1275, column: 41, scope: !1127)
!1134 = !DILocation(line: 1275, column: 46, scope: !1127)
!1135 = !DILocation(line: 1275, column: 49, scope: !1136)
!1136 = !DILexicalBlockFile(scope: !1127, file: !279, discriminator: 1)
!1137 = !DILocation(line: 1275, column: 54, scope: !1136)
!1138 = !DILocation(line: 1275, column: 62, scope: !1136)
!1139 = !DILocation(line: 1275, column: 77, scope: !1136)
!1140 = !DILocation(line: 1275, column: 82, scope: !1136)
!1141 = !DILocation(line: 1275, column: 85, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1127, file: !279, discriminator: 2)
!1143 = !DILocation(line: 1275, column: 90, scope: !1142)
!1144 = !DILocation(line: 1275, column: 98, scope: !1142)
!1145 = !DILocation(line: 1275, column: 113, scope: !1142)
!1146 = !DILocation(line: 1275, column: 118, scope: !1142)
!1147 = !DILocation(line: 1275, column: 121, scope: !1148)
!1148 = !DILexicalBlockFile(scope: !1127, file: !279, discriminator: 3)
!1149 = !DILocation(line: 1275, column: 126, scope: !1148)
!1150 = !DILocation(line: 1275, column: 134, scope: !1148)
!1151 = !DILocation(line: 1275, column: 149, scope: !1148)
!1152 = !DILocation(line: 1275, column: 118, scope: !1153)
!1153 = !DILexicalBlockFile(scope: !1127, file: !279, discriminator: 4)
!1154 = !DILocation(line: 1275, column: 28, scope: !1153)
!1155 = !DILocation(line: 1275, column: 155, scope: !1153)
!1156 = !DILocation(line: 1275, column: 25, scope: !1153)
!1157 = !DILocation(line: 1275, column: 53, scope: !1153)
!1158 = !DILocation(line: 1276, column: 22, scope: !1044)
!1159 = !DILocation(line: 1276, column: 28, scope: !1044)
!1160 = !DILocation(line: 1276, column: 40, scope: !1044)
!1161 = !DILocation(line: 1276, column: 47, scope: !1044)
!1162 = !DILocation(line: 1276, column: 39, scope: !1044)
!1163 = !DILocation(line: 1276, column: 58, scope: !1044)
!1164 = !DILocation(line: 1276, column: 12, scope: !1044)
!1165 = !DILocation(line: 1271, column: 10, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1038, file: !279, discriminator: 5)
!1167 = !DILocation(line: 1278, column: 10, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1044, file: !279, line: 1277, column: 37)
!1169 = !DILocation(line: 1280, column: 4, scope: !1038)
!1170 = !DILocation(line: 1281, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1034, file: !279, line: 1280, column: 11)
!1172 = !DILocation(line: 1284, column: 27, scope: !985)
!1173 = !DILocation(line: 1284, column: 11, scope: !985)
!1174 = !DILocation(line: 1284, column: 4, scope: !985)
!1175 = !DILocation(line: 1285, column: 1, scope: !985)
!1176 = distinct !DISubprogram(name: "CountNetmaskBitsV4", scope: !279, file: !279, line: 225, type: !1177, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!138, !115}
!1179 = !DILocalVariable(name: "netmask", arg: 1, scope: !1176, file: !279, line: 225, type: !115)
!1180 = !DILocation(line: 225, column: 37, scope: !1176)
!1181 = !DILocalVariable(name: "value", scope: !1176, file: !279, line: 227, type: !167)
!1182 = !DILocation(line: 227, column: 13, scope: !1176)
!1183 = !DILocation(line: 227, column: 44, scope: !1176)
!1184 = !DILocation(line: 227, column: 54, scope: !1176)
!1185 = !DILocation(line: 227, column: 63, scope: !1176)
!1186 = !DILocation(line: 227, column: 21, scope: !1176)
!1187 = !DILocation(line: 228, column: 28, scope: !1176)
!1188 = !DILocation(line: 228, column: 11, scope: !1176)
!1189 = !DILocation(line: 228, column: 4, scope: !1176)
!1190 = distinct !DISubprogram(name: "CountNetmaskBitsV6", scope: !279, file: !279, line: 234, type: !1177, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!1191 = !DILocalVariable(name: "netmask", arg: 1, scope: !1190, file: !279, line: 234, type: !115)
!1192 = !DILocation(line: 234, column: 37, scope: !1190)
!1193 = !DILocalVariable(name: "value", scope: !1190, file: !279, line: 236, type: !166)
!1194 = !DILocation(line: 236, column: 14, scope: !1190)
!1195 = !DILocation(line: 236, column: 59, scope: !1190)
!1196 = !DILocation(line: 236, column: 69, scope: !1190)
!1197 = !DILocation(line: 236, column: 22, scope: !1190)
!1198 = !DILocation(line: 238, column: 28, scope: !1190)
!1199 = !DILocation(line: 238, column: 11, scope: !1190)
!1200 = !DILocation(line: 238, column: 57, scope: !1190)
!1201 = !DILocation(line: 238, column: 40, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1190, file: !279, discriminator: 1)
!1203 = !DILocation(line: 238, column: 38, scope: !1190)
!1204 = !DILocation(line: 238, column: 4, scope: !1190)
!1205 = distinct !DISubprogram(name: "CountNetmaskBits", scope: !279, file: !279, line: 208, type: !1206, isLocal: true, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!138, !167}
!1208 = !DILocalVariable(name: "x", arg: 1, scope: !1205, file: !279, line: 208, type: !167)
!1209 = !DILocation(line: 208, column: 27, scope: !1205)
!1210 = !DILocalVariable(name: "m1", scope: !1205, file: !279, line: 211, type: !1211)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!1212 = !DILocation(line: 211, column: 19, scope: !1205)
!1213 = !DILocalVariable(name: "m2", scope: !1205, file: !279, line: 212, type: !1211)
!1214 = !DILocation(line: 212, column: 19, scope: !1205)
!1215 = !DILocalVariable(name: "m4", scope: !1205, file: !279, line: 213, type: !1211)
!1216 = !DILocation(line: 213, column: 19, scope: !1205)
!1217 = !DILocation(line: 215, column: 10, scope: !1205)
!1218 = !DILocation(line: 215, column: 12, scope: !1205)
!1219 = !DILocation(line: 215, column: 18, scope: !1205)
!1220 = !DILocation(line: 215, column: 6, scope: !1205)
!1221 = !DILocation(line: 216, column: 9, scope: !1205)
!1222 = !DILocation(line: 216, column: 11, scope: !1205)
!1223 = !DILocation(line: 216, column: 21, scope: !1205)
!1224 = !DILocation(line: 216, column: 23, scope: !1205)
!1225 = !DILocation(line: 216, column: 29, scope: !1205)
!1226 = !DILocation(line: 216, column: 17, scope: !1205)
!1227 = !DILocation(line: 216, column: 6, scope: !1205)
!1228 = !DILocation(line: 217, column: 9, scope: !1205)
!1229 = !DILocation(line: 217, column: 14, scope: !1205)
!1230 = !DILocation(line: 217, column: 16, scope: !1205)
!1231 = !DILocation(line: 217, column: 11, scope: !1205)
!1232 = !DILocation(line: 217, column: 23, scope: !1205)
!1233 = !DILocation(line: 217, column: 6, scope: !1205)
!1234 = !DILocation(line: 218, column: 9, scope: !1205)
!1235 = !DILocation(line: 218, column: 11, scope: !1205)
!1236 = !DILocation(line: 218, column: 6, scope: !1205)
!1237 = !DILocation(line: 219, column: 9, scope: !1205)
!1238 = !DILocation(line: 219, column: 11, scope: !1205)
!1239 = !DILocation(line: 219, column: 6, scope: !1205)
!1240 = !DILocation(line: 220, column: 9, scope: !1205)
!1241 = !DILocation(line: 220, column: 11, scope: !1205)
!1242 = !DILocation(line: 220, column: 6, scope: !1205)
!1243 = !DILocation(line: 221, column: 11, scope: !1205)
!1244 = !DILocation(line: 221, column: 13, scope: !1205)
!1245 = !DILocation(line: 221, column: 4, scope: !1205)
!1246 = distinct !DISubprogram(name: "RecordResolverNS", scope: !279, file: !279, line: 842, type: !1247, isLocal: true, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !335}
!1249 = !DILocalVariable(name: "dnsConfigInfo", arg: 1, scope: !1246, file: !279, line: 842, type: !335)
!1250 = !DILocation(line: 842, column: 33, scope: !1246)
!1251 = !DILocalVariable(name: "i", scope: !1246, file: !279, line: 844, type: !106)
!1252 = !DILocation(line: 844, column: 8, scope: !1246)
!1253 = !DILocation(line: 877, column: 14, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !279, line: 877, column: 7)
!1255 = distinct !DILexicalBlock(scope: !1246, file: !279, line: 873, column: 4)
!1256 = !DILocation(line: 877, column: 12, scope: !1254)
!1257 = !DILocation(line: 877, column: 19, scope: !1258)
!1258 = !DILexicalBlockFile(scope: !1259, file: !279, discriminator: 1)
!1259 = distinct !DILexicalBlock(scope: !1254, file: !279, line: 877, column: 7)
!1260 = !DILocation(line: 877, column: 21, scope: !1258)
!1261 = !DILocation(line: 877, column: 7, scope: !1258)
!1262 = !DILocalVariable(name: "sin", scope: !1263, file: !279, line: 878, type: !123)
!1263 = distinct !DILexicalBlock(scope: !1259, file: !279, line: 877, column: 34)
!1264 = !DILocation(line: 878, column: 30, scope: !1263)
!1265 = !DILocation(line: 878, column: 53, scope: !1263)
!1266 = !DILocation(line: 878, column: 36, scope: !1263)
!1267 = !DILocation(line: 878, column: 38, scope: !1263)
!1268 = !DILocation(line: 878, column: 41, scope: !1263)
!1269 = !DILocation(line: 879, column: 14, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1263, file: !279, line: 879, column: 14)
!1271 = !DILocation(line: 879, column: 19, scope: !1270)
!1272 = !DILocation(line: 879, column: 30, scope: !1270)
!1273 = !DILocation(line: 879, column: 14, scope: !1263)
!1274 = !DILocalVariable(name: "ip", scope: !1275, file: !279, line: 880, type: !249)
!1275 = distinct !DILexicalBlock(scope: !1270, file: !279, line: 879, column: 41)
!1276 = !DILocation(line: 880, column: 29, scope: !1275)
!1277 = !DILocation(line: 883, column: 17, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1275, file: !279, line: 883, column: 17)
!1279 = !DILocation(line: 883, column: 32, scope: !1278)
!1280 = !DILocation(line: 883, column: 43, scope: !1278)
!1281 = !DILocation(line: 883, column: 58, scope: !1278)
!1282 = !DILocation(line: 883, column: 17, scope: !1275)
!1283 = !DILocation(line: 884, column: 16, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1278, file: !279, line: 883, column: 65)
!1285 = !DILocation(line: 886, column: 16, scope: !1284)
!1286 = !DILocation(line: 889, column: 104, scope: !1275)
!1287 = !DILocation(line: 889, column: 120, scope: !1275)
!1288 = !DILocation(line: 889, column: 131, scope: !1275)
!1289 = !DILocation(line: 889, column: 92, scope: !1275)
!1290 = !DILocation(line: 889, column: 149, scope: !1275)
!1291 = !DILocation(line: 889, column: 165, scope: !1275)
!1292 = !DILocation(line: 889, column: 176, scope: !1275)
!1293 = !DILocation(line: 889, column: 72, scope: !1275)
!1294 = !DILocation(line: 889, column: 18, scope: !1275)
!1295 = !DILocation(line: 889, column: 16, scope: !1275)
!1296 = !DILocation(line: 890, column: 39, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !279, line: 890, column: 19)
!1298 = distinct !DILexicalBlock(scope: !1275, file: !279, line: 890, column: 14)
!1299 = !DILocation(line: 890, column: 37, scope: !1297)
!1300 = !DILocation(line: 890, column: 36, scope: !1297)
!1301 = !DILocation(line: 890, column: 19, scope: !1297)
!1302 = !DILocation(line: 890, column: 19, scope: !1298)
!1303 = !DILocation(line: 890, column: 51, scope: !1304)
!1304 = !DILexicalBlockFile(scope: !1305, file: !279, discriminator: 1)
!1305 = distinct !DILexicalBlock(scope: !1297, file: !279, line: 890, column: 49)
!1306 = !DILocation(line: 891, column: 66, scope: !1275)
!1307 = !DILocation(line: 891, column: 47, scope: !1275)
!1308 = !DILocation(line: 891, column: 71, scope: !1275)
!1309 = !DILocation(line: 891, column: 13, scope: !1275)
!1310 = !DILocation(line: 892, column: 10, scope: !1275)
!1311 = !DILocation(line: 893, column: 7, scope: !1263)
!1312 = !DILocation(line: 877, column: 30, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1259, file: !279, discriminator: 2)
!1314 = !DILocation(line: 877, column: 7, scope: !1313)
!1315 = distinct !{!1315, !1316}
!1316 = !DILocation(line: 877, column: 7, scope: !1255)
!1317 = !DILocation(line: 898, column: 14, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1255, file: !279, line: 898, column: 7)
!1319 = !DILocation(line: 898, column: 12, scope: !1318)
!1320 = !DILocation(line: 898, column: 19, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1322, file: !279, discriminator: 1)
!1322 = distinct !DILexicalBlock(scope: !1318, file: !279, line: 898, column: 7)
!1323 = !DILocation(line: 898, column: 21, scope: !1321)
!1324 = !DILocation(line: 898, column: 7, scope: !1321)
!1325 = !DILocalVariable(name: "sin6", scope: !1326, file: !279, line: 899, type: !140)
!1326 = distinct !DILexicalBlock(scope: !1322, file: !279, line: 898, column: 34)
!1327 = !DILocation(line: 899, column: 31, scope: !1326)
!1328 = !DILocation(line: 899, column: 58, scope: !1326)
!1329 = !DILocation(line: 899, column: 37, scope: !1326)
!1330 = !DILocation(line: 899, column: 39, scope: !1326)
!1331 = !DILocation(line: 899, column: 42, scope: !1326)
!1332 = !DILocation(line: 899, column: 45, scope: !1326)
!1333 = !DILocation(line: 899, column: 50, scope: !1326)
!1334 = !DILocation(line: 900, column: 14, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1326, file: !279, line: 900, column: 14)
!1336 = !DILocation(line: 900, column: 14, scope: !1326)
!1337 = !DILocalVariable(name: "ip", scope: !1338, file: !279, line: 901, type: !249)
!1338 = distinct !DILexicalBlock(scope: !1335, file: !279, line: 900, column: 20)
!1339 = !DILocation(line: 901, column: 29, scope: !1338)
!1340 = !DILocation(line: 904, column: 17, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1338, file: !279, line: 904, column: 17)
!1342 = !DILocation(line: 904, column: 32, scope: !1341)
!1343 = !DILocation(line: 904, column: 43, scope: !1341)
!1344 = !DILocation(line: 904, column: 58, scope: !1341)
!1345 = !DILocation(line: 904, column: 17, scope: !1338)
!1346 = !DILocation(line: 905, column: 16, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1341, file: !279, line: 904, column: 65)
!1348 = !DILocation(line: 907, column: 16, scope: !1347)
!1349 = !DILocation(line: 910, column: 104, scope: !1338)
!1350 = !DILocation(line: 910, column: 120, scope: !1338)
!1351 = !DILocation(line: 910, column: 131, scope: !1338)
!1352 = !DILocation(line: 910, column: 92, scope: !1338)
!1353 = !DILocation(line: 910, column: 149, scope: !1338)
!1354 = !DILocation(line: 910, column: 165, scope: !1338)
!1355 = !DILocation(line: 910, column: 176, scope: !1338)
!1356 = !DILocation(line: 910, column: 72, scope: !1338)
!1357 = !DILocation(line: 910, column: 18, scope: !1338)
!1358 = !DILocation(line: 910, column: 16, scope: !1338)
!1359 = !DILocation(line: 911, column: 39, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1361, file: !279, line: 911, column: 19)
!1361 = distinct !DILexicalBlock(scope: !1338, file: !279, line: 911, column: 14)
!1362 = !DILocation(line: 911, column: 37, scope: !1360)
!1363 = !DILocation(line: 911, column: 36, scope: !1360)
!1364 = !DILocation(line: 911, column: 19, scope: !1360)
!1365 = !DILocation(line: 911, column: 19, scope: !1361)
!1366 = !DILocation(line: 911, column: 51, scope: !1367)
!1367 = !DILexicalBlockFile(scope: !1368, file: !279, discriminator: 1)
!1368 = distinct !DILexicalBlock(scope: !1360, file: !279, line: 911, column: 49)
!1369 = !DILocation(line: 912, column: 66, scope: !1338)
!1370 = !DILocation(line: 912, column: 47, scope: !1338)
!1371 = !DILocation(line: 912, column: 72, scope: !1338)
!1372 = !DILocation(line: 912, column: 13, scope: !1338)
!1373 = !DILocation(line: 913, column: 10, scope: !1338)
!1374 = !DILocation(line: 914, column: 7, scope: !1326)
!1375 = !DILocation(line: 898, column: 30, scope: !1376)
!1376 = !DILexicalBlockFile(scope: !1322, file: !279, discriminator: 2)
!1377 = !DILocation(line: 898, column: 7, scope: !1376)
!1378 = distinct !{!1378, !1379}
!1379 = !DILocation(line: 898, column: 7, scope: !1255)
!1380 = !DILocation(line: 918, column: 1, scope: !1246)
!1381 = distinct !DISubprogram(name: "RecordRoutingInfoIPv4", scope: !279, file: !279, line: 944, type: !1382, isLocal: true, isDefinition: true, scopeLine: 946, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!1382 = !DISubroutineType(types: !1383)
!1383 = !{!282, !138, !303}
!1384 = !DILocalVariable(name: "maxRoutes", arg: 1, scope: !1381, file: !279, line: 944, type: !138)
!1385 = !DILocation(line: 944, column: 36, scope: !1381)
!1386 = !DILocalVariable(name: "nicInfo", arg: 2, scope: !1381, file: !279, line: 945, type: !303)
!1387 = !DILocation(line: 945, column: 34, scope: !1381)
!1388 = !DILocalVariable(name: "routes", scope: !1381, file: !279, line: 947, type: !1389)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !1391, line: 39, baseType: !1392)
!1391 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line766")
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !1391, line: 53, size: 128, align: 64, elements: !1393)
