; ModuleID = './hashMap.o.i'
source_filename = "./hashMap.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HashMap = type { i8*, i32, i32, i32, i64, i64, i64, i64, i64 }
%struct.HashMapEntryHeader = type { i32, i32 }

@.str = private unnamed_addr constant [19 x i8] c"NOT_REACHED %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"hashMap.c\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"Ran out of room in the hashtable\0A\00", align 1

; Function Attrs: nounwind uwtable
define %struct.HashMap* @HashMap_AllocMap(i32, i64, i64) #0 !dbg !32 {
  %4 = alloca i32, align 4
  %5 = alloca i64, align 8
  %6 = alloca i64, align 8
  store i32 %0, i32* %4, align 4
  call void @llvm.dbg.declare(metadata i32* %4, metadata !52, metadata !53), !dbg !54
  store i64 %1, i64* %5, align 8
  call void @llvm.dbg.declare(metadata i64* %5, metadata !55, metadata !53), !dbg !56
  store i64 %2, i64* %6, align 8
  call void @llvm.dbg.declare(metadata i64* %6, metadata !57, metadata !53), !dbg !58
  %7 = load i32, i32* %4, align 4, !dbg !59
  %8 = load i64, i64* %5, align 8, !dbg !60
  %9 = load i64, i64* %6, align 8, !dbg !61
  %10 = call %struct.HashMap* @HashMap_AllocMapAlpha(i32 %7, i32 2, i64 %8, i64 %9), !dbg !62
  ret %struct.HashMap* %10, !dbg !63
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !9)
!1 = !DIFile(filename: "hashMap.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 125, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "hashMap.c", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "HashMapState_EMPTY", value: 0)
!7 = !DIEnumerator(name: "HashMapState_FILLED", value: 1)
!8 = !DIEnumerator(name: "HashMapState_DELETED", value: 2)
!9 = !{!10, !15, !16, !20, !26}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !11, line: 173, baseType: !12)
!11 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 51, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !11, line: 177, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 48, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMapEntryHeader", file: !4, line: 134, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 131, size: 64, align: 32, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !4, line: 132, baseType: !10, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !22, file: !4, line: 133, baseType: !10, size: 32, align: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !11, line: 171, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 55, baseType: !28)
!28 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!29 = !{i32 2, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!32 = distinct !DISubprogram(name: "HashMap_AllocMap", scope: !4, file: !4, line: 218, type: !33, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !10, !45, !45}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashMap", file: !37, line: 45, baseType: !38)
!37 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap", file: !4, line: 92, size: 512, align: 64, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !47, !48, !49, !50}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !38, file: !4, line: 93, baseType: !16, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "numEntries", scope: !38, file: !4, line: 94, baseType: !10, size: 32, align: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !38, file: !4, line: 95, baseType: !10, size: 32, align: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !38, file: !4, line: 96, baseType: !10, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "keySize", scope: !38, file: !4, line: 98, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 216, baseType: !28)
!46 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line123")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dataSize", scope: !38, file: !4, line: 99, baseType: !45, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "entrySize", scope: !38, file: !4, line: 100, baseType: !45, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "keyOffset", scope: !38, file: !4, line: 102, baseType: !45, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "dataOffset", scope: !38, file: !4, line: 103, baseType: !45, size: 64, align: 64, offset: 448)
!51 = !{}
!52 = !DILocalVariable(name: "numEntries", arg: 1, scope: !32, file: !4, line: 218, type: !10)
!53 = !DIExpression()
!54 = !DILocation(line: 218, column: 25, scope: !32)
!55 = !DILocalVariable(name: "keySize", arg: 2, scope: !32, file: !4, line: 219, type: !45)
!56 = !DILocation(line: 219, column: 25, scope: !32)
!57 = !DILocalVariable(name: "dataSize", arg: 3, scope: !32, file: !4, line: 220, type: !45)
!58 = !DILocation(line: 220, column: 25, scope: !32)
!59 = !DILocation(line: 222, column: 33, scope: !32)
!60 = !DILocation(line: 222, column: 48, scope: !32)
!61 = !DILocation(line: 222, column: 57, scope: !32)
!62 = !DILocation(line: 222, column: 11, scope: !32)
!63 = !DILocation(line: 222, column: 4, scope: !32)
!64 = distinct !DISubprogram(name: "HashMap_AllocMapAlpha", scope: !4, file: !4, line: 247, type: !65, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!65 = !DISubroutineType(types: !66)
!66 = !{!35, !10, !10, !45, !45}
!67 = !DILocalVariable(name: "numEntries", arg: 1, scope: !64, file: !4, line: 247, type: !10)
!68 = !DILocation(line: 247, column: 30, scope: !64)
!69 = !DILocalVariable(name: "alpha", arg: 2, scope: !64, file: !4, line: 248, type: !10)
!70 = !DILocation(line: 248, column: 30, scope: !64)
!71 = !DILocalVariable(name: "keySize", arg: 3, scope: !64, file: !4, line: 249, type: !45)
!72 = !DILocation(line: 249, column: 30, scope: !64)
!73 = !DILocalVariable(name: "dataSize", arg: 4, scope: !64, file: !4, line: 250, type: !45)
!74 = !DILocation(line: 250, column: 30, scope: !64)
!75 = !DILocalVariable(name: "map", scope: !64, file: !4, line: 252, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!77 = !DILocation(line: 252, column: 20, scope: !64)
!78 = !DILocation(line: 253, column: 10, scope: !64)
!79 = !DILocation(line: 253, column: 8, scope: !64)
!80 = !DILocation(line: 257, column: 8, scope: !81)
!81 = distinct !DILexicalBlock(scope: !64, file: !4, line: 257, column: 8)
!82 = !DILocation(line: 257, column: 8, scope: !64)
!83 = !DILocation(line: 258, column: 20, scope: !84)
!84 = distinct !DILexicalBlock(scope: !85, file: !4, line: 258, column: 11)
!85 = distinct !DILexicalBlock(scope: !81, file: !4, line: 257, column: 13)
!86 = !DILocation(line: 258, column: 25, scope: !84)
!87 = !DILocation(line: 258, column: 37, scope: !84)
!88 = !DILocation(line: 258, column: 44, scope: !84)
!89 = !DILocation(line: 258, column: 53, scope: !84)
!90 = !DILocation(line: 258, column: 12, scope: !84)
!91 = !DILocation(line: 258, column: 11, scope: !85)
!92 = !DILocation(line: 259, column: 29, scope: !93)
!93 = distinct !DILexicalBlock(scope: !84, file: !4, line: 258, column: 64)
!94 = !DILocation(line: 259, column: 10, scope: !93)
!95 = !DILocation(line: 260, column: 10, scope: !93)
!96 = !DILocation(line: 262, column: 4, scope: !85)
!97 = !DILocation(line: 264, column: 11, scope: !64)
!98 = !DILocation(line: 264, column: 4, scope: !64)
!99 = !DILocation(line: 265, column: 1, scope: !64)
!100 = distinct !DISubprogram(name: "InitMap", scope: !4, file: !4, line: 315, type: !101, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !51)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !76, !10, !10, !45, !45}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !11, line: 230, baseType: !104)
!104 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DILocalVariable(name: "map", arg: 1, scope: !100, file: !4, line: 315, type: !76)
!106 = !DILocation(line: 315, column: 25, scope: !100)
!107 = !DILocalVariable(name: "numEntries", arg: 2, scope: !100, file: !4, line: 316, type: !10)
!108 = !DILocation(line: 316, column: 16, scope: !100)
