; ModuleID = './hgfsServerPacketUtil.o.i'
source_filename = "./hgfsServerPacketUtil.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsPacket = type { i64, i64, i8*, i64, i32, i64, i8, i32, i8*, i64, i32, i64, i32, i8, i32, i8*, i64, i64, i8, [2 x %struct.HgfsVmxIov], i32, [1 x %struct.HgfsVmxIov] }
%struct.HgfsVmxIov = type { i8*, i64, i32, i8* }
%struct.HgfsServerChannelCallbacks = type { void ()*, void ()*, i8* (i64, i32, i8**)*, i8* (i64, i32, i8**)*, void (i8**)*, i8 (i8*, %struct.HgfsPacket*, i32)* }

@.str = private unnamed_addr constant [11 x i8] c"hgfsServer\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"%s:%s:\00", align 1
@__FUNCTION__.HSPU_GetReplyPacket = private unnamed_addr constant [20 x i8] c"HSPU_GetReplyPacket\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"Existing reply packet %s %zu %zu\0A\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"%s Using meta packet for reply packet\0A\00", align 1
@.str.4 = private unnamed_addr constant [23 x i8] c"NOT_IMPLEMENTED %s:%d\0A\00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"hgfsServerPacketUtil.c\00", align 1
@.str.6 = private unnamed_addr constant [28 x i8] c"%s Allocating reply packet\0A\00", align 1
@__FUNCTION__.HSPU_PutReplyPacket = private unnamed_addr constant [20 x i8] c"HSPU_PutReplyPacket\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21)
!1 = !DIFile(filename: "hgfsServerPacketUtil.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 36, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServer.h", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "BUF_READABLE", value: 0)
!7 = !DIEnumerator(name: "BUF_WRITEABLE", value: 1)
!8 = !DIEnumerator(name: "BUF_READWRITEABLE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 51, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20}
!12 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!13 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!15 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!16 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!17 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!19 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!20 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!28 = distinct !DISubprogram(name: "HSPU_ValidateRequestPacketSize", scope: !29, file: !29, line: 95, type: !30, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!29 = !DIFile(filename: "hgfsServerPacketUtil.c", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !34, !47, !47, !47}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !33, line: 230, baseType: !24)
!33 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsPacket", file: !4, line: 78, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsPacket", file: !4, line: 45, size: 1920, align: 64, elements: !37)
!37 = !{!38, !43, !45, !46, !49, !53, !54, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !79, !80}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !36, file: !4, line: 46, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !33, line: 171, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 55, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!42 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !36, file: !4, line: 48, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsStateFlags", file: !4, line: 42, baseType: !39)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacket", scope: !36, file: !4, line: 51, baseType: !22, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketSize", scope: !36, file: !4, line: 52, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 216, baseType: !42)
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line387")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketMappedIov", scope: !36, file: !4, line: 53, baseType: !50, size: 32, align: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !33, line: 173, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 51, baseType: !52)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketDataSize", scope: !36, file: !4, line: 54, baseType: !47, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "metaPacketIsAllocated", scope: !36, file: !4, line: 55, baseType: !32, size: 8, align: 8, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "metaMappingType", scope: !36, file: !4, line: 56, baseType: !56, size: 32, align: 32, offset: 416)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "MappingType", file: !4, line: 40, baseType: !3)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacket", scope: !36, file: !4, line: 58, baseType: !22, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketSize", scope: !36, file: !4, line: 59, baseType: !47, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketMappedIov", scope: !36, file: !4, line: 60, baseType: !50, size: 32, align: 32, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketDataSize", scope: !36, file: !4, line: 61, baseType: !47, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIovIndex", scope: !36, file: !4, line: 62, baseType: !50, size: 32, align: 32, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dataPacketIsAllocated", scope: !36, file: !4, line: 63, baseType: !32, size: 8, align: 8, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "dataMappingType", scope: !36, file: !4, line: 65, baseType: !56, size: 32, align: 32, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacket", scope: !36, file: !4, line: 67, baseType: !22, size: 64, align: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketSize", scope: !36, file: !4, line: 68, baseType: !47, size: 64, align: 64, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketDataSize", scope: !36, file: !4, line: 69, baseType: !47, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "replyPacketIsAllocated", scope: !36, file: !4, line: 70, baseType: !32, size: 8, align: 8, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "channelIov", scope: !36, file: !4, line: 73, baseType: !69, size: 512, align: 64, offset: 1088)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, align: 64, elements: !77)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsVmxIov", file: !4, line: 34, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsVmxIov", file: !4, line: 29, size: 256, align: 64, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "va", scope: !71, file: !4, line: 30, baseType: !22, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pa", scope: !71, file: !4, line: 31, baseType: !39, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !4, line: 32, baseType: !50, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !71, file: !4, line: 33, baseType: !22, size: 64, align: 64, offset: 192)
!77 = !{!78}
!78 = !DISubrange(count: 2)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "iovCount", scope: !36, file: !4, line: 75, baseType: !50, size: 32, align: 32, offset: 1600)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !36, file: !4, line: 76, baseType: !81, size: 256, align: 64, offset: 1664)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, align: 64, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !{}
!85 = !DILocalVariable(name: "packet", arg: 1, scope: !28, file: !29, line: 95, type: !34)
!86 = !DIExpression()
!87 = !DILocation(line: 95, column: 44, scope: !28)
!88 = !DILocalVariable(name: "requestHeaderSize", arg: 2, scope: !28, file: !29, line: 96, type: !47)
!89 = !DILocation(line: 96, column: 39, scope: !28)
!90 = !DILocalVariable(name: "requestOpSize", arg: 3, scope: !28, file: !29, line: 97, type: !47)
!91 = !DILocation(line: 97, column: 39, scope: !28)
!92 = !DILocalVariable(name: "requestOpDataSize", arg: 4, scope: !28, file: !29, line: 98, type: !47)
!93 = !DILocation(line: 98, column: 39, scope: !28)
!94 = !DILocalVariable(name: "bytesRemaining", scope: !28, file: !29, line: 100, type: !47)
!95 = !DILocation(line: 100, column: 11, scope: !28)
!96 = !DILocation(line: 100, column: 28, scope: !28)
!97 = !DILocation(line: 100, column: 36, scope: !28)
!98 = !DILocalVariable(name: "requestSizeIsOkay", scope: !28, file: !29, line: 101, type: !32)
!99 = !DILocation(line: 101, column: 9, scope: !28)
!100 = !DILocation(line: 108, column: 8, scope: !101)
!101 = distinct !DILexicalBlock(scope: !28, file: !29, line: 108, column: 8)
!102 = !DILocation(line: 108, column: 26, scope: !101)
!103 = !DILocation(line: 108, column: 23, scope: !101)
!104 = !DILocation(line: 108, column: 8, scope: !28)
!105 = !DILocation(line: 109, column: 25, scope: !106)
!106 = distinct !DILexicalBlock(scope: !101, file: !29, line: 108, column: 45)
!107 = !DILocation(line: 109, column: 22, scope: !106)
!108 = !DILocation(line: 110, column: 4, scope: !106)
!109 = !DILocation(line: 111, column: 7, scope: !110)
!110 = distinct !DILexicalBlock(scope: !101, file: !29, line: 110, column: 11)
!111 = !DILocation(line: 113, column: 8, scope: !112)
!112 = distinct !DILexicalBlock(scope: !28, file: !29, line: 113, column: 8)
!113 = !DILocation(line: 113, column: 26, scope: !112)
!114 = !DILocation(line: 113, column: 23, scope: !112)
!115 = !DILocation(line: 113, column: 8, scope: !28)
!116 = !DILocation(line: 114, column: 25, scope: !117)
!117 = distinct !DILexicalBlock(scope: !112, file: !29, line: 113, column: 41)
!118 = !DILocation(line: 114, column: 22, scope: !117)
!119 = !DILocation(line: 115, column: 4, scope: !117)
!120 = !DILocation(line: 116, column: 7, scope: !121)
!121 = distinct !DILexicalBlock(scope: !112, file: !29, line: 115, column: 11)
!122 = !DILocation(line: 118, column: 8, scope: !123)
!123 = distinct !DILexicalBlock(scope: !28, file: !29, line: 118, column: 8)
!124 = !DILocation(line: 118, column: 26, scope: !123)
!125 = !DILocation(line: 118, column: 23, scope: !123)
!126 = !DILocation(line: 118, column: 8, scope: !28)
!127 = !DILocation(line: 119, column: 25, scope: !128)
!128 = distinct !DILexicalBlock(scope: !123, file: !29, line: 118, column: 45)
!129 = !DILocation(line: 120, column: 4, scope: !128)
!130 = !DILocation(line: 118, column: 26, scope: !131)
!131 = !DILexicalBlockFile(scope: !123, file: !29, discriminator: 1)
!132 = !DILocation(line: 123, column: 11, scope: !28)
!133 = !DILocation(line: 123, column: 4, scope: !28)
!134 = distinct !DISubprogram(name: "HSPU_ValidateReplyPacketSize", scope: !29, file: !29, line: 145, type: !135, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!135 = !DISubroutineType(types: !136)
!136 = !{!32, !34, !47, !47, !47, !32}
!137 = !DILocalVariable(name: "packet", arg: 1, scope: !134, file: !29, line: 145, type: !34)
!138 = !DILocation(line: 145, column: 42, scope: !134)
!139 = !DILocalVariable(name: "replyHeaderSize", arg: 2, scope: !134, file: !29, line: 146, type: !47)
!140 = !DILocation(line: 146, column: 37, scope: !134)
!141 = !DILocalVariable(name: "replyResultSize", arg: 3, scope: !134, file: !29, line: 147, type: !47)
!142 = !DILocation(line: 147, column: 37, scope: !134)
!143 = !DILocalVariable(name: "replyResultDataSize", arg: 4, scope: !134, file: !29, line: 148, type: !47)
!144 = !DILocation(line: 148, column: 37, scope: !134)
!145 = !DILocalVariable(name: "useMappedMetaPacket", arg: 5, scope: !134, file: !29, line: 149, type: !32)
!146 = !DILocation(line: 149, column: 35, scope: !134)
!147 = !DILocalVariable(name: "bytesRemaining", scope: !134, file: !29, line: 151, type: !47)
!148 = !DILocation(line: 151, column: 11, scope: !134)
!149 = !DILocalVariable(name: "replySizeIsOkay", scope: !134, file: !29, line: 152, type: !32)
!150 = !DILocation(line: 152, column: 9, scope: !134)
!151 = !DILocation(line: 154, column: 8, scope: !152)
!152 = distinct !DILexicalBlock(scope: !134, file: !29, line: 154, column: 8)
!153 = !DILocation(line: 154, column: 16, scope: !152)
!154 = !DILocation(line: 154, column: 28, scope: !152)
!155 = !DILocation(line: 154, column: 8, scope: !134)
!156 = !DILocation(line: 156, column: 24, scope: !157)
!157 = distinct !DILexicalBlock(scope: !152, file: !29, line: 154, column: 36)
!158 = !DILocation(line: 156, column: 32, scope: !157)
!159 = !DILocation(line: 156, column: 22, scope: !157)
!160 = !DILocation(line: 157, column: 4, scope: !157)
!161 = !DILocation(line: 157, column: 15, scope: !162)
!162 = !DILexicalBlockFile(scope: !163, file: !29, discriminator: 1)
!163 = distinct !DILexicalBlock(scope: !152, file: !29, line: 157, column: 15)
!164 = !DILocation(line: 159, column: 24, scope: !165)
!165 = distinct !DILexicalBlock(scope: !163, file: !29, line: 157, column: 36)
!166 = !DILocation(line: 159, column: 32, scope: !165)
!167 = !DILocation(line: 159, column: 22, scope: !165)
!168 = !DILocation(line: 160, column: 4, scope: !165)
!169 = !DILocation(line: 162, column: 23, scope: !170)
!170 = distinct !DILexicalBlock(scope: !163, file: !29, line: 160, column: 11)
!171 = !DILocation(line: 163, column: 7, scope: !170)
!172 = !DILocation(line: 166, column: 8, scope: !173)
!173 = distinct !DILexicalBlock(scope: !134, file: !29, line: 166, column: 8)
!174 = !DILocation(line: 166, column: 26, scope: !173)
!175 = !DILocation(line: 166, column: 23, scope: !173)
!176 = !DILocation(line: 166, column: 8, scope: !134)
!177 = !DILocation(line: 167, column: 25, scope: !178)
!178 = distinct !DILexicalBlock(scope: !173, file: !29, line: 166, column: 43)
!179 = !DILocation(line: 167, column: 22, scope: !178)
!180 = !DILocation(line: 168, column: 4, scope: !178)
!181 = !DILocation(line: 169, column: 7, scope: !182)
!182 = distinct !DILexicalBlock(scope: !173, file: !29, line: 168, column: 11)
!183 = !DILocation(line: 171, column: 8, scope: !184)
!184 = distinct !DILexicalBlock(scope: !134, file: !29, line: 171, column: 8)
!185 = !DILocation(line: 171, column: 26, scope: !184)
!186 = !DILocation(line: 171, column: 23, scope: !184)
!187 = !DILocation(line: 171, column: 8, scope: !134)
!188 = !DILocation(line: 172, column: 25, scope: !189)
!189 = distinct !DILexicalBlock(scope: !184, file: !29, line: 171, column: 43)
!190 = !DILocation(line: 172, column: 22, scope: !189)
!191 = !DILocation(line: 173, column: 4, scope: !189)
!192 = !DILocation(line: 174, column: 7, scope: !193)
!193 = distinct !DILexicalBlock(scope: !184, file: !29, line: 173, column: 11)
!194 = !DILocation(line: 176, column: 8, scope: !195)
!195 = distinct !DILexicalBlock(scope: !134, file: !29, line: 176, column: 8)
!196 = !DILocation(line: 176, column: 26, scope: !195)
!197 = !DILocation(line: 176, column: 23, scope: !195)
!198 = !DILocation(line: 176, column: 8, scope: !134)
!199 = !DILocation(line: 177, column: 23, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !29, line: 176, column: 47)
!201 = !DILocation(line: 178, column: 4, scope: !200)
!202 = !DILocation(line: 176, column: 26, scope: !203)
!203 = !DILexicalBlockFile(scope: !195, file: !29, discriminator: 1)
!204 = !DILocation(line: 181, column: 11, scope: !134)
!205 = !DILocation(line: 181, column: 4, scope: !134)
!206 = distinct !DISubprogram(name: "HSPU_GetReplyPacket", scope: !29, file: !29, line: 202, type: !207, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !84)
!207 = !DISubroutineType(types: !208)
!208 = !{!22, !34, !209, !47, !238}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerChannelCallbacks", file: !4, line: 190, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerChannelCallbacks", file: !4, line: 183, size: 384, align: 64, elements: !212)
!212 = !{!213, !218, !220, !226, !227, !232}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "registerThread", scope: !211, file: !4, line: 184, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelRegisterThreadFunc", file: !4, line: 180, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "unregisterThread", scope: !211, file: !4, line: 185, baseType: !219, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnregisterThreadFunc", file: !4, line: 181, baseType: !215)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "getReadVa", scope: !211, file: !4, line: 186, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelMapVirtAddrFunc", file: !4, line: 178, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!22, !39, !50, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "getWriteVa", scope: !211, file: !4, line: 187, baseType: !221, size: 64, align: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "putVa", scope: !211, file: !4, line: 188, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelUnmapVirtAddrFunc", file: !4, line: 179, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !225}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !211, file: !4, line: 189, baseType: !233, size: 64, align: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsChannelSendFunc", file: !4, line: 175, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!32, !22, !34, !237}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsSendFlags", file: !4, line: 98, baseType: !50)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!239 = !DILocalVariable(name: "packet", arg: 1, scope: !206, file: !29, line: 202, type: !34)
!240 = !DILocation(line: 202, column: 33, scope: !206)
!241 = !DILocalVariable(name: "chanCb", arg: 2, scope: !206, file: !29, line: 203, type: !209)
!242 = !DILocation(line: 203, column: 49, scope: !206)
!243 = !DILocalVariable(name: "replyDataSize", arg: 3, scope: !206, file: !29, line: 204, type: !47)
!244 = !DILocation(line: 204, column: 28, scope: !206)
!245 = !DILocalVariable(name: "replyPacketSize", arg: 4, scope: !206, file: !29, line: 205, type: !238)
!246 = !DILocation(line: 205, column: 29, scope: !206)
!247 = !DILocation(line: 207, column: 8, scope: !248)
!248 = distinct !DILexicalBlock(scope: !206, file: !29, line: 207, column: 8)
!249 = !DILocation(line: 207, column: 16, scope: !248)
!250 = !DILocation(line: 207, column: 28, scope: !248)
!251 = !DILocation(line: 207, column: 8, scope: !206)
!252 = !DILocation(line: 212, column: 37, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !29, line: 207, column: 36)
!254 = !DILocation(line: 212, column: 7, scope: !253)
!255 = !DILocation(line: 212, column: 15, scope: !253)
!256 = !DILocation(line: 212, column: 35, scope: !253)
!257 = !DILocation(line: 213, column: 7, scope: !253)
!258 = distinct !{!258, !257}
!259 = !DILocation(line: 213, column: 33, scope: !260)
!260 = !DILexicalBlockFile(scope: !261, file: !29, discriminator: 1)
!261 = distinct !DILexicalBlock(scope: !262, file: !29, line: 213, column: 31)
!262 = distinct !DILexicalBlock(scope: !263, file: !29, line: 213, column: 16)
!263 = distinct !DILexicalBlock(scope: !253, file: !29, line: 213, column: 10)
!264 = !DILocation(line: 213, column: 212, scope: !260)
!265 = !DILocation(line: 213, column: 227, scope: !260)
!266 = !DILocation(line: 213, column: 235, scope: !260)
!267 = !DILocation(line: 213, column: 112, scope: !268)
!268 = !DILexicalBlockFile(scope: !260, file: !29, discriminator: 2)
!269 = !DILocation(line: 213, column: 255, scope: !260)
!270 = !DILocation(line: 216, column: 4, scope: !253)
!271 = !DILocation(line: 216, column: 15, scope: !272)
!272 = !DILexicalBlockFile(scope: !273, file: !29, discriminator: 1)
!273 = distinct !DILexicalBlock(scope: !248, file: !29, line: 216, column: 15)
!274 = !DILocation(line: 216, column: 22, scope: !272)
!275 = !DILocation(line: 216, column: 29, scope: !272)
!276 = !DILocation(line: 216, column: 32, scope: !277)
!277 = !DILexicalBlockFile(scope: !273, file: !29, discriminator: 2)
!278 = !DILocation(line: 216, column: 40, scope: !277)
!279 = !DILocation(line: 216, column: 51, scope: !277)
!280 = !DILocation(line: 216, column: 15, scope: !277)
!281 = !DILocation(line: 218, column: 11, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !29, line: 218, column: 11)
!283 = distinct !DILexicalBlock(scope: !273, file: !29, line: 216, column: 60)
!284 = !DILocation(line: 218, column: 19, scope: !282)
!285 = !DILocation(line: 218, column: 30, scope: !282)
!286 = !DILocation(line: 218, column: 11, scope: !283)
!287 = !DILocation(line: 227, column: 10, scope: !288)
!288 = distinct !DILexicalBlock(scope: !282, file: !29, line: 218, column: 38)
!289 = distinct !{!289, !287}
!290 = !DILocation(line: 227, column: 37, scope: !291)
!291 = !DILexicalBlockFile(scope: !292, file: !29, discriminator: 1)
!292 = distinct !DILexicalBlock(scope: !293, file: !29, line: 227, column: 35)
