; ModuleID = './line10-net.o.i'
source_filename = "./line10-net.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.config = type { i8*, i32, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, %struct.ssl_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !31, globals: !52)
!1 = !DIFile(filename: "line10-net.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{!3, !16}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 126, size: 32, align: 32, elements: !12)
!4 = !DIFile(filename: "net.c", directory: "/home/lichi/Desktop/dma/task1")
!5 = distinct !DISubprogram(name: "read_remote", scope: !4, file: !4, line: 120, type: !6, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !11)
!6 = !DISubroutineType(types: !7)
!7 = !{!8, !8, !8, !9}
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!11 = !{}
!12 = !{!13, !14, !15}
!13 = !DIEnumerator(name: "parse_status", value: 0)
!14 = !DIEnumerator(name: "parse_spacedash", value: 1)
!15 = !DIEnumerator(name: "parse_rest", value: 2)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 46, size: 32, align: 32, elements: !18)
!17 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/dma/task1")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!19 = !DIEnumerator(name: "_ISupper", value: 256)
!20 = !DIEnumerator(name: "_ISlower", value: 512)
!21 = !DIEnumerator(name: "_ISalpha", value: 1024)
!22 = !DIEnumerator(name: "_ISdigit", value: 2048)
!23 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!24 = !DIEnumerator(name: "_ISspace", value: 8192)
!25 = !DIEnumerator(name: "_ISprint", value: 16384)
!26 = !DIEnumerator(name: "_ISgraph", value: 32768)
!27 = !DIEnumerator(name: "_ISblank", value: 1)
!28 = !DIEnumerator(name: "_IScntrl", value: 2)
!29 = !DIEnumerator(name: "_ISpunct", value: 4)
!30 = !DIEnumerator(name: "_ISalnum", value: 8)
!31 = !{!32, !34, !8, !35, !36, !41}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!35 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dma/task1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 172, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!40 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !43, line: 153, size: 128, align: 16, elements: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/dma/task1")
!44 = !{!45, !48}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !42, file: !43, line: 155, baseType: !46, size: 16, align: 16)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !47, line: 28, baseType: !35)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/dma/task1")
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !42, file: !43, line: 156, baseType: !49, size: 112, align: 8, offset: 16)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 112, align: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 14)
!52 = !{!53}
!53 = distinct !DIGlobalVariable(name: "neterr", scope: !0, file: !4, line: 60, type: !54, isLocal: false, isDefinition: true, variable: [200 x i8]* @neterr)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1600, align: 8, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 200)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!60 = distinct !DISubprogram(name: "ssl_errstr", scope: !4, file: !4, line: 63, type: !61, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !11)
!61 = !DISubroutineType(types: !62)
!62 = !{!9}
!63 = !DILocalVariable(name: "oerr", scope: !60, file: !4, line: 65, type: !40)
!64 = !DIExpression()
!65 = !DILocation(line: 65, column: 7, scope: !60)
!66 = !DILocalVariable(name: "nerr", scope: !60, file: !4, line: 65, type: !40)
!67 = !DILocation(line: 65, column: 13, scope: !60)
!68 = !DILocation(line: 67, column: 7, scope: !60)
!69 = !DILocation(line: 68, column: 2, scope: !60)
!70 = !DILocation(line: 68, column: 17, scope: !71)
!71 = !DILexicalBlockFile(scope: !60, file: !4, discriminator: 1)
!72 = !DILocation(line: 68, column: 15, scope: !71)
!73 = !DILocation(line: 68, column: 34, scope: !71)
!74 = !DILocation(line: 68, column: 2, scope: !71)
!75 = !DILocation(line: 69, column: 10, scope: !60)
!76 = !DILocation(line: 69, column: 8, scope: !60)
!77 = !DILocation(line: 68, column: 2, scope: !78)
!78 = !DILexicalBlockFile(scope: !60, file: !4, discriminator: 2)
!79 = distinct !{!79, !69}
!80 = !DILocation(line: 71, column: 27, scope: !60)
!81 = !DILocation(line: 71, column: 10, scope: !60)
!82 = !DILocation(line: 71, column: 2, scope: !60)
!83 = distinct !DISubprogram(name: "send_remote_command", scope: !4, file: !4, line: 75, type: !84, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !11)
!84 = !DISubroutineType(types: !85)
!85 = !{!36, !8, !32, null}
!86 = !DILocalVariable(name: "fd", arg: 1, scope: !83, file: !4, line: 75, type: !8)
!87 = !DILocation(line: 75, column: 25, scope: !83)
!88 = !DILocalVariable(name: "fmt", arg: 2, scope: !83, file: !4, line: 75, type: !32)
!89 = !DILocation(line: 75, column: 41, scope: !83)
!90 = !DILocalVariable(name: "va", scope: !83, file: !4, line: 77, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !92, line: 79, baseType: !93)
!92 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !94, line: 40, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dma/task1")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 77, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 192, align: 64, elements: !104)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 77, size: 192, align: 64, elements: !98)
!98 = !{!99, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !97, file: !1, line: 77, baseType: !100, size: 32, align: 32)
!100 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !97, file: !1, line: 77, baseType: !100, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !97, file: !1, line: 77, baseType: !34, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !97, file: !1, line: 77, baseType: !34, size: 64, align: 64, offset: 128)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DILocation(line: 77, column: 10, scope: !83)
!107 = !DILocalVariable(name: "cmd", scope: !83, file: !4, line: 78, type: !108)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32768, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 4096)
!111 = !DILocation(line: 78, column: 7, scope: !83)
!112 = !DILocalVariable(name: "len", scope: !83, file: !4, line: 79, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 216, baseType: !115)
!114 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!116 = !DILocation(line: 79, column: 9, scope: !83)
!117 = !DILocalVariable(name: "pos", scope: !83, file: !4, line: 79, type: !113)
!118 = !DILocation(line: 79, column: 14, scope: !83)
!119 = !DILocalVariable(name: "s", scope: !83, file: !4, line: 80, type: !8)
!120 = !DILocation(line: 80, column: 6, scope: !83)
!121 = !DILocalVariable(name: "n", scope: !83, file: !4, line: 81, type: !36)
!122 = !DILocation(line: 81, column: 10, scope: !83)
!123 = !DILocation(line: 83, column: 1, scope: !83)
!124 = !DILocation(line: 84, column: 16, scope: !83)
!125 = !DILocation(line: 84, column: 38, scope: !83)
!126 = !DILocation(line: 84, column: 43, scope: !83)
!127 = !DILocation(line: 84, column: 6, scope: !83)
!128 = !DILocation(line: 84, column: 4, scope: !83)
!129 = !DILocation(line: 85, column: 1, scope: !83)
!130 = !DILocation(line: 86, column: 6, scope: !131)
!131 = distinct !DILexicalBlock(scope: !83, file: !4, line: 86, column: 6)
!132 = !DILocation(line: 86, column: 8, scope: !131)
!133 = !DILocation(line: 86, column: 27, scope: !131)
!134 = !DILocation(line: 86, column: 30, scope: !135)
!135 = !DILexicalBlockFile(scope: !131, file: !4, discriminator: 1)
!136 = !DILocation(line: 86, column: 32, scope: !135)
!137 = !DILocation(line: 86, column: 6, scope: !135)
!138 = !DILocation(line: 87, column: 3, scope: !139)
!139 = distinct !DILexicalBlock(scope: !131, file: !4, line: 86, column: 37)
!140 = !DILocation(line: 88, column: 3, scope: !139)
!141 = !DILocation(line: 92, column: 9, scope: !83)
!142 = !DILocation(line: 92, column: 2, scope: !83)
!143 = !DILocation(line: 93, column: 15, scope: !83)
!144 = !DILocation(line: 93, column: 8, scope: !83)
!145 = !DILocation(line: 93, column: 6, scope: !83)
!146 = !DILocation(line: 95, column: 15, scope: !147)
!147 = distinct !DILexicalBlock(scope: !83, file: !4, line: 95, column: 6)
!148 = !DILocation(line: 95, column: 24, scope: !147)
!149 = !DILocation(line: 95, column: 33, scope: !147)
!150 = !DILocation(line: 95, column: 39, scope: !147)
!151 = !DILocation(line: 96, column: 15, scope: !147)
!152 = !DILocation(line: 96, column: 24, scope: !147)
!153 = !DILocation(line: 96, column: 33, scope: !147)
!154 = !DILocation(line: 95, column: 6, scope: !155)
!155 = !DILexicalBlockFile(scope: !83, file: !4, discriminator: 1)
!156 = !DILocation(line: 97, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !147, file: !4, line: 96, column: 40)
!158 = !DILocation(line: 97, column: 32, scope: !159)
!159 = !DILexicalBlockFile(scope: !157, file: !4, discriminator: 1)
!160 = !DILocation(line: 97, column: 50, scope: !159)
!161 = !DILocation(line: 97, column: 55, scope: !159)
!162 = !DILocation(line: 97, column: 15, scope: !159)
!163 = !DILocation(line: 97, column: 13, scope: !159)
!164 = !DILocation(line: 97, column: 61, scope: !159)
!165 = !DILocation(line: 97, column: 3, scope: !159)
!166 = !DILocation(line: 98, column: 29, scope: !167)
!167 = distinct !DILexicalBlock(scope: !157, file: !4, line: 97, column: 67)
!168 = !DILocation(line: 98, column: 34, scope: !167)
!169 = !DILocation(line: 98, column: 8, scope: !167)
!170 = !DILocation(line: 98, column: 6, scope: !167)
!171 = !DILocation(line: 99, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !167, file: !4, line: 99, column: 8)
!173 = !DILocation(line: 99, column: 10, scope: !172)
!174 = !DILocation(line: 99, column: 32, scope: !172)
!175 = !DILocation(line: 100, column: 8, scope: !172)
!176 = !DILocation(line: 100, column: 10, scope: !172)
!177 = !DILocation(line: 99, column: 8, scope: !178)
!178 = !DILexicalBlockFile(scope: !167, file: !4, discriminator: 1)
!179 = !DILocation(line: 101, column: 21, scope: !180)
!180 = distinct !DILexicalBlock(scope: !172, file: !4, line: 100, column: 34)
!181 = !DILocation(line: 101, column: 5, scope: !182)
!182 = !DILexicalBlockFile(scope: !180, file: !4, discriminator: 1)
!183 = !DILocation(line: 102, column: 5, scope: !180)
!184 = !DILocation(line: 97, column: 3, scope: !185)
!185 = !DILexicalBlockFile(scope: !157, file: !4, discriminator: 2)
!186 = distinct !{!186, !156}
!187 = !DILocation(line: 105, column: 2, scope: !157)
!188 = !DILocation(line: 107, column: 7, scope: !189)
!189 = distinct !DILexicalBlock(scope: !147, file: !4, line: 106, column: 7)
!190 = !DILocation(line: 108, column: 3, scope: !189)
!191 = !DILocation(line: 108, column: 10, scope: !192)
!192 = !DILexicalBlockFile(scope: !189, file: !4, discriminator: 1)
!193 = !DILocation(line: 108, column: 16, scope: !192)
!194 = !DILocation(line: 108, column: 14, scope: !192)
!195 = !DILocation(line: 108, column: 3, scope: !192)
!196 = !DILocation(line: 109, column: 14, scope: !197)
!197 = distinct !DILexicalBlock(scope: !189, file: !4, line: 108, column: 21)
!198 = !DILocation(line: 109, column: 18, scope: !197)
!199 = !DILocation(line: 109, column: 24, scope: !197)
!200 = !DILocation(line: 109, column: 22, scope: !197)
!201 = !DILocation(line: 109, column: 29, scope: !197)
!202 = !DILocation(line: 109, column: 35, scope: !197)
!203 = !DILocation(line: 109, column: 33, scope: !197)
!204 = !DILocation(line: 109, column: 8, scope: !197)
!205 = !DILocation(line: 109, column: 6, scope: !197)
!206 = !DILocation(line: 110, column: 8, scope: !207)
!207 = distinct !DILexicalBlock(scope: !197, file: !4, line: 110, column: 8)
!208 = !DILocation(line: 110, column: 10, scope: !207)
!209 = !DILocation(line: 110, column: 8, scope: !197)
!210 = !DILocation(line: 111, column: 5, scope: !207)
!211 = !DILocation(line: 112, column: 11, scope: !197)
!212 = !DILocation(line: 112, column: 8, scope: !197)
!213 = !DILocation(line: 108, column: 3, scope: !214)
!214 = !DILexicalBlockFile(scope: !189, file: !4, discriminator: 2)
!215 = distinct !{!215, !190}
!216 = !DILocation(line: 116, column: 10, scope: !83)
!217 = !DILocation(line: 116, column: 2, scope: !83)
!218 = !DILocation(line: 117, column: 1, scope: !83)
!219 = !DILocalVariable(name: "fd", arg: 1, scope: !5, file: !4, line: 120, type: !8)
!220 = !DILocation(line: 120, column: 17, scope: !5)
!221 = !DILocalVariable(name: "extbufsize", arg: 2, scope: !5, file: !4, line: 120, type: !8)
!222 = !DILocation(line: 120, column: 25, scope: !5)
!223 = !DILocalVariable(name: "extbuf", arg: 3, scope: !5, file: !4, line: 120, type: !9)
!224 = !DILocation(line: 120, column: 43, scope: !5)
!225 = !DILocalVariable(name: "rlen", scope: !5, file: !4, line: 122, type: !36)
!226 = !DILocation(line: 122, column: 10, scope: !5)
!227 = !DILocalVariable(name: "pos", scope: !5, file: !4, line: 123, type: !113)
!228 = !DILocation(line: 123, column: 9, scope: !5)
!229 = !DILocalVariable(name: "len", scope: !5, file: !4, line: 123, type: !113)
!230 = !DILocation(line: 123, column: 14, scope: !5)
!231 = !DILocalVariable(name: "copysize", scope: !5, file: !4, line: 123, type: !113)
!232 = !DILocation(line: 123, column: 19, scope: !5)
!233 = !DILocalVariable(name: "buff", scope: !5, file: !4, line: 124, type: !234)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 16384, align: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 2048)
!237 = !DILocation(line: 124, column: 7, scope: !5)
!238 = !DILocalVariable(name: "done", scope: !5, file: !4, line: 125, type: !8)
!239 = !DILocation(line: 125, column: 6, scope: !5)
!240 = !DILocalVariable(name: "status", scope: !5, file: !4, line: 125, type: !8)
!241 = !DILocation(line: 125, column: 16, scope: !5)
!242 = !DILocalVariable(name: "status_running", scope: !5, file: !4, line: 125, type: !8)
!243 = !DILocation(line: 125, column: 28, scope: !5)
!244 = !DILocalVariable(name: "extbufpos", scope: !5, file: !4, line: 125, type: !8)
!245 = !DILocation(line: 125, column: 48, scope: !5)
!246 = !DILocalVariable(name: "parsestate", scope: !5, file: !4, line: 126, type: !3)
!247 = !DILocation(line: 126, column: 53, scope: !5)
!248 = !DILocation(line: 128, column: 6, scope: !249)
!249 = distinct !DILexicalBlock(scope: !5, file: !4, line: 128, column: 6)
!250 = !DILocation(line: 128, column: 28, scope: !249)
!251 = !DILocation(line: 128, column: 6, scope: !5)
!252 = !DILocation(line: 129, column: 3, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !4, line: 128, column: 34)
!254 = !DILocation(line: 130, column: 3, scope: !253)
!255 = !DILocation(line: 137, column: 6, scope: !5)
!256 = !DILocation(line: 138, column: 6, scope: !5)
!257 = !DILocation(line: 139, column: 13, scope: !5)
!258 = !DILocation(line: 140, column: 12, scope: !5)
!259 = !DILocation(line: 141, column: 2, scope: !5)
!260 = !DILocation(line: 141, column: 11, scope: !261)
!261 = !DILexicalBlockFile(scope: !5, file: !4, discriminator: 1)
!262 = !DILocation(line: 141, column: 16, scope: !261)
!263 = !DILocation(line: 141, column: 19, scope: !264)
!264 = !DILexicalBlockFile(scope: !5, file: !4, discriminator: 2)
!265 = !DILocation(line: 141, column: 30, scope: !264)
!266 = !DILocation(line: 141, column: 9, scope: !267)
!267 = !DILexicalBlockFile(scope: !5, file: !4, discriminator: 3)
!268 = !DILocation(line: 141, column: 2, scope: !267)
!269 = !DILocation(line: 142, column: 8, scope: !270)
!270 = distinct !DILexicalBlock(scope: !5, file: !4, line: 141, column: 48)
!271 = !DILocation(line: 143, column: 7, scope: !272)
!272 = distinct !DILexicalBlock(scope: !270, file: !4, line: 143, column: 7)
!273 = !DILocation(line: 143, column: 11, scope: !272)
!274 = !DILocation(line: 143, column: 16, scope: !272)
!275 = !DILocation(line: 144, column: 8, scope: !272)
!276 = !DILocation(line: 144, column: 12, scope: !272)
!277 = !DILocation(line: 144, column: 16, scope: !272)
!278 = !DILocation(line: 144, column: 26, scope: !279)
!279 = !DILexicalBlockFile(scope: !272, file: !4, discriminator: 1)
!280 = !DILocation(line: 144, column: 33, scope: !279)
!281 = !DILocation(line: 144, column: 31, scope: !279)
!282 = !DILocation(line: 144, column: 44, scope: !279)
!283 = !DILocation(line: 144, column: 50, scope: !279)
!284 = !DILocation(line: 144, column: 48, scope: !279)
!285 = !DILocation(line: 144, column: 19, scope: !279)
!286 = !DILocation(line: 144, column: 55, scope: !279)
!287 = !DILocation(line: 143, column: 7, scope: !288)
!288 = !DILexicalBlockFile(scope: !270, file: !4, discriminator: 1)
!289 = !DILocation(line: 145, column: 4, scope: !290)
!290 = distinct !DILexicalBlock(scope: !272, file: !4, line: 144, column: 64)
!291 = !DILocation(line: 145, column: 18, scope: !290)
!292 = !DILocation(line: 145, column: 25, scope: !290)
!293 = !DILocation(line: 145, column: 23, scope: !290)
!294 = !DILocation(line: 145, column: 30, scope: !290)
!295 = !DILocation(line: 145, column: 36, scope: !290)
!296 = !DILocation(line: 145, column: 34, scope: !290)
!297 = !DILocation(line: 146, column: 11, scope: !290)
!298 = !DILocation(line: 146, column: 8, scope: !290)
!299 = !DILocation(line: 147, column: 8, scope: !290)
!300 = !DILocation(line: 148, column: 17, scope: !301)
!301 = distinct !DILexicalBlock(scope: !290, file: !4, line: 148, column: 8)
!302 = !DILocation(line: 148, column: 26, scope: !301)
!303 = !DILocation(line: 148, column: 35, scope: !301)
!304 = !DILocation(line: 148, column: 41, scope: !301)
!305 = !DILocation(line: 149, column: 16, scope: !301)
!306 = !DILocation(line: 149, column: 25, scope: !301)
!307 = !DILocation(line: 149, column: 34, scope: !301)
!308 = !DILocation(line: 148, column: 8, scope: !309)
!309 = !DILexicalBlockFile(scope: !290, file: !4, discriminator: 1)
!310 = !DILocation(line: 150, column: 33, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !4, line: 150, column: 9)
!312 = distinct !DILexicalBlock(scope: !301, file: !4, line: 149, column: 40)
!313 = !DILocation(line: 150, column: 38, scope: !311)
!314 = !DILocation(line: 150, column: 45, scope: !311)
!315 = !DILocation(line: 150, column: 43, scope: !311)
!316 = !DILocation(line: 150, column: 65, scope: !311)
!317 = !DILocation(line: 150, column: 63, scope: !311)
!318 = !DILocation(line: 150, column: 50, scope: !311)
!319 = !DILocation(line: 150, column: 17, scope: !311)
!320 = !DILocation(line: 150, column: 15, scope: !311)
!321 = !DILocation(line: 150, column: 71, scope: !311)
!322 = !DILocation(line: 150, column: 9, scope: !312)
!323 = !DILocation(line: 151, column: 22, scope: !324)
!324 = distinct !DILexicalBlock(scope: !311, file: !4, line: 150, column: 78)
!325 = !DILocation(line: 151, column: 6, scope: !326)
!326 = !DILexicalBlockFile(scope: !324, file: !4, discriminator: 1)
!327 = !DILocation(line: 152, column: 1, scope: !324)
!328 = !DILocation(line: 153, column: 6, scope: !324)
!329 = !DILocation(line: 155, column: 4, scope: !312)
!330 = !DILocation(line: 156, column: 22, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !4, line: 156, column: 9)
!332 = distinct !DILexicalBlock(scope: !301, file: !4, line: 155, column: 11)
!333 = !DILocation(line: 156, column: 26, scope: !331)
!334 = !DILocation(line: 156, column: 33, scope: !331)
!335 = !DILocation(line: 156, column: 31, scope: !331)
!336 = !DILocation(line: 156, column: 53, scope: !331)
!337 = !DILocation(line: 156, column: 51, scope: !331)
!338 = !DILocation(line: 156, column: 17, scope: !331)
!339 = !DILocation(line: 156, column: 15, scope: !331)
!340 = !DILocation(line: 156, column: 59, scope: !331)
!341 = !DILocation(line: 156, column: 9, scope: !332)
!342 = !DILocation(line: 156, column: 32, scope: !343)
!343 = !DILexicalBlockFile(scope: !344, file: !4, discriminator: 1)
!344 = distinct !DILexicalBlock(scope: !331, file: !4, line: 156, column: 66)
!345 = !DILocation(line: 156, column: 31, scope: !343)
!346 = !DILocation(line: 157, column: 22, scope: !344)
!347 = !DILocation(line: 157, column: 6, scope: !343)
!348 = !DILocation(line: 157, column: 1, scope: !349)
!349 = !DILexicalBlockFile(scope: !344, file: !4, discriminator: 2)
!350 = !DILocation(line: 158, column: 6, scope: !344)
!351 = !DILocation(line: 161, column: 11, scope: !290)
!352 = !DILocation(line: 161, column: 8, scope: !290)
!353 = !DILocation(line: 163, column: 32, scope: !290)
!354 = !DILocation(line: 163, column: 30, scope: !290)
!355 = !DILocation(line: 163, column: 47, scope: !290)
!356 = !DILocation(line: 163, column: 13, scope: !290)
!357 = !DILocation(line: 164, column: 8, scope: !358)
!358 = distinct !DILexicalBlock(scope: !290, file: !4, line: 164, column: 8)
!359 = !DILocation(line: 164, column: 19, scope: !358)
!360 = !DILocation(line: 164, column: 17, scope: !358)
!361 = !DILocation(line: 164, column: 8, scope: !290)
!362 = !DILocation(line: 165, column: 16, scope: !358)
!363 = !DILocation(line: 165, column: 14, scope: !358)
!364 = !DILocation(line: 165, column: 5, scope: !358)
!365 = !DILocation(line: 166, column: 20, scope: !290)
!366 = !DILocation(line: 166, column: 26, scope: !290)
!367 = !DILocation(line: 166, column: 4, scope: !290)
!368 = !DILocation(line: 167, column: 3, scope: !290)
!369 = !DILocation(line: 174, column: 7, scope: !370)
!370 = distinct !DILexicalBlock(scope: !270, file: !4, line: 174, column: 7)
!371 = !DILocation(line: 174, column: 21, scope: !370)
!372 = !DILocation(line: 174, column: 32, scope: !370)
!373 = !DILocation(line: 174, column: 17, scope: !370)
!374 = !DILocation(line: 174, column: 37, scope: !370)
!375 = !DILocation(line: 174, column: 40, scope: !376)
!376 = !DILexicalBlockFile(scope: !370, file: !4, discriminator: 1)
!377 = !DILocation(line: 174, column: 45, scope: !376)
!378 = !DILocation(line: 174, column: 49, scope: !376)
!379 = !DILocation(line: 174, column: 52, scope: !380)
!380 = !DILexicalBlockFile(scope: !370, file: !4, discriminator: 2)
!381 = !DILocation(line: 174, column: 63, scope: !380)
!382 = !DILocation(line: 174, column: 67, scope: !380)
!383 = !DILocation(line: 174, column: 70, scope: !384)
!384 = !DILexicalBlockFile(scope: !370, file: !4, discriminator: 3)
!385 = !DILocation(line: 174, column: 77, scope: !384)
!386 = !DILocation(line: 174, column: 7, scope: !384)
!387 = !DILocation(line: 175, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !4, line: 175, column: 7)
!389 = distinct !DILexicalBlock(scope: !370, file: !4, line: 173, column: 85)
!390 = !DILocation(line: 175, column: 19, scope: !388)
!391 = !DILocation(line: 175, column: 17, scope: !388)
!392 = !DILocation(line: 175, column: 27, scope: !388)
!393 = !DILocation(line: 175, column: 38, scope: !388)
!394 = !DILocation(line: 175, column: 26, scope: !388)
!395 = !DILocation(line: 175, column: 24, scope: !388)
!396 = !DILocation(line: 175, column: 7, scope: !389)
!397 = !DILocation(line: 176, column: 12, scope: !398)
!398 = distinct !DILexicalBlock(scope: !388, file: !4, line: 175, column: 44)
!399 = !DILocation(line: 176, column: 25, scope: !398)
!400 = !DILocation(line: 176, column: 23, scope: !398)
!401 = !DILocation(line: 176, column: 10, scope: !398)
!402 = !DILocation(line: 177, column: 4, scope: !398)
!403 = !DILocation(line: 178, column: 11, scope: !389)
!404 = !DILocation(line: 178, column: 20, scope: !389)
!405 = !DILocation(line: 178, column: 18, scope: !389)
!406 = !DILocation(line: 178, column: 31, scope: !389)
!407 = !DILocation(line: 178, column: 38, scope: !389)
!408 = !DILocation(line: 178, column: 36, scope: !389)
!409 = !DILocation(line: 178, column: 44, scope: !389)
!410 = !DILocation(line: 178, column: 42, scope: !389)
!411 = !DILocation(line: 178, column: 50, scope: !389)
!412 = !DILocation(line: 178, column: 4, scope: !389)
!413 = !DILocation(line: 179, column: 17, scope: !389)
!414 = !DILocation(line: 179, column: 14, scope: !389)
!415 = !DILocation(line: 180, column: 3, scope: !389)
!416 = !DILocation(line: 182, column: 7, scope: !417)
!417 = distinct !DILexicalBlock(scope: !270, file: !4, line: 182, column: 7)
!418 = !DILocation(line: 182, column: 14, scope: !417)
!419 = !DILocation(line: 182, column: 11, scope: !417)
!420 = !DILocation(line: 182, column: 7, scope: !270)
!421 = !DILocation(line: 183, column: 4, scope: !417)
!422 = distinct !{!422, !259}
!423 = !DILocation(line: 185, column: 11, scope: !270)
!424 = !DILocation(line: 185, column: 3, scope: !270)
!425 = !DILocation(line: 187, column: 4, scope: !426)
!426 = distinct !DILexicalBlock(scope: !270, file: !4, line: 185, column: 23)
!427 = !DILocation(line: 187, column: 11, scope: !428)
!428 = !DILexicalBlockFile(scope: !429, file: !4, discriminator: 1)
!429 = distinct !DILexicalBlock(scope: !430, file: !4, line: 187, column: 4)
!430 = distinct !DILexicalBlock(scope: !426, file: !4, line: 187, column: 4)
!431 = !DILocation(line: 187, column: 17, scope: !428)
!432 = !DILocation(line: 187, column: 15, scope: !428)
!433 = !DILocation(line: 187, column: 4, scope: !428)
!434 = !DILocation(line: 188, column: 13, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !4, line: 188, column: 8)
!436 = distinct !DILexicalBlock(scope: !429, file: !4, line: 187, column: 29)
!437 = !DILocation(line: 188, column: 8, scope: !435)
!438 = !DILocation(line: 188, column: 29, scope: !435)
!439 = !DILocation(line: 188, column: 9, scope: !435)
!440 = !DILocation(line: 188, column: 11, scope: !435)
!441 = !DILocation(line: 188, column: 10, scope: !435)
!442 = !DILocation(line: 188, column: 12, scope: !435)
!443 = !DILocation(line: 188, column: 8, scope: !436)
!444 = !DILocation(line: 189, column: 23, scope: !445)
!445 = distinct !DILexicalBlock(scope: !435, file: !4, line: 188, column: 28)
!446 = !DILocation(line: 189, column: 38, scope: !445)
!447 = !DILocation(line: 189, column: 51, scope: !445)
!448 = !DILocation(line: 189, column: 46, scope: !445)
!449 = !DILocation(line: 189, column: 56, scope: !445)
!450 = !DILocation(line: 189, column: 43, scope: !445)
!451 = !DILocation(line: 189, column: 21, scope: !445)
!452 = !DILocation(line: 190, column: 5, scope: !445)
!453 = !DILocation(line: 191, column: 15, scope: !454)
!454 = distinct !DILexicalBlock(scope: !435, file: !4, line: 190, column: 12)
!455 = !DILocation(line: 191, column: 13, scope: !454)
!456 = !DILocation(line: 192, column: 21, scope: !454)
!457 = !DILocation(line: 193, column: 17, scope: !454)
!458 = !DILocation(line: 194, column: 6, scope: !454)
!459 = !DILocation(line: 196, column: 4, scope: !436)
!460 = !DILocation(line: 187, column: 25, scope: !461)
!461 = !DILexicalBlockFile(scope: !429, file: !4, discriminator: 2)
!462 = !DILocation(line: 187, column: 4, scope: !461)
!463 = distinct !{!463, !425}
!464 = !DILocation(line: 197, column: 4, scope: !426)
!465 = !DILocation(line: 200, column: 17, scope: !426)
!466 = !DILocation(line: 200, column: 12, scope: !426)
!467 = !DILocation(line: 200, column: 4, scope: !426)
!468 = !DILocation(line: 202, column: 10, scope: !469)
!469 = distinct !DILexicalBlock(scope: !426, file: !4, line: 200, column: 23)
!470 = !DILocation(line: 203, column: 5, scope: !469)
!471 = !DILocation(line: 208, column: 5, scope: !469)
!472 = !DILocation(line: 211, column: 5, scope: !469)
!473 = !DILocation(line: 212, column: 1, scope: !469)
!474 = !DILocation(line: 213, column: 5, scope: !469)
!475 = !DILocation(line: 216, column: 7, scope: !426)
!476 = !DILocation(line: 217, column: 15, scope: !426)
!477 = !DILocation(line: 218, column: 4, scope: !426)
!478 = !DILocation(line: 222, column: 4, scope: !426)
!479 = !DILocation(line: 222, column: 11, scope: !480)
!480 = !DILexicalBlockFile(scope: !481, file: !4, discriminator: 1)
!481 = distinct !DILexicalBlock(scope: !482, file: !4, line: 222, column: 4)
!482 = distinct !DILexicalBlock(scope: !426, file: !4, line: 222, column: 4)
!483 = !DILocation(line: 222, column: 17, scope: !480)
!484 = !DILocation(line: 222, column: 15, scope: !480)
!485 = !DILocation(line: 222, column: 4, scope: !480)
!486 = !DILocation(line: 223, column: 14, scope: !487)
!487 = distinct !DILexicalBlock(scope: !488, file: !4, line: 223, column: 9)
!488 = distinct !DILexicalBlock(scope: !481, file: !4, line: 222, column: 29)
!489 = !DILocation(line: 223, column: 9, scope: !487)
!490 = !DILocation(line: 223, column: 19, scope: !487)
!491 = !DILocation(line: 223, column: 9, scope: !488)
!492 = !DILocation(line: 224, column: 9, scope: !493)
!493 = distinct !DILexicalBlock(scope: !487, file: !4, line: 223, column: 28)
!494 = !DILocation(line: 225, column: 17, scope: !493)
!495 = !DILocation(line: 226, column: 6, scope: !493)
!496 = !DILocation(line: 228, column: 4, scope: !488)
!497 = !DILocation(line: 222, column: 25, scope: !498)
!498 = !DILexicalBlockFile(scope: !481, file: !4, discriminator: 2)
!499 = !DILocation(line: 222, column: 4, scope: !498)
!500 = distinct !{!500, !478}
!501 = !DILocation(line: 229, column: 3, scope: !426)
!502 = !DILocation(line: 141, column: 2, scope: !503)
!503 = !DILexicalBlockFile(scope: !5, file: !4, discriminator: 4)
!504 = !DILocation(line: 233, column: 2, scope: !5)
!505 = !DILocation(line: 236, column: 2, scope: !5)
!506 = !DILocation(line: 236, column: 9, scope: !261)
!507 = !DILocation(line: 236, column: 19, scope: !261)
!508 = !DILocation(line: 236, column: 24, scope: !261)
!509 = !DILocation(line: 236, column: 49, scope: !264)
!510 = !DILocation(line: 236, column: 64, scope: !264)
!511 = !DILocation(line: 236, column: 42, scope: !264)
!512 = !DILocation(line: 236, column: 27, scope: !513)
!513 = !DILexicalBlockFile(scope: !264, file: !4, discriminator: 5)
!514 = !DILocation(line: 236, column: 70, scope: !264)
!515 = !DILocation(line: 236, column: 2, scope: !267)
!516 = !DILocation(line: 237, column: 10, scope: !5)
!517 = !DILocation(line: 237, column: 25, scope: !5)
!518 = !DILocation(line: 237, column: 3, scope: !5)
!519 = !DILocation(line: 237, column: 30, scope: !5)
!520 = !DILocation(line: 236, column: 2, scope: !503)
!521 = distinct !{!521, !505}
!522 = !DILocation(line: 239, column: 10, scope: !5)
!523 = !DILocation(line: 239, column: 16, scope: !5)
!524 = !DILocation(line: 239, column: 2, scope: !5)
!525 = !DILocation(line: 242, column: 2, scope: !5)
!526 = !DILocation(line: 243, column: 2, scope: !5)
!527 = !DILocation(line: 244, column: 1, scope: !5)
!528 = distinct !DISubprogram(name: "deliver_remote", scope: !4, file: !4, line: 489, type: !529, isLocal: false, isDefinition: true, scopeLine: 490, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !11)
!529 = !DISubroutineType(types: !530)
!530 = !{!8, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qitem", file: !533, line: 105, size: 640, align: 64, elements: !534)
!533 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!534 = !{!535, !541, !542, !543, !544, !545, !546, !597, !598}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !533, line: 106, baseType: !536, size: 128, align: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !533, line: 106, size: 128, align: 64, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !536, file: !533, line: 106, baseType: !531, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !536, file: !533, line: 106, baseType: !540, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !532, file: !533, line: 107, baseType: !32, size: 64, align: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !532, file: !533, line: 108, baseType: !9, size: 64, align: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "queuefn", scope: !532, file: !533, line: 109, baseType: !9, size: 64, align: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mailfn", scope: !532, file: !533, line: 110, baseType: !9, size: 64, align: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "queueid", scope: !532, file: !533, line: 111, baseType: !9, size: 64, align: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "queuef", scope: !532, file: !533, line: 112, baseType: !547, size: 64, align: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !92, line: 48, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !550, line: 241, size: 1728, align: 64, elements: !551)
!550 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !572, !573, !574, !575, !577, !578, !580, !582, !585, !587, !588, !589, !590, !591, !592, !593}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !549, file: !550, line: 242, baseType: !8, size: 32, align: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !549, file: !550, line: 247, baseType: !9, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !549, file: !550, line: 248, baseType: !9, size: 64, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !549, file: !550, line: 249, baseType: !9, size: 64, align: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !549, file: !550, line: 250, baseType: !9, size: 64, align: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !549, file: !550, line: 251, baseType: !9, size: 64, align: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !549, file: !550, line: 252, baseType: !9, size: 64, align: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !549, file: !550, line: 253, baseType: !9, size: 64, align: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !549, file: !550, line: 254, baseType: !9, size: 64, align: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !549, file: !550, line: 256, baseType: !9, size: 64, align: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !549, file: !550, line: 257, baseType: !9, size: 64, align: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !549, file: !550, line: 258, baseType: !9, size: 64, align: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !549, file: !550, line: 260, baseType: !565, size: 64, align: 64, offset: 768)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !550, line: 156, size: 192, align: 64, elements: !567)
!567 = !{!568, !569, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !566, file: !550, line: 157, baseType: !565, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !566, file: !550, line: 158, baseType: !570, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !566, file: !550, line: 162, baseType: !8, size: 32, align: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !549, file: !550, line: 262, baseType: !570, size: 64, align: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !549, file: !550, line: 264, baseType: !8, size: 32, align: 32, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !549, file: !550, line: 268, baseType: !8, size: 32, align: 32, offset: 928)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !549, file: !550, line: 270, baseType: !576, size: 64, align: 64, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !39, line: 131, baseType: !40)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !549, file: !550, line: 274, baseType: !35, size: 16, align: 16, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !549, file: !550, line: 275, baseType: !579, size: 8, align: 8, offset: 1040)
!579 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !549, file: !550, line: 276, baseType: !581, size: 8, align: 8, offset: 1048)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, align: 8, elements: !104)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !549, file: !550, line: 280, baseType: !583, size: 64, align: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !550, line: 150, baseType: null)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !549, file: !550, line: 289, baseType: !586, size: 64, align: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !39, line: 132, baseType: !40)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !549, file: !550, line: 297, baseType: !34, size: 64, align: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !549, file: !550, line: 298, baseType: !34, size: 64, align: 64, offset: 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !549, file: !550, line: 299, baseType: !34, size: 64, align: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !549, file: !550, line: 300, baseType: !34, size: 64, align: 64, offset: 1408)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !549, file: !550, line: 302, baseType: !113, size: 64, align: 64, offset: 1472)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !549, file: !550, line: 303, baseType: !8, size: 32, align: 32, offset: 1536)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !549, file: !550, line: 305, baseType: !594, size: 160, align: 8, offset: 1568)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, align: 8, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 20)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mailf", scope: !532, file: !533, line: 113, baseType: !547, size: 64, align: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !532, file: !533, line: 114, baseType: !8, size: 32, align: 32, offset: 576)
!599 = !DILocalVariable(name: "it", arg: 1, scope: !528, file: !4, line: 489, type: !531)
!600 = !DILocation(line: 489, column: 30, scope: !528)
!601 = !DILocalVariable(name: "hosts", scope: !528, file: !4, line: 491, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mx_hostentry", file: !533, line: 152, size: 10048, align: 64, elements: !604)
!604 = !{!605, !609, !613, !614, !629}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !603, file: !533, line: 153, baseType: !606, size: 8200, align: 8)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8200, align: 8, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 1025)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !603, file: !533, line: 154, baseType: !610, size: 368, align: 8, offset: 8200)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 368, align: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 46)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pref", scope: !603, file: !533, line: 155, baseType: !8, size: 32, align: 32, offset: 8576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ai", scope: !603, file: !533, line: 156, baseType: !615, size: 384, align: 64, offset: 8640)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !616, line: 567, size: 384, align: 64, elements: !617)
!616 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/dma/task1")
!617 = !{!618, !619, !620, !621, !622, !625, !626, !627}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !615, file: !616, line: 569, baseType: !8, size: 32, align: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !615, file: !616, line: 570, baseType: !8, size: 32, align: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !615, file: !616, line: 571, baseType: !8, size: 32, align: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !615, file: !616, line: 572, baseType: !8, size: 32, align: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !615, file: !616, line: 573, baseType: !623, size: 32, align: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !43, line: 33, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !39, line: 189, baseType: !100)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !615, file: !616, line: 574, baseType: !41, size: 64, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !615, file: !616, line: 575, baseType: !9, size: 64, align: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !615, file: !616, line: 576, baseType: !628, size: 64, align: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !603, file: !533, line: 157, baseType: !630, size: 1024, align: 64, offset: 9024)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !43, line: 166, size: 1024, align: 64, elements: !631)
!631 = !{!632, !633, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !630, file: !43, line: 168, baseType: !46, size: 16, align: 16)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !630, file: !43, line: 169, baseType: !634, size: 944, align: 8, offset: 16)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 944, align: 8, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 118)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !630, file: !43, line: 170, baseType: !115, size: 64, align: 64, offset: 960)
!638 = !DILocation(line: 491, column: 23, scope: !528)
!639 = !DILocalVariable(name: "h", scope: !528, file: !4, line: 491, type: !602)
!640 = !DILocation(line: 491, column: 31, scope: !528)
!641 = !DILocalVariable(name: "host", scope: !528, file: !4, line: 492, type: !32)
!642 = !DILocation(line: 492, column: 14, scope: !528)
!643 = !DILocalVariable(name: "port", scope: !528, file: !4, line: 493, type: !8)
!644 = !DILocation(line: 493, column: 6, scope: !528)
!645 = !DILocalVariable(name: "error", scope: !528, file: !4, line: 494, type: !8)
!646 = !DILocation(line: 494, column: 6, scope: !528)
!647 = !DILocalVariable(name: "smarthost", scope: !528, file: !4, line: 494, type: !8)
!648 = !DILocation(line: 494, column: 17, scope: !528)
!649 = !DILocation(line: 496, column: 17, scope: !528)
!650 = !DILocation(line: 496, column: 21, scope: !528)
!651 = !DILocation(line: 496, column: 9, scope: !528)
!652 = !DILocation(line: 496, column: 7, scope: !528)
!653 = !DILocation(line: 498, column: 6, scope: !654)
!654 = distinct !DILexicalBlock(scope: !528, file: !4, line: 498, column: 6)
!655 = !DILocation(line: 498, column: 11, scope: !654)
!656 = !DILocation(line: 498, column: 6, scope: !528)
!657 = !DILocation(line: 500, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !4, line: 498, column: 19)
!659 = !DILocation(line: 500, column: 11, scope: !658)
!660 = !DILocation(line: 499, column: 3, scope: !658)
!661 = !DILocation(line: 501, column: 3, scope: !658)
!662 = !DILocation(line: 504, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !654, file: !4, line: 502, column: 9)
!664 = !DILocation(line: 507, column: 7, scope: !528)
!665 = !DILocation(line: 510, column: 13, scope: !666)
!666 = distinct !DILexicalBlock(scope: !528, file: !4, line: 510, column: 6)
!667 = !DILocation(line: 510, column: 23, scope: !666)
!668 = !DILocation(line: 510, column: 6, scope: !528)
!669 = !DILocation(line: 511, column: 17, scope: !670)
!670 = distinct !DILexicalBlock(scope: !666, file: !4, line: 510, column: 31)
!671 = !DILocation(line: 511, column: 8, scope: !670)
!672 = !DILocation(line: 512, column: 17, scope: !670)
!673 = !DILocation(line: 512, column: 8, scope: !670)
!674 = !DILocation(line: 513, column: 46, scope: !670)
!675 = !DILocation(line: 513, column: 52, scope: !670)
!676 = !DILocation(line: 513, column: 3, scope: !670)
!677 = !DILocation(line: 514, column: 13, scope: !670)
!678 = !DILocation(line: 515, column: 2, scope: !670)
!679 = !DILocation(line: 517, column: 26, scope: !528)
!680 = !DILocation(line: 517, column: 32, scope: !528)
!681 = !DILocation(line: 517, column: 46, scope: !528)
!682 = !DILocation(line: 517, column: 10, scope: !528)
!683 = !DILocation(line: 517, column: 8, scope: !528)
!684 = !DILocation(line: 518, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !528, file: !4, line: 518, column: 6)
!686 = !DILocation(line: 518, column: 6, scope: !528)
!687 = !DILocation(line: 519, column: 77, scope: !688)
!688 = distinct !DILexicalBlock(scope: !685, file: !4, line: 518, column: 13)
!689 = !DILocation(line: 519, column: 3, scope: !688)
!690 = !DILocation(line: 521, column: 10, scope: !688)
!691 = !DILocation(line: 521, column: 16, scope: !688)
!692 = !DILocation(line: 522, column: 10, scope: !688)
!693 = !DILocation(line: 520, column: 3, scope: !688)
!694 = !DILocation(line: 523, column: 11, scope: !688)
!695 = !DILocation(line: 523, column: 3, scope: !688)
!696 = !DILocation(line: 526, column: 11, scope: !697)
!697 = distinct !DILexicalBlock(scope: !528, file: !4, line: 526, column: 2)
!698 = !DILocation(line: 526, column: 9, scope: !697)
!699 = !DILocation(line: 526, column: 7, scope: !697)
!700 = !DILocation(line: 526, column: 19, scope: !701)
!701 = !DILexicalBlockFile(scope: !702, file: !4, discriminator: 1)
!702 = distinct !DILexicalBlock(scope: !697, file: !4, line: 526, column: 2)
!703 = !DILocation(line: 526, column: 22, scope: !701)
!704 = !DILocation(line: 526, column: 18, scope: !701)
!705 = !DILocation(line: 526, column: 27, scope: !701)
!706 = !DILocation(line: 526, column: 2, scope: !701)
!707 = !DILocation(line: 527, column: 27, scope: !708)
!708 = distinct !DILexicalBlock(scope: !702, file: !4, line: 526, column: 38)
!709 = !DILocation(line: 527, column: 31, scope: !708)
!710 = !DILocation(line: 527, column: 11, scope: !708)
!711 = !DILocation(line: 527, column: 3, scope: !708)
!712 = !DILocation(line: 530, column: 10, scope: !713)
!713 = distinct !DILexicalBlock(scope: !708, file: !4, line: 527, column: 35)
!714 = !DILocation(line: 531, column: 4, scope: !713)
!715 = !DILocation(line: 534, column: 10, scope: !713)
!716 = !DILocation(line: 535, column: 4, scope: !713)
!717 = !DILocation(line: 538, column: 10, scope: !713)
!718 = !DILocation(line: 539, column: 4, scope: !713)
!719 = !DILocation(line: 541, column: 2, scope: !708)
!720 = !DILocation(line: 526, column: 34, scope: !721)
!721 = !DILexicalBlockFile(scope: !702, file: !4, discriminator: 2)
!722 = !DILocation(line: 526, column: 2, scope: !721)
!723 = distinct !{!723, !724}
!724 = !DILocation(line: 526, column: 2, scope: !528)
!725 = !DILocation(line: 541, column: 2, scope: !726)
!726 = !DILexicalBlockFile(scope: !697, file: !4, discriminator: 1)
!727 = !DILocation(line: 543, column: 7, scope: !528)
!728 = !DILocation(line: 543, column: 2, scope: !528)
!729 = !DILocation(line: 545, column: 10, scope: !528)
!730 = !DILocation(line: 545, column: 2, scope: !528)
!731 = !DILocation(line: 546, column: 1, scope: !528)
!732 = distinct !DISubprogram(name: "deliver_to_host", scope: !4, file: !4, line: 351, type: !733, isLocal: true, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !11)
!733 = !DISubroutineType(types: !734)
!734 = !{!8, !531, !602}
!735 = !DILocalVariable(name: "it", arg: 1, scope: !732, file: !4, line: 351, type: !531)
!736 = !DILocation(line: 351, column: 31, scope: !732)
!737 = !DILocalVariable(name: "host", arg: 2, scope: !732, file: !4, line: 351, type: !602)
!738 = !DILocation(line: 351, column: 56, scope: !732)
!739 = !DILocalVariable(name: "a", scope: !732, file: !4, line: 353, type: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "authuser", file: !533, line: 143, size: 256, align: 64, elements: !742)
!742 = !{!743, !747, !748, !749}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !533, line: 144, baseType: !744, size: 64, align: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !741, file: !533, line: 144, size: 64, align: 64, elements: !745)
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sle_next", scope: !744, file: !533, line: 144, baseType: !740, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "login", scope: !741, file: !533, line: 145, baseType: !9, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !741, file: !533, line: 146, baseType: !9, size: 64, align: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !741, file: !533, line: 147, baseType: !9, size: 64, align: 64, offset: 192)
!750 = !DILocation(line: 353, column: 19, scope: !732)
!751 = !DILocalVariable(name: "line", scope: !732, file: !4, line: 354, type: !752)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8000, align: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 1000)
!755 = !DILocation(line: 354, column: 7, scope: !732)
!756 = !DILocalVariable(name: "linelen", scope: !732, file: !4, line: 355, type: !113)
!757 = !DILocation(line: 355, column: 9, scope: !732)
!758 = !DILocalVariable(name: "fd", scope: !732, file: !4, line: 356, type: !8)
!759 = !DILocation(line: 356, column: 6, scope: !732)
!760 = !DILocalVariable(name: "error", scope: !732, file: !4, line: 356, type: !8)
!761 = !DILocation(line: 356, column: 10, scope: !732)
!762 = !DILocalVariable(name: "do_auth", scope: !732, file: !4, line: 356, type: !8)
!763 = !DILocation(line: 356, column: 21, scope: !732)
!764 = !DILocalVariable(name: "res", scope: !732, file: !4, line: 356, type: !8)
!765 = !DILocation(line: 356, column: 34, scope: !732)
!766 = !DILocation(line: 358, column: 12, scope: !767)
!767 = distinct !DILexicalBlock(scope: !732, file: !4, line: 358, column: 6)
!768 = !DILocation(line: 358, column: 16, scope: !767)
!769 = !DILocation(line: 358, column: 6, scope: !767)
!770 = !DILocation(line: 358, column: 35, scope: !767)
!771 = !DILocation(line: 358, column: 6, scope: !732)
!772 = !DILocation(line: 359, column: 66, scope: !773)
!773 = distinct !DILexicalBlock(scope: !767, file: !4, line: 358, column: 41)
!774 = !DILocation(line: 359, column: 65, scope: !773)
!775 = !DILocation(line: 359, column: 56, scope: !776)
!776 = !DILexicalBlockFile(scope: !773, file: !4, discriminator: 1)
!777 = !DILocation(line: 359, column: 3, scope: !778)
!778 = !DILexicalBlockFile(scope: !773, file: !4, discriminator: 2)
!779 = !DILocation(line: 360, column: 3, scope: !773)
!780 = !DILocation(line: 363, column: 23, scope: !732)
!781 = !DILocation(line: 363, column: 7, scope: !732)
!782 = !DILocation(line: 363, column: 5, scope: !732)
!783 = !DILocation(line: 364, column: 6, scope: !784)
!784 = distinct !DILexicalBlock(scope: !732, file: !4, line: 364, column: 6)
!785 = !DILocation(line: 364, column: 9, scope: !784)
!786 = !DILocation(line: 364, column: 6, scope: !732)
!787 = !DILocation(line: 365, column: 3, scope: !784)
!788 = !DILocation(line: 382, column: 14, scope: !789)
!789 = distinct !DILexicalBlock(scope: !732, file: !4, line: 382, column: 6)
!790 = !DILocation(line: 382, column: 23, scope: !789)
!791 = !DILocation(line: 382, column: 32, scope: !789)
!792 = !DILocation(line: 382, column: 37, scope: !789)
!793 = !DILocation(line: 383, column: 14, scope: !789)
!794 = !DILocation(line: 383, column: 23, scope: !789)
!795 = !DILocation(line: 383, column: 32, scope: !789)
!796 = !DILocation(line: 382, column: 6, scope: !797)
!797 = !DILexicalBlockFile(scope: !732, file: !4, discriminator: 1)
!798 = !DILocation(line: 384, column: 19, scope: !799)
!799 = distinct !DILexicalBlock(scope: !789, file: !4, line: 383, column: 38)
!800 = !DILocation(line: 385, column: 21, scope: !799)
!801 = !DILocation(line: 385, column: 9, scope: !799)
!802 = !DILocation(line: 385, column: 7, scope: !799)
!803 = !DILocation(line: 385, column: 9, scope: !804)
!804 = distinct !DILexicalBlock(scope: !799, file: !4, line: 385, column: 9)
!805 = !DILocation(line: 385, column: 13, scope: !804)
!806 = !DILocation(line: 385, column: 54, scope: !807)
!807 = !DILexicalBlockFile(scope: !808, file: !4, discriminator: 1)
!808 = distinct !DILexicalBlock(scope: !804, file: !4, line: 385, column: 19)
!809 = !DILocation(line: 385, column: 60, scope: !807)
!810 = !DILocation(line: 385, column: 66, scope: !807)
!811 = !DILocation(line: 385, column: 72, scope: !807)
!812 = !DILocation(line: 385, column: 21, scope: !807)
!813 = !DILocation(line: 385, column: 167, scope: !807)
