; ModuleID = './line11-spool.o.i'
source_filename = "./line11-spool.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.config = type { i8*, i32, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, %struct.ssl_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18)
!1 = !DIFile(filename: "line11-spool.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/dma/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !21, line: 135, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dma/task1")
!22 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !21, line: 122, baseType: !22)
!24 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!25 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!26 = !{i32 2, !"Dwarf Version", i32 4}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!29 = distinct !DISubprogram(name: "newspoolf", scope: !30, file: !30, line: 71, type: !31, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!30 = !DIFile(filename: "spool.c", directory: "/home/lichi/Desktop/dma/task1")
!31 = !DISubroutineType(types: !32)
!32 = !{!24, !33}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue", file: !35, line: 118, size: 320, align: 64, elements: !36)
!35 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!36 = !{!37, !119, !120, !121, !122}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !34, file: !35, line: 119, baseType: !38, size: 64, align: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queueh", file: !35, line: 116, size: 64, align: 64, elements: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !38, file: !35, line: 116, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qitem", file: !35, line: 105, size: 640, align: 64, elements: !43)
!43 = !{!44, !50, !54, !56, !57, !58, !59, !117, !118}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !35, line: 106, baseType: !45, size: 128, align: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !42, file: !35, line: 106, size: 128, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !45, file: !35, line: 106, baseType: !41, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !45, file: !35, line: 106, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !42, file: !35, line: 107, baseType: !51, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !42, file: !35, line: 108, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "queuefn", scope: !42, file: !35, line: 109, baseType: !55, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mailfn", scope: !42, file: !35, line: 110, baseType: !55, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "queueid", scope: !42, file: !35, line: 111, baseType: !55, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "queuef", scope: !42, file: !35, line: 112, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 241, size: 1728, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !93, !94, !96, !100, !103, !105, !106, !107, !108, !109, !112, !113}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 242, baseType: !24, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 247, baseType: !55, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 248, baseType: !55, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 249, baseType: !55, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 250, baseType: !55, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 251, baseType: !55, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 252, baseType: !55, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 253, baseType: !55, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 254, baseType: !55, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 256, baseType: !55, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 257, baseType: !55, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 258, baseType: !55, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 260, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 156, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !64, line: 157, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !64, line: 158, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !64, line: 162, baseType: !24, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 262, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 264, baseType: !24, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 268, baseType: !24, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 270, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !91, line: 131, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!92 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 274, baseType: !25, size: 16, align: 16, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 275, baseType: !95, size: 8, align: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 276, baseType: !97, size: 8, align: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, align: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 280, baseType: !101, size: 64, align: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 150, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 289, baseType: !104, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !91, line: 132, baseType: !92)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 297, baseType: !19, size: 64, align: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 298, baseType: !19, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 299, baseType: !19, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 300, baseType: !19, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 302, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 216, baseType: !22)
!111 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 303, baseType: !24, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 305, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mailf", scope: !42, file: !35, line: 113, baseType: !60, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !42, file: !35, line: 114, baseType: !24, size: 32, align: 32, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !34, file: !35, line: 120, baseType: !55, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mailf", scope: !34, file: !35, line: 121, baseType: !60, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tmpf", scope: !34, file: !35, line: 122, baseType: !55, size: 64, align: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !34, file: !35, line: 123, baseType: !51, size: 64, align: 64, offset: 256)
!123 = !{}
!124 = !DILocalVariable(name: "queue", arg: 1, scope: !29, file: !30, line: 71, type: !33)
!125 = !DIExpression()
!126 = !DILocation(line: 71, column: 25, scope: !29)
!127 = !DILocalVariable(name: "fn", scope: !29, file: !30, line: 73, type: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32776, align: 8, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 4097)
!131 = !DILocation(line: 73, column: 7, scope: !29)
!132 = !DILocalVariable(name: "st", scope: !29, file: !30, line: 74, type: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !134, line: 46, size: 1152, align: 64, elements: !135)
!134 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dma/task1")
!135 = !{!136, !138, !140, !142, !145, !147, !149, !150, !151, !152, !154, !156, !164, !165, !166}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !133, file: !134, line: 48, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !91, line: 124, baseType: !22)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !133, file: !134, line: 53, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !91, line: 127, baseType: !22)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !133, file: !134, line: 61, baseType: !141, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !91, line: 130, baseType: !22)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !133, file: !134, line: 62, baseType: !143, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !91, line: 129, baseType: !144)
!144 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !133, file: !134, line: 64, baseType: !146, size: 32, align: 32, offset: 224)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !91, line: 125, baseType: !144)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !133, file: !134, line: 65, baseType: !148, size: 32, align: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !91, line: 126, baseType: !144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !133, file: !134, line: 67, baseType: !24, size: 32, align: 32, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !133, file: !134, line: 69, baseType: !137, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !133, file: !134, line: 74, baseType: !90, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !133, file: !134, line: 78, baseType: !153, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !91, line: 153, baseType: !92)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !133, file: !134, line: 80, baseType: !155, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !91, line: 158, baseType: !92)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !133, file: !134, line: 91, baseType: !157, size: 128, align: 64, offset: 576)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !158, line: 120, size: 128, align: 64, elements: !159)
!158 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dma/task1")
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !157, file: !158, line: 122, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !91, line: 139, baseType: !92)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !157, file: !158, line: 123, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !91, line: 175, baseType: !92)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !133, file: !134, line: 92, baseType: !157, size: 128, align: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !133, file: !134, line: 93, baseType: !157, size: 128, align: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !133, file: !134, line: 106, baseType: !167, size: 192, align: 64, offset: 960)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, align: 64, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 3)
!170 = !DILocation(line: 74, column: 14, scope: !29)
!171 = !DILocalVariable(name: "t", scope: !29, file: !30, line: 75, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stritem", file: !35, line: 92, size: 128, align: 64, elements: !174)
!174 = !{!175, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !35, line: 93, baseType: !176, size: 64, align: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !35, line: 93, size: 64, align: 64, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sle_next", scope: !176, file: !35, line: 93, baseType: !172, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !173, file: !35, line: 94, baseType: !55, size: 64, align: 64, offset: 64)
!180 = !DILocation(line: 75, column: 18, scope: !29)
!181 = !DILocalVariable(name: "fd", scope: !29, file: !30, line: 76, type: !24)
!182 = !DILocation(line: 76, column: 6, scope: !29)
!183 = !DILocation(line: 78, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !29, file: !30, line: 78, column: 6)
!185 = !DILocation(line: 78, column: 47, scope: !184)
!186 = !DILocation(line: 78, column: 6, scope: !184)
!187 = !DILocation(line: 78, column: 75, scope: !184)
!188 = !DILocation(line: 78, column: 6, scope: !29)
!189 = !DILocation(line: 79, column: 3, scope: !184)
!190 = !DILocation(line: 81, column: 15, scope: !29)
!191 = !DILocation(line: 81, column: 7, scope: !29)
!192 = !DILocation(line: 81, column: 5, scope: !29)
!193 = !DILocation(line: 82, column: 6, scope: !194)
!194 = distinct !DILexicalBlock(scope: !29, file: !30, line: 82, column: 6)
!195 = !DILocation(line: 82, column: 9, scope: !194)
!196 = !DILocation(line: 82, column: 6, scope: !29)
!197 = !DILocation(line: 83, column: 3, scope: !194)
!198 = !DILocation(line: 85, column: 13, scope: !199)
!199 = distinct !DILexicalBlock(scope: !29, file: !30, line: 85, column: 6)
!200 = !DILocation(line: 85, column: 6, scope: !199)
!201 = !DILocation(line: 85, column: 23, scope: !199)
!202 = !DILocation(line: 85, column: 6, scope: !29)
!203 = !DILocation(line: 86, column: 3, scope: !199)
!204 = !DILocation(line: 87, column: 12, scope: !205)
!205 = distinct !DILexicalBlock(scope: !29, file: !30, line: 87, column: 6)
!206 = !DILocation(line: 87, column: 6, scope: !205)
!207 = !DILocation(line: 87, column: 24, scope: !205)
!208 = !DILocation(line: 87, column: 6, scope: !29)
!209 = !DILocation(line: 88, column: 3, scope: !205)
!210 = !DILocation(line: 89, column: 23, scope: !29)
!211 = !DILocation(line: 89, column: 16, scope: !29)
!212 = !DILocation(line: 89, column: 2, scope: !29)
!213 = !DILocation(line: 89, column: 9, scope: !29)
!214 = !DILocation(line: 89, column: 14, scope: !29)
!215 = !DILocation(line: 90, column: 6, scope: !216)
!216 = distinct !DILexicalBlock(scope: !29, file: !30, line: 90, column: 6)
!217 = !DILocation(line: 90, column: 13, scope: !216)
!218 = !DILocation(line: 90, column: 18, scope: !216)
!219 = !DILocation(line: 90, column: 6, scope: !29)
!220 = !DILocation(line: 91, column: 3, scope: !216)
!221 = !DILocation(line: 96, column: 12, scope: !222)
!222 = distinct !DILexicalBlock(scope: !29, file: !30, line: 96, column: 6)
!223 = !DILocation(line: 96, column: 6, scope: !222)
!224 = !DILocation(line: 96, column: 21, scope: !222)
!225 = !DILocation(line: 96, column: 6, scope: !29)
!226 = !DILocation(line: 97, column: 3, scope: !222)
!227 = !DILocation(line: 98, column: 16, scope: !228)
!228 = distinct !DILexicalBlock(scope: !29, file: !30, line: 98, column: 6)
!229 = !DILocation(line: 98, column: 23, scope: !228)
!230 = !DILocation(line: 98, column: 52, scope: !228)
!231 = !DILocation(line: 98, column: 6, scope: !228)
!232 = !DILocation(line: 98, column: 60, scope: !228)
!233 = !DILocation(line: 98, column: 6, scope: !29)
!234 = !DILocation(line: 99, column: 3, scope: !228)
!235 = !DILocation(line: 101, column: 24, scope: !29)
!236 = !DILocation(line: 101, column: 17, scope: !29)
!237 = !DILocation(line: 101, column: 2, scope: !29)
!238 = !DILocation(line: 101, column: 9, scope: !29)
!239 = !DILocation(line: 101, column: 15, scope: !29)
!240 = !DILocation(line: 102, column: 6, scope: !241)
!241 = distinct !DILexicalBlock(scope: !29, file: !30, line: 102, column: 6)
!242 = !DILocation(line: 102, column: 13, scope: !241)
!243 = !DILocation(line: 102, column: 19, scope: !241)
!244 = !DILocation(line: 102, column: 6, scope: !29)
!245 = !DILocation(line: 103, column: 3, scope: !241)
!246 = !DILocation(line: 105, column: 6, scope: !29)
!247 = !DILocation(line: 105, column: 4, scope: !29)
!248 = !DILocation(line: 106, column: 6, scope: !249)
!249 = distinct !DILexicalBlock(scope: !29, file: !30, line: 106, column: 6)
!250 = !DILocation(line: 106, column: 8, scope: !249)
!251 = !DILocation(line: 106, column: 6, scope: !29)
!252 = !DILocation(line: 107, column: 12, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !30, line: 106, column: 16)
!254 = !DILocation(line: 107, column: 19, scope: !253)
!255 = !DILocation(line: 107, column: 3, scope: !253)
!256 = !DILocation(line: 107, column: 6, scope: !253)
!257 = !DILocation(line: 107, column: 10, scope: !253)
!258 = !DILocation(line: 108, column: 2, scope: !253)
!259 = distinct !{!259, !258}
!260 = !DILocation(line: 108, column: 5, scope: !261)
!261 = !DILexicalBlockFile(scope: !262, file: !30, discriminator: 1)
!262 = distinct !DILexicalBlock(scope: !253, file: !30, line: 108, column: 5)
!263 = !DILocation(line: 108, column: 2, scope: !261)
!264 = !DILocation(line: 108, column: 3, scope: !261)
!265 = !DILocation(line: 108, column: 12, scope: !261)
!266 = !DILocation(line: 108, column: 15, scope: !261)
!267 = !DILocation(line: 109, column: 2, scope: !253)
!268 = !DILocation(line: 110, column: 2, scope: !29)
!269 = !DILocation(line: 113, column: 6, scope: !270)
!270 = distinct !DILexicalBlock(scope: !29, file: !30, line: 113, column: 6)
!271 = !DILocation(line: 113, column: 13, scope: !270)
!272 = !DILocation(line: 113, column: 19, scope: !270)
!273 = !DILocation(line: 113, column: 6, scope: !29)
!274 = !DILocation(line: 114, column: 10, scope: !270)
!275 = !DILocation(line: 114, column: 17, scope: !270)
!276 = !DILocation(line: 114, column: 3, scope: !270)
!277 = !DILocation(line: 115, column: 8, scope: !29)
!278 = !DILocation(line: 115, column: 2, scope: !29)
!279 = !DILocation(line: 116, column: 9, scope: !29)
!280 = !DILocation(line: 116, column: 2, scope: !29)
!281 = !DILocation(line: 117, column: 2, scope: !29)
!282 = !DILocation(line: 118, column: 1, scope: !29)
!283 = distinct !DISubprogram(name: "linkspool", scope: !30, file: !30, line: 231, type: !31, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!284 = !DILocalVariable(name: "queue", arg: 1, scope: !283, file: !30, line: 231, type: !33)
!285 = !DILocation(line: 231, column: 25, scope: !283)
!286 = !DILocalVariable(name: "st", scope: !283, file: !30, line: 233, type: !133)
!287 = !DILocation(line: 233, column: 14, scope: !283)
!288 = !DILocalVariable(name: "it", scope: !283, file: !30, line: 234, type: !41)
!289 = !DILocation(line: 234, column: 16, scope: !283)
!290 = !DILocation(line: 236, column: 13, scope: !291)
!291 = distinct !DILexicalBlock(scope: !283, file: !30, line: 236, column: 6)
!292 = !DILocation(line: 236, column: 20, scope: !291)
!293 = !DILocation(line: 236, column: 6, scope: !291)
!294 = !DILocation(line: 236, column: 27, scope: !291)
!295 = !DILocation(line: 236, column: 32, scope: !291)
!296 = !DILocation(line: 236, column: 48, scope: !297)
!297 = !DILexicalBlockFile(scope: !291, file: !30, discriminator: 1)
!298 = !DILocation(line: 236, column: 55, scope: !297)
!299 = !DILocation(line: 236, column: 41, scope: !297)
!300 = !DILocation(line: 236, column: 35, scope: !301)
!301 = !DILexicalBlockFile(scope: !297, file: !30, discriminator: 2)
!302 = !DILocation(line: 236, column: 63, scope: !297)
!303 = !DILocation(line: 236, column: 6, scope: !297)
!304 = !DILocation(line: 237, column: 3, scope: !291)
!305 = !DILocation(line: 240, column: 19, scope: !283)
!306 = !DILocation(line: 240, column: 29, scope: !283)
!307 = !DILocation(line: 240, column: 36, scope: !283)
!308 = !DILocation(line: 239, column: 2, scope: !283)
!309 = !DILocation(line: 242, column: 2, scope: !310)
!310 = distinct !DILexicalBlock(scope: !283, file: !30, line: 242, column: 1)
!311 = !DILocation(line: 242, column: 9, scope: !310)
!312 = !DILocation(line: 242, column: 4, scope: !310)
!313 = !DILocation(line: 242, column: 3, scope: !310)
!314 = !DILocation(line: 242, column: 6, scope: !310)
!315 = !DILocation(line: 242, column: 1, scope: !316)
!316 = !DILexicalBlockFile(scope: !317, file: !30, discriminator: 1)
!317 = distinct !DILexicalBlock(scope: !310, file: !30, line: 242, column: 1)
!318 = !DILocation(line: 243, column: 17, scope: !319)
!319 = distinct !DILexicalBlock(scope: !320, file: !30, line: 243, column: 7)
!320 = distinct !DILexicalBlock(scope: !317, file: !30, line: 242, column: 39)
!321 = !DILocation(line: 243, column: 21, scope: !319)
!322 = !DILocation(line: 243, column: 44, scope: !319)
!323 = !DILocation(line: 243, column: 51, scope: !319)
!324 = !DILocation(line: 243, column: 66, scope: !319)
!325 = !DILocation(line: 243, column: 55, scope: !319)
!326 = !DILocation(line: 243, column: 7, scope: !319)
!327 = !DILocation(line: 243, column: 70, scope: !319)
!328 = !DILocation(line: 243, column: 7, scope: !320)
!329 = !DILocation(line: 244, column: 4, scope: !319)
!330 = !DILocation(line: 245, column: 17, scope: !331)
!331 = distinct !DILexicalBlock(scope: !320, file: !30, line: 245, column: 7)
!332 = !DILocation(line: 245, column: 21, scope: !331)
!333 = !DILocation(line: 245, column: 47, scope: !331)
!334 = !DILocation(line: 245, column: 57, scope: !331)
!335 = !DILocation(line: 245, column: 61, scope: !331)
!336 = !DILocation(line: 245, column: 7, scope: !331)
!337 = !DILocation(line: 245, column: 70, scope: !331)
!338 = !DILocation(line: 245, column: 7, scope: !320)
!339 = !DILocation(line: 246, column: 4, scope: !331)
!340 = !DILocation(line: 247, column: 17, scope: !341)
!341 = distinct !DILexicalBlock(scope: !320, file: !30, line: 247, column: 7)
!342 = !DILocation(line: 247, column: 21, scope: !341)
!343 = !DILocation(line: 247, column: 46, scope: !341)
!344 = !DILocation(line: 247, column: 56, scope: !341)
!345 = !DILocation(line: 247, column: 60, scope: !341)
!346 = !DILocation(line: 247, column: 7, scope: !341)
!347 = !DILocation(line: 247, column: 69, scope: !341)
!348 = !DILocation(line: 247, column: 7, scope: !320)
!349 = !DILocation(line: 248, column: 4, scope: !341)
!350 = !DILocation(line: 251, column: 12, scope: !351)
!351 = distinct !DILexicalBlock(scope: !320, file: !30, line: 251, column: 7)
!352 = !DILocation(line: 251, column: 16, scope: !351)
!353 = !DILocation(line: 251, column: 7, scope: !351)
!354 = !DILocation(line: 251, column: 30, scope: !351)
!355 = !DILocation(line: 251, column: 35, scope: !351)
!356 = !DILocation(line: 251, column: 43, scope: !357)
!357 = !DILexicalBlockFile(scope: !351, file: !30, discriminator: 1)
!358 = !DILocation(line: 251, column: 47, scope: !357)
!359 = !DILocation(line: 251, column: 38, scope: !357)
!360 = !DILocation(line: 251, column: 60, scope: !357)
!361 = !DILocation(line: 251, column: 7, scope: !357)
!362 = !DILocation(line: 252, column: 4, scope: !351)
!363 = !DILocation(line: 254, column: 19, scope: !364)
!364 = distinct !DILexicalBlock(scope: !320, file: !30, line: 254, column: 7)
!365 = !DILocation(line: 254, column: 7, scope: !364)
!366 = !DILocation(line: 254, column: 23, scope: !364)
!367 = !DILocation(line: 254, column: 7, scope: !320)
!368 = !DILocation(line: 255, column: 4, scope: !364)
!369 = !DILocation(line: 257, column: 12, scope: !370)
!370 = distinct !DILexicalBlock(scope: !320, file: !30, line: 257, column: 7)
!371 = !DILocation(line: 257, column: 19, scope: !370)
!372 = !DILocation(line: 257, column: 25, scope: !370)
!373 = !DILocation(line: 257, column: 29, scope: !370)
!374 = !DILocation(line: 257, column: 7, scope: !370)
!375 = !DILocation(line: 257, column: 37, scope: !370)
!376 = !DILocation(line: 257, column: 7, scope: !320)
!377 = !DILocation(line: 258, column: 4, scope: !370)
!378 = !DILocation(line: 259, column: 2, scope: !320)
!379 = !DILocation(line: 242, column: 1, scope: !380)
!380 = !DILexicalBlockFile(scope: !317, file: !30, discriminator: 2)
!381 = !DILocation(line: 242, column: 2, scope: !380)
!382 = !DILocation(line: 242, column: 3, scope: !380)
!383 = distinct !{!383, !384}
!384 = !DILocation(line: 242, column: 1, scope: !283)
!385 = !DILocation(line: 261, column: 2, scope: !386)
!386 = distinct !DILexicalBlock(scope: !283, file: !30, line: 261, column: 1)
!387 = !DILocation(line: 261, column: 9, scope: !386)
!388 = !DILocation(line: 261, column: 4, scope: !386)
!389 = !DILocation(line: 261, column: 3, scope: !386)
!390 = !DILocation(line: 261, column: 6, scope: !386)
!391 = !DILocation(line: 261, column: 1, scope: !392)
!392 = !DILexicalBlockFile(scope: !393, file: !30, discriminator: 1)
!393 = distinct !DILexicalBlock(scope: !386, file: !30, line: 261, column: 1)
!394 = !DILocation(line: 263, column: 10, scope: !395)
!395 = distinct !DILexicalBlock(scope: !393, file: !30, line: 261, column: 39)
!396 = !DILocation(line: 263, column: 14, scope: !395)
!397 = !DILocation(line: 263, column: 20, scope: !395)
!398 = !DILocation(line: 263, column: 24, scope: !395)
!399 = !DILocation(line: 262, column: 3, scope: !395)
!400 = !DILocation(line: 264, column: 2, scope: !395)
!401 = !DILocation(line: 261, column: 1, scope: !402)
!402 = !DILexicalBlockFile(scope: !393, file: !30, discriminator: 2)
!403 = !DILocation(line: 261, column: 2, scope: !402)
!404 = !DILocation(line: 261, column: 3, scope: !402)
!405 = distinct !{!405, !406}
!406 = !DILocation(line: 261, column: 1, scope: !283)
!407 = !DILocation(line: 266, column: 9, scope: !283)
!408 = !DILocation(line: 266, column: 16, scope: !283)
!409 = !DILocation(line: 266, column: 2, scope: !283)
!410 = !DILocation(line: 267, column: 2, scope: !283)
!411 = !DILocation(line: 270, column: 2, scope: !412)
!412 = distinct !DILexicalBlock(scope: !283, file: !30, line: 270, column: 1)
!413 = !DILocation(line: 270, column: 9, scope: !412)
!414 = !DILocation(line: 270, column: 4, scope: !412)
!415 = !DILocation(line: 270, column: 3, scope: !412)
!416 = !DILocation(line: 270, column: 6, scope: !412)
!417 = !DILocation(line: 270, column: 1, scope: !418)
!418 = !DILexicalBlockFile(scope: !419, file: !30, discriminator: 1)
!419 = distinct !DILexicalBlock(scope: !412, file: !30, line: 270, column: 1)
!420 = !DILocation(line: 271, column: 10, scope: !421)
!421 = distinct !DILexicalBlock(scope: !419, file: !30, line: 270, column: 39)
!422 = !DILocation(line: 271, column: 14, scope: !421)
!423 = !DILocation(line: 271, column: 3, scope: !421)
!424 = !DILocation(line: 272, column: 10, scope: !421)
!425 = !DILocation(line: 272, column: 14, scope: !421)
!426 = !DILocation(line: 272, column: 3, scope: !421)
!427 = !DILocation(line: 273, column: 2, scope: !421)
!428 = !DILocation(line: 270, column: 1, scope: !429)
!429 = !DILexicalBlockFile(scope: !419, file: !30, discriminator: 2)
!430 = !DILocation(line: 270, column: 2, scope: !429)
!431 = !DILocation(line: 270, column: 3, scope: !429)
!432 = distinct !{!432, !433}
!433 = !DILocation(line: 270, column: 1, scope: !283)
!434 = !DILocation(line: 274, column: 2, scope: !283)
!435 = !DILocation(line: 275, column: 1, scope: !283)
!436 = distinct !DISubprogram(name: "writequeuef", scope: !30, file: !30, line: 121, type: !437, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!437 = !DISubroutineType(types: !438)
!438 = !{!24, !41}
!439 = !DILocalVariable(name: "it", arg: 1, scope: !436, file: !30, line: 121, type: !41)
!440 = !DILocation(line: 121, column: 27, scope: !436)
!441 = !DILocalVariable(name: "error", scope: !436, file: !30, line: 123, type: !24)
!442 = !DILocation(line: 123, column: 6, scope: !436)
!443 = !DILocalVariable(name: "queuefd", scope: !436, file: !30, line: 124, type: !24)
!444 = !DILocation(line: 124, column: 6, scope: !436)
!445 = !DILocation(line: 126, column: 24, scope: !436)
!446 = !DILocation(line: 126, column: 28, scope: !436)
!447 = !DILocation(line: 126, column: 12, scope: !436)
!448 = !DILocation(line: 126, column: 10, scope: !436)
!449 = !DILocation(line: 127, column: 6, scope: !450)
!450 = distinct !DILexicalBlock(scope: !436, file: !30, line: 127, column: 6)
!451 = !DILocation(line: 127, column: 14, scope: !450)
!452 = !DILocation(line: 127, column: 6, scope: !436)
!453 = !DILocation(line: 128, column: 3, scope: !450)
!454 = !DILocation(line: 129, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !436, file: !30, line: 129, column: 6)
!456 = !DILocation(line: 129, column: 6, scope: !455)
!457 = !DILocation(line: 129, column: 28, scope: !455)
!458 = !DILocation(line: 129, column: 6, scope: !436)
!459 = !DILocation(line: 130, column: 3, scope: !455)
!460 = !DILocation(line: 131, column: 22, scope: !436)
!461 = !DILocation(line: 131, column: 15, scope: !436)
!462 = !DILocation(line: 131, column: 2, scope: !436)
!463 = !DILocation(line: 131, column: 6, scope: !436)
!464 = !DILocation(line: 131, column: 13, scope: !436)
!465 = !DILocation(line: 132, column: 6, scope: !466)
!466 = distinct !DILexicalBlock(scope: !436, file: !30, line: 132, column: 6)
!467 = !DILocation(line: 132, column: 10, scope: !466)
!468 = !DILocation(line: 132, column: 17, scope: !466)
!469 = !DILocation(line: 132, column: 6, scope: !436)
!470 = !DILocation(line: 133, column: 3, scope: !466)
!471 = !DILocation(line: 135, column: 18, scope: !436)
!472 = !DILocation(line: 135, column: 22, scope: !436)
!473 = !DILocation(line: 139, column: 5, scope: !436)
!474 = !DILocation(line: 139, column: 9, scope: !436)
!475 = !DILocation(line: 140, column: 5, scope: !436)
!476 = !DILocation(line: 140, column: 9, scope: !436)
!477 = !DILocation(line: 141, column: 5, scope: !436)
!478 = !DILocation(line: 141, column: 9, scope: !436)
!479 = !DILocation(line: 135, column: 10, scope: !436)
!480 = !DILocation(line: 135, column: 8, scope: !436)
!481 = !DILocation(line: 143, column: 6, scope: !482)
!482 = distinct !DILexicalBlock(scope: !436, file: !30, line: 143, column: 6)
!483 = !DILocation(line: 143, column: 12, scope: !482)
!484 = !DILocation(line: 143, column: 6, scope: !436)
!485 = !DILocation(line: 144, column: 3, scope: !482)
!486 = !DILocation(line: 146, column: 13, scope: !487)
!487 = distinct !DILexicalBlock(scope: !436, file: !30, line: 146, column: 6)
!488 = !DILocation(line: 146, column: 17, scope: !487)
!489 = !DILocation(line: 146, column: 6, scope: !487)
!490 = !DILocation(line: 146, column: 25, scope: !487)
!491 = !DILocation(line: 146, column: 30, scope: !487)
!492 = !DILocation(line: 146, column: 46, scope: !493)
!493 = !DILexicalBlockFile(scope: !487, file: !30, discriminator: 1)
!494 = !DILocation(line: 146, column: 50, scope: !493)
!495 = !DILocation(line: 146, column: 39, scope: !493)
!496 = !DILocation(line: 146, column: 33, scope: !497)
!497 = !DILexicalBlockFile(scope: !493, file: !30, discriminator: 2)
!498 = !DILocation(line: 146, column: 59, scope: !493)
!499 = !DILocation(line: 146, column: 6, scope: !493)
!500 = !DILocation(line: 147, column: 3, scope: !487)
!501 = !DILocation(line: 149, column: 2, scope: !436)
!502 = !DILocation(line: 150, column: 1, scope: !436)
!503 = distinct !DISubprogram(name: "load_queue", scope: !30, file: !30, line: 278, type: !31, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!504 = !DILocalVariable(name: "queue", arg: 1, scope: !503, file: !30, line: 278, type: !33)
!505 = !DILocation(line: 278, column: 26, scope: !503)
!506 = !DILocalVariable(name: "sb", scope: !503, file: !30, line: 280, type: !133)
!507 = !DILocation(line: 280, column: 14, scope: !503)
!508 = !DILocalVariable(name: "it", scope: !503, file: !30, line: 281, type: !41)
!509 = !DILocation(line: 281, column: 16, scope: !503)
!510 = !DILocalVariable(name: "spooldir", scope: !503, file: !30, line: 282, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !513, line: 127, baseType: !514)
!513 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/dma/task1")
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !513, line: 127, flags: DIFlagFwdDecl)
!515 = !DILocation(line: 282, column: 7, scope: !503)
!516 = !DILocalVariable(name: "de", scope: !503, file: !30, line: 283, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !519, line: 22, size: 2240, align: 64, elements: !520)
!519 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dma/task1")
!520 = !{!521, !522, !523, !524, !526}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !518, file: !519, line: 25, baseType: !139, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !518, file: !519, line: 26, baseType: !90, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !518, file: !519, line: 31, baseType: !25, size: 16, align: 16, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !518, file: !519, line: 32, baseType: !525, size: 8, align: 8, offset: 144)
!525 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !518, file: !519, line: 33, baseType: !527, size: 2048, align: 8, offset: 152)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, align: 8, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 256)
!530 = !DILocation(line: 283, column: 17, scope: !503)
!531 = !DILocalVariable(name: "queuefn", scope: !503, file: !30, line: 284, type: !55)
!532 = !DILocation(line: 284, column: 8, scope: !503)
!533 = !DILocalVariable(name: "mailfn", scope: !503, file: !30, line: 285, type: !55)
!534 = !DILocation(line: 285, column: 8, scope: !503)
!535 = !DILocation(line: 287, column: 8, scope: !503)
!536 = !DILocation(line: 287, column: 2, scope: !503)
!537 = !DILocation(line: 288, column: 1, scope: !503)
!538 = distinct !{!538, !537}
!539 = !DILocation(line: 288, column: 2, scope: !540)
!540 = !DILexicalBlockFile(scope: !541, file: !30, discriminator: 1)
!541 = distinct !DILexicalBlock(scope: !503, file: !30, line: 288, column: 4)
!542 = !DILocation(line: 288, column: 9, scope: !540)
!543 = !DILocation(line: 288, column: 4, scope: !540)
!544 = !DILocation(line: 288, column: 13, scope: !540)
!545 = !DILocation(line: 288, column: 28, scope: !540)
!546 = !DILocation(line: 290, column: 28, scope: !503)
!547 = !DILocation(line: 290, column: 13, scope: !503)
!548 = !DILocation(line: 290, column: 11, scope: !503)
!549 = !DILocation(line: 291, column: 6, scope: !550)
!550 = distinct !DILexicalBlock(scope: !503, file: !30, line: 291, column: 6)
!551 = !DILocation(line: 291, column: 15, scope: !550)
!552 = !DILocation(line: 291, column: 6, scope: !503)
!553 = !DILocation(line: 292, column: 3, scope: !550)
!554 = !DILocation(line: 294, column: 2, scope: !503)
!555 = !DILocation(line: 294, column: 23, scope: !556)
!556 = !DILexicalBlockFile(scope: !503, file: !30, discriminator: 1)
!557 = !DILocation(line: 294, column: 15, scope: !556)
!558 = !DILocation(line: 294, column: 13, scope: !556)
!559 = !DILocation(line: 294, column: 34, scope: !556)
!560 = !DILocation(line: 294, column: 2, scope: !556)
!561 = !DILocation(line: 295, column: 11, scope: !562)
!562 = distinct !DILexicalBlock(scope: !503, file: !30, line: 294, column: 42)
!563 = !DILocation(line: 296, column: 10, scope: !562)
!564 = !DILocation(line: 299, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !562, file: !30, line: 299, column: 7)
!566 = !DILocation(line: 299, column: 11, scope: !565)
!567 = !DILocation(line: 299, column: 21, scope: !565)
!568 = !DILocation(line: 299, column: 7, scope: !562)
!569 = !DILocation(line: 300, column: 4, scope: !565)
!570 = distinct !{!570, !554}
!571 = !DILocation(line: 301, column: 43, scope: !572)
!572 = distinct !DILexicalBlock(scope: !562, file: !30, line: 301, column: 7)
!573 = !DILocation(line: 301, column: 53, scope: !572)
!574 = !DILocation(line: 301, column: 57, scope: !572)
!575 = !DILocation(line: 301, column: 64, scope: !572)
!576 = !DILocation(line: 301, column: 7, scope: !572)
!577 = !DILocation(line: 301, column: 69, scope: !572)
!578 = !DILocation(line: 301, column: 7, scope: !562)
!579 = !DILocation(line: 302, column: 4, scope: !572)
!580 = !DILocation(line: 303, column: 42, scope: !581)
!581 = distinct !DILexicalBlock(scope: !562, file: !30, line: 303, column: 7)
!582 = !DILocation(line: 303, column: 52, scope: !581)
!583 = !DILocation(line: 303, column: 56, scope: !581)
!584 = !DILocation(line: 303, column: 63, scope: !581)
!585 = !DILocation(line: 303, column: 7, scope: !581)
!586 = !DILocation(line: 303, column: 68, scope: !581)
!587 = !DILocation(line: 303, column: 7, scope: !562)
!588 = !DILocation(line: 304, column: 4, scope: !581)
!589 = !DILocation(line: 311, column: 12, scope: !590)
!590 = distinct !DILexicalBlock(scope: !562, file: !30, line: 311, column: 7)
!591 = !DILocation(line: 311, column: 7, scope: !590)
!592 = !DILocation(line: 311, column: 26, scope: !590)
!593 = !DILocation(line: 311, column: 7, scope: !562)
!594 = !DILocation(line: 312, column: 4, scope: !590)
!595 = !DILocation(line: 313, column: 10, scope: !596)
!596 = distinct !DILexicalBlock(scope: !562, file: !30, line: 313, column: 7)
!597 = !DILocation(line: 313, column: 21, scope: !596)
!598 = !DILocation(line: 313, column: 7, scope: !562)
!599 = !DILocation(line: 314, column: 5, scope: !600)
!600 = distinct !DILexicalBlock(scope: !596, file: !30, line: 313, column: 28)
!601 = !DILocation(line: 314, column: 9, scope: !600)
!602 = !DILocation(line: 315, column: 4, scope: !600)
!603 = !DILocation(line: 318, column: 12, scope: !604)
!604 = distinct !DILexicalBlock(scope: !562, file: !30, line: 318, column: 7)
!605 = !DILocation(line: 318, column: 7, scope: !604)
!606 = !DILocation(line: 318, column: 25, scope: !604)
!607 = !DILocation(line: 318, column: 7, scope: !562)
!608 = !DILocation(line: 319, column: 4, scope: !604)
!609 = !DILocation(line: 321, column: 19, scope: !562)
!610 = !DILocation(line: 321, column: 26, scope: !562)
!611 = !DILocation(line: 321, column: 8, scope: !562)
!612 = !DILocation(line: 321, column: 6, scope: !562)
!613 = !DILocation(line: 322, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !562, file: !30, line: 322, column: 7)
!615 = !DILocation(line: 322, column: 10, scope: !614)
!616 = !DILocation(line: 322, column: 7, scope: !562)
!617 = !DILocation(line: 323, column: 4, scope: !614)
!618 = !DILocation(line: 325, column: 16, scope: !562)
!619 = !DILocation(line: 325, column: 3, scope: !562)
!620 = !DILocation(line: 325, column: 7, scope: !562)
!621 = !DILocation(line: 325, column: 14, scope: !562)
!622 = !DILocation(line: 326, column: 3, scope: !562)
!623 = !DILocation(line: 329, column: 66, scope: !562)
!624 = !DILocation(line: 329, column: 75, scope: !562)
!625 = !DILocation(line: 329, column: 3, scope: !562)
!626 = !DILocation(line: 330, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !562, file: !30, line: 330, column: 7)
!628 = !DILocation(line: 330, column: 15, scope: !627)
!629 = !DILocation(line: 330, column: 7, scope: !562)
!630 = !DILocation(line: 331, column: 9, scope: !627)
!631 = !DILocation(line: 331, column: 4, scope: !627)
!632 = !DILocation(line: 332, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !562, file: !30, line: 332, column: 7)
!634 = !DILocation(line: 332, column: 14, scope: !633)
!635 = !DILocation(line: 332, column: 7, scope: !562)
!636 = !DILocation(line: 333, column: 9, scope: !633)
!637 = !DILocation(line: 333, column: 4, scope: !633)
!638 = !DILocation(line: 294, column: 2, scope: !639)
!639 = !DILexicalBlockFile(scope: !503, file: !30, discriminator: 2)
!640 = !DILocation(line: 335, column: 11, scope: !503)
!641 = !DILocation(line: 335, column: 2, scope: !503)
!642 = !DILocation(line: 336, column: 2, scope: !503)
!643 = !DILocation(line: 339, column: 2, scope: !503)
!644 = !DILocation(line: 340, column: 1, scope: !503)
!645 = distinct !DISubprogram(name: "readqueuef", scope: !30, file: !30, line: 153, type: !646, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!646 = !DISubroutineType(types: !647)
!647 = !{!41, !33, !55}
!648 = !DILocalVariable(name: "queue", arg: 1, scope: !645, file: !30, line: 153, type: !33)
!649 = !DILocation(line: 153, column: 26, scope: !645)
!650 = !DILocalVariable(name: "queuefn", arg: 2, scope: !645, file: !30, line: 153, type: !55)
!651 = !DILocation(line: 153, column: 39, scope: !645)
!652 = !DILocalVariable(name: "line", scope: !645, file: !30, line: 155, type: !653)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8000, align: 8, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 1000)
!656 = !DILocation(line: 155, column: 7, scope: !645)
!657 = !DILocalVariable(name: "itmqueue", scope: !645, file: !30, line: 156, type: !34)
!658 = !DILocation(line: 156, column: 15, scope: !645)
!659 = !DILocalVariable(name: "queuef", scope: !645, file: !30, line: 157, type: !60)
!660 = !DILocation(line: 157, column: 8, scope: !645)
!661 = !DILocalVariable(name: "s", scope: !645, file: !30, line: 158, type: !55)
!662 = !DILocation(line: 158, column: 8, scope: !645)
!663 = !DILocalVariable(name: "queueid", scope: !645, file: !30, line: 159, type: !55)
!664 = !DILocation(line: 159, column: 8, scope: !645)
!665 = !DILocalVariable(name: "sender", scope: !645, file: !30, line: 159, type: !55)
!666 = !DILocation(line: 159, column: 24, scope: !645)
!667 = !DILocalVariable(name: "addr", scope: !645, file: !30, line: 159, type: !55)
!668 = !DILocation(line: 159, column: 40, scope: !645)
!669 = !DILocalVariable(name: "it", scope: !645, file: !30, line: 160, type: !41)
!670 = !DILocation(line: 160, column: 16, scope: !645)
!671 = !DILocation(line: 162, column: 2, scope: !645)
!672 = !DILocation(line: 163, column: 1, scope: !645)
!673 = distinct !{!673, !672}
!674 = !DILocation(line: 163, column: 11, scope: !675)
!675 = !DILexicalBlockFile(scope: !676, file: !30, discriminator: 1)
!676 = distinct !DILexicalBlock(scope: !645, file: !30, line: 163, column: 4)
!677 = !DILocation(line: 163, column: 4, scope: !675)
!678 = !DILocation(line: 163, column: 13, scope: !675)
!679 = !DILocation(line: 163, column: 28, scope: !675)
!680 = !DILocation(line: 165, column: 17, scope: !645)
!681 = !DILocation(line: 165, column: 11, scope: !645)
!682 = !DILocation(line: 165, column: 9, scope: !645)
!683 = !DILocation(line: 166, column: 6, scope: !684)
!684 = distinct !DILexicalBlock(scope: !645, file: !30, line: 166, column: 6)
!685 = !DILocation(line: 166, column: 13, scope: !684)
!686 = !DILocation(line: 166, column: 6, scope: !645)
!687 = !DILocation(line: 167, column: 3, scope: !684)
!688 = !DILocation(line: 169, column: 2, scope: !645)
!689 = !DILocation(line: 169, column: 15, scope: !690)
!690 = !DILexicalBlockFile(scope: !645, file: !30, discriminator: 1)
!691 = !DILocation(line: 169, column: 10, scope: !690)
!692 = !DILocation(line: 169, column: 9, scope: !690)
!693 = !DILocation(line: 169, column: 2, scope: !690)
!694 = !DILocation(line: 170, column: 13, scope: !695)
!695 = distinct !DILexicalBlock(scope: !696, file: !30, line: 170, column: 7)
!696 = distinct !DILexicalBlock(scope: !645, file: !30, line: 169, column: 24)
!697 = !DILocation(line: 170, column: 33, scope: !695)
!698 = !DILocation(line: 170, column: 7, scope: !695)
!699 = !DILocation(line: 170, column: 41, scope: !695)
!700 = !DILocation(line: 170, column: 48, scope: !695)
!701 = !DILocation(line: 170, column: 51, scope: !702)
!702 = !DILexicalBlockFile(scope: !695, file: !30, discriminator: 1)
!703 = !DILocation(line: 170, column: 59, scope: !702)
!704 = !DILocation(line: 170, column: 7, scope: !702)
!705 = !DILocation(line: 171, column: 4, scope: !695)
!706 = !DILocation(line: 172, column: 15, scope: !696)
!707 = !DILocation(line: 172, column: 8, scope: !696)
!708 = !DILocation(line: 172, column: 21, scope: !696)
!709 = !DILocation(line: 172, column: 3, scope: !696)
!710 = !DILocation(line: 172, column: 26, scope: !696)
!711 = !DILocation(line: 174, column: 14, scope: !696)
!712 = !DILocation(line: 174, column: 7, scope: !696)
!713 = !DILocation(line: 174, column: 5, scope: !696)
!714 = !DILocation(line: 175, column: 7, scope: !715)
!715 = distinct !DILexicalBlock(scope: !696, file: !30, line: 175, column: 7)
!716 = !DILocation(line: 175, column: 9, scope: !715)
!717 = !DILocation(line: 175, column: 7, scope: !696)
!718 = !DILocation(line: 176, column: 4, scope: !715)
!719 = !DILocation(line: 177, column: 4, scope: !696)
!720 = !DILocation(line: 177, column: 6, scope: !696)
!721 = !DILocation(line: 179, column: 4, scope: !696)
!722 = !DILocation(line: 180, column: 3, scope: !696)
!723 = !DILocation(line: 180, column: 10, scope: !724)
!724 = !DILexicalBlockFile(scope: !696, file: !30, discriminator: 1)
!725 = !DILocation(line: 180, column: 9, scope: !724)
!726 = !DILocation(line: 180, column: 30, scope: !724)
!727 = !DILocation(line: 180, column: 12, scope: !724)
!728 = !DILocation(line: 180, column: 11, scope: !724)
!729 = !DILocation(line: 180, column: 13, scope: !724)
!730 = !DILocation(line: 180, column: 3, scope: !724)
!731 = !DILocation(line: 181, column: 5, scope: !696)
!732 = !DILocation(line: 180, column: 3, scope: !733)
!733 = !DILexicalBlockFile(scope: !696, file: !30, discriminator: 2)
!734 = distinct !{!734, !722}
!735 = !DILocation(line: 183, column: 14, scope: !696)
!736 = !DILocation(line: 183, column: 7, scope: !696)
!737 = !DILocation(line: 183, column: 5, scope: !696)
!738 = !DILocation(line: 184, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !696, file: !30, line: 184, column: 7)
!740 = !DILocation(line: 184, column: 9, scope: !739)
!741 = !DILocation(line: 184, column: 7, scope: !696)
!742 = !DILocation(line: 185, column: 4, scope: !739)
!743 = !DILocation(line: 187, column: 14, scope: !744)
!744 = distinct !DILexicalBlock(scope: !696, file: !30, line: 187, column: 7)
!745 = !DILocation(line: 187, column: 7, scope: !744)
!746 = !DILocation(line: 187, column: 26, scope: !744)
!747 = !DILocation(line: 187, column: 7, scope: !696)
!748 = !DILocation(line: 188, column: 14, scope: !749)
!749 = distinct !DILexicalBlock(scope: !744, file: !30, line: 187, column: 32)
!750 = !DILocation(line: 188, column: 12, scope: !749)
!751 = !DILocation(line: 189, column: 3, scope: !749)
!752 = !DILocation(line: 189, column: 21, scope: !753)
!753 = !DILexicalBlockFile(scope: !754, file: !30, discriminator: 1)
!754 = distinct !DILexicalBlock(scope: !744, file: !30, line: 189, column: 14)
!755 = !DILocation(line: 189, column: 14, scope: !753)
!756 = !DILocation(line: 189, column: 37, scope: !753)
!757 = !DILocation(line: 190, column: 13, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !30, line: 189, column: 43)
!759 = !DILocation(line: 190, column: 11, scope: !758)
!760 = !DILocation(line: 191, column: 3, scope: !758)
!761 = !DILocation(line: 191, column: 21, scope: !762)
!762 = !DILexicalBlockFile(scope: !763, file: !30, discriminator: 1)
!763 = distinct !DILexicalBlock(scope: !754, file: !30, line: 191, column: 14)
!764 = !DILocation(line: 191, column: 14, scope: !762)
!765 = !DILocation(line: 191, column: 40, scope: !762)
!766 = !DILocation(line: 192, column: 11, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !30, line: 191, column: 46)
!768 = !DILocation(line: 192, column: 9, scope: !767)
!769 = !DILocation(line: 193, column: 3, scope: !767)
!770 = !DILocation(line: 195, column: 11, scope: !771)
!771 = distinct !DILexicalBlock(scope: !763, file: !30, line: 193, column: 10)
!772 = !DILocation(line: 195, column: 17, scope: !771)
!773 = !DILocation(line: 194, column: 4, scope: !771)
!774 = !DILocation(line: 196, column: 9, scope: !771)
!775 = !DILocation(line: 196, column: 4, scope: !771)
!776 = !DILocation(line: 169, column: 2, scope: !777)
!777 = !DILexicalBlockFile(scope: !645, file: !30, discriminator: 2)
!778 = distinct !{!778, !688}
!779 = !DILocation(line: 200, column: 6, scope: !780)
!780 = distinct !DILexicalBlock(scope: !645, file: !30, line: 200, column: 6)
!781 = !DILocation(line: 200, column: 14, scope: !780)
!782 = !DILocation(line: 200, column: 21, scope: !780)
!783 = !DILocation(line: 200, column: 24, scope: !784)
!784 = !DILexicalBlockFile(scope: !780, file: !30, discriminator: 1)
!785 = !DILocation(line: 200, column: 31, scope: !784)
!786 = !DILocation(line: 200, column: 39, scope: !784)
!787 = !DILocation(line: 200, column: 42, scope: !788)
!788 = !DILexicalBlockFile(scope: !780, file: !30, discriminator: 2)
!789 = !DILocation(line: 200, column: 47, scope: !788)
!790 = !DILocation(line: 200, column: 55, scope: !788)
!791 = !DILocation(line: 201, column: 7, scope: !780)
!792 = !DILocation(line: 201, column: 6, scope: !780)
!793 = !DILocation(line: 201, column: 15, scope: !780)
!794 = !DILocation(line: 201, column: 20, scope: !780)
!795 = !DILocation(line: 201, column: 24, scope: !784)
!796 = !DILocation(line: 201, column: 23, scope: !784)
!797 = !DILocation(line: 201, column: 29, scope: !784)
!798 = !DILocation(line: 200, column: 6, scope: !799)
!799 = !DILexicalBlockFile(scope: !645, file: !30, discriminator: 3)
!800 = !DILocation(line: 201, column: 35, scope: !788)
!801 = !DILocation(line: 203, column: 4, scope: !802)
!802 = distinct !DILexicalBlock(scope: !780, file: !30, line: 201, column: 35)
!803 = !DILocation(line: 203, column: 8, scope: !802)
!804 = !DILocation(line: 204, column: 47, scope: !802)
!805 = !DILocation(line: 204, column: 3, scope: !802)
!806 = !DILocation(line: 205, column: 3, scope: !802)
!807 = !DILocation(line: 208, column: 26, scope: !808)
!808 = distinct !DILexicalBlock(scope: !645, file: !30, line: 208, column: 6)
!809 = !DILocation(line: 208, column: 6, scope: !808)
!810 = !DILocation(line: 208, column: 35, scope: !808)
!811 = !DILocation(line: 208, column: 6, scope: !645)
!812 = !DILocation(line: 209, column: 3, scope: !808)
!813 = !DILocation(line: 211, column: 16, scope: !645)
!814 = !DILocation(line: 211, column: 9, scope: !645)
!815 = !DILocation(line: 211, column: 5, scope: !645)
!816 = !DILocation(line: 212, column: 15, scope: !645)
!817 = !DILocation(line: 212, column: 2, scope: !645)
!818 = !DILocation(line: 212, column: 6, scope: !645)
!819 = !DILocation(line: 212, column: 13, scope: !645)
!820 = !DILocation(line: 212, column: 30, scope: !645)
!821 = !DILocation(line: 213, column: 16, scope: !645)
!822 = !DILocation(line: 213, column: 2, scope: !645)
!823 = !DILocation(line: 213, column: 6, scope: !645)
!824 = !DILocation(line: 213, column: 14, scope: !645)
!825 = !DILocation(line: 213, column: 33, scope: !645)
!826 = !DILocation(line: 214, column: 16, scope: !645)
!827 = !DILocation(line: 214, column: 2, scope: !645)
!828 = !DILocation(line: 214, column: 6, scope: !645)
!829 = !DILocation(line: 214, column: 14, scope: !645)
!830 = !DILocation(line: 214, column: 33, scope: !645)
!831 = !DILocation(line: 215, column: 1, scope: !645)
!832 = distinct !{!832, !831}
!833 = !DILocation(line: 215, column: 2, scope: !834)
!834 = !DILexicalBlockFile(scope: !835, file: !30, discriminator: 1)
!835 = distinct !DILexicalBlock(scope: !836, file: !30, line: 215, column: 10)
!836 = distinct !DILexicalBlock(scope: !645, file: !30, line: 215, column: 4)
!837 = !DILocation(line: 215, column: 9, scope: !834)
!838 = !DILocation(line: 215, column: 4, scope: !834)
!839 = !DILocation(line: 215, column: 1, scope: !834)
!840 = !DILocation(line: 215, column: 10, scope: !834)
!841 = !DILocation(line: 215, column: 14, scope: !834)
!842 = !DILocation(line: 215, column: 1, scope: !843)
!843 = !DILexicalBlockFile(scope: !835, file: !30, discriminator: 2)
!844 = !DILocation(line: 215, column: 2, scope: !843)
!845 = !DILocation(line: 215, column: 9, scope: !843)
!846 = !DILocation(line: 215, column: 4, scope: !843)
!847 = !DILocation(line: 215, column: 10, scope: !843)
!848 = !DILocation(line: 215, column: 30, scope: !843)
!849 = !DILocation(line: 215, column: 1, scope: !850)
!850 = !DILexicalBlockFile(scope: !836, file: !30, discriminator: 3)
!851 = !DILocation(line: 215, column: 2, scope: !850)
!852 = !DILocation(line: 215, column: 9, scope: !850)
!853 = !DILocation(line: 215, column: 4, scope: !850)
!854 = !DILocation(line: 215, column: 13, scope: !850)
!855 = !DILocation(line: 215, column: 10, scope: !850)
!856 = !DILocation(line: 215, column: 14, scope: !850)
!857 = !DILocation(line: 215, column: 14, scope: !858)
!858 = !DILexicalBlockFile(scope: !836, file: !30, discriminator: 4)
!859 = !DILocation(line: 218, column: 6, scope: !860)
!860 = distinct !DILexicalBlock(scope: !645, file: !30, line: 218, column: 6)
!861 = !DILocation(line: 218, column: 13, scope: !860)
!862 = !DILocation(line: 218, column: 6, scope: !645)
!863 = !DILocation(line: 219, column: 8, scope: !860)
!864 = !DILocation(line: 219, column: 3, scope: !860)
!865 = !DILocation(line: 220, column: 6, scope: !866)
!866 = distinct !DILexicalBlock(scope: !645, file: !30, line: 220, column: 6)
!867 = !DILocation(line: 220, column: 14, scope: !866)
!868 = !DILocation(line: 220, column: 6, scope: !645)
!869 = !DILocation(line: 221, column: 8, scope: !866)
!870 = !DILocation(line: 221, column: 3, scope: !866)
!871 = !DILocation(line: 222, column: 6, scope: !872)
!872 = distinct !DILexicalBlock(scope: !645, file: !30, line: 222, column: 6)
!873 = !DILocation(line: 222, column: 11, scope: !872)
!874 = !DILocation(line: 222, column: 6, scope: !645)
!875 = !DILocation(line: 223, column: 8, scope: !872)
!876 = !DILocation(line: 223, column: 3, scope: !872)
!877 = !DILocation(line: 224, column: 6, scope: !878)
!878 = distinct !DILexicalBlock(scope: !645, file: !30, line: 224, column: 6)
!879 = !DILocation(line: 224, column: 13, scope: !878)
!880 = !DILocation(line: 224, column: 6, scope: !645)
!881 = !DILocation(line: 225, column: 10, scope: !878)
!882 = !DILocation(line: 225, column: 3, scope: !878)
!883 = !DILocation(line: 227, column: 10, scope: !645)
!884 = !DILocation(line: 227, column: 2, scope: !645)
!885 = distinct !DISubprogram(name: "delqueue", scope: !30, file: !30, line: 343, type: !886, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !41}
!888 = !DILocalVariable(name: "it", arg: 1, scope: !885, file: !30, line: 343, type: !41)
!889 = !DILocation(line: 343, column: 24, scope: !885)
!890 = !DILocation(line: 345, column: 9, scope: !885)
!891 = !DILocation(line: 345, column: 13, scope: !885)
!892 = !DILocation(line: 345, column: 2, scope: !885)
!893 = !DILocation(line: 346, column: 9, scope: !885)
!894 = !DILocation(line: 346, column: 13, scope: !885)
!895 = !DILocation(line: 346, column: 2, scope: !885)
!896 = !DILocation(line: 347, column: 6, scope: !897)
!897 = distinct !DILexicalBlock(scope: !885, file: !30, line: 347, column: 6)
!898 = !DILocation(line: 347, column: 10, scope: !897)
!899 = !DILocation(line: 347, column: 17, scope: !897)
!900 = !DILocation(line: 347, column: 6, scope: !885)
!901 = !DILocation(line: 348, column: 10, scope: !897)
!902 = !DILocation(line: 348, column: 14, scope: !897)
!903 = !DILocation(line: 348, column: 3, scope: !897)
!904 = !DILocation(line: 349, column: 6, scope: !905)
!905 = distinct !DILexicalBlock(scope: !885, file: !30, line: 349, column: 6)
!906 = !DILocation(line: 349, column: 10, scope: !905)
!907 = !DILocation(line: 349, column: 16, scope: !905)
!908 = !DILocation(line: 349, column: 6, scope: !885)
!909 = !DILocation(line: 350, column: 10, scope: !905)
!910 = !DILocation(line: 350, column: 14, scope: !905)
!911 = !DILocation(line: 350, column: 3, scope: !905)
!912 = !DILocation(line: 351, column: 7, scope: !885)
!913 = !DILocation(line: 351, column: 2, scope: !885)
!914 = !DILocation(line: 352, column: 1, scope: !885)
!915 = distinct !DISubprogram(name: "acquirespool", scope: !30, file: !30, line: 355, type: !437, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!916 = !DILocalVariable(name: "it", arg: 1, scope: !915, file: !30, line: 355, type: !41)
!917 = !DILocation(line: 355, column: 28, scope: !915)
!918 = !DILocalVariable(name: "queuefd", scope: !915, file: !30, line: 357, type: !24)
!919 = !DILocation(line: 357, column: 6, scope: !915)
!920 = !DILocation(line: 359, column: 6, scope: !921)
!921 = distinct !DILexicalBlock(scope: !915, file: !30, line: 359, column: 6)
!922 = !DILocation(line: 359, column: 10, scope: !921)
!923 = !DILocation(line: 359, column: 17, scope: !921)
!924 = !DILocation(line: 359, column: 6, scope: !915)
!925 = !DILocation(line: 360, column: 25, scope: !926)
!926 = distinct !DILexicalBlock(scope: !921, file: !30, line: 359, column: 25)
!927 = !DILocation(line: 360, column: 29, scope: !926)
!928 = !DILocation(line: 360, column: 13, scope: !926)
!929 = !DILocation(line: 360, column: 11, scope: !926)
!930 = !DILocation(line: 361, column: 7, scope: !931)
!931 = distinct !DILexicalBlock(scope: !926, file: !30, line: 361, column: 7)
!932 = !DILocation(line: 361, column: 15, scope: !931)
!933 = !DILocation(line: 361, column: 7, scope: !926)
!934 = !DILocation(line: 362, column: 4, scope: !931)
!935 = !DILocation(line: 363, column: 23, scope: !926)
!936 = !DILocation(line: 363, column: 16, scope: !926)
!937 = !DILocation(line: 363, column: 3, scope: !926)
!938 = !DILocation(line: 363, column: 7, scope: !926)
!939 = !DILocation(line: 363, column: 14, scope: !926)
!940 = !DILocation(line: 364, column: 7, scope: !941)
!941 = distinct !DILexicalBlock(scope: !926, file: !30, line: 364, column: 7)
!942 = !DILocation(line: 364, column: 11, scope: !941)
!943 = !DILocation(line: 364, column: 18, scope: !941)
!944 = !DILocation(line: 364, column: 7, scope: !926)
!945 = !DILocation(line: 365, column: 4, scope: !941)
!946 = !DILocation(line: 366, column: 2, scope: !926)
!947 = !DILocation(line: 368, column: 6, scope: !948)
!948 = distinct !DILexicalBlock(scope: !915, file: !30, line: 368, column: 6)
!949 = !DILocation(line: 368, column: 10, scope: !948)
!950 = !DILocation(line: 368, column: 16, scope: !948)
!951 = !DILocation(line: 368, column: 6, scope: !915)
!952 = !DILocation(line: 369, column: 21, scope: !953)
!953 = distinct !DILexicalBlock(scope: !948, file: !30, line: 368, column: 24)
!954 = !DILocation(line: 369, column: 25, scope: !953)
!955 = !DILocation(line: 369, column: 15, scope: !953)
!956 = !DILocation(line: 369, column: 3, scope: !953)
!957 = !DILocation(line: 369, column: 7, scope: !953)
!958 = !DILocation(line: 369, column: 13, scope: !953)
!959 = !DILocation(line: 370, column: 7, scope: !960)
!960 = distinct !DILexicalBlock(scope: !953, file: !30, line: 370, column: 7)
!961 = !DILocation(line: 370, column: 11, scope: !960)
!962 = !DILocation(line: 370, column: 17, scope: !960)
!963 = !DILocation(line: 370, column: 7, scope: !953)
!964 = !DILocation(line: 371, column: 4, scope: !960)
!965 = !DILocation(line: 372, column: 2, scope: !953)
!966 = !DILocation(line: 374, column: 2, scope: !915)
!967 = !DILocation(line: 377, column: 7, scope: !968)
!968 = distinct !DILexicalBlock(scope: !915, file: !30, line: 377, column: 5)
!969 = !DILocation(line: 377, column: 6, scope: !968)
!970 = !DILocation(line: 377, column: 11, scope: !968)
!971 = !DILocation(line: 377, column: 5, scope: !915)
!972 = !DILocation(line: 378, column: 3, scope: !968)
!973 = !DILocation(line: 379, column: 2, scope: !915)
!974 = !DILocation(line: 380, column: 2, scope: !915)
!975 = !DILocation(line: 381, column: 1, scope: !915)
!976 = distinct !DISubprogram(name: "dropspool", scope: !30, file: !30, line: 384, type: !977, isLocal: false, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !33, !41}
!979 = !DILocalVariable(name: "queue", arg: 1, scope: !976, file: !30, line: 384, type: !33)
!980 = !DILocation(line: 384, column: 25, scope: !976)
!981 = !DILocalVariable(name: "keep", arg: 2, scope: !976, file: !30, line: 384, type: !41)
!982 = !DILocation(line: 384, column: 46, scope: !976)
!983 = !DILocalVariable(name: "it", scope: !976, file: !30, line: 386, type: !41)
!984 = !DILocation(line: 386, column: 16, scope: !976)
!985 = !DILocation(line: 388, column: 2, scope: !986)
!986 = distinct !DILexicalBlock(scope: !976, file: !30, line: 388, column: 1)
!987 = !DILocation(line: 388, column: 9, scope: !986)
!988 = !DILocation(line: 388, column: 4, scope: !986)
!989 = !DILocation(line: 388, column: 3, scope: !986)
!990 = !DILocation(line: 388, column: 6, scope: !986)
!991 = !DILocation(line: 388, column: 1, scope: !992)
!992 = !DILexicalBlockFile(scope: !993, file: !30, discriminator: 1)
!993 = distinct !DILexicalBlock(scope: !986, file: !30, line: 388, column: 1)
!994 = !DILocation(line: 389, column: 7, scope: !995)
!995 = distinct !DILexicalBlock(scope: !996, file: !30, line: 389, column: 7)
!996 = distinct !DILexicalBlock(scope: !993, file: !30, line: 388, column: 39)
!997 = !DILocation(line: 389, column: 13, scope: !995)
!998 = !DILocation(line: 389, column: 10, scope: !995)
!999 = !DILocation(line: 389, column: 7, scope: !996)
!1000 = !DILocation(line: 390, column: 4, scope: !995)
!1001 = !DILocation(line: 392, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !996, file: !30, line: 392, column: 7)
!1003 = !DILocation(line: 392, column: 11, scope: !1002)
!1004 = !DILocation(line: 392, column: 18, scope: !1002)
!1005 = !DILocation(line: 392, column: 7, scope: !996)
!1006 = !DILocation(line: 393, column: 11, scope: !1002)
!1007 = !DILocation(line: 393, column: 15, scope: !1002)
!1008 = !DILocation(line: 393, column: 4, scope: !1002)
!1009 = !DILocation(line: 394, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !996, file: !30, line: 394, column: 7)
!1011 = !DILocation(line: 394, column: 11, scope: !1010)
!1012 = !DILocation(line: 394, column: 17, scope: !1010)
!1013 = !DILocation(line: 394, column: 7, scope: !996)
!1014 = !DILocation(line: 395, column: 11, scope: !1010)
!1015 = !DILocation(line: 395, column: 15, scope: !1010)
!1016 = !DILocation(line: 395, column: 4, scope: !1010)
!1017 = !DILocation(line: 396, column: 2, scope: !996)
!1018 = !DILocation(line: 388, column: 1, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !993, file: !30, discriminator: 2)
!1020 = !DILocation(line: 388, column: 2, scope: !1019)
!1021 = !DILocation(line: 388, column: 3, scope: !1019)
!1022 = distinct !{!1022, !1023}
!1023 = !DILocation(line: 388, column: 1, scope: !976)
!1024 = !DILocation(line: 397, column: 1, scope: !976)
!1025 = distinct !DISubprogram(name: "flushqueue_since", scope: !30, file: !30, line: 400, type: !1026, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!24, !144}
!1028 = !DILocalVariable(name: "period", arg: 1, scope: !1025, file: !30, line: 400, type: !144)
!1029 = !DILocation(line: 400, column: 31, scope: !1025)
!1030 = !DILocalVariable(name: "st", scope: !1025, file: !30, line: 402, type: !133)
!1031 = !DILocation(line: 402, column: 21, scope: !1025)
!1032 = !DILocalVariable(name: "now", scope: !1025, file: !30, line: 403, type: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1034, line: 30, size: 128, align: 64, elements: !1035)
!1034 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/lichi/Desktop/dma/task1")
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1033, file: !1034, line: 32, baseType: !161, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1033, file: !1034, line: 33, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !91, line: 141, baseType: !92)
!1039 = !DILocation(line: 403, column: 17, scope: !1025)
!1040 = !DILocalVariable(name: "flushfn", scope: !1025, file: !30, line: 404, type: !55)
!1041 = !DILocation(line: 404, column: 15, scope: !1025)
!1042 = !DILocation(line: 406, column: 41, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1025, file: !30, line: 406, column: 6)
!1044 = !DILocation(line: 406, column: 6, scope: !1043)
!1045 = !DILocation(line: 406, column: 60, scope: !1043)
!1046 = !DILocation(line: 406, column: 6, scope: !1025)
!1047 = !DILocation(line: 407, column: 3, scope: !1043)
!1048 = !DILocation(line: 408, column: 11, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1025, file: !30, line: 408, column: 6)
!1050 = !DILocation(line: 408, column: 6, scope: !1049)
!1051 = !DILocation(line: 408, column: 25, scope: !1049)
!1052 = !DILocation(line: 408, column: 6, scope: !1025)
!1053 = !DILocation(line: 409, column: 8, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1049, file: !30, line: 408, column: 30)
!1055 = !DILocation(line: 409, column: 3, scope: !1054)
!1056 = !DILocation(line: 410, column: 3, scope: !1054)
!1057 = !DILocation(line: 412, column: 7, scope: !1025)
!1058 = !DILocation(line: 412, column: 2, scope: !1025)
!1059 = !DILocation(line: 413, column: 10, scope: !1025)
!1060 = !DILocation(line: 414, column: 6, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1025, file: !30, line: 414, column: 6)
!1062 = !DILocation(line: 414, column: 28, scope: !1061)
!1063 = !DILocation(line: 414, column: 6, scope: !1025)
!1064 = !DILocation(line: 415, column: 3, scope: !1061)
!1065 = !DILocation(line: 418, column: 9, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1025, file: !30, line: 418, column: 6)
!1067 = !DILocation(line: 418, column: 17, scope: !1066)
!1068 = !DILocation(line: 418, column: 26, scope: !1066)
!1069 = !DILocation(line: 418, column: 24, scope: !1066)
!1070 = !DILocation(line: 418, column: 40, scope: !1066)
!1071 = !DILocation(line: 418, column: 33, scope: !1066)
!1072 = !DILocation(line: 418, column: 6, scope: !1025)
!1073 = !DILocation(line: 419, column: 3, scope: !1066)
!1074 = !DILocation(line: 421, column: 3, scope: !1066)
!1075 = !DILocation(line: 422, column: 1, scope: !1025)
!1076 = distinct !DISubprogram(name: "flushqueue_signal", scope: !30, file: !30, line: 425, type: !1077, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !123)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!24}
!1079 = !DILocalVariable(name: "flushfn", scope: !1076, file: !30, line: 427, type: !55)
!1080 = !DILocation(line: 427, column: 15, scope: !1076)
!1081 = !DILocalVariable(name: "fd", scope: !1076, file: !30, line: 428, type: !24)
!1082 = !DILocation(line: 428, column: 6, scope: !1076)
!1083 = !DILocation(line: 430, column: 48, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1076, file: !30, line: 430, column: 13)
!1085 = !DILocation(line: 430, column: 13, scope: !1084)
!1086 = !DILocation(line: 430, column: 67, scope: !1084)
!1087 = !DILocation(line: 430, column: 13, scope: !1076)
!1088 = !DILocation(line: 431, column: 3, scope: !1084)
!1089 = !DILocation(line: 432, column: 12, scope: !1076)
!1090 = !DILocation(line: 432, column: 7, scope: !1076)
!1091 = !DILocation(line: 432, column: 5, scope: !1076)
!1092 = !DILocation(line: 433, column: 6, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1076, file: !30, line: 433, column: 6)
!1094 = !DILocation(line: 433, column: 9, scope: !1093)
!1095 = !DILocation(line: 433, column: 6, scope: !1076)
!1096 = !DILocation(line: 434, column: 3, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !30, line: 433, column: 14)
