; ModuleID = './line2-aliases_scan.o.i'
source_filename = "./line2-aliases_scan.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.yy_buffer_state = type { %struct._IO_FILE*, i8*, i8*, i64, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.YYSTYPE = type { i8* }

@yyin = global %struct._IO_FILE* null, align 8
@yyout = global %struct._IO_FILE* null, align 8
@yylineno = global i32 1, align 4
@yy_flex_debug = global i32 0, align 4
@yy_init = internal global i32 0, align 4
@yy_start = internal global i32 0, align 4
@stdin = external global %struct._IO_FILE*, align 8
@stdout = external global %struct._IO_FILE*, align 8
@yy_buffer_stack = internal global %struct.yy_buffer_state** null, align 8
@yy_buffer_stack_top = internal global i64 0, align 8
@yy_c_buf_p = internal global i8* null, align 8
@yy_hold_char = internal global i8 0, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !88)
!1 = !DIFile(filename: "line2-aliases_scan.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !78, !24, !65, !25, !87, !16}
!4 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!5 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 216, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!9 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_BUFFER_STATE", file: !11, line: 161, baseType: !12)
!11 = !DIFile(filename: "<stdout>", directory: "/home/lichi/Desktop/dma/task1")
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "yy_buffer_state", file: !11, line: 217, size: 512, align: 64, elements: !14)
!14 = !{!15, !75, !76, !77, !79, !80, !81, !82, !83, !84, !85, !86}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "yy_input_file", scope: !13, file: !11, line: 219, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 48, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 241, size: 1728, align: 64, elements: !21)
!20 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!21 = !{!22, !23, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !44, !45, !46, !47, !51, !53, !55, !59, !62, !64, !66, !67, !68, !69, !70, !71}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !20, line: 242, baseType: !6, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !19, file: !20, line: 247, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !19, file: !20, line: 248, baseType: !24, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !19, file: !20, line: 249, baseType: !24, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !19, file: !20, line: 250, baseType: !24, size: 64, align: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !19, file: !20, line: 251, baseType: !24, size: 64, align: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !19, file: !20, line: 252, baseType: !24, size: 64, align: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !19, file: !20, line: 253, baseType: !24, size: 64, align: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !19, file: !20, line: 254, baseType: !24, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !19, file: !20, line: 256, baseType: !24, size: 64, align: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !19, file: !20, line: 257, baseType: !24, size: 64, align: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !19, file: !20, line: 258, baseType: !24, size: 64, align: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !19, file: !20, line: 260, baseType: !37, size: 64, align: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 156, size: 192, align: 64, elements: !39)
!39 = !{!40, !41, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !38, file: !20, line: 157, baseType: !37, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !38, file: !20, line: 158, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !38, file: !20, line: 162, baseType: !6, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !19, file: !20, line: 262, baseType: !42, size: 64, align: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !19, file: !20, line: 264, baseType: !6, size: 32, align: 32, offset: 896)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !20, line: 268, baseType: !6, size: 32, align: 32, offset: 928)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !19, file: !20, line: 270, baseType: !48, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !49, line: 131, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!50 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !19, file: !20, line: 274, baseType: !52, size: 16, align: 16, offset: 1024)
!52 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !19, file: !20, line: 275, baseType: !54, size: 8, align: 8, offset: 1040)
!54 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !19, file: !20, line: 276, baseType: !56, size: 8, align: 8, offset: 1048)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, align: 8, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 1)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !20, line: 280, baseType: !60, size: 64, align: 64, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 150, baseType: null)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !20, line: 289, baseType: !63, size: 64, align: 64, offset: 1152)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !49, line: 132, baseType: !50)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !19, file: !20, line: 297, baseType: !65, size: 64, align: 64, offset: 1216)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !19, file: !20, line: 298, baseType: !65, size: 64, align: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !19, file: !20, line: 299, baseType: !65, size: 64, align: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !19, file: !20, line: 300, baseType: !65, size: 64, align: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !19, file: !20, line: 302, baseType: !7, size: 64, align: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !19, file: !20, line: 303, baseType: !6, size: 32, align: 32, offset: 1536)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !19, file: !20, line: 305, baseType: !72, size: 160, align: 8, offset: 1568)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 20)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "yy_ch_buf", scope: !13, file: !11, line: 221, baseType: !24, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_pos", scope: !13, file: !11, line: 222, baseType: !24, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buf_size", scope: !13, file: !11, line: 227, baseType: !78, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_size_t", file: !11, line: 166, baseType: !7)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "yy_n_chars", scope: !13, file: !11, line: 232, baseType: !6, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_our_buffer", scope: !13, file: !11, line: 238, baseType: !6, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "yy_is_interactive", scope: !13, file: !11, line: 245, baseType: !6, size: 32, align: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "yy_at_bol", scope: !13, file: !11, line: 251, baseType: !6, size: 32, align: 32, offset: 352)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "yy_bs_lineno", scope: !13, file: !11, line: 253, baseType: !6, size: 32, align: 32, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "yy_bs_column", scope: !13, file: !11, line: 254, baseType: !6, size: 32, align: 32, offset: 416)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "yy_fill_buffer", scope: !13, file: !11, line: 259, baseType: !6, size: 32, align: 32, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "yy_buffer_status", scope: !13, file: !11, line: 261, baseType: !6, size: 32, align: 32, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !99, !100, !101, !102, !103, !105, !106, !107, !113, !122, !130, !134, !136, !140, !142, !147}
!89 = distinct !DIGlobalVariable(name: "yyin", scope: !0, file: !11, line: 365, type: !16, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @yyin)
!90 = distinct !DIGlobalVariable(name: "yyout", scope: !0, file: !11, line: 365, type: !16, isLocal: false, isDefinition: true, variable: %struct._IO_FILE** @yyout)
!91 = distinct !DIGlobalVariable(name: "yylineno", scope: !0, file: !11, line: 371, type: !6, isLocal: false, isDefinition: true, variable: i32* @yylineno)
!92 = distinct !DIGlobalVariable(name: "yy_flex_debug", scope: !0, file: !11, line: 496, type: !6, isLocal: false, isDefinition: true, variable: i32* @yy_flex_debug)
!93 = distinct !DIGlobalVariable(name: "yy_hold_char", scope: !0, file: !11, line: 301, type: !25, isLocal: true, isDefinition: true, variable: i8* @yy_hold_char)
!94 = distinct !DIGlobalVariable(name: "yy_n_chars", scope: !0, file: !11, line: 302, type: !6, isLocal: true, isDefinition: true, variable: i32* @yy_n_chars)
!95 = distinct !DIGlobalVariable(name: "yyleng", scope: !0, file: !11, line: 303, type: !78, isLocal: false, isDefinition: true, variable: i64* @yyleng)
!96 = distinct !DIGlobalVariable(name: "yy_did_buffer_switch_on_eof", scope: !0, file: !11, line: 313, type: !6, isLocal: true, isDefinition: true, variable: i32* @yy_did_buffer_switch_on_eof)
!97 = distinct !DIGlobalVariable(name: "yy_last_accepting_state", scope: !0, file: !11, line: 492, type: !98, isLocal: true, isDefinition: true, variable: i32* @yy_last_accepting_state)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_type", file: !11, line: 367, baseType: !6)
!99 = distinct !DIGlobalVariable(name: "yy_last_accepting_cpos", scope: !0, file: !11, line: 493, type: !24, isLocal: true, isDefinition: true, variable: i8** @yy_last_accepting_cpos)
!100 = distinct !DIGlobalVariable(name: "yytext", scope: !0, file: !11, line: 505, type: !24, isLocal: false, isDefinition: true, variable: i8** @yytext)
!101 = distinct !DIGlobalVariable(name: "yy_init", scope: !0, file: !11, line: 307, type: !6, isLocal: true, isDefinition: true, variable: i32* @yy_init)
!102 = distinct !DIGlobalVariable(name: "yy_start", scope: !0, file: !11, line: 308, type: !6, isLocal: true, isDefinition: true, variable: i32* @yy_start)
!103 = distinct !DIGlobalVariable(name: "yy_buffer_stack", scope: !0, file: !11, line: 283, type: !104, isLocal: true, isDefinition: true, variable: %struct.yy_buffer_state*** @yy_buffer_stack)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!105 = distinct !DIGlobalVariable(name: "yy_buffer_stack_top", scope: !0, file: !11, line: 281, type: !7, isLocal: true, isDefinition: true, variable: i64* @yy_buffer_stack_top)
!106 = distinct !DIGlobalVariable(name: "yy_c_buf_p", scope: !0, file: !11, line: 306, type: !24, isLocal: true, isDefinition: true, variable: i8** @yy_c_buf_p)
!107 = distinct !DIGlobalVariable(name: "yy_ec", scope: !0, file: !11, line: 414, type: !108, isLocal: true, isDefinition: true, variable: [256 x i8]* @yy_ec)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, align: 8, elements: !111)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "YY_CHAR", file: !11, line: 363, baseType: !5)
!111 = !{!112}
!112 = !DISubrange(count: 256)
!113 = distinct !DIGlobalVariable(name: "yy_accept", scope: !0, file: !11, line: 406, type: !114, isLocal: true, isDefinition: true, variable: [33 x i16]* @yy_accept)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 528, align: 16, elements: !120)
