; ModuleID = './line4-conf.o.i'
source_filename = "./line4-conf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.authusers = type { %struct.authuser* }
%struct.authuser = type { %struct.anon, i8*, i8*, i8* }
%struct.anon = type { %struct.authuser* }
%struct.config = type { i8*, i32, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, %struct.ssl_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line4-conf.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!9 = distinct !DISubprogram(name: "trim_line", scope: !10, file: !10, line: 54, type: !11, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!10 = !DIFile(filename: "conf.c", directory: "/home/lichi/Desktop/dma/task1")
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!14 = !DILocalVariable(name: "line", arg: 1, scope: !9, file: !10, line: 54, type: !13)
!15 = !DIExpression()
!16 = !DILocation(line: 54, column: 17, scope: !9)
!17 = !DILocalVariable(name: "linelen", scope: !9, file: !10, line: 56, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 216, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!20 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!21 = !DILocation(line: 56, column: 9, scope: !9)
!22 = !DILocalVariable(name: "p", scope: !9, file: !10, line: 57, type: !13)
!23 = !DILocation(line: 57, column: 8, scope: !9)
!24 = !DILocation(line: 59, column: 18, scope: !25)
!25 = distinct !DILexicalBlock(scope: !9, file: !10, line: 59, column: 6)
!26 = !DILocation(line: 59, column: 11, scope: !25)
!27 = !DILocation(line: 59, column: 9, scope: !25)
!28 = !DILocation(line: 59, column: 6, scope: !9)
!29 = !DILocation(line: 60, column: 4, scope: !25)
!30 = !DILocation(line: 60, column: 6, scope: !25)
!31 = !DILocation(line: 60, column: 3, scope: !25)
!32 = !DILocation(line: 63, column: 19, scope: !9)
!33 = !DILocation(line: 63, column: 12, scope: !9)
!34 = !DILocation(line: 63, column: 10, scope: !9)
!35 = !DILocation(line: 64, column: 6, scope: !36)
!36 = distinct !DILexicalBlock(scope: !9, file: !10, line: 64, column: 6)
!37 = !DILocation(line: 64, column: 14, scope: !36)
!38 = !DILocation(line: 64, column: 6, scope: !9)
!39 = !DILocation(line: 65, column: 8, scope: !40)
!40 = distinct !DILexicalBlock(scope: !41, file: !10, line: 65, column: 7)
!41 = distinct !DILexicalBlock(scope: !36, file: !10, line: 64, column: 22)
!42 = !DILocation(line: 65, column: 16, scope: !40)
!43 = !DILocation(line: 65, column: 21, scope: !40)
!44 = !DILocation(line: 65, column: 7, scope: !41)
!45 = !DILocation(line: 66, column: 4, scope: !46)
!46 = distinct !DILexicalBlock(scope: !40, file: !10, line: 65, column: 29)
!47 = !DILocation(line: 67, column: 4, scope: !46)
!48 = !DILocation(line: 69, column: 12, scope: !41)
!49 = !DILocation(line: 69, column: 17, scope: !41)
!50 = !DILocation(line: 69, column: 23, scope: !41)
!51 = !DILocation(line: 69, column: 30, scope: !41)
!52 = !DILocation(line: 69, column: 38, scope: !41)
!53 = !DILocation(line: 69, column: 3, scope: !41)
!54 = !DILocation(line: 70, column: 3, scope: !41)
!55 = !DILocation(line: 70, column: 11, scope: !41)
!56 = !DILocation(line: 71, column: 2, scope: !41)
!57 = !DILocation(line: 72, column: 1, scope: !9)
!58 = distinct !DISubprogram(name: "parse_authfile", scope: !10, file: !10, line: 94, type: !59, isLocal: false, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!63 = !DILocalVariable(name: "path", arg: 1, scope: !58, file: !10, line: 94, type: !61)
!64 = !DILocation(line: 94, column: 28, scope: !58)
!65 = !DILocalVariable(name: "line", scope: !58, file: !10, line: 96, type: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 2048)
!69 = !DILocation(line: 96, column: 7, scope: !58)
!70 = !DILocalVariable(name: "au", scope: !58, file: !10, line: 97, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "authuser", file: !73, line: 143, size: 256, align: 64, elements: !74)
!73 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!74 = !{!75, !79, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !73, line: 144, baseType: !76, size: 64, align: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !73, line: 144, size: 64, align: 64, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sle_next", scope: !76, file: !73, line: 144, baseType: !71, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "login", scope: !72, file: !73, line: 145, baseType: !13, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !72, file: !73, line: 146, baseType: !13, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !72, file: !73, line: 147, baseType: !13, size: 64, align: 64, offset: 192)
!82 = !DILocation(line: 97, column: 19, scope: !58)
!83 = !DILocalVariable(name: "a", scope: !58, file: !10, line: 98, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 48, baseType: !87)
!86 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !88, line: 241, size: 1728, align: 64, elements: !89)
!88 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!89 = !{!90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !111, !112, !113, !114, !118, !120, !122, !126, !129, !131, !132, !133, !134, !135, !136, !137}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !87, file: !88, line: 242, baseType: !91, size: 32, align: 32)
!91 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !87, file: !88, line: 247, baseType: !13, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !87, file: !88, line: 248, baseType: !13, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !87, file: !88, line: 249, baseType: !13, size: 64, align: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !87, file: !88, line: 250, baseType: !13, size: 64, align: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !87, file: !88, line: 251, baseType: !13, size: 64, align: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !87, file: !88, line: 252, baseType: !13, size: 64, align: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !87, file: !88, line: 253, baseType: !13, size: 64, align: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !87, file: !88, line: 254, baseType: !13, size: 64, align: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !87, file: !88, line: 256, baseType: !13, size: 64, align: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !87, file: !88, line: 257, baseType: !13, size: 64, align: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !87, file: !88, line: 258, baseType: !13, size: 64, align: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !87, file: !88, line: 260, baseType: !104, size: 64, align: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !88, line: 156, size: 192, align: 64, elements: !106)
!106 = !{!107, !108, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !105, file: !88, line: 157, baseType: !104, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !105, file: !88, line: 158, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !105, file: !88, line: 162, baseType: !91, size: 32, align: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !87, file: !88, line: 262, baseType: !109, size: 64, align: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !87, file: !88, line: 264, baseType: !91, size: 32, align: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !87, file: !88, line: 268, baseType: !91, size: 32, align: 32, offset: 928)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !87, file: !88, line: 270, baseType: !115, size: 64, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 131, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !87, file: !88, line: 274, baseType: !119, size: 16, align: 16, offset: 1024)
!119 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !87, file: !88, line: 275, baseType: !121, size: 8, align: 8, offset: 1040)
!121 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !87, file: !88, line: 276, baseType: !123, size: 8, align: 8, offset: 1048)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, align: 8, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 1)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !87, file: !88, line: 280, baseType: !127, size: 64, align: 64, offset: 1088)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !88, line: 150, baseType: null)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !87, file: !88, line: 289, baseType: !130, size: 64, align: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 132, baseType: !117)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !87, file: !88, line: 297, baseType: !5, size: 64, align: 64, offset: 1216)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !87, file: !88, line: 298, baseType: !5, size: 64, align: 64, offset: 1280)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !87, file: !88, line: 299, baseType: !5, size: 64, align: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !87, file: !88, line: 300, baseType: !5, size: 64, align: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !87, file: !88, line: 302, baseType: !18, size: 64, align: 64, offset: 1472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !87, file: !88, line: 303, baseType: !91, size: 32, align: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !87, file: !88, line: 305, baseType: !138, size: 160, align: 8, offset: 1568)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = !DILocation(line: 98, column: 8, scope: !58)
!142 = !DILocalVariable(name: "data", scope: !58, file: !10, line: 99, type: !13)
!143 = !DILocation(line: 99, column: 8, scope: !58)
!144 = !DILocalVariable(name: "lineno", scope: !58, file: !10, line: 100, type: !91)
!145 = !DILocation(line: 100, column: 6, scope: !58)
!146 = !DILocation(line: 102, column: 12, scope: !58)
!147 = !DILocation(line: 102, column: 6, scope: !58)
!148 = !DILocation(line: 102, column: 4, scope: !58)
!149 = !DILocation(line: 103, column: 6, scope: !150)
!150 = distinct !DILexicalBlock(scope: !58, file: !10, line: 103, column: 6)
!151 = !DILocation(line: 103, column: 8, scope: !150)
!152 = !DILocation(line: 103, column: 6, scope: !58)
!153 = !DILocation(line: 104, column: 44, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !10, line: 103, column: 16)
!155 = !DILocation(line: 104, column: 3, scope: !154)
!156 = !DILocation(line: 106, column: 2, scope: !154)
!157 = !DILocation(line: 108, column: 2, scope: !58)
!158 = !DILocation(line: 108, column: 15, scope: !159)
!159 = !DILexicalBlockFile(scope: !58, file: !10, discriminator: 1)
!160 = !DILocation(line: 108, column: 10, scope: !159)
!161 = !DILocation(line: 108, column: 9, scope: !159)
!162 = !DILocation(line: 108, column: 2, scope: !159)
!163 = !DILocation(line: 109, column: 13, scope: !164)
!164 = distinct !DILexicalBlock(scope: !165, file: !10, line: 109, column: 7)
!165 = distinct !DILexicalBlock(scope: !58, file: !10, line: 108, column: 19)
!166 = !DILocation(line: 109, column: 33, scope: !164)
!167 = !DILocation(line: 109, column: 7, scope: !164)
!168 = !DILocation(line: 109, column: 36, scope: !164)
!169 = !DILocation(line: 109, column: 7, scope: !165)
!170 = !DILocation(line: 110, column: 4, scope: !164)
!171 = !DILocation(line: 111, column: 9, scope: !165)
!172 = !DILocation(line: 113, column: 9, scope: !165)
!173 = !DILocation(line: 113, column: 3, scope: !165)
!174 = !DILocation(line: 116, column: 7, scope: !175)
!175 = distinct !DILexicalBlock(scope: !165, file: !10, line: 116, column: 7)
!176 = !DILocation(line: 116, column: 13, scope: !175)
!177 = !DILocation(line: 116, column: 7, scope: !165)
!178 = !DILocation(line: 117, column: 4, scope: !175)
!179 = distinct !{!179, !157}
!180 = !DILocation(line: 119, column: 7, scope: !181)
!181 = distinct !DILexicalBlock(scope: !165, file: !10, line: 119, column: 7)
!182 = !DILocation(line: 119, column: 13, scope: !181)
!183 = !DILocation(line: 119, column: 7, scope: !165)
!184 = !DILocation(line: 120, column: 4, scope: !181)
!185 = !DILocation(line: 122, column: 8, scope: !165)
!186 = !DILocation(line: 122, column: 6, scope: !165)
!187 = !DILocation(line: 123, column: 7, scope: !188)
!188 = distinct !DILexicalBlock(scope: !165, file: !10, line: 123, column: 7)
!189 = !DILocation(line: 123, column: 10, scope: !188)
!190 = !DILocation(line: 123, column: 7, scope: !165)
!191 = !DILocation(line: 124, column: 4, scope: !188)
!192 = !DILocation(line: 126, column: 17, scope: !165)
!193 = !DILocation(line: 126, column: 10, scope: !165)
!194 = !DILocation(line: 126, column: 8, scope: !165)
!195 = !DILocation(line: 127, column: 15, scope: !165)
!196 = !DILocation(line: 127, column: 3, scope: !165)
!197 = !DILocation(line: 127, column: 7, scope: !165)
!198 = !DILocation(line: 127, column: 13, scope: !165)
!199 = !DILocation(line: 128, column: 14, scope: !165)
!200 = !DILocation(line: 128, column: 3, scope: !165)
!201 = !DILocation(line: 128, column: 7, scope: !165)
!202 = !DILocation(line: 128, column: 12, scope: !165)
!203 = !DILocation(line: 129, column: 18, scope: !165)
!204 = !DILocation(line: 129, column: 3, scope: !165)
!205 = !DILocation(line: 129, column: 7, scope: !165)
