; ModuleID = './line9-mail.o.i'
source_filename = "./line9-mail.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.config = type { i8*, i32, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, %struct.ssl_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !25)
!1 = !DIFile(filename: "line9-mail.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 142, size: 32, align: 32, elements: !19)
!4 = !DIFile(filename: "mail.c", directory: "/home/lichi/Desktop/dma/task1")
!5 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "parse_state", file: !4, line: 138, size: 8192, align: 32, elements: !6)
!6 = !{!7, !12, !14, !15, !16, !17, !18}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !5, file: !4, line: 139, baseType: !8, size: 8000, align: 8)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8000, align: 8, elements: !10)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !{!11}
!11 = !DISubrange(count: 1000)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !5, file: !4, line: 140, baseType: !13, size: 32, align: 32, offset: 8000)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !5, file: !4, line: 148, baseType: !3, size: 32, align: 32, offset: 8032)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !5, file: !4, line: 149, baseType: !13, size: 32, align: 32, offset: 8064)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !5, file: !4, line: 150, baseType: !13, size: 32, align: 32, offset: 8096)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "brackets", scope: !5, file: !4, line: 151, baseType: !13, size: 32, align: 32, offset: 8128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "esc", scope: !5, file: !4, line: 152, baseType: !13, size: 32, align: 32, offset: 8160)
!19 = !{!20, !21, !22, !23, !24}
!20 = !DIEnumerator(name: "NONE", value: 0)
!21 = !DIEnumerator(name: "START", value: 1)
!22 = !DIEnumerator(name: "MAIN", value: 2)
!23 = !DIEnumerator(name: "EOL", value: 3)
!24 = !DIEnumerator(name: "QUIT", value: 4)
!25 = !{!26, !27, !32}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 109, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dma/task1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 172, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !33, line: 135, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dma/task1")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!38 = distinct !DISubprogram(name: "bounce", scope: !4, file: !4, line: 44, type: !39, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !118)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !52}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qitem", file: !43, line: 105, size: 640, align: 64, elements: !44)
!43 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!44 = !{!45, !51, !54, !56, !57, !58, !59, !116, !117}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !43, line: 106, baseType: !46, size: 128, align: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !42, file: !43, line: 106, size: 128, align: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !46, file: !43, line: 106, baseType: !41, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !46, file: !43, line: 106, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !42, file: !43, line: 107, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !42, file: !43, line: 108, baseType: !55, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "queuefn", scope: !42, file: !43, line: 109, baseType: !55, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mailfn", scope: !42, file: !43, line: 110, baseType: !55, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "queueid", scope: !42, file: !43, line: 111, baseType: !55, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "queuef", scope: !42, file: !43, line: 112, baseType: !60, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 48, baseType: !63)
!62 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 241, size: 1728, align: 64, elements: !65)
!64 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !91, !93, !95, !99, !102, !104, !105, !106, !107, !108, !111, !112}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 242, baseType: !13, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 247, baseType: !55, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 248, baseType: !55, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 249, baseType: !55, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 250, baseType: !55, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 251, baseType: !55, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 252, baseType: !55, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 253, baseType: !55, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 254, baseType: !55, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 256, baseType: !55, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 257, baseType: !55, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 258, baseType: !55, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 260, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 156, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !64, line: 157, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !64, line: 158, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !64, line: 162, baseType: !13, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 262, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 264, baseType: !13, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 268, baseType: !13, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 270, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 131, baseType: !31)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 274, baseType: !92, size: 16, align: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 275, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 276, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 280, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 150, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 289, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 132, baseType: !31)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 297, baseType: !26, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 298, baseType: !26, size: 64, align: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 299, baseType: !26, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 300, baseType: !26, size: 64, align: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 302, baseType: !109, size: 64, align: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 216, baseType: !34)
!110 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 303, baseType: !13, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 305, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mailf", scope: !42, file: !43, line: 113, baseType: !60, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !42, file: !43, line: 114, baseType: !13, size: 32, align: 32, offset: 576)
!118 = !{}
!119 = !DILocalVariable(name: "it", arg: 1, scope: !38, file: !4, line: 44, type: !41)
!120 = !DIExpression()
!121 = !DILocation(line: 44, column: 22, scope: !38)
!122 = !DILocalVariable(name: "reason", arg: 2, scope: !38, file: !4, line: 44, type: !52)
!123 = !DILocation(line: 44, column: 38, scope: !38)
!124 = !DILocalVariable(name: "bounceq", scope: !38, file: !4, line: 46, type: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue", file: !43, line: 118, size: 320, align: 64, elements: !126)
!126 = !{!127, !131, !132, !133, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !125, file: !43, line: 119, baseType: !128, size: 64, align: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queueh", file: !43, line: 116, size: 64, align: 64, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lh_first", scope: !128, file: !43, line: 116, baseType: !41, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !125, file: !43, line: 120, baseType: !55, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "mailf", scope: !125, file: !43, line: 121, baseType: !60, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tmpf", scope: !125, file: !43, line: 122, baseType: !55, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sender", scope: !125, file: !43, line: 123, baseType: !52, size: 64, align: 64, offset: 256)
!135 = !DILocation(line: 46, column: 15, scope: !38)
!136 = !DILocalVariable(name: "line", scope: !38, file: !4, line: 47, type: !8)
!137 = !DILocation(line: 47, column: 7, scope: !38)
!138 = !DILocalVariable(name: "pos", scope: !38, file: !4, line: 48, type: !109)
!139 = !DILocation(line: 48, column: 9, scope: !38)
!140 = !DILocalVariable(name: "error", scope: !38, file: !4, line: 49, type: !13)
!141 = !DILocation(line: 49, column: 6, scope: !38)
!142 = !DILocation(line: 52, column: 6, scope: !143)
!143 = distinct !DILexicalBlock(scope: !38, file: !4, line: 52, column: 6)
!144 = !DILocation(line: 52, column: 10, scope: !143)
!145 = !DILocation(line: 52, column: 20, scope: !143)
!146 = !DILocation(line: 52, column: 6, scope: !38)
!147 = !DILocation(line: 53, column: 3, scope: !148)
!148 = distinct !DILexicalBlock(scope: !143, file: !4, line: 52, column: 26)
!149 = !DILocation(line: 54, column: 3, scope: !148)
!150 = !DILocation(line: 57, column: 2, scope: !38)
!151 = !DILocation(line: 58, column: 1, scope: !38)
!152 = distinct !{!152, !151}
!153 = !DILocation(line: 58, column: 10, scope: !154)
!154 = !DILexicalBlockFile(scope: !155, file: !4, discriminator: 1)
!155 = distinct !DILexicalBlock(scope: !38, file: !4, line: 58, column: 4)
!156 = !DILocation(line: 58, column: 4, scope: !154)
!157 = !DILocation(line: 58, column: 13, scope: !154)
!158 = !DILocation(line: 58, column: 28, scope: !154)
!159 = !DILocation(line: 59, column: 10, scope: !38)
!160 = !DILocation(line: 59, column: 17, scope: !38)
!161 = !DILocation(line: 60, column: 25, scope: !162)
!162 = distinct !DILexicalBlock(scope: !38, file: !4, line: 60, column: 6)
!163 = !DILocation(line: 60, column: 29, scope: !162)
!164 = !DILocation(line: 60, column: 6, scope: !162)
!165 = !DILocation(line: 60, column: 40, scope: !162)
!166 = !DILocation(line: 60, column: 6, scope: !38)
!167 = !DILocation(line: 61, column: 3, scope: !162)
!168 = !DILocation(line: 63, column: 6, scope: !169)
!169 = distinct !DILexicalBlock(scope: !38, file: !4, line: 63, column: 6)
!170 = !DILocation(line: 63, column: 26, scope: !169)
!171 = !DILocation(line: 63, column: 6, scope: !38)
!172 = !DILocation(line: 64, column: 3, scope: !169)
!173 = !DILocation(line: 66, column: 60, scope: !38)
!174 = !DILocation(line: 66, column: 2, scope: !38)
!175 = !DILocation(line: 67, column: 28, scope: !38)
!176 = !DILocation(line: 67, column: 2, scope: !38)
!177 = !DILocation(line: 69, column: 26, scope: !38)
!178 = !DILocation(line: 89, column: 11, scope: !38)
!179 = !DILocation(line: 90, column: 3, scope: !38)
!180 = !DILocation(line: 91, column: 3, scope: !38)
!181 = !DILocation(line: 92, column: 3, scope: !38)
!182 = !DILocation(line: 92, column: 7, scope: !38)
!183 = !DILocation(line: 93, column: 3, scope: !38)
!184 = !DILocation(line: 93, column: 7, scope: !38)
!185 = !DILocation(line: 94, column: 11, scope: !38)
!186 = !DILocation(line: 94, column: 15, scope: !38)
!187 = !DILocation(line: 95, column: 3, scope: !38)
!188 = !DILocation(line: 96, column: 35, scope: !38)
!189 = !DILocation(line: 97, column: 3, scope: !38)
!190 = !DILocation(line: 97, column: 7, scope: !38)
!191 = !DILocation(line: 98, column: 3, scope: !38)
!192 = !DILocation(line: 99, column: 10, scope: !38)
!193 = !DILocation(line: 99, column: 19, scope: !38)
!194 = !DILocation(line: 99, column: 3, scope: !38)
!195 = !DILocation(line: 69, column: 10, scope: !38)
!196 = !DILocation(line: 69, column: 8, scope: !38)
!197 = !DILocation(line: 102, column: 6, scope: !198)
!198 = distinct !DILexicalBlock(scope: !38, file: !4, line: 102, column: 6)
!199 = !DILocation(line: 102, column: 12, scope: !198)
!200 = !DILocation(line: 102, column: 6, scope: !38)
!201 = !DILocation(line: 103, column: 3, scope: !198)
!202 = !DILocation(line: 105, column: 12, scope: !203)
!203 = distinct !DILexicalBlock(scope: !38, file: !4, line: 105, column: 6)
