; ModuleID = './line12-util.o.i'
source_filename = "./line12-util.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.config = type { i8*, i32, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, %struct.ssl_st* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !18, globals: !31)
!1 = !DIFile(filename: "line12-util.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/dma/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !20, !21, !22, !23, !28}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !24, line: 85, baseType: !25)
!24 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/dma/task1")
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !20}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !29, line: 122, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dma/task1")
!30 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!31 = !{!32, !44, !45, !52, !57, !81}
!32 = distinct !DIGlobalVariable(name: "name", scope: !33, file: !34, line: 57, type: !41, isLocal: true, isDefinition: true, variable: [65 x i8]* @hostname.name)
!33 = distinct !DISubprogram(name: "hostname", scope: !34, file: !34, line: 52, type: !35, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!34 = !DIFile(filename: "util.c", directory: "/home/lichi/Desktop/dma/task1")
!35 = !DISubroutineType(types: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !{}
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 520, align: 8, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 65)
!44 = distinct !DIGlobalVariable(name: "initialized", scope: !33, file: !34, line: 58, type: !20, isLocal: true, isDefinition: true, variable: i32* @hostname.initialized)
!45 = distinct !DIGlobalVariable(name: "tag", scope: !46, file: !34, line: 121, type: !49, isLocal: true, isDefinition: true, variable: [50 x i8]* @setlogident.tag)
!46 = distinct !DISubprogram(name: "setlogident", scope: !34, file: !34, line: 119, type: !47, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !37, null}
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 400, align: 8, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 50)
!52 = distinct !DIGlobalVariable(name: "str", scope: !53, file: !34, line: 310, type: !49, isLocal: true, isDefinition: true, variable: [50 x i8]* @rfc822date.str)
!53 = distinct !DISubprogram(name: "rfc822date", scope: !34, file: !34, line: 308, type: !54, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!54 = !DISubroutineType(types: !55)
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!57 = distinct !DIGlobalVariable(name: "sigbuf", scope: !0, file: !34, line: 231, type: !58, isLocal: true, isDefinition: true, variable: [1 x %struct.__jmp_buf_tag]* @sigbuf)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigjmp_buf", file: !59, line: 92, baseType: !60)
!59 = !DIFile(filename: "/usr/include/setjmp.h", directory: "/home/lichi/Desktop/dma/task1")
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1600, align: 64, elements: !79)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !59, line: 34, size: 1600, align: 64, elements: !62)
!62 = !{!63, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !61, file: !59, line: 40, baseType: !64, size: 512, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !65, line: 31, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "/home/lichi/Desktop/dma/task1")
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 64, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !61, file: !59, line: 41, baseType: !20, size: 32, align: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !61, file: !59, line: 42, baseType: !71, size: 1024, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !72, line: 30, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/dma/task1")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 27, size: 1024, align: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !73, file: !72, line: 29, baseType: !76, size: 1024, align: 64)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1024, align: 64, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 16)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = distinct !DIGlobalVariable(name: "sigbuf_valid", scope: !0, file: !34, line: 232, type: !20, isLocal: true, isDefinition: true, variable: i32* @sigbuf_valid)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!85 = !DILocalVariable(name: "s", scope: !33, file: !34, line: 59, type: !56)
!86 = !DIExpression()
!87 = !DILocation(line: 59, column: 8, scope: !33)
!88 = !DILocation(line: 61, column: 6, scope: !89)
!89 = distinct !DILexicalBlock(scope: !33, file: !34, line: 61, column: 6)
!90 = !DILocation(line: 61, column: 6, scope: !33)
!91 = !DILocation(line: 62, column: 3, scope: !89)
!92 = !DILocation(line: 64, column: 13, scope: !93)
!93 = distinct !DILexicalBlock(scope: !33, file: !34, line: 64, column: 6)
!94 = !DILocation(line: 64, column: 22, scope: !93)
!95 = !DILocation(line: 64, column: 29, scope: !93)
!96 = !DILocation(line: 64, column: 41, scope: !97)
!97 = !DILexicalBlockFile(scope: !93, file: !34, discriminator: 1)
!98 = !DILocation(line: 64, column: 33, scope: !97)
!99 = !DILocation(line: 64, column: 6, scope: !97)
!100 = !DILocation(line: 65, column: 3, scope: !93)
!101 = !DILocation(line: 67, column: 13, scope: !102)
!102 = distinct !DILexicalBlock(scope: !33, file: !34, line: 67, column: 6)
!103 = !DILocation(line: 67, column: 6, scope: !102)
!104 = !DILocation(line: 67, column: 25, scope: !102)
!105 = !DILocation(line: 67, column: 6, scope: !33)
!106 = !DILocalVariable(name: "fp", scope: !107, file: !34, line: 72, type: !108)
!107 = distinct !DILexicalBlock(scope: !102, file: !34, line: 67, column: 33)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !110, line: 48, baseType: !111)
!110 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/dma/task1")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !112, line: 241, size: 1728, align: 64, elements: !113)
!112 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/dma/task1")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !134, !135, !136, !137, !140, !141, !143, !145, !148, !150, !151, !152, !153, !154, !157, !158}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !111, file: !112, line: 242, baseType: !20, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !111, file: !112, line: 247, baseType: !56, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !111, file: !112, line: 248, baseType: !56, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !111, file: !112, line: 249, baseType: !56, size: 64, align: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !111, file: !112, line: 250, baseType: !56, size: 64, align: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !111, file: !112, line: 251, baseType: !56, size: 64, align: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !111, file: !112, line: 252, baseType: !56, size: 64, align: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !111, file: !112, line: 253, baseType: !56, size: 64, align: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !111, file: !112, line: 254, baseType: !56, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !111, file: !112, line: 256, baseType: !56, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !111, file: !112, line: 257, baseType: !56, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !111, file: !112, line: 258, baseType: !56, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !111, file: !112, line: 260, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !112, line: 156, size: 192, align: 64, elements: !129)
!129 = !{!130, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !128, file: !112, line: 157, baseType: !127, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !128, file: !112, line: 158, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !128, file: !112, line: 162, baseType: !20, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !111, file: !112, line: 262, baseType: !132, size: 64, align: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !111, file: !112, line: 264, baseType: !20, size: 32, align: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !111, file: !112, line: 268, baseType: !20, size: 32, align: 32, offset: 928)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !111, file: !112, line: 270, baseType: !138, size: 64, align: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 131, baseType: !22)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !111, file: !112, line: 274, baseType: !21, size: 16, align: 16, offset: 1024)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !111, file: !112, line: 275, baseType: !142, size: 8, align: 8, offset: 1040)
!142 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !111, file: !112, line: 276, baseType: !144, size: 8, align: 8, offset: 1048)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !79)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !111, file: !112, line: 280, baseType: !146, size: 64, align: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !112, line: 150, baseType: null)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !111, file: !112, line: 289, baseType: !149, size: 64, align: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 132, baseType: !22)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !111, file: !112, line: 297, baseType: !19, size: 64, align: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !111, file: !112, line: 298, baseType: !19, size: 64, align: 64, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !111, file: !112, line: 299, baseType: !19, size: 64, align: 64, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !111, file: !112, line: 300, baseType: !19, size: 64, align: 64, offset: 1408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !111, file: !112, line: 302, baseType: !155, size: 64, align: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !156, line: 216, baseType: !30)
!156 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !111, file: !112, line: 303, baseType: !20, size: 32, align: 32, offset: 1536)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !111, file: !112, line: 305, baseType: !159, size: 160, align: 8, offset: 1568)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 20)
!162 = !DILocation(line: 72, column: 9, scope: !107)
!163 = !DILocation(line: 74, column: 21, scope: !107)
!164 = !DILocation(line: 74, column: 8, scope: !107)
!165 = !DILocation(line: 74, column: 6, scope: !107)
!166 = !DILocation(line: 75, column: 7, scope: !167)
!167 = distinct !DILexicalBlock(scope: !107, file: !34, line: 75, column: 7)
!168 = !DILocation(line: 75, column: 10, scope: !167)
!169 = !DILocation(line: 75, column: 7, scope: !107)
!170 = !DILocation(line: 76, column: 4, scope: !167)
!171 = !DILocation(line: 78, column: 33, scope: !107)
!172 = !DILocation(line: 78, column: 7, scope: !107)
!173 = !DILocation(line: 78, column: 5, scope: !107)
!174 = !DILocation(line: 79, column: 10, scope: !107)
!175 = !DILocation(line: 79, column: 3, scope: !107)
!176 = !DILocation(line: 80, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !107, file: !34, line: 80, column: 7)
!178 = !DILocation(line: 80, column: 9, scope: !177)
!179 = !DILocation(line: 80, column: 7, scope: !107)
!180 = !DILocation(line: 81, column: 4, scope: !177)
!181 = !DILocation(line: 83, column: 10, scope: !182)
!182 = distinct !DILexicalBlock(scope: !107, file: !34, line: 83, column: 3)
!183 = !DILocation(line: 83, column: 8, scope: !182)
!184 = !DILocation(line: 83, column: 19, scope: !185)
!185 = !DILexicalBlockFile(scope: !186, file: !34, discriminator: 1)
!186 = distinct !DILexicalBlock(scope: !182, file: !34, line: 83, column: 3)
!187 = !DILocation(line: 83, column: 18, scope: !185)
!188 = !DILocation(line: 83, column: 21, scope: !185)
!189 = !DILocation(line: 83, column: 26, scope: !185)
!190 = !DILocation(line: 83, column: 30, scope: !191)
!191 = !DILexicalBlockFile(scope: !186, file: !34, discriminator: 2)
!192 = !DILocation(line: 83, column: 29, scope: !191)
!193 = !DILocation(line: 83, column: 50, scope: !191)
!194 = !DILocation(line: 83, column: 32, scope: !191)
!195 = !DILocation(line: 83, column: 31, scope: !191)
!196 = !DILocation(line: 83, column: 33, scope: !191)
!197 = !DILocation(line: 83, column: 41, scope: !191)
!198 = !DILocation(line: 83, column: 59, scope: !199)
!199 = !DILexicalBlockFile(scope: !186, file: !34, discriminator: 3)
!200 = !DILocation(line: 83, column: 58, scope: !199)
!201 = !DILocation(line: 83, column: 44, scope: !199)
!202 = !DILocation(line: 83, column: 41, scope: !199)
!203 = !DILocation(line: 83, column: 3, scope: !204)
!204 = !DILexicalBlockFile(scope: !182, file: !34, discriminator: 4)
!205 = !DILocation(line: 83, column: 3, scope: !206)
!206 = !DILexicalBlockFile(scope: !182, file: !34, discriminator: 5)
!207 = !DILocation(line: 83, column: 64, scope: !208)
!208 = !DILexicalBlockFile(scope: !186, file: !34, discriminator: 6)
!209 = !DILocation(line: 83, column: 3, scope: !208)
!210 = distinct !{!210, !211}
!211 = !DILocation(line: 83, column: 3, scope: !107)
!212 = !DILocation(line: 85, column: 4, scope: !107)
!213 = !DILocation(line: 85, column: 6, scope: !107)
!214 = !DILocation(line: 87, column: 8, scope: !215)
!215 = distinct !DILexicalBlock(scope: !107, file: !34, line: 87, column: 7)
!216 = !DILocation(line: 87, column: 7, scope: !107)
!217 = !DILocation(line: 88, column: 4, scope: !215)
!218 = !DILocation(line: 90, column: 15, scope: !107)
!219 = !DILocation(line: 91, column: 3, scope: !107)
!220 = !DILocation(line: 93, column: 45, scope: !221)
!221 = distinct !DILexicalBlock(scope: !102, file: !34, line: 92, column: 9)
!222 = !DILocation(line: 93, column: 3, scope: !221)
!223 = !DILocation(line: 94, column: 15, scope: !221)
!224 = !DILocation(line: 95, column: 3, scope: !221)
!225 = !DILocation(line: 99, column: 6, scope: !226)
!226 = distinct !DILexicalBlock(scope: !33, file: !34, line: 99, column: 6)
!227 = !DILocation(line: 99, column: 38, scope: !226)
!228 = !DILocation(line: 99, column: 6, scope: !33)
!229 = !DILocation(line: 100, column: 9, scope: !226)
!230 = !DILocation(line: 100, column: 3, scope: !226)
!231 = !DILocation(line: 105, column: 25, scope: !33)
!232 = !DILocation(line: 107, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !33, file: !34, line: 107, column: 2)
!234 = !DILocation(line: 107, column: 7, scope: !233)
!235 = !DILocation(line: 107, column: 18, scope: !236)
!236 = !DILexicalBlockFile(scope: !237, file: !34, discriminator: 1)
!237 = distinct !DILexicalBlock(scope: !233, file: !34, line: 107, column: 2)
!238 = !DILocation(line: 107, column: 17, scope: !236)
!239 = !DILocation(line: 107, column: 20, scope: !236)
!240 = !DILocation(line: 107, column: 25, scope: !236)
!241 = !DILocation(line: 107, column: 29, scope: !242)
!242 = !DILexicalBlockFile(scope: !237, file: !34, discriminator: 2)
!243 = !DILocation(line: 107, column: 28, scope: !242)
!244 = !DILocation(line: 107, column: 49, scope: !242)
!245 = !DILocation(line: 107, column: 31, scope: !242)
!246 = !DILocation(line: 107, column: 30, scope: !242)
!247 = !DILocation(line: 107, column: 32, scope: !242)
!248 = !DILocation(line: 107, column: 40, scope: !242)
!249 = !DILocation(line: 107, column: 58, scope: !250)
!250 = !DILexicalBlockFile(scope: !237, file: !34, discriminator: 3)
!251 = !DILocation(line: 107, column: 57, scope: !250)
!252 = !DILocation(line: 107, column: 43, scope: !250)
!253 = !DILocation(line: 107, column: 40, scope: !250)
!254 = !DILocation(line: 107, column: 2, scope: !255)
!255 = !DILexicalBlockFile(scope: !233, file: !34, discriminator: 4)
!256 = !DILocation(line: 107, column: 2, scope: !257)
!257 = !DILexicalBlockFile(scope: !233, file: !34, discriminator: 5)
!258 = !DILocation(line: 107, column: 63, scope: !259)
!259 = !DILexicalBlockFile(scope: !237, file: !34, discriminator: 6)
!260 = !DILocation(line: 107, column: 2, scope: !259)
!261 = distinct !{!261, !262}
!262 = !DILocation(line: 107, column: 2, scope: !33)
!263 = !DILocation(line: 109, column: 3, scope: !33)
!264 = !DILocation(line: 109, column: 5, scope: !33)
!265 = !DILocation(line: 111, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !33, file: !34, line: 111, column: 6)
!267 = !DILocation(line: 111, column: 6, scope: !33)
!268 = !DILocation(line: 112, column: 3, scope: !266)
!269 = !DILocation(line: 114, column: 14, scope: !33)
!270 = !DILocation(line: 115, column: 2, scope: !33)
!271 = !DILocation(line: 116, column: 1, scope: !33)
!272 = !DILocalVariable(name: "fmt", arg: 1, scope: !46, file: !34, line: 119, type: !37)
!273 = !DILocation(line: 119, column: 25, scope: !46)
!274 = !DILocation(line: 123, column: 35, scope: !46)
!275 = !DILocation(line: 123, column: 2, scope: !46)
!276 = !DILocation(line: 124, column: 6, scope: !277)
!277 = distinct !DILexicalBlock(scope: !46, file: !34, line: 124, column: 6)
!278 = !DILocation(line: 124, column: 10, scope: !277)
!279 = !DILocation(line: 124, column: 6, scope: !46)
!280 = !DILocalVariable(name: "ap", scope: !281, file: !34, line: 125, type: !282)
!281 = distinct !DILexicalBlock(scope: !277, file: !34, line: 124, column: 18)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !110, line: 79, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !284, line: 40, baseType: !285)
!284 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/dma/task1")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 125, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 192, align: 64, elements: !79)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 125, size: 192, align: 64, elements: !288)
!288 = !{!289, !291, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !287, file: !1, line: 125, baseType: !290, size: 32, align: 32)
!290 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !287, file: !1, line: 125, baseType: !290, size: 32, align: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !287, file: !1, line: 125, baseType: !19, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !287, file: !1, line: 125, baseType: !19, size: 64, align: 64, offset: 128)
!294 = !DILocation(line: 125, column: 11, scope: !281)
!295 = !DILocalVariable(name: "sufx", scope: !281, file: !34, line: 126, type: !49)
!296 = !DILocation(line: 126, column: 8, scope: !281)
!297 = !DILocation(line: 128, column: 2, scope: !281)
!298 = !DILocation(line: 129, column: 13, scope: !281)
!299 = !DILocation(line: 129, column: 33, scope: !281)
!300 = !DILocation(line: 129, column: 38, scope: !281)
!301 = !DILocation(line: 129, column: 3, scope: !281)
!302 = !DILocation(line: 130, column: 2, scope: !281)
!303 = !DILocation(line: 131, column: 40, scope: !281)
!304 = !DILocation(line: 131, column: 55, scope: !281)
!305 = !DILocation(line: 131, column: 3, scope: !281)
!306 = !DILocation(line: 132, column: 2, scope: !281)
!307 = !DILocation(line: 133, column: 2, scope: !46)
!308 = !DILocation(line: 134, column: 2, scope: !46)
!309 = !DILocation(line: 135, column: 1, scope: !46)
!310 = distinct !DISubprogram(name: "errlog", scope: !34, file: !34, line: 138, type: !311, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !20, !37, null}
!313 = !DILocalVariable(name: "exitcode", arg: 1, scope: !310, file: !34, line: 138, type: !20)
!314 = !DILocation(line: 138, column: 12, scope: !310)
!315 = !DILocalVariable(name: "fmt", arg: 2, scope: !310, file: !34, line: 138, type: !37)
!316 = !DILocation(line: 138, column: 34, scope: !310)
!317 = !DILocalVariable(name: "oerrno", scope: !310, file: !34, line: 140, type: !20)
!318 = !DILocation(line: 140, column: 6, scope: !310)
!319 = !DILocation(line: 140, column: 16, scope: !310)
!320 = !DILocation(line: 140, column: 15, scope: !310)
!321 = !DILocalVariable(name: "ap", scope: !310, file: !34, line: 141, type: !282)
!322 = !DILocation(line: 141, column: 10, scope: !310)
!323 = !DILocalVariable(name: "outs", scope: !310, file: !34, line: 142, type: !324)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1600, align: 8, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 200)
!327 = !DILocation(line: 142, column: 7, scope: !310)
!328 = !DILocation(line: 144, column: 2, scope: !310)
!329 = !DILocation(line: 144, column: 10, scope: !310)
!330 = !DILocation(line: 145, column: 6, scope: !331)
!331 = distinct !DILexicalBlock(scope: !310, file: !34, line: 145, column: 6)
!332 = !DILocation(line: 145, column: 10, scope: !331)
!333 = !DILocation(line: 145, column: 6, scope: !310)
!334 = !DILocation(line: 146, column: 2, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !34, line: 145, column: 18)
!336 = !DILocation(line: 147, column: 13, scope: !335)
!337 = !DILocation(line: 147, column: 33, scope: !335)
!338 = !DILocation(line: 147, column: 38, scope: !335)
!339 = !DILocation(line: 147, column: 3, scope: !335)
!340 = !DILocation(line: 148, column: 2, scope: !335)
!341 = !DILocation(line: 149, column: 2, scope: !335)
!342 = !DILocation(line: 151, column: 9, scope: !310)
!343 = !DILocation(line: 151, column: 3, scope: !310)
!344 = !DILocation(line: 151, column: 7, scope: !310)
!345 = !DILocation(line: 152, column: 6, scope: !346)
!346 = distinct !DILexicalBlock(scope: !310, file: !34, line: 152, column: 6)
!347 = !DILocation(line: 152, column: 12, scope: !346)
!348 = !DILocation(line: 152, column: 6, scope: !310)
!349 = !DILocation(line: 153, column: 28, scope: !350)
!350 = distinct !DILexicalBlock(scope: !346, file: !34, line: 152, column: 18)
!351 = !DILocation(line: 153, column: 3, scope: !350)
!352 = !DILocation(line: 154, column: 10, scope: !350)
!353 = !DILocation(line: 154, column: 34, scope: !350)
!354 = !DILocation(line: 154, column: 49, scope: !350)
!355 = !DILocation(line: 154, column: 64, scope: !350)
!356 = !DILocation(line: 154, column: 55, scope: !357)
!357 = !DILexicalBlockFile(scope: !350, file: !34, discriminator: 1)
!358 = !DILocation(line: 154, column: 3, scope: !359)
!359 = !DILexicalBlockFile(scope: !350, file: !34, discriminator: 2)
!360 = !DILocation(line: 155, column: 2, scope: !350)
!361 = !DILocation(line: 156, column: 3, scope: !362)
!362 = distinct !DILexicalBlock(scope: !346, file: !34, line: 155, column: 9)
!363 = !DILocation(line: 157, column: 10, scope: !362)
!364 = !DILocation(line: 157, column: 30, scope: !362)
!365 = !DILocation(line: 157, column: 54, scope: !362)
!366 = !DILocation(line: 157, column: 45, scope: !367)
!367 = !DILexicalBlockFile(scope: !362, file: !34, discriminator: 1)
!368 = !DILocation(line: 157, column: 3, scope: !369)
!369 = !DILexicalBlockFile(scope: !362, file: !34, discriminator: 2)
!370 = !DILocation(line: 160, column: 7, scope: !310)
!371 = !DILocation(line: 160, column: 2, scope: !310)
!372 = !DILocation(line: 161, column: 1, scope: !310)
!373 = distinct !DISubprogram(name: "errlogx", scope: !34, file: !34, line: 164, type: !311, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!374 = !DILocalVariable(name: "exitcode", arg: 1, scope: !373, file: !34, line: 164, type: !20)
!375 = !DILocation(line: 164, column: 13, scope: !373)
!376 = !DILocalVariable(name: "fmt", arg: 2, scope: !373, file: !34, line: 164, type: !37)
!377 = !DILocation(line: 164, column: 35, scope: !373)
!378 = !DILocalVariable(name: "ap", scope: !373, file: !34, line: 166, type: !282)
!379 = !DILocation(line: 166, column: 10, scope: !373)
!380 = !DILocalVariable(name: "outs", scope: !373, file: !34, line: 167, type: !324)
!381 = !DILocation(line: 167, column: 7, scope: !373)
!382 = !DILocation(line: 169, column: 2, scope: !373)
!383 = !DILocation(line: 169, column: 10, scope: !373)
!384 = !DILocation(line: 170, column: 6, scope: !385)
!385 = distinct !DILexicalBlock(scope: !373, file: !34, line: 170, column: 6)
!386 = !DILocation(line: 170, column: 10, scope: !385)
!387 = !DILocation(line: 170, column: 6, scope: !373)
!388 = !DILocation(line: 171, column: 2, scope: !389)
!389 = distinct !DILexicalBlock(scope: !385, file: !34, line: 170, column: 18)
!390 = !DILocation(line: 172, column: 13, scope: !389)
!391 = !DILocation(line: 172, column: 33, scope: !389)
!392 = !DILocation(line: 172, column: 38, scope: !389)
!393 = !DILocation(line: 172, column: 3, scope: !389)
!394 = !DILocation(line: 173, column: 2, scope: !389)
!395 = !DILocation(line: 174, column: 2, scope: !389)
!396 = !DILocation(line: 176, column: 6, scope: !397)
!397 = distinct !DILexicalBlock(scope: !373, file: !34, line: 176, column: 6)
!398 = !DILocation(line: 176, column: 12, scope: !397)
!399 = !DILocation(line: 176, column: 6, scope: !373)
!400 = !DILocation(line: 177, column: 24, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !34, line: 176, column: 18)
!402 = !DILocation(line: 177, column: 3, scope: !401)
!403 = !DILocation(line: 178, column: 10, scope: !401)
!404 = !DILocation(line: 178, column: 30, scope: !401)
!405 = !DILocation(line: 178, column: 45, scope: !401)
!406 = !DILocation(line: 178, column: 3, scope: !407)
!407 = !DILexicalBlockFile(scope: !401, file: !34, discriminator: 1)
!408 = !DILocation(line: 179, column: 2, scope: !401)
!409 = !DILocation(line: 180, column: 3, scope: !410)
!410 = distinct !DILexicalBlock(scope: !397, file: !34, line: 179, column: 9)
!411 = !DILocation(line: 181, column: 10, scope: !410)
!412 = !DILocation(line: 181, column: 41, scope: !410)
!413 = !DILocation(line: 181, column: 3, scope: !414)
!414 = !DILexicalBlockFile(scope: !410, file: !34, discriminator: 1)
!415 = !DILocation(line: 184, column: 7, scope: !373)
!416 = !DILocation(line: 184, column: 2, scope: !373)
!417 = !DILocation(line: 185, column: 1, scope: !373)
!418 = distinct !DISubprogram(name: "set_username", scope: !34, file: !34, line: 202, type: !419, isLocal: false, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!419 = !DISubroutineType(types: !420)
!420 = !{null}
!421 = !DILocalVariable(name: "pwd", scope: !418, file: !34, line: 204, type: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !424, line: 49, size: 384, align: 64, elements: !425)
!424 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/dma/task1")
!425 = !{!426, !427, !428, !430, !432, !433, !434}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !423, file: !424, line: 51, baseType: !56, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !423, file: !424, line: 52, baseType: !56, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !423, file: !424, line: 53, baseType: !429, size: 32, align: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !139, line: 125, baseType: !290)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !423, file: !424, line: 54, baseType: !431, size: 32, align: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !139, line: 126, baseType: !290)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !423, file: !424, line: 55, baseType: !56, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !423, file: !424, line: 56, baseType: !56, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !423, file: !424, line: 57, baseType: !56, size: 64, align: 64, offset: 320)
!435 = !DILocation(line: 204, column: 17, scope: !418)
!436 = !DILocation(line: 206, column: 12, scope: !418)
!437 = !DILocation(line: 206, column: 10, scope: !418)
!438 = !DILocation(line: 207, column: 21, scope: !439)
!439 = distinct !DILexicalBlock(scope: !418, file: !34, line: 207, column: 6)
!440 = !DILocation(line: 207, column: 33, scope: !439)
!441 = !DILocation(line: 207, column: 6, scope: !442)
!442 = !DILexicalBlockFile(scope: !439, file: !34, discriminator: 1)
!443 = !DILocation(line: 207, column: 6, scope: !439)
!444 = !DILocation(line: 207, column: 6, scope: !418)
!445 = !DILocation(line: 208, column: 3, scope: !439)
!446 = !DILocation(line: 209, column: 21, scope: !447)
!447 = distinct !DILexicalBlock(scope: !418, file: !34, line: 209, column: 6)
!448 = !DILocation(line: 209, column: 40, scope: !447)
!449 = !DILocation(line: 209, column: 6, scope: !450)
!450 = !DILexicalBlockFile(scope: !447, file: !34, discriminator: 1)
!451 = !DILocation(line: 209, column: 6, scope: !447)
!452 = !DILocation(line: 209, column: 6, scope: !418)
!453 = !DILocation(line: 210, column: 3, scope: !447)
!454 = !DILocation(line: 211, column: 21, scope: !455)
!455 = distinct !DILexicalBlock(scope: !418, file: !34, line: 211, column: 6)
!456 = !DILocation(line: 211, column: 37, scope: !455)
!457 = !DILocation(line: 211, column: 6, scope: !458)
!458 = !DILexicalBlockFile(scope: !455, file: !34, discriminator: 1)
!459 = !DILocation(line: 211, column: 6, scope: !455)
!460 = !DILocation(line: 211, column: 6, scope: !418)
!461 = !DILocation(line: 212, column: 3, scope: !455)
!462 = !DILocation(line: 213, column: 17, scope: !418)
!463 = !DILocation(line: 213, column: 8, scope: !418)
!464 = !DILocation(line: 213, column: 6, scope: !418)
!465 = !DILocation(line: 214, column: 6, scope: !466)
!466 = distinct !DILexicalBlock(scope: !418, file: !34, line: 214, column: 6)
!467 = !DILocation(line: 214, column: 10, scope: !466)
!468 = !DILocation(line: 214, column: 17, scope: !466)
!469 = !DILocation(line: 214, column: 20, scope: !470)
!470 = !DILexicalBlockFile(scope: !466, file: !34, discriminator: 1)
!471 = !DILocation(line: 214, column: 25, scope: !470)
!472 = !DILocation(line: 214, column: 33, scope: !470)
!473 = !DILocation(line: 214, column: 41, scope: !470)
!474 = !DILocation(line: 214, column: 44, scope: !475)
!475 = !DILexicalBlockFile(scope: !466, file: !34, discriminator: 2)
!476 = !DILocation(line: 214, column: 49, scope: !475)
!477 = !DILocation(line: 214, column: 60, scope: !475)
!478 = !DILocation(line: 214, column: 6, scope: !475)
!479 = !DILocation(line: 215, column: 22, scope: !480)
!480 = distinct !DILexicalBlock(scope: !481, file: !34, line: 215, column: 7)
!481 = distinct !DILexicalBlock(scope: !466, file: !34, line: 214, column: 69)
!482 = !DILocation(line: 215, column: 27, scope: !480)
!483 = !DILocation(line: 215, column: 36, scope: !480)
!484 = !DILocation(line: 215, column: 7, scope: !480)
!485 = !DILocation(line: 215, column: 7, scope: !481)
!486 = !DILocation(line: 216, column: 4, scope: !480)
!487 = !DILocation(line: 217, column: 2, scope: !481)
!488 = !DILocation(line: 218, column: 56, scope: !418)
!489 = !DILocation(line: 218, column: 50, scope: !418)
!490 = !DILocation(line: 218, column: 2, scope: !418)
!491 = !DILocation(line: 219, column: 1, scope: !418)
!492 = !DILocation(line: 219, column: 1, scope: !493)
!493 = !DILexicalBlockFile(scope: !418, file: !34, discriminator: 1)
!494 = distinct !DISubprogram(name: "check_username", scope: !34, file: !34, line: 188, type: !495, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!495 = !DISubroutineType(types: !496)
!496 = !{!20, !37, !497}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !498, line: 80, baseType: !429)
!498 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dma/task1")
!499 = !DILocalVariable(name: "name", arg: 1, scope: !494, file: !34, line: 188, type: !37)
!500 = !DILocation(line: 188, column: 28, scope: !494)
!501 = !DILocalVariable(name: "ckuid", arg: 2, scope: !494, file: !34, line: 188, type: !497)
!502 = !DILocation(line: 188, column: 40, scope: !494)
!503 = !DILocalVariable(name: "pwd", scope: !494, file: !34, line: 190, type: !422)
!504 = !DILocation(line: 190, column: 17, scope: !494)
!505 = !DILocation(line: 192, column: 6, scope: !506)
!506 = distinct !DILexicalBlock(scope: !494, file: !34, line: 192, column: 6)
!507 = !DILocation(line: 192, column: 11, scope: !506)
!508 = !DILocation(line: 192, column: 6, scope: !494)
!509 = !DILocation(line: 193, column: 3, scope: !506)
!510 = !DILocation(line: 194, column: 17, scope: !494)
!511 = !DILocation(line: 194, column: 8, scope: !494)
!512 = !DILocation(line: 194, column: 6, scope: !494)
!513 = !DILocation(line: 195, column: 6, scope: !514)
!514 = distinct !DILexicalBlock(scope: !494, file: !34, line: 195, column: 6)
!515 = !DILocation(line: 195, column: 10, scope: !514)
!516 = !DILocation(line: 195, column: 17, scope: !514)
!517 = !DILocation(line: 195, column: 20, scope: !518)
!518 = !DILexicalBlockFile(scope: !514, file: !34, discriminator: 1)
!519 = !DILocation(line: 195, column: 25, scope: !518)
!520 = !DILocation(line: 195, column: 35, scope: !518)
!521 = !DILocation(line: 195, column: 32, scope: !518)
!522 = !DILocation(line: 195, column: 6, scope: !518)
!523 = !DILocation(line: 196, column: 3, scope: !514)
!524 = !DILocation(line: 197, column: 45, scope: !494)
!525 = !DILocation(line: 197, column: 2, scope: !494)
!526 = !DILocation(line: 198, column: 2, scope: !494)
!527 = !DILocation(line: 199, column: 1, scope: !494)
!528 = distinct !DISubprogram(name: "deltmp", scope: !34, file: !34, line: 222, type: !419, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!529 = !DILocalVariable(name: "t", scope: !528, file: !34, line: 224, type: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stritem", file: !532, line: 92, size: 128, align: 64, elements: !533)
!532 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!533 = !{!534, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !532, line: 93, baseType: !535, size: 64, align: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !531, file: !532, line: 93, size: 64, align: 64, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sle_next", scope: !535, file: !532, line: 93, baseType: !530, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !531, file: !532, line: 94, baseType: !56, size: 64, align: 64, offset: 64)
!539 = !DILocation(line: 224, column: 18, scope: !528)
!540 = !DILocation(line: 226, column: 4, scope: !541)
!541 = distinct !DILexicalBlock(scope: !528, file: !34, line: 226, column: 1)
!542 = !DILocation(line: 226, column: 3, scope: !541)
!543 = !DILocation(line: 226, column: 5, scope: !541)
!544 = !DILocation(line: 226, column: 1, scope: !545)
!545 = !DILexicalBlockFile(scope: !546, file: !34, discriminator: 1)
!546 = distinct !DILexicalBlock(scope: !541, file: !34, line: 226, column: 1)
!547 = !DILocation(line: 227, column: 10, scope: !548)
!548 = distinct !DILexicalBlock(scope: !546, file: !34, line: 226, column: 32)
!549 = !DILocation(line: 227, column: 13, scope: !548)
!550 = !DILocation(line: 227, column: 3, scope: !548)
!551 = !DILocation(line: 228, column: 2, scope: !548)
!552 = !DILocation(line: 226, column: 1, scope: !553)
!553 = !DILexicalBlockFile(scope: !546, file: !34, discriminator: 2)
!554 = !DILocation(line: 226, column: 2, scope: !553)
!555 = !DILocation(line: 226, column: 3, scope: !553)
!556 = distinct !{!556, !557}
!557 = !DILocation(line: 226, column: 1, scope: !528)
!558 = !DILocation(line: 229, column: 1, scope: !528)
!559 = distinct !DISubprogram(name: "do_timeout", scope: !34, file: !34, line: 243, type: !560, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!560 = !DISubroutineType(types: !561)
!561 = !{!20, !20, !20}
!562 = !DILocalVariable(name: "timeout", arg: 1, scope: !559, file: !34, line: 243, type: !20)
!563 = !DILocation(line: 243, column: 16, scope: !559)
!564 = !DILocalVariable(name: "dojmp", arg: 2, scope: !559, file: !34, line: 243, type: !20)
!565 = !DILocation(line: 243, column: 29, scope: !559)
!566 = !DILocalVariable(name: "act", scope: !559, file: !34, line: 245, type: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !568, line: 24, size: 1216, align: 64, elements: !569)
!568 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/dma/task1")
!569 = !{!570, !648, !649, !650}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !567, file: !568, line: 35, baseType: !571, size: 64, align: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !567, file: !568, line: 28, size: 64, align: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !571, file: !568, line: 31, baseType: !23, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !571, file: !568, line: 33, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !20, !578, !19}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !580, line: 133, baseType: !581)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/dma/task1")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 62, size: 1024, align: 64, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !581, file: !580, line: 64, baseType: !20, size: 32, align: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !581, file: !580, line: 65, baseType: !20, size: 32, align: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !581, file: !580, line: 67, baseType: !20, size: 32, align: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !581, file: !580, line: 132, baseType: !587, size: 896, align: 64, offset: 128)
!587 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !581, file: !580, line: 69, size: 896, align: 64, elements: !588)
!588 = !{!589, !593, !599, !610, !616, !626, !637, !642}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !587, file: !580, line: 71, baseType: !590, size: 896, align: 32)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 896, align: 32, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 28)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !587, file: !580, line: 78, baseType: !594, size: 64, align: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 74, size: 64, align: 32, elements: !595)
!595 = !{!596, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !594, file: !580, line: 76, baseType: !597, size: 32, align: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !139, line: 133, baseType: !20)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !594, file: !580, line: 77, baseType: !429, size: 32, align: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !587, file: !580, line: 86, baseType: !600, size: 128, align: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 81, size: 128, align: 64, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !600, file: !580, line: 83, baseType: !20, size: 32, align: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !600, file: !580, line: 84, baseType: !20, size: 32, align: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !600, file: !580, line: 85, baseType: !605, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !580, line: 36, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !580, line: 32, size: 64, align: 64, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !606, file: !580, line: 34, baseType: !20, size: 32, align: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !606, file: !580, line: 35, baseType: !19, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !587, file: !580, line: 94, baseType: !611, size: 128, align: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 89, size: 128, align: 64, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !611, file: !580, line: 91, baseType: !597, size: 32, align: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !611, file: !580, line: 92, baseType: !429, size: 32, align: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !611, file: !580, line: 93, baseType: !605, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !587, file: !580, line: 104, baseType: !617, size: 256, align: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 97, size: 256, align: 64, elements: !618)
!618 = !{!619, !620, !621, !622, !625}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !617, file: !580, line: 99, baseType: !597, size: 32, align: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !617, file: !580, line: 100, baseType: !429, size: 32, align: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !617, file: !580, line: 101, baseType: !20, size: 32, align: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !617, file: !580, line: 102, baseType: !623, size: 64, align: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !580, line: 58, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !139, line: 135, baseType: !22)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !617, file: !580, line: 103, baseType: !623, size: 64, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !587, file: !580, line: 116, baseType: !627, size: 256, align: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 107, size: 256, align: 64, elements: !628)
!628 = !{!629, !630, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !627, file: !580, line: 109, baseType: !19, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !627, file: !580, line: 110, baseType: !631, size: 16, align: 16, offset: 64)
!631 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !627, file: !580, line: 115, baseType: !633, size: 128, align: 64, offset: 128)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !580, line: 111, size: 128, align: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !633, file: !580, line: 113, baseType: !19, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !633, file: !580, line: 114, baseType: !19, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !587, file: !580, line: 123, baseType: !638, size: 128, align: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 119, size: 128, align: 64, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !638, file: !580, line: 121, baseType: !22, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !638, file: !580, line: 122, baseType: !20, size: 32, align: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !587, file: !580, line: 131, baseType: !643, size: 128, align: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !580, line: 126, size: 128, align: 64, elements: !644)
!644 = !{!645, !646, !647}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !643, file: !580, line: 128, baseType: !19, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !643, file: !580, line: 129, baseType: !20, size: 32, align: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !643, file: !580, line: 130, baseType: !290, size: 32, align: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !567, file: !568, line: 43, baseType: !71, size: 1024, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !567, file: !568, line: 46, baseType: !20, size: 32, align: 32, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !567, file: !568, line: 49, baseType: !651, size: 64, align: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!652 = !DILocation(line: 245, column: 19, scope: !559)
!653 = !DILocalVariable(name: "ret", scope: !559, file: !34, line: 246, type: !20)
!654 = !DILocation(line: 246, column: 6, scope: !559)
!655 = !DILocation(line: 248, column: 19, scope: !559)
!656 = !DILocation(line: 248, column: 2, scope: !559)
!657 = !DILocation(line: 249, column: 6, scope: !559)
!658 = !DILocation(line: 249, column: 15, scope: !559)
!659 = !DILocation(line: 251, column: 6, scope: !660)
!660 = distinct !DILexicalBlock(scope: !559, file: !34, line: 251, column: 6)
!661 = !DILocation(line: 251, column: 6, scope: !559)
!662 = !DILocation(line: 252, column: 6, scope: !663)
!663 = distinct !DILexicalBlock(scope: !660, file: !34, line: 251, column: 15)
!664 = !DILocation(line: 252, column: 26, scope: !663)
!665 = !DILocation(line: 252, column: 17, scope: !663)
!666 = !DILocation(line: 253, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !34, line: 253, column: 7)
!668 = !DILocation(line: 253, column: 37, scope: !667)
!669 = !DILocation(line: 253, column: 7, scope: !663)
!670 = !DILocation(line: 254, column: 4, scope: !667)
!671 = !DILocation(line: 255, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !663, file: !34, line: 255, column: 7)
!673 = !DILocation(line: 255, column: 7, scope: !663)
!674 = !DILocation(line: 256, column: 9, scope: !675)
!675 = distinct !DILexicalBlock(scope: !672, file: !34, line: 255, column: 14)
!676 = !DILocation(line: 256, column: 8, scope: !675)
!677 = !DILocation(line: 257, column: 8, scope: !678)
!678 = distinct !DILexicalBlock(scope: !675, file: !34, line: 257, column: 8)
!679 = !DILocation(line: 257, column: 8, scope: !675)
!680 = !DILocation(line: 258, column: 5, scope: !678)
!681 = !DILocation(line: 260, column: 17, scope: !675)
!682 = !DILocation(line: 261, column: 3, scope: !675)
!683 = !DILocation(line: 263, column: 9, scope: !663)
!684 = !DILocation(line: 263, column: 3, scope: !663)
!685 = !DILocation(line: 264, column: 2, scope: !663)
!686 = !DILocation(line: 264, column: 9, scope: !687)
!687 = !DILexicalBlockFile(scope: !660, file: !34, discriminator: 1)
!688 = !DILocation(line: 266, column: 3, scope: !689)
!689 = distinct !DILexicalBlock(scope: !660, file: !34, line: 264, column: 9)
!690 = !DILocation(line: 268, column: 6, scope: !689)
!691 = !DILocation(line: 268, column: 26, scope: !689)
!692 = !DILocation(line: 268, column: 17, scope: !689)
!693 = !DILocation(line: 269, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !689, file: !34, line: 269, column: 7)
!695 = !DILocation(line: 269, column: 37, scope: !694)
!696 = !DILocation(line: 269, column: 7, scope: !689)
!697 = !DILocation(line: 270, column: 4, scope: !694)
!698 = !DILocation(line: 271, column: 16, scope: !689)
!699 = !DILocation(line: 274, column: 10, scope: !559)
!700 = !DILocation(line: 274, column: 2, scope: !559)
!701 = distinct !DISubprogram(name: "sigalrm_handler", scope: !34, file: !34, line: 235, type: !26, isLocal: true, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !40)
!702 = !DILocalVariable(name: "signo", arg: 1, scope: !701, file: !34, line: 235, type: !20)
!703 = !DILocation(line: 235, column: 21, scope: !701)
!704 = !DILocation(line: 237, column: 8, scope: !701)
!705 = !DILocation(line: 238, column: 6, scope: !706)
!706 = distinct !DILexicalBlock(scope: !701, file: !34, line: 238, column: 6)
!707 = !DILocation(line: 238, column: 6, scope: !701)
!708 = !DILocation(line: 239, column: 3, scope: !706)
!709 = !DILocation(line: 240, column: 1, scope: !701)
