; ModuleID = './line7-dns.o.i'
source_filename = "./line7-dns.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mx_hostentry = type { [1025 x i8], [46 x i8], i32, %struct.addrinfo, %struct.sockaddr_storage }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.__ns_msg = type { i8*, i8*, i16, i16, [4 x i16], [4 x i8*], i32, i32, i8* }
%struct.__ns_rr = type { [1025 x i8], i16, i16, i32, i16, i8* }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1

; Function Attrs: nounwind uwtable
define i32 @dns_get_mx_list(i8*, i32, %struct.mx_hostentry**, i32) #0 !dbg !151 {
  %5 = alloca i32, align 4
  %6 = alloca i8*, align 8
  %7 = alloca i32, align 4
  %8 = alloca %struct.mx_hostentry**, align 8
  %9 = alloca i32, align 4
  %10 = alloca [1025 x i8], align 16
  %11 = alloca %struct.__ns_msg, align 8
  %12 = alloca %struct.__ns_rr, align 8
  %13 = alloca i8*, align 8
  %14 = alloca i8*, align 8
  %15 = alloca i8*, align 8
  %16 = alloca %struct.mx_hostentry*, align 8
  %17 = alloca i64, align 8
  %18 = alloca i64, align 8
  %19 = alloca i32, align 4
  %20 = alloca i32, align 4
  %21 = alloca i32, align 4
  %22 = alloca i32, align 4
  %23 = alloca i32, align 4
  store i8* %0, i8** %6, align 8

!44 = !DIEnumerator(name: "ns_t_afsdb", value: 18)
!45 = !DIEnumerator(name: "ns_t_x25", value: 19)
!46 = !DIEnumerator(name: "ns_t_isdn", value: 20)
!47 = !DIEnumerator(name: "ns_t_rt", value: 21)
!48 = !DIEnumerator(name: "ns_t_nsap", value: 22)
!49 = !DIEnumerator(name: "ns_t_nsap_ptr", value: 23)
!50 = !DIEnumerator(name: "ns_t_sig", value: 24)
!51 = !DIEnumerator(name: "ns_t_key", value: 25)
!52 = !DIEnumerator(name: "ns_t_px", value: 26)
!53 = !DIEnumerator(name: "ns_t_gpos", value: 27)
!54 = !DIEnumerator(name: "ns_t_aaaa", value: 28)
!55 = !DIEnumerator(name: "ns_t_loc", value: 29)
!56 = !DIEnumerator(name: "ns_t_nxt", value: 30)
!57 = !DIEnumerator(name: "ns_t_eid", value: 31)
!58 = !DIEnumerator(name: "ns_t_nimloc", value: 32)
!59 = !DIEnumerator(name: "ns_t_srv", value: 33)
!60 = !DIEnumerator(name: "ns_t_atma", value: 34)
!61 = !DIEnumerator(name: "ns_t_naptr", value: 35)
!62 = !DIEnumerator(name: "ns_t_kx", value: 36)
!63 = !DIEnumerator(name: "ns_t_cert", value: 37)
!64 = !DIEnumerator(name: "ns_t_a6", value: 38)
!65 = !DIEnumerator(name: "ns_t_dname", value: 39)
!66 = !DIEnumerator(name: "ns_t_sink", value: 40)
!67 = !DIEnumerator(name: "ns_t_opt", value: 41)
!68 = !DIEnumerator(name: "ns_t_apl", value: 42)
!69 = !DIEnumerator(name: "ns_t_tkey", value: 249)
!70 = !DIEnumerator(name: "ns_t_tsig", value: 250)
!71 = !DIEnumerator(name: "ns_t_ixfr", value: 251)
!72 = !DIEnumerator(name: "ns_t_axfr", value: 252)
!73 = !DIEnumerator(name: "ns_t_mailb", value: 253)
!74 = !DIEnumerator(name: "ns_t_maila", value: 254)
!75 = !DIEnumerator(name: "ns_t_any", value: 255)
!76 = !DIEnumerator(name: "ns_t_zxfr", value: 256)
!77 = !DIEnumerator(name: "ns_t_max", value: 65536)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__ns_flag", file: !4, line: 160, size: 32, align: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!80 = !DIEnumerator(name: "ns_f_qr", value: 0)
!81 = !DIEnumerator(name: "ns_f_opcode", value: 1)
!82 = !DIEnumerator(name: "ns_f_aa", value: 2)
!83 = !DIEnumerator(name: "ns_f_tc", value: 3)
!84 = !DIEnumerator(name: "ns_f_rd", value: 4)
!85 = !DIEnumerator(name: "ns_f_ra", value: 5)
!86 = !DIEnumerator(name: "ns_f_z", value: 6)
!87 = !DIEnumerator(name: "ns_f_ad", value: 7)
!88 = !DIEnumerator(name: "ns_f_cd", value: 8)
!89 = !DIEnumerator(name: "ns_f_rcode", value: 9)
!90 = !DIEnumerator(name: "ns_f_max", value: 10)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !92, line: 24, size: 32, align: 32, elements: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/dma/task1")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!95 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!96 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!97 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!98 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!99 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!100 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!101 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!102 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 40, size: 32, align: 32, elements: !105)
!104 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/dma/task1")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!106 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!107 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!108 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!109 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!110 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!111 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!112 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!113 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!114 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!115 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!116 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!117 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!118 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!119 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!120 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!121 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!122 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!123 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!124 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!125 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!126 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!127 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!128 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!129 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!130 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!131 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!132 = !{!133, !134, !135}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_type", file: !4, line: 305, baseType: !24)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !137, line: 153, size: 128, align: 16, elements: !138)
!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/dma/task1")
!138 = !{!139, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !136, file: !137, line: 155, baseType: !140, size: 16, align: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !141, line: 28, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/dma/task1")
!142 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !136, file: !137, line: 156, baseType: !144, size: 112, align: 8, offset: 16)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 112, align: 8, elements: !146)
!145 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!146 = !{!147}
!147 = !DISubrange(count: 14)
!148 = !{i32 2, !"Dwarf Version", i32 4}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!151 = distinct !DISubprogram(name: "dns_get_mx_list", scope: !152, file: !152, line: 114, type: !153, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !200)
!152 = !DIFile(filename: "dns.c", directory: "/home/lichi/Desktop/dma/task1")
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !156, !155, !158, !155}
!155 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mx_hostentry", file: !161, line: 152, size: 10048, align: 64, elements: !162)
!161 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!162 = !{!163, !167, !171, !172, !190}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !160, file: !161, line: 153, baseType: !164, size: 8200, align: 8)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8200, align: 8, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 1025)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !160, file: !161, line: 154, baseType: !168, size: 368, align: 8, offset: 8200)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 368, align: 8, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 46)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pref", scope: !160, file: !161, line: 155, baseType: !155, size: 32, align: 32, offset: 8576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai", scope: !160, file: !161, line: 156, baseType: !173, size: 384, align: 64, offset: 8640)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !174, line: 567, size: 384, align: 64, elements: !175)
!174 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/dma/task1")
!175 = !{!176, !177, !178, !179, !180, !185, !186, !188}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !173, file: !174, line: 569, baseType: !155, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !173, file: !174, line: 570, baseType: !155, size: 32, align: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !173, file: !174, line: 571, baseType: !155, size: 32, align: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !173, file: !174, line: 572, baseType: !155, size: 32, align: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !173, file: !174, line: 573, baseType: !181, size: 32, align: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !137, line: 33, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !183, line: 189, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dma/task1")
!184 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !173, file: !174, line: 574, baseType: !135, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !173, file: !174, line: 575, baseType: !187, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !173, file: !174, line: 576, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !160, file: !161, line: 157, baseType: !191, size: 1024, align: 64, offset: 9024)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !137, line: 166, size: 1024, align: 64, elements: !192)
!192 = !{!193, !194, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !191, file: !137, line: 168, baseType: !140, size: 16, align: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !191, file: !137, line: 169, baseType: !195, size: 944, align: 8, offset: 16)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 944, align: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 118)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !191, file: !137, line: 170, baseType: !199, size: 64, align: 64, offset: 960)
!199 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!200 = !{}
!201 = !DILocalVariable(name: "host", arg: 1, scope: !151, file: !152, line: 114, type: !156)
!202 = !DIExpression()
!203 = !DILocation(line: 114, column: 29, scope: !151)
!204 = !DILocalVariable(name: "port", arg: 2, scope: !151, file: !152, line: 114, type: !155)
!205 = !DILocation(line: 114, column: 39, scope: !151)
!206 = !DILocalVariable(name: "he", arg: 3, scope: !151, file: !152, line: 114, type: !158)
!207 = !DILocation(line: 114, column: 67, scope: !151)
!208 = !DILocalVariable(name: "no_mx", arg: 4, scope: !151, file: !152, line: 114, type: !155)
!209 = !DILocation(line: 114, column: 75, scope: !151)
!210 = !DILocalVariable(name: "outname", scope: !151, file: !152, line: 116, type: !164)
!211 = !DILocation(line: 116, column: 7, scope: !151)
!212 = !DILocalVariable(name: "msg", scope: !151, file: !152, line: 117, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_msg", file: !4, line: 121, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__ns_msg", file: !4, line: 114, size: 640, align: 64, elements: !215)
!215 = !{!216, !223, !224, !226, !227, !231, !233, !235, !236}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !214, file: !4, line: 115, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !220, line: 33, baseType: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dma/task1")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !183, line: 30, baseType: !222)
!222 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_eom", scope: !214, file: !4, line: 115, baseType: !217, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_id", scope: !214, file: !4, line: 116, baseType: !225, size: 16, align: 16, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int16_t", file: !220, line: 201, baseType: !142)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !214, file: !4, line: 116, baseType: !225, size: 16, align: 16, offset: 144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_counts", scope: !214, file: !4, line: 116, baseType: !228, size: 64, align: 16, offset: 160)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, align: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 4)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_sections", scope: !214, file: !4, line: 117, baseType: !232, size: 256, align: 64, offset: 256)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 256, align: 64, elements: !229)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_sect", scope: !214, file: !4, line: 118, baseType: !234, size: 32, align: 32, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_sect", file: !4, line: 107, baseType: !3)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_rrnum", scope: !214, file: !4, line: 119, baseType: !155, size: 32, align: 32, offset: 544)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_msg_ptr", scope: !214, file: !4, line: 120, baseType: !217, size: 64, align: 64, offset: 576)
!237 = !DILocation(line: 117, column: 9, scope: !151)
!238 = !DILocalVariable(name: "rr", scope: !151, file: !152, line: 118, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ns_rr", file: !4, line: 145, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__ns_rr", file: !4, line: 138, size: 8384, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !247, !248}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !4, line: 139, baseType: !164, size: 8200, align: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !4, line: 140, baseType: !225, size: 16, align: 16, offset: 8208)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rr_class", scope: !240, file: !4, line: 141, baseType: !225, size: 16, align: 16, offset: 8224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !240, file: !4, line: 142, baseType: !246, size: 32, align: 32, offset: 8256)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32_t", file: !220, line: 202, baseType: !184)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rdlength", scope: !240, file: !4, line: 143, baseType: !225, size: 16, align: 16, offset: 8288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rdata", scope: !240, file: !4, line: 144, baseType: !217, size: 64, align: 64, offset: 8320)
!249 = !DILocation(line: 118, column: 8, scope: !151)
!250 = !DILocalVariable(name: "searchhost", scope: !151, file: !152, line: 119, type: !156)
!251 = !DILocation(line: 119, column: 14, scope: !151)
!252 = !DILocalVariable(name: "cp", scope: !151, file: !152, line: 120, type: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!255 = !DILocation(line: 120, column: 23, scope: !151)
!256 = !DILocalVariable(name: "ans", scope: !151, file: !152, line: 121, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!258 = !DILocation(line: 121, column: 17, scope: !151)
!259 = !DILocalVariable(name: "hosts", scope: !151, file: !152, line: 122, type: !159)
!260 = !DILocation(line: 122, column: 23, scope: !151)
!261 = !DILocalVariable(name: "nhosts", scope: !151, file: !152, line: 123, type: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !263, line: 216, baseType: !199)
!263 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dma/task1")
!264 = !DILocation(line: 123, column: 9, scope: !151)
!265 = !DILocalVariable(name: "anssz", scope: !151, file: !152, line: 124, type: !262)
!266 = !DILocation(line: 124, column: 9, scope: !151)
!267 = !DILocalVariable(name: "pref", scope: !151, file: !152, line: 125, type: !155)
!268 = !DILocation(line: 125, column: 6, scope: !151)
!269 = !DILocalVariable(name: "cname_recurse", scope: !151, file: !152, line: 126, type: !155)
!270 = !DILocation(line: 126, column: 6, scope: !151)
!271 = !DILocalVariable(name: "have_mx", scope: !151, file: !152, line: 127, type: !155)
!272 = !DILocation(line: 127, column: 6, scope: !151)
!273 = !DILocalVariable(name: "err", scope: !151, file: !152, line: 128, type: !155)
!274 = !DILocation(line: 128, column: 6, scope: !151)
!275 = !DILocalVariable(name: "i", scope: !151, file: !152, line: 129, type: !155)
!276 = !DILocation(line: 129, column: 6, scope: !151)
!277 = !DILocation(line: 131, column: 1, scope: !151)
!278 = !DILocation(line: 132, column: 15, scope: !151)
!279 = !DILocation(line: 132, column: 13, scope: !151)
!280 = !DILocation(line: 133, column: 16, scope: !151)
!281 = !DILocation(line: 135, column: 8, scope: !151)
!282 = !DILocation(line: 136, column: 15, scope: !151)
!283 = !DILocation(line: 136, column: 8, scope: !151)
!284 = !DILocation(line: 136, column: 6, scope: !151)
!285 = !DILocation(line: 137, column: 6, scope: !286)
!286 = distinct !DILexicalBlock(scope: !151, file: !152, line: 137, column: 6)
!287 = !DILocation(line: 137, column: 10, scope: !286)
!288 = !DILocation(line: 137, column: 6, scope: !151)
!289 = !DILocation(line: 138, column: 3, scope: !286)
!290 = !DILocation(line: 140, column: 6, scope: !291)
!291 = distinct !DILexicalBlock(scope: !151, file: !152, line: 140, column: 6)
!292 = !DILocation(line: 140, column: 6, scope: !151)
!293 = !DILocation(line: 141, column: 3, scope: !291)
!294 = !DILocation(line: 140, column: 6, scope: !295)
!295 = !DILexicalBlockFile(scope: !291, file: !152, discriminator: 1)
!296 = !DILocation(line: 144, column: 18, scope: !151)
!297 = !DILocation(line: 144, column: 48, scope: !151)
!298 = !DILocation(line: 144, column: 53, scope: !151)
!299 = !DILocation(line: 144, column: 7, scope: !151)
!300 = !DILocation(line: 144, column: 6, scope: !151)
!301 = !DILocation(line: 145, column: 6, scope: !302)
!302 = distinct !DILexicalBlock(scope: !151, file: !152, line: 145, column: 6)
!303 = !DILocation(line: 145, column: 10, scope: !302)
!304 = !DILocation(line: 145, column: 6, scope: !151)
!305 = !DILocation(line: 146, column: 12, scope: !306)
!306 = distinct !DILexicalBlock(scope: !302, file: !152, line: 145, column: 15)
!307 = !DILocation(line: 146, column: 11, scope: !306)
