; ModuleID = './line1-aliases_parse.o.i'
source_filename = "./line1-aliases_parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.YYSTACKDATA = type { i32, i16*, i16*, i16*, %union.YYSTYPE*, %union.YYSTYPE* }
%union.YYSTYPE = type { i8* }
%struct.aliases = type { %struct.alias* }
%struct.alias = type { %struct.anon.0, i8*, %struct.strlist }
%struct.anon.0 = type { %struct.alias*, %struct.alias** }
%struct.strlist = type { %struct.stritem* }
%struct.stritem = type { %struct.anon, i8* }
%struct.anon = type { %struct.stritem* }

@yynerrs = common global i32 0, align 4
@yyerrflag = common global i32 0, align 4
@yychar = common global i32 0, align 4
@yystack = internal global %struct.YYSTACKDATA zeroinitializer, align 8
@yydefred = internal constant [15 x i16] [i16 0, i16 0, i16 0, i16 0, i16 0, i16 0, i16 5, i16 0, i16 3, i16 1, i16 0, i16 0, i16 0, i16 4, i16 7], align 16
@yysindex = internal constant [15 x i16] [i16 -256, i16 -8, i16 -55, i16 0, i16 -256, i16 4, i16 0, i16 -252, i16 0, i16 0, i16 -38, i16 -3, i16 -252, i16 0, i16 0], align 16
@yycheck = internal constant [11 x i16] [i16 256, i16 257, i16 10, i16 58, i16 0, i16 257, i16 44, i16 10, i16 0, i16 4, i16 12], align 16
@yytable = internal constant [11 x i16] [i16 1, i16 2, i16 6, i16 7, i16 9, i16 10, i16 12, i16 13, i16 2, i16 8, i16 14], align 16
@yylval = common global %union.YYSTYPE zeroinitializer, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !43)
!1 = !DIFile(filename: "line1-aliases_parse.o.i", directory: "/home/lichi/Desktop/dma/task1")
!2 = !{}
!3 = !{!4, !5, !8, !9, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYINT", file: !6, line: 93, baseType: !7)
!6 = !DIFile(filename: "aliases_parse.c", directory: "/home/lichi/Desktop/dma/task1")
!7 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !12, line: 36, baseType: !13)
!12 = !DIFile(filename: "aliases_parse.y", directory: "/home/lichi/Desktop/dma/task1")
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !12, line: 32, size: 64, align: 64, elements: !14)
!14 = !{!15, !18, !28}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !13, file: !12, line: 33, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "strit", scope: !13, file: !12, line: 34, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stritem", file: !21, line: 92, size: 128, align: 64, elements: !22)
!21 = !DIFile(filename: "dma.h", directory: "/home/lichi/Desktop/dma/task1")
!22 = !{!23, !27}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !21, line: 93, baseType: !24, size: 64, align: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !20, file: !21, line: 93, size: 64, align: 64, elements: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "sle_next", scope: !24, file: !21, line: 93, baseType: !19, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !20, file: !21, line: 94, baseType: !16, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !13, file: !12, line: 35, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alias", file: !21, line: 98, size: 256, align: 64, elements: !31)
!31 = !{!32, !38, !39}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !21, line: 99, baseType: !33, size: 128, align: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !30, file: !21, line: 99, size: 128, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !33, file: !21, line: 99, baseType: !29, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !33, file: !21, line: 99, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !30, file: !21, line: 100, baseType: !16, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dests", scope: !30, file: !21, line: 101, baseType: !40, size: 64, align: 64, offset: 192)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "strlist", file: !21, line: 96, size: 64, align: 64, elements: !41)
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "slh_first", scope: !40, file: !21, line: 96, baseType: !19, size: 64, align: 64)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !61, !66, !67, !71, !72, !73, !77, !78, !82}
!44 = distinct !DIGlobalVariable(name: "yydebug", scope: !0, file: !6, line: 157, type: !8, isLocal: false, isDefinition: true, variable: i32* @yydebug)
!45 = distinct !DIGlobalVariable(name: "yynerrs", scope: !0, file: !6, line: 158, type: !8, isLocal: false, isDefinition: true, variable: i32* @yynerrs)
!46 = distinct !DIGlobalVariable(name: "yyerrflag", scope: !0, file: !6, line: 160, type: !8, isLocal: false, isDefinition: true, variable: i32* @yyerrflag)
!47 = distinct !DIGlobalVariable(name: "yychar", scope: !0, file: !6, line: 161, type: !8, isLocal: false, isDefinition: true, variable: i32* @yychar)
!48 = distinct !DIGlobalVariable(name: "yyval", scope: !0, file: !6, line: 162, type: !11, isLocal: false, isDefinition: true, variable: %union.YYSTYPE* @yyval)
!49 = distinct !DIGlobalVariable(name: "yylval", scope: !0, file: !6, line: 163, type: !11, isLocal: false, isDefinition: true, variable: %union.YYSTYPE* @yylval)
!50 = distinct !DIGlobalVariable(name: "yystack", scope: !0, file: !6, line: 189, type: !51, isLocal: true, isDefinition: true, variable: %struct.YYSTACKDATA* @yystack)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTACKDATA", file: !6, line: 187, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 180, size: 384, align: 64, elements: !53)
!53 = !{!54, !56, !57, !58, !59, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !52, file: !6, line: 181, baseType: !55, size: 32, align: 32)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "s_base", scope: !52, file: !6, line: 182, baseType: !9, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "s_mark", scope: !52, file: !6, line: 183, baseType: !9, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "s_last", scope: !52, file: !6, line: 184, baseType: !9, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "l_base", scope: !52, file: !6, line: 185, baseType: !10, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "l_mark", scope: !52, file: !6, line: 186, baseType: !10, size: 64, align: 64, offset: 320)
!61 = distinct !DIGlobalVariable(name: "yydefred", scope: !0, file: !6, line: 100, type: !62, isLocal: true, isDefinition: true, variable: [15 x i16]* @yydefred)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 240, align: 16, elements: !64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!64 = !{!65}
!65 = !DISubrange(count: 15)
!66 = distinct !DIGlobalVariable(name: "yysindex", scope: !0, file: !6, line: 107, type: !62, isLocal: true, isDefinition: true, variable: [15 x i16]* @yysindex)
!67 = distinct !DIGlobalVariable(name: "yycheck", scope: !0, file: !6, line: 122, type: !68, isLocal: true, isDefinition: true, variable: [11 x i16]* @yycheck)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 176, align: 16, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 11)
!71 = distinct !DIGlobalVariable(name: "yytable", scope: !0, file: !6, line: 119, type: !68, isLocal: true, isDefinition: true, variable: [11 x i16]* @yytable)
!72 = distinct !DIGlobalVariable(name: "yyrindex", scope: !0, file: !6, line: 111, type: !62, isLocal: true, isDefinition: true, variable: [15 x i16]* @yyrindex)
!73 = distinct !DIGlobalVariable(name: "yylen", scope: !0, file: !6, line: 97, type: !74, isLocal: true, isDefinition: true, variable: [8 x i16]* @yylen)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, align: 16, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 8)
!77 = distinct !DIGlobalVariable(name: "yylhs", scope: !0, file: !6, line: 94, type: !74, isLocal: true, isDefinition: true, variable: [8 x i16]* @yylhs)
!78 = distinct !DIGlobalVariable(name: "yygindex", scope: !0, file: !6, line: 115, type: !79, isLocal: true, isDefinition: true, variable: [4 x i16]* @yygindex)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, align: 16, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 4)
!82 = distinct !DIGlobalVariable(name: "yydgoto", scope: !0, file: !6, line: 104, type: !79, isLocal: true, isDefinition: true, variable: [4 x i16]* @yydgoto)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!86 = distinct !DISubprogram(name: "yywrap", scope: !12, file: !12, line: 19, type: !87, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!87 = !DISubroutineType(types: !88)
!88 = !{!8}
!89 = !DILocation(line: 21, column: 2, scope: !86)
!90 = distinct !DISubprogram(name: "yyparse", scope: !6, file: !6, line: 250, type: !87, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!91 = !DILocalVariable(name: "yym", scope: !90, file: !6, line: 252, type: !8)
!92 = !DIExpression()
!93 = !DILocation(line: 252, column: 9, scope: !90)
!94 = !DILocalVariable(name: "yyn", scope: !90, file: !6, line: 252, type: !8)
!95 = !DILocation(line: 252, column: 14, scope: !90)
!96 = !DILocalVariable(name: "yystate", scope: !90, file: !6, line: 252, type: !8)
!97 = !DILocation(line: 252, column: 19, scope: !90)
!98 = !DILocation(line: 264, column: 13, scope: !90)
!99 = !DILocation(line: 265, column: 15, scope: !90)
!100 = !DILocation(line: 266, column: 12, scope: !90)
!101 = !DILocation(line: 267, column: 13, scope: !90)
!102 = !DILocation(line: 273, column: 17, scope: !103)
!103 = distinct !DILexicalBlock(scope: !90, file: !6, line: 273, column: 9)
!104 = !DILocation(line: 273, column: 24, scope: !103)
!105 = !DILocation(line: 273, column: 31, scope: !103)
!106 = !DILocation(line: 273, column: 34, scope: !107)
!107 = !DILexicalBlockFile(scope: !103, file: !6, discriminator: 1)
!108 = !DILocation(line: 273, column: 56, scope: !107)
!109 = !DILocation(line: 273, column: 9, scope: !107)
