; ModuleID = './libRpcChannel_la-vsockChannel.o.i'
source_filename = "./libRpcChannel_la-vsockChannel.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._RpcChannelFuncs = type { i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*, i8*, i64, i8*, i8**, i64*)*, void (%struct._RpcChannel*, %struct._GMainContext*, i8*, i8*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)*, void (%struct._RpcChannel*)*, i32 (%struct._RpcChannel*)* }
%struct._RpcChannel = type { %struct._RpcChannelFuncs*, i8*, %struct._GMainContext*, i8*, i8*, %struct.GStaticMutex, %struct.RpcIn*, i32, i32 }
%struct._GMainContext = type opaque
%struct.GStaticMutex = type { %union._GMutex*, %union.pthread_mutex_t }
%union._GMutex = type { i8* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.RpcIn = type opaque
%struct.VSockChannel = type { %struct.VSockOut* }
%struct.VSockOut = type { i32, i8*, i32, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, globals: !23)
!1 = !DIFile(filename: "libRpcChannel_la-vsockChannel.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RpcChannelType", file: !4, line: 79, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "RPCCHANNEL_TYPE_INACTIVE", value: 0)
!7 = !DIEnumerator(name: "RPCCHANNEL_TYPE_BKDOOR", value: 1)
!8 = !DIEnumerator(name: "RPCCHANNEL_TYPE_PRIV_VSOCK", value: 2)
!9 = !DIEnumerator(name: "RPCCHANNEL_TYPE_UNPRIV_VSOCK", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 41, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "simpleSocket.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!12 = !{!13, !14, !15, !16, !17, !18}
!13 = !DIEnumerator(name: "SOCKERR_SUCCESS", value: 0)
!14 = !DIEnumerator(name: "SOCKERR_VMCI_FAMILY", value: 1)
!15 = !DIEnumerator(name: "SOCKERR_STARTUP", value: 2)
!16 = !DIEnumerator(name: "SOCKERR_SOCKET", value: 3)
!17 = !DIEnumerator(name: "SOCKERR_CONNECT", value: 4)
!18 = !DIEnumerator(name: "SOCKERR_BIND", value: 5)
!19 = !{!20, !21, !22}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOCKET", file: !11, line: 66, baseType: !22)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !{!24}
!24 = distinct !DIGlobalVariable(name: "funcs", scope: !25, file: !26, line: 567, type: !37, isLocal: true, isDefinition: true, variable: %struct._RpcChannelFuncs* @VSockChannel_New.funcs)
!25 = distinct !DISubprogram(name: "VSockChannel_New", scope: !26, file: !26, line: 562, type: !27, isLocal: false, isDefinition: true, scopeLine: 563, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!26 = !DIFile(filename: "vsockChannel.c", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!27 = !DISubroutineType(types: !28)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !4, line: 48, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !32, line: 64, size: 832, align: 64, elements: !33)
!32 = !DIFile(filename: "rpcChannelInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!33 = !{!34, !84, !85, !86, !87, !88, !135, !138, !139}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !31, file: !32, line: 65, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelFuncs", file: !32, line: 56, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannelFuncs", file: !32, line: 45, size: 512, align: 64, elements: !39)
!39 = !{!40, !47, !51, !67, !76, !77, !82, !83}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !38, file: !32, line: 46, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !29}
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !45, line: 50, baseType: !46)
!45 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !45, line: 49, baseType: !22)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !38, file: !32, line: 47, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !29}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !38, file: !32, line: 48, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!44, !29, !55, !58, !61, !64, !66}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 216, baseType: !60)
!59 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!60 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !63, line: 230, baseType: !57)
!63 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !38, file: !32, line: 50, baseType: !68, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !29, !71, !55, !75}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !73, line: 48, baseType: !74)
!73 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !73, line: 48, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !45, line: 77, baseType: !20)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !38, file: !32, line: 52, baseType: !48, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "getType", scope: !38, file: !32, line: 53, baseType: !78, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !29}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelType", file: !4, line: 84, baseType: !3)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "onStartErr", scope: !38, file: !32, line: 54, baseType: !48, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stopRpcOut", scope: !38, file: !32, line: 55, baseType: !41, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !31, file: !32, line: 66, baseType: !75, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mainCtx", scope: !31, file: !32, line: 68, baseType: !71, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !31, file: !32, line: 69, baseType: !55, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !31, file: !32, line: 70, baseType: !75, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "outLock", scope: !31, file: !32, line: 72, baseType: !89, size: 384, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !90, line: 140, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 133, size: 384, align: 64, elements: !92)
!92 = !{!93, !106}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !91, file: !90, line: 135, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !96, line: 51, baseType: !97)
!96 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !96, line: 58, size: 64, align: 64, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !97, file: !96, line: 61, baseType: !75, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !97, file: !96, line: 62, baseType: !101, size: 64, align: 32)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 64, align: 32, elements: !104)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !45, line: 55, baseType: !103)
!103 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!104 = !{!105}
!105 = !DISubrange(count: 2)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !91, file: !90, line: 138, baseType: !107, size: 320, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !108, line: 128, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line825")
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !108, line: 90, size: 320, align: 64, elements: !110)
!110 = !{!111, !129, !133}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !109, file: !108, line: 125, baseType: !112, size: 320, align: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !108, line: 92, size: 320, align: 64, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !121, !122}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !112, file: !108, line: 94, baseType: !22, size: 32, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !112, file: !108, line: 95, baseType: !103, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !112, file: !108, line: 96, baseType: !22, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !112, file: !108, line: 98, baseType: !103, size: 32, align: 32, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !112, file: !108, line: 102, baseType: !22, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !112, file: !108, line: 104, baseType: !120, size: 16, align: 16, offset: 160)
!120 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !112, file: !108, line: 105, baseType: !120, size: 16, align: 16, offset: 176)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !112, file: !108, line: 106, baseType: !123, size: 128, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !108, line: 79, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !108, line: 75, size: 128, align: 64, elements: !125)
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !124, file: !108, line: 77, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !124, file: !108, line: 78, baseType: !127, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !109, file: !108, line: 126, baseType: !130, size: 320, align: 8)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 320, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 40)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !109, file: !108, line: 127, baseType: !134, size: 64, align: 64)
!134 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !31, file: !32, line: 74, baseType: !136, size: 64, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "RpcIn", file: !32, line: 41, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "inStarted", scope: !31, file: !32, line: 75, baseType: !44, size: 32, align: 32, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "outStarted", scope: !31, file: !32, line: 77, baseType: !44, size: 32, align: 32, offset: 800)
!140 = !{}
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!144 = !DILocalVariable(name: "chan", scope: !25, file: !26, line: 564, type: !29)
!145 = !DIExpression()
!146 = !DILocation(line: 564, column: 16, scope: !25)
!147 = !DILocalVariable(name: "vsock", scope: !25, file: !26, line: 565, type: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "VSockChannel", file: !26, line: 45, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VSockChannel", file: !26, line: 43, size: 64, align: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !26, line: 44, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "VSockOut", file: !26, line: 41, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VSockOut", file: !26, line: 36, size: 192, align: 64, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !155, file: !26, line: 37, baseType: !21, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !155, file: !26, line: 38, baseType: !65, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "payloadLen", scope: !155, file: !26, line: 39, baseType: !22, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !26, line: 40, baseType: !81, size: 32, align: 32, offset: 160)
!161 = !DILocation(line: 565, column: 18, scope: !25)
!162 = !DILocation(line: 578, column: 11, scope: !25)
!163 = !DILocation(line: 578, column: 9, scope: !25)
!164 = !DILocation(line: 579, column: 12, scope: !25)
!165 = !DILocation(line: 579, column: 10, scope: !25)
!166 = !DILocation(line: 581, column: 17, scope: !25)
!167 = !DILocation(line: 581, column: 4, scope: !25)
!168 = !DILocation(line: 581, column: 11, scope: !25)
!169 = !DILocation(line: 581, column: 15, scope: !25)
!170 = !DILocation(line: 585, column: 4, scope: !25)
!171 = !DILocation(line: 585, column: 10, scope: !25)
!172 = !DILocation(line: 585, column: 20, scope: !25)
!173 = !DILocation(line: 587, column: 4, scope: !25)
!174 = !DILocation(line: 587, column: 10, scope: !25)
!175 = !DILocation(line: 587, column: 21, scope: !25)
!176 = !DILocation(line: 589, column: 21, scope: !25)
!177 = !DILocation(line: 589, column: 4, scope: !25)
!178 = !DILocation(line: 589, column: 10, scope: !25)
!179 = !DILocation(line: 589, column: 19, scope: !25)
!180 = !DILocation(line: 590, column: 4, scope: !25)
!181 = !DILocation(line: 590, column: 10, scope: !25)
!182 = !DILocation(line: 590, column: 16, scope: !25)
!183 = !DILocation(line: 592, column: 11, scope: !25)
!184 = !DILocation(line: 592, column: 4, scope: !25)
!185 = distinct !DISubprogram(name: "VSockChannelStart", scope: !26, file: !26, line: 342, type: !42, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!186 = !DILocalVariable(name: "chan", arg: 1, scope: !185, file: !26, line: 342, type: !29)
!187 = !DILocation(line: 342, column: 31, scope: !185)
!188 = !DILocalVariable(name: "ret", scope: !185, file: !26, line: 344, type: !44)
!189 = !DILocation(line: 344, column: 13, scope: !185)
!190 = !DILocalVariable(name: "vsock", scope: !185, file: !26, line: 345, type: !148)
!191 = !DILocation(line: 345, column: 18, scope: !185)
!192 = !DILocation(line: 345, column: 26, scope: !185)
!193 = !DILocation(line: 345, column: 32, scope: !185)
!194 = !DILocation(line: 348, column: 10, scope: !185)
!195 = !DILocation(line: 348, column: 16, scope: !185)
!196 = !DILocation(line: 348, column: 19, scope: !185)
!197 = !DILocation(line: 348, column: 26, scope: !185)
!198 = !DILocation(line: 348, column: 29, scope: !199)
!199 = !DILexicalBlockFile(scope: !185, file: !26, discriminator: 1)
!200 = !DILocation(line: 348, column: 35, scope: !199)
!201 = !DILocation(line: 348, column: 26, scope: !199)
!202 = !DILocation(line: 348, column: 26, scope: !203)
!203 = !DILexicalBlockFile(scope: !185, file: !26, discriminator: 2)
!204 = !DILocation(line: 348, column: 8, scope: !203)
!205 = !DILocation(line: 351, column: 8, scope: !206)
!206 = distinct !DILexicalBlock(scope: !185, file: !26, line: 351, column: 8)
!207 = !DILocation(line: 351, column: 8, scope: !185)
!208 = !DILocation(line: 352, column: 27, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !26, line: 351, column: 13)
!210 = !DILocation(line: 352, column: 34, scope: !209)
!211 = !DILocation(line: 352, column: 13, scope: !209)
!212 = !DILocation(line: 352, column: 11, scope: !209)
!213 = !DILocation(line: 353, column: 4, scope: !209)
!214 = !DILocation(line: 354, column: 23, scope: !185)
!215 = !DILocation(line: 354, column: 4, scope: !185)
!216 = !DILocation(line: 354, column: 10, scope: !185)
!217 = !DILocation(line: 354, column: 21, scope: !185)
!218 = !DILocation(line: 356, column: 11, scope: !185)
!219 = !DILocation(line: 356, column: 4, scope: !185)
!220 = distinct !DISubprogram(name: "VSockChannelStop", scope: !26, file: !26, line: 378, type: !49, isLocal: true, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !140)
!221 = !DILocalVariable(name: "chan", arg: 1, scope: !220, file: !26, line: 378, type: !29)
