; ModuleID = './dictll.o.i'
source_filename = "./dictll.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.DynBuf = type { i8*, i64, i64 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !14)
!1 = !DIFile(filename: "dictll.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!2 = !{}
!3 = !{!4, !5, !10, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !6, line: 173, baseType: !7)
!6 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 51, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!14 = !{!15, !30, !31, !32, !33}
!15 = distinct !DIGlobalVariable(name: "ws_in", scope: !16, file: !17, line: 150, type: !25, isLocal: true, isDefinition: true, variable: [256 x i32]* @DictLL_UnmarshalLine.ws_in)
!16 = distinct !DISubprogram(name: "DictLL_UnmarshalLine", scope: !17, file: !17, line: 143, type: !18, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!17 = !DIFile(filename: "dictll.c", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!18 = !DISubroutineType(types: !19)
!19 = !{!10, !10, !20, !23, !23, !23}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 216, baseType: !22)
!21 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!22 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, align: 32, elements: !28)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !{!29}
!29 = !DISubrange(count: 256)
!30 = distinct !DIGlobalVariable(name: "wsp_out", scope: !16, file: !17, line: 169, type: !25, isLocal: true, isDefinition: true, variable: [256 x i32]* @DictLL_UnmarshalLine.wsp_out)
!31 = distinct !DIGlobalVariable(name: "wspe_out", scope: !16, file: !17, line: 188, type: !25, isLocal: true, isDefinition: true, variable: [256 x i32]* @DictLL_UnmarshalLine.wspe_out)
!32 = distinct !DIGlobalVariable(name: "q_out", scope: !16, file: !17, line: 207, type: !25, isLocal: true, isDefinition: true, variable: [256 x i32]* @DictLL_UnmarshalLine.q_out)
!33 = distinct !DIGlobalVariable(name: "toEscape", scope: !34, file: !17, line: 403, type: !25, isLocal: true, isDefinition: true, variable: [256 x i32]* @DictLL_MarshalLine.toEscape)
!34 = distinct !DISubprogram(name: "DictLL_MarshalLine", scope: !17, file: !17, line: 390, type: !35, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !10, !10}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !6, line: 230, baseType: !12)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !40, line: 40, baseType: !41)
!40 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !40, line: 36, size: 192, align: 64, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !40, line: 37, baseType: !24, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 38, baseType: !20, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !41, file: !40, line: 39, baseType: !20, size: 64, align: 64, offset: 128)
!46 = !{i32 2, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!49 = !DILocalVariable(name: "buf", arg: 1, scope: !16, file: !17, line: 143, type: !10)
!50 = !DIExpression()
!51 = !DILocation(line: 143, column: 34, scope: !16)
!52 = !DILocalVariable(name: "bufSize", arg: 2, scope: !16, file: !17, line: 144, type: !20)
!53 = !DILocation(line: 144, column: 29, scope: !16)
!54 = !DILocalVariable(name: "line", arg: 3, scope: !16, file: !17, line: 145, type: !23)
!55 = !DILocation(line: 145, column: 29, scope: !16)
!56 = !DILocalVariable(name: "name", arg: 4, scope: !16, file: !17, line: 146, type: !23)
!57 = !DILocation(line: 146, column: 29, scope: !16)
!58 = !DILocalVariable(name: "value", arg: 5, scope: !16, file: !17, line: 147, type: !23)
!59 = !DILocation(line: 147, column: 29, scope: !16)
!60 = !DILocalVariable(name: "nBegin", scope: !16, file: !17, line: 225, type: !10)
!61 = !DILocation(line: 225, column: 16, scope: !16)
!62 = !DILocalVariable(name: "nEnd", scope: !16, file: !17, line: 226, type: !10)
!63 = !DILocation(line: 226, column: 16, scope: !16)
!64 = !DILocalVariable(name: "vBegin", scope: !16, file: !17, line: 227, type: !10)
!65 = !DILocation(line: 227, column: 16, scope: !16)
!66 = !DILocalVariable(name: "vEnd", scope: !16, file: !17, line: 228, type: !10)
!67 = !DILocation(line: 228, column: 16, scope: !16)
!68 = !DILocalVariable(name: "tmp", scope: !16, file: !17, line: 229, type: !10)
!69 = !DILocation(line: 229, column: 16, scope: !16)
!70 = !DILocalVariable(name: "myLine", scope: !16, file: !17, line: 230, type: !24)
!71 = !DILocation(line: 230, column: 10, scope: !16)
!72 = !DILocalVariable(name: "myName", scope: !16, file: !17, line: 231, type: !24)
!73 = !DILocation(line: 231, column: 10, scope: !16)
!74 = !DILocalVariable(name: "myValue", scope: !16, file: !17, line: 232, type: !24)
!75 = !DILocation(line: 232, column: 10, scope: !16)
!76 = !DILocalVariable(name: "lineEnd", scope: !16, file: !17, line: 233, type: !10)
!77 = !DILocation(line: 233, column: 16, scope: !16)
!78 = !DILocalVariable(name: "nextLine", scope: !16, file: !17, line: 234, type: !10)
!79 = !DILocation(line: 234, column: 16, scope: !16)
!80 = !DILocation(line: 242, column: 8, scope: !81)
!81 = distinct !DILexicalBlock(scope: !16, file: !17, line: 242, column: 8)
!82 = !DILocation(line: 242, column: 16, scope: !81)
!83 = !DILocation(line: 242, column: 8, scope: !16)
!84 = !DILocation(line: 243, column: 8, scope: !85)
!85 = distinct !DILexicalBlock(scope: !81, file: !17, line: 242, column: 22)
!86 = !DILocation(line: 243, column: 13, scope: !85)
!87 = !DILocation(line: 244, column: 8, scope: !85)
!88 = !DILocation(line: 244, column: 13, scope: !85)
!89 = !DILocation(line: 245, column: 8, scope: !85)
!90 = !DILocation(line: 245, column: 14, scope: !85)
!91 = !DILocation(line: 246, column: 7, scope: !85)
!92 = !DILocation(line: 250, column: 21, scope: !16)
!93 = !DILocation(line: 250, column: 32, scope: !16)
!94 = !DILocation(line: 250, column: 14, scope: !16)
!95 = !DILocation(line: 250, column: 12, scope: !16)
!96 = !DILocation(line: 251, column: 8, scope: !97)
!97 = distinct !DILexicalBlock(scope: !16, file: !17, line: 251, column: 8)
!98 = !DILocation(line: 251, column: 16, scope: !97)
!99 = !DILocation(line: 251, column: 8, scope: !16)
!100 = !DILocation(line: 252, column: 18, scope: !101)
!101 = distinct !DILexicalBlock(scope: !97, file: !17, line: 251, column: 24)
!102 = !DILocation(line: 252, column: 26, scope: !101)
!103 = !DILocation(line: 252, column: 16, scope: !101)
!104 = !DILocation(line: 253, column: 4, scope: !101)
!105 = !DILocation(line: 254, column: 28, scope: !106)
!106 = distinct !DILexicalBlock(scope: !97, file: !17, line: 253, column: 11)
!107 = !DILocation(line: 254, column: 34, scope: !106)
!108 = !DILocation(line: 254, column: 32, scope: !106)
!109 = !DILocation(line: 254, column: 26, scope: !106)
!110 = !DILocation(line: 254, column: 16, scope: !106)
!111 = !DILocation(line: 258, column: 20, scope: !16)
!112 = !DILocation(line: 258, column: 25, scope: !16)
!113 = !DILocation(line: 258, column: 35, scope: !16)
!114 = !DILocation(line: 258, column: 33, scope: !16)
!115 = !DILocation(line: 258, column: 13, scope: !16)
!116 = !DILocation(line: 258, column: 11, scope: !16)
!117 = !DILocation(line: 261, column: 18, scope: !16)
!118 = !DILocation(line: 261, column: 13, scope: !16)
!119 = !DILocation(line: 261, column: 11, scope: !16)
!120 = !DILocation(line: 262, column: 16, scope: !16)
!121 = !DILocation(line: 262, column: 11, scope: !16)
!122 = !DILocation(line: 262, column: 9, scope: !16)
!123 = !DILocation(line: 263, column: 15, scope: !16)
!124 = !DILocation(line: 263, column: 10, scope: !16)
!125 = !DILocation(line: 263, column: 8, scope: !16)
!126 = !DILocation(line: 264, column: 8, scope: !127)
!127 = distinct !DILexicalBlock(scope: !16, file: !17, line: 264, column: 8)
!128 = !DILocation(line: 264, column: 18, scope: !127)
!129 = !DILocation(line: 264, column: 15, scope: !127)
!130 = !DILocation(line: 264, column: 23, scope: !127)
!131 = !DILocation(line: 264, column: 27, scope: !132)
!132 = !DILexicalBlockFile(scope: !127, file: !17, discriminator: 1)
!133 = !DILocation(line: 264, column: 26, scope: !132)
!134 = !DILocation(line: 264, column: 31, scope: !132)
!135 = !DILocation(line: 264, column: 8, scope: !132)
!136 = !DILocation(line: 265, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !127, file: !17, line: 264, column: 39)
!138 = !DILocation(line: 267, column: 7, scope: !16)
!139 = !DILocation(line: 268, column: 15, scope: !16)
!140 = !DILocation(line: 268, column: 10, scope: !16)
!141 = !DILocation(line: 268, column: 8, scope: !16)
!142 = !DILocation(line: 269, column: 9, scope: !143)
!143 = distinct !DILexicalBlock(scope: !16, file: !17, line: 269, column: 8)
!144 = !DILocation(line: 269, column: 8, scope: !143)
!145 = !DILocation(line: 269, column: 13, scope: !143)
!146 = !DILocation(line: 269, column: 8, scope: !16)
!147 = !DILocation(line: 270, column: 10, scope: !148)
!148 = distinct !DILexicalBlock(scope: !143, file: !17, line: 269, column: 21)
!149 = !DILocation(line: 271, column: 16, scope: !148)
!150 = !DILocation(line: 271, column: 14, scope: !148)
!151 = !DILocation(line: 272, column: 19, scope: !148)
!152 = !DILocation(line: 272, column: 14, scope: !148)
!153 = !DILocation(line: 272, column: 12, scope: !148)
!154 = !DILocation(line: 273, column: 13, scope: !148)
!155 = !DILocation(line: 273, column: 11, scope: !148)
!156 = !DILocation(line: 274, column: 12, scope: !157)
!157 = distinct !DILexicalBlock(scope: !148, file: !17, line: 274, column: 11)
!158 = !DILocation(line: 274, column: 11, scope: !157)
!159 = !DILocation(line: 274, column: 16, scope: !157)
!160 = !DILocation(line: 274, column: 11, scope: !148)
!161 = !DILocation(line: 275, column: 10, scope: !162)
!162 = distinct !DILexicalBlock(scope: !157, file: !17, line: 274, column: 24)
!163 = !DILocation(line: 277, column: 10, scope: !148)
!164 = !DILocation(line: 278, column: 4, scope: !148)
!165 = !DILocation(line: 279, column: 16, scope: !166)
!166 = distinct !DILexicalBlock(scope: !143, file: !17, line: 278, column: 11)
!167 = !DILocation(line: 279, column: 14, scope: !166)
!168 = !DILocation(line: 280, column: 19, scope: !166)
!169 = !DILocation(line: 280, column: 14, scope: !166)
!170 = !DILocation(line: 280, column: 12, scope: !166)
!171 = !DILocation(line: 281, column: 13, scope: !166)
!172 = !DILocation(line: 281, column: 11, scope: !166)
!173 = !DILocation(line: 283, column: 15, scope: !16)
!174 = !DILocation(line: 283, column: 10, scope: !16)
!175 = !DILocation(line: 283, column: 8, scope: !16)
!176 = !DILocation(line: 284, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !16, file: !17, line: 284, column: 8)
!178 = !DILocation(line: 284, column: 8, scope: !177)
!179 = !DILocation(line: 284, column: 13, scope: !177)
!180 = !DILocation(line: 284, column: 21, scope: !177)
!181 = !DILocation(line: 284, column: 25, scope: !182)
!182 = !DILexicalBlockFile(scope: !177, file: !17, discriminator: 1)
!183 = !DILocation(line: 284, column: 24, scope: !182)
!184 = !DILocation(line: 284, column: 29, scope: !182)
!185 = !DILocation(line: 284, column: 8, scope: !182)
!186 = !DILocation(line: 285, column: 7, scope: !187)
!187 = distinct !DILexicalBlock(scope: !177, file: !17, line: 284, column: 37)
!188 = !DILocation(line: 290, column: 20, scope: !16)
!189 = !DILocation(line: 290, column: 28, scope: !16)
!190 = !DILocation(line: 290, column: 35, scope: !16)
!191 = !DILocation(line: 290, column: 33, scope: !16)
!192 = !DILocation(line: 290, column: 13, scope: !16)
!193 = !DILocation(line: 290, column: 11, scope: !16)
!194 = !DILocation(line: 291, column: 31, scope: !16)
!195 = !DILocation(line: 291, column: 39, scope: !16)
!196 = !DILocation(line: 291, column: 46, scope: !16)
!197 = !DILocation(line: 291, column: 44, scope: !16)
!198 = !DILocation(line: 291, column: 14, scope: !16)
!199 = !DILocation(line: 291, column: 12, scope: !16)
!200 = !DILocation(line: 292, column: 30, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !17, line: 292, column: 10)
!202 = distinct !DILexicalBlock(scope: !16, file: !17, line: 292, column: 5)
!203 = !DILocation(line: 292, column: 28, scope: !201)
!204 = !DILocation(line: 292, column: 27, scope: !201)
!205 = !DILocation(line: 292, column: 10, scope: !201)
!206 = !DILocation(line: 292, column: 10, scope: !202)
!207 = !DILocation(line: 292, column: 47, scope: !208)
!208 = !DILexicalBlockFile(scope: !209, file: !17, discriminator: 1)
!209 = distinct !DILexicalBlock(scope: !201, file: !17, line: 292, column: 45)
!210 = !DILocation(line: 294, column: 12, scope: !16)
!211 = !DILocation(line: 294, column: 5, scope: !16)
!212 = !DILocation(line: 294, column: 10, scope: !16)
!213 = !DILocation(line: 295, column: 12, scope: !16)
!214 = !DILocation(line: 295, column: 5, scope: !16)
!215 = !DILocation(line: 295, column: 10, scope: !16)
!216 = !DILocation(line: 296, column: 13, scope: !16)
!217 = !DILocation(line: 296, column: 5, scope: !16)
!218 = !DILocation(line: 296, column: 11, scope: !16)
!219 = !DILocation(line: 298, column: 11, scope: !16)
!220 = !DILocation(line: 298, column: 4, scope: !16)
!221 = !DILocation(line: 303, column: 12, scope: !16)
!222 = !DILocation(line: 303, column: 5, scope: !16)
!223 = !DILocation(line: 303, column: 10, scope: !16)
!224 = !DILocation(line: 304, column: 5, scope: !16)
!225 = !DILocation(line: 304, column: 10, scope: !16)
!226 = !DILocation(line: 305, column: 5, scope: !16)
!227 = !DILocation(line: 305, column: 11, scope: !16)
!228 = !DILocation(line: 307, column: 11, scope: !16)
!229 = !DILocation(line: 307, column: 4, scope: !16)
!230 = !DILocation(line: 308, column: 1, scope: !16)
!231 = distinct !DISubprogram(name: "BufDup", scope: !17, file: !17, line: 42, type: !232, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!232 = !DISubroutineType(types: !233)
!233 = !{!4, !234, !237}
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!238 = !DILocalVariable(name: "bufIn", arg: 1, scope: !231, file: !17, line: 42, type: !234)
!239 = !DILocation(line: 42, column: 27, scope: !231)
!240 = !DILocalVariable(name: "sizeIn", arg: 2, scope: !231, file: !17, line: 43, type: !237)
!241 = !DILocation(line: 43, column: 27, scope: !231)
!242 = !DILocalVariable(name: "bufOut", scope: !231, file: !17, line: 45, type: !24)
!243 = !DILocation(line: 45, column: 10, scope: !231)
!244 = !DILocation(line: 49, column: 30, scope: !231)
!245 = !DILocation(line: 49, column: 37, scope: !231)
!246 = !DILocation(line: 49, column: 29, scope: !231)
!247 = !DILocation(line: 49, column: 13, scope: !231)
!248 = !DILocation(line: 49, column: 11, scope: !231)
!249 = !DILocation(line: 50, column: 11, scope: !231)
!250 = !DILocation(line: 50, column: 19, scope: !231)
!251 = !DILocation(line: 50, column: 26, scope: !231)
!252 = !DILocation(line: 50, column: 4, scope: !231)
!253 = !DILocation(line: 51, column: 11, scope: !231)
!254 = !DILocation(line: 51, column: 4, scope: !231)
!255 = !DILocation(line: 51, column: 19, scope: !231)
!256 = !DILocation(line: 53, column: 11, scope: !231)
!257 = !DILocation(line: 53, column: 4, scope: !231)
!258 = distinct !DISubprogram(name: "Walk", scope: !17, file: !17, line: 78, type: !259, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!259 = !DISubroutineType(types: !260)
!260 = !{!235, !234, !261}
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!263 = !DILocalVariable(name: "bufIn", arg: 1, scope: !258, file: !17, line: 78, type: !234)
!264 = !DILocation(line: 78, column: 25, scope: !258)
!265 = !DILocalVariable(name: "sentinel", arg: 2, scope: !258, file: !17, line: 79, type: !261)
!266 = !DILocation(line: 79, column: 24, scope: !258)
!267 = !DILocalVariable(name: "buf", scope: !258, file: !17, line: 81, type: !10)
!268 = !DILocation(line: 81, column: 16, scope: !258)
!269 = !DILocation(line: 83, column: 24, scope: !258)
!270 = !DILocation(line: 83, column: 8, scope: !258)
!271 = !DILocation(line: 87, column: 4, scope: !258)
!272 = !DILocation(line: 87, column: 36, scope: !273)
!273 = !DILexicalBlockFile(scope: !258, file: !17, discriminator: 1)
!274 = !DILocation(line: 87, column: 35, scope: !273)
!275 = !DILocation(line: 87, column: 11, scope: !273)
!276 = !DILocation(line: 87, column: 4, scope: !273)
!277 = !DILocation(line: 88, column: 10, scope: !278)
!278 = distinct !DILexicalBlock(scope: !258, file: !17, line: 87, column: 42)
!279 = !DILocation(line: 87, column: 4, scope: !280)
!280 = !DILexicalBlockFile(scope: !258, file: !17, discriminator: 2)
!281 = distinct !{!281, !271}
!282 = !DILocation(line: 91, column: 11, scope: !258)
!283 = !DILocation(line: 91, column: 4, scope: !258)
!284 = distinct !DISubprogram(name: "DictLL_ReadLine", scope: !17, file: !17, line: 332, type: !285, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!285 = !DISubroutineType(types: !286)
!286 = !{!27, !287, !23, !23, !23}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !289, line: 48, baseType: !290)
!289 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !291, line: 241, size: 1728, align: 64, elements: !292)
!291 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !313, !314, !315, !316, !320, !322, !324, !328, !331, !333, !334, !335, !336, !337, !338, !339}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !290, file: !291, line: 242, baseType: !27, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !290, file: !291, line: 247, baseType: !24, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !290, file: !291, line: 248, baseType: !24, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !290, file: !291, line: 249, baseType: !24, size: 64, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !290, file: !291, line: 250, baseType: !24, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !290, file: !291, line: 251, baseType: !24, size: 64, align: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !290, file: !291, line: 252, baseType: !24, size: 64, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !290, file: !291, line: 253, baseType: !24, size: 64, align: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !290, file: !291, line: 254, baseType: !24, size: 64, align: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !290, file: !291, line: 256, baseType: !24, size: 64, align: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !290, file: !291, line: 257, baseType: !24, size: 64, align: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !290, file: !291, line: 258, baseType: !24, size: 64, align: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !290, file: !291, line: 260, baseType: !306, size: 64, align: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !291, line: 156, size: 192, align: 64, elements: !308)
!308 = !{!309, !310, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !307, file: !291, line: 157, baseType: !306, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !307, file: !291, line: 158, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !307, file: !291, line: 162, baseType: !27, size: 32, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !290, file: !291, line: 262, baseType: !311, size: 64, align: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !290, file: !291, line: 264, baseType: !27, size: 32, align: 32, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !290, file: !291, line: 268, baseType: !27, size: 32, align: 32, offset: 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !290, file: !291, line: 270, baseType: !317, size: 64, align: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !318, line: 131, baseType: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line136")
!319 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !290, file: !291, line: 274, baseType: !321, size: 16, align: 16, offset: 1024)
!321 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !290, file: !291, line: 275, baseType: !323, size: 8, align: 8, offset: 1040)
!323 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !290, file: !291, line: 276, baseType: !325, size: 8, align: 8, offset: 1048)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 1)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !290, file: !291, line: 280, baseType: !329, size: 64, align: 64, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !291, line: 150, baseType: null)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !290, file: !291, line: 289, baseType: !332, size: 64, align: 64, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !318, line: 132, baseType: !319)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !290, file: !291, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !290, file: !291, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !290, file: !291, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !290, file: !291, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !290, file: !291, line: 302, baseType: !20, size: 64, align: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !290, file: !291, line: 303, baseType: !27, size: 32, align: 32, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !290, file: !291, line: 305, baseType: !340, size: 160, align: 8, offset: 1568)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, align: 8, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 20)
!343 = !DILocalVariable(name: "stream", arg: 1, scope: !284, file: !17, line: 332, type: !287)
!344 = !DILocation(line: 332, column: 23, scope: !284)
!345 = !DILocalVariable(name: "line", arg: 2, scope: !284, file: !17, line: 333, type: !23)
!346 = !DILocation(line: 333, column: 24, scope: !284)
!347 = !DILocalVariable(name: "name", arg: 3, scope: !284, file: !17, line: 334, type: !23)
!348 = !DILocation(line: 334, column: 24, scope: !284)
!349 = !DILocalVariable(name: "value", arg: 4, scope: !284, file: !17, line: 335, type: !23)
!350 = !DILocation(line: 335, column: 24, scope: !284)
!351 = !DILocalVariable(name: "myLine", scope: !284, file: !17, line: 337, type: !24)
!352 = !DILocation(line: 337, column: 10, scope: !284)
!353 = !DILocalVariable(name: "myLineLen", scope: !284, file: !17, line: 338, type: !20)
!354 = !DILocation(line: 338, column: 11, scope: !284)
!355 = !DILocation(line: 345, column: 5, scope: !284)
!356 = !DILocation(line: 345, column: 10, scope: !284)
!357 = !DILocation(line: 346, column: 5, scope: !284)
!358 = !DILocation(line: 346, column: 10, scope: !284)
!359 = !DILocation(line: 347, column: 5, scope: !284)
!360 = !DILocation(line: 347, column: 11, scope: !284)
!361 = !DILocation(line: 349, column: 31, scope: !284)
!362 = !DILocation(line: 349, column: 12, scope: !284)
!363 = !DILocation(line: 349, column: 4, scope: !284)
!364 = !DILocation(line: 351, column: 7, scope: !365)
!365 = distinct !DILexicalBlock(scope: !284, file: !17, line: 349, column: 64)
!366 = !DILocation(line: 354, column: 7, scope: !365)
!367 = !DILocation(line: 357, column: 32, scope: !368)
!368 = distinct !DILexicalBlock(scope: !365, file: !17, line: 357, column: 11)
!369 = !DILocation(line: 357, column: 40, scope: !368)
!370 = !DILocation(line: 358, column: 32, scope: !368)
!371 = !DILocation(line: 358, column: 38, scope: !368)
!372 = !DILocation(line: 358, column: 44, scope: !368)
!373 = !DILocation(line: 357, column: 11, scope: !368)
!374 = !DILocation(line: 358, column: 51, scope: !368)
!375 = !DILocation(line: 357, column: 11, scope: !365)
!376 = !DILocation(line: 359, column: 18, scope: !377)
!377 = distinct !DILexicalBlock(scope: !368, file: !17, line: 358, column: 59)
!378 = !DILocation(line: 359, column: 11, scope: !377)
!379 = !DILocation(line: 359, column: 16, scope: !377)
!380 = !DILocation(line: 360, column: 7, scope: !377)
!381 = !DILocation(line: 361, column: 12, scope: !365)
!382 = !DILocation(line: 361, column: 7, scope: !365)
!383 = !DILocation(line: 362, column: 7, scope: !365)
!384 = !DILocation(line: 365, column: 7, scope: !365)
!385 = !DILocation(line: 368, column: 1, scope: !284)
!386 = !DILocalVariable(name: "output", arg: 1, scope: !34, file: !17, line: 390, type: !38)
!387 = !DILocation(line: 390, column: 28, scope: !34)
!388 = !DILocalVariable(name: "name", arg: 2, scope: !34, file: !17, line: 391, type: !10)
!389 = !DILocation(line: 391, column: 32, scope: !34)
!390 = !DILocalVariable(name: "value", arg: 3, scope: !34, file: !17, line: 392, type: !10)
!391 = !DILocation(line: 392, column: 32, scope: !34)
!392 = !DILocalVariable(name: "size", scope: !34, file: !17, line: 394, type: !20)
!393 = !DILocation(line: 394, column: 11, scope: !34)
!394 = !DILocation(line: 396, column: 8, scope: !395)
!395 = distinct !DILexicalBlock(scope: !34, file: !17, line: 396, column: 8)
!396 = !DILocation(line: 396, column: 8, scope: !34)
!397 = !DILocalVariable(name: "evalue", scope: !398, file: !17, line: 421, type: !24)
!398 = distinct !DILexicalBlock(scope: !395, file: !17, line: 396, column: 14)
!399 = !DILocation(line: 421, column: 13, scope: !398)
!400 = !DILocation(line: 425, column: 41, scope: !398)
!401 = !DILocation(line: 425, column: 63, scope: !398)
