; ModuleID = './libguestInfo_la-perfMonLinux.o.i'
source_filename = "./libguestInfo_la-perfMonLinux.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GuestInfoQuery = type { i8*, i8*, i8, i8*, i32, i32, i32 }
%struct.GuestInfoCollector = type { %struct.HashTable*, i32, %struct.GuestInfoStat**, i32, %struct.GuestInfoStat*, %struct.HashTable*, i8, double }
%struct.GuestInfoStat = type { i32, i32, i64, %struct.GuestInfoQuery* }
%struct.HashTable = type opaque
%struct.GuestInfoDiskStatsList = type { %struct.GuestInfoDiskStatsList*, i8*, [2 x i32] }
%struct.DynBuf = type { i8*, i64, i64 }
%struct.GuestMemInfoLegacy = type { i32, i32, i64, [9 x i64], i64, [2 x i64] }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.GuestStatHeader = type { i32 }
%struct.GuestDatumHeader = type { i16, [0 x i8] }

@.str = private unnamed_addr constant [14 x i8] c"/proc/meminfo\00", align 1
@gReleased = internal global i8 1, align 1

!303 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!304 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!305 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!306 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!307 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!308 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!309 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!310 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!311 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!312 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!313 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!314 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!315 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!316 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!317 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!318 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!319 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!320 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!321 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!322 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!323 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!324 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!325 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!326 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!327 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!328 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!329 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!330 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!331 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!332 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!333 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!334 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!335 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!336 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!337 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!338 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!339 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!340 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!341 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!342 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!343 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!344 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!345 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!346 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!347 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!348 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!349 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!350 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!351 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!352 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!353 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!354 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!355 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 105, size: 32, align: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365}
!358 = !DIEnumerator(name: "GUEST_DATUM_PRAGMA", value: 1)
!359 = !DIEnumerator(name: "GUEST_DATUM_NAMESPACE", value: 2)
!360 = !DIEnumerator(name: "GUEST_DATUM_ID", value: 4)
!361 = !DIEnumerator(name: "GUEST_DATUM_VALUE_TYPE_ENUM", value: 8)
!362 = !DIEnumerator(name: "GUEST_DATUM_VALUE_TYPE_STRING", value: 16)
!363 = !DIEnumerator(name: "GUEST_DATUM_VALUE_UNIT_ENUM", value: 32)
!364 = !DIEnumerator(name: "GUEST_DATUM_VALUE_UNIT_STRING", value: 64)
!365 = !DIEnumerator(name: "GUEST_DATUM_VALUE", value: 128)
!366 = !{!367, !368, !370, !373, !374, !379, !394, !395, !396, !399, !402}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !371, line: 122, baseType: !372)
!371 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!372 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !375, line: 172, baseType: !376)
!375 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !377, line: 197, baseType: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!378 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoDiskStatsList", file: !381, line: 172, baseType: !382)
!381 = !DIFile(filename: "perfMonLinux.c", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestInfoDiskStatsList", file: !381, line: 168, size: 192, align: 64, elements: !383)
!383 = !{!384, !386, !389}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !381, line: 169, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "diskName", scope: !382, file: !381, line: 170, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "weightedTime", scope: !382, file: !381, line: 171, baseType: !390, size: 64, align: 32, offset: 128)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 64, align: 32, elements: !392)
!391 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!392 = !{!393}
!393 = !DISubrange(count: 2)
!394 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!395 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !375, line: 177, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !371, line: 48, baseType: !398)
!398 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !375, line: 175, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !371, line: 49, baseType: !401)
!401 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !375, line: 173, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !371, line: 51, baseType: !391)
!404 = !{!405, !427, !428, !429, !459, !460, !465}
!405 = distinct !DIGlobalVariable(name: "guestInfoQuerySpecTable", scope: !0, file: !381, line: 78, type: !406, isLocal: false, isDefinition: true, variable: [22 x %struct.GuestInfoQuery]* @guestInfoQuerySpecTable)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 8448, align: 64, elements: !425)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoQuery", file: !381, line: 76, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 68, size: 384, align: 64, elements: !409)
!409 = !{!410, !413, !417, !418, !419, !421, !423}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sourceFile", scope: !408, file: !381, line: 69, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "publish", scope: !408, file: !381, line: 70, baseType: !414, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !375, line: 230, baseType: !388)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "isRegExp", scope: !408, file: !381, line: 71, baseType: !416, size: 8, align: 8, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "locatorString", scope: !408, file: !381, line: 72, baseType: !411, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reportID", scope: !408, file: !381, line: 73, baseType: !420, size: 32, align: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestStatToolsID", file: !4, line: 337, baseType: !3)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !408, file: !381, line: 74, baseType: !422, size: 32, align: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestValueUnits", file: !4, line: 214, baseType: !74)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dataType", scope: !408, file: !381, line: 75, baseType: !424, size: 32, align: 32, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestValueType", file: !4, line: 241, baseType: !106)
!425 = !{!426}
!426 = !DISubrange(count: 22)
!427 = distinct !DIGlobalVariable(name: "gReleased", scope: !0, file: !381, line: 56, type: !416, isLocal: true, isDefinition: true, variable: i8* @gReleased)
!428 = distinct !DIGlobalVariable(name: "gInternal", scope: !0, file: !381, line: 57, type: !416, isLocal: true, isDefinition: true, variable: i8* @gInternal)
!429 = distinct !DIGlobalVariable(name: "gPreviousCollector", scope: !0, file: !381, line: 163, type: !430, isLocal: true, isDefinition: true, variable: %struct.GuestInfoCollector** @gPreviousCollector)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoCollector", file: !381, line: 160, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 147, size: 512, align: 64, elements: !433)
!433 = !{!434, !439, !440, !454, !455, !456, !457, !458}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "exactMatches", scope: !432, file: !381, line: 148, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTable", file: !437, line: 40, baseType: !438)
!437 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashTable", file: !437, line: 40, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "numRegExps", scope: !432, file: !381, line: 150, baseType: !402, size: 32, align: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "regExps", scope: !432, file: !381, line: 151, baseType: !441, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestInfoStat", file: !381, line: 145, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 140, size: 192, align: 64, elements: !445)
!445 = !{!446, !448, !449, !452}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !444, file: !381, line: 141, baseType: !447, size: 32, align: 32)
!447 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !444, file: !381, line: 142, baseType: !402, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !444, file: !381, line: 143, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !375, line: 171, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !371, line: 55, baseType: !372)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !444, file: !381, line: 144, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "numStats", scope: !432, file: !381, line: 153, baseType: !402, size: 32, align: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !432, file: !381, line: 154, baseType: !442, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reportMap", scope: !432, file: !381, line: 156, baseType: !435, size: 64, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "timeData", scope: !432, file: !381, line: 158, baseType: !416, size: 8, align: 8, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "timeStamp", scope: !432, file: !381, line: 159, baseType: !394, size: 64, align: 64, offset: 448)
!459 = distinct !DIGlobalVariable(name: "gCurrentCollector", scope: !0, file: !381, line: 162, type: !430, isLocal: true, isDefinition: true, variable: %struct.GuestInfoCollector** @gCurrentCollector)
!460 = distinct !DIGlobalVariable(name: "curr", scope: !461, file: !381, line: 683, type: !447, isLocal: true, isDefinition: true, variable: i32* @GuestInfoProcDiskStatsData.curr)
!461 = distinct !DISubprogram(name: "GuestInfoProcDiskStatsData", scope: !381, file: !381, line: 681, type: !462, isLocal: true, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{!416, !430}
!464 = !{}
!465 = distinct !DIGlobalVariable(name: "gDiskStatsList", scope: !0, file: !381, line: 174, type: !379, isLocal: true, isDefinition: true, variable: %struct.GuestInfoDiskStatsList** @gDiskStatsList)
!466 = !{i32 2, !"Dwarf Version", i32 4}
!467 = !{i32 2, !"Debug Info Version", i32 3}
!468 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!469 = distinct !DISubprogram(name: "GuestInfoTakeSample", scope: !381, file: !381, line: 1463, type: !470, isLocal: false, isDefinition: true, scopeLine: 1464, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!470 = !DISubroutineType(types: !471)
!471 = !{!416, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !474, line: 40, baseType: !475)
!474 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !474, line: 36, size: 192, align: 64, elements: !476)
!476 = !{!477, !478, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !475, file: !474, line: 37, baseType: !387, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !474, line: 38, baseType: !479, size: 64, align: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !480, line: 216, baseType: !372)
!480 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!481 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !475, file: !474, line: 39, baseType: !479, size: 64, align: 64, offset: 128)
!482 = !DILocalVariable(name: "statBuf", arg: 1, scope: !469, file: !381, line: 1463, type: !472)
!483 = !DIExpression()
!484 = !DILocation(line: 1463, column: 29, scope: !469)
!485 = !DILocalVariable(name: "temp", scope: !469, file: !381, line: 1465, type: !430)
!486 = !DILocation(line: 1465, column: 24, scope: !469)
!487 = !DILocation(line: 1470, column: 24, scope: !488)
!488 = distinct !DILexicalBlock(scope: !469, file: !381, line: 1470, column: 8)
!489 = !DILocation(line: 1470, column: 9, scope: !488)
!490 = !DILocation(line: 1470, column: 8, scope: !469)
!491 = !DILocation(line: 1471, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !488, file: !381, line: 1470, column: 40)
!493 = !DILocation(line: 1475, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !469, file: !381, line: 1475, column: 8)
!495 = !DILocation(line: 1475, column: 27, scope: !494)
!496 = !DILocation(line: 1475, column: 8, scope: !469)
!497 = !DILocation(line: 1476, column: 27, scope: !498)
!498 = distinct !DILexicalBlock(scope: !494, file: !381, line: 1475, column: 35)
!499 = !DILocation(line: 1476, column: 25, scope: !498)
!500 = !DILocation(line: 1479, column: 28, scope: !498)
!501 = !DILocation(line: 1479, column: 26, scope: !498)
!502 = !DILocation(line: 1481, column: 4, scope: !498)
!503 = !DILocation(line: 1483, column: 9, scope: !504)
!504 = distinct !DILexicalBlock(scope: !469, file: !381, line: 1483, column: 8)
!505 = !DILocation(line: 1483, column: 27, scope: !504)
!506 = !DILocation(line: 1483, column: 35, scope: !504)
!507 = !DILocation(line: 1484, column: 9, scope: !504)
!508 = !DILocation(line: 1484, column: 28, scope: !504)
!509 = !DILocation(line: 1483, column: 8, scope: !510)
!510 = !DILexicalBlockFile(scope: !469, file: !381, discriminator: 1)
!511 = !DILocation(line: 1485, column: 33, scope: !512)
!512 = distinct !DILexicalBlock(scope: !504, file: !381, line: 1484, column: 37)
!513 = !DILocation(line: 1485, column: 7, scope: !512)
!514 = !DILocation(line: 1486, column: 25, scope: !512)
!515 = !DILocation(line: 1487, column: 33, scope: !512)
!516 = !DILocation(line: 1487, column: 7, scope: !512)
!517 = !DILocation(line: 1488, column: 26, scope: !512)
!518 = !DILocation(line: 1489, column: 7, scope: !512)
!519 = !DILocation(line: 1493, column: 21, scope: !469)
!520 = !DILocation(line: 1493, column: 4, scope: !469)
!521 = !DILocation(line: 1496, column: 25, scope: !469)
!522 = !DILocation(line: 1496, column: 44, scope: !469)
!523 = !DILocation(line: 1496, column: 64, scope: !469)
!524 = !DILocation(line: 1496, column: 4, scope: !469)
!525 = !DILocation(line: 1499, column: 11, scope: !469)
!526 = !DILocation(line: 1499, column: 9, scope: !469)
!527 = !DILocation(line: 1500, column: 24, scope: !469)
!528 = !DILocation(line: 1500, column: 22, scope: !469)
!529 = !DILocation(line: 1501, column: 25, scope: !469)
!530 = !DILocation(line: 1501, column: 23, scope: !469)
!531 = !DILocation(line: 1503, column: 4, scope: !469)
!532 = !DILocation(line: 1504, column: 1, scope: !469)
!533 = distinct !DISubprogram(name: "GuestInfoConstructCollector", scope: !381, file: !381, line: 1375, type: !534, isLocal: true, isDefinition: true, scopeLine: 1377, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!534 = !DISubroutineType(types: !535)
!535 = !{!430, !453, !402}
!536 = !DILocalVariable(name: "queries", arg: 1, scope: !533, file: !381, line: 1375, type: !453)
!537 = !DILocation(line: 1375, column: 45, scope: !533)
!538 = !DILocalVariable(name: "numQueries", arg: 2, scope: !533, file: !381, line: 1376, type: !402)
!539 = !DILocation(line: 1376, column: 36, scope: !533)
!540 = !DILocalVariable(name: "i", scope: !533, file: !381, line: 1378, type: !402)
!541 = !DILocation(line: 1378, column: 11, scope: !533)
!542 = !DILocalVariable(name: "regExp", scope: !533, file: !381, line: 1379, type: !402)
!543 = !DILocation(line: 1379, column: 11, scope: !533)
!544 = !DILocalVariable(name: "collector", scope: !533, file: !381, line: 1380, type: !430)
!545 = !DILocation(line: 1380, column: 24, scope: !533)
!546 = !DILocation(line: 1380, column: 36, scope: !533)
!547 = !DILocation(line: 1382, column: 8, scope: !548)
!548 = distinct !DILexicalBlock(scope: !533, file: !381, line: 1382, column: 8)
!549 = !DILocation(line: 1382, column: 18, scope: !548)
!550 = !DILocation(line: 1382, column: 8, scope: !533)
!551 = !DILocation(line: 1383, column: 7, scope: !552)
!552 = distinct !DILexicalBlock(scope: !548, file: !381, line: 1382, column: 26)
!553 = !DILocation(line: 1386, column: 27, scope: !533)
!554 = !DILocation(line: 1386, column: 4, scope: !533)
!555 = !DILocation(line: 1386, column: 15, scope: !533)
!556 = !DILocation(line: 1386, column: 25, scope: !533)
!557 = !DILocation(line: 1388, column: 30, scope: !533)
!558 = !DILocation(line: 1388, column: 4, scope: !533)
!559 = !DILocation(line: 1388, column: 15, scope: !533)
!560 = !DILocation(line: 1388, column: 28, scope: !533)
!561 = !DILocation(line: 1392, column: 4, scope: !533)
!562 = !DILocation(line: 1392, column: 15, scope: !533)
!563 = !DILocation(line: 1392, column: 26, scope: !533)
!564 = !DILocation(line: 1393, column: 11, scope: !565)
!565 = distinct !DILexicalBlock(scope: !533, file: !381, line: 1393, column: 4)
!566 = !DILocation(line: 1393, column: 9, scope: !565)
!567 = !DILocation(line: 1393, column: 16, scope: !568)
!568 = !DILexicalBlockFile(scope: !569, file: !381, discriminator: 1)
!569 = distinct !DILexicalBlock(scope: !565, file: !381, line: 1393, column: 4)
!570 = !DILocation(line: 1393, column: 20, scope: !568)
!571 = !DILocation(line: 1393, column: 18, scope: !568)
!572 = !DILocation(line: 1393, column: 4, scope: !568)
!573 = !DILocation(line: 1394, column: 19, scope: !574)
!574 = distinct !DILexicalBlock(scope: !575, file: !381, line: 1394, column: 11)
!575 = distinct !DILexicalBlock(scope: !569, file: !381, line: 1393, column: 37)
!576 = !DILocation(line: 1394, column: 11, scope: !574)
!577 = !DILocation(line: 1394, column: 22, scope: !574)
!578 = !DILocation(line: 1394, column: 11, scope: !575)
!579 = !DILocation(line: 1395, column: 10, scope: !580)
!580 = distinct !DILexicalBlock(scope: !574, file: !381, line: 1394, column: 32)
!581 = !DILocation(line: 1395, column: 21, scope: !580)
!582 = !DILocation(line: 1395, column: 31, scope: !580)
!583 = !DILocation(line: 1396, column: 7, scope: !580)
!584 = !DILocation(line: 1397, column: 4, scope: !575)
!585 = !DILocation(line: 1393, column: 33, scope: !586)
!586 = !DILexicalBlockFile(scope: !569, file: !381, discriminator: 2)
!587 = !DILocation(line: 1393, column: 4, scope: !586)
!588 = distinct !{!588, !589}
!589 = !DILocation(line: 1393, column: 4, scope: !533)
!590 = !DILocation(line: 1399, column: 26, scope: !533)
!591 = !DILocation(line: 1399, column: 4, scope: !533)
!592 = !DILocation(line: 1399, column: 15, scope: !533)
!593 = !DILocation(line: 1399, column: 24, scope: !533)
!594 = !DILocation(line: 1400, column: 40, scope: !533)
!595 = !DILocation(line: 1400, column: 39, scope: !533)
!596 = !DILocation(line: 1400, column: 23, scope: !533)
!597 = !DILocation(line: 1400, column: 4, scope: !533)
!598 = !DILocation(line: 1400, column: 15, scope: !533)
!599 = !DILocation(line: 1400, column: 21, scope: !533)
!600 = !DILocation(line: 1401, column: 42, scope: !533)
!601 = !DILocation(line: 1401, column: 53, scope: !533)
!602 = !DILocation(line: 1401, column: 41, scope: !533)
!603 = !DILocation(line: 1401, column: 25, scope: !533)
!604 = !DILocation(line: 1401, column: 4, scope: !533)
!605 = !DILocation(line: 1401, column: 15, scope: !533)
!606 = !DILocation(line: 1401, column: 23, scope: !533)
!607 = !DILocation(line: 1404, column: 9, scope: !608)
!608 = distinct !DILexicalBlock(scope: !533, file: !381, line: 1404, column: 8)
!609 = !DILocation(line: 1404, column: 20, scope: !608)
!610 = !DILocation(line: 1404, column: 33, scope: !608)
!611 = !DILocation(line: 1404, column: 41, scope: !608)
!612 = !DILocation(line: 1405, column: 9, scope: !608)
!613 = !DILocation(line: 1405, column: 20, scope: !608)
!614 = !DILocation(line: 1405, column: 30, scope: !608)
!615 = !DILocation(line: 1405, column: 38, scope: !608)
!616 = !DILocation(line: 1406, column: 10, scope: !608)
!617 = !DILocation(line: 1406, column: 21, scope: !608)
!618 = !DILocation(line: 1406, column: 32, scope: !608)
!619 = !DILocation(line: 1406, column: 38, scope: !608)
!620 = !DILocation(line: 1406, column: 42, scope: !621)
!621 = !DILexicalBlockFile(scope: !608, file: !381, discriminator: 1)
!622 = !DILocation(line: 1406, column: 53, scope: !621)
!623 = !DILocation(line: 1406, column: 61, scope: !621)
!624 = !DILocation(line: 1406, column: 70, scope: !621)
!625 = !DILocation(line: 1407, column: 10, scope: !608)
!626 = !DILocation(line: 1407, column: 21, scope: !608)
!627 = !DILocation(line: 1407, column: 30, scope: !608)
!628 = !DILocation(line: 1407, column: 36, scope: !608)
!629 = !DILocation(line: 1407, column: 40, scope: !621)
!630 = !DILocation(line: 1407, column: 51, scope: !621)
!631 = !DILocation(line: 1407, column: 57, scope: !621)
!632 = !DILocation(line: 1404, column: 8, scope: !633)
!633 = !DILexicalBlockFile(scope: !533, file: !381, discriminator: 1)
!634 = !DILocation(line: 1408, column: 33, scope: !635)
!635 = distinct !DILexicalBlock(scope: !608, file: !381, line: 1407, column: 67)
!636 = !DILocation(line: 1408, column: 7, scope: !635)
!637 = !DILocation(line: 1409, column: 7, scope: !635)
!638 = !DILocation(line: 1412, column: 11, scope: !533)
!639 = !DILocation(line: 1414, column: 11, scope: !640)
!640 = distinct !DILexicalBlock(scope: !533, file: !381, line: 1414, column: 4)
!641 = !DILocation(line: 1414, column: 9, scope: !640)
!642 = !DILocation(line: 1414, column: 16, scope: !643)
!643 = !DILexicalBlockFile(scope: !644, file: !381, discriminator: 1)
!644 = distinct !DILexicalBlock(scope: !640, file: !381, line: 1414, column: 4)
!645 = !DILocation(line: 1414, column: 20, scope: !643)
!646 = !DILocation(line: 1414, column: 18, scope: !643)
!647 = !DILocation(line: 1414, column: 4, scope: !643)
!648 = !DILocalVariable(name: "query", scope: !649, file: !381, line: 1415, type: !453)
!649 = distinct !DILexicalBlock(scope: !644, file: !381, line: 1414, column: 37)
!650 = !DILocation(line: 1415, column: 23, scope: !649)
!651 = !DILocation(line: 1415, column: 40, scope: !649)
!652 = !DILocation(line: 1415, column: 32, scope: !649)
!653 = !DILocalVariable(name: "stat", scope: !649, file: !381, line: 1416, type: !442)
!654 = !DILocation(line: 1416, column: 22, scope: !649)
!655 = !DILocation(line: 1416, column: 47, scope: !649)
!656 = !DILocation(line: 1416, column: 30, scope: !649)
!657 = !DILocation(line: 1416, column: 41, scope: !649)
!658 = !DILocation(line: 1420, column: 21, scope: !649)
!659 = !DILocation(line: 1420, column: 7, scope: !649)
!660 = !DILocation(line: 1420, column: 13, scope: !649)
!661 = !DILocation(line: 1420, column: 19, scope: !649)
!662 = !DILocation(line: 1422, column: 11, scope: !663)
!663 = distinct !DILexicalBlock(scope: !649, file: !381, line: 1422, column: 11)
!664 = !DILocation(line: 1422, column: 18, scope: !663)
!665 = !DILocation(line: 1422, column: 11, scope: !649)
!666 = !DILocation(line: 1426, column: 41, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !381, line: 1422, column: 28)
!668 = !DILocation(line: 1426, column: 35, scope: !667)
!669 = !DILocation(line: 1426, column: 10, scope: !667)
!670 = !DILocation(line: 1426, column: 21, scope: !667)
!671 = !DILocation(line: 1426, column: 39, scope: !667)
!672 = !DILocation(line: 1427, column: 7, scope: !667)
!673 = !DILocation(line: 1428, column: 14, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !381, line: 1428, column: 14)
!675 = distinct !DILexicalBlock(scope: !663, file: !381, line: 1427, column: 14)
!676 = !DILocation(line: 1428, column: 21, scope: !674)
!677 = !DILocation(line: 1428, column: 32, scope: !674)
!678 = !DILocation(line: 1428, column: 39, scope: !674)
!679 = !DILocation(line: 1428, column: 42, scope: !680)
!680 = !DILexicalBlockFile(scope: !674, file: !381, discriminator: 1)
!681 = !DILocation(line: 1428, column: 49, scope: !680)
!682 = !DILocation(line: 1428, column: 63, scope: !680)
!683 = !DILocation(line: 1428, column: 14, scope: !680)
!684 = !DILocalVariable(name: "key", scope: !685, file: !381, line: 1429, type: !387)
!685 = distinct !DILexicalBlock(scope: !674, file: !381, line: 1428, column: 72)
!686 = !DILocation(line: 1429, column: 19, scope: !685)
!687 = !DILocation(line: 1429, column: 56, scope: !685)
!688 = !DILocation(line: 1429, column: 63, scope: !685)
!689 = !DILocation(line: 1430, column: 42, scope: !685)
!690 = !DILocation(line: 1430, column: 49, scope: !685)
!691 = !DILocation(line: 1429, column: 25, scope: !685)
!692 = !DILocation(line: 1431, column: 30, scope: !685)
!693 = !DILocation(line: 1431, column: 41, scope: !685)
!694 = !DILocation(line: 1431, column: 55, scope: !685)
!695 = !DILocation(line: 1431, column: 60, scope: !685)
!696 = !DILocation(line: 1431, column: 13, scope: !685)
!697 = !DILocation(line: 1432, column: 18, scope: !685)
!698 = !DILocation(line: 1432, column: 13, scope: !685)
!699 = !DILocation(line: 1433, column: 10, scope: !685)
!700 = !DILocation(line: 1437, column: 24, scope: !649)
!701 = !DILocation(line: 1437, column: 35, scope: !649)
!702 = !DILocation(line: 1437, column: 73, scope: !649)
!703 = !DILocation(line: 1437, column: 80, scope: !649)
!704 = !DILocation(line: 1437, column: 61, scope: !649)
!705 = !DILocation(line: 1437, column: 47, scope: !649)
!706 = !DILocation(line: 1438, column: 24, scope: !649)
!707 = !DILocation(line: 1437, column: 7, scope: !649)
!708 = !DILocation(line: 1439, column: 4, scope: !649)
!709 = !DILocation(line: 1414, column: 33, scope: !710)
!710 = !DILexicalBlockFile(scope: !644, file: !381, discriminator: 2)
!711 = !DILocation(line: 1414, column: 4, scope: !710)
!712 = distinct !{!712, !713}
!713 = !DILocation(line: 1414, column: 4, scope: !533)
!714 = !DILocation(line: 1441, column: 11, scope: !533)
!715 = !DILocation(line: 1441, column: 4, scope: !533)
!716 = !DILocation(line: 1442, column: 1, scope: !533)
!717 = distinct !DISubprogram(name: "GuestInfoDestroyCollector", scope: !381, file: !381, line: 1345, type: !718, isLocal: true, isDefinition: true, scopeLine: 1346, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !430}
!720 = !DILocalVariable(name: "collector", arg: 1, scope: !717, file: !381, line: 1345, type: !430)
!721 = !DILocation(line: 1345, column: 47, scope: !717)
!722 = !DILocation(line: 1347, column: 8, scope: !723)
!723 = distinct !DILexicalBlock(scope: !717, file: !381, line: 1347, column: 8)
!724 = !DILocation(line: 1347, column: 18, scope: !723)
!725 = !DILocation(line: 1347, column: 8, scope: !717)
!726 = !DILocation(line: 1348, column: 22, scope: !727)
!727 = distinct !DILexicalBlock(scope: !723, file: !381, line: 1347, column: 26)
!728 = !DILocation(line: 1348, column: 33, scope: !727)
!729 = !DILocation(line: 1348, column: 7, scope: !727)
!730 = !DILocation(line: 1349, column: 22, scope: !727)
!731 = !DILocation(line: 1349, column: 33, scope: !727)
!732 = !DILocation(line: 1349, column: 7, scope: !727)
!733 = !DILocation(line: 1350, column: 12, scope: !727)
!734 = !DILocation(line: 1350, column: 23, scope: !727)
!735 = !DILocation(line: 1350, column: 7, scope: !727)
!736 = !DILocation(line: 1351, column: 12, scope: !727)
!737 = !DILocation(line: 1351, column: 23, scope: !727)
!738 = !DILocation(line: 1351, column: 7, scope: !727)
!739 = !DILocation(line: 1352, column: 12, scope: !727)
!740 = !DILocation(line: 1352, column: 7, scope: !727)
!741 = !DILocation(line: 1353, column: 4, scope: !727)
!742 = !DILocation(line: 1354, column: 1, scope: !717)
!743 = distinct !DISubprogram(name: "GuestInfoCollect", scope: !381, file: !381, line: 812, type: !718, isLocal: true, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!744 = !DILocalVariable(name: "collector", arg: 1, scope: !743, file: !381, line: 812, type: !430)
!745 = !DILocation(line: 812, column: 38, scope: !743)
!746 = !DILocalVariable(name: "i", scope: !743, file: !381, line: 814, type: !402)
!747 = !DILocation(line: 814, column: 11, scope: !743)
!748 = !DILocalVariable(name: "stat", scope: !743, file: !381, line: 815, type: !442)
!749 = !DILocation(line: 815, column: 19, scope: !743)
!750 = !DILocalVariable(name: "pageSize", scope: !743, file: !381, line: 816, type: !450)
!751 = !DILocation(line: 816, column: 11, scope: !743)
!752 = !DILocation(line: 816, column: 22, scope: !743)
!753 = !DILocation(line: 819, column: 11, scope: !754)
!754 = distinct !DILexicalBlock(scope: !743, file: !381, line: 819, column: 4)
!755 = !DILocation(line: 819, column: 9, scope: !754)
!756 = !DILocation(line: 819, column: 16, scope: !757)
!757 = !DILexicalBlockFile(scope: !758, file: !381, discriminator: 1)
!758 = distinct !DILexicalBlock(scope: !754, file: !381, line: 819, column: 4)
!759 = !DILocation(line: 819, column: 20, scope: !757)
!760 = !DILocation(line: 819, column: 31, scope: !757)
!761 = !DILocation(line: 819, column: 18, scope: !757)
!762 = !DILocation(line: 819, column: 4, scope: !757)
!763 = !DILocalVariable(name: "stat", scope: !764, file: !381, line: 820, type: !442)
!764 = distinct !DILexicalBlock(scope: !758, file: !381, line: 819, column: 46)
!765 = !DILocation(line: 820, column: 22, scope: !764)
!766 = !DILocation(line: 820, column: 47, scope: !764)
!767 = !DILocation(line: 820, column: 30, scope: !764)
!768 = !DILocation(line: 820, column: 41, scope: !764)
!769 = !DILocation(line: 822, column: 7, scope: !764)
!770 = !DILocation(line: 822, column: 13, scope: !764)
!771 = !DILocation(line: 822, column: 17, scope: !764)
!772 = !DILocation(line: 823, column: 7, scope: !764)
!773 = !DILocation(line: 823, column: 13, scope: !764)
!774 = !DILocation(line: 823, column: 19, scope: !764)
!775 = !DILocation(line: 824, column: 7, scope: !764)
!776 = !DILocation(line: 824, column: 13, scope: !764)
!777 = !DILocation(line: 824, column: 19, scope: !764)
!778 = !DILocation(line: 825, column: 4, scope: !764)
!779 = !DILocation(line: 819, column: 42, scope: !780)
!780 = !DILexicalBlockFile(scope: !758, file: !381, discriminator: 2)
!781 = !DILocation(line: 819, column: 4, scope: !780)
!782 = distinct !{!782, !783}
!783 = !DILocation(line: 819, column: 4, scope: !743)
!784 = !DILocation(line: 828, column: 44, scope: !743)
!785 = !DILocation(line: 828, column: 4, scope: !743)
!786 = !DILocation(line: 829, column: 44, scope: !743)
!787 = !DILocation(line: 829, column: 4, scope: !743)
!788 = !DILocation(line: 830, column: 42, scope: !743)
!789 = !DILocation(line: 830, column: 4, scope: !743)
!790 = !DILocation(line: 831, column: 46, scope: !743)
!791 = !DILocation(line: 831, column: 4, scope: !743)
!792 = !DILocation(line: 837, column: 46, scope: !743)
!793 = !DILocation(line: 837, column: 57, scope: !743)
!794 = !DILocation(line: 837, column: 26, scope: !743)
!795 = !DILocation(line: 837, column: 4, scope: !743)
!796 = !DILocation(line: 837, column: 15, scope: !743)
!797 = !DILocation(line: 837, column: 24, scope: !743)
!798 = !DILocation(line: 843, column: 27, scope: !743)
!799 = !DILocation(line: 844, column: 27, scope: !743)
!800 = !DILocation(line: 842, column: 4, scope: !743)
!801 = !DILocation(line: 850, column: 9, scope: !743)
!802 = !DILocation(line: 851, column: 21, scope: !743)
!803 = !DILocation(line: 851, column: 32, scope: !743)
!804 = !DILocation(line: 853, column: 21, scope: !743)
!805 = !DILocation(line: 851, column: 4, scope: !743)
!806 = !DILocation(line: 857, column: 8, scope: !807)
!807 = distinct !DILexicalBlock(scope: !743, file: !381, line: 857, column: 8)
!808 = !DILocation(line: 857, column: 14, scope: !807)
!809 = !DILocation(line: 857, column: 18, scope: !807)
!810 = !DILocation(line: 857, column: 8, scope: !743)
!811 = !DILocation(line: 858, column: 23, scope: !812)
!812 = distinct !DILexicalBlock(scope: !807, file: !381, line: 857, column: 24)
!813 = !DILocation(line: 858, column: 32, scope: !812)
!814 = !DILocation(line: 858, column: 7, scope: !812)
!815 = !DILocation(line: 858, column: 13, scope: !812)
!816 = !DILocation(line: 858, column: 19, scope: !812)
!817 = !DILocation(line: 859, column: 4, scope: !812)
!818 = !DILocalVariable(name: "memTotal", scope: !819, file: !381, line: 860, type: !442)
!819 = distinct !DILexicalBlock(scope: !807, file: !381, line: 859, column: 11)
!820 = !DILocation(line: 860, column: 22, scope: !819)
!821 = !DILocation(line: 862, column: 24, scope: !819)
!822 = !DILocation(line: 862, column: 35, scope: !819)
!823 = !DILocation(line: 864, column: 24, scope: !819)
!824 = !DILocation(line: 862, column: 7, scope: !819)
!825 = !DILocation(line: 866, column: 12, scope: !826)
!826 = distinct !DILexicalBlock(scope: !819, file: !381, line: 866, column: 11)
!827 = !DILocation(line: 866, column: 21, scope: !826)
!828 = !DILocation(line: 866, column: 29, scope: !826)
!829 = !DILocation(line: 866, column: 33, scope: !830)
!830 = !DILexicalBlockFile(scope: !826, file: !381, discriminator: 1)
!831 = !DILocation(line: 866, column: 43, scope: !830)
!832 = !DILocation(line: 866, column: 47, scope: !830)
!833 = !DILocation(line: 866, column: 11, scope: !830)
!834 = !DILocation(line: 867, column: 10, scope: !835)
!835 = distinct !DILexicalBlock(scope: !826, file: !381, line: 866, column: 54)
!836 = !DILocation(line: 867, column: 16, scope: !835)
!837 = !DILocation(line: 867, column: 20, scope: !835)
!838 = !DILocation(line: 868, column: 10, scope: !835)
!839 = !DILocation(line: 868, column: 16, scope: !835)
!840 = !DILocation(line: 868, column: 22, scope: !835)
!841 = !DILocation(line: 869, column: 24, scope: !835)
!842 = !DILocation(line: 869, column: 34, scope: !835)
!843 = !DILocation(line: 869, column: 10, scope: !835)
!844 = !DILocation(line: 869, column: 16, scope: !835)
!845 = !DILocation(line: 869, column: 22, scope: !835)
!846 = !DILocation(line: 870, column: 7, scope: !835)
!847 = !DILocation(line: 873, column: 29, scope: !743)
!848 = !DILocation(line: 873, column: 4, scope: !743)
!849 = !DILocation(line: 874, column: 38, scope: !743)
!850 = !DILocation(line: 874, column: 4, scope: !743)
!851 = !DILocation(line: 875, column: 31, scope: !743)
!852 = !DILocation(line: 875, column: 4, scope: !743)
!853 = !DILocation(line: 876, column: 1, scope: !743)
!854 = distinct !DISubprogram(name: "GuestInfoEncodeStats", scope: !381, file: !381, line: 1286, type: !855, isLocal: true, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !430, !430, !472}
!857 = !DILocalVariable(name: "current", arg: 1, scope: !854, file: !381, line: 1286, type: !430)
!858 = !DILocation(line: 1286, column: 42, scope: !854)
!859 = !DILocalVariable(name: "previous", arg: 2, scope: !854, file: !381, line: 1287, type: !430)
!860 = !DILocation(line: 1287, column: 42, scope: !854)
!861 = !DILocalVariable(name: "statBuf", arg: 3, scope: !854, file: !381, line: 1288, type: !472)
!862 = !DILocation(line: 1288, column: 30, scope: !854)
!863 = !DILocalVariable(name: "i", scope: !854, file: !381, line: 1290, type: !402)
!864 = !DILocation(line: 1290, column: 11, scope: !854)
!865 = !DILocalVariable(name: "legacy", scope: !854, file: !381, line: 1291, type: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestMemInfoLegacy", file: !4, line: 96, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestMemInfoLegacy", file: !4, line: 87, size: 896, align: 8, elements: !868)
!868 = !{!869, !870, !871, !872, !876, !877}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !867, file: !4, line: 88, baseType: !402, size: 32, align: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !867, file: !4, line: 89, baseType: !402, size: 32, align: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "memTotal", scope: !867, file: !4, line: 90, baseType: !450, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated1", scope: !867, file: !4, line: 91, baseType: !873, size: 576, align: 64, offset: 128)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 576, align: 64, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 9)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "hugePagesTotal", scope: !867, file: !4, line: 92, baseType: !450, size: 64, align: 64, offset: 704)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated2", scope: !867, file: !4, line: 93, baseType: !878, size: 128, align: 64, offset: 768)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 128, align: 64, elements: !392)
!879 = !DILocation(line: 1291, column: 23, scope: !854)
!880 = !DILocalVariable(name: "emitNameSpace", scope: !854, file: !381, line: 1292, type: !416)
!881 = !DILocation(line: 1292, column: 9, scope: !854)
!882 = !DILocation(line: 1295, column: 20, scope: !854)
!883 = !DILocation(line: 1295, column: 4, scope: !854)
!884 = !DILocation(line: 1297, column: 18, scope: !854)
!885 = !DILocation(line: 1297, column: 27, scope: !854)
!886 = !DILocation(line: 1297, column: 4, scope: !854)
!887 = !DILocation(line: 1300, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !854, file: !381, line: 1300, column: 4)
!889 = !DILocation(line: 1300, column: 9, scope: !888)
!890 = !DILocation(line: 1300, column: 16, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !381, discriminator: 1)
!892 = distinct !DILexicalBlock(scope: !888, file: !381, line: 1300, column: 4)
!893 = !DILocation(line: 1300, column: 20, scope: !891)
!894 = !DILocation(line: 1300, column: 29, scope: !891)
!895 = !DILocation(line: 1300, column: 18, scope: !891)
!896 = !DILocation(line: 1300, column: 4, scope: !891)
!897 = !DILocalVariable(name: "stat", scope: !898, file: !381, line: 1301, type: !442)
!898 = distinct !DILexicalBlock(scope: !892, file: !381, line: 1300, column: 44)
!899 = !DILocation(line: 1301, column: 22, scope: !898)
!900 = !DILocation(line: 1301, column: 45, scope: !898)
!901 = !DILocation(line: 1301, column: 30, scope: !898)
!902 = !DILocation(line: 1301, column: 39, scope: !898)
!903 = !DILocation(line: 1303, column: 14, scope: !904)
!904 = distinct !DILexicalBlock(scope: !898, file: !381, line: 1303, column: 11)
!905 = !DILocation(line: 1303, column: 20, scope: !904)
!906 = !DILocation(line: 1303, column: 27, scope: !904)
!907 = !DILocation(line: 1303, column: 12, scope: !904)
!908 = !DILocation(line: 1303, column: 11, scope: !898)
!909 = !DILocation(line: 1304, column: 10, scope: !910)
!910 = distinct !DILexicalBlock(scope: !904, file: !381, line: 1303, column: 37)
!911 = !DILocation(line: 1307, column: 11, scope: !912)
!912 = distinct !DILexicalBlock(scope: !898, file: !381, line: 1307, column: 11)
!913 = !DILocation(line: 1307, column: 17, scope: !912)
!914 = !DILocation(line: 1307, column: 24, scope: !912)
!915 = !DILocation(line: 1307, column: 33, scope: !912)
!916 = !DILocation(line: 1307, column: 11, scope: !898)
!917 = !DILocation(line: 1308, column: 30, scope: !918)
!918 = distinct !DILexicalBlock(scope: !912, file: !381, line: 1307, column: 53)
!919 = !DILocation(line: 1308, column: 45, scope: !918)
!920 = !DILocation(line: 1308, column: 51, scope: !918)
!921 = !DILocation(line: 1308, column: 58, scope: !918)
!922 = !DILocation(line: 1309, column: 30, scope: !918)
!923 = !DILocation(line: 1309, column: 39, scope: !918)
!924 = !DILocation(line: 1309, column: 49, scope: !918)
!925 = !DILocation(line: 1308, column: 10, scope: !918)
!926 = !DILocation(line: 1310, column: 7, scope: !918)
!927 = !DILocation(line: 1313, column: 30, scope: !928)
!928 = distinct !DILexicalBlock(scope: !912, file: !381, line: 1310, column: 14)
!929 = !DILocation(line: 1313, column: 36, scope: !928)
!930 = !DILocation(line: 1314, column: 30, scope: !928)
!931 = !DILocation(line: 1315, column: 30, scope: !928)
!932 = !DILocation(line: 1315, column: 36, scope: !928)
!933 = !DILocation(line: 1315, column: 43, scope: !928)
!934 = !DILocation(line: 1316, column: 30, scope: !928)
!935 = !DILocation(line: 1316, column: 36, scope: !928)
!936 = !DILocation(line: 1316, column: 43, scope: !928)
!937 = !DILocation(line: 1317, column: 30, scope: !928)
!938 = !DILocation(line: 1317, column: 36, scope: !928)
!939 = !DILocation(line: 1317, column: 43, scope: !928)
!940 = !DILocation(line: 1318, column: 31, scope: !928)
!941 = !DILocation(line: 1318, column: 37, scope: !928)
!942 = !DILocation(line: 1318, column: 30, scope: !928)
!943 = !DILocation(line: 1319, column: 60, scope: !928)
!944 = !DILocation(line: 1319, column: 66, scope: !928)
!945 = !DILocation(line: 1319, column: 30, scope: !928)
!946 = !DILocation(line: 1320, column: 30, scope: !928)
!947 = !DILocation(line: 1313, column: 10, scope: !928)
!948 = !DILocation(line: 1323, column: 21, scope: !898)
!949 = !DILocation(line: 1324, column: 4, scope: !898)
!950 = !DILocation(line: 1300, column: 40, scope: !951)
!951 = !DILexicalBlockFile(scope: !892, file: !381, discriminator: 2)
!952 = !DILocation(line: 1300, column: 4, scope: !951)
!953 = distinct !{!953, !954}
!954 = !DILocation(line: 1300, column: 4, scope: !854)
!955 = !DILocation(line: 1325, column: 1, scope: !854)
!956 = distinct !DISubprogram(name: "GuestInfo_StatProviderPoll", scope: !381, file: !381, line: 1524, type: !957, isLocal: false, isDefinition: true, scopeLine: 1525, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!957 = !DISubroutineType(types: !958)
!958 = !{!959, !962}
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !960, line: 50, baseType: !961)
!960 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !960, line: 49, baseType: !447)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !960, line: 77, baseType: !367)
!963 = !DILocalVariable(name: "data", arg: 1, scope: !956, file: !381, line: 1524, type: !962)
!964 = !DILocation(line: 1524, column: 37, scope: !956)
!965 = !DILocalVariable(name: "ctx", scope: !956, file: !381, line: 1526, type: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !123, line: 274, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !123, line: 241, size: 576, align: 64, elements: !969)
!969 = !{!970, !972, !976, !977, !978, !983, !988, !993, !994, !995, !997}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !123, line: 243, baseType: !971, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !123, line: 234, baseType: !122)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !123, line: 245, baseType: !973, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !960, line: 46, baseType: !388)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !968, file: !123, line: 247, baseType: !959, size: 32, align: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !968, file: !123, line: 249, baseType: !447, size: 32, align: 32, offset: 160)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !968, file: !123, line: 251, baseType: !979, size: 64, align: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !981, line: 56, baseType: !982)
!981 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !981, line: 56, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !968, file: !123, line: 253, baseType: !984, size: 64, align: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !986, line: 48, baseType: !987)
!986 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !986, line: 48, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !968, file: !123, line: 255, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !991, line: 48, baseType: !992)
!991 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !991, line: 48, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !968, file: !123, line: 261, baseType: !447, size: 32, align: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !968, file: !123, line: 263, baseType: !447, size: 32, align: 32, offset: 416)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !968, file: !123, line: 265, baseType: !996, size: 64, align: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !968, file: !123, line: 273, baseType: !962, size: 64, align: 64, offset: 512)
!998 = !DILocation(line: 1526, column: 17, scope: !956)
!999 = !DILocation(line: 1526, column: 23, scope: !956)
!1000 = !DILocalVariable(name: "stats", scope: !956, file: !381, line: 1527, type: !473)
!1001 = !DILocation(line: 1527, column: 11, scope: !956)
!1002 = !DILocation(line: 1529, column: 4, scope: !956)
!1003 = !DILocation(line: 1539, column: 4, scope: !956)
!1004 = !DILocation(line: 1541, column: 9, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !956, file: !381, line: 1541, column: 8)
!1006 = !DILocation(line: 1541, column: 8, scope: !956)
!1007 = !DILocation(line: 1542, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !381, line: 1541, column: 38)
!1009 = !DILocation(line: 1543, column: 4, scope: !1008)
!1010 = !DILocation(line: 1543, column: 44, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !1012, file: !381, discriminator: 1)
!1012 = distinct !DILexicalBlock(scope: !1005, file: !381, line: 1543, column: 15)
!1013 = !DILocation(line: 1543, column: 16, scope: !1011)
!1014 = !DILocation(line: 1543, column: 15, scope: !1011)
!1015 = !DILocation(line: 1544, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !381, line: 1543, column: 58)
!1017 = !DILocation(line: 1545, column: 4, scope: !1016)
!1018 = !DILocation(line: 1547, column: 4, scope: !956)
!1019 = !DILocation(line: 1548, column: 4, scope: !956)
!1020 = distinct !DISubprogram(name: "GuestInfo_StatProviderShutdown", scope: !381, file: !381, line: 1570, type: !1021, isLocal: false, isDefinition: true, scopeLine: 1571, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null}
!1023 = !DILocation(line: 1572, column: 33, scope: !1020)
!1024 = !DILocation(line: 1572, column: 4, scope: !1020)
!1025 = !DILocation(line: 1573, column: 19, scope: !1020)
!1026 = !DILocation(line: 1575, column: 30, scope: !1020)
!1027 = !DILocation(line: 1575, column: 4, scope: !1020)
!1028 = !DILocation(line: 1576, column: 22, scope: !1020)
!1029 = !DILocation(line: 1577, column: 30, scope: !1020)
!1030 = !DILocation(line: 1577, column: 4, scope: !1020)
!1031 = !DILocation(line: 1578, column: 23, scope: !1020)
!1032 = !DILocation(line: 1579, column: 1, scope: !1020)
!1033 = distinct !DISubprogram(name: "GuestInfoDeleteDiskStatsList", scope: !381, file: !381, line: 194, type: !1034, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{null, !379}
!1036 = !DILocalVariable(name: "head", arg: 1, scope: !1033, file: !381, line: 194, type: !379)
!1037 = !DILocation(line: 194, column: 54, scope: !1033)
!1038 = !DILocalVariable(name: "curr", scope: !1033, file: !381, line: 196, type: !379)
!1039 = !DILocation(line: 196, column: 28, scope: !1033)
!1040 = !DILocation(line: 196, column: 35, scope: !1033)
!1041 = !DILocation(line: 198, column: 4, scope: !1033)
!1042 = !DILocation(line: 198, column: 11, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1033, file: !381, discriminator: 1)
!1044 = !DILocation(line: 198, column: 16, scope: !1043)
!1045 = !DILocation(line: 198, column: 4, scope: !1043)
!1046 = !DILocalVariable(name: "next", scope: !1047, file: !381, line: 199, type: !379)
!1047 = distinct !DILexicalBlock(scope: !1033, file: !381, line: 198, column: 24)
!1048 = !DILocation(line: 199, column: 31, scope: !1047)
!1049 = !DILocation(line: 199, column: 38, scope: !1047)
!1050 = !DILocation(line: 199, column: 44, scope: !1047)
!1051 = !DILocation(line: 200, column: 12, scope: !1047)
!1052 = !DILocation(line: 200, column: 18, scope: !1047)
!1053 = !DILocation(line: 200, column: 7, scope: !1047)
!1054 = !DILocation(line: 201, column: 12, scope: !1047)
!1055 = !DILocation(line: 201, column: 7, scope: !1047)
!1056 = !DILocation(line: 202, column: 14, scope: !1047)
!1057 = !DILocation(line: 202, column: 12, scope: !1047)
!1058 = !DILocation(line: 198, column: 4, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1033, file: !381, discriminator: 2)
!1060 = distinct !{!1060, !1041}
!1061 = !DILocation(line: 204, column: 1, scope: !1033)
!1062 = distinct !DISubprogram(name: "GuestInfoProcData", scope: !381, file: !381, line: 430, type: !1063, isLocal: true, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!416, !411, !388, !430}
!1065 = !DILocalVariable(name: "pathName", arg: 1, scope: !1062, file: !381, line: 430, type: !411)
!1066 = !DILocation(line: 430, column: 31, scope: !1062)
!1067 = !DILocalVariable(name: "fieldSeparator", arg: 2, scope: !1062, file: !381, line: 431, type: !388)
!1068 = !DILocation(line: 431, column: 24, scope: !1062)
!1069 = !DILocalVariable(name: "collector", arg: 3, scope: !1062, file: !381, line: 432, type: !430)
!1070 = !DILocation(line: 432, column: 39, scope: !1062)
!1071 = !DILocalVariable(name: "line", scope: !1062, file: !381, line: 434, type: !1072)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 32768, align: 8, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 4096)
!1075 = !DILocation(line: 434, column: 9, scope: !1062)
!1076 = !DILocalVariable(name: "fp", scope: !1062, file: !381, line: 435, type: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1079, line: 48, baseType: !1080)
!1079 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1081, line: 241, size: 1728, align: 64, elements: !1082)
!1081 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1103, !1104, !1105, !1106, !1109, !1110, !1112, !1116, !1119, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1080, file: !1081, line: 242, baseType: !447, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1080, file: !1081, line: 247, baseType: !387, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1080, file: !1081, line: 248, baseType: !387, size: 64, align: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1080, file: !1081, line: 249, baseType: !387, size: 64, align: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1080, file: !1081, line: 250, baseType: !387, size: 64, align: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1080, file: !1081, line: 251, baseType: !387, size: 64, align: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1080, file: !1081, line: 252, baseType: !387, size: 64, align: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1080, file: !1081, line: 253, baseType: !387, size: 64, align: 64, offset: 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1080, file: !1081, line: 254, baseType: !387, size: 64, align: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1080, file: !1081, line: 256, baseType: !387, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1080, file: !1081, line: 257, baseType: !387, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1080, file: !1081, line: 258, baseType: !387, size: 64, align: 64, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1080, file: !1081, line: 260, baseType: !1096, size: 64, align: 64, offset: 768)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1081, line: 156, size: 192, align: 64, elements: !1098)
!1098 = !{!1099, !1100, !1102}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1097, file: !1081, line: 157, baseType: !1096, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1097, file: !1081, line: 158, baseType: !1101, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1097, file: !1081, line: 162, baseType: !447, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1080, file: !1081, line: 262, baseType: !1101, size: 64, align: 64, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1080, file: !1081, line: 264, baseType: !447, size: 32, align: 32, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1080, file: !1081, line: 268, baseType: !447, size: 32, align: 32, offset: 928)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1080, file: !1081, line: 270, baseType: !1107, size: 64, align: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1108, line: 131, baseType: !378)
!1108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1429")
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1080, file: !1081, line: 274, baseType: !401, size: 16, align: 16, offset: 1024)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1080, file: !1081, line: 275, baseType: !1111, size: 8, align: 8, offset: 1040)
!1111 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1080, file: !1081, line: 276, baseType: !1113, size: 8, align: 8, offset: 1048)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 8, align: 8, elements: !1114)
!1114 = !{!1115}
!1115 = !DISubrange(count: 1)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1080, file: !1081, line: 280, baseType: !1117, size: 64, align: 64, offset: 1088)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1081, line: 150, baseType: null)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1080, file: !1081, line: 289, baseType: !1120, size: 64, align: 64, offset: 1152)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1108, line: 132, baseType: !378)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1080, file: !1081, line: 297, baseType: !367, size: 64, align: 64, offset: 1216)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1080, file: !1081, line: 298, baseType: !367, size: 64, align: 64, offset: 1280)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1080, file: !1081, line: 299, baseType: !367, size: 64, align: 64, offset: 1344)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1080, file: !1081, line: 300, baseType: !367, size: 64, align: 64, offset: 1408)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1080, file: !1081, line: 302, baseType: !479, size: 64, align: 64, offset: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1080, file: !1081, line: 303, baseType: !447, size: 32, align: 32, offset: 1536)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1080, file: !1081, line: 305, baseType: !1128, size: 160, align: 8, offset: 1568)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 160, align: 8, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 20)
!1131 = !DILocation(line: 435, column: 10, scope: !1062)
!1132 = !DILocation(line: 435, column: 27, scope: !1062)
!1133 = !DILocation(line: 435, column: 15, scope: !1062)
!1134 = !DILocation(line: 437, column: 8, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1062, file: !381, line: 437, column: 8)
!1136 = !DILocation(line: 437, column: 11, scope: !1135)
!1137 = !DILocation(line: 437, column: 8, scope: !1062)
!1138 = !DILocation(line: 438, column: 89, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !381, line: 437, column: 19)
!1140 = !DILocation(line: 438, column: 7, scope: !1139)
!1141 = !DILocation(line: 439, column: 7, scope: !1139)
!1142 = !DILocation(line: 447, column: 4, scope: !1062)
!1143 = !DILocation(line: 447, column: 17, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1062, file: !381, discriminator: 1)
!1145 = !DILocation(line: 447, column: 36, scope: !1144)
!1146 = !DILocation(line: 447, column: 11, scope: !1144)
!1147 = !DILocation(line: 447, column: 43, scope: !1144)
!1148 = !DILocation(line: 447, column: 40, scope: !1144)
!1149 = !DILocation(line: 447, column: 4, scope: !1144)
!1150 = !DILocalVariable(name: "value", scope: !1151, file: !381, line: 448, type: !450)
!1151 = distinct !DILexicalBlock(scope: !1062, file: !381, line: 447, column: 49)
!1152 = !DILocation(line: 448, column: 14, scope: !1151)
!1153 = !DILocalVariable(name: "savedPtr", scope: !1151, file: !381, line: 449, type: !387)
!1154 = !DILocation(line: 449, column: 13, scope: !1151)
!1155 = !DILocalVariable(name: "fieldName", scope: !1151, file: !381, line: 450, type: !387)
!1156 = !DILocation(line: 450, column: 13, scope: !1151)
!1157 = !DILocation(line: 450, column: 34, scope: !1151)
!1158 = !DILocation(line: 450, column: 25, scope: !1151)
!1159 = !DILocalVariable(name: "fieldData", scope: !1151, file: !381, line: 451, type: !387)
!1160 = !DILocation(line: 451, column: 13, scope: !1151)
!1161 = !DILocation(line: 451, column: 25, scope: !1151)
!1162 = !DILocation(line: 453, column: 11, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1151, file: !381, line: 453, column: 11)
!1164 = !DILocation(line: 453, column: 21, scope: !1163)
!1165 = !DILocation(line: 453, column: 11, scope: !1151)
!1166 = !DILocation(line: 454, column: 10, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !381, line: 453, column: 29)
!1168 = distinct !{!1168, !1142}
!1169 = !DILocation(line: 457, column: 11, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1151, file: !381, line: 457, column: 11)
!1171 = !DILocation(line: 457, column: 26, scope: !1170)
!1172 = !DILocation(line: 457, column: 11, scope: !1151)
!1173 = !DILocalVariable(name: "p", scope: !1174, file: !381, line: 458, type: !387)
!1174 = distinct !DILexicalBlock(scope: !1170, file: !381, line: 457, column: 35)
!1175 = !DILocation(line: 458, column: 16, scope: !1174)
!1176 = !DILocation(line: 458, column: 28, scope: !1174)
!1177 = !DILocation(line: 458, column: 39, scope: !1174)
!1178 = !DILocation(line: 458, column: 20, scope: !1174)
!1179 = !DILocation(line: 459, column: 14, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1174, file: !381, line: 459, column: 14)
!1181 = !DILocation(line: 459, column: 16, scope: !1180)
!1182 = !DILocation(line: 459, column: 14, scope: !1174)
!1183 = !DILocation(line: 464, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1180, file: !381, line: 459, column: 24)
!1185 = !DILocation(line: 466, column: 14, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1180, file: !381, line: 465, column: 17)
!1187 = !DILocation(line: 466, column: 16, scope: !1186)
!1188 = !DILocation(line: 468, column: 7, scope: !1174)
!1189 = !DILocation(line: 470, column: 12, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1151, file: !381, line: 470, column: 11)
!1191 = !DILocation(line: 470, column: 22, scope: !1190)
!1192 = !DILocation(line: 470, column: 30, scope: !1190)
!1193 = !DILocation(line: 471, column: 19, scope: !1190)
!1194 = !DILocation(line: 471, column: 12, scope: !1190)
!1195 = !DILocation(line: 471, column: 49, scope: !1190)
!1196 = !DILocation(line: 470, column: 11, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1151, file: !381, discriminator: 1)
!1198 = !DILocation(line: 472, column: 10, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1190, file: !381, line: 471, column: 56)
!1200 = !DILocation(line: 475, column: 28, scope: !1151)
!1201 = !DILocation(line: 475, column: 38, scope: !1151)
!1202 = !DILocation(line: 475, column: 49, scope: !1151)
!1203 = !DILocation(line: 475, column: 60, scope: !1151)
!1204 = !DILocation(line: 475, column: 7, scope: !1151)
!1205 = !DILocation(line: 447, column: 4, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1062, file: !381, discriminator: 2)
!1207 = !DILocation(line: 478, column: 11, scope: !1062)
!1208 = !DILocation(line: 478, column: 4, scope: !1062)
!1209 = !DILocation(line: 480, column: 4, scope: !1062)
!1210 = !DILocation(line: 481, column: 1, scope: !1062)
!1211 = distinct !DISubprogram(name: "GuestInfoGetUpTime", scope: !381, file: !381, line: 253, type: !1212, isLocal: true, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!416, !1214}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!1215 = !DILocalVariable(name: "now", arg: 1, scope: !1211, file: !381, line: 253, type: !1214)
!1216 = !DILocation(line: 253, column: 28, scope: !1211)
!1217 = !DILocalVariable(name: "line", scope: !1211, file: !381, line: 255, type: !1218)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 4096, align: 8, elements: !1219)
!1219 = !{!1220}
!1220 = !DISubrange(count: 512)
!1221 = !DILocation(line: 255, column: 9, scope: !1211)
!1222 = !DILocalVariable(name: "result", scope: !1211, file: !381, line: 256, type: !416)
!1223 = !DILocation(line: 256, column: 9, scope: !1211)
!1224 = !DILocalVariable(name: "fp", scope: !1211, file: !381, line: 257, type: !1077)
!1225 = !DILocation(line: 257, column: 10, scope: !1211)
!1226 = !DILocation(line: 257, column: 15, scope: !1211)
!1227 = !DILocation(line: 259, column: 8, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1211, file: !381, line: 259, column: 8)
!1229 = !DILocation(line: 259, column: 11, scope: !1228)
!1230 = !DILocation(line: 259, column: 8, scope: !1211)
!1231 = !DILocation(line: 260, column: 14, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1228, file: !381, line: 259, column: 19)
!1233 = !DILocation(line: 260, column: 7, scope: !1232)
!1234 = !DILocation(line: 263, column: 14, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1211, file: !381, line: 263, column: 8)
!1236 = !DILocation(line: 263, column: 33, scope: !1235)
!1237 = !DILocation(line: 263, column: 8, scope: !1235)
!1238 = !DILocation(line: 263, column: 40, scope: !1235)
!1239 = !DILocation(line: 263, column: 37, scope: !1235)
!1240 = !DILocation(line: 263, column: 8, scope: !1211)
!1241 = !DILocalVariable(name: "idle", scope: !1242, file: !381, line: 264, type: !394)
!1242 = distinct !DILexicalBlock(scope: !1235, file: !381, line: 263, column: 46)
!1243 = !DILocation(line: 264, column: 14, scope: !1242)
!1244 = !DILocation(line: 266, column: 18, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1242, file: !381, line: 266, column: 11)
!1246 = !DILocation(line: 266, column: 35, scope: !1245)
!1247 = !DILocation(line: 266, column: 11, scope: !1245)
!1248 = !DILocation(line: 266, column: 47, scope: !1245)
!1249 = !DILocation(line: 266, column: 11, scope: !1242)
!1250 = !DILocation(line: 267, column: 17, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1245, file: !381, line: 266, column: 53)
!1252 = !DILocation(line: 268, column: 7, scope: !1251)
!1253 = !DILocation(line: 269, column: 4, scope: !1242)
!1254 = !DILocation(line: 271, column: 11, scope: !1211)
!1255 = !DILocation(line: 271, column: 4, scope: !1211)
!1256 = !DILocation(line: 273, column: 11, scope: !1211)
!1257 = !DILocation(line: 273, column: 4, scope: !1211)
!1258 = !DILocation(line: 274, column: 1, scope: !1211)
!1259 = distinct !DISubprogram(name: "GuestInfoStoreStatByID", scope: !381, file: !381, line: 344, type: !1260, isLocal: true, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !420, !430, !450}
!1262 = !DILocalVariable(name: "reportID", arg: 1, scope: !1259, file: !381, line: 344, type: !420)
!1263 = !DILocation(line: 344, column: 41, scope: !1259)
!1264 = !DILocalVariable(name: "collector", arg: 2, scope: !1259, file: !381, line: 345, type: !430)
!1265 = !DILocation(line: 345, column: 44, scope: !1259)
!1266 = !DILocalVariable(name: "value", arg: 3, scope: !1259, file: !381, line: 346, type: !450)
!1267 = !DILocation(line: 346, column: 31, scope: !1259)
!1268 = !DILocalVariable(name: "stat", scope: !1259, file: !381, line: 348, type: !442)
!1269 = !DILocation(line: 348, column: 19, scope: !1259)
!1270 = !DILocation(line: 350, column: 21, scope: !1259)
!1271 = !DILocation(line: 350, column: 32, scope: !1259)
!1272 = !DILocation(line: 351, column: 48, scope: !1259)
!1273 = !DILocation(line: 351, column: 36, scope: !1259)
!1274 = !DILocation(line: 351, column: 22, scope: !1259)
!1275 = !DILocation(line: 352, column: 21, scope: !1259)
!1276 = !DILocation(line: 350, column: 4, scope: !1259)
!1277 = !DILocation(line: 354, column: 23, scope: !1259)
!1278 = !DILocation(line: 354, column: 29, scope: !1259)
!1279 = !DILocation(line: 354, column: 4, scope: !1259)
!1280 = !DILocation(line: 355, column: 1, scope: !1259)
!1281 = distinct !DISubprogram(name: "GuestInfoDeriveMemNeeded", scope: !381, file: !381, line: 1148, type: !718, isLocal: true, isDefinition: true, scopeLine: 1149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1282 = !DILocalVariable(name: "collector", arg: 1, scope: !1281, file: !381, line: 1148, type: !430)
!1283 = !DILocation(line: 1148, column: 46, scope: !1281)
!1284 = !DILocalVariable(name: "memNeeded", scope: !1281, file: !381, line: 1150, type: !450)
!1285 = !DILocation(line: 1150, column: 11, scope: !1281)
!1286 = !DILocalVariable(name: "memNeededReservation", scope: !1281, file: !381, line: 1151, type: !450)
!1287 = !DILocation(line: 1151, column: 11, scope: !1281)
!1288 = !DILocalVariable(name: "memAvailable", scope: !1281, file: !381, line: 1152, type: !450)
!1289 = !DILocation(line: 1152, column: 11, scope: !1281)
!1290 = !DILocalVariable(name: "memAvail", scope: !1281, file: !381, line: 1153, type: !442)
!1291 = !DILocation(line: 1153, column: 19, scope: !1281)
!1292 = !DILocalVariable(name: "memPhysUsable", scope: !1281, file: !381, line: 1154, type: !442)
!1293 = !DILocation(line: 1154, column: 19, scope: !1281)
!1294 = !DILocation(line: 1156, column: 21, scope: !1281)
!1295 = !DILocation(line: 1156, column: 32, scope: !1281)
!1296 = !DILocation(line: 1158, column: 21, scope: !1281)
!1297 = !DILocation(line: 1156, column: 4, scope: !1281)
!1298 = !DILocation(line: 1162, column: 21, scope: !1281)
!1299 = !DILocation(line: 1162, column: 32, scope: !1281)
!1300 = !DILocation(line: 1164, column: 21, scope: !1281)
!1301 = !DILocation(line: 1162, column: 4, scope: !1281)
!1302 = !DILocation(line: 1166, column: 9, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1281, file: !381, line: 1166, column: 8)
!1304 = !DILocation(line: 1166, column: 18, scope: !1303)
!1305 = !DILocation(line: 1166, column: 26, scope: !1303)
!1306 = !DILocation(line: 1166, column: 30, scope: !1307)
!1307 = !DILexicalBlockFile(scope: !1303, file: !381, discriminator: 1)
!1308 = !DILocation(line: 1166, column: 40, scope: !1307)
!1309 = !DILocation(line: 1166, column: 44, scope: !1307)
!1310 = !DILocation(line: 1166, column: 8, scope: !1307)
!1311 = !DILocation(line: 1167, column: 22, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1303, file: !381, line: 1166, column: 51)
!1313 = !DILocation(line: 1167, column: 32, scope: !1312)
!1314 = !DILocation(line: 1167, column: 20, scope: !1312)
!1315 = !DILocation(line: 1168, column: 4, scope: !1312)
!1316 = !DILocalVariable(name: "memFree", scope: !1317, file: !381, line: 1169, type: !442)
!1317 = distinct !DILexicalBlock(scope: !1303, file: !381, line: 1168, column: 11)
!1318 = !DILocation(line: 1169, column: 22, scope: !1317)
!1319 = !DILocalVariable(name: "memCache", scope: !1317, file: !381, line: 1170, type: !442)
!1320 = !DILocation(line: 1170, column: 22, scope: !1317)
!1321 = !DILocalVariable(name: "memBuffers", scope: !1317, file: !381, line: 1171, type: !442)
!1322 = !DILocation(line: 1171, column: 22, scope: !1317)
!1323 = !DILocalVariable(name: "memActiveFile", scope: !1317, file: !381, line: 1172, type: !442)
!1324 = !DILocation(line: 1172, column: 22, scope: !1317)
!1325 = !DILocalVariable(name: "memSlabReclaim", scope: !1317, file: !381, line: 1173, type: !442)
!1326 = !DILocation(line: 1173, column: 22, scope: !1317)
!1327 = !DILocalVariable(name: "memInactiveFile", scope: !1317, file: !381, line: 1174, type: !442)
!1328 = !DILocation(line: 1174, column: 22, scope: !1317)
!1329 = !DILocalVariable(name: "lowWaterMark", scope: !1317, file: !381, line: 1175, type: !442)
!1330 = !DILocation(line: 1175, column: 22, scope: !1317)
!1331 = !DILocation(line: 1177, column: 24, scope: !1317)
!1332 = !DILocation(line: 1177, column: 35, scope: !1317)
!1333 = !DILocation(line: 1179, column: 24, scope: !1317)
!1334 = !DILocation(line: 1177, column: 7, scope: !1317)
!1335 = !DILocation(line: 1180, column: 24, scope: !1317)
!1336 = !DILocation(line: 1180, column: 35, scope: !1317)
!1337 = !DILocation(line: 1182, column: 24, scope: !1317)
!1338 = !DILocation(line: 1180, column: 7, scope: !1317)
!1339 = !DILocation(line: 1183, column: 24, scope: !1317)
!1340 = !DILocation(line: 1183, column: 35, scope: !1317)
!1341 = !DILocation(line: 1185, column: 24, scope: !1317)
!1342 = !DILocation(line: 1183, column: 7, scope: !1317)
!1343 = !DILocation(line: 1186, column: 24, scope: !1317)
!1344 = !DILocation(line: 1186, column: 35, scope: !1317)
!1345 = !DILocation(line: 1188, column: 24, scope: !1317)
!1346 = !DILocation(line: 1186, column: 7, scope: !1317)
!1347 = !DILocation(line: 1189, column: 24, scope: !1317)
!1348 = !DILocation(line: 1189, column: 35, scope: !1317)
!1349 = !DILocation(line: 1191, column: 24, scope: !1317)
!1350 = !DILocation(line: 1189, column: 7, scope: !1317)
!1351 = !DILocation(line: 1192, column: 24, scope: !1317)
!1352 = !DILocation(line: 1192, column: 35, scope: !1317)
!1353 = !DILocation(line: 1194, column: 24, scope: !1317)
!1354 = !DILocation(line: 1192, column: 7, scope: !1317)
!1355 = !DILocation(line: 1195, column: 24, scope: !1317)
!1356 = !DILocation(line: 1195, column: 35, scope: !1317)
!1357 = !DILocation(line: 1197, column: 24, scope: !1317)
!1358 = !DILocation(line: 1195, column: 7, scope: !1317)
!1359 = !DILocation(line: 1199, column: 13, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1317, file: !381, line: 1199, column: 11)
!1361 = !DILocation(line: 1199, column: 21, scope: !1360)
!1362 = !DILocation(line: 1199, column: 29, scope: !1360)
!1363 = !DILocation(line: 1199, column: 33, scope: !1364)
!1364 = !DILexicalBlockFile(scope: !1360, file: !381, discriminator: 1)
!1365 = !DILocation(line: 1199, column: 42, scope: !1364)
!1366 = !DILocation(line: 1199, column: 46, scope: !1364)
!1367 = !DILocation(line: 1199, column: 53, scope: !1364)
!1368 = !DILocation(line: 1200, column: 13, scope: !1360)
!1369 = !DILocation(line: 1200, column: 22, scope: !1360)
!1370 = !DILocation(line: 1200, column: 30, scope: !1360)
!1371 = !DILocation(line: 1200, column: 34, scope: !1364)
!1372 = !DILocation(line: 1200, column: 44, scope: !1364)
!1373 = !DILocation(line: 1200, column: 48, scope: !1364)
!1374 = !DILocation(line: 1200, column: 55, scope: !1364)
!1375 = !DILocation(line: 1201, column: 13, scope: !1360)
!1376 = !DILocation(line: 1201, column: 24, scope: !1360)
!1377 = !DILocation(line: 1201, column: 32, scope: !1360)
!1378 = !DILocation(line: 1201, column: 36, scope: !1364)
!1379 = !DILocation(line: 1201, column: 48, scope: !1364)
!1380 = !DILocation(line: 1201, column: 52, scope: !1364)
!1381 = !DILocation(line: 1201, column: 59, scope: !1364)
!1382 = !DILocation(line: 1202, column: 12, scope: !1360)
!1383 = !DILocation(line: 1202, column: 26, scope: !1360)
!1384 = !DILocation(line: 1202, column: 34, scope: !1360)
!1385 = !DILocation(line: 1203, column: 12, scope: !1360)
!1386 = !DILocation(line: 1203, column: 27, scope: !1360)
!1387 = !DILocation(line: 1203, column: 35, scope: !1360)
!1388 = !DILocation(line: 1204, column: 12, scope: !1360)
!1389 = !DILocation(line: 1204, column: 28, scope: !1360)
!1390 = !DILocation(line: 1204, column: 36, scope: !1360)
!1391 = !DILocation(line: 1205, column: 13, scope: !1360)
!1392 = !DILocation(line: 1205, column: 26, scope: !1360)
!1393 = !DILocation(line: 1205, column: 34, scope: !1360)
!1394 = !DILocation(line: 1205, column: 38, scope: !1364)
!1395 = !DILocation(line: 1205, column: 52, scope: !1364)
!1396 = !DILocation(line: 1205, column: 56, scope: !1364)
!1397 = !DILocation(line: 1199, column: 11, scope: !1398)
!1398 = !DILexicalBlockFile(scope: !1317, file: !381, discriminator: 2)
!1399 = !DILocalVariable(name: "pageCache", scope: !1400, file: !381, line: 1206, type: !450)
!1400 = distinct !DILexicalBlock(scope: !1360, file: !381, line: 1205, column: 64)
!1401 = !DILocation(line: 1206, column: 17, scope: !1400)
!1402 = !DILocalVariable(name: "kbPerPage", scope: !1400, file: !381, line: 1207, type: !372)
!1403 = !DILocation(line: 1207, column: 24, scope: !1400)
!1404 = !DILocation(line: 1207, column: 36, scope: !1400)
!1405 = !DILocation(line: 1207, column: 57, scope: !1400)
!1406 = !DILocalVariable(name: "lowWaterMarkValue", scope: !1400, file: !381, line: 1208, type: !450)
!1407 = !DILocation(line: 1208, column: 17, scope: !1400)
!1408 = !DILocation(line: 1208, column: 37, scope: !1400)
!1409 = !DILocation(line: 1208, column: 51, scope: !1400)
!1410 = !DILocation(line: 1208, column: 59, scope: !1400)
!1411 = !DILocation(line: 1208, column: 57, scope: !1400)
!1412 = !DILocation(line: 1210, column: 25, scope: !1400)
!1413 = !DILocation(line: 1210, column: 34, scope: !1400)
!1414 = !DILocation(line: 1210, column: 42, scope: !1400)
!1415 = !DILocation(line: 1210, column: 40, scope: !1400)
!1416 = !DILocation(line: 1210, column: 23, scope: !1400)
!1417 = !DILocation(line: 1212, column: 15, scope: !1418)
!1418 = distinct !DILexicalBlock(scope: !1400, file: !381, line: 1212, column: 14)
!1419 = !DILocation(line: 1212, column: 30, scope: !1418)
!1420 = !DILocation(line: 1212, column: 34, scope: !1418)
!1421 = !DILocation(line: 1212, column: 40, scope: !1418)
!1422 = !DILocation(line: 1212, column: 44, scope: !1423)
!1423 = !DILexicalBlockFile(scope: !1418, file: !381, discriminator: 1)
!1424 = !DILocation(line: 1212, column: 61, scope: !1423)
!1425 = !DILocation(line: 1212, column: 65, scope: !1423)
!1426 = !DILocation(line: 1212, column: 14, scope: !1423)
!1427 = !DILocation(line: 1213, column: 25, scope: !1428)
!1428 = distinct !DILexicalBlock(scope: !1418, file: !381, line: 1212, column: 72)
!1429 = !DILocation(line: 1213, column: 40, scope: !1428)
!1430 = !DILocation(line: 1213, column: 48, scope: !1428)
!1431 = !DILocation(line: 1213, column: 65, scope: !1428)
!1432 = !DILocation(line: 1213, column: 46, scope: !1428)
!1433 = !DILocation(line: 1213, column: 23, scope: !1428)
!1434 = !DILocation(line: 1214, column: 10, scope: !1428)
!1435 = !DILocation(line: 1219, column: 25, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1418, file: !381, line: 1214, column: 17)
!1437 = !DILocation(line: 1219, column: 35, scope: !1436)
!1438 = !DILocation(line: 1219, column: 43, scope: !1436)
!1439 = !DILocation(line: 1219, column: 55, scope: !1436)
!1440 = !DILocation(line: 1219, column: 41, scope: !1436)
!1441 = !DILocation(line: 1219, column: 23, scope: !1436)
!1442 = !DILocation(line: 1222, column: 22, scope: !1400)
!1443 = !DILocation(line: 1222, column: 32, scope: !1400)
!1444 = !DILocation(line: 1222, column: 23, scope: !1400)
!1445 = !DILocation(line: 1222, column: 22, scope: !1446)
!1446 = !DILexicalBlockFile(scope: !1400, file: !381, discriminator: 1)
!1447 = !DILocation(line: 1222, column: 32, scope: !1446)
!1448 = !DILocation(line: 1222, column: 23, scope: !1446)
!1449 = !DILocation(line: 1222, column: 22, scope: !1450)
!1450 = !DILexicalBlockFile(scope: !1400, file: !381, discriminator: 2)
!1451 = !DILocation(line: 1222, column: 23, scope: !1450)
!1452 = !DILocation(line: 1222, column: 23, scope: !1453)
!1453 = !DILexicalBlockFile(scope: !1400, file: !381, discriminator: 3)
!1454 = !DILocation(line: 1222, column: 20, scope: !1453)
!1455 = !DILocation(line: 1223, column: 26, scope: !1400)
!1456 = !DILocation(line: 1223, column: 23, scope: !1400)
!1457 = !DILocation(line: 1225, column: 14, scope: !1458)
!1458 = distinct !DILexicalBlock(scope: !1400, file: !381, line: 1225, column: 14)
!1459 = !DILocation(line: 1225, column: 30, scope: !1458)
!1460 = !DILocation(line: 1225, column: 34, scope: !1458)
!1461 = !DILocation(line: 1225, column: 14, scope: !1400)
!1462 = !DILocation(line: 1226, column: 29, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1458, file: !381, line: 1225, column: 40)
!1464 = !DILocation(line: 1226, column: 45, scope: !1463)
!1465 = !DILocation(line: 1227, column: 28, scope: !1463)
!1466 = !DILocation(line: 1227, column: 44, scope: !1463)
!1467 = !DILocation(line: 1227, column: 50, scope: !1463)
!1468 = !DILocation(line: 1227, column: 29, scope: !1463)
!1469 = !DILocation(line: 1227, column: 28, scope: !1470)
!1470 = !DILexicalBlockFile(scope: !1463, file: !381, discriminator: 1)
!1471 = !DILocation(line: 1227, column: 44, scope: !1470)
!1472 = !DILocation(line: 1227, column: 50, scope: !1470)
!1473 = !DILocation(line: 1227, column: 29, scope: !1470)
!1474 = !DILocation(line: 1227, column: 28, scope: !1475)
!1475 = !DILexicalBlockFile(scope: !1463, file: !381, discriminator: 2)
!1476 = !DILocation(line: 1227, column: 29, scope: !1475)
!1477 = !DILocation(line: 1227, column: 29, scope: !1478)
!1478 = !DILexicalBlockFile(scope: !1463, file: !381, discriminator: 3)
!1479 = !DILocation(line: 1226, column: 51, scope: !1470)
!1480 = !DILocation(line: 1226, column: 26, scope: !1470)
!1481 = !DILocation(line: 1228, column: 10, scope: !1463)
!1482 = !DILocation(line: 1230, column: 21, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1400, file: !381, line: 1230, column: 14)
!1484 = !DILocation(line: 1230, column: 34, scope: !1483)
!1485 = !DILocation(line: 1230, column: 14, scope: !1400)
!1486 = !DILocation(line: 1231, column: 26, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1483, file: !381, line: 1230, column: 39)
!1488 = !DILocation(line: 1232, column: 10, scope: !1487)
!1489 = !DILocation(line: 1233, column: 7, scope: !1400)
!1490 = !DILocation(line: 1236, column: 8, scope: !1491)
!1491 = distinct !DILexicalBlock(scope: !1281, file: !381, line: 1236, column: 8)
!1492 = !DILocation(line: 1236, column: 23, scope: !1491)
!1493 = !DILocation(line: 1236, column: 27, scope: !1491)
!1494 = !DILocation(line: 1236, column: 8, scope: !1281)
!1495 = !DILocation(line: 1240, column: 30, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1491, file: !381, line: 1236, column: 33)
!1497 = !DILocation(line: 1240, column: 45, scope: !1496)
!1498 = !DILocation(line: 1240, column: 51, scope: !1496)
!1499 = !DILocation(line: 1240, column: 28, scope: !1496)
!1500 = !DILocation(line: 1242, column: 11, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1496, file: !381, line: 1242, column: 11)
!1502 = !DILocation(line: 1242, column: 26, scope: !1501)
!1503 = !DILocation(line: 1242, column: 24, scope: !1501)
!1504 = !DILocation(line: 1242, column: 11, scope: !1496)
!1505 = !DILocation(line: 1243, column: 26, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1501, file: !381, line: 1242, column: 48)
!1507 = !DILocation(line: 1243, column: 23, scope: !1506)
!1508 = !DILocation(line: 1244, column: 7, scope: !1506)
!1509 = !DILocation(line: 1245, column: 23, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1501, file: !381, line: 1244, column: 14)
!1511 = !DILocation(line: 1253, column: 19, scope: !1496)
!1512 = !DILocation(line: 1253, column: 34, scope: !1496)
!1513 = !DILocation(line: 1253, column: 42, scope: !1496)
!1514 = !DILocation(line: 1253, column: 40, scope: !1496)
!1515 = !DILocation(line: 1253, column: 17, scope: !1496)
!1516 = !DILocation(line: 1254, column: 4, scope: !1496)
!1517 = !DILocation(line: 1255, column: 17, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1491, file: !381, line: 1254, column: 11)
!1519 = !DILocation(line: 1256, column: 28, scope: !1518)
!1520 = !DILocation(line: 1260, column: 27, scope: !1281)
!1521 = !DILocation(line: 1261, column: 27, scope: !1281)
!1522 = !DILocation(line: 1259, column: 4, scope: !1281)
!1523 = !DILocation(line: 1264, column: 27, scope: !1281)
!1524 = !DILocation(line: 1265, column: 27, scope: !1281)
!1525 = !DILocation(line: 1263, column: 4, scope: !1281)
!1526 = !DILocation(line: 1266, column: 1, scope: !1281)
!1527 = distinct !DISubprogram(name: "GuestInfoDecreaseCpuRunQueueByOne", scope: !381, file: !381, line: 643, type: !718, isLocal: true, isDefinition: true, scopeLine: 644, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !464)
!1528 = !DILocalVariable(name: "collector", arg: 1, scope: !1527, file: !381, line: 643, type: !430)
!1529 = !DILocation(line: 643, column: 55, scope: !1527)
!1530 = !DILocalVariable(name: "stat", scope: !1527, file: !381, line: 645, type: !442)
!1531 = !DILocation(line: 645, column: 19, scope: !1527)
!1532 = !DILocation(line: 647, column: 21, scope: !1527)
!1533 = !DILocation(line: 647, column: 32, scope: !1527)
!1534 = !DILocation(line: 649, column: 21, scope: !1527)
!1535 = !DILocation(line: 647, column: 4, scope: !1527)
!1536 = !DILocation(line: 654, column: 8, scope: !1537)
!1537 = distinct !DILexicalBlock(scope: !1527, file: !381, line: 654, column: 8)
!1538 = !DILocation(line: 654, column: 13, scope: !1537)
!1539 = !DILocation(line: 654, column: 20, scope: !1537)
!1540 = !DILocation(line: 654, column: 23, scope: !1541)
!1541 = !DILexicalBlockFile(scope: !1537, file: !381, discriminator: 1)
!1542 = !DILocation(line: 654, column: 29, scope: !1541)
!1543 = !DILocation(line: 654, column: 33, scope: !1541)
!1544 = !DILocation(line: 654, column: 38, scope: !1541)
!1545 = !DILocation(line: 654, column: 41, scope: !1546)
!1546 = !DILexicalBlockFile(scope: !1537, file: !381, discriminator: 2)
!1547 = !DILocation(line: 654, column: 47, scope: !1546)
!1548 = !DILocation(line: 654, column: 53, scope: !1546)
!1549 = !DILocation(line: 654, column: 8, scope: !1546)
!1550 = !DILocation(line: 655, column: 11, scope: !1551)
!1551 = distinct !DILexicalBlock(scope: !1552, file: !381, line: 655, column: 11)
!1552 = distinct !DILexicalBlock(scope: !1537, file: !381, line: 654, column: 59)
!1553 = !DILocation(line: 655, column: 17, scope: !1551)
!1554 = !DILocation(line: 655, column: 23, scope: !1551)
!1555 = !DILocation(line: 655, column: 11, scope: !1552)
!1556 = !DILocation(line: 656, column: 10, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1551, file: !381, line: 655, column: 28)
!1558 = !DILocation(line: 656, column: 16, scope: !1557)
!1559 = !DILocation(line: 656, column: 21, scope: !1557)
!1560 = !DILocation(line: 657, column: 7, scope: !1557)
!1561 = !DILocation(line: 658, column: 4, scope: !1552)
!1562 = !DILocation(line: 659, column: 1, scope: !1527)
!1563 = !DILocalVariable(name: "collector", arg: 1, scope: !461, file: !381, line: 681, type: !430)
!1564 = !DILocation(line: 681, column: 48, scope: !461)
!1565 = !DILocalVariable(name: "prev", scope: !461, file: !381, line: 685, type: !447)
!1566 = !DILocation(line: 685, column: 8, scope: !461)
!1567 = !DILocalVariable(name: "listItem", scope: !461, file: !381, line: 686, type: !1568)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!1569 = !DILocation(line: 686, column: 29, scope: !461)
!1570 = !DILocalVariable(name: "inflightIOsSum", scope: !461, file: !381, line: 687, type: !450)
!1571 = !DILocation(line: 687, column: 11, scope: !461)
!1572 = !DILocalVariable(name: "setStats", scope: !461, file: !381, line: 688, type: !416)
!1573 = !DILocation(line: 688, column: 9, scope: !461)
!1574 = !DILocalVariable(name: "line", scope: !461, file: !381, line: 690, type: !1218)
!1575 = !DILocation(line: 690, column: 9, scope: !461)
!1576 = !DILocalVariable(name: "fp", scope: !461, file: !381, line: 691, type: !1077)
!1577 = !DILocation(line: 691, column: 10, scope: !461)
!1578 = !DILocation(line: 691, column: 15, scope: !461)
!1579 = !DILocation(line: 693, column: 8, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !461, file: !381, line: 693, column: 8)
!1581 = !DILocation(line: 693, column: 11, scope: !1580)
!1582 = !DILocation(line: 693, column: 8, scope: !461)
!1583 = !DILocation(line: 694, column: 7, scope: !1584)
!1584 = distinct !DILexicalBlock(scope: !1580, file: !381, line: 693, column: 19)
!1585 = !DILocation(line: 695, column: 7, scope: !1584)
!1586 = !DILocation(line: 698, column: 11, scope: !461)
!1587 = !DILocation(line: 698, column: 16, scope: !461)
!1588 = !DILocation(line: 698, column: 9, scope: !461)
!1589 = !DILocation(line: 699, column: 13, scope: !461)
!1590 = !DILocation(line: 700, column: 19, scope: !461)
!1591 = !DILocation(line: 701, column: 16, scope: !461)
!1592 = !DILocation(line: 701, column: 31, scope: !461)
!1593 = !DILocation(line: 701, column: 15, scope: !461)
!1594 = !DILocation(line: 701, column: 13, scope: !461)
!1595 = !DILocation(line: 703, column: 4, scope: !461)
!1596 = !DILocation(line: 703, column: 17, scope: !1597)
!1597 = !DILexicalBlockFile(scope: !461, file: !381, discriminator: 1)
!1598 = !DILocation(line: 703, column: 36, scope: !1597)
!1599 = !DILocation(line: 703, column: 11, scope: !1597)
!1600 = !DILocation(line: 703, column: 43, scope: !1597)
!1601 = !DILocation(line: 703, column: 40, scope: !1597)
!1602 = !DILocation(line: 703, column: 4, scope: !1597)
!1603 = !DILocalVariable(name: "assignedCount", scope: !1604, file: !381, line: 712, type: !447)
!1604 = distinct !DILexicalBlock(scope: !461, file: !381, line: 703, column: 49)
!1605 = !DILocation(line: 712, column: 11, scope: !1604)
!1606 = !DILocalVariable(name: "diskName", scope: !1604, file: !381, line: 713, type: !1607)
!1607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 2048, align: 8, elements: !1608)
!1608 = !{!1609}
!1609 = !DISubrange(count: 256)
!1610 = !DILocation(line: 713, column: 12, scope: !1604)
!1611 = !DILocalVariable(name: "readIOs", scope: !1604, file: !381, line: 714, type: !372)
!1612 = !DILocation(line: 714, column: 25, scope: !1604)
!1613 = !DILocalVariable(name: "writeIOs", scope: !1604, file: !381, line: 715, type: !372)
!1614 = !DILocation(line: 715, column: 25, scope: !1604)
!1615 = !DILocalVariable(name: "inflightIOs", scope: !1604, file: !381, line: 716, type: !391)
!1616 = !DILocation(line: 716, column: 20, scope: !1604)
!1617 = !DILocalVariable(name: "weightedTime", scope: !1604, file: !381, line: 717, type: !391)
!1618 = !DILocation(line: 717, column: 20, scope: !1604)
!1619 = !DILocation(line: 719, column: 30, scope: !1604)
!1620 = !DILocation(line: 724, column: 30, scope: !1604)
!1621 = !DILocation(line: 719, column: 23, scope: !1604)
!1622 = !DILocation(line: 719, column: 21, scope: !1604)
!1623 = !DILocation(line: 728, column: 11, scope: !1624)
!1624 = distinct !DILexicalBlock(scope: !1604, file: !381, line: 728, column: 11)
!1625 = !DILocation(line: 728, column: 25, scope: !1624)
!1626 = !DILocation(line: 728, column: 30, scope: !1624)
!1627 = !DILocation(line: 729, column: 12, scope: !1624)
!1628 = !DILocation(line: 729, column: 20, scope: !1624)
!1629 = !DILocation(line: 729, column: 25, scope: !1624)
!1630 = !DILocation(line: 729, column: 28, scope: !1631)
!1631 = !DILexicalBlockFile(scope: !1624, file: !381, discriminator: 1)
!1632 = !DILocation(line: 729, column: 37, scope: !1631)
!1633 = !DILocation(line: 729, column: 43, scope: !1631)
!1634 = !DILocation(line: 730, column: 35, scope: !1624)
!1635 = !DILocation(line: 730, column: 12, scope: !1624)
!1636 = !DILocation(line: 728, column: 11, scope: !1637)
!1637 = !DILexicalBlockFile(scope: !1604, file: !381, discriminator: 1)
!1638 = !DILocation(line: 731, column: 10, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1624, file: !381, line: 730, column: 46)
!1640 = distinct !{!1640, !1595}
!1641 = !DILocation(line: 734, column: 25, scope: !1604)
!1642 = !DILocation(line: 734, column: 22, scope: !1604)
!1643 = !DILocation(line: 736, column: 12, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1604, file: !381, line: 736, column: 11)
!1645 = !DILocation(line: 736, column: 11, scope: !1644)
!1646 = !DILocation(line: 736, column: 21, scope: !1644)
!1647 = !DILocation(line: 736, column: 11, scope: !1604)
!1648 = !DILocation(line: 737, column: 23, scope: !1649)
!1649 = distinct !DILexicalBlock(scope: !1650, file: !381, line: 737, column: 14)
!1650 = distinct !DILexicalBlock(scope: !1644, file: !381, line: 736, column: 29)
!1651 = !DILocation(line: 737, column: 22, scope: !1649)
!1652 = !DILocation(line: 737, column: 34, scope: !1649)
!1653 = !DILocation(line: 737, column: 44, scope: !1649)
!1654 = !DILocation(line: 737, column: 14, scope: !1649)
!1655 = !DILocation(line: 737, column: 54, scope: !1649)
!1656 = !DILocation(line: 737, column: 14, scope: !1650)
!1657 = !DILocation(line: 738, column: 47, scope: !1658)
!1658 = distinct !DILexicalBlock(scope: !1649, file: !381, line: 737, column: 60)
!1659 = !DILocation(line: 738, column: 39, scope: !1658)
!1660 = !DILocation(line: 738, column: 13, scope: !1658)
!1661 = !DILocation(line: 738, column: 15, scope: !1658)
!1662 = !DILocation(line: 738, column: 14, scope: !1658)
!1663 = !DILocation(line: 738, column: 26, scope: !1658)
!1664 = !DILocation(line: 738, column: 45, scope: !1658)
!1665 = !DILocation(line: 739, column: 10, scope: !1658)
!1666 = !DILocation(line: 741, column: 43, scope: !1667)
!1667 = distinct !DILexicalBlock(scope: !1649, file: !381, line: 739, column: 17)
!1668 = !DILocation(line: 741, column: 42, scope: !1667)
!1669 = !DILocation(line: 741, column: 13, scope: !1667)
!1670 = !DILocation(line: 742, column: 14, scope: !1667)
!1671 = !DILocation(line: 742, column: 23, scope: !1667)
!1672 = !DILocation(line: 744, column: 7, scope: !1650)
!1673 = !DILocation(line: 746, column: 12, scope: !1674)
!1674 = distinct !DILexicalBlock(scope: !1604, file: !381, line: 746, column: 11)
!1675 = !DILocation(line: 746, column: 11, scope: !1674)
!1676 = !DILocation(line: 746, column: 21, scope: !1674)
!1677 = !DILocation(line: 746, column: 11, scope: !1604)
!1678 = !DILocation(line: 748, column: 26, scope: !1679)
!1679 = distinct !DILexicalBlock(scope: !1674, file: !381, line: 746, column: 29)
!1680 = !DILocation(line: 747, column: 22, scope: !1679)
!1681 = !DILocation(line: 747, column: 11, scope: !1679)
!1682 = !DILocation(line: 747, column: 20, scope: !1679)
!1683 = !DILocation(line: 749, column: 12, scope: !1679)
!1684 = !DILocation(line: 749, column: 11, scope: !1679)
!1685 = !DILocation(line: 749, column: 23, scope: !1679)
!1686 = !DILocation(line: 749, column: 28, scope: !1679)
!1687 = !DILocation(line: 750, column: 50, scope: !1679)
