; ModuleID = './[inter]third-party--zlib-1.2.7--minigzip.o.i'
source_filename = "./[inter]third-party--zlib-1.2.7--minigzip.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.gzFile_s = type { i32, i8*, i64 }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [8 x i8] c"%s: %s\0A\00", align 1
@prog = common global i8* null, align 8
@.str.1 = private unnamed_addr constant [6 x i8] c"fread\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"failed gzclose\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"failed fwrite\00", align 1
@.str.4 = private unnamed_addr constant [14 x i8] c"failed fclose\00", align 1
@.str.5 = private unnamed_addr constant [23 x i8] c"%s: filename too long\0A\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c".gz\00", align 1
@.str.7 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.8 = private unnamed_addr constant [21 x i8] c"%s: can't gzopen %s\0A\00", align 1
@.str.9 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.10 = private unnamed_addr constant [5 x i8] c"wb6 \00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !7)
!1 = !DIFile(filename: "[inter]third-party--zlib-1.2.7--minigzip.o.i", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8}
!8 = distinct !DIGlobalVariable(name: "prog", scope: !0, file: !9, line: 332, type: !10, isLocal: false, isDefinition: true, variable: i8** @prog)
!9 = !DIFile(filename: "test/minigzip.c", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!12 = !{i32 2, !"Dwarf Version", i32 4}
!13 = !{i32 2, !"Debug Info Version", i32 3}
!14 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!15 = distinct !DISubprogram(name: "error", scope: !9, file: !9, line: 347, type: !16, isLocal: false, isDefinition: true, scopeLine: 349, isOptimized: false, unit: !0, variables: !2)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!20 = !DILocalVariable(name: "msg", arg: 1, scope: !15, file: !9, line: 348, type: !18)
!21 = !DIExpression()
!22 = !DILocation(line: 348, column: 17, scope: !15)
!23 = !DILocation(line: 350, column: 12, scope: !15)
!24 = !DILocation(line: 350, column: 32, scope: !15)
!25 = !DILocation(line: 350, column: 38, scope: !15)
!26 = !DILocation(line: 350, column: 5, scope: !15)
!27 = !DILocation(line: 351, column: 5, scope: !15)
!28 = !DILocation(line: 352, column: 1, scope: !15)
!29 = distinct !DISubprogram(name: "gz_compress", scope: !9, file: !9, line: 358, type: !30, isLocal: false, isDefinition: true, scopeLine: 361, isOptimized: false, unit: !0, variables: !2)
!30 = !DISubroutineType(types: !31)
!31 = !{null, !32, !91}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 48, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !36, line: 241, size: 1728, align: 64, elements: !37)
!36 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !58, !59, !60, !61, !65, !67, !69, !73, !76, !78, !79, !80, !81, !82, !86, !87}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !36, line: 242, baseType: !4, size: 32, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !35, file: !36, line: 247, baseType: !10, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !35, file: !36, line: 248, baseType: !10, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !35, file: !36, line: 249, baseType: !10, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !35, file: !36, line: 250, baseType: !10, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !35, file: !36, line: 251, baseType: !10, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !35, file: !36, line: 252, baseType: !10, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !35, file: !36, line: 253, baseType: !10, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !35, file: !36, line: 254, baseType: !10, size: 64, align: 64, offset: 512)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !35, file: !36, line: 256, baseType: !10, size: 64, align: 64, offset: 576)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !35, file: !36, line: 257, baseType: !10, size: 64, align: 64, offset: 640)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !35, file: !36, line: 258, baseType: !10, size: 64, align: 64, offset: 704)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !35, file: !36, line: 260, baseType: !51, size: 64, align: 64, offset: 768)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !36, line: 156, size: 192, align: 64, elements: !53)
!53 = !{!54, !55, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !52, file: !36, line: 157, baseType: !51, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !52, file: !36, line: 158, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !52, file: !36, line: 162, baseType: !4, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !35, file: !36, line: 262, baseType: !56, size: 64, align: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !35, file: !36, line: 264, baseType: !4, size: 32, align: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !36, line: 268, baseType: !4, size: 32, align: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !35, file: !36, line: 270, baseType: !62, size: 64, align: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 131, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!64 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !35, file: !36, line: 274, baseType: !66, size: 16, align: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !35, file: !36, line: 275, baseType: !68, size: 8, align: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !35, file: !36, line: 276, baseType: !70, size: 8, align: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !36, line: 280, baseType: !74, size: 64, align: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !36, line: 150, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !36, line: 289, baseType: !77, size: 64, align: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 132, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !35, file: !36, line: 297, baseType: !6, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !35, file: !36, line: 298, baseType: !6, size: 64, align: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !35, file: !36, line: 299, baseType: !6, size: 64, align: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !35, file: !36, line: 300, baseType: !6, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !35, file: !36, line: 302, baseType: !83, size: 64, align: 64, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 216, baseType: !85)
!84 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!85 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !35, file: !36, line: 303, baseType: !4, size: 32, align: 32, offset: 1536)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !35, file: !36, line: 305, baseType: !88, size: 160, align: 8, offset: 1568)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 20)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !92, line: 1207, baseType: !93)
!92 = !DIFile(filename: "./zlib.h", directory: "/home/lichi/Desktop/bedops/[task]third-party--zlib-1.2.7--minigzip")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !92, line: 1670, size: 192, align: 64, elements: !95)
!95 = !{!96, !97, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !94, file: !92, line: 1671, baseType: !5, size: 32, align: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !92, line: 1672, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !94, file: !92, line: 1673, baseType: !64, size: 64, align: 64, offset: 128)
!101 = !DILocalVariable(name: "in", arg: 1, scope: !29, file: !9, line: 359, type: !32)
!102 = !DILocation(line: 359, column: 11, scope: !29)
!103 = !DILocalVariable(name: "out", arg: 2, scope: !29, file: !9, line: 360, type: !91)
!104 = !DILocation(line: 360, column: 12, scope: !29)
!105 = !DILocalVariable(name: "buf", scope: !29, file: !9, line: 362, type: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 131072, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 16384)
!109 = !DILocation(line: 362, column: 10, scope: !29)
!110 = !DILocalVariable(name: "len", scope: !29, file: !9, line: 363, type: !4)
!111 = !DILocation(line: 363, column: 9, scope: !29)
!112 = !DILocalVariable(name: "err", scope: !29, file: !9, line: 364, type: !4)
!113 = !DILocation(line: 364, column: 9, scope: !29)
!114 = !DILocation(line: 372, column: 5, scope: !29)
!115 = !DILocation(line: 373, column: 26, scope: !116)
!116 = distinct !DILexicalBlock(scope: !117, file: !9, line: 372, column: 14)
!117 = distinct !DILexicalBlock(scope: !118, file: !9, line: 372, column: 5)
!118 = distinct !DILexicalBlock(scope: !29, file: !9, line: 372, column: 5)
!119 = !DILocation(line: 373, column: 47, scope: !116)
!120 = !DILocation(line: 373, column: 20, scope: !116)
!121 = !DILocation(line: 373, column: 15, scope: !116)
!122 = !DILocation(line: 373, column: 13, scope: !116)
!123 = !DILocation(line: 374, column: 20, scope: !124)
!124 = distinct !DILexicalBlock(scope: !116, file: !9, line: 374, column: 13)
!125 = !DILocation(line: 374, column: 13, scope: !124)
!126 = !DILocation(line: 374, column: 13, scope: !116)
!127 = !DILocation(line: 375, column: 13, scope: !128)
!128 = distinct !DILexicalBlock(scope: !124, file: !9, line: 374, column: 25)
!129 = !DILocation(line: 376, column: 13, scope: !128)
!130 = !DILocation(line: 378, column: 13, scope: !131)
!131 = distinct !DILexicalBlock(scope: !116, file: !9, line: 378, column: 13)
!132 = !DILocation(line: 378, column: 17, scope: !131)
!133 = !DILocation(line: 378, column: 13, scope: !116)
!134 = !DILocation(line: 378, column: 23, scope: !135)
!135 = !DILexicalBlockFile(scope: !131, file: !9, discriminator: 1)
!136 = !DILocation(line: 380, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !116, file: !9, line: 380, column: 13)
!138 = !DILocation(line: 380, column: 26, scope: !137)
!139 = !DILocation(line: 380, column: 41, scope: !137)
!140 = !DILocation(line: 380, column: 13, scope: !137)
!141 = !DILocation(line: 380, column: 49, scope: !137)
!142 = !DILocation(line: 380, column: 46, scope: !137)
!143 = !DILocation(line: 380, column: 13, scope: !116)
!144 = !DILocation(line: 380, column: 68, scope: !145)
!145 = !DILexicalBlockFile(scope: !137, file: !9, discriminator: 1)
!146 = !DILocation(line: 380, column: 60, scope: !145)
!147 = !DILocation(line: 380, column: 54, scope: !148)
!148 = !DILexicalBlockFile(scope: !145, file: !9, discriminator: 2)
!149 = !DILocation(line: 380, column: 54, scope: !145)
!150 = !DILocation(line: 372, column: 5, scope: !151)
!151 = !DILexicalBlockFile(scope: !117, file: !9, discriminator: 1)
!152 = distinct !{!152, !114}
!153 = !DILocation(line: 382, column: 12, scope: !29)
!154 = !DILocation(line: 382, column: 5, scope: !29)
!155 = !DILocation(line: 383, column: 17, scope: !156)
!156 = distinct !DILexicalBlock(scope: !29, file: !9, line: 383, column: 9)
!157 = !DILocation(line: 383, column: 9, scope: !156)
!158 = !DILocation(line: 383, column: 22, scope: !156)
!159 = !DILocation(line: 383, column: 9, scope: !29)
!160 = !DILocation(line: 383, column: 28, scope: !161)
!161 = !DILexicalBlockFile(scope: !156, file: !9, discriminator: 1)
!162 = !DILocation(line: 384, column: 1, scope: !29)
