; ModuleID = './[inter]tools--matdump.o.i'
source_filename = "./[inter]tools--matdump.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.matvar_t = type { i64, i32, i32, i32, i32, i32, i32, i32, i64*, i8*, i8*, i32, i32, %struct.matvar_internal* }
%struct.matvar_internal = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct._mat_t = type opaque
%struct.mat_complex_split_t = type { i8*, i8* }

@.str = private unnamed_addr constant [8 x i8] c"matdump\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [56 x i8] c"matio version in header does not match runtime version\0A\00", align 1
@printfunc = internal global void (%struct.matvar_t*)* null, align 8
@optstring = internal global i8* getelementptr inbounds ([8 x i8], [8 x i8]* @.str.37, i32 0, i32 0), align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !61, globals: !135)
!1 = !DIFile(filename: "[inter]tools--matdump.o.i", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!2 = !{!3, !27, !47, !51, !55}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_types", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../src/matio.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!6 = !DIEnumerator(name: "MAT_T_UNKNOWN", value: 0)
!7 = !DIEnumerator(name: "MAT_T_INT8", value: 1)
!8 = !DIEnumerator(name: "MAT_T_UINT8", value: 2)
!9 = !DIEnumerator(name: "MAT_T_INT16", value: 3)
!10 = !DIEnumerator(name: "MAT_T_UINT16", value: 4)
!11 = !DIEnumerator(name: "MAT_T_INT32", value: 5)
!12 = !DIEnumerator(name: "MAT_T_UINT32", value: 6)
!13 = !DIEnumerator(name: "MAT_T_SINGLE", value: 7)
!14 = !DIEnumerator(name: "MAT_T_DOUBLE", value: 9)
!15 = !DIEnumerator(name: "MAT_T_INT64", value: 12)
!16 = !DIEnumerator(name: "MAT_T_UINT64", value: 13)
!17 = !DIEnumerator(name: "MAT_T_MATRIX", value: 14)
!18 = !DIEnumerator(name: "MAT_T_COMPRESSED", value: 15)
!19 = !DIEnumerator(name: "MAT_T_UTF8", value: 16)
!20 = !DIEnumerator(name: "MAT_T_UTF16", value: 17)
!21 = !DIEnumerator(name: "MAT_T_UTF32", value: 18)
!22 = !DIEnumerator(name: "MAT_T_STRING", value: 20)
!23 = !DIEnumerator(name: "MAT_T_CELL", value: 21)
!24 = !DIEnumerator(name: "MAT_T_STRUCT", value: 22)
!25 = !DIEnumerator(name: "MAT_T_ARRAY", value: 23)
!26 = !DIEnumerator(name: "MAT_T_FUNCTION", value: 24)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_classes", file: !4, line: 107, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!29 = !DIEnumerator(name: "MAT_C_EMPTY", value: 0)
!30 = !DIEnumerator(name: "MAT_C_CELL", value: 1)
!31 = !DIEnumerator(name: "MAT_C_STRUCT", value: 2)
!32 = !DIEnumerator(name: "MAT_C_OBJECT", value: 3)
!33 = !DIEnumerator(name: "MAT_C_CHAR", value: 4)
!34 = !DIEnumerator(name: "MAT_C_SPARSE", value: 5)
!35 = !DIEnumerator(name: "MAT_C_DOUBLE", value: 6)
!36 = !DIEnumerator(name: "MAT_C_SINGLE", value: 7)
!37 = !DIEnumerator(name: "MAT_C_INT8", value: 8)
!38 = !DIEnumerator(name: "MAT_C_UINT8", value: 9)
!39 = !DIEnumerator(name: "MAT_C_INT16", value: 10)
!40 = !DIEnumerator(name: "MAT_C_UINT16", value: 11)
!41 = !DIEnumerator(name: "MAT_C_INT32", value: 12)
!42 = !DIEnumerator(name: "MAT_C_UINT32", value: 13)
!43 = !DIEnumerator(name: "MAT_C_INT64", value: 14)
!44 = !DIEnumerator(name: "MAT_C_UINT64", value: 15)
!45 = !DIEnumerator(name: "MAT_C_FUNCTION", value: 16)
!46 = !DIEnumerator(name: "MAT_C_OPAQUE", value: 17)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_compression", file: !4, line: 145, size: 32, align: 32, elements: !48)
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "MAT_COMPRESSION_NONE", value: 0)
!50 = !DIEnumerator(name: "MAT_COMPRESSION_ZLIB", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mat_acc", file: !4, line: 55, size: 32, align: 32, elements: !52)
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "MAT_ACC_RDONLY", value: 0)
!54 = !DIEnumerator(name: "MAT_ACC_RDWR", value: 1)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "matio_flags", file: !4, line: 133, size: 32, align: 32, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "MAT_F_COMPLEX", value: 2048)
!58 = !DIEnumerator(name: "MAT_F_GLOBAL", value: 1024)
!59 = !DIEnumerator(name: "MAT_F_LOGICAL", value: 512)
!60 = !DIEnumerator(name: "MAT_F_DONT_COPY_DATA", value: 1)
!61 = !{!62, !63, !91, !83, !97, !99, !101, !107, !111, !114, !118, !122, !126, !130, !98, !134, !69, !73}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "matvar_t", file: !4, line: 200, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_t", file: !4, line: 185, size: 640, align: 64, elements: !67)
!67 = !{!68, !72, !74, !75, !76, !77, !78, !79, !80, !82, !85, !86, !87, !88}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !66, file: !4, line: 186, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 216, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!71 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !66, file: !4, line: 187, baseType: !73, size: 32, align: 32, offset: 64)
!73 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !66, file: !4, line: 188, baseType: !3, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !66, file: !4, line: 189, baseType: !73, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "class_type", scope: !66, file: !4, line: 190, baseType: !27, size: 32, align: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "isComplex", scope: !66, file: !4, line: 191, baseType: !73, size: 32, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "isGlobal", scope: !66, file: !4, line: 192, baseType: !73, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "isLogical", scope: !66, file: !4, line: 193, baseType: !73, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !66, file: !4, line: 194, baseType: !81, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !4, line: 195, baseType: !83, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !4, line: 196, baseType: !62, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mem_conserve", scope: !66, file: !4, line: 197, baseType: !73, size: 32, align: 32, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !66, file: !4, line: 198, baseType: !47, size: 32, align: 32, offset: 544)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !66, file: !4, line: 199, baseType: !89, size: 64, align: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "matvar_internal", file: !4, line: 178, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_complex_split_t", file: !4, line: 168, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mat_complex_split_t", file: !4, line: 165, size: 128, align: 64, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Re", scope: !93, file: !4, line: 166, baseType: !62, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Im", scope: !93, file: !4, line: 167, baseType: !62, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int64_t", file: !103, line: 88, baseType: !104)
!103 = !DIFile(filename: "../src/matio_pubconf.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !105, line: 197, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!106 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint64_t", file: !103, line: 91, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !110, line: 55, baseType: !71)
!110 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int32_t", file: !103, line: 94, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !105, line: 196, baseType: !73)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint32_t", file: !103, line: 97, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !110, line: 51, baseType: !117)
!117 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int16_t", file: !103, line: 100, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !105, line: 195, baseType: !121)
!121 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint16_t", file: !103, line: 103, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !110, line: 49, baseType: !125)
!125 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_int8_t", file: !103, line: 106, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !105, line: 194, baseType: !129)
!129 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_uint8_t", file: !103, line: 109, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !110, line: 48, baseType: !133)
!133 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!135 = !{!136, !138, !142, !145, !156, !157, !158, !162, !163}
!136 = distinct !DIGlobalVariable(name: "indent", scope: !0, file: !137, line: 575, type: !73, isLocal: true, isDefinition: true, variable: i32* @indent)
!137 = !DIFile(filename: "matdump.c", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!138 = distinct !DIGlobalVariable(name: "printfunc", scope: !0, file: !137, line: 90, type: !139, isLocal: true, isDefinition: true, variable: void (%struct.matvar_t*)** @printfunc)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !64}
!142 = distinct !DIGlobalVariable(name: "optstring", scope: !0, file: !137, line: 43, type: !143, isLocal: true, isDefinition: true, variable: i8** @optstring)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!145 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !137, line: 44, type: !146, isLocal: true, isDefinition: true, variable: [7 x %struct.option]* @options)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 1792, align: 64, elements: !154)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !148, line: 55, size: 256, align: 64, elements: !149)
!148 = !DIFile(filename: "../getopt/getopt.h", directory: "/home/lichi/Desktop/matio/[task]tools--.libs--matdump")
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 57, baseType: !143, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !147, file: !148, line: 62, baseType: !73, size: 32, align: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !148, line: 64, baseType: !134, size: 64, align: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !147, file: !148, line: 66, baseType: !73, size: 32, align: 32, offset: 192)
!154 = !{!155}
!155 = !DISubrange(count: 7)
!156 = distinct !DIGlobalVariable(name: "printdata", scope: !0, file: !137, line: 82, type: !73, isLocal: true, isDefinition: true, variable: i32* @printdata)
!157 = distinct !DIGlobalVariable(name: "print_whos_first", scope: !0, file: !137, line: 84, type: !73, isLocal: true, isDefinition: true, variable: i32* @print_whos_first)
!158 = distinct !DIGlobalVariable(name: "mxclass", scope: !0, file: !137, line: 75, type: !159, isLocal: true, isDefinition: true, variable: [18 x i8*]* @mxclass)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1152, align: 64, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 18)
!162 = distinct !DIGlobalVariable(name: "human_readable", scope: !0, file: !137, line: 83, type: !73, isLocal: true, isDefinition: true, variable: i32* @human_readable)
!163 = distinct !DIGlobalVariable(name: "helpstr", scope: !0, file: !137, line: 54, type: !159, isLocal: true, isDefinition: true, variable: [18 x i8*]* @helpstr)
!164 = !{i32 2, !"Dwarf Version", i32 4}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!167 = distinct !DISubprogram(name: "main", scope: !137, file: !137, line: 832, type: !168, isLocal: false, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!168 = !DISubroutineType(types: !169)
!169 = !{!73, !73, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!171 = !{}
!172 = !DILocalVariable(name: "argc", arg: 1, scope: !167, file: !137, line: 832, type: !73)
!173 = !DIExpression()
!174 = !DILocation(line: 832, column: 11, scope: !167)
!175 = !DILocalVariable(name: "argv", arg: 2, scope: !167, file: !137, line: 832, type: !170)
!176 = !DILocation(line: 832, column: 23, scope: !167)
!177 = !DILocalVariable(name: "prog_name", scope: !167, file: !137, line: 834, type: !143)
!178 = !DILocation(line: 834, column: 17, scope: !167)
!179 = !DILocalVariable(name: "i", scope: !167, file: !137, line: 835, type: !73)
!180 = !DILocation(line: 835, column: 9, scope: !167)
!181 = !DILocalVariable(name: "c", scope: !167, file: !137, line: 835, type: !73)
!182 = !DILocation(line: 835, column: 12, scope: !167)
!183 = !DILocalVariable(name: "err", scope: !167, file: !137, line: 835, type: !73)
!184 = !DILocation(line: 835, column: 15, scope: !167)
!185 = !DILocalVariable(name: "mat", scope: !167, file: !137, line: 836, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "mat_t", file: !4, line: 175, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mat_t", file: !4, line: 170, flags: DIFlagFwdDecl)
!189 = !DILocation(line: 836, column: 12, scope: !167)
!190 = !DILocalVariable(name: "matvar", scope: !167, file: !137, line: 837, type: !64)
!191 = !DILocation(line: 837, column: 15, scope: !167)
!192 = !DILocalVariable(name: "version", scope: !167, file: !137, line: 838, type: !193)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 96, align: 32, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 3)
!196 = !DILocation(line: 838, column: 9, scope: !167)
!197 = !DILocation(line: 840, column: 27, scope: !167)
!198 = !DILocation(line: 840, column: 36, scope: !167)
!199 = !DILocation(line: 840, column: 43, scope: !167)
!200 = !DILocation(line: 840, column: 47, scope: !167)
!201 = !DILocation(line: 840, column: 54, scope: !167)
!202 = !DILocation(line: 840, column: 5, scope: !167)
!203 = !DILocation(line: 841, column: 15, scope: !204)
!204 = distinct !DILexicalBlock(scope: !167, file: !137, line: 841, column: 10)
!205 = !DILocation(line: 841, column: 12, scope: !204)
!206 = !DILocation(line: 841, column: 26, scope: !204)
