; ModuleID = './libpowerOps_la-powerOps.o.i'
source_filename = "./libpowerOps_la-powerOps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.ToolsPluginSignalCb = type { i8*, i8*, i8* }
%struct.GuestOsStateChangeCmd = type { i32, i8*, i8* }
%struct.ToolsAppCapability = type { i32, i8*, i32, i32 }
%struct.PowerOpState = type { i32, i32, i32, %struct.ToolsAppCtx*, [6 x i32] }
%struct.ToolsAppReg = type { i32, %struct._GArray* }
%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }

!44 = !DIEnumerator(name: "HGFSU_CAP_MAP_DRIVE", value: 13)
!45 = !DIEnumerator(name: "GHI_CAP_SET_HANDLER", value: 14)
!46 = !DIEnumerator(name: "UNITY_CAP_STATUS_UNITY_ACTIVE", value: 15)
!47 = !DIEnumerator(name: "GHI_CAP_SET_OUTLOOK_TEMP_FOLDER", value: 16)
!48 = !DIEnumerator(name: "CAP_SET_TOPO_MODES", value: 18)
!49 = !DIEnumerator(name: "GHI_CAP_TRAY_ICONS", value: 19)
!50 = !DIEnumerator(name: "GHI_CAP_SET_FOCUSED_WINDOW", value: 20)
!51 = !DIEnumerator(name: "GHI_CAP_GET_EXEC_INFO_HASH", value: 21)
!52 = !DIEnumerator(name: "UNITY_CAP_STICKY_WINDOWS", value: 22)
!53 = !DIEnumerator(name: "CAP_CHANGE_HOST_3D_AVAILABILITY_HINT", value: 23)
!54 = !DIEnumerator(name: "CAP_AUTOUPGRADE_AT_SHUTDOWN", value: 24)
!55 = !DIEnumerator(name: "GHI_CAP_AUTOLOGON", value: 25)
!56 = !DIEnumerator(name: "CAP_DESKTOP_AUTOLOCK", value: 26)
!57 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DOWNLOADS", value: 28)
!58 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_MOVIES", value: 29)
!59 = !DIEnumerator(name: "GHI_CAP_TOGGLE_START_UI", value: 30)
!60 = !DIEnumerator(name: "GHI_CAP_SET_DISPLAY_SCALING", value: 31)
!61 = !DIEnumerator(name: "UNITY_CAP_DISABLE_MOUSE_BUTTON_SWAPPING", value: 32)
!62 = !DIEnumerator(name: "UNITY_CAP_CARET_POSITION", value: 33)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 51, size: 32, align: 32, elements: !65)
!64 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74}
!66 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!67 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!68 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!69 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!70 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!71 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!72 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!73 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!74 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 172, size: 32, align: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/glib-2.0/glib/gspawn.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!78 = !DIEnumerator(name: "G_SPAWN_DEFAULT", value: 0)
!79 = !DIEnumerator(name: "G_SPAWN_LEAVE_DESCRIPTORS_OPEN", value: 1)
!80 = !DIEnumerator(name: "G_SPAWN_DO_NOT_REAP_CHILD", value: 2)
!81 = !DIEnumerator(name: "G_SPAWN_SEARCH_PATH", value: 4)
!82 = !DIEnumerator(name: "G_SPAWN_STDOUT_TO_DEV_NULL", value: 8)
!83 = !DIEnumerator(name: "G_SPAWN_STDERR_TO_DEV_NULL", value: 16)
!84 = !DIEnumerator(name: "G_SPAWN_CHILD_INHERITS_STDIN", value: 32)
!85 = !DIEnumerator(name: "G_SPAWN_FILE_AND_ARGV_ZERO", value: 64)
!86 = !DIEnumerator(name: "G_SPAWN_SEARCH_PATH_FROM_ENVP", value: 128)
!87 = !DIEnumerator(name: "G_SPAWN_CLOEXEC_PIPES", value: 256)
!88 = !{!89, !92, !93, !95, !104}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPid", file: !90, line: 183, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!91 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !96, line: 155, baseType: !97)
!96 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !103}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !101, line: 50, baseType: !102)
!101 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !101, line: 49, baseType: !91)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !101, line: 77, baseType: !92)
!104 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !{!106, !112, !172, !189, !200}
!106 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !107, line: 48, type: !108, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!107 = !DIFile(filename: "powerOps.c", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 160, align: 8, elements: !110)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = distinct !DIGlobalVariable(name: "regData", scope: !113, file: !107, line: 526, type: !117, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!113 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !107, file: !107, line: 524, type: !114, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !138}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !119)
!119 = !{!120, !122, !134, !170}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !4, line: 503, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !118, file: !4, line: 508, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !125, line: 37, baseType: !126)
!125 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !125, line: 41, size: 128, align: 64, elements: !127)
!127 = !{!128, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !125, line: 43, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !101, line: 46, baseType: !94)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !125, line: 44, baseType: !132, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !101, line: 55, baseType: !133)
!133 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !118, file: !4, line: 539, baseType: !135, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!100, !138, !168, !103, !169}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !141)
!141 = !{!142, !144, !147, !148, !149, !153, !158, !163, !164, !165, !167}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !140, file: !4, line: 243, baseType: !143, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !4, line: 245, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !140, file: !4, line: 247, baseType: !100, size: 32, align: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !140, file: !4, line: 249, baseType: !91, size: 32, align: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !140, file: !4, line: 251, baseType: !150, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !96, line: 56, baseType: !152)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !96, line: 56, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !140, file: !4, line: 253, baseType: !154, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !156, line: 48, baseType: !157)
!156 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !156, line: 48, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !4, line: 255, baseType: !159, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !161, line: 48, baseType: !162)
!161 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !161, line: 48, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !140, file: !4, line: 261, baseType: !91, size: 32, align: 32, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !140, file: !4, line: 263, baseType: !91, size: 32, align: 32, offset: 416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !140, file: !4, line: 265, baseType: !166, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !140, file: !4, line: 273, baseType: !103, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !118, file: !4, line: 544, baseType: !103, size: 64, align: 64, offset: 192)
!171 = !{}
!172 = distinct !DIGlobalVariable(name: "caps", scope: !173, file: !107, line: 92, type: !176, isLocal: true, isDefinition: true, variable: [2 x %struct.ToolsAppCapability]* @PowerOpsCapabilityCb.caps)
!173 = distinct !DISubprogram(name: "PowerOpsCapabilityCb", scope: !107, file: !107, line: 87, type: !174, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!174 = !DISubroutineType(types: !175)
!175 = !{!123, !103, !138, !100, !103}
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 384, align: 64, elements: !187)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCapability", file: !4, line: 333, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCapability", file: !4, line: 318, size: 192, align: 64, elements: !180)
!180 = !{!181, !183, !184, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !4, line: 320, baseType: !182, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCapabilityType", file: !4, line: 307, baseType: !23)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !4, line: 325, baseType: !145, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !179, file: !4, line: 330, baseType: !185, size: 32, align: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestCapabilities", file: !29, line: 79, baseType: !28)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !179, file: !4, line: 332, baseType: !132, size: 32, align: 32, offset: 160)
!187 = !{!188}
!188 = !DISubrange(count: 2)
!189 = distinct !DIGlobalVariable(name: "stateChangeCmdTable", scope: !0, file: !14, line: 66, type: !190, isLocal: true, isDefinition: true, variable: [5 x %struct.GuestOsStateChangeCmd]* @stateChangeCmdTable)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 960, align: 64, elements: !198)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestOsStateChangeCmd", file: !14, line: 60, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GuestOsStateChangeCmd", file: !14, line: 56, size: 192, align: 64, elements: !194)
!194 = !{!195, !196, !197}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !193, file: !14, line: 57, baseType: !133, size: 32, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !14, line: 58, baseType: !121, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tcloCmd", scope: !193, file: !14, line: 59, baseType: !121, size: 64, align: 64, offset: 128)
!198 = !{!199}
!199 = !DISubrange(count: 5)
!200 = distinct !DIGlobalVariable(name: "stateChgConfNames", scope: !0, file: !107, line: 51, type: !201, isLocal: true, isDefinition: true, variable: [6 x i8*]* @stateChgConfNames)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 384, align: 64, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 6)
!204 = !{i32 2, !"Dwarf Version", i32 4}
!205 = !{i32 2, !"Debug Info Version", i32 3}
!206 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!207 = !DILocalVariable(name: "ctx", arg: 1, scope: !113, file: !107, line: 524, type: !138)
!208 = !DIExpression()
!209 = !DILocation(line: 524, column: 26, scope: !113)
!210 = !DILocalVariable(name: "i", scope: !113, file: !107, line: 532, type: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !212, line: 216, baseType: !213)
!212 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!213 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!214 = !DILocation(line: 532, column: 11, scope: !113)
!215 = !DILocalVariable(name: "state", scope: !113, file: !107, line: 533, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PowerOpState", file: !107, line: 72, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PowerOpState", file: !107, line: 62, size: 384, align: 64, elements: !219)
!219 = !{!220, !222, !223, !224, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stateChgInProgress", scope: !218, file: !107, line: 63, baseType: !221, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestOsState", file: !14, line: 50, baseType: !13)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lastFailedStateChg", scope: !218, file: !107, line: 64, baseType: !221, size: 32, align: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !218, file: !107, line: 68, baseType: !89, size: 32, align: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !218, file: !107, line: 70, baseType: !138, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scriptEnabled", scope: !218, file: !107, line: 71, baseType: !226, size: 192, align: 32, offset: 192)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 192, align: 32, elements: !202)
!227 = !DILocation(line: 533, column: 18, scope: !113)
!228 = !DILocalVariable(name: "sigs", scope: !113, file: !107, line: 535, type: !229)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 576, align: 64, elements: !236)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !4, line: 484, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !4, line: 480, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !231, file: !4, line: 481, baseType: !145, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !231, file: !4, line: 482, baseType: !103, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !231, file: !4, line: 483, baseType: !103, size: 64, align: 64, offset: 128)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DILocation(line: 535, column: 24, scope: !113)
!239 = !DILocalVariable(name: "regs", scope: !113, file: !107, line: 540, type: !240)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 256, align: 64, elements: !187)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !4, line: 450, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !4, line: 447, size: 128, align: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !4, line: 448, baseType: !168, size: 32, align: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !4, line: 449, baseType: !123, size: 64, align: 64, offset: 64)
!246 = !DILocation(line: 540, column: 16, scope: !113)
!247 = !DILocation(line: 540, column: 25, scope: !113)
!248 = !DILocation(line: 541, column: 7, scope: !113)
!249 = !DILocation(line: 542, column: 7, scope: !113)
!250 = !DILocation(line: 542, column: 46, scope: !113)
!251 = !DILocation(line: 542, column: 28, scope: !113)
!252 = !DILocation(line: 545, column: 12, scope: !113)
!253 = !DILocation(line: 545, column: 10, scope: !113)
!254 = !DILocation(line: 546, column: 17, scope: !113)
!255 = !DILocation(line: 546, column: 4, scope: !113)
!256 = !DILocation(line: 546, column: 11, scope: !113)
!257 = !DILocation(line: 546, column: 15, scope: !113)
!258 = !DILocation(line: 547, column: 4, scope: !113)
!259 = !DILocation(line: 547, column: 11, scope: !113)
!260 = !DILocation(line: 547, column: 15, scope: !113)
!261 = !DILocation(line: 549, column: 11, scope: !262)
!262 = distinct !DILexicalBlock(scope: !113, file: !107, line: 549, column: 4)
!263 = !DILocation(line: 549, column: 9, scope: !262)
!264 = !DILocation(line: 549, column: 16, scope: !265)
!265 = !DILexicalBlockFile(scope: !266, file: !107, discriminator: 1)
!266 = distinct !DILexicalBlock(scope: !262, file: !107, line: 549, column: 4)
!267 = !DILocation(line: 549, column: 18, scope: !265)
!268 = !DILocation(line: 549, column: 4, scope: !265)
!269 = !DILocation(line: 550, column: 28, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !107, line: 549, column: 51)
!271 = !DILocation(line: 550, column: 7, scope: !270)
!272 = !DILocation(line: 550, column: 14, scope: !270)
!273 = !DILocation(line: 550, column: 31, scope: !270)
!274 = !DILocation(line: 551, column: 4, scope: !270)
!275 = !DILocation(line: 549, column: 47, scope: !276)
!276 = !DILexicalBlockFile(scope: !266, file: !107, discriminator: 2)
!277 = !DILocation(line: 549, column: 4, scope: !276)
!278 = distinct !{!278, !279}
!279 = !DILocation(line: 549, column: 4, scope: !113)
!280 = !DILocation(line: 553, column: 19, scope: !113)
!281 = !DILocation(line: 553, column: 4, scope: !113)
!282 = !DILocation(line: 553, column: 12, scope: !113)
!283 = !DILocation(line: 553, column: 17, scope: !113)
!284 = !DILocation(line: 558, column: 11, scope: !285)
!285 = distinct !DILexicalBlock(scope: !113, file: !107, line: 558, column: 4)
!286 = !DILocation(line: 558, column: 9, scope: !285)
!287 = !DILocation(line: 558, column: 16, scope: !288)
!288 = !DILexicalBlockFile(scope: !289, file: !107, discriminator: 1)
!289 = distinct !DILexicalBlock(scope: !285, file: !107, line: 558, column: 4)
!290 = !DILocation(line: 558, column: 18, scope: !288)
!291 = !DILocation(line: 558, column: 4, scope: !288)
!292 = !DILocalVariable(name: "cb", scope: !293, file: !107, line: 559, type: !294)
!293 = distinct !DILexicalBlock(scope: !289, file: !107, line: 558, column: 89)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !156, line: 115, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !156, line: 94, size: 384, align: 64, elements: !296)
!296 = !{!297, !298, !315, !316, !317, !318}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !156, line: 96, baseType: !121, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !295, file: !156, line: 98, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !156, line: 90, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!100, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !156, line: 77, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !156, line: 51, size: 512, align: 64, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !156, line: 53, baseType: !121, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !305, file: !156, line: 58, baseType: !121, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !305, file: !156, line: 60, baseType: !211, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !305, file: !156, line: 65, baseType: !93, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !305, file: !156, line: 67, baseType: !211, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !305, file: !156, line: 72, baseType: !100, size: 32, align: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !305, file: !156, line: 74, baseType: !92, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !305, file: !156, line: 76, baseType: !92, size: 64, align: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !295, file: !156, line: 100, baseType: !103, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !295, file: !156, line: 102, baseType: !103, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !295, file: !156, line: 109, baseType: !103, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !295, file: !156, line: 114, baseType: !211, size: 64, align: 64, offset: 320)
!319 = !DILocation(line: 559, column: 26, scope: !293)
!320 = !DILocation(line: 559, column: 31, scope: !293)
!321 = !DILocation(line: 559, column: 53, scope: !293)
!322 = !DILocation(line: 559, column: 33, scope: !293)
!323 = !DILocation(line: 559, column: 56, scope: !293)
!324 = !DILocation(line: 561, column: 33, scope: !293)
!325 = !DILocation(line: 562, column: 28, scope: !293)
!326 = !DILocation(line: 562, column: 36, scope: !293)
!327 = !DILocation(line: 562, column: 42, scope: !293)
!328 = !DILocation(line: 562, column: 7, scope: !293)
!329 = !DILocation(line: 563, column: 4, scope: !293)
!330 = !DILocation(line: 558, column: 85, scope: !331)
!331 = !DILexicalBlockFile(scope: !289, file: !107, discriminator: 2)
!332 = !DILocation(line: 558, column: 4, scope: !331)
!333 = distinct !{!333, !334}
!334 = !DILocation(line: 558, column: 4, scope: !113)
!335 = !DILocation(line: 565, column: 37, scope: !113)
!336 = !DILocation(line: 565, column: 19, scope: !113)
!337 = !DILocation(line: 565, column: 17, scope: !113)
!338 = !DILocation(line: 566, column: 23, scope: !113)
!339 = !DILocation(line: 566, column: 21, scope: !113)
!340 = !DILocation(line: 567, column: 4, scope: !113)
!341 = !DILocalVariable(name: "src", arg: 1, scope: !173, file: !107, line: 87, type: !103)
!342 = !DILocation(line: 87, column: 31, scope: !173)
!343 = !DILocalVariable(name: "ctx", arg: 2, scope: !173, file: !107, line: 88, type: !138)
!344 = !DILocation(line: 88, column: 35, scope: !173)
!345 = !DILocalVariable(name: "set", arg: 3, scope: !173, file: !107, line: 89, type: !100)
!346 = !DILocation(line: 89, column: 31, scope: !173)
!347 = !DILocalVariable(name: "data", arg: 4, scope: !173, file: !107, line: 90, type: !103)
!348 = !DILocation(line: 90, column: 31, scope: !173)
!349 = !DILocation(line: 97, column: 11, scope: !173)
!350 = !DILocation(line: 97, column: 4, scope: !173)
!351 = distinct !DISubprogram(name: "PowerOpsSetOption", scope: !107, file: !107, line: 114, type: !352, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!352 = !DISubroutineType(types: !353)
!353 = !{!100, !103, !138, !145, !145, !116}
!354 = !DILocalVariable(name: "src", arg: 1, scope: !351, file: !107, line: 114, type: !103)
!355 = !DILocation(line: 114, column: 28, scope: !351)
!356 = !DILocalVariable(name: "ctx", arg: 2, scope: !351, file: !107, line: 115, type: !138)
!357 = !DILocation(line: 115, column: 32, scope: !351)
!358 = !DILocalVariable(name: "option", arg: 3, scope: !351, file: !107, line: 116, type: !145)
!359 = !DILocation(line: 116, column: 32, scope: !351)
!360 = !DILocalVariable(name: "value", arg: 4, scope: !351, file: !107, line: 117, type: !145)
!361 = !DILocation(line: 117, column: 32, scope: !351)
!362 = !DILocalVariable(name: "plugin", arg: 5, scope: !351, file: !107, line: 118, type: !116)
!363 = !DILocation(line: 118, column: 36, scope: !351)
!364 = !DILocalVariable(name: "enabled", scope: !351, file: !107, line: 120, type: !100)
!365 = !DILocation(line: 120, column: 13, scope: !351)
!366 = !DILocalVariable(name: "state", scope: !351, file: !107, line: 121, type: !216)
!367 = !DILocation(line: 121, column: 18, scope: !351)
!368 = !DILocation(line: 121, column: 26, scope: !351)
!369 = !DILocation(line: 121, column: 34, scope: !351)
!370 = !DILocation(line: 123, column: 15, scope: !371)
!371 = distinct !DILexicalBlock(scope: !351, file: !107, line: 123, column: 8)
!372 = !DILocation(line: 123, column: 8, scope: !371)
!373 = !DILocation(line: 123, column: 27, scope: !371)
!374 = !DILocation(line: 123, column: 32, scope: !371)
!375 = !DILocation(line: 123, column: 42, scope: !376)
!376 = !DILexicalBlockFile(scope: !371, file: !107, discriminator: 1)
!377 = !DILocation(line: 123, column: 35, scope: !376)
!378 = !DILocation(line: 123, column: 54, scope: !376)
!379 = !DILocation(line: 123, column: 8, scope: !376)
!380 = !DILocation(line: 124, column: 7, scope: !381)
!381 = distinct !DILexicalBlock(scope: !371, file: !107, line: 123, column: 60)
!382 = !DILocation(line: 127, column: 22, scope: !351)
!383 = !DILocation(line: 127, column: 15, scope: !351)
!384 = !DILocation(line: 127, column: 34, scope: !351)
!385 = !DILocation(line: 127, column: 12, scope: !351)
!386 = !DILocation(line: 129, column: 15, scope: !387)
!387 = distinct !DILexicalBlock(scope: !351, file: !107, line: 129, column: 8)
!388 = !DILocation(line: 129, column: 8, scope: !387)
!389 = !DILocation(line: 129, column: 51, scope: !387)
!390 = !DILocation(line: 129, column: 8, scope: !351)
!391 = !DILocation(line: 130, column: 59, scope: !392)
!392 = distinct !DILexicalBlock(scope: !387, file: !107, line: 129, column: 57)
!393 = !DILocation(line: 130, column: 7, scope: !392)
!394 = !DILocation(line: 130, column: 14, scope: !392)
!395 = !DILocation(line: 130, column: 57, scope: !392)
!396 = !DILocation(line: 131, column: 4, scope: !392)
!397 = !DILocation(line: 131, column: 22, scope: !398)
!398 = !DILexicalBlockFile(scope: !399, file: !107, discriminator: 1)
!399 = distinct !DILexicalBlock(scope: !387, file: !107, line: 131, column: 15)
!400 = !DILocation(line: 131, column: 15, scope: !398)
!401 = !DILocation(line: 131, column: 60, scope: !398)
!402 = !DILocation(line: 133, column: 61, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !107, line: 131, column: 66)
!404 = !DILocation(line: 133, column: 10, scope: !403)
!405 = !DILocation(line: 133, column: 17, scope: !403)
!406 = !DILocation(line: 133, column: 59, scope: !403)
!407 = !DILocation(line: 132, column: 7, scope: !403)
!408 = !DILocation(line: 132, column: 14, scope: !403)
!409 = !DILocation(line: 132, column: 54, scope: !403)
!410 = !DILocation(line: 134, column: 4, scope: !403)
!411 = !DILocation(line: 134, column: 22, scope: !412)
!412 = !DILexicalBlockFile(scope: !413, file: !107, discriminator: 1)
!413 = distinct !DILexicalBlock(scope: !399, file: !107, line: 134, column: 15)
!414 = !DILocation(line: 134, column: 15, scope: !412)
!415 = !DILocation(line: 134, column: 59, scope: !412)
!416 = !DILocation(line: 135, column: 59, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !107, line: 134, column: 65)
!418 = !DILocation(line: 135, column: 7, scope: !417)
!419 = !DILocation(line: 135, column: 14, scope: !417)
!420 = !DILocation(line: 135, column: 57, scope: !417)
!421 = !DILocation(line: 136, column: 4, scope: !417)
!422 = !DILocation(line: 136, column: 22, scope: !423)
!423 = !DILexicalBlockFile(scope: !424, file: !107, discriminator: 1)
!424 = distinct !DILexicalBlock(scope: !413, file: !107, line: 136, column: 15)
!425 = !DILocation(line: 136, column: 15, scope: !423)
!426 = !DILocation(line: 136, column: 57, scope: !423)
!427 = !DILocation(line: 137, column: 58, scope: !428)
!428 = distinct !DILexicalBlock(scope: !424, file: !107, line: 136, column: 63)
!429 = !DILocation(line: 137, column: 7, scope: !428)
!430 = !DILocation(line: 137, column: 14, scope: !428)
!431 = !DILocation(line: 137, column: 56, scope: !428)
!432 = !DILocation(line: 138, column: 4, scope: !428)
!433 = !DILocation(line: 139, column: 7, scope: !434)
!434 = distinct !DILexicalBlock(scope: !424, file: !107, line: 138, column: 11)
!435 = !DILocation(line: 142, column: 4, scope: !351)
!436 = !DILocation(line: 143, column: 1, scope: !351)
!437 = distinct !DISubprogram(name: "PowerOpsShutdown", scope: !107, file: !107, line: 155, type: !438, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !103, !138, !116}
!440 = !DILocalVariable(name: "src", arg: 1, scope: !437, file: !107, line: 155, type: !103)
!441 = !DILocation(line: 155, column: 27, scope: !437)
!442 = !DILocalVariable(name: "ctx", arg: 2, scope: !437, file: !107, line: 156, type: !138)
!443 = !DILocation(line: 156, column: 31, scope: !437)
!444 = !DILocalVariable(name: "plugin", arg: 3, scope: !437, file: !107, line: 157, type: !116)
!445 = !DILocation(line: 157, column: 35, scope: !437)
!446 = !DILocalVariable(name: "state", scope: !437, file: !107, line: 159, type: !216)
!447 = !DILocation(line: 159, column: 18, scope: !437)
!448 = !DILocation(line: 159, column: 26, scope: !437)
!449 = !DILocation(line: 159, column: 34, scope: !437)
!450 = !DILocation(line: 160, column: 11, scope: !437)
!451 = !DILocation(line: 160, column: 4, scope: !437)
!452 = !DILocation(line: 161, column: 1, scope: !437)
!453 = distinct !DISubprogram(name: "PowerOpsStateChange", scope: !107, file: !107, line: 416, type: !301, isLocal: true, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!454 = !DILocalVariable(name: "data", arg: 1, scope: !453, file: !107, line: 416, type: !303)
!455 = !DILocation(line: 416, column: 32, scope: !453)
!456 = !DILocalVariable(name: "i", scope: !453, file: !107, line: 418, type: !211)
!457 = !DILocation(line: 418, column: 11, scope: !453)
!458 = !DILocalVariable(name: "state", scope: !453, file: !107, line: 419, type: !216)
!459 = !DILocation(line: 419, column: 18, scope: !453)
!460 = !DILocation(line: 419, column: 26, scope: !453)
!461 = !DILocation(line: 419, column: 32, scope: !453)
!462 = !DILocation(line: 421, column: 8, scope: !463)
!463 = distinct !DILexicalBlock(scope: !453, file: !107, line: 421, column: 8)
!464 = !DILocation(line: 421, column: 15, scope: !463)
!465 = !DILocation(line: 421, column: 19, scope: !463)
!466 = !DILocation(line: 421, column: 8, scope: !453)
!467 = !DILocation(line: 422, column: 7, scope: !468)
!468 = distinct !DILexicalBlock(scope: !463, file: !107, line: 421, column: 33)
!469 = !DILocation(line: 423, column: 36, scope: !468)
!470 = !DILocation(line: 423, column: 14, scope: !468)
!471 = !DILocation(line: 423, column: 7, scope: !468)
!472 = !DILocation(line: 426, column: 64, scope: !453)
!473 = !DILocation(line: 426, column: 70, scope: !453)
!474 = !DILocation(line: 426, column: 4, scope: !453)
!475 = !DILocation(line: 428, column: 11, scope: !476)
!476 = distinct !DILexicalBlock(scope: !453, file: !107, line: 428, column: 4)
!477 = !DILocation(line: 428, column: 9, scope: !476)
!478 = !DILocation(line: 428, column: 16, scope: !479)
!479 = !DILexicalBlockFile(scope: !480, file: !107, discriminator: 1)
!480 = distinct !DILexicalBlock(scope: !476, file: !107, line: 428, column: 4)
!481 = !DILocation(line: 428, column: 18, scope: !479)
!482 = !DILocation(line: 428, column: 4, scope: !479)
!483 = !DILocation(line: 429, column: 18, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !107, line: 429, column: 11)
!485 = distinct !DILexicalBlock(scope: !480, file: !107, line: 428, column: 89)
!486 = !DILocation(line: 429, column: 24, scope: !484)
!487 = !DILocation(line: 429, column: 50, scope: !484)
!488 = !DILocation(line: 429, column: 30, scope: !484)
!489 = !DILocation(line: 429, column: 53, scope: !484)
!490 = !DILocation(line: 429, column: 11, scope: !484)
!491 = !DILocation(line: 429, column: 62, scope: !484)
!492 = !DILocation(line: 429, column: 11, scope: !485)
!493 = !DILocalVariable(name: "script", scope: !494, file: !107, line: 430, type: !129)
!494 = distinct !DILexicalBlock(scope: !484, file: !107, line: 429, column: 68)
!495 = !DILocation(line: 430, column: 17, scope: !494)
!496 = !DILocalVariable(name: "result", scope: !494, file: !107, line: 431, type: !121)
!497 = !DILocation(line: 431, column: 22, scope: !494)
!498 = !DILocalVariable(name: "confName", scope: !494, file: !107, line: 432, type: !121)
!499 = !DILocation(line: 432, column: 22, scope: !494)
!500 = !DILocalVariable(name: "ret", scope: !494, file: !107, line: 433, type: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !502, line: 230, baseType: !94)
!502 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!503 = !DILocation(line: 433, column: 15, scope: !494)
!504 = !DILocation(line: 435, column: 58, scope: !494)
!505 = !DILocation(line: 435, column: 38, scope: !494)
!506 = !DILocation(line: 435, column: 61, scope: !494)
!507 = !DILocation(line: 435, column: 10, scope: !494)
!508 = !DILocation(line: 435, column: 17, scope: !494)
!509 = !DILocation(line: 435, column: 36, scope: !494)
!510 = !DILocation(line: 438, column: 56, scope: !511)
!511 = distinct !DILexicalBlock(scope: !494, file: !107, line: 438, column: 14)
!512 = !DILocation(line: 438, column: 36, scope: !511)
!513 = !DILocation(line: 438, column: 59, scope: !511)
!514 = !DILocation(line: 438, column: 15, scope: !511)
!515 = !DILocation(line: 438, column: 22, scope: !511)
!516 = !DILocation(line: 438, column: 14, scope: !494)
!517 = !DILocation(line: 439, column: 37, scope: !518)
!518 = distinct !DILexicalBlock(scope: !511, file: !107, line: 438, column: 64)
!519 = !DILocation(line: 439, column: 13, scope: !518)
!520 = !DILocation(line: 440, column: 112, scope: !518)
!521 = !DILocation(line: 440, column: 92, scope: !518)
!522 = !DILocation(line: 440, column: 115, scope: !518)
!523 = !DILocation(line: 440, column: 13, scope: !518)
!524 = !DILocation(line: 442, column: 42, scope: !518)
!525 = !DILocation(line: 442, column: 20, scope: !518)
!526 = !DILocation(line: 442, column: 13, scope: !518)
!527 = !DILocation(line: 445, column: 59, scope: !494)
!528 = !DILocation(line: 445, column: 39, scope: !494)
!529 = !DILocation(line: 445, column: 62, scope: !494)
!530 = !DILocation(line: 445, column: 21, scope: !494)
!531 = !DILocation(line: 445, column: 19, scope: !494)
!532 = !DILocation(line: 446, column: 41, scope: !494)
!533 = !DILocation(line: 446, column: 48, scope: !494)
!534 = !DILocation(line: 446, column: 53, scope: !494)
!535 = !DILocation(line: 448, column: 41, scope: !494)
!536 = !DILocation(line: 446, column: 19, scope: !494)
!537 = !DILocation(line: 446, column: 17, scope: !494)
!538 = !DILocation(line: 451, column: 14, scope: !539)
!539 = distinct !DILexicalBlock(scope: !494, file: !107, line: 451, column: 14)
!540 = !DILocation(line: 451, column: 21, scope: !539)
!541 = !DILocation(line: 451, column: 14, scope: !494)
!542 = !DILocalVariable(name: "dfltScript", scope: !543, file: !107, line: 453, type: !121)
!543 = distinct !DILexicalBlock(scope: !539, file: !107, line: 451, column: 29)
!544 = !DILocation(line: 453, column: 25, scope: !543)
!545 = !DILocation(line: 453, column: 64, scope: !543)
!546 = !DILocation(line: 453, column: 38, scope: !543)
!547 = !DILocation(line: 454, column: 17, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !107, line: 454, column: 17)
!549 = !DILocation(line: 454, column: 28, scope: !548)
!550 = !DILocation(line: 454, column: 17, scope: !543)
!551 = !DILocation(line: 455, column: 125, scope: !552)
!552 = distinct !DILexicalBlock(scope: !548, file: !107, line: 454, column: 36)
!553 = !DILocation(line: 455, column: 105, scope: !552)
!554 = !DILocation(line: 455, column: 128, scope: !552)
!555 = !DILocation(line: 455, column: 16, scope: !552)
!556 = !DILocation(line: 457, column: 40, scope: !552)
!557 = !DILocation(line: 457, column: 16, scope: !552)
!558 = !DILocation(line: 458, column: 45, scope: !552)
!559 = !DILocation(line: 458, column: 23, scope: !552)
!560 = !DILocation(line: 458, column: 16, scope: !552)
!561 = !DILocation(line: 460, column: 31, scope: !543)
!562 = !DILocation(line: 460, column: 22, scope: !543)
!563 = !DILocation(line: 460, column: 20, scope: !543)
!564 = !DILocation(line: 461, column: 10, scope: !543)
!565 = !DILocation(line: 461, column: 28, scope: !566)
!566 = !DILexicalBlockFile(scope: !567, file: !107, discriminator: 1)
!567 = distinct !DILexicalBlock(scope: !539, file: !107, line: 461, column: 21)
!568 = !DILocation(line: 461, column: 21, scope: !566)
!569 = !DILocation(line: 461, column: 36, scope: !566)
!570 = !DILocation(line: 462, column: 114, scope: !571)
!571 = distinct !DILexicalBlock(scope: !567, file: !107, line: 461, column: 42)
!572 = !DILocation(line: 462, column: 94, scope: !571)
!573 = !DILocation(line: 462, column: 117, scope: !571)
!574 = !DILocation(line: 462, column: 13, scope: !571)
!575 = !DILocation(line: 464, column: 20, scope: !571)
!576 = !DILocation(line: 464, column: 13, scope: !571)
!577 = !DILocation(line: 465, column: 37, scope: !571)
!578 = !DILocation(line: 465, column: 13, scope: !571)
!579 = !DILocation(line: 466, column: 42, scope: !571)
!580 = !DILocation(line: 466, column: 20, scope: !571)
!581 = !DILocation(line: 466, column: 13, scope: !571)
!582 = !DILocation(line: 470, column: 34, scope: !583)
!583 = distinct !DILexicalBlock(scope: !494, file: !107, line: 470, column: 14)
!584 = !DILocation(line: 470, column: 15, scope: !583)
!585 = !DILocation(line: 470, column: 14, scope: !494)
!586 = !DILocalVariable(name: "dfltPath", scope: !587, file: !107, line: 471, type: !93)
!587 = distinct !DILexicalBlock(scope: !583, file: !107, line: 470, column: 43)
!588 = !DILocation(line: 471, column: 19, scope: !587)
!589 = !DILocalVariable(name: "tmp", scope: !587, file: !107, line: 472, type: !93)
!590 = !DILocation(line: 472, column: 19, scope: !587)
!591 = !DILocation(line: 474, column: 24, scope: !587)
!592 = !DILocation(line: 474, column: 22, scope: !587)
!593 = !DILocation(line: 484, column: 17, scope: !594)
!594 = distinct !DILexicalBlock(scope: !587, file: !107, line: 484, column: 17)
!595 = !DILocation(line: 484, column: 27, scope: !594)
!596 = !DILocation(line: 484, column: 17, scope: !587)
!597 = !DILocation(line: 485, column: 31, scope: !598)
!598 = distinct !DILexicalBlock(scope: !594, file: !107, line: 484, column: 35)
!599 = !DILocation(line: 485, column: 24, scope: !598)
!600 = !DILocation(line: 485, column: 39, scope: !598)
!601 = !DILocation(line: 485, column: 17, scope: !598)
!602 = !DILocation(line: 485, column: 44, scope: !598)
!603 = !DILocation(line: 486, column: 49, scope: !598)
!604 = !DILocation(line: 486, column: 64, scope: !598)
!605 = !DILocation(line: 486, column: 71, scope: !598)
!606 = !DILocation(line: 486, column: 23, scope: !598)
!607 = !DILocation(line: 486, column: 21, scope: !598)
!608 = !DILocation(line: 487, column: 13, scope: !598)
!609 = !DILocation(line: 488, column: 48, scope: !610)
!610 = distinct !DILexicalBlock(scope: !594, file: !107, line: 487, column: 20)
!611 = !DILocation(line: 488, column: 63, scope: !610)
!612 = !DILocation(line: 488, column: 22, scope: !610)
!613 = !DILocation(line: 488, column: 20, scope: !610)
!614 = !DILocation(line: 491, column: 20, scope: !587)
!615 = !DILocation(line: 491, column: 13, scope: !587)
!616 = !DILocation(line: 492, column: 21, scope: !587)
!617 = !DILocation(line: 492, column: 13, scope: !587)
!618 = !DILocation(line: 493, column: 22, scope: !587)
!619 = !DILocation(line: 493, column: 20, scope: !587)
!620 = !DILocation(line: 494, column: 10, scope: !587)
!621 = !DILocation(line: 496, column: 32, scope: !622)
!622 = distinct !DILexicalBlock(scope: !494, file: !107, line: 496, column: 14)
!623 = !DILocation(line: 496, column: 39, scope: !622)
!624 = !DILocation(line: 496, column: 14, scope: !622)
!625 = !DILocation(line: 496, column: 14, scope: !494)
!626 = !DILocation(line: 497, column: 20, scope: !627)
!627 = distinct !DILexicalBlock(scope: !622, file: !107, line: 496, column: 48)
!628 = !DILocation(line: 498, column: 17, scope: !627)
!629 = !DILocation(line: 499, column: 10, scope: !627)
!630 = !DILocation(line: 500, column: 37, scope: !631)
!631 = distinct !DILexicalBlock(scope: !622, file: !107, line: 499, column: 17)
!632 = !DILocation(line: 500, column: 13, scope: !631)
!633 = !DILocation(line: 501, column: 20, scope: !631)
!634 = !DILocation(line: 502, column: 17, scope: !631)
!635 = !DILocation(line: 505, column: 17, scope: !494)
!636 = !DILocation(line: 505, column: 10, scope: !494)
!637 = !DILocation(line: 506, column: 39, scope: !494)
!638 = !DILocation(line: 506, column: 54, scope: !494)
!639 = !DILocation(line: 506, column: 62, scope: !494)
!640 = !DILocation(line: 506, column: 17, scope: !494)
!641 = !DILocation(line: 506, column: 10, scope: !494)
!642 = !DILocation(line: 508, column: 4, scope: !485)
!643 = !DILocation(line: 428, column: 85, scope: !644)
!644 = !DILexicalBlockFile(scope: !480, file: !107, discriminator: 2)
!645 = !DILocation(line: 428, column: 4, scope: !644)
!646 = distinct !{!646, !647}
!647 = !DILocation(line: 428, column: 4, scope: !453)
!648 = !DILocation(line: 510, column: 4, scope: !453)
!649 = !DILocation(line: 511, column: 33, scope: !453)
!650 = !DILocation(line: 511, column: 11, scope: !453)
!651 = !DILocation(line: 511, column: 4, scope: !453)
!652 = !DILocation(line: 512, column: 1, scope: !453)
!653 = distinct !DISubprogram(name: "PowerOpsStateChangeDone", scope: !107, file: !107, line: 176, type: !654, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !216, !100}
!656 = !DILocalVariable(name: "state", arg: 1, scope: !653, file: !107, line: 176, type: !216)
!657 = !DILocation(line: 176, column: 39, scope: !653)
!658 = !DILocalVariable(name: "success", arg: 2, scope: !653, file: !107, line: 177, type: !100)
!659 = !DILocation(line: 177, column: 34, scope: !653)
!660 = !DILocalVariable(name: "msg", scope: !653, file: !107, line: 179, type: !129)
!661 = !DILocation(line: 179, column: 11, scope: !653)
!662 = !DILocation(line: 181, column: 84, scope: !653)
!663 = !DILocation(line: 181, column: 4, scope: !653)
!664 = !DILocation(line: 188, column: 8, scope: !665)
!665 = distinct !DILexicalBlock(scope: !653, file: !107, line: 188, column: 8)
!666 = !DILocation(line: 188, column: 16, scope: !665)
!667 = !DILocation(line: 188, column: 19, scope: !668)
!668 = !DILexicalBlockFile(scope: !665, file: !107, discriminator: 1)
!669 = !DILocation(line: 188, column: 26, scope: !668)
!670 = !DILocation(line: 188, column: 48, scope: !668)
!671 = !DILocation(line: 188, column: 55, scope: !668)
!672 = !DILocation(line: 188, column: 45, scope: !668)
!673 = !DILocation(line: 188, column: 8, scope: !668)
!674 = !DILocation(line: 189, column: 15, scope: !675)
!675 = distinct !DILexicalBlock(scope: !665, file: !107, line: 188, column: 75)
!676 = !DILocation(line: 190, column: 7, scope: !675)
!677 = !DILocation(line: 190, column: 14, scope: !675)
!678 = !DILocation(line: 190, column: 33, scope: !675)
!679 = !DILocation(line: 191, column: 4, scope: !675)
!680 = !DILocation(line: 193, column: 9, scope: !681)
!681 = distinct !DILexicalBlock(scope: !653, file: !107, line: 193, column: 8)
!682 = !DILocation(line: 193, column: 8, scope: !653)
!683 = !DILocation(line: 194, column: 35, scope: !684)
!684 = distinct !DILexicalBlock(scope: !681, file: !107, line: 193, column: 18)
!685 = !DILocation(line: 194, column: 42, scope: !684)
!686 = !DILocation(line: 194, column: 7, scope: !684)
!687 = !DILocation(line: 194, column: 14, scope: !684)
!688 = !DILocation(line: 194, column: 33, scope: !684)
!689 = !DILocation(line: 195, column: 4, scope: !684)
!690 = !DILocation(line: 199, column: 26, scope: !653)
!691 = !DILocation(line: 200, column: 26, scope: !653)
!692 = !DILocation(line: 200, column: 33, scope: !653)
!693 = !DILocation(line: 198, column: 10, scope: !653)
!694 = !DILocation(line: 198, column: 8, scope: !653)
!695 = !DILocation(line: 201, column: 25, scope: !696)
!696 = distinct !DILexicalBlock(scope: !653, file: !107, line: 201, column: 8)
!697 = !DILocation(line: 201, column: 32, scope: !696)
!698 = !DILocation(line: 201, column: 37, scope: !696)
!699 = !DILocation(line: 201, column: 42, scope: !696)
!700 = !DILocation(line: 201, column: 54, scope: !696)
!701 = !DILocation(line: 201, column: 47, scope: !696)
!702 = !DILocation(line: 201, column: 59, scope: !696)
!703 = !DILocation(line: 201, column: 9, scope: !704)
!704 = !DILexicalBlockFile(scope: !696, file: !107, discriminator: 1)
!705 = !DILocation(line: 201, column: 9, scope: !696)
!706 = !DILocation(line: 201, column: 8, scope: !653)
!707 = !DILocation(line: 202, column: 7, scope: !708)
!708 = distinct !DILexicalBlock(scope: !696, file: !107, line: 201, column: 76)
!709 = !DILocation(line: 203, column: 4, scope: !708)
!710 = !DILocation(line: 205, column: 11, scope: !653)
!711 = !DILocation(line: 205, column: 4, scope: !653)
!712 = !DILocation(line: 208, column: 8, scope: !713)
!713 = distinct !DILexicalBlock(scope: !653, file: !107, line: 208, column: 8)
!714 = !DILocation(line: 208, column: 8, scope: !653)
!715 = !DILocation(line: 209, column: 11, scope: !716)
!716 = distinct !DILexicalBlock(scope: !717, file: !107, line: 209, column: 11)
!717 = distinct !DILexicalBlock(scope: !713, file: !107, line: 208, column: 17)
!718 = !DILocation(line: 209, column: 18, scope: !716)
!719 = !DILocation(line: 209, column: 37, scope: !716)
!720 = !DILocation(line: 209, column: 11, scope: !717)
!721 = !DILocation(line: 210, column: 10, scope: !722)
!722 = distinct !DILexicalBlock(scope: !716, file: !107, line: 209, column: 68)
!723 = !DILocation(line: 211, column: 10, scope: !722)
!724 = !DILocation(line: 212, column: 7, scope: !722)
!725 = !DILocation(line: 212, column: 18, scope: !726)
!726 = !DILexicalBlockFile(scope: !727, file: !107, discriminator: 1)
!727 = distinct !DILexicalBlock(scope: !716, file: !107, line: 212, column: 18)
!728 = !DILocation(line: 212, column: 25, scope: !726)
!729 = !DILocation(line: 212, column: 44, scope: !726)
!730 = !DILocation(line: 213, column: 10, scope: !731)
!731 = distinct !DILexicalBlock(scope: !727, file: !107, line: 212, column: 73)
!732 = !DILocation(line: 214, column: 10, scope: !731)
!733 = !DILocation(line: 215, column: 7, scope: !731)
!734 = !DILocation(line: 216, column: 4, scope: !717)
!735 = !DILocation(line: 218, column: 4, scope: !653)
!736 = !DILocation(line: 218, column: 11, scope: !653)
!737 = !DILocation(line: 218, column: 30, scope: !653)
!738 = !DILocation(line: 219, column: 1, scope: !653)
!739 = distinct !DISubprogram(name: "PowerOpsRunScript", scope: !107, file: !107, line: 360, type: !740, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !171)
!740 = !DISubroutineType(types: !741)
!741 = !{!100, !216, !129}
!742 = !DILocalVariable(name: "state", arg: 1, scope: !739, file: !107, line: 360, type: !216)
!743 = !DILocation(line: 360, column: 33, scope: !739)
!744 = !DILocalVariable(name: "script", arg: 2, scope: !739, file: !107, line: 361, type: !129)
!745 = !DILocation(line: 361, column: 26, scope: !739)
!746 = !DILocalVariable(name: "argv", scope: !739, file: !107, line: 363, type: !747)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, align: 64, elements: !187)
!748 = !DILocation(line: 363, column: 11, scope: !739)
!749 = !DILocalVariable(name: "watch", scope: !739, file: !107, line: 364, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !96, line: 64, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !96, line: 171, size: 768, align: 64, elements: !753)
!753 = !{!754, !755, !771, !800, !801, !805, !806, !807, !808, !816, !817, !818, !819}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !752, file: !96, line: 174, baseType: !103, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !752, file: !96, line: 175, baseType: !756, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !96, line: 77, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !96, line: 196, size: 192, align: 64, elements: !759)
!759 = !{!760, !764, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !758, file: !96, line: 198, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !103}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !758, file: !96, line: 199, baseType: !761, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !758, file: !96, line: 200, baseType: !766, size: 64, align: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !103, !750, !769, !770}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !752, file: !96, line: 177, baseType: !772, size: 64, align: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !96, line: 130, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !96, line: 214, size: 384, align: 64, elements: !776)
!776 = !{!777, !782, !786, !790, !794, !795}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !775, file: !96, line: 216, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!100, !750, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !775, file: !96, line: 218, baseType: !783, size: 64, align: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!100, !750}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !775, file: !96, line: 219, baseType: !787, size: 64, align: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!100, !750, !95, !103}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !775, file: !96, line: 222, baseType: !791, size: 64, align: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !750}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !775, file: !96, line: 226, baseType: !95, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !775, file: !96, line: 227, baseType: !796, size: 64, align: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !96, line: 212, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64, align: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !752, file: !96, line: 178, baseType: !132, size: 32, align: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !752, file: !96, line: 180, baseType: !802, size: 64, align: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !96, line: 48, baseType: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !96, line: 48, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !752, file: !96, line: 182, baseType: !102, size: 32, align: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !96, line: 183, baseType: !132, size: 32, align: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !752, file: !96, line: 184, baseType: !132, size: 32, align: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !752, file: !96, line: 186, baseType: !809, size: 64, align: 64, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !811, line: 37, baseType: !812)
!811 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !811, line: 39, size: 128, align: 64, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !811, line: 41, baseType: !103, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !811, line: 42, baseType: !809, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !752, file: !96, line: 188, baseType: !750, size: 64, align: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !96, line: 189, baseType: !750, size: 64, align: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !96, line: 191, baseType: !93, size: 64, align: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !752, file: !96, line: 193, baseType: !820, size: 64, align: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !96, line: 65, baseType: !822)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !96, line: 65, flags: DIFlagFwdDecl)
!823 = !DILocation(line: 364, column: 13, scope: !739)
!824 = !DILocalVariable(name: "err", scope: !739, file: !107, line: 365, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !827, line: 42, baseType: !828)
!827 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !827, line: 44, size: 128, align: 64, elements: !829)
!829 = !{!830, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !828, file: !827, line: 46, baseType: !831, size: 32, align: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !832, line: 36, baseType: !833)
!832 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1466")
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !90, line: 45, baseType: !133)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !828, file: !827, line: 47, baseType: !102, size: 32, align: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !828, file: !827, line: 48, baseType: !129, size: 64, align: 64, offset: 64)
!836 = !DILocation(line: 365, column: 12, scope: !739)
!837 = !DILocation(line: 367, column: 33, scope: !739)
!838 = !DILocation(line: 367, column: 14, scope: !739)
!839 = !DILocation(line: 367, column: 4, scope: !739)
!840 = !DILocation(line: 367, column: 12, scope: !739)
!841 = !DILocation(line: 368, column: 8, scope: !842)
!842 = distinct !DILexicalBlock(scope: !739, file: !107, line: 368, column: 8)
!843 = !DILocation(line: 368, column: 12, scope: !842)
!844 = !DILocation(line: 368, column: 8, scope: !739)
!845 = !DILocation(line: 369, column: 71, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !107, line: 368, column: 20)
!847 = !DILocation(line: 369, column: 76, scope: !846)
!848 = !DILocation(line: 369, column: 7, scope: !846)
!849 = !DILocation(line: 370, column: 7, scope: !846)
!850 = !DILocation(line: 375, column: 26, scope: !846)
!851 = !DILocation(line: 375, column: 17, scope: !846)
!852 = !DILocation(line: 375, column: 7, scope: !846)
!853 = !DILocation(line: 375, column: 15, scope: !846)
!854 = !DILocation(line: 376, column: 4, scope: !846)
!855 = !DILocation(line: 377, column: 4, scope: !739)
!856 = !DILocation(line: 377, column: 12, scope: !739)
!857 = !DILocation(line: 379, column: 72, scope: !739)
!858 = !DILocation(line: 379, column: 4, scope: !739)
!859 = !DILocation(line: 381, column: 23, scope: !860)
!860 = distinct !DILexicalBlock(scope: !739, file: !107, line: 380, column: 8)
!861 = !DILocation(line: 388, column: 24, scope: !860)
!862 = !DILocation(line: 388, column: 31, scope: !860)
!863 = !DILocation(line: 380, column: 9, scope: !860)
!864 = !DILocation(line: 380, column: 8, scope: !739)
!865 = !DILocation(line: 390, column: 81, scope: !866)
!866 = distinct !DILexicalBlock(scope: !860, file: !107, line: 389, column: 30)
!867 = !DILocation(line: 390, column: 86, scope: !866)
!868 = !DILocation(line: 390, column: 10, scope: !866)
!869 = !DILocation(line: 391, column: 10, scope: !866)
!870 = !DILocation(line: 392, column: 17, scope: !866)
!871 = !DILocation(line: 392, column: 10, scope: !866)
!872 = !DILocation(line: 393, column: 10, scope: !866)
!873 = !DILocation(line: 397, column: 37, scope: !739)
!874 = !DILocation(line: 397, column: 44, scope: !739)
!875 = !DILocation(line: 397, column: 12, scope: !739)
!876 = !DILocation(line: 397, column: 10, scope: !739)
!877 = !DILocation(line: 398, column: 4, scope: !739)
!878 = distinct !{!878, !877}
!879 = !DILocalVariable(name: "__src", scope: !880, file: !107, line: 398, type: !750)
!880 = distinct !DILexicalBlock(scope: !739, file: !107, line: 398, column: 7)
!881 = !DILocation(line: 398, column: 18, scope: !880)
!882 = !DILocation(line: 398, column: 27, scope: !883)
!883 = !DILexicalBlockFile(scope: !880, file: !107, discriminator: 1)
!884 = !DILocation(line: 398, column: 18, scope: !883)
!885 = !DILocation(line: 398, column: 57, scope: !883)
!886 = !DILocation(line: 398, column: 105, scope: !883)
!887 = !DILocation(line: 398, column: 104, scope: !883)
!888 = !DILocation(line: 398, column: 35, scope: !883)
!889 = !DILocation(line: 398, column: 23, scope: !883)
!890 = !DILocation(line: 398, column: 55, scope: !883)
!891 = !DILocation(line: 398, column: 62, scope: !883)
!892 = !DILocation(line: 398, column: 68, scope: !883)
!893 = !DILocation(line: 398, column: 30, scope: !894)
!894 = !DILexicalBlockFile(scope: !883, file: !107, discriminator: 2)
!895 = !DILocation(line: 398, column: 7, scope: !896)
!896 = !DILexicalBlockFile(scope: !883, file: !107, discriminator: 3)
!897 = !DILocation(line: 398, column: 80, scope: !883)
!898 = !DILocation(line: 399, column: 19, scope: !739)
!899 = !DILocation(line: 399, column: 4, scope: !739)
!900 = !DILocation(line: 400, column: 11, scope: !739)
!901 = !DILocation(line: 400, column: 4, scope: !739)
!902 = !DILocation(line: 401, column: 4, scope: !739)
