; ModuleID = './asyncsocket.o.i'
source_filename = "./asyncsocket.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"


!12 = !{!13, !14}
!13 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BASE", value: 1001)
!14 = !DIEnumerator(name: "ASYNC_SOCKET_OPTS_LAYER_BLAST_PROXY", value: 1002)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 140, size: 32, align: 32, elements: !16)
!16 = !{!17}
!17 = !DIEnumerator(name: "ASOCKCONN_ADDR_IN_NETWORK_BYTE_ORDER", value: 4)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !19, line: 24, size: 32, align: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29}
!21 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!22 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!23 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!24 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!25 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!26 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!27 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!28 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!29 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 40, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!33 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!34 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!35 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!36 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!37 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!38 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!39 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!40 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!41 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!42 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!43 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!44 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!45 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!46 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!47 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!48 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!49 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!50 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!51 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!52 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!53 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!54 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!55 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!56 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!57 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!58 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "VMwareStatus", file: !60, line: 85, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!61 = !{!62, !63, !64, !65, !66}
!62 = !DIEnumerator(name: "VMWARE_STATUS_SUCCESS", value: 0)
!63 = !DIEnumerator(name: "VMWARE_STATUS_ERROR", value: 1)
!64 = !DIEnumerator(name: "VMWARE_STATUS_NOMEM", value: 2)
!65 = !DIEnumerator(name: "VMWARE_STATUS_INSUFFICIENT_RESOURCES", value: 3)
!66 = !DIEnumerator(name: "VMWARE_STATUS_INVALID_ARGS", value: 4)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 83, size: 32, align: 32, elements: !69)
!68 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/poll.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!69 = !{!70, !71, !72, !73, !74, !75}
!70 = !DIEnumerator(name: "POLL_VIRTUALREALTIME", value: -1)
!71 = !DIEnumerator(name: "POLL_VTIME", value: 0)
!72 = !DIEnumerator(name: "POLL_REALTIME", value: 1)
!73 = !DIEnumerator(name: "POLL_DEVICE", value: 2)
!74 = !DIEnumerator(name: "POLL_MAIN_LOOP", value: 3)
!75 = !DIEnumerator(name: "POLL_NUM_QUEUES", value: 4)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 326, size: 32, align: 32, elements: !77)
!77 = !{!78}
!78 = !DIEnumerator(name: "ASYNC_SOCKET_OPT_SEND_LOW_LATENCY_MODE", value: 0)
!79 = !{!80, !81, !86, !101, !103, !119, !143, !145, !153, !163, !165, !166, !169, !170, !172, !450, !173}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !82, line: 173, baseType: !83)
!82 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 51, baseType: !85)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!85 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !88, line: 166, size: 1024, align: 64, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!89 = !{!90, !94, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !87, file: !88, line: 168, baseType: !91, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !92, line: 28, baseType: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !87, file: !88, line: 169, baseType: !95, size: 944, align: 8, offset: 16)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 944, align: 8, elements: !97)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !{!98}
!98 = !DISubrange(count: 118)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !87, file: !88, line: 170, baseType: !100, size: 64, align: 64, offset: 960)
!100 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !82, line: 175, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !84, line: 49, baseType: !93)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !31, line: 239, size: 128, align: 32, elements: !105)
!105 = !{!106, !107, !109, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !104, file: !31, line: 241, baseType: !91, size: 16, align: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !104, file: !31, line: 242, baseType: !108, size: 16, align: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !31, line: 119, baseType: !102)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !104, file: !31, line: 243, baseType: !110, size: 32, align: 32, offset: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !31, line: 31, size: 32, align: 32, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !110, file: !31, line: 33, baseType: !113, size: 32, align: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !31, line: 30, baseType: !83)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !104, file: !31, line: 246, baseType: !115, size: 64, align: 8, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, align: 8, elements: !117)
!116 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!117 = !{!118}
!118 = !DISubrange(count: 8)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !31, line: 254, size: 224, align: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !142}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !120, file: !31, line: 256, baseType: !91, size: 16, align: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !120, file: !31, line: 257, baseType: !108, size: 16, align: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !120, file: !31, line: 258, baseType: !83, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !120, file: !31, line: 259, baseType: !126, size: 128, align: 32, offset: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !31, line: 211, size: 128, align: 32, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !126, file: !31, line: 220, baseType: !129, size: 128, align: 32)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !126, file: !31, line: 213, size: 128, align: 32, elements: !130)
!130 = !{!131, !136, !138}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !129, file: !31, line: 215, baseType: !132, size: 128, align: 8)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, align: 8, elements: !134)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 48, baseType: !116)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !129, file: !31, line: 217, baseType: !137, size: 128, align: 16)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, align: 16, elements: !117)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !129, file: !31, line: 218, baseType: !139, size: 128, align: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 128, align: 32, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 4)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !120, file: !31, line: 260, baseType: !83, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !88, line: 153, size: 128, align: 16, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !146, file: !88, line: 155, baseType: !91, size: 16, align: 16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !146, file: !88, line: 156, baseType: !150, size: 112, align: 8, offset: 16)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 14)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_vm", file: !155, line: 420, size: 128, align: 32, elements: !156)
!155 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmci_sockets.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "svm_family", scope: !154, file: !155, line: 426, baseType: !91, size: 16, align: 16)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "svm_reserved1", scope: !154, file: !155, line: 429, baseType: !93, size: 16, align: 16, offset: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "svm_port", scope: !154, file: !155, line: 433, baseType: !85, size: 32, align: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "svm_cid", scope: !154, file: !155, line: 436, baseType: !85, size: 32, align: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "svm_zero", scope: !154, file: !155, line: 439, baseType: !162, size: 32, align: 8, offset: 96)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 32, align: 8, elements: !140)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!165 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !82, line: 230, baseType: !96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !82, line: 177, baseType: !133)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncTCPSocket", file: !175, line: 233, baseType: !176)
!175 = !DIFile(filename: "asyncsocket.c", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncTCPSocket", file: !175, line: 170, size: 4544, align: 64, elements: !177)
!177 = !{!178, !389, !390, !395, !396, !397, !398, !399, !400, !402, !403, !404, !405, !406, !411, !412, !413, !414, !415, !416, !417, !418, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !444, !445}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !176, file: !175, line: 174, baseType: !179, size: 896, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocket", file: !4, line: 155, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocket", file: !181, line: 47, size: 896, align: 64, elements: !182)
!181 = !DIFile(filename: "asyncSocketBase.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!182 = !{!183, !184, !185, !204, !206, !207, !208, !214, !215, !216, !217, !218, !223, !224, !225}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !181, line: 48, baseType: !81, size: 32, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !180, file: !181, line: 49, baseType: !81, size: 32, align: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pollParams", scope: !180, file: !181, line: 50, baseType: !186, size: 256, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketPollParams", file: !4, line: 174, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketPollParams", file: !4, line: 169, size: 256, align: 64, elements: !188)
!188 = !{!189, !190, !195, !201}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !4, line: 170, baseType: !165, size: 32, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !187, file: !4, line: 171, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserRecLock", file: !193, line: 39, baseType: !194)
!193 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserRecLock", file: !193, line: 39, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pollClass", scope: !187, file: !4, line: 172, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "PollClassSet", file: !68, line: 128, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PollClassSet", file: !68, line: 126, size: 64, align: 64, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !197, file: !68, line: 127, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !84, line: 122, baseType: !100)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "iPoll", scope: !187, file: !4, line: 173, baseType: !202, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "IVmdbPoll", file: !4, line: 168, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !180, file: !181, line: 51, baseType: !205, size: 32, align: 32, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketState", file: !4, line: 190, baseType: !3)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inited", scope: !180, file: !181, line: 53, baseType: !168, size: 8, align: 8, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "errorSeen", scope: !180, file: !181, line: 54, baseType: !168, size: 8, align: 8, offset: 360)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "errorFn", scope: !180, file: !181, line: 55, baseType: !209, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketErrorFn", file: !4, line: 401, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !165, !213, !80}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "errorClientData", scope: !180, file: !181, line: 56, baseType: !80, size: 64, align: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "recvBuf", scope: !180, file: !181, line: 58, baseType: !80, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "recvPos", scope: !180, file: !181, line: 59, baseType: !165, size: 32, align: 32, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "recvLen", scope: !180, file: !181, line: 60, baseType: !165, size: 32, align: 32, offset: 608)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !180, file: !181, line: 61, baseType: !219, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketRecvFn", file: !4, line: 389, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !80, !165, !213, !80}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "recvClientData", scope: !180, file: !181, line: 62, baseType: !80, size: 64, align: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "recvFireOnPartial", scope: !180, file: !181, line: 63, baseType: !168, size: 8, align: 8, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vt", scope: !180, file: !181, line: 65, baseType: !226, size: 64, align: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketVTable", file: !229, line: 138, baseType: !230)
!229 = !DIFile(filename: "asyncSocketVTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketVTable", file: !229, line: 52, size: 2432, align: 64, elements: !231)
!231 = !{!232, !236, !245, !250, !254, !255, !262, !268, !272, !280, !286, !294, !298, !303, !307, !311, !315, !316, !321, !322, !337, !338, !344, !345, !350, !351, !352, !356, !357, !361, !365, !369, !373, !374, !375, !379, !380, !385}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "getState", scope: !230, file: !229, line: 53, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!205, !213}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "setOption", scope: !230, file: !229, line: 63, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!165, !213, !240, !241, !143, !242}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_Layer", file: !4, line: 319, baseType: !11)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketOpts_ID", file: !4, line: 284, baseType: !165)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !88, line: 33, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !244, line: 189, baseType: !85)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "getOption", scope: !230, file: !229, line: 75, baseType: !246, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!165, !213, !240, !241, !80, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "getGenericErrno", scope: !230, file: !229, line: 81, baseType: !251, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!165, !213}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "getFd", scope: !230, file: !229, line: 82, baseType: !251, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteIPStr", scope: !230, file: !229, line: 83, baseType: !256, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!165, !213, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "getINETIPStr", scope: !230, file: !229, line: 84, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!165, !213, !165, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "getPort", scope: !230, file: !229, line: 85, baseType: !269, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!85, !213}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "setCloseOptions", scope: !230, file: !229, line: 86, baseType: !273, size: 64, align: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!165, !213, !165, !276}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketCloseFn", file: !4, line: 410, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !213, !80}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "connectSSL", scope: !230, file: !229, line: 88, baseType: !281, size: 64, align: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!168, !213, !284, !80}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SSLVerifyParam", file: !4, line: 150, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "startSslConnect", scope: !230, file: !229, line: 90, baseType: !287, size: 64, align: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!165, !213, !284, !80, !290, !80}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslConnectFn", file: !4, line: 408, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !168, !213, !80}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "acceptSSL", scope: !230, file: !229, line: 94, baseType: !295, size: 64, align: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!168, !213, !80}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "startSslAccept", scope: !230, file: !229, line: 95, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!165, !213, !80, !302, !80}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSslAcceptFn", file: !4, line: 406, baseType: !291)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !230, file: !229, line: 98, baseType: !304, size: 64, align: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!165, !213, !165}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "recv", scope: !230, file: !229, line: 99, baseType: !308, size: 64, align: 64, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!165, !213, !80, !165, !168, !80, !80}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "recvPassedFd", scope: !230, file: !229, line: 101, baseType: !312, size: 64, align: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!165, !213, !80, !165, !80, !80}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "getReceivedFd", scope: !230, file: !229, line: 103, baseType: !251, size: 64, align: 64, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !230, file: !229, line: 104, baseType: !317, size: 64, align: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!165, !213, !80, !165, !320, !80}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSendFn", file: !4, line: 395, baseType: !220)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "isSendBufferFull", scope: !230, file: !229, line: 106, baseType: !251, size: 64, align: 64, offset: 1152)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "getNetworkStats", scope: !230, file: !229, line: 107, baseType: !323, size: 64, align: 64, offset: 1216)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!165, !213, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketNetworkStats", file: !4, line: 200, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocketNetworkStats", file: !4, line: 193, size: 256, align: 64, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "cwndBytes", scope: !328, file: !4, line: 194, baseType: !81, size: 32, align: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedAvgMillis", scope: !328, file: !4, line: 195, baseType: !81, size: 32, align: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rttSmoothedVarMillis", scope: !328, file: !4, line: 196, baseType: !81, size: 32, align: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "queuedBytes", scope: !328, file: !4, line: 197, baseType: !81, size: 32, align: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "inflightBytes", scope: !328, file: !4, line: 198, baseType: !81, size: 32, align: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "packetLossPercent", scope: !328, file: !4, line: 199, baseType: !336, size: 64, align: 64, offset: 192)
!336 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !230, file: !229, line: 109, baseType: !251, size: 64, align: 64, offset: 1280)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cancelRecv", scope: !230, file: !229, line: 110, baseType: !339, size: 64, align: 64, offset: 1344)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!165, !213, !342, !343, !343, !168}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cancelCbForClose", scope: !230, file: !229, line: 112, baseType: !251, size: 64, align: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "getLocalVMCIAddress", scope: !230, file: !229, line: 113, baseType: !346, size: 64, align: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!165, !213, !349, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "getRemoteVMCIAddress", scope: !230, file: !229, line: 114, baseType: !346, size: 64, align: 64, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketError", scope: !230, file: !229, line: 115, baseType: !251, size: 64, align: 64, offset: 1600)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketURI", scope: !230, file: !229, line: 116, baseType: !353, size: 64, align: 64, offset: 1664)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!267, !213}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCookie", scope: !230, file: !229, line: 117, baseType: !353, size: 64, align: 64, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketCloseStatus", scope: !230, file: !229, line: 118, baseType: !358, size: 64, align: 64, offset: 1792)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!101, !213}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "getWebSocketProtocol", scope: !230, file: !229, line: 119, baseType: !362, size: 64, align: 64, offset: 1856)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!260, !213}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "setWebSocketCookie", scope: !230, file: !229, line: 120, baseType: !366, size: 64, align: 64, offset: 1920)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!165, !213, !80, !260, !260}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "recvBlocking", scope: !230, file: !229, line: 122, baseType: !370, size: 64, align: 64, offset: 1984)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!165, !213, !80, !165, !342, !165}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "recvPartialBlocking", scope: !230, file: !229, line: 124, baseType: !370, size: 64, align: 64, offset: 2048)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sendBlocking", scope: !230, file: !229, line: 126, baseType: !370, size: 64, align: 64, offset: 2112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "doOneMsg", scope: !230, file: !229, line: 128, baseType: !376, size: 64, align: 64, offset: 2176)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!165, !213, !168, !165}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "waitForConnection", scope: !230, file: !229, line: 129, baseType: !304, size: 64, align: 64, offset: 2240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "waitForReadMultiple", scope: !230, file: !229, line: 130, baseType: !381, size: 64, align: 64, offset: 2304)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!165, !384, !165, !165, !342}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !230, file: !229, line: 137, baseType: !386, size: 64, align: 64, offset: 2368)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !213}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !176, file: !175, line: 179, baseType: !165, size: 32, align: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "sslSock", scope: !176, file: !175, line: 180, baseType: !391, size: 64, align: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSLSock", file: !392, line: 33, baseType: !393)
!392 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/sslDirect.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "SSLSockStruct", file: !4, line: 149, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "genericErrno", scope: !176, file: !175, line: 182, baseType: !165, size: 32, align: 32, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "localAddr", scope: !176, file: !175, line: 184, baseType: !87, size: 1024, align: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "localAddrLen", scope: !176, file: !175, line: 185, baseType: !242, size: 32, align: 32, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "remoteAddr", scope: !176, file: !175, line: 186, baseType: !87, size: 1024, align: 64, offset: 2176)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "remoteAddrLen", scope: !176, file: !175, line: 187, baseType: !242, size: 32, align: 32, offset: 3200)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "connectFn", scope: !176, file: !175, line: 189, baseType: !401, size: 64, align: 64, offset: 3264)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketConnectFn", file: !4, line: 404, baseType: !277)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sslAcceptFn", scope: !176, file: !175, line: 190, baseType: !302, size: 64, align: 64, offset: 3328)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sslConnectFn", scope: !176, file: !175, line: 191, baseType: !290, size: 64, align: 64, offset: 3392)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sslPollFlags", scope: !176, file: !175, line: 192, baseType: !165, size: 32, align: 32, offset: 3456)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !176, file: !175, line: 195, baseType: !80, size: 64, align: 64, offset: 3520)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "internalConnectFn", scope: !176, file: !175, line: 197, baseType: !407, size: 64, align: 64, offset: 3584)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PollerFunction", file: !68, line: 221, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !80}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "internalSendFn", scope: !176, file: !175, line: 198, baseType: !407, size: 64, align: 64, offset: 3648)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "internalRecvFn", scope: !176, file: !175, line: 199, baseType: !407, size: 64, align: 64, offset: 3712)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flushEnabledMaxWaitMsec", scope: !176, file: !175, line: 202, baseType: !165, size: 32, align: 32, offset: 3776)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "closeCb", scope: !176, file: !175, line: 203, baseType: !276, size: 64, align: 64, offset: 3840)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "closeCbData", scope: !176, file: !175, line: 204, baseType: !80, size: 64, align: 64, offset: 3904)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "recvCb", scope: !176, file: !175, line: 206, baseType: !168, size: 8, align: 8, offset: 3968)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recvCbTimer", scope: !176, file: !175, line: 207, baseType: !168, size: 8, align: 8, offset: 3976)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sendBufList", scope: !176, file: !175, line: 209, baseType: !419, size: 64, align: 64, offset: 4032)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "SendBufList", file: !175, line: 167, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SendBufList", file: !175, line: 161, size: 320, align: 64, elements: !422)
!422 = !{!423, !425, !426, !427, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !175, line: 162, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !421, file: !175, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !421, file: !175, line: 164, baseType: !165, size: 32, align: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sendFn", scope: !421, file: !175, line: 165, baseType: !320, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !421, file: !175, line: 166, baseType: !80, size: 64, align: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sendBufTail", scope: !176, file: !175, line: 210, baseType: !430, size: 64, align: 64, offset: 4096)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sendPos", scope: !176, file: !175, line: 211, baseType: !165, size: 32, align: 32, offset: 4160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sendCb", scope: !176, file: !175, line: 212, baseType: !168, size: 8, align: 8, offset: 4192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sendCbTimer", scope: !176, file: !175, line: 213, baseType: !168, size: 8, align: 8, offset: 4200)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sendCbRT", scope: !176, file: !175, line: 214, baseType: !168, size: 8, align: 8, offset: 4208)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sendBufFull", scope: !176, file: !175, line: 215, baseType: !168, size: 8, align: 8, offset: 4216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sendLowLatency", scope: !176, file: !175, line: 216, baseType: !168, size: 8, align: 8, offset: 4224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "inLowLatencySendCb", scope: !176, file: !175, line: 217, baseType: !165, size: 32, align: 32, offset: 4256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sslConnected", scope: !176, file: !175, line: 219, baseType: !168, size: 8, align: 8, offset: 4288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inIPollCb", scope: !176, file: !175, line: 221, baseType: !171, size: 8, align: 8, offset: 4296)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inRecvLoop", scope: !176, file: !175, line: 222, baseType: !168, size: 8, align: 8, offset: 4304)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "inBlockingRecv", scope: !176, file: !175, line: 223, baseType: !81, size: 32, align: 32, offset: 4320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "listenAsock4", scope: !176, file: !175, line: 225, baseType: !443, size: 64, align: 64, offset: 4352)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "listenAsock6", scope: !176, file: !175, line: 226, baseType: !443, size: 64, align: 64, offset: 4416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "passFd", scope: !176, file: !175, line: 231, baseType: !446, size: 64, align: 32, offset: 4480)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !176, file: !175, line: 228, size: 64, align: 32, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "expected", scope: !446, file: !175, line: 229, baseType: !168, size: 8, align: 8)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !446, file: !175, line: 230, baseType: !165, size: 32, align: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !452, line: 39, size: 64, align: 32, elements: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "/home/lichi/Desktop/open-vm-tools/line52")
!453 = !{!454, !455, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !451, file: !452, line: 41, baseType: !165, size: 32, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !451, file: !452, line: 42, baseType: !456, size: 16, align: 16, offset: 32)
!456 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !451, file: !452, line: 43, baseType: !456, size: 16, align: 16, offset: 48)
!458 = !{!459, !467}
!459 = distinct !DIGlobalVariable(name: "unknownAddr", scope: !460, file: !175, line: 3188, type: !464, isLocal: true, isDefinition: true, variable: [10 x i8]* @AsyncTCPSocketResolveAddr.unknownAddr)
!460 = distinct !DISubprogram(name: "AsyncTCPSocketResolveAddr", scope: !175, file: !175, line: 3145, type: !461, isLocal: true, isDefinition: true, scopeLine: 3152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!165, !260, !85, !165, !168, !86, !249, !266}
!463 = !{}
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 80, align: 8, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 10)
!467 = distinct !DIGlobalVariable(name: "asyncTCPSocketVTable", scope: !0, file: !175, line: 374, type: !227, isLocal: true, isDefinition: true, variable: %struct.AsyncSocketVTable* @asyncTCPSocketVTable)
!468 = !{i32 2, !"Dwarf Version", i32 4}
!469 = !{i32 2, !"Debug Info Version", i32 3}
!470 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!471 = distinct !DISubprogram(name: "AsyncTCPSocket_Init", scope: !175, file: !175, line: 568, type: !472, isLocal: false, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!472 = !DISubroutineType(types: !473)
!473 = !{!165}
!474 = !DILocation(line: 576, column: 4, scope: !471)
!475 = distinct !DISubprogram(name: "AsyncSocket_Listen", scope: !175, file: !175, line: 1008, type: !476, isLocal: false, isDefinition: true, scopeLine: 1014, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!476 = !DISubroutineType(types: !477)
!477 = !{!213, !260, !85, !401, !80, !478, !342}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!479 = !DILocalVariable(name: "addrStr", arg: 1, scope: !475, file: !175, line: 1008, type: !260)
!480 = !DIExpression()
!481 = !DILocation(line: 1008, column: 32, scope: !475)
!482 = !DILocalVariable(name: "port", arg: 2, scope: !475, file: !175, line: 1009, type: !85)
!483 = !DILocation(line: 1009, column: 33, scope: !475)
!484 = !DILocalVariable(name: "connectFn", arg: 3, scope: !475, file: !175, line: 1010, type: !401)
!485 = !DILocation(line: 1010, column: 41, scope: !475)
!486 = !DILocalVariable(name: "clientData", arg: 4, scope: !475, file: !175, line: 1011, type: !80)
!487 = !DILocation(line: 1011, column: 26, scope: !475)
!488 = !DILocalVariable(name: "pollParams", arg: 5, scope: !475, file: !175, line: 1012, type: !478)
!489 = !DILocation(line: 1012, column: 43, scope: !475)
!490 = !DILocalVariable(name: "outError", arg: 6, scope: !475, file: !175, line: 1013, type: !342)
!491 = !DILocation(line: 1013, column: 25, scope: !475)
!492 = !DILocation(line: 1015, column: 8, scope: !493)
!493 = distinct !DILexicalBlock(scope: !475, file: !175, line: 1015, column: 8)
!494 = !DILocation(line: 1015, column: 16, scope: !493)
!495 = !DILocation(line: 1015, column: 23, scope: !493)
!496 = !DILocation(line: 1015, column: 27, scope: !497)
!497 = !DILexicalBlockFile(scope: !493, file: !175, discriminator: 1)
!498 = !DILocation(line: 1015, column: 26, scope: !497)
!499 = !DILocation(line: 1015, column: 35, scope: !497)
!500 = !DILocation(line: 1015, column: 43, scope: !497)
!501 = !DILocation(line: 1016, column: 15, scope: !493)
!502 = !DILocation(line: 1016, column: 8, scope: !493)
!503 = !DILocation(line: 1015, column: 8, scope: !504)
!504 = !DILexicalBlockFile(scope: !475, file: !175, discriminator: 2)
!505 = !DILocalVariable(name: "asock", scope: !506, file: !175, line: 1017, type: !173)
!506 = distinct !DILexicalBlock(scope: !493, file: !175, line: 1016, column: 38)
!507 = !DILocation(line: 1017, column: 23, scope: !506)
!508 = !DILocation(line: 1019, column: 48, scope: !506)
!509 = !DILocation(line: 1019, column: 57, scope: !506)
!510 = !DILocation(line: 1020, column: 48, scope: !506)
!511 = !DILocation(line: 1021, column: 48, scope: !506)
!512 = !DILocation(line: 1021, column: 60, scope: !506)
!513 = !DILocation(line: 1022, column: 48, scope: !506)
!514 = !DILocation(line: 1019, column: 15, scope: !506)
!515 = !DILocation(line: 1019, column: 13, scope: !506)
!516 = !DILocation(line: 1023, column: 25, scope: !506)
!517 = !DILocation(line: 1023, column: 14, scope: !506)
!518 = !DILocation(line: 1023, column: 7, scope: !506)
!519 = !DILocalVariable(name: "localhost", scope: !520, file: !175, line: 1025, type: !168)
!520 = distinct !DILexicalBlock(scope: !493, file: !175, line: 1024, column: 11)
!521 = !DILocation(line: 1025, column: 12, scope: !520)
!522 = !DILocation(line: 1025, column: 24, scope: !520)
!523 = !DILocation(line: 1025, column: 32, scope: !520)
!524 = !DILocation(line: 1025, column: 39, scope: !520)
!525 = !DILocation(line: 1025, column: 50, scope: !526)
!526 = !DILexicalBlockFile(scope: !520, file: !175, discriminator: 1)
!527 = !DILocation(line: 1025, column: 43, scope: !526)
!528 = !DILocation(line: 1025, column: 42, scope: !526)
!529 = !DILocation(line: 1025, column: 39, scope: !530)
!530 = !DILexicalBlockFile(scope: !520, file: !175, discriminator: 2)
!531 = !DILocation(line: 1025, column: 24, scope: !530)
!532 = !DILocation(line: 1025, column: 12, scope: !530)
!533 = !DILocalVariable(name: "tempPort", scope: !520, file: !175, line: 1026, type: !85)
!534 = !DILocation(line: 1026, column: 20, scope: !520)
!535 = !DILocation(line: 1026, column: 31, scope: !520)
!536 = !DILocalVariable(name: "asock6", scope: !520, file: !175, line: 1027, type: !173)
!537 = !DILocation(line: 1027, column: 23, scope: !520)
!538 = !DILocalVariable(name: "asock4", scope: !520, file: !175, line: 1028, type: !173)
!539 = !DILocation(line: 1028, column: 23, scope: !520)
!540 = !DILocalVariable(name: "tempError4", scope: !520, file: !175, line: 1029, type: !165)
!541 = !DILocation(line: 1029, column: 11, scope: !520)
!542 = !DILocalVariable(name: "tempError6", scope: !520, file: !175, line: 1030, type: !165)
!543 = !DILocation(line: 1030, column: 11, scope: !520)
!544 = !DILocation(line: 1032, column: 49, scope: !520)
!545 = !DILocation(line: 1032, column: 58, scope: !520)
!546 = !DILocation(line: 1033, column: 49, scope: !520)
!547 = !DILocation(line: 1033, column: 60, scope: !520)
!548 = !DILocation(line: 1034, column: 49, scope: !520)
!549 = !DILocation(line: 1032, column: 16, scope: !520)
!550 = !DILocation(line: 1032, column: 14, scope: !520)
!551 = !DILocation(line: 1037, column: 11, scope: !552)
!552 = distinct !DILexicalBlock(scope: !520, file: !175, line: 1037, column: 11)
!553 = !DILocation(line: 1037, column: 21, scope: !552)
!554 = !DILocation(line: 1037, column: 24, scope: !555)
!555 = !DILexicalBlockFile(scope: !552, file: !175, discriminator: 1)
!556 = !DILocation(line: 1037, column: 29, scope: !555)
!557 = !DILocation(line: 1037, column: 11, scope: !555)
!558 = !DILocation(line: 1038, column: 52, scope: !559)
!559 = distinct !DILexicalBlock(scope: !552, file: !175, line: 1037, column: 35)
!560 = !DILocation(line: 1038, column: 41, scope: !559)
!561 = !DILocation(line: 1038, column: 21, scope: !562)
!562 = !DILexicalBlockFile(scope: !559, file: !175, discriminator: 1)
!563 = !DILocation(line: 1038, column: 19, scope: !559)
!564 = !DILocation(line: 1039, column: 14, scope: !565)
!565 = distinct !DILexicalBlock(scope: !559, file: !175, line: 1039, column: 14)
!566 = !DILocation(line: 1039, column: 23, scope: !565)
!567 = !DILocation(line: 1039, column: 14, scope: !559)
!568 = !DILocation(line: 1040, column: 13, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !175, line: 1039, column: 48)
!570 = !DILocation(line: 1042, column: 24, scope: !569)
!571 = !DILocation(line: 1042, column: 22, scope: !569)
!572 = !DILocation(line: 1043, column: 10, scope: !569)
!573 = !DILocation(line: 1044, column: 7, scope: !559)
!574 = !DILocation(line: 1046, column: 49, scope: !520)
!575 = !DILocation(line: 1046, column: 58, scope: !520)
!576 = !DILocation(line: 1047, column: 49, scope: !520)
!577 = !DILocation(line: 1047, column: 60, scope: !520)
!578 = !DILocation(line: 1048, column: 49, scope: !520)
!579 = !DILocation(line: 1046, column: 16, scope: !520)
!580 = !DILocation(line: 1046, column: 14, scope: !520)
!581 = !DILocation(line: 1051, column: 11, scope: !582)
!582 = distinct !DILexicalBlock(scope: !520, file: !175, line: 1051, column: 11)
!583 = !DILocation(line: 1051, column: 21, scope: !582)
!584 = !DILocation(line: 1051, column: 24, scope: !585)
!585 = !DILexicalBlockFile(scope: !582, file: !175, discriminator: 1)
!586 = !DILocation(line: 1051, column: 29, scope: !585)
!587 = !DILocation(line: 1051, column: 34, scope: !585)
!588 = !DILocation(line: 1051, column: 37, scope: !589)
!589 = !DILexicalBlockFile(scope: !582, file: !175, discriminator: 2)
!590 = !DILocation(line: 1051, column: 48, scope: !589)
!591 = !DILocation(line: 1051, column: 11, scope: !589)
!592 = !DILocation(line: 1052, column: 10, scope: !593)
!593 = distinct !DILexicalBlock(scope: !582, file: !175, line: 1051, column: 55)
!594 = !DILocation(line: 1054, column: 39, scope: !593)
!595 = !DILocation(line: 1054, column: 28, scope: !593)
!596 = !DILocation(line: 1054, column: 10, scope: !597)
!597 = !DILexicalBlockFile(scope: !593, file: !175, discriminator: 1)
!598 = !DILocation(line: 1056, column: 21, scope: !593)
!599 = !DILocation(line: 1057, column: 52, scope: !593)
!600 = !DILocation(line: 1057, column: 61, scope: !593)
!601 = !DILocation(line: 1058, column: 52, scope: !593)
!602 = !DILocation(line: 1058, column: 63, scope: !593)
!603 = !DILocation(line: 1059, column: 52, scope: !593)
!604 = !DILocation(line: 1057, column: 19, scope: !593)
!605 = !DILocation(line: 1057, column: 17, scope: !593)
!606 = !DILocation(line: 1062, column: 52, scope: !593)
!607 = !DILocation(line: 1062, column: 41, scope: !593)
!608 = !DILocation(line: 1062, column: 21, scope: !597)
!609 = !DILocation(line: 1062, column: 19, scope: !593)
!610 = !DILocation(line: 1063, column: 14, scope: !611)
!611 = distinct !DILexicalBlock(scope: !593, file: !175, line: 1063, column: 14)
!612 = !DILocation(line: 1063, column: 23, scope: !611)
!613 = !DILocation(line: 1063, column: 14, scope: !593)
!614 = !DILocation(line: 1064, column: 13, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !175, line: 1063, column: 48)
!616 = !DILocation(line: 1066, column: 24, scope: !615)
!617 = !DILocation(line: 1066, column: 22, scope: !615)
!618 = !DILocation(line: 1067, column: 10, scope: !615)
!619 = !DILocation(line: 1069, column: 21, scope: !593)
!620 = !DILocation(line: 1070, column: 52, scope: !593)
!621 = !DILocation(line: 1070, column: 61, scope: !593)
!622 = !DILocation(line: 1071, column: 52, scope: !593)
!623 = !DILocation(line: 1071, column: 63, scope: !593)
!624 = !DILocation(line: 1072, column: 52, scope: !593)
!625 = !DILocation(line: 1070, column: 19, scope: !593)
!626 = !DILocation(line: 1070, column: 17, scope: !593)
!627 = !DILocation(line: 1075, column: 15, scope: !628)
!628 = distinct !DILexicalBlock(scope: !593, file: !175, line: 1075, column: 14)
!629 = !DILocation(line: 1075, column: 22, scope: !628)
!630 = !DILocation(line: 1075, column: 25, scope: !631)
!631 = !DILexicalBlockFile(scope: !628, file: !175, discriminator: 1)
!632 = !DILocation(line: 1075, column: 36, scope: !631)
!633 = !DILocation(line: 1075, column: 14, scope: !631)
!634 = !DILocation(line: 1076, column: 13, scope: !635)
!635 = distinct !DILexicalBlock(scope: !628, file: !175, line: 1075, column: 43)
!636 = !DILocation(line: 1078, column: 42, scope: !635)
!637 = !DILocation(line: 1078, column: 31, scope: !635)
!638 = !DILocation(line: 1078, column: 13, scope: !639)
!639 = !DILexicalBlockFile(scope: !635, file: !175, discriminator: 1)
!640 = !DILocation(line: 1079, column: 10, scope: !635)
!641 = !DILocation(line: 1080, column: 7, scope: !593)
!642 = !DILocation(line: 1082, column: 11, scope: !643)
!643 = distinct !DILexicalBlock(scope: !520, file: !175, line: 1082, column: 11)
!644 = !DILocation(line: 1082, column: 18, scope: !643)
!645 = !DILocation(line: 1082, column: 21, scope: !646)
!646 = !DILexicalBlockFile(scope: !643, file: !175, discriminator: 1)
!647 = !DILocation(line: 1082, column: 11, scope: !646)
!648 = !DILocalVariable(name: "asock", scope: !649, file: !175, line: 1083, type: !173)
!649 = distinct !DILexicalBlock(scope: !643, file: !175, line: 1082, column: 29)
!650 = !DILocation(line: 1083, column: 26, scope: !649)
!651 = !DILocation(line: 1085, column: 39, scope: !649)
!652 = !DILocation(line: 1085, column: 18, scope: !649)
!653 = !DILocation(line: 1085, column: 16, scope: !649)
!654 = !DILocation(line: 1086, column: 33, scope: !649)
!655 = !DILocation(line: 1086, column: 10, scope: !649)
!656 = !DILocation(line: 1087, column: 32, scope: !649)
!657 = !DILocation(line: 1087, column: 10, scope: !649)
!658 = !DILocation(line: 1087, column: 17, scope: !649)
!659 = !DILocation(line: 1087, column: 30, scope: !649)
!660 = !DILocation(line: 1088, column: 32, scope: !649)
!661 = !DILocation(line: 1088, column: 10, scope: !649)
!662 = !DILocation(line: 1088, column: 17, scope: !649)
!663 = !DILocation(line: 1088, column: 30, scope: !649)
!664 = !DILocation(line: 1089, column: 44, scope: !649)
!665 = !DILocation(line: 1089, column: 33, scope: !649)
!666 = !DILocation(line: 1091, column: 33, scope: !649)
!667 = !DILocation(line: 1089, column: 10, scope: !668)
!668 = !DILexicalBlockFile(scope: !649, file: !175, discriminator: 1)
!669 = !DILocation(line: 1092, column: 44, scope: !649)
!670 = !DILocation(line: 1092, column: 33, scope: !649)
!671 = !DILocation(line: 1094, column: 33, scope: !649)
!672 = !DILocation(line: 1092, column: 10, scope: !668)
!673 = !DILocation(line: 1096, column: 28, scope: !649)
!674 = !DILocation(line: 1096, column: 17, scope: !649)
!675 = !DILocation(line: 1096, column: 10, scope: !649)
!676 = !DILocation(line: 1097, column: 18, scope: !677)
!677 = distinct !DILexicalBlock(scope: !643, file: !175, line: 1097, column: 18)
!678 = !DILocation(line: 1097, column: 18, scope: !643)
!679 = !DILocation(line: 1098, column: 28, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !175, line: 1097, column: 26)
!681 = !DILocation(line: 1098, column: 17, scope: !680)
!682 = !DILocation(line: 1098, column: 10, scope: !680)
!683 = !DILocation(line: 1099, column: 18, scope: !684)
!684 = distinct !DILexicalBlock(scope: !677, file: !175, line: 1099, column: 18)
!685 = !DILocation(line: 1099, column: 18, scope: !677)
!686 = !DILocation(line: 1100, column: 28, scope: !687)
!687 = distinct !DILexicalBlock(scope: !684, file: !175, line: 1099, column: 26)
!688 = !DILocation(line: 1100, column: 17, scope: !687)
!689 = !DILocation(line: 1100, column: 10, scope: !687)
!690 = !DILocation(line: 1103, column: 11, scope: !691)
!691 = distinct !DILexicalBlock(scope: !520, file: !175, line: 1103, column: 11)
!692 = !DILocation(line: 1103, column: 11, scope: !520)
!693 = !DILocation(line: 1105, column: 15, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !175, line: 1105, column: 14)
!695 = distinct !DILexicalBlock(scope: !691, file: !175, line: 1103, column: 21)
!696 = !DILocation(line: 1105, column: 14, scope: !695)
!697 = !DILocation(line: 1106, column: 25, scope: !698)
!698 = distinct !DILexicalBlock(scope: !694, file: !175, line: 1105, column: 23)
!699 = !DILocation(line: 1106, column: 14, scope: !698)
!700 = !DILocation(line: 1106, column: 23, scope: !698)
!701 = !DILocation(line: 1107, column: 10, scope: !698)
!702 = !DILocation(line: 1107, column: 22, scope: !703)
!703 = !DILexicalBlockFile(scope: !704, file: !175, discriminator: 1)
!704 = distinct !DILexicalBlock(scope: !694, file: !175, line: 1107, column: 21)
!705 = !DILocation(line: 1107, column: 21, scope: !703)
!706 = !DILocation(line: 1108, column: 25, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !175, line: 1107, column: 30)
!708 = !DILocation(line: 1108, column: 14, scope: !707)
!709 = !DILocation(line: 1108, column: 23, scope: !707)
!710 = !DILocation(line: 1109, column: 10, scope: !707)
!711 = !DILocation(line: 1110, column: 14, scope: !712)
!712 = distinct !DILexicalBlock(scope: !704, file: !175, line: 1109, column: 17)
!713 = !DILocation(line: 1110, column: 23, scope: !712)
!714 = !DILocation(line: 1112, column: 7, scope: !695)
!715 = !DILocation(line: 1114, column: 7, scope: !520)
!716 = !DILocation(line: 1116, column: 1, scope: !475)
!717 = distinct !DISubprogram(name: "AsyncTCPSocketListenerCreateImpl", scope: !175, file: !175, line: 925, type: !718, isLocal: true, isDefinition: true, scopeLine: 933, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!718 = !DISubroutineType(types: !719)
!719 = !{!173, !260, !85, !165, !401, !80, !478, !342}
!720 = !DILocalVariable(name: "addrStr", arg: 1, scope: !717, file: !175, line: 926, type: !260)
!721 = !DILocation(line: 926, column: 16, scope: !717)
!722 = !DILocalVariable(name: "port", arg: 2, scope: !717, file: !175, line: 927, type: !85)
!723 = !DILocation(line: 927, column: 17, scope: !717)
!724 = !DILocalVariable(name: "socketFamily", arg: 3, scope: !717, file: !175, line: 928, type: !165)
!725 = !DILocation(line: 928, column: 8, scope: !717)
!726 = !DILocalVariable(name: "connectFn", arg: 4, scope: !717, file: !175, line: 929, type: !401)
!727 = !DILocation(line: 929, column: 25, scope: !717)
!728 = !DILocalVariable(name: "clientData", arg: 5, scope: !717, file: !175, line: 930, type: !80)
!729 = !DILocation(line: 930, column: 10, scope: !717)
!730 = !DILocalVariable(name: "pollParams", arg: 6, scope: !717, file: !175, line: 931, type: !478)
!731 = !DILocation(line: 931, column: 27, scope: !717)
!732 = !DILocalVariable(name: "outError", arg: 7, scope: !717, file: !175, line: 932, type: !342)
!733 = !DILocation(line: 932, column: 9, scope: !717)
!734 = !DILocalVariable(name: "asock", scope: !717, file: !175, line: 934, type: !173)
!735 = !DILocation(line: 934, column: 20, scope: !717)
!736 = !DILocalVariable(name: "addr", scope: !717, file: !175, line: 935, type: !87)
!737 = !DILocation(line: 935, column: 28, scope: !717)
!738 = !DILocalVariable(name: "addrLen", scope: !717, file: !175, line: 936, type: !242)
!739 = !DILocation(line: 936, column: 14, scope: !717)
!740 = !DILocalVariable(name: "ipString", scope: !717, file: !175, line: 937, type: !267)
!741 = !DILocation(line: 937, column: 10, scope: !717)
!742 = !DILocalVariable(name: "getaddrinfoError", scope: !717, file: !175, line: 938, type: !165)
!743 = !DILocation(line: 938, column: 8, scope: !717)
!744 = !DILocation(line: 938, column: 53, scope: !717)
!745 = !DILocation(line: 938, column: 62, scope: !717)
!746 = !DILocation(line: 938, column: 68, scope: !717)
!747 = !DILocation(line: 938, column: 27, scope: !717)
!748 = !DILocation(line: 942, column: 8, scope: !749)
!749 = distinct !DILexicalBlock(scope: !717, file: !175, line: 942, column: 8)
!750 = !DILocation(line: 942, column: 25, scope: !749)
!751 = !DILocation(line: 942, column: 8, scope: !717)
!752 = !DILocation(line: 943, column: 47, scope: !753)
!753 = distinct !DILexicalBlock(scope: !749, file: !175, line: 942, column: 31)
!754 = !DILocation(line: 943, column: 56, scope: !753)
!755 = !DILocation(line: 943, column: 67, scope: !753)
!756 = !DILocation(line: 944, column: 40, scope: !753)
!757 = !DILocation(line: 945, column: 40, scope: !753)
!758 = !DILocation(line: 943, column: 15, scope: !753)
!759 = !DILocation(line: 943, column: 13, scope: !753)
!760 = !DILocation(line: 947, column: 11, scope: !761)
!761 = distinct !DILexicalBlock(scope: !753, file: !175, line: 947, column: 11)
!762 = !DILocation(line: 947, column: 11, scope: !753)
!763 = !DILocation(line: 948, column: 10, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !175, line: 947, column: 18)
!765 = distinct !{!765, !763}
!766 = !DILocation(line: 948, column: 70, scope: !767)
!767 = !DILexicalBlockFile(scope: !768, file: !175, discriminator: 1)
!768 = distinct !DILexicalBlock(scope: !764, file: !175, line: 948, column: 13)
!769 = !DILocation(line: 948, column: 59, scope: !767)
!770 = !DILocation(line: 948, column: 41, scope: !771)
!771 = !DILexicalBlockFile(scope: !767, file: !175, discriminator: 2)
!772 = !DILocation(line: 948, column: 108, scope: !767)
!773 = !DILocation(line: 948, column: 97, scope: !774)
!774 = !DILexicalBlockFile(scope: !767, file: !175, discriminator: 3)
!775 = !DILocation(line: 948, column: 79, scope: !776)
!776 = !DILexicalBlockFile(scope: !767, file: !175, discriminator: 4)
!777 = !DILocation(line: 948, column: 15, scope: !778)
!778 = !DILexicalBlockFile(scope: !767, file: !175, discriminator: 5)
!779 = !DILocation(line: 948, column: 169, scope: !767)
!780 = !DILocation(line: 948, column: 164, scope: !767)
!781 = !DILocation(line: 948, column: 179, scope: !767)
!782 = !DILocation(line: 948, column: 38, scope: !767)
!783 = !DILocation(line: 948, column: 118, scope: !784)
!784 = !DILexicalBlockFile(scope: !767, file: !175, discriminator: 6)
!785 = !DILocation(line: 948, column: 49, scope: !767)
!786 = !DILocation(line: 952, column: 7, scope: !764)
!787 = !DILocation(line: 954, column: 19, scope: !788)
!788 = distinct !DILexicalBlock(scope: !761, file: !175, line: 952, column: 14)
!789 = !DILocation(line: 954, column: 14, scope: !788)
!790 = !DILocation(line: 954, column: 29, scope: !788)
!791 = !DILocation(line: 954, column: 59, scope: !788)
!792 = !DILocation(line: 954, column: 58, scope: !788)
!793 = !DILocation(line: 955, column: 38, scope: !788)
!794 = !DILocation(line: 955, column: 37, scope: !788)
!795 = !DILocation(line: 955, column: 14, scope: !788)
!796 = !DILocation(line: 953, column: 10, scope: !788)
!797 = !DILocation(line: 957, column: 12, scope: !753)
!798 = !DILocation(line: 957, column: 7, scope: !753)
!799 = !DILocation(line: 958, column: 4, scope: !753)
!800 = !DILocation(line: 959, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !749, file: !175, line: 958, column: 11)
!802 = !DILocation(line: 960, column: 11, scope: !803)
!803 = distinct !DILexicalBlock(scope: !801, file: !175, line: 960, column: 11)
!804 = !DILocation(line: 960, column: 11, scope: !801)
!805 = !DILocation(line: 961, column: 11, scope: !806)
!806 = distinct !DILexicalBlock(scope: !803, file: !175, line: 960, column: 21)
!807 = !DILocation(line: 961, column: 20, scope: !806)
!808 = !DILocation(line: 962, column: 7, scope: !806)
!809 = !DILocation(line: 965, column: 11, scope: !717)
!810 = !DILocation(line: 965, column: 4, scope: !717)
!811 = distinct !DISubprogram(name: "BaseSocket", scope: !175, file: !175, line: 429, type: !812, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!812 = !DISubroutineType(types: !813)
!813 = !{!213, !173}
!814 = !DILocalVariable(name: "s", arg: 1, scope: !811, file: !175, line: 429, type: !173)
!815 = !DILocation(line: 429, column: 28, scope: !811)
!816 = !DILocation(line: 432, column: 12, scope: !811)
!817 = !DILocation(line: 432, column: 15, scope: !811)
!818 = !DILocation(line: 432, column: 4, scope: !811)
!819 = distinct !DISubprogram(name: "AsyncTCPSocketCreate", scope: !175, file: !175, line: 2088, type: !820, isLocal: true, isDefinition: true, scopeLine: 2089, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!820 = !DISubroutineType(types: !821)
!821 = !{!173, !478}
!822 = !DILocalVariable(name: "pollParams", arg: 1, scope: !819, file: !175, line: 2088, type: !478)
!823 = !DILocation(line: 2088, column: 45, scope: !819)
!824 = !DILocalVariable(name: "s", scope: !819, file: !175, line: 2090, type: !173)
!825 = !DILocation(line: 2090, column: 20, scope: !819)
!826 = !DILocation(line: 2092, column: 8, scope: !819)
!827 = !DILocation(line: 2092, column: 6, scope: !819)
!828 = !DILocation(line: 2094, column: 37, scope: !819)
!829 = !DILocation(line: 2094, column: 26, scope: !819)
!830 = !DILocation(line: 2094, column: 41, scope: !819)
!831 = !DILocation(line: 2094, column: 4, scope: !832)
!832 = !DILexicalBlockFile(scope: !819, file: !175, discriminator: 1)
!833 = !DILocation(line: 2096, column: 4, scope: !819)
!834 = !DILocation(line: 2096, column: 7, scope: !819)
!835 = !DILocation(line: 2096, column: 10, scope: !819)
!836 = !DILocation(line: 2097, column: 4, scope: !819)
!837 = !DILocation(line: 2097, column: 7, scope: !819)
!838 = !DILocation(line: 2097, column: 18, scope: !819)
!839 = !DILocation(line: 2098, column: 4, scope: !819)
!840 = !DILocation(line: 2098, column: 7, scope: !819)
!841 = !DILocation(line: 2098, column: 19, scope: !819)
!842 = !DILocation(line: 2099, column: 23, scope: !819)
!843 = !DILocation(line: 2099, column: 26, scope: !819)
!844 = !DILocation(line: 2099, column: 4, scope: !819)
!845 = !DILocation(line: 2099, column: 7, scope: !819)
!846 = !DILocation(line: 2099, column: 19, scope: !819)
!847 = !DILocation(line: 2100, column: 4, scope: !819)
!848 = !DILocation(line: 2100, column: 7, scope: !819)
!849 = !DILocation(line: 2100, column: 14, scope: !819)
!850 = !DILocation(line: 2100, column: 17, scope: !819)
!851 = !DILocation(line: 2102, column: 8, scope: !852)
!852 = distinct !DILexicalBlock(scope: !819, file: !175, line: 2102, column: 8)
!853 = !DILocation(line: 2102, column: 19, scope: !852)
!854 = !DILocation(line: 2102, column: 22, scope: !855)
!855 = !DILexicalBlockFile(scope: !852, file: !175, discriminator: 1)
!856 = !DILocation(line: 2102, column: 34, scope: !855)
!857 = !DILocation(line: 2102, column: 8, scope: !855)
!858 = !DILocation(line: 2103, column: 7, scope: !859)
!859 = distinct !DILexicalBlock(scope: !852, file: !175, line: 2102, column: 41)
!860 = !DILocation(line: 2103, column: 10, scope: !859)
!861 = !DILocation(line: 2103, column: 25, scope: !859)
!862 = !DILocation(line: 2104, column: 7, scope: !859)
!863 = !DILocation(line: 2104, column: 10, scope: !859)
!864 = !DILocation(line: 2104, column: 25, scope: !859)
!865 = !DILocation(line: 2105, column: 4, scope: !859)
!866 = !DILocation(line: 2106, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !852, file: !175, line: 2105, column: 11)
!868 = !DILocation(line: 2106, column: 10, scope: !867)
!869 = !DILocation(line: 2106, column: 25, scope: !867)
!870 = !DILocation(line: 2107, column: 7, scope: !867)
!871 = !DILocation(line: 2107, column: 10, scope: !867)
!872 = !DILocation(line: 2107, column: 25, scope: !867)
!873 = !DILocation(line: 2110, column: 11, scope: !819)
!874 = !DILocation(line: 2110, column: 4, scope: !819)
!875 = distinct !DISubprogram(name: "AsyncTCPSocketSetState", scope: !175, file: !175, line: 519, type: !876, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !173, !205}
!878 = !DILocalVariable(name: "asock", arg: 1, scope: !875, file: !175, line: 519, type: !173)
!879 = !DILocation(line: 519, column: 40, scope: !875)
!880 = !DILocalVariable(name: "state", arg: 2, scope: !875, file: !175, line: 519, type: !205)
!881 = !DILocation(line: 519, column: 64, scope: !875)
!882 = !DILocation(line: 521, column: 35, scope: !875)
!883 = !DILocation(line: 521, column: 24, scope: !875)
!884 = !DILocation(line: 521, column: 43, scope: !875)
!885 = !DILocation(line: 521, column: 4, scope: !886)
!886 = !DILexicalBlockFile(scope: !875, file: !175, discriminator: 1)
!887 = !DILocation(line: 522, column: 1, scope: !875)
!888 = distinct !DISubprogram(name: "AsyncTCPSocketListenerError", scope: !175, file: !175, line: 6050, type: !211, isLocal: true, isDefinition: true, scopeLine: 6053, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!889 = !DILocalVariable(name: "error", arg: 1, scope: !888, file: !175, line: 6050, type: !165)
!890 = !DILocation(line: 6050, column: 33, scope: !888)
!891 = !DILocalVariable(name: "asock", arg: 2, scope: !888, file: !175, line: 6051, type: !213)
!892 = !DILocation(line: 6051, column: 42, scope: !888)
!893 = !DILocalVariable(name: "clientData", arg: 3, scope: !888, file: !175, line: 6052, type: !80)
!894 = !DILocation(line: 6052, column: 35, scope: !888)
!895 = !DILocalVariable(name: "s", scope: !888, file: !175, line: 6054, type: !213)
!896 = !DILocation(line: 6054, column: 17, scope: !888)
!897 = !DILocation(line: 6054, column: 21, scope: !888)
!898 = !DILocation(line: 6057, column: 27, scope: !888)
!899 = !DILocation(line: 6057, column: 30, scope: !888)
!900 = !DILocation(line: 6057, column: 4, scope: !888)
!901 = !DILocation(line: 6058, column: 1, scope: !888)
!902 = distinct !DISubprogram(name: "AsyncSocket_ListenLoopback", scope: !175, file: !175, line: 1138, type: !903, isLocal: false, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!903 = !DISubroutineType(types: !904)
!904 = !{!213, !85, !401, !80, !478, !342}
!905 = !DILocalVariable(name: "port", arg: 1, scope: !902, file: !175, line: 1138, type: !85)
!906 = !DILocation(line: 1138, column: 41, scope: !902)
!907 = !DILocalVariable(name: "connectFn", arg: 2, scope: !902, file: !175, line: 1139, type: !401)
!908 = !DILocation(line: 1139, column: 49, scope: !902)
!909 = !DILocalVariable(name: "clientData", arg: 3, scope: !902, file: !175, line: 1140, type: !80)
!910 = !DILocation(line: 1140, column: 34, scope: !902)
!911 = !DILocalVariable(name: "pollParams", arg: 4, scope: !902, file: !175, line: 1141, type: !478)
!912 = !DILocation(line: 1141, column: 51, scope: !902)
!913 = !DILocalVariable(name: "outError", arg: 5, scope: !902, file: !175, line: 1142, type: !342)
!914 = !DILocation(line: 1142, column: 33, scope: !902)
!915 = !DILocalVariable(name: "asock6", scope: !902, file: !175, line: 1144, type: !173)
!916 = !DILocation(line: 1144, column: 20, scope: !902)
!917 = !DILocalVariable(name: "asock4", scope: !902, file: !175, line: 1145, type: !173)
!918 = !DILocation(line: 1145, column: 20, scope: !902)
!919 = !DILocalVariable(name: "tempError4", scope: !902, file: !175, line: 1146, type: !165)
!920 = !DILocation(line: 1146, column: 8, scope: !902)
!921 = !DILocalVariable(name: "tempError6", scope: !902, file: !175, line: 1147, type: !165)
!922 = !DILocation(line: 1147, column: 8, scope: !902)
!923 = !DILocation(line: 1154, column: 53, scope: !902)
!924 = !DILocation(line: 1155, column: 46, scope: !902)
!925 = !DILocation(line: 1155, column: 57, scope: !902)
!926 = !DILocation(line: 1155, column: 69, scope: !902)
!927 = !DILocation(line: 1154, column: 13, scope: !902)
!928 = !DILocation(line: 1154, column: 11, scope: !902)
!929 = !DILocation(line: 1158, column: 59, scope: !902)
!930 = !DILocation(line: 1159, column: 46, scope: !902)
!931 = !DILocation(line: 1159, column: 57, scope: !902)
!932 = !DILocation(line: 1159, column: 69, scope: !902)
!933 = !DILocation(line: 1158, column: 13, scope: !902)
!934 = !DILocation(line: 1158, column: 11, scope: !902)
!935 = !DILocation(line: 1162, column: 8, scope: !936)
!936 = distinct !DILexicalBlock(scope: !902, file: !175, line: 1162, column: 8)
!937 = !DILocation(line: 1162, column: 15, scope: !936)
!938 = !DILocation(line: 1162, column: 18, scope: !939)
!939 = !DILexicalBlockFile(scope: !936, file: !175, discriminator: 1)
!940 = !DILocation(line: 1162, column: 8, scope: !939)
!941 = !DILocalVariable(name: "asock", scope: !942, file: !175, line: 1163, type: !173)
!942 = distinct !DILexicalBlock(scope: !936, file: !175, line: 1162, column: 26)
!943 = !DILocation(line: 1163, column: 23, scope: !942)
!944 = !DILocation(line: 1165, column: 36, scope: !942)
!945 = !DILocation(line: 1165, column: 15, scope: !942)
!946 = !DILocation(line: 1165, column: 13, scope: !942)
!947 = !DILocation(line: 1166, column: 30, scope: !942)
!948 = !DILocation(line: 1166, column: 7, scope: !942)
!949 = !DILocation(line: 1167, column: 29, scope: !942)
!950 = !DILocation(line: 1167, column: 7, scope: !942)
!951 = !DILocation(line: 1167, column: 14, scope: !942)
!952 = !DILocation(line: 1167, column: 27, scope: !942)
!953 = !DILocation(line: 1168, column: 29, scope: !942)
!954 = !DILocation(line: 1168, column: 7, scope: !942)
!955 = !DILocation(line: 1168, column: 14, scope: !942)
!956 = !DILocation(line: 1168, column: 27, scope: !942)
!957 = !DILocation(line: 1170, column: 25, scope: !942)
!958 = !DILocation(line: 1170, column: 14, scope: !942)
!959 = !DILocation(line: 1170, column: 7, scope: !942)
!960 = !DILocation(line: 1171, column: 15, scope: !961)
!961 = distinct !DILexicalBlock(scope: !936, file: !175, line: 1171, column: 15)
!962 = !DILocation(line: 1171, column: 15, scope: !936)
!963 = !DILocation(line: 1172, column: 25, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !175, line: 1171, column: 23)
!965 = !DILocation(line: 1172, column: 14, scope: !964)
!966 = !DILocation(line: 1172, column: 7, scope: !964)
!967 = !DILocation(line: 1173, column: 15, scope: !968)
!968 = distinct !DILexicalBlock(scope: !961, file: !175, line: 1173, column: 15)
!969 = !DILocation(line: 1173, column: 15, scope: !961)
!970 = !DILocation(line: 1174, column: 25, scope: !971)
!971 = distinct !DILexicalBlock(scope: !968, file: !175, line: 1173, column: 23)
!972 = !DILocation(line: 1174, column: 14, scope: !971)
!973 = !DILocation(line: 1174, column: 7, scope: !971)
!974 = !DILocation(line: 1177, column: 8, scope: !975)
!975 = distinct !DILexicalBlock(scope: !902, file: !175, line: 1177, column: 8)
!976 = !DILocation(line: 1177, column: 8, scope: !902)
!977 = !DILocation(line: 1179, column: 12, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !175, line: 1179, column: 11)
!979 = distinct !DILexicalBlock(scope: !975, file: !175, line: 1177, column: 18)
!980 = !DILocation(line: 1179, column: 11, scope: !979)
!981 = !DILocation(line: 1180, column: 22, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !175, line: 1179, column: 20)
!983 = !DILocation(line: 1180, column: 11, scope: !982)
!984 = !DILocation(line: 1180, column: 20, scope: !982)
!985 = !DILocation(line: 1181, column: 7, scope: !982)
!986 = !DILocation(line: 1181, column: 19, scope: !987)
!987 = !DILexicalBlockFile(scope: !988, file: !175, discriminator: 1)
!988 = distinct !DILexicalBlock(scope: !978, file: !175, line: 1181, column: 18)
!989 = !DILocation(line: 1181, column: 18, scope: !987)
!990 = !DILocation(line: 1182, column: 22, scope: !991)
!991 = distinct !DILexicalBlock(scope: !988, file: !175, line: 1181, column: 27)
!992 = !DILocation(line: 1182, column: 11, scope: !991)
!993 = !DILocation(line: 1182, column: 20, scope: !991)
!994 = !DILocation(line: 1183, column: 7, scope: !991)
!995 = !DILocation(line: 1184, column: 11, scope: !996)
!996 = distinct !DILexicalBlock(scope: !988, file: !175, line: 1183, column: 14)
!997 = !DILocation(line: 1184, column: 20, scope: !996)
!998 = !DILocation(line: 1186, column: 4, scope: !979)
!999 = !DILocation(line: 1188, column: 4, scope: !902)
!1000 = !DILocation(line: 1189, column: 1, scope: !902)
!1001 = distinct !DISubprogram(name: "AsyncSocket_ListenVMCI", scope: !175, file: !175, line: 1210, type: !1002, isLocal: false, isDefinition: true, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!213, !85, !85, !401, !80, !478, !342}
!1004 = !DILocalVariable(name: "cid", arg: 1, scope: !1001, file: !175, line: 1210, type: !85)
!1005 = !DILocation(line: 1210, column: 37, scope: !1001)
!1006 = !DILocalVariable(name: "port", arg: 2, scope: !1001, file: !175, line: 1211, type: !85)
!1007 = !DILocation(line: 1211, column: 37, scope: !1001)
!1008 = !DILocalVariable(name: "connectFn", arg: 3, scope: !1001, file: !175, line: 1212, type: !401)
!1009 = !DILocation(line: 1212, column: 45, scope: !1001)
!1010 = !DILocalVariable(name: "clientData", arg: 4, scope: !1001, file: !175, line: 1213, type: !80)
!1011 = !DILocation(line: 1213, column: 30, scope: !1001)
!1012 = !DILocalVariable(name: "pollParams", arg: 5, scope: !1001, file: !175, line: 1214, type: !478)
!1013 = !DILocation(line: 1214, column: 47, scope: !1001)
!1014 = !DILocalVariable(name: "outError", arg: 6, scope: !1001, file: !175, line: 1215, type: !342)
!1015 = !DILocation(line: 1215, column: 29, scope: !1001)
!1016 = !DILocalVariable(name: "addr", scope: !1001, file: !175, line: 1217, type: !154)
!1017 = !DILocation(line: 1217, column: 23, scope: !1001)
!1018 = !DILocalVariable(name: "asock", scope: !1001, file: !175, line: 1218, type: !173)
!1019 = !DILocation(line: 1218, column: 20, scope: !1001)
!1020 = !DILocalVariable(name: "vsockDev", scope: !1001, file: !175, line: 1219, type: !165)
!1021 = !DILocation(line: 1219, column: 8, scope: !1001)
!1022 = !DILocation(line: 1221, column: 4, scope: !1001)
!1023 = !DILocation(line: 1222, column: 22, scope: !1001)
!1024 = !DILocation(line: 1222, column: 9, scope: !1001)
!1025 = !DILocation(line: 1222, column: 20, scope: !1001)
!1026 = !DILocation(line: 1223, column: 19, scope: !1001)
!1027 = !DILocation(line: 1223, column: 9, scope: !1001)
!1028 = !DILocation(line: 1223, column: 17, scope: !1001)
!1029 = !DILocation(line: 1224, column: 20, scope: !1001)
!1030 = !DILocation(line: 1224, column: 9, scope: !1001)
!1031 = !DILocation(line: 1224, column: 18, scope: !1001)
!1032 = !DILocation(line: 1226, column: 37, scope: !1001)
!1033 = !DILocation(line: 1228, column: 37, scope: !1001)
!1034 = !DILocation(line: 1228, column: 48, scope: !1001)
!1035 = !DILocation(line: 1228, column: 60, scope: !1001)
!1036 = !DILocation(line: 1229, column: 37, scope: !1001)
!1037 = !DILocation(line: 1226, column: 12, scope: !1001)
!1038 = !DILocation(line: 1226, column: 10, scope: !1001)
!1039 = !DILocation(line: 1231, column: 30, scope: !1001)
!1040 = !DILocation(line: 1231, column: 4, scope: !1001)
!1041 = !DILocation(line: 1232, column: 22, scope: !1001)
!1042 = !DILocation(line: 1232, column: 11, scope: !1001)
!1043 = !DILocation(line: 1232, column: 4, scope: !1001)
!1044 = distinct !DISubprogram(name: "VMCISock_GetAFValueFd", scope: !155, file: !155, line: 657, type: !1045, isLocal: true, isDefinition: true, scopeLine: 658, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!165, !342}
!1047 = !DILocalVariable(name: "outFd", arg: 1, scope: !1044, file: !155, line: 657, type: !342)
!1048 = !DILocation(line: 657, column: 49, scope: !1044)
!1049 = !DILocalVariable(name: "fd", scope: !1044, file: !155, line: 659, type: !165)
!1050 = !DILocation(line: 659, column: 11, scope: !1044)
!1051 = !DILocalVariable(name: "family", scope: !1044, file: !155, line: 660, type: !165)
!1052 = !DILocation(line: 660, column: 11, scope: !1044)
!1053 = !DILocalVariable(name: "s", scope: !1054, file: !155, line: 676, type: !165)
!1054 = distinct !DILexicalBlock(scope: !1044, file: !155, line: 675, column: 7)
!1055 = !DILocation(line: 676, column: 14, scope: !1054)
!1056 = !DILocation(line: 676, column: 18, scope: !1054)
!1057 = !DILocation(line: 677, column: 14, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1054, file: !155, line: 677, column: 14)
!1059 = !DILocation(line: 677, column: 16, scope: !1058)
!1060 = !DILocation(line: 677, column: 14, scope: !1054)
!1061 = !DILocation(line: 678, column: 19, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !155, line: 677, column: 23)
!1063 = !DILocation(line: 678, column: 13, scope: !1062)
!1064 = !DILocation(line: 679, column: 17, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1062, file: !155, line: 679, column: 17)
!1066 = !DILocation(line: 679, column: 17, scope: !1062)
!1067 = !DILocation(line: 680, column: 17, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1065, file: !155, line: 679, column: 24)
!1069 = !DILocation(line: 680, column: 23, scope: !1068)
!1070 = !DILocation(line: 681, column: 13, scope: !1068)
!1071 = !DILocation(line: 682, column: 13, scope: !1062)
!1072 = !DILocation(line: 688, column: 12, scope: !1044)
!1073 = !DILocation(line: 688, column: 10, scope: !1044)
!1074 = !DILocation(line: 689, column: 11, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1044, file: !155, line: 689, column: 11)
!1076 = !DILocation(line: 689, column: 14, scope: !1075)
!1077 = !DILocation(line: 689, column: 11, scope: !1044)
!1078 = !DILocation(line: 690, column: 15, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1075, file: !155, line: 689, column: 19)
!1080 = !DILocation(line: 690, column: 13, scope: !1079)
!1081 = !DILocation(line: 691, column: 14, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !155, line: 691, column: 14)
!1083 = !DILocation(line: 691, column: 17, scope: !1082)
!1084 = !DILocation(line: 691, column: 14, scope: !1079)
!1085 = !DILocation(line: 692, column: 13, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1082, file: !155, line: 691, column: 22)
!1087 = !DILocation(line: 694, column: 7, scope: !1079)
!1088 = !DILocation(line: 696, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1044, file: !155, line: 696, column: 11)
!1090 = !DILocation(line: 696, column: 11, scope: !1089)
!1091 = !DILocation(line: 696, column: 36, scope: !1089)
!1092 = !DILocation(line: 696, column: 11, scope: !1044)
!1093 = !DILocation(line: 697, column: 17, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1089, file: !155, line: 696, column: 41)
!1095 = !DILocation(line: 698, column: 7, scope: !1094)
!1096 = !DILocation(line: 700, column: 11, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1044, file: !155, line: 700, column: 11)
!1098 = !DILocation(line: 700, column: 18, scope: !1097)
!1099 = !DILocation(line: 700, column: 11, scope: !1044)
!1100 = !DILocation(line: 701, column: 16, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1097, file: !155, line: 700, column: 23)
!1102 = !DILocation(line: 701, column: 10, scope: !1101)
!1103 = !DILocation(line: 702, column: 7, scope: !1101)
!1104 = !DILocation(line: 702, column: 18, scope: !1105)
!1105 = !DILexicalBlockFile(scope: !1106, file: !155, discriminator: 1)
!1106 = distinct !DILexicalBlock(scope: !1097, file: !155, line: 702, column: 18)
!1107 = !DILocation(line: 703, column: 19, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !155, line: 702, column: 25)
!1109 = !DILocation(line: 703, column: 11, scope: !1108)
!1110 = !DILocation(line: 703, column: 17, scope: !1108)
!1111 = !DILocation(line: 704, column: 7, scope: !1108)
!1112 = !DILocation(line: 706, column: 14, scope: !1044)
!1113 = !DILocation(line: 706, column: 7, scope: !1044)
!1114 = !DILocation(line: 707, column: 4, scope: !1044)
!1115 = distinct !DISubprogram(name: "AsyncTCPSocketListenImpl", scope: !175, file: !175, line: 885, type: !1116, isLocal: true, isDefinition: true, scopeLine: 891, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!173, !86, !242, !401, !80, !478, !342}
!1118 = !DILocalVariable(name: "addr", arg: 1, scope: !1115, file: !175, line: 885, type: !86)
!1119 = !DILocation(line: 885, column: 51, scope: !1115)
!1120 = !DILocalVariable(name: "addrLen", arg: 2, scope: !1115, file: !175, line: 886, type: !242)
!1121 = !DILocation(line: 886, column: 36, scope: !1115)
!1122 = !DILocalVariable(name: "connectFn", arg: 3, scope: !1115, file: !175, line: 887, type: !401)
!1123 = !DILocation(line: 887, column: 47, scope: !1115)
!1124 = !DILocalVariable(name: "clientData", arg: 4, scope: !1115, file: !175, line: 888, type: !80)
!1125 = !DILocation(line: 888, column: 32, scope: !1115)
!1126 = !DILocalVariable(name: "pollParams", arg: 5, scope: !1115, file: !175, line: 889, type: !478)
!1127 = !DILocation(line: 889, column: 49, scope: !1115)
!1128 = !DILocalVariable(name: "outError", arg: 6, scope: !1115, file: !175, line: 890, type: !342)
!1129 = !DILocation(line: 890, column: 31, scope: !1115)
!1130 = !DILocalVariable(name: "asock", scope: !1115, file: !175, line: 892, type: !173)
!1131 = !DILocation(line: 892, column: 20, scope: !1115)
!1132 = !DILocation(line: 892, column: 47, scope: !1115)
!1133 = !DILocation(line: 892, column: 53, scope: !1115)
!1134 = !DILocation(line: 892, column: 64, scope: !1115)
!1135 = !DILocation(line: 893, column: 47, scope: !1115)
!1136 = !DILocation(line: 892, column: 28, scope: !1115)
!1137 = !DILocation(line: 895, column: 8, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1115, file: !175, line: 895, column: 8)
!1139 = !DILocation(line: 895, column: 14, scope: !1138)
!1140 = !DILocation(line: 895, column: 8, scope: !1115)
!1141 = !DILocation(line: 896, column: 30, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !175, line: 896, column: 11)
!1143 = distinct !DILexicalBlock(scope: !1138, file: !175, line: 895, column: 22)
!1144 = !DILocation(line: 896, column: 37, scope: !1142)
!1145 = !DILocation(line: 896, column: 43, scope: !1142)
!1146 = !DILocation(line: 896, column: 52, scope: !1142)
!1147 = !DILocation(line: 896, column: 11, scope: !1142)
!1148 = !DILocation(line: 896, column: 62, scope: !1142)
!1149 = !DILocation(line: 897, column: 32, scope: !1142)
!1150 = !DILocation(line: 897, column: 39, scope: !1142)
!1151 = !DILocation(line: 897, column: 50, scope: !1142)
!1152 = !DILocation(line: 897, column: 62, scope: !1142)
!1153 = !DILocation(line: 897, column: 11, scope: !1142)
!1154 = !DILocation(line: 896, column: 11, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1143, file: !175, discriminator: 1)
!1156 = !DILocation(line: 898, column: 17, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1142, file: !175, line: 897, column: 73)
!1158 = !DILocation(line: 898, column: 10, scope: !1157)
!1159 = !DILocation(line: 900, column: 4, scope: !1143)
!1160 = !DILocation(line: 902, column: 4, scope: !1115)
!1161 = !DILocation(line: 903, column: 1, scope: !1115)
!1162 = distinct !DISubprogram(name: "VMCISock_ReleaseAFValueFd", scope: !155, file: !155, line: 772, type: !1163, isLocal: true, isDefinition: true, scopeLine: 773, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{null, !165}
!1165 = !DILocalVariable(name: "fd", arg: 1, scope: !1162, file: !155, line: 772, type: !165)
!1166 = !DILocation(line: 772, column: 53, scope: !1162)
!1167 = !DILocation(line: 774, column: 11, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1162, file: !155, line: 774, column: 11)
!1169 = !DILocation(line: 774, column: 14, scope: !1168)
!1170 = !DILocation(line: 774, column: 11, scope: !1162)
!1171 = !DILocation(line: 775, column: 16, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !155, line: 774, column: 20)
!1173 = !DILocation(line: 775, column: 10, scope: !1172)
!1174 = !DILocation(line: 776, column: 7, scope: !1172)
!1175 = !DILocation(line: 777, column: 4, scope: !1162)
!1176 = distinct !DISubprogram(name: "AsyncSocket_Connect", scope: !175, file: !175, line: 1732, type: !1177, isLocal: false, isDefinition: true, scopeLine: 1739, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!213, !260, !85, !401, !80, !1179, !478, !342}
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketConnectFlags", file: !4, line: 144, baseType: !15)
!1180 = !DILocalVariable(name: "hostname", arg: 1, scope: !1176, file: !175, line: 1732, type: !260)
!1181 = !DILocation(line: 1732, column: 33, scope: !1176)
!1182 = !DILocalVariable(name: "port", arg: 2, scope: !1176, file: !175, line: 1733, type: !85)
!1183 = !DILocation(line: 1733, column: 34, scope: !1176)
!1184 = !DILocalVariable(name: "connectFn", arg: 3, scope: !1176, file: !175, line: 1734, type: !401)
!1185 = !DILocation(line: 1734, column: 42, scope: !1176)
!1186 = !DILocalVariable(name: "clientData", arg: 4, scope: !1176, file: !175, line: 1735, type: !80)
!1187 = !DILocation(line: 1735, column: 27, scope: !1176)
!1188 = !DILocalVariable(name: "flags", arg: 5, scope: !1176, file: !175, line: 1736, type: !1179)
!1189 = !DILocation(line: 1736, column: 45, scope: !1176)
!1190 = !DILocalVariable(name: "pollParams", arg: 6, scope: !1176, file: !175, line: 1737, type: !478)
!1191 = !DILocation(line: 1737, column: 44, scope: !1176)
!1192 = !DILocalVariable(name: "outError", arg: 7, scope: !1176, file: !175, line: 1738, type: !342)
!1193 = !DILocation(line: 1738, column: 26, scope: !1176)
!1194 = !DILocalVariable(name: "error", scope: !1176, file: !175, line: 1740, type: !165)
!1195 = !DILocation(line: 1740, column: 8, scope: !1176)
!1196 = !DILocalVariable(name: "asock", scope: !1176, file: !175, line: 1741, type: !173)
!1197 = !DILocation(line: 1741, column: 20, scope: !1176)
!1198 = !DILocation(line: 1743, column: 9, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1176, file: !175, line: 1743, column: 8)
!1200 = !DILocation(line: 1743, column: 19, scope: !1199)
!1201 = !DILocation(line: 1743, column: 23, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1199, file: !175, discriminator: 1)
!1203 = !DILocation(line: 1743, column: 8, scope: !1202)
!1204 = !DILocation(line: 1744, column: 13, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1199, file: !175, line: 1743, column: 33)
!1206 = !DILocation(line: 1745, column: 7, scope: !1205)
!1207 = !DILocation(line: 1746, column: 1, scope: !1205)
!1208 = !DILocation(line: 1747, column: 7, scope: !1205)
!1209 = !DILocation(line: 1749, column: 46, scope: !1176)
!1210 = !DILocation(line: 1749, column: 56, scope: !1176)
!1211 = !DILocation(line: 1749, column: 62, scope: !1176)
!1212 = !DILocation(line: 1750, column: 35, scope: !1176)
!1213 = !DILocation(line: 1750, column: 47, scope: !1176)
!1214 = !DILocation(line: 1750, column: 54, scope: !1176)
!1215 = !DILocation(line: 1750, column: 12, scope: !1176)
!1216 = !DILocation(line: 1750, column: 10, scope: !1176)
!1217 = !DILocation(line: 1751, column: 9, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1176, file: !175, line: 1751, column: 8)
!1219 = !DILocation(line: 1751, column: 8, scope: !1176)
!1220 = !DILocation(line: 1752, column: 50, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1218, file: !175, line: 1751, column: 16)
!1222 = !DILocation(line: 1752, column: 60, scope: !1221)
!1223 = !DILocation(line: 1752, column: 66, scope: !1221)
!1224 = !DILocation(line: 1753, column: 38, scope: !1221)
!1225 = !DILocation(line: 1753, column: 50, scope: !1221)
!1226 = !DILocation(line: 1753, column: 57, scope: !1221)
!1227 = !DILocation(line: 1752, column: 15, scope: !1221)
!1228 = !DILocation(line: 1752, column: 13, scope: !1221)
!1229 = !DILocation(line: 1754, column: 4, scope: !1221)
!1230 = !DILocation(line: 1751, column: 9, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1218, file: !175, discriminator: 1)
!1232 = !DILocation(line: 1757, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1176, file: !175, line: 1757, column: 8)
!1234 = !DILocation(line: 1757, column: 15, scope: !1233)
!1235 = !DILocation(line: 1757, column: 18, scope: !1236)
!1236 = !DILexicalBlockFile(scope: !1233, file: !175, discriminator: 1)
!1237 = !DILocation(line: 1757, column: 8, scope: !1236)
!1238 = !DILocation(line: 1758, column: 19, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1233, file: !175, line: 1757, column: 28)
!1240 = !DILocation(line: 1758, column: 8, scope: !1239)
!1241 = !DILocation(line: 1758, column: 17, scope: !1239)
!1242 = !DILocation(line: 1759, column: 4, scope: !1239)
!1243 = !DILocation(line: 1761, column: 22, scope: !1176)
!1244 = !DILocation(line: 1761, column: 11, scope: !1176)
!1245 = !DILocation(line: 1761, column: 4, scope: !1176)
!1246 = distinct !DISubprogram(name: "AsyncTCPSocketConnectImpl", scope: !175, file: !175, line: 1657, type: !1247, isLocal: true, isDefinition: true, scopeLine: 1665, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !463)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!173, !165, !260, !85, !401, !80, !1179, !478, !342}
!1249 = !DILocalVariable(name: "socketFamily", arg: 1, scope: !1246, file: !175, line: 1657, type: !165)
!1250 = !DILocation(line: 1657, column: 31, scope: !1246)
!1251 = !DILocalVariable(name: "hostname", arg: 2, scope: !1246, file: !175, line: 1658, type: !260)
!1252 = !DILocation(line: 1658, column: 39, scope: !1246)
!1253 = !DILocalVariable(name: "port", arg: 3, scope: !1246, file: !175, line: 1659, type: !85)
!1254 = !DILocation(line: 1659, column: 40, scope: !1246)
!1255 = !DILocalVariable(name: "connectFn", arg: 4, scope: !1246, file: !175, line: 1660, type: !401)
!1256 = !DILocation(line: 1660, column: 48, scope: !1246)
!1257 = !DILocalVariable(name: "clientData", arg: 5, scope: !1246, file: !175, line: 1661, type: !80)
!1258 = !DILocation(line: 1661, column: 33, scope: !1246)
!1259 = !DILocalVariable(name: "flags", arg: 6, scope: !1246, file: !175, line: 1662, type: !1179)
!1260 = !DILocation(line: 1662, column: 51, scope: !1246)
!1261 = !DILocalVariable(name: "pollParams", arg: 7, scope: !1246, file: !175, line: 1663, type: !478)
!1262 = !DILocation(line: 1663, column: 50, scope: !1246)
!1263 = !DILocalVariable(name: "outError", arg: 8, scope: !1246, file: !175, line: 1664, type: !342)
!1264 = !DILocation(line: 1664, column: 32, scope: !1246)
!1265 = !DILocalVariable(name: "addr", scope: !1246, file: !175, line: 1666, type: !87)
!1266 = !DILocation(line: 1666, column: 28, scope: !1246)
!1267 = !DILocalVariable(name: "getaddrinfoError", scope: !1246, file: !175, line: 1667, type: !165)
!1268 = !DILocation(line: 1667, column: 8, scope: !1246)
!1269 = !DILocalVariable(name: "error", scope: !1246, file: !175, line: 1668, type: !165)
!1270 = !DILocation(line: 1668, column: 8, scope: !1246)
!1271 = !DILocalVariable(name: "asock", scope: !1246, file: !175, line: 1669, type: !173)
!1272 = !DILocation(line: 1669, column: 20, scope: !1246)
!1273 = !DILocalVariable(name: "ipString", scope: !1246, file: !175, line: 1670, type: !267)
!1274 = !DILocation(line: 1670, column: 10, scope: !1246)
!1275 = !DILocalVariable(name: "addrLen", scope: !1246, file: !175, line: 1671, type: !242)
!1276 = !DILocation(line: 1671, column: 14, scope: !1246)
!1277 = !DILocation(line: 1677, column: 49, scope: !1246)
!1278 = !DILocation(line: 1677, column: 59, scope: !1246)
!1279 = !DILocation(line: 1677, column: 65, scope: !1246)
!1280 = !DILocation(line: 1677, column: 23, scope: !1246)
!1281 = !DILocation(line: 1677, column: 21, scope: !1246)
!1282 = !DILocation(line: 1680, column: 13, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1246, file: !175, line: 1680, column: 8)
!1284 = !DILocation(line: 1680, column: 10, scope: !1283)
!1285 = !DILocation(line: 1680, column: 8, scope: !1246)
!1286 = !DILocation(line: 1682, column: 11, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1283, file: !175, line: 1680, column: 31)
!1288 = !DILocation(line: 1682, column: 24, scope: !1287)
!1289 = !DILocation(line: 1682, column: 53, scope: !1287)
!1290 = !DILocation(line: 1682, column: 63, scope: !1287)
!1291 = !DILocation(line: 1681, column: 7, scope: !1287)
!1292 = !DILocation(line: 1683, column: 13, scope: !1287)
!1293 = !DILocation(line: 1684, column: 1, scope: !1287)
!1294 = !DILocation(line: 1685, column: 7, scope: !1287)
!1295 = !DILocation(line: 1689, column: 8, scope: !1246)
!1296 = !DILocation(line: 1689, column: 21, scope: !1246)
!1297 = !DILocation(line: 1688, column: 50, scope: !1246)
!1298 = !DILocation(line: 1688, column: 60, scope: !1246)
!1299 = !DILocation(line: 1688, column: 4, scope: !1246)
!1300 = !DILocation(line: 1689, column: 9, scope: !1246)
!1301 = !DILocation(line: 1689, column: 4, scope: !1246)
!1302 = !DILocation(line: 1691, column: 41, scope: !1246)
!1303 = !DILocation(line: 1691, column: 50, scope: !1246)
!1304 = !DILocation(line: 1691, column: 61, scope: !1246)
!1305 = !DILocation(line: 1692, column: 34, scope: !1246)
!1306 = !DILocation(line: 1692, column: 41, scope: !1246)
!1307 = !DILocation(line: 1691, column: 12, scope: !1246)
!1308 = !DILocation(line: 1691, column: 10, scope: !1246)
!1309 = !DILocation(line: 1693, column: 9, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1246, file: !175, line: 1693, column: 8)
!1311 = !DILocation(line: 1693, column: 8, scope: !1246)
!1312 = !DILocation(line: 1695, column: 15, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1310, file: !175, line: 1693, column: 16)
!1314 = !DILocation(line: 1695, column: 28, scope: !1313)
!1315 = !DILocation(line: 1696, column: 36, scope: !1313)
!1316 = !DILocation(line: 1696, column: 15, scope: !1313)
!1317 = !DILocation(line: 1694, column: 7, scope: !1313)
!1318 = !DILocation(line: 1697, column: 1, scope: !1313)
!1319 = !DILocation(line: 1698, column: 7, scope: !1313)
!1320 = !DILocation(line: 1701, column: 11, scope: !1246)
