; ModuleID = './libhgfsServer_la-hgfsPlugin.o.i'
source_filename = "./libhgfsServer_la-hgfsPlugin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.HgfsServerMgrData = type { i8*, i8*, i8*, i8* }
%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsPluginSignalCb = type { i8*, i8*, i8* }
%struct.ToolsAppReg = type { i32, %struct._GArray* }

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@ToolsOnLoad.regData = internal global %struct.ToolsPluginData { i8* getelementptr inbounds ([11 x i8], [11 x i8]* @.str, i32 0, i32 0), %struct._GArray* null, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)* null, i8* null }, align 8
@.str = private unnamed_addr constant [11 x i8] c"hgfsServer\00", align 1
@.str.1 = private unnamed_addr constant [6 x i8] c"vmsvc\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"vmusr\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !34, globals: !36)
!1 = !DIFile(filename: "libhgfsServer_la-hgfsPlugin.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!2 = !{!3, !7, !13, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 232, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!5 = !{!6}
!6 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!7 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 339, size: 32, align: 32, elements: !8)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!10 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 35, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_vmx_type.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!15 = !{!16, !17, !18, !19, !20, !21}
!16 = !DIEnumerator(name: "VMX_TYPE_UNSET", value: 0)
!17 = !DIEnumerator(name: "VMX_TYPE_EXPRESS", value: 1)
!18 = !DIEnumerator(name: "VMX_TYPE_SCALABLE_SERVER", value: 2)
!19 = !DIEnumerator(name: "VMX_TYPE_WGS", value: 3)
!20 = !DIEnumerator(name: "VMX_TYPE_WORKSTATION", value: 4)
!21 = !DIEnumerator(name: "VMX_TYPE_WORKSTATION_ENTERPRISE", value: 5)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 51, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33}
!25 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!26 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!27 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!28 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!29 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!30 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!31 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!32 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!33 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !{!37, !44, !110}
!37 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !38, line: 55, type: !39, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!38 = !DIFile(filename: "hgfsPlugin.c", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, align: 8, elements: !42)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !{!43}
!43 = !DISubrange(count: 20)
!44 = distinct !DIGlobalVariable(name: "regData", scope: !45, file: !38, line: 1078, type: !49, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!45 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !38, file: !38, line: 1076, type: !46, isLocal: false, isDefinition: true, scopeLine: 1077, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !74}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !51)
!51 = !{!52, !54, !67, !108}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !4, line: 503, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !50, file: !4, line: 508, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !57, line: 37, baseType: !58)
!57 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !57, line: 41, size: 128, align: 64, elements: !59)
!59 = !{!60, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !57, line: 43, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !63, line: 46, baseType: !41)
!63 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !58, file: !57, line: 44, baseType: !65, size: 32, align: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !63, line: 55, baseType: !66)
!66 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !50, file: !4, line: 539, baseType: !68, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !74, !106, !105, !107}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !63, line: 50, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !63, line: 49, baseType: !73)
!73 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !77)
!77 = !{!78, !80, !83, !84, !85, !90, !95, !100, !101, !102, !104}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !76, file: !4, line: 243, baseType: !79, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !76, file: !4, line: 245, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !76, file: !4, line: 247, baseType: !71, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !76, file: !4, line: 249, baseType: !73, size: 32, align: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !76, file: !4, line: 251, baseType: !86, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !88, line: 56, baseType: !89)
!88 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !88, line: 56, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !76, file: !4, line: 253, baseType: !91, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !93, line: 48, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !76, file: !4, line: 255, baseType: !96, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !98, line: 48, baseType: !99)
!98 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !98, line: 48, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !76, file: !4, line: 261, baseType: !73, size: 32, align: 32, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !76, file: !4, line: 263, baseType: !73, size: 32, align: 32, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !76, file: !4, line: 265, baseType: !103, size: 64, align: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !76, file: !4, line: 273, baseType: !105, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !63, line: 77, baseType: !35)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !50, file: !4, line: 544, baseType: !105, size: 64, align: 64, offset: 192)
!109 = !{}
!110 = distinct !DIGlobalVariable(name: "reply", scope: !111, file: !38, line: 107, type: !130, isLocal: true, isDefinition: true, variable: [63488 x i8]* @HgfsServerRpcDispatch.reply)
!111 = distinct !DISubprogram(name: "HgfsServerRpcDispatch", scope: !38, file: !38, line: 103, type: !112, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!112 = !DISubroutineType(types: !113)
!113 = !{!71, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !93, line: 77, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !93, line: 51, size: 512, align: 64, elements: !117)
!117 = !{!118, !119, !120, !124, !126, !127, !128, !129}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !93, line: 53, baseType: !53, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !116, file: !93, line: 58, baseType: !53, size: 64, align: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !116, file: !93, line: 60, baseType: !121, size: 64, align: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 216, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !116, file: !93, line: 65, baseType: !125, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !116, file: !93, line: 67, baseType: !121, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !116, file: !93, line: 72, baseType: !71, size: 32, align: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !116, file: !93, line: 74, baseType: !35, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !116, file: !93, line: 76, baseType: !35, size: 64, align: 64, offset: 448)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 507904, align: 8, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 63488)
!133 = !{i32 2, !"Dwarf Version", i32 4}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!136 = !DILocalVariable(name: "ctx", arg: 1, scope: !45, file: !38, line: 1076, type: !74)
!137 = !DIExpression()
!138 = !DILocation(line: 1076, column: 26, scope: !45)
!139 = !DILocalVariable(name: "mgrData", scope: !45, file: !38, line: 1083, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrData", file: !142, line: 49, baseType: !143)
!142 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerManager.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrData", file: !142, line: 44, size: 256, align: 64, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !143, file: !142, line: 45, baseType: !53, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !143, file: !142, line: 46, baseType: !35, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rpcCallback", scope: !143, file: !142, line: 47, baseType: !35, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !143, file: !142, line: 48, baseType: !35, size: 64, align: 64, offset: 192)
!149 = !DILocation(line: 1083, column: 23, scope: !45)
!150 = !DILocalVariable(name: "vmxVersion", scope: !45, file: !38, line: 1084, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !152, line: 173, baseType: !153)
!152 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !154, line: 51, baseType: !66)
!154 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1453")
!155 = !DILocation(line: 1084, column: 11, scope: !45)
!156 = !DILocalVariable(name: "vmxType", scope: !45, file: !38, line: 1085, type: !151)
!157 = !DILocation(line: 1085, column: 11, scope: !45)
!158 = !DILocation(line: 1087, column: 18, scope: !159)
!159 = distinct !DILexicalBlock(scope: !45, file: !38, line: 1087, column: 8)
!160 = !DILocation(line: 1087, column: 24, scope: !159)
!161 = !DILocation(line: 1087, column: 10, scope: !159)
!162 = !DILocation(line: 1087, column: 39, scope: !159)
!163 = !DILocation(line: 1087, column: 45, scope: !159)
!164 = !DILocation(line: 1087, column: 58, scope: !165)
!165 = !DILexicalBlockFile(scope: !159, file: !38, discriminator: 1)
!166 = !DILocation(line: 1087, column: 64, scope: !165)
!167 = !DILocation(line: 1087, column: 50, scope: !165)
!168 = !DILocation(line: 1087, column: 79, scope: !165)
!169 = !DILocation(line: 1087, column: 8, scope: !165)
!170 = !DILocation(line: 1088, column: 93, scope: !171)
!171 = distinct !DILexicalBlock(scope: !159, file: !38, line: 1087, column: 86)
!172 = !DILocation(line: 1088, column: 98, scope: !171)
!173 = !DILocation(line: 1088, column: 7, scope: !171)
!174 = !DILocation(line: 1089, column: 7, scope: !171)
!175 = !DILocation(line: 1096, column: 8, scope: !176)
!176 = distinct !DILexicalBlock(scope: !45, file: !38, line: 1096, column: 8)
!177 = !DILocation(line: 1096, column: 50, scope: !176)
!178 = !DILocation(line: 1097, column: 8, scope: !176)
!179 = !DILocation(line: 1097, column: 16, scope: !176)
!180 = !DILocation(line: 1096, column: 8, scope: !181)
!181 = !DILexicalBlockFile(scope: !45, file: !38, discriminator: 1)
!182 = !DILocation(line: 1098, column: 20, scope: !183)
!183 = distinct !DILexicalBlock(scope: !184, file: !38, line: 1098, column: 11)
!184 = distinct !DILexicalBlock(scope: !176, file: !38, line: 1097, column: 45)
!185 = !DILocation(line: 1098, column: 26, scope: !183)
!186 = !DILocation(line: 1098, column: 12, scope: !183)
!187 = !DILocation(line: 1098, column: 41, scope: !183)
!188 = !DILocation(line: 1098, column: 11, scope: !184)
!189 = !DILocation(line: 1100, column: 10, scope: !190)
!190 = distinct !DILexicalBlock(scope: !183, file: !38, line: 1098, column: 48)
!191 = !DILocation(line: 1101, column: 7, scope: !190)
!192 = !DILocation(line: 1101, column: 27, scope: !193)
!193 = !DILexicalBlockFile(scope: !194, file: !38, discriminator: 1)
!194 = distinct !DILexicalBlock(scope: !183, file: !38, line: 1101, column: 18)
!195 = !DILocation(line: 1101, column: 33, scope: !193)
!196 = !DILocation(line: 1101, column: 19, scope: !193)
!197 = !DILocation(line: 1101, column: 48, scope: !193)
!198 = !DILocation(line: 1101, column: 18, scope: !193)
!199 = !DILocation(line: 1107, column: 10, scope: !200)
!200 = distinct !DILexicalBlock(scope: !194, file: !38, line: 1101, column: 55)
!201 = !DILocation(line: 1108, column: 7, scope: !200)
!202 = !DILocation(line: 1109, column: 10, scope: !203)
!203 = distinct !DILexicalBlock(scope: !194, file: !38, line: 1108, column: 14)
!204 = !DILocation(line: 1111, column: 4, scope: !184)
!205 = !DILocation(line: 1112, column: 7, scope: !206)
!206 = distinct !DILexicalBlock(scope: !176, file: !38, line: 1111, column: 11)
!207 = !DILocation(line: 1115, column: 14, scope: !45)
!208 = !DILocation(line: 1115, column: 12, scope: !45)
!209 = !DILocation(line: 1116, column: 4, scope: !45)
!210 = distinct !{!210, !209}
!211 = !DILocation(line: 1116, column: 31, scope: !212)
!212 = !DILexicalBlockFile(scope: !213, file: !38, discriminator: 1)
!213 = distinct !DILexicalBlock(scope: !45, file: !38, line: 1116, column: 7)
!214 = !DILocation(line: 1116, column: 36, scope: !212)
!215 = !DILocation(line: 1116, column: 10, scope: !212)
!216 = !DILocation(line: 1116, column: 20, scope: !212)
!217 = !DILocation(line: 1116, column: 28, scope: !212)
!218 = !DILocation(line: 1116, column: 44, scope: !212)
!219 = !DILocation(line: 1116, column: 54, scope: !212)
!220 = !DILocation(line: 1116, column: 58, scope: !212)
!221 = !DILocation(line: 1116, column: 7, scope: !212)
!222 = !DILocation(line: 1116, column: 17, scope: !212)
!223 = !DILocation(line: 1116, column: 29, scope: !212)
!224 = !DILocation(line: 1116, column: 5, scope: !212)
!225 = !DILocation(line: 1121, column: 36, scope: !226)
!226 = distinct !DILexicalBlock(scope: !45, file: !38, line: 1121, column: 8)
!227 = !DILocation(line: 1121, column: 9, scope: !226)
!228 = !DILocation(line: 1121, column: 8, scope: !45)
!229 = !DILocation(line: 1122, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !38, line: 1121, column: 46)
!231 = !DILocation(line: 1123, column: 14, scope: !230)
!232 = !DILocation(line: 1123, column: 7, scope: !230)
!233 = !DILocation(line: 1124, column: 7, scope: !230)
!234 = !DILocalVariable(name: "rpcs", scope: !235, file: !38, line: 1128, type: !236)
!235 = distinct !DILexicalBlock(scope: !45, file: !38, line: 1127, column: 4)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 384, align: 64, elements: !248)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !93, line: 115, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !93, line: 94, size: 384, align: 64, elements: !239)
!239 = !{!240, !241, !244, !245, !246, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !93, line: 96, baseType: !53, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !238, file: !93, line: 98, baseType: !242, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !93, line: 90, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !238, file: !93, line: 100, baseType: !105, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !238, file: !93, line: 102, baseType: !105, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !238, file: !93, line: 109, baseType: !105, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !238, file: !93, line: 114, baseType: !121, size: 64, align: 64, offset: 320)
!248 = !{!249}
!249 = !DISubrange(count: 1)
!250 = !DILocation(line: 1128, column: 26, scope: !235)
!251 = !DILocation(line: 1128, column: 35, scope: !235)
!252 = !DILocation(line: 1129, column: 10, scope: !235)
!253 = !DILocation(line: 1129, column: 40, scope: !235)
!254 = !DILocalVariable(name: "sigs", scope: !235, file: !38, line: 1131, type: !255)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 384, align: 64, elements: !262)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginSignalCb", file: !4, line: 484, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginSignalCb", file: !4, line: 480, size: 192, align: 64, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "signame", scope: !257, file: !4, line: 481, baseType: !81, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !257, file: !4, line: 482, baseType: !105, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !257, file: !4, line: 483, baseType: !105, size: 64, align: 64, offset: 128)
!262 = !{!263}
!263 = !DISubrange(count: 2)
!264 = !DILocation(line: 1131, column: 27, scope: !235)
!265 = !DILocalVariable(name: "regs", scope: !235, file: !38, line: 1135, type: !266)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 256, align: 64, elements: !262)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppReg", file: !4, line: 450, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppReg", file: !4, line: 447, size: 128, align: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !4, line: 448, baseType: !106, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !4, line: 449, baseType: !55, size: 64, align: 64, offset: 64)
!272 = !DILocation(line: 1135, column: 19, scope: !235)
!273 = !DILocation(line: 1135, column: 28, scope: !235)
!274 = !DILocation(line: 1136, column: 10, scope: !235)
!275 = !DILocation(line: 1136, column: 50, scope: !235)
!276 = !DILocation(line: 1136, column: 32, scope: !235)
!277 = !DILocation(line: 1137, column: 10, scope: !235)
!278 = !DILocation(line: 1137, column: 49, scope: !235)
!279 = !DILocation(line: 1137, column: 31, scope: !235)
!280 = !DILocation(line: 1140, column: 40, scope: !235)
!281 = !DILocation(line: 1140, column: 22, scope: !235)
!282 = !DILocation(line: 1140, column: 20, scope: !235)
!283 = !DILocation(line: 1142, column: 23, scope: !45)
!284 = !DILocation(line: 1142, column: 21, scope: !45)
!285 = !DILocation(line: 1144, column: 4, scope: !45)
!286 = !DILocation(line: 1145, column: 1, scope: !45)
!287 = distinct !DISubprogram(name: "HgfsServerClientRdrStart", scope: !38, file: !38, line: 1006, type: !288, isLocal: true, isDefinition: true, scopeLine: 1007, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!288 = !DISubroutineType(types: !289)
!289 = !{null}
!290 = !DILocation(line: 1023, column: 1, scope: !287)
!291 = distinct !DISubprogram(name: "HgfsServerClientRdrConnectDrives", scope: !38, file: !38, line: 1033, type: !288, isLocal: true, isDefinition: true, scopeLine: 1034, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!292 = !DILocation(line: 1063, column: 1, scope: !291)
!293 = !DILocalVariable(name: "data", arg: 1, scope: !111, file: !38, line: 103, type: !114)
!294 = !DILocation(line: 103, column: 34, scope: !111)
!295 = !DILocalVariable(name: "mgrData", scope: !111, file: !38, line: 105, type: !140)
!296 = !DILocation(line: 105, column: 23, scope: !111)
!297 = !DILocalVariable(name: "replySize", scope: !111, file: !38, line: 106, type: !121)
!298 = !DILocation(line: 106, column: 11, scope: !111)
!299 = !DILocation(line: 111, column: 14, scope: !111)
!300 = !DILocation(line: 111, column: 20, scope: !111)
!301 = !DILocation(line: 111, column: 12, scope: !111)
!302 = !DILocation(line: 113, column: 8, scope: !303)
!303 = distinct !DILexicalBlock(scope: !111, file: !38, line: 113, column: 8)
!304 = !DILocation(line: 113, column: 14, scope: !303)
!305 = !DILocation(line: 113, column: 23, scope: !303)
!306 = !DILocation(line: 113, column: 8, scope: !111)
!307 = !DILocation(line: 114, column: 36, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !38, line: 113, column: 29)
!309 = !DILocation(line: 114, column: 14, scope: !308)
!310 = !DILocation(line: 114, column: 7, scope: !308)
!311 = !DILocation(line: 117, column: 14, scope: !111)
!312 = !DILocation(line: 118, column: 36, scope: !111)
!313 = !DILocation(line: 118, column: 45, scope: !111)
!314 = !DILocation(line: 118, column: 51, scope: !111)
!315 = !DILocation(line: 118, column: 56, scope: !111)
!316 = !DILocation(line: 118, column: 61, scope: !111)
!317 = !DILocation(line: 118, column: 67, scope: !111)
!318 = !DILocation(line: 118, column: 76, scope: !111)
!319 = !DILocation(line: 118, column: 4, scope: !111)
!320 = !DILocation(line: 120, column: 4, scope: !111)
!321 = !DILocation(line: 120, column: 10, scope: !111)
!322 = !DILocation(line: 120, column: 17, scope: !111)
!323 = !DILocation(line: 121, column: 22, scope: !111)
!324 = !DILocation(line: 121, column: 4, scope: !111)
!325 = !DILocation(line: 121, column: 10, scope: !111)
!326 = !DILocation(line: 121, column: 20, scope: !111)
!327 = !DILocation(line: 122, column: 4, scope: !111)
!328 = !DILocation(line: 123, column: 1, scope: !111)
!329 = distinct !DISubprogram(name: "HgfsServerCapReg", scope: !38, file: !38, line: 138, type: !330, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !109)
!330 = !DISubroutineType(types: !331)
