; ModuleID = './libgrabbitmqProxy_la-grabbitmqProxyPlugin.o.i'
source_filename = "./libgrabbitmqProxy_la-grabbitmqProxyPlugin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct._GArray = type { i8*, i32 }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }
%struct._GMainLoop = type opaque
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque
%struct.GuestProxyData = type { %struct.AsyncSocket*, %struct.AsyncSocket*, %struct._GList*, %struct.ToolsAppCtx*, i32, i32 }
%struct.AsyncSocket = type opaque
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, globals: !130)
!1 = !DIFile(filename: "libgrabbitmqProxy_la-grabbitmqProxyPlugin.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!2 = !{!3, !15, !23, !27, !33, !48, !57}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AsyncSocketState", file: !16, line: 184, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/asyncsocket.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "AsyncSocketListening", value: 0)
!19 = !DIEnumerator(name: "AsyncSocketConnecting", value: 1)
!20 = !DIEnumerator(name: "AsyncSocketConnected", value: 2)
!21 = !DIEnumerator(name: "AsyncSocketCBCancelled", value: 3)
!22 = !DIEnumerator(name: "AsyncSocketClosed", value: 4)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 232, size: 32, align: 32, elements: !25)
!24 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!25 = !{!26}
!26 = !DIEnumerator(name: "TOOLS_CORE_API_V1", value: 1)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 339, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIEnumerator(name: "TOOLS_APP_GUESTRPC", value: 1)
!30 = !DIEnumerator(name: "TOOLS_APP_SIGNALS", value: 2)
!31 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!32 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 47, size: 32, align: 32, elements: !35)
!34 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dataMap.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!36 = !DIEnumerator(name: "DMERR_SUCCESS", value: 0)
!37 = !DIEnumerator(name: "DMERR_NOT_FOUND", value: 1)
!38 = !DIEnumerator(name: "DMERR_ALREADY_EXIST", value: 2)
!39 = !DIEnumerator(name: "DMERR_DUPLICATED_FIELD_IDS", value: 3)
!40 = !DIEnumerator(name: "DMERR_INSUFFICIENT_MEM", value: 4)
!41 = !DIEnumerator(name: "DMERR_TYPE_MISMATCH", value: 5)
!42 = !DIEnumerator(name: "DMERR_INVALID_ARGS", value: 6)
!43 = !DIEnumerator(name: "DMERR_UNKNOWN_TYPE", value: 7)
!44 = !DIEnumerator(name: "DMERR_TRUNCATED_DATA", value: 8)
!45 = !DIEnumerator(name: "DMERR_BUFFER_TOO_SMALL", value: 9)
!46 = !DIEnumerator(name: "DMERR_INTEGER_OVERFLOW", value: 10)
!47 = !DIEnumerator(name: "DMERR_BAD_DATA", value: 11)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 41, size: 32, align: 32, elements: !50)
!49 = !DIFile(filename: "rabbitmqProxyConst.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "RMQPROXYDM_FLD_COMMAND", value: 1)
!52 = !DIEnumerator(name: "RMQPROXYDM_FLD_GUEST_CONN_ID", value: 2)
!53 = !DIEnumerator(name: "RMQPROXYDM_FLD_PAYLOAD", value: 3)
!54 = !DIEnumerator(name: "RMQPROXYDM_FLD_GUEST_VER_ID", value: 4)
!55 = !DIEnumerator(name: "RMQPROXYDM_FLD_QUEUE_PREFIX_ID", value: 5)
!56 = !DIEnumerator(name: "RMQPROXYDM_FLD_VC_UUID", value: 6)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 52, size: 32, align: 32, elements: !58)
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "COMMAND_DATA", value: 1)
!60 = !DIEnumerator(name: "COMMAND_CONNECT", value: 2)
!61 = !DIEnumerator(name: "COMMAND_CLOSE", value: 3)
!62 = !{!63, !64, !105, !106, !115, !127, !129}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConnInfo", file: !66, line: 112, baseType: !67)
!66 = !DIFile(filename: "grabbitmqProxyPlugin.c", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConnInfo", file: !66, line: 93, size: 640, align: 64, elements: !68)
!68 = !{!69, !73, !77, !83, !85, !90, !94, !98, !100, !101, !102, !103}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "isRmqClient", scope: !67, file: !66, line: 94, baseType: !70, size: 8, align: 8)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !71, line: 230, baseType: !72)
!71 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!72 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "asock", scope: !67, file: !66, line: 95, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocket", file: !16, line: 155, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "AsyncSocket", file: !16, line: 155, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "recvCb", scope: !67, file: !66, line: 96, baseType: !78, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketRecvFn", file: !16, line: 389, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !63, !82, !74, !63}
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sendCb", scope: !67, file: !66, line: 97, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketSendFn", file: !16, line: 395, baseType: !79)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !67, file: !66, line: 98, baseType: !86, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "AsyncSocketErrorFn", file: !16, line: 401, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !82, !74, !63}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "shutDown", scope: !67, file: !66, line: 100, baseType: !91, size: 32, align: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !92, line: 50, baseType: !93)
!92 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !92, line: 49, baseType: !82)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "packetLen", scope: !67, file: !66, line: 102, baseType: !95, size: 32, align: 32, offset: 352)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !71, line: 174, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !97, line: 196, baseType: !82)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "recvBuf", scope: !67, file: !66, line: 103, baseType: !99, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "recvBufLen", scope: !67, file: !66, line: 104, baseType: !82, size: 32, align: 32, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sendQueueLen", scope: !67, file: !66, line: 106, baseType: !82, size: 32, align: 32, offset: 480)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "recvStopped", scope: !67, file: !66, line: 108, baseType: !91, size: 32, align: 32, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "toConn", scope: !67, file: !66, line: 110, baseType: !104, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !108, line: 37, baseType: !109)
!108 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !108, line: 39, size: 192, align: 64, elements: !110)
!110 = !{!111, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !108, line: 41, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !92, line: 77, baseType: !63)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !108, line: 42, baseType: !106, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !108, line: 43, baseType: !106, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !117, line: 153, size: 128, align: 16, elements: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!118 = !{!119, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !116, file: !117, line: 155, baseType: !120, size: 16, align: 16)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !121, line: 28, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!122 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !116, file: !117, line: 156, baseType: !124, size: 112, align: 8, offset: 16)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 112, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 14)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!129 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!130 = !{!131, !135, !194, !204, !1867, !1871, !1873, !1875, !1877}
!131 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !66, line: 66, type: !132, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 160, align: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = distinct !DIGlobalVariable(name: "regData", scope: !136, file: !66, line: 1942, type: !140, isLocal: true, isDefinition: true, variable: %struct.ToolsPluginData* @ToolsOnLoad.regData)
!136 = distinct !DISubprogram(name: "ToolsOnLoad", scope: !66, file: !66, line: 1940, type: !137, isLocal: false, isDefinition: true, scopeLine: 1941, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !159}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !24, line: 545, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !24, line: 501, size: 256, align: 64, elements: !142)
!142 = !{!143, !144, !155, !192}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !24, line: 503, baseType: !127, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !141, file: !24, line: 508, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !147, line: 37, baseType: !148)
!147 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !147, line: 41, size: 128, align: 64, elements: !149)
!149 = !{!150, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !147, line: 43, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !92, line: 46, baseType: !72)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !147, line: 44, baseType: !154, size: 32, align: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !92, line: 55, baseType: !129)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !141, file: !24, line: 539, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!91, !159, !190, !112, !191}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !24, line: 274, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !24, line: 241, size: 576, align: 64, elements: !162)
!162 = !{!163, !165, !168, !169, !170, !175, !180, !185, !186, !187, !189}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !161, file: !24, line: 243, baseType: !164, size: 32, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !24, line: 234, baseType: !23)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !24, line: 245, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !161, file: !24, line: 247, baseType: !91, size: 32, align: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !161, file: !24, line: 249, baseType: !82, size: 32, align: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !161, file: !24, line: 251, baseType: !171, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !173, line: 56, baseType: !174)
!173 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !173, line: 56, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !161, file: !24, line: 253, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !178, line: 48, baseType: !179)
!178 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !178, line: 48, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !161, file: !24, line: 255, baseType: !181, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !183, line: 48, baseType: !184)
!183 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !183, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !161, file: !24, line: 261, baseType: !82, size: 32, align: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !161, file: !24, line: 263, baseType: !82, size: 32, align: 32, offset: 416)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !161, file: !24, line: 265, baseType: !188, size: 64, align: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !161, file: !24, line: 273, baseType: !112, size: 64, align: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !24, line: 360, baseType: !27)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !141, file: !24, line: 544, baseType: !112, size: 64, align: 64, offset: 192)
!193 = !{}
!194 = distinct !DIGlobalVariable(name: "proxyData", scope: !0, file: !66, line: 129, type: !195, isLocal: true, isDefinition: true, variable: %struct.GuestProxyData* @proxyData)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestProxyData", file: !66, line: 127, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 114, size: 320, align: 64, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vmxListenSock", scope: !196, file: !66, line: 115, baseType: !74, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rmqListenSock", scope: !196, file: !66, line: 116, baseType: !74, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rmqConnList", scope: !196, file: !66, line: 118, baseType: !106, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !196, file: !66, line: 123, baseType: !159, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "messageTunnellingEnabled", scope: !196, file: !66, line: 124, baseType: !91, size: 32, align: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "maxSendQueueLen", scope: !196, file: !66, line: 126, baseType: !82, size: 32, align: 32, offset: 288)
!204 = distinct !DIGlobalVariable(name: "sslCtx", scope: !205, file: !66, line: 1304, type: !208, isLocal: true, isDefinition: true, variable: %struct.ssl_ctx_st** @TheSslContext.sslCtx)
!205 = distinct !DISubprogram(name: "TheSslContext", scope: !66, file: !66, line: 1302, type: !206, isLocal: true, isDefinition: true, scopeLine: 1303, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !193)
!206 = !DISubroutineType(types: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !210, line: 179, baseType: !211)
!210 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !212, line: 925, size: 6400, align: 64, elements: !213)
!212 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!213 = !{!214, !1711, !1712, !1713, !1715, !1720, !1721, !1722, !1723, !1724, !1725, !1730, !1735, !1739, !1753, !1754, !1758, !1759, !1765, !1766, !1771, !1775, !1779, !1780, !1781, !1782, !1783, !1784, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1827, !1828, !1829, !1833, !1834, !1835, !1836, !1837, !1838, !1841, !1842, !1843, !1848, !1849, !1854, !1855, !1856, !1860, !1861, !1862, !1863, !1864, !1865, !1866}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !211, file: !212, line: 926, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !212, line: 374, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !212, line: 438, size: 1856, align: 64, elements: !219)
!219 = !{!220, !221, !1629, !1633, !1634, !1635, !1636, !1640, !1641, !1645, !1646, !1647, !1648, !1652, !1656, !1660, !1661, !1665, !1669, !1673, !1677, !1681, !1685, !1689, !1695, !1696, !1699, !1700, !1707}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !212, line: 439, baseType: !82, size: 32, align: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !218, file: !212, line: 440, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!82, !225}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !210, line: 178, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !212, line: 1422, size: 6592, align: 64, elements: !228)
!228 = !{!229, !230, !231, !232, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !342, !343, !344, !345, !348, !349, !412, !892, !1306, !1307, !1311, !1312, !1313, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1345, !1346, !1347, !1348, !1355, !1356, !1507, !1511, !1512, !1513, !1517, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1537, !1538, !1539, !1540, !1541, !1542, !1545, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1565, !1570, !1571, !1578, !1579, !1580, !1581, !1582, !1587, !1594, !1595, !1596, !1597, !1598, !1627, !1628}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !227, file: !212, line: 1427, baseType: !82, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !212, line: 1429, baseType: !82, size: 32, align: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !227, file: !212, line: 1431, baseType: !215, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rbio", scope: !227, file: !212, line: 1438, baseType: !233, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !235, line: 238, baseType: !236)
!235 = !DIFile(filename: "/usr/include/openssl/bio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !235, line: 325, size: 896, align: 64, elements: !237)
!237 = !{!238, !277, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !293, !294}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !236, file: !235, line: 326, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !235, line: 323, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !235, line: 312, size: 640, align: 64, elements: !242)
!242 = !{!243, !244, !245, !249, !253, !257, !258, !263, !267, !268}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !235, line: 313, baseType: !82, size: 32, align: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !235, line: 314, baseType: !127, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !241, file: !235, line: 315, baseType: !246, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!82, !233, !127, !82}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !241, file: !235, line: 316, baseType: !250, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!82, !233, !99, !82}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !241, file: !235, line: 317, baseType: !254, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!82, !233, !127}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !241, file: !235, line: 318, baseType: !250, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !241, file: !235, line: 319, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !233, !82, !262, !63}
!262 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !241, file: !235, line: 320, baseType: !264, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!82, !233}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !241, file: !235, line: 321, baseType: !264, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !241, file: !235, line: 322, baseType: !269, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!262, !233, !82, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_info_cb", file: !235, line: 309, baseType: !274)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !276, !82, !127, !82, !262, !262}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !236, file: !235, line: 328, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!262, !276, !82, !127, !82, !262, !262}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !236, file: !235, line: 329, baseType: !99, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !236, file: !235, line: 330, baseType: !82, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !236, file: !235, line: 331, baseType: !82, size: 32, align: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !236, file: !235, line: 332, baseType: !82, size: 32, align: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "retry_reason", scope: !236, file: !235, line: 333, baseType: !82, size: 32, align: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !236, file: !235, line: 334, baseType: !82, size: 32, align: 32, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !236, file: !235, line: 335, baseType: !63, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next_bio", scope: !236, file: !235, line: 336, baseType: !276, size: 64, align: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bio", scope: !236, file: !235, line: 337, baseType: !276, size: 64, align: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !236, file: !235, line: 338, baseType: !82, size: 32, align: 32, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "num_read", scope: !236, file: !235, line: 339, baseType: !292, size: 64, align: 64, offset: 640)
!292 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "num_write", scope: !236, file: !235, line: 340, baseType: !292, size: 64, align: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !236, file: !235, line: 341, baseType: !295, size: 128, align: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !210, line: 195, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !297, line: 292, size: 128, align: 64, elements: !298)
!297 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!298 = !{!299, !319}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !296, file: !297, line: 293, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !297, line: 297, size: 256, align: 64, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !301, file: !297, line: 297, baseType: !304, size: 256, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !305, line: 72, baseType: !306)
!305 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !305, line: 66, size: 256, align: 64, elements: !307)
!307 = !{!308, !309, !311, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !306, file: !305, line: 67, baseType: !82, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !305, line: 68, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !306, file: !305, line: 69, baseType: !82, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !306, file: !305, line: 70, baseType: !82, size: 32, align: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !306, file: !305, line: 71, baseType: !314, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!82, !317, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !296, file: !297, line: 295, baseType: !82, size: 32, align: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "wbio", scope: !227, file: !212, line: 1440, baseType: !233, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bbio", scope: !227, file: !212, line: 1442, baseType: !233, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rwstate", scope: !227, file: !212, line: 1455, baseType: !82, size: 32, align: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "in_handshake", scope: !227, file: !212, line: 1457, baseType: !82, size: 32, align: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_func", scope: !227, file: !212, line: 1458, baseType: !222, size: 64, align: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !227, file: !212, line: 1467, baseType: !82, size: 32, align: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "new_session", scope: !227, file: !212, line: 1474, baseType: !82, size: 32, align: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "quiet_shutdown", scope: !227, file: !212, line: 1476, baseType: !82, size: 32, align: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !227, file: !212, line: 1478, baseType: !82, size: 32, align: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !227, file: !212, line: 1480, baseType: !82, size: 32, align: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rstate", scope: !227, file: !212, line: 1482, baseType: !82, size: 32, align: 32, offset: 608)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_buf", scope: !227, file: !212, line: 1483, baseType: !332, size: 64, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !210, line: 127, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !335, line: 77, size: 192, align: 64, elements: !336)
!335 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!336 = !{!337, !340, !341}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !334, file: !335, line: 78, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !339, line: 216, baseType: !292)
!339 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !335, line: 79, baseType: !99, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !334, file: !335, line: 80, baseType: !338, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_msg", scope: !227, file: !212, line: 1484, baseType: !63, size: 64, align: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "init_num", scope: !227, file: !212, line: 1486, baseType: !82, size: 32, align: 32, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "init_off", scope: !227, file: !212, line: 1487, baseType: !82, size: 32, align: 32, offset: 800)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !227, file: !212, line: 1489, baseType: !346, size: 64, align: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !227, file: !212, line: 1490, baseType: !129, size: 32, align: 32, offset: 896)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !227, file: !212, line: 1491, baseType: !350, size: 64, align: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl2_state_st", file: !352, line: 163, size: 2752, align: 64, elements: !353)
!352 = !DIFile(filename: "/usr/include/openssl/ssl2.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !386, !387, !391, !392, !396, !397, !398}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "three_byte_header", scope: !351, file: !352, line: 164, baseType: !82, size: 32, align: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "clear_text", scope: !351, file: !352, line: 165, baseType: !82, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !351, file: !352, line: 166, baseType: !82, size: 32, align: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ssl2_rollback", scope: !351, file: !352, line: 167, baseType: !82, size: 32, align: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !351, file: !352, line: 171, baseType: !129, size: 32, align: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !351, file: !352, line: 172, baseType: !82, size: 32, align: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !351, file: !352, line: 173, baseType: !361, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_off", scope: !351, file: !352, line: 174, baseType: !82, size: 32, align: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_len", scope: !351, file: !352, line: 175, baseType: !82, size: 32, align: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !351, file: !352, line: 176, baseType: !82, size: 32, align: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_left", scope: !351, file: !352, line: 178, baseType: !82, size: 32, align: 32, offset: 352)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_offs", scope: !351, file: !352, line: 179, baseType: !82, size: 32, align: 32, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !351, file: !352, line: 180, baseType: !346, size: 64, align: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !351, file: !352, line: 181, baseType: !346, size: 64, align: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !351, file: !352, line: 182, baseType: !346, size: 64, align: 64, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !351, file: !352, line: 184, baseType: !129, size: 32, align: 32, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rlength", scope: !351, file: !352, line: 185, baseType: !129, size: 32, align: 32, offset: 672)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data_length", scope: !351, file: !352, line: 186, baseType: !82, size: 32, align: 32, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wlength", scope: !351, file: !352, line: 187, baseType: !129, size: 32, align: 32, offset: 736)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data_length", scope: !351, file: !352, line: 188, baseType: !82, size: 32, align: 32, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data", scope: !351, file: !352, line: 189, baseType: !346, size: 64, align: 64, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data", scope: !351, file: !352, line: 190, baseType: !346, size: 64, align: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mac_data", scope: !351, file: !352, line: 191, baseType: !346, size: 64, align: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "read_key", scope: !351, file: !352, line: 192, baseType: !346, size: 64, align: 64, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "write_key", scope: !351, file: !352, line: 193, baseType: !346, size: 64, align: 64, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "challenge_length", scope: !351, file: !352, line: 195, baseType: !129, size: 32, align: 32, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "challenge", scope: !351, file: !352, line: 196, baseType: !383, size: 256, align: 8, offset: 1184)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 256, align: 8, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !351, file: !352, line: 197, baseType: !129, size: 32, align: 32, offset: 1440)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id", scope: !351, file: !352, line: 198, baseType: !388, size: 128, align: 8, offset: 1472)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 128, align: 8, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "key_material_length", scope: !351, file: !352, line: 199, baseType: !129, size: 32, align: 32, offset: 1600)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "key_material", scope: !351, file: !352, line: 200, baseType: !393, size: 384, align: 8, offset: 1632)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 384, align: 8, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 48)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !351, file: !352, line: 201, baseType: !292, size: 64, align: 64, offset: 2048)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !351, file: !352, line: 202, baseType: !292, size: 64, align: 64, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !351, file: !352, line: 215, baseType: !399, size: 576, align: 32, offset: 2176)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !351, file: !352, line: 203, size: 576, align: 32, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !399, file: !352, line: 204, baseType: !129, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !399, file: !352, line: 205, baseType: !129, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cert_length", scope: !399, file: !352, line: 206, baseType: !129, size: 32, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "csl", scope: !399, file: !352, line: 207, baseType: !129, size: 32, align: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !399, file: !352, line: 208, baseType: !129, size: 32, align: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !399, file: !352, line: 209, baseType: !129, size: 32, align: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ccl", scope: !399, file: !352, line: 210, baseType: !383, size: 256, align: 8, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_spec_length", scope: !399, file: !352, line: 211, baseType: !129, size: 32, align: 32, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_length", scope: !399, file: !352, line: 212, baseType: !129, size: 32, align: 32, offset: 480)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "clen", scope: !399, file: !352, line: 213, baseType: !129, size: 32, align: 32, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rlen", scope: !399, file: !352, line: 214, baseType: !129, size: 32, align: 32, offset: 544)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !227, file: !212, line: 1492, baseType: !413, size: 64, align: 64, offset: 1024)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !415, line: 481, size: 9728, align: 64, elements: !416)
!415 = !DIFile(filename: "/usr/include/openssl/ssl3.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!416 = !{!417, !418, !419, !423, !424, !428, !429, !430, !431, !432, !433, !434, !435, !436, !444, !445, !457, !458, !462, !463, !467, !468, !469, !470, !471, !472, !473, !474, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !415, line: 482, baseType: !262, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "delay_buf_pop_ret", scope: !414, file: !415, line: 483, baseType: !82, size: 32, align: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !414, file: !415, line: 484, baseType: !420, size: 64, align: 8, offset: 96)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 64, align: 8, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret_size", scope: !414, file: !415, line: 485, baseType: !82, size: 32, align: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret", scope: !414, file: !415, line: 486, baseType: !425, size: 512, align: 8, offset: 192)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 512, align: 8, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !414, file: !415, line: 487, baseType: !420, size: 64, align: 8, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret_size", scope: !414, file: !415, line: 488, baseType: !82, size: 32, align: 32, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret", scope: !414, file: !415, line: 489, baseType: !425, size: 512, align: 8, offset: 800)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "server_random", scope: !414, file: !415, line: 490, baseType: !383, size: 256, align: 8, offset: 1312)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "client_random", scope: !414, file: !415, line: 491, baseType: !383, size: 256, align: 8, offset: 1568)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "need_empty_fragments", scope: !414, file: !415, line: 493, baseType: !82, size: 32, align: 32, offset: 1824)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "empty_fragment_done", scope: !414, file: !415, line: 494, baseType: !82, size: 32, align: 32, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init_extra", scope: !414, file: !415, line: 496, baseType: !82, size: 32, align: 32, offset: 1888)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !414, file: !415, line: 497, baseType: !437, size: 192, align: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_BUFFER", file: !415, line: 447, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_buffer_st", file: !415, line: 438, size: 192, align: 64, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !438, file: !415, line: 440, baseType: !346, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !438, file: !415, line: 442, baseType: !338, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !438, file: !415, line: 444, baseType: !82, size: 32, align: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !438, file: !415, line: 446, baseType: !82, size: 32, align: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !414, file: !415, line: 498, baseType: !437, size: 192, align: 64, offset: 2112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rrec", scope: !414, file: !415, line: 499, baseType: !446, size: 448, align: 64, offset: 2304)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !415, line: 436, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !415, line: 403, size: 448, align: 64, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !415, line: 407, baseType: !82, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !447, file: !415, line: 411, baseType: !129, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !447, file: !415, line: 415, baseType: !129, size: 32, align: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !447, file: !415, line: 419, baseType: !346, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !447, file: !415, line: 423, baseType: !346, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !447, file: !415, line: 427, baseType: !346, size: 64, align: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !447, file: !415, line: 431, baseType: !292, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !447, file: !415, line: 435, baseType: !420, size: 64, align: 8, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wrec", scope: !414, file: !415, line: 500, baseType: !446, size: 448, align: 64, offset: 2752)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment", scope: !414, file: !415, line: 505, baseType: !459, size: 16, align: 8, offset: 3200)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 16, align: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 2)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment_len", scope: !414, file: !415, line: 506, baseType: !129, size: 32, align: 32, offset: 3232)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment", scope: !414, file: !415, line: 507, baseType: !464, size: 32, align: 8, offset: 3264)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 32, align: 8, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 4)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment_len", scope: !414, file: !415, line: 508, baseType: !129, size: 32, align: 32, offset: 3296)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !414, file: !415, line: 510, baseType: !129, size: 32, align: 32, offset: 3328)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !414, file: !415, line: 511, baseType: !82, size: 32, align: 32, offset: 3360)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_type", scope: !414, file: !415, line: 512, baseType: !82, size: 32, align: 32, offset: 3392)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !414, file: !415, line: 513, baseType: !82, size: 32, align: 32, offset: 3424)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !414, file: !415, line: 514, baseType: !361, size: 64, align: 64, offset: 3456)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer", scope: !414, file: !415, line: 516, baseType: !233, size: 64, align: 64, offset: 3520)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_dgst", scope: !414, file: !415, line: 521, baseType: !475, size: 64, align: 64, offset: 3584)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !210, line: 132, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_ctx_st", file: !479, line: 268, size: 384, align: 64, elements: !480)
!479 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!480 = !{!481, !529, !533, !534, !535, !539}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !478, file: !479, line: 269, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !210, line: 131, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_st", file: !479, line: 160, size: 960, align: 64, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !495, !499, !503, !509, !510, !515, !519, !523, !524, !525}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !479, line: 161, baseType: !82, size: 32, align: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_type", scope: !485, file: !479, line: 162, baseType: !82, size: 32, align: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !485, file: !479, line: 163, baseType: !82, size: 32, align: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !479, line: 164, baseType: !292, size: 64, align: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !485, file: !479, line: 165, baseType: !492, size: 64, align: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!82, !476}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !485, file: !479, line: 166, baseType: !496, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!82, !476, !317, !338}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !485, file: !479, line: 167, baseType: !500, size: 64, align: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!82, !476, !346}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !485, file: !479, line: 168, baseType: !504, size: 64, align: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!82, !476, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !485, file: !479, line: 169, baseType: !492, size: 64, align: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !485, file: !479, line: 171, baseType: !511, size: 64, align: 64, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!82, !82, !361, !129, !346, !514, !63}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !485, file: !479, line: 173, baseType: !516, size: 64, align: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!82, !82, !361, !129, !361, !129, !63}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "required_pkey_type", scope: !485, file: !479, line: 176, baseType: !520, size: 160, align: 32, offset: 640)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 160, align: 32, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 5)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !485, file: !479, line: 177, baseType: !82, size: 32, align: 32, offset: 800)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !485, file: !479, line: 178, baseType: !82, size: 32, align: 32, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "md_ctrl", scope: !485, file: !479, line: 180, baseType: !526, size: 64, align: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!82, !476, !82, !82, !63}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !478, file: !479, line: 270, baseType: !530, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !210, line: 177, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !210, line: 177, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !479, line: 272, baseType: !292, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "md_data", scope: !478, file: !479, line: 273, baseType: !63, size: 64, align: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !478, file: !479, line: 275, baseType: !536, size: 64, align: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !210, line: 138, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !210, line: 138, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !478, file: !479, line: 277, baseType: !496, size: 64, align: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "change_cipher_spec", scope: !414, file: !415, line: 527, baseType: !82, size: 32, align: 32, offset: 3648)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "warn_alert", scope: !414, file: !415, line: 528, baseType: !82, size: 32, align: 32, offset: 3680)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_alert", scope: !414, file: !415, line: 529, baseType: !82, size: 32, align: 32, offset: 3712)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alert_dispatch", scope: !414, file: !415, line: 534, baseType: !82, size: 32, align: 32, offset: 3744)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "send_alert", scope: !414, file: !415, line: 535, baseType: !459, size: 16, align: 8, offset: 3776)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate", scope: !414, file: !415, line: 540, baseType: !82, size: 32, align: 32, offset: 3808)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "total_renegotiations", scope: !414, file: !415, line: 541, baseType: !82, size: 32, align: 32, offset: 3840)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "num_renegotiations", scope: !414, file: !415, line: 542, baseType: !82, size: 32, align: 32, offset: 3872)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "in_read_app_data", scope: !414, file: !415, line: 543, baseType: !82, size: 32, align: 32, offset: 3904)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input", scope: !414, file: !415, line: 549, baseType: !63, size: 64, align: 64, offset: 3968)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input_len", scope: !414, file: !415, line: 550, baseType: !338, size: 64, align: 64, offset: 4032)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input", scope: !414, file: !415, line: 551, baseType: !63, size: 64, align: 64, offset: 4096)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input_len", scope: !414, file: !415, line: 552, baseType: !338, size: 64, align: 64, offset: 4160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !414, file: !415, line: 592, baseType: !554, size: 4224, align: 64, offset: 4224)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !415, line: 553, size: 4224, align: 64, elements: !555)
!555 = !{!556, !560, !561, !562, !563, !564, !565, !566, !584, !680, !685, !686, !687, !688, !689, !693, !699, !700, !701, !702, !835, !836, !837, !838, !882}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cert_verify_md", scope: !554, file: !415, line: 555, baseType: !557, size: 1024, align: 8)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 1024, align: 8, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md", scope: !554, file: !415, line: 557, baseType: !557, size: 1024, align: 8, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md_len", scope: !554, file: !415, line: 558, baseType: !82, size: 32, align: 32, offset: 2048)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md", scope: !554, file: !415, line: 559, baseType: !557, size: 1024, align: 8, offset: 2080)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md_len", scope: !554, file: !415, line: 560, baseType: !82, size: 32, align: 32, offset: 3104)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !554, file: !415, line: 561, baseType: !292, size: 64, align: 64, offset: 3136)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !554, file: !415, line: 562, baseType: !82, size: 32, align: 32, offset: 3200)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "new_cipher", scope: !554, file: !415, line: 564, baseType: !567, size: 64, align: 64, offset: 3264)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CIPHER", file: !212, line: 375, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_cipher_st", file: !212, line: 418, size: 704, align: 64, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !570, file: !212, line: 419, baseType: !82, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !212, line: 420, baseType: !127, size: 64, align: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !570, file: !212, line: 421, baseType: !292, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mkey", scope: !570, file: !212, line: 426, baseType: !292, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_auth", scope: !570, file: !212, line: 427, baseType: !292, size: 64, align: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_enc", scope: !570, file: !212, line: 428, baseType: !292, size: 64, align: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mac", scope: !570, file: !212, line: 429, baseType: !292, size: 64, align: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_ssl", scope: !570, file: !212, line: 430, baseType: !292, size: 64, align: 64, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "algo_strength", scope: !570, file: !212, line: 431, baseType: !292, size: 64, align: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm2", scope: !570, file: !212, line: 432, baseType: !292, size: 64, align: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "strength_bits", scope: !570, file: !212, line: 433, baseType: !82, size: 32, align: 32, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "alg_bits", scope: !570, file: !212, line: 434, baseType: !82, size: 32, align: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !554, file: !415, line: 566, baseType: !585, size: 64, align: 64, offset: 3328)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !210, line: 140, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !588, line: 135, size: 1152, align: 64, elements: !589)
!588 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!589 = !{!590, !591, !592, !604, !605, !606, !607, !608, !609, !621, !622, !623, !624, !625, !626, !627, !628, !679}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !587, file: !588, line: 140, baseType: !82, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !587, file: !588, line: 141, baseType: !82, size: 32, align: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !587, file: !588, line: 142, baseType: !593, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !210, line: 120, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !596, line: 313, size: 192, align: 64, elements: !597)
!596 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!597 = !{!598, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !595, file: !596, line: 314, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !595, file: !596, line: 316, baseType: !82, size: 32, align: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !595, file: !596, line: 318, baseType: !82, size: 32, align: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !595, file: !596, line: 319, baseType: !82, size: 32, align: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !596, line: 320, baseType: !82, size: 32, align: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !587, file: !588, line: 143, baseType: !593, size: 64, align: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !587, file: !588, line: 144, baseType: !262, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !587, file: !588, line: 145, baseType: !593, size: 64, align: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !587, file: !588, line: 146, baseType: !593, size: 64, align: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !588, line: 147, baseType: !82, size: 32, align: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !587, file: !588, line: 148, baseType: !610, size: 64, align: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !210, line: 123, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !596, line: 324, size: 832, align: 64, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !612, file: !596, line: 325, baseType: !82, size: 32, align: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !612, file: !596, line: 326, baseType: !594, size: 192, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !612, file: !596, line: 327, baseType: !594, size: 192, align: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !612, file: !596, line: 328, baseType: !594, size: 192, align: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !612, file: !596, line: 330, baseType: !619, size: 128, align: 64, offset: 640)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, align: 64, elements: !460)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !612, file: !596, line: 333, baseType: !82, size: 32, align: 32, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !587, file: !588, line: 150, baseType: !593, size: 64, align: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !587, file: !588, line: 151, baseType: !593, size: 64, align: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !587, file: !588, line: 152, baseType: !346, size: 64, align: 64, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !587, file: !588, line: 153, baseType: !82, size: 32, align: 32, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !587, file: !588, line: 154, baseType: !593, size: 64, align: 64, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !587, file: !588, line: 155, baseType: !82, size: 32, align: 32, offset: 832)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !587, file: !588, line: 156, baseType: !295, size: 128, align: 64, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !587, file: !588, line: 157, baseType: !629, size: 64, align: 64, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !210, line: 141, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !588, line: 117, size: 576, align: 64, elements: !633)
!633 = !{!634, !635, !639, !645, !654, !655, !656, !657, !658}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !632, file: !588, line: 118, baseType: !127, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !632, file: !588, line: 120, baseType: !636, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!82, !585}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !632, file: !588, line: 121, baseType: !640, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!82, !346, !643, !585}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !632, file: !588, line: 123, baseType: !646, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!82, !649, !593, !643, !643, !643, !651, !610}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !210, line: 121, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !210, line: 121, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !632, file: !588, line: 126, baseType: !636, size: 64, align: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !632, file: !588, line: 127, baseType: !636, size: 64, align: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !588, line: 128, baseType: !82, size: 32, align: 32, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !632, file: !588, line: 129, baseType: !99, size: 64, align: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !632, file: !588, line: 131, baseType: !659, size: 64, align: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!82, !585, !82, !82, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !210, line: 125, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !596, line: 349, size: 192, align: 64, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !664, file: !596, line: 350, baseType: !129, size: 32, align: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !664, file: !596, line: 351, baseType: !63, size: 64, align: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !664, file: !596, line: 357, baseType: !669, size: 64, align: 64, offset: 128)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !664, file: !596, line: 352, size: 64, align: 64, elements: !670)
!670 = !{!671, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !669, file: !596, line: 354, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !82, !82, !63}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !669, file: !596, line: 356, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!82, !82, !82, !662}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !587, file: !588, line: 158, baseType: !530, size: 64, align: 64, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ecdh", scope: !554, file: !415, line: 569, baseType: !681, size: 64, align: 64, offset: 3392)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "EC_KEY", file: !683, line: 741, baseType: !684)
!683 = !DIFile(filename: "/usr/include/openssl/ec.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !479, line: 147, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next_state", scope: !554, file: !415, line: 572, baseType: !82, size: 32, align: 32, offset: 3456)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reuse_message", scope: !554, file: !415, line: 573, baseType: !82, size: 32, align: 32, offset: 3488)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cert_req", scope: !554, file: !415, line: 575, baseType: !82, size: 32, align: 32, offset: 3520)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ctype_num", scope: !554, file: !415, line: 576, baseType: !82, size: 32, align: 32, offset: 3552)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !554, file: !415, line: 577, baseType: !690, size: 72, align: 8, offset: 3584)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 72, align: 8, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 9)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ca_names", scope: !554, file: !415, line: 578, baseType: !694, size: 64, align: 64, offset: 3712)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME", file: !696, line: 192, size: 256, align: 64, elements: !697)
!696 = !DIFile(filename: "/usr/include/openssl/x509.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !695, file: !696, line: 192, baseType: !304, size: 256, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "use_rsa_tmp", scope: !554, file: !415, line: 579, baseType: !82, size: 32, align: 32, offset: 3776)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "key_block_length", scope: !554, file: !415, line: 580, baseType: !82, size: 32, align: 32, offset: 3808)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "key_block", scope: !554, file: !415, line: 581, baseType: !346, size: 64, align: 64, offset: 3840)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "new_sym_enc", scope: !554, file: !415, line: 582, baseType: !703, size: 64, align: 64, offset: 3904)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !210, line: 129, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !479, line: 308, size: 704, align: 64, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !736, !740, !744, !745, !829, !830, !834}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !706, file: !479, line: 309, baseType: !82, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !706, file: !479, line: 310, baseType: !82, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !706, file: !479, line: 312, baseType: !82, size: 32, align: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "iv_len", scope: !706, file: !479, line: 313, baseType: !82, size: 32, align: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !706, file: !479, line: 315, baseType: !292, size: 64, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !706, file: !479, line: 317, baseType: !714, size: 64, align: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!82, !717, !361, !361, !82}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !210, line: 130, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !479, line: 449, size: 1344, align: 64, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !719, file: !479, line: 450, baseType: !703, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !719, file: !479, line: 451, baseType: !530, size: 64, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !719, file: !479, line: 453, baseType: !82, size: 32, align: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !719, file: !479, line: 454, baseType: !82, size: 32, align: 32, offset: 160)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "oiv", scope: !719, file: !479, line: 455, baseType: !388, size: 128, align: 8, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !719, file: !479, line: 456, baseType: !388, size: 128, align: 8, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !719, file: !479, line: 457, baseType: !383, size: 256, align: 8, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !719, file: !479, line: 458, baseType: !82, size: 32, align: 32, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !719, file: !479, line: 459, baseType: !63, size: 64, align: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !719, file: !479, line: 460, baseType: !82, size: 32, align: 32, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !719, file: !479, line: 461, baseType: !292, size: 64, align: 64, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_data", scope: !719, file: !479, line: 462, baseType: !63, size: 64, align: 64, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "final_used", scope: !719, file: !479, line: 463, baseType: !82, size: 32, align: 32, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "block_mask", scope: !719, file: !479, line: 464, baseType: !82, size: 32, align: 32, offset: 1056)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !719, file: !479, line: 465, baseType: !383, size: 256, align: 8, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "do_cipher", scope: !706, file: !479, line: 320, baseType: !737, size: 64, align: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!82, !717, !346, !361, !338}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !706, file: !479, line: 323, baseType: !741, size: 64, align: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!82, !717}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !706, file: !479, line: 325, baseType: !82, size: 32, align: 32, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "set_asn1_parameters", scope: !706, file: !479, line: 327, baseType: !746, size: 64, align: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!82, !717, !749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !751, line: 561, baseType: !752)
!751 = !DIFile(filename: "/usr/include/openssl/asn1.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !751, line: 532, size: 128, align: 64, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !751, line: 533, baseType: !82, size: 32, align: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !752, file: !751, line: 560, baseType: !756, size: 64, align: 64, offset: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !752, file: !751, line: 534, size: 64, align: 64, elements: !757)
!757 = !{!758, !759, !761, !770, !781, !784, !787, !790, !793, !796, !799, !802, !805, !808, !811, !814, !817, !820, !823, !824, !825}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !756, file: !751, line: 535, baseType: !99, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !756, file: !751, line: 536, baseType: !760, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !210, line: 99, baseType: !82)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !756, file: !751, line: 537, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !210, line: 98, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !751, line: 247, size: 192, align: 64, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !764, file: !751, line: 248, baseType: !82, size: 32, align: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !751, line: 249, baseType: !82, size: 32, align: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !764, file: !751, line: 250, baseType: !346, size: 64, align: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !751, line: 256, baseType: !262, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !756, file: !751, line: 538, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !210, line: 103, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !751, line: 218, size: 320, align: 64, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !773, file: !751, line: 219, baseType: !127, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !773, file: !751, line: 219, baseType: !127, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !773, file: !751, line: 220, baseType: !82, size: 32, align: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !773, file: !751, line: 221, baseType: !82, size: 32, align: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !773, file: !751, line: 222, baseType: !361, size: 64, align: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !751, line: 223, baseType: !82, size: 32, align: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !756, file: !751, line: 539, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !210, line: 83, baseType: !764)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !756, file: !751, line: 540, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !210, line: 84, baseType: !764)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !756, file: !751, line: 541, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !210, line: 85, baseType: !764)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !756, file: !751, line: 542, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !210, line: 86, baseType: !764)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !756, file: !751, line: 543, baseType: !794, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !210, line: 87, baseType: !764)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !756, file: !751, line: 544, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !210, line: 88, baseType: !764)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !756, file: !751, line: 545, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !210, line: 89, baseType: !764)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !756, file: !751, line: 546, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !210, line: 90, baseType: !764)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !756, file: !751, line: 547, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !210, line: 92, baseType: !764)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !756, file: !751, line: 548, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !210, line: 91, baseType: !764)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !756, file: !751, line: 549, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !210, line: 93, baseType: !764)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !756, file: !751, line: 550, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !210, line: 95, baseType: !764)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !756, file: !751, line: 551, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !210, line: 96, baseType: !764)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !756, file: !751, line: 552, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !210, line: 97, baseType: !764)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !756, file: !751, line: 557, baseType: !762, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !756, file: !751, line: 558, baseType: !762, size: 64, align: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !756, file: !751, line: 559, baseType: !826, size: 64, align: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !751, line: 307, baseType: !828)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !751, line: 307, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "get_asn1_parameters", scope: !706, file: !479, line: 329, baseType: !746, size: 64, align: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !706, file: !479, line: 331, baseType: !831, size: 64, align: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!82, !717, !82, !82, !63}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !706, file: !479, line: 333, baseType: !63, size: 64, align: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "new_hash", scope: !554, file: !415, line: 583, baseType: !482, size: 64, align: 64, offset: 3968)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "new_mac_pkey_type", scope: !554, file: !415, line: 584, baseType: !82, size: 32, align: 32, offset: 4032)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "new_mac_secret_size", scope: !554, file: !415, line: 585, baseType: !82, size: 32, align: 32, offset: 4064)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "new_compression", scope: !554, file: !415, line: 587, baseType: !839, size: 64, align: 64, offset: 4096)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_COMP", file: !212, line: 908, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_comp_st", file: !212, line: 912, size: 192, align: 64, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !842, file: !212, line: 913, baseType: !82, size: 32, align: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !212, line: 914, baseType: !127, size: 64, align: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !842, file: !212, line: 916, baseType: !847, size: 64, align: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMP_METHOD", file: !849, line: 29, baseType: !850)
!849 = !DIFile(filename: "/usr/include/openssl/comp.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "comp_method_st", file: !849, line: 13, size: 512, align: 64, elements: !851)
!851 = !{!852, !853, !854, !868, !872, !876, !877, !881}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !849, line: 14, baseType: !82, size: 32, align: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !849, line: 15, baseType: !127, size: 64, align: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !850, file: !849, line: 16, baseType: !855, size: 64, align: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64, align: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!82, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMP_CTX", file: !849, line: 11, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "comp_ctx_st", file: !849, line: 31, size: 448, align: 64, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !860, file: !849, line: 32, baseType: !847, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "compress_in", scope: !860, file: !849, line: 33, baseType: !292, size: 64, align: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "compress_out", scope: !860, file: !849, line: 34, baseType: !292, size: 64, align: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "expand_in", scope: !860, file: !849, line: 35, baseType: !292, size: 64, align: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "expand_out", scope: !860, file: !849, line: 36, baseType: !292, size: 64, align: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !860, file: !849, line: 37, baseType: !295, size: 128, align: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !850, file: !849, line: 17, baseType: !869, size: 64, align: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !858}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !850, file: !849, line: 18, baseType: !873, size: 64, align: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!82, !858, !346, !129, !346, !129}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !850, file: !849, line: 21, baseType: !873, size: 64, align: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !850, file: !849, line: 27, baseType: !878, size: 64, align: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!262}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !850, file: !849, line: 28, baseType: !878, size: 64, align: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "cert_request", scope: !554, file: !415, line: 591, baseType: !82, size: 32, align: 32, offset: 4160)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "previous_client_finished", scope: !414, file: !415, line: 595, baseType: !425, size: 512, align: 8, offset: 8448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "previous_client_finished_len", scope: !414, file: !415, line: 596, baseType: !347, size: 8, align: 8, offset: 8960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "previous_server_finished", scope: !414, file: !415, line: 597, baseType: !425, size: 512, align: 8, offset: 8968)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "previous_server_finished_len", scope: !414, file: !415, line: 598, baseType: !347, size: 8, align: 8, offset: 9480)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "send_connection_binding", scope: !414, file: !415, line: 599, baseType: !82, size: 32, align: 32, offset: 9504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "next_proto_neg_seen", scope: !414, file: !415, line: 605, baseType: !82, size: 32, align: 32, offset: 9536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "is_probably_safari", scope: !414, file: !415, line: 615, baseType: !72, size: 8, align: 8, offset: 9568)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_selected", scope: !414, file: !415, line: 628, baseType: !346, size: 64, align: 64, offset: 9600)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "alpn_selected_len", scope: !414, file: !415, line: 629, baseType: !129, size: 32, align: 32, offset: 9664)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !227, file: !212, line: 1493, baseType: !893, size: 64, align: 64, offset: 1088)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dtls1_state_st", file: !895, line: 182, size: 7168, align: 64, elements: !896)
!895 = !DIFile(filename: "/usr/include/openssl/dtls1.h", directory: "/home/lichi/Desktop/open-vm-tools/line1410")
