; ModuleID = './vmware_toolbox_cmd-toolbox-cmd.o.i'
source_filename = "./vmware_toolbox_cmd-toolbox-cmd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.CmdTable = type { i8*, i32 (i8**, i32, i32)*, i8, i8, void (i8*, i8*)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._RpcChannel = type opaque
%struct._GKeyFile = type opaque

@vm_version = constant [20 x i8] c"version=10.3.0.5330\00", section ".modinfo", align 16
@.str = private unnamed_addr constant [11 x i8] c"toolboxcmd\00", align 1
@.str.1 = private unnamed_addr constant [38 x i8] c"@&!*@*@(error.missing)%s: Missing %s\0A\00", align 1
@gQuiet = internal global i32 0, align 4
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [28 x i8] c"Error starting RPC channel.\00", align 1
@.str.4 = private unnamed_addr constant [43 x i8] c"@&!*@*@(error.unknown)%s: Unknown %s '%s'\0A\00", align 1
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.6 = private unnamed_addr constant [66 x i8] c"@&!*@*@(error.novirtual)%s must be run inside a virtual machine.\0A\00", align 1
@options = internal global i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.17, i32 0, i32 0), align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21, globals: !28)
!1 = !DIFile(filename: "vmware_toolbox_cmd-toolbox-cmd.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 50, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "G_KEY_FILE_NONE", value: 0)
!19 = !DIEnumerator(name: "G_KEY_FILE_KEEP_COMMENTS", value: 1)
!20 = !DIEnumerator(name: "G_KEY_FILE_KEEP_TRANSLATIONS", value: 2)
!21 = !{!22, !24, !27}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !26, line: 46, baseType: !23)
!26 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !{!29, !35, !39, !41, !53}
!29 = distinct !DIGlobalVariable(name: "vm_version", scope: !0, file: !30, line: 46, type: !31, isLocal: false, isDefinition: true, variable: [20 x i8]* @vm_version)
!30 = !DIFile(filename: "toolbox-cmd.c", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 8, elements: !33)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!33 = !{!34}
!34 = !DISubrange(count: 20)
!35 = distinct !DIGlobalVariable(name: "gQuiet", scope: !0, file: !30, line: 79, type: !36, isLocal: true, isDefinition: true, variable: i32* @gQuiet)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !26, line: 50, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !26, line: 49, baseType: !38)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !30, line: 80, type: !40, isLocal: true, isDefinition: true, variable: i8** @options)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!41 = distinct !DIGlobalVariable(name: "long_options", scope: !0, file: !30, line: 70, type: !42, isLocal: true, isDefinition: true, variable: [4 x %struct.option]* @long_options)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1024, align: 64, elements: !51)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !44, line: 104, size: 256, align: 64, elements: !45)
!44 = !DIFile(filename: "/usr/include/getopt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!45 = !{!46, !47, !48, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !44, line: 106, baseType: !40, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !43, file: !44, line: 109, baseType: !38, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !43, file: !44, line: 110, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !43, file: !44, line: 111, baseType: !38, size: 32, align: 32, offset: 192)
!51 = !{!52}
!52 = !DISubrange(count: 4)
!53 = distinct !DIGlobalVariable(name: "commands", scope: !0, file: !30, line: 100, type: !54, isLocal: true, isDefinition: true, variable: [9 x %struct.CmdTable]* @commands)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2304, align: 64, elements: !75)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "CmdTable", file: !30, line: 67, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CmdTable", file: !30, line: 61, size: 256, align: 64, elements: !58)
!58 = !{!59, !60, !66, !69, !70}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !57, file: !30, line: 62, baseType: !40, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !57, file: !30, line: 63, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolboxCmdFunc", file: !30, line: 49, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!38, !65, !38, !36}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "requireArguments", scope: !57, file: !30, line: 64, baseType: !67, size: 8, align: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !68, line: 230, baseType: !23)
!68 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "requireRoot", scope: !57, file: !30, line: 65, baseType: !67, size: 8, align: 8, offset: 136)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "helpFunc", scope: !57, file: !30, line: 66, baseType: !71, size: 64, align: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolboxHelpFunc", file: !30, line: 53, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !40, !40}
!75 = !{!76}
!76 = !DISubrange(count: 9)
!77 = !{i32 2, !"Dwarf Version", i32 4}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!80 = distinct !DISubprogram(name: "ToolsCmd_MissingEntityError", scope: !30, file: !30, line: 136, type: !73, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!81 = !{}
!82 = !DILocalVariable(name: "name", arg: 1, scope: !80, file: !30, line: 136, type: !40)
!83 = !DIExpression()
!84 = !DILocation(line: 136, column: 41, scope: !80)
!85 = !DILocalVariable(name: "entity", arg: 2, scope: !80, file: !30, line: 137, type: !40)
!86 = !DILocation(line: 137, column: 41, scope: !80)
!87 = !DILocation(line: 139, column: 15, scope: !80)
!88 = !DILocation(line: 139, column: 102, scope: !80)
!89 = !DILocation(line: 139, column: 108, scope: !80)
!90 = !DILocation(line: 139, column: 4, scope: !91)
!91 = !DILexicalBlockFile(scope: !80, file: !30, discriminator: 1)
!92 = !DILocation(line: 140, column: 1, scope: !80)
!93 = distinct !DISubprogram(name: "ToolsCmd_Print", scope: !30, file: !30, line: 160, type: !94, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !40, null}
!96 = !DILocalVariable(name: "fmt", arg: 1, scope: !93, file: !30, line: 160, type: !40)
!97 = !DILocation(line: 160, column: 28, scope: !93)
!98 = !DILocation(line: 163, column: 9, scope: !99)
!99 = distinct !DILexicalBlock(scope: !93, file: !30, line: 163, column: 8)
!100 = !DILocation(line: 163, column: 8, scope: !93)
!101 = !DILocalVariable(name: "str", scope: !102, file: !30, line: 164, type: !24)
!102 = distinct !DILexicalBlock(scope: !99, file: !30, line: 163, column: 17)
!103 = !DILocation(line: 164, column: 14, scope: !102)
!104 = !DILocalVariable(name: "args", scope: !102, file: !30, line: 165, type: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !106, line: 79, baseType: !107)
!106 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !108, line: 40, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 165, baseType: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 192, align: 64, elements: !118)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 165, size: 192, align: 64, elements: !112)
!112 = !{!113, !115, !116, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !111, file: !1, line: 165, baseType: !114, size: 32, align: 32)
!114 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !111, file: !1, line: 165, baseType: !114, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !111, file: !1, line: 165, baseType: !27, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !111, file: !1, line: 165, baseType: !27, size: 64, align: 64, offset: 128)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DILocation(line: 165, column: 15, scope: !102)
!121 = !DILocation(line: 167, column: 6, scope: !102)
!122 = !DILocation(line: 168, column: 25, scope: !102)
!123 = !DILocation(line: 168, column: 30, scope: !102)
!124 = !DILocation(line: 168, column: 7, scope: !102)
!125 = !DILocation(line: 169, column: 6, scope: !102)
!126 = !DILocation(line: 171, column: 21, scope: !102)
!127 = !DILocation(line: 171, column: 7, scope: !102)
!128 = !DILocation(line: 172, column: 14, scope: !102)
!129 = !DILocation(line: 172, column: 7, scope: !102)
!130 = !DILocation(line: 173, column: 4, scope: !102)
!131 = !DILocation(line: 174, column: 1, scope: !93)
!132 = distinct !DISubprogram(name: "ToolsCmd_PrintErr", scope: !30, file: !30, line: 194, type: !94, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!133 = !DILocalVariable(name: "fmt", arg: 1, scope: !132, file: !30, line: 194, type: !40)
!134 = !DILocation(line: 194, column: 31, scope: !132)
!135 = !DILocation(line: 197, column: 9, scope: !136)
!136 = distinct !DILexicalBlock(scope: !132, file: !30, line: 197, column: 8)
!137 = !DILocation(line: 197, column: 8, scope: !132)
!138 = !DILocalVariable(name: "str", scope: !139, file: !30, line: 198, type: !24)
!139 = distinct !DILexicalBlock(scope: !136, file: !30, line: 197, column: 17)
!140 = !DILocation(line: 198, column: 14, scope: !139)
!141 = !DILocalVariable(name: "args", scope: !139, file: !30, line: 199, type: !105)
!142 = !DILocation(line: 199, column: 15, scope: !139)
!143 = !DILocation(line: 201, column: 6, scope: !139)
!144 = !DILocation(line: 202, column: 25, scope: !139)
!145 = !DILocation(line: 202, column: 30, scope: !139)
!146 = !DILocation(line: 202, column: 7, scope: !139)
!147 = !DILocation(line: 203, column: 6, scope: !139)
!148 = !DILocation(line: 205, column: 24, scope: !139)
!149 = !DILocation(line: 205, column: 7, scope: !139)
!150 = !DILocation(line: 206, column: 14, scope: !139)
!151 = !DILocation(line: 206, column: 7, scope: !139)
!152 = !DILocation(line: 207, column: 4, scope: !139)
!153 = !DILocation(line: 208, column: 1, scope: !132)
!154 = distinct !DISubprogram(name: "ToolsCmd_SendRPC", scope: !30, file: !30, line: 228, type: !155, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!155 = !DISubroutineType(types: !156)
!156 = !{!36, !40, !157, !65, !160}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 216, baseType: !159)
!158 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1629")
!159 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!161 = !DILocalVariable(name: "rpc", arg: 1, scope: !154, file: !30, line: 228, type: !40)
!162 = !DILocation(line: 228, column: 30, scope: !154)
!163 = !DILocalVariable(name: "rpcLen", arg: 2, scope: !154, file: !30, line: 229, type: !157)
!164 = !DILocation(line: 229, column: 25, scope: !154)
!165 = !DILocalVariable(name: "result", arg: 3, scope: !154, file: !30, line: 230, type: !65)
!166 = !DILocation(line: 230, column: 25, scope: !154)
!167 = !DILocalVariable(name: "resultLen", arg: 4, scope: !154, file: !30, line: 231, type: !160)
!168 = !DILocation(line: 231, column: 26, scope: !154)
!169 = !DILocalVariable(name: "lrpc", scope: !154, file: !30, line: 233, type: !22)
!170 = !DILocation(line: 233, column: 10, scope: !154)
!171 = !DILocation(line: 233, column: 26, scope: !154)
!172 = !DILocalVariable(name: "chan", scope: !154, file: !30, line: 234, type: !173)
