; ModuleID = './line13-privsep.o.i'
source_filename = "./line13-privsep.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.proxyspec = type { i8, %struct.sockaddr_storage, i32, %struct.sockaddr_storage, i32, i16, i8*, i32 (%struct.sockaddr*, i32*, i32, %struct.sockaddr*, i32)*, i32 (i32)*, %struct.proxyspec* }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.sockaddr = type { i16, [14 x i8] }
%union.__CONST_SOCKADDR_ARG = type { %struct.sockaddr* }
%struct.opts = type { i16, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.ssl_method_st* ()*, %struct.x509_st*, %struct.evp_pkey_st*, %struct.evp_pkey_st*, %struct.stack_st_X509*, %struct.x509_st*, %struct.evp_pkey_st*, %struct.dh_st*, i8*, %struct.proxyspec*, i8*, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !44, globals: !121)
!1 = !DIFile(filename: "line13-privsep.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/bits/socket_type.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!7 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!8 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!9 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!10 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!11 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!12 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!13 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!14 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 40, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!18 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!19 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!20 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!21 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!22 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!23 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!24 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!25 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!26 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!27 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!28 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!29 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!30 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!31 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!32 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!33 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!34 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!35 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!36 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!37 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!38 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!43 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!44 = !{!45, !50, !52, !109, !114, !115, !116, !93, !117, !51, !119}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !46, line: 109, baseType: !47)
!46 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !48, line: 172, baseType: !49)
!48 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!49 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxyspec_t", file: !56, line: 54, baseType: !57)
!56 = !DIFile(filename: "opts.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "proxyspec", file: !56, line: 37, size: 2496, align: 64, elements: !58)
!58 = !{!59, !61, !62, !63, !64, !79, !82, !83, !84, !85, !87, !102, !107}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !57, file: !56, line: 38, baseType: !60, size: 1, align: 32, flags: DIFlagBitField, extraData: i64 0)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "http", scope: !57, file: !56, line: 39, baseType: !60, size: 1, align: 32, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "upgrade", scope: !57, file: !56, line: 40, baseType: !60, size: 1, align: 32, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "dns", scope: !57, file: !56, line: 41, baseType: !60, size: 1, align: 32, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "listen_addr", scope: !57, file: !56, line: 42, baseType: !65, size: 1024, align: 64, offset: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !66, line: 166, size: 1024, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!67 = !{!68, !72, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !65, file: !66, line: 168, baseType: !69, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !70, line: 28, baseType: !71)
!70 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!71 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !65, file: !66, line: 169, baseType: !73, size: 944, align: 8, offset: 16)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 944, align: 8, elements: !75)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !{!76}
!76 = !DISubrange(count: 118)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !65, file: !66, line: 170, baseType: !78, size: 64, align: 64, offset: 960)
!78 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "listen_addrlen", scope: !57, file: !56, line: 43, baseType: !80, size: 32, align: 32, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !66, line: 33, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !48, line: 189, baseType: !60)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "connect_addr", scope: !57, file: !56, line: 47, baseType: !65, size: 1024, align: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "connect_addrlen", scope: !57, file: !56, line: 48, baseType: !80, size: 32, align: 32, offset: 2176)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sni_port", scope: !57, file: !56, line: 49, baseType: !71, size: 16, align: 16, offset: 2208)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "natengine", scope: !57, file: !56, line: 50, baseType: !86, size: 64, align: 64, offset: 2240)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "natlookup", scope: !57, file: !56, line: 51, baseType: !88, size: 64, align: 64, offset: 2304)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_lookup_cb_t", file: !89, line: 39, baseType: !90)
!89 = !DIFile(filename: "nat.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!51, !93, !101, !51, !93, !80}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !66, line: 153, size: 128, align: 16, elements: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !94, file: !66, line: 155, baseType: !69, size: 16, align: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !94, file: !66, line: 156, baseType: !98, size: 112, align: 8, offset: 16)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 112, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 14)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "natsocket", scope: !57, file: !56, line: 52, baseType: !103, size: 64, align: 64, offset: 2368)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_socket_cb_t", file: !89, line: 41, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!51, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !57, file: !56, line: 53, baseType: !108, size: 64, align: 64, offset: 2432)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !110, line: 85, baseType: !111)
!110 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !51}
!114 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!115 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !118, line: 54, baseType: !49)
!118 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!121 = !{!122, !124, !129, !130, !131, !132, !133, !134}
!122 = distinct !DIGlobalVariable(name: "privsep_fastpath", scope: !0, file: !123, line: 83, type: !51, isLocal: true, isDefinition: true, variable: i32* @privsep_fastpath)
!123 = !DIFile(filename: "privsep.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!124 = distinct !DIGlobalVariable(name: "received_sighup", scope: !0, file: !123, line: 86, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sighup)
!125 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !110, line: 40, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !128, line: 22, baseType: !51)
!128 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!129 = distinct !DIGlobalVariable(name: "received_sigint", scope: !0, file: !123, line: 87, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sigint)
!130 = distinct !DIGlobalVariable(name: "received_sigquit", scope: !0, file: !123, line: 88, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sigquit)
!131 = distinct !DIGlobalVariable(name: "received_sigchld", scope: !0, file: !123, line: 90, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sigchld)
!132 = distinct !DIGlobalVariable(name: "received_sigusr1", scope: !0, file: !123, line: 91, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sigusr1)
!133 = distinct !DIGlobalVariable(name: "selfpipe_wrfd", scope: !0, file: !123, line: 93, type: !125, isLocal: true, isDefinition: true, variable: i32* @selfpipe_wrfd)
!134 = distinct !DIGlobalVariable(name: "received_sigterm", scope: !0, file: !123, line: 89, type: !125, isLocal: true, isDefinition: true, variable: i32* @received_sigterm)
!135 = !{i32 2, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!138 = distinct !DISubprogram(name: "privsep_client_openfile", scope: !123, file: !123, line: 703, type: !139, isLocal: false, isDefinition: true, scopeLine: 704, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!139 = !DISubroutineType(types: !140)
!140 = !{!51, !51, !141, !51}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!143 = !{}
!144 = !DILocalVariable(name: "clisock", arg: 1, scope: !138, file: !123, line: 703, type: !51)
!145 = !DIExpression()
!146 = !DILocation(line: 703, column: 29, scope: !138)
!147 = !DILocalVariable(name: "fn", arg: 2, scope: !138, file: !123, line: 703, type: !141)
!148 = !DILocation(line: 703, column: 50, scope: !138)
!149 = !DILocalVariable(name: "mkpath", arg: 3, scope: !138, file: !123, line: 703, type: !51)
!150 = !DILocation(line: 703, column: 58, scope: !138)
!151 = !DILocalVariable(name: "ans", scope: !138, file: !123, line: 705, type: !152)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 40, align: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 5)
!155 = !DILocation(line: 705, column: 7, scope: !138)
!156 = !DILocation(line: 706, column: 22, scope: !138)
!157 = !DILocation(line: 706, column: 15, scope: !138)
!158 = !DILocation(line: 706, column: 13, scope: !138)
!159 = !DILocation(line: 706, column: 2, scope: !160)
!160 = !DILexicalBlockFile(scope: !138, file: !123, discriminator: 1)
!161 = !DILocation(line: 706, column: 2, scope: !138)
!162 = !DILocalVariable(name: "req", scope: !138, file: !123, line: 706, type: !163)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, align: 8, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: -1)
!166 = !DIExpression(DW_OP_deref)
!167 = !DILocation(line: 706, column: 7, scope: !138)
!168 = !DILocalVariable(name: "fd", scope: !138, file: !123, line: 707, type: !51)
!169 = !DILocation(line: 707, column: 6, scope: !138)
!170 = !DILocalVariable(name: "n", scope: !138, file: !123, line: 708, type: !45)
!171 = !DILocation(line: 708, column: 10, scope: !138)
!172 = !DILocation(line: 710, column: 6, scope: !173)
!173 = distinct !DILexicalBlock(scope: !138, file: !123, line: 710, column: 6)
!174 = !DILocation(line: 710, column: 6, scope: !138)
!175 = !DILocation(line: 711, column: 34, scope: !173)
!176 = !DILocation(line: 711, column: 38, scope: !173)
!177 = !DILocation(line: 711, column: 10, scope: !173)
!178 = !DILocation(line: 711, column: 3, scope: !173)
!179 = !DILocation(line: 713, column: 11, scope: !138)
!180 = !DILocation(line: 713, column: 2, scope: !138)
!181 = !DILocation(line: 713, column: 9, scope: !138)
!182 = !DILocation(line: 714, column: 13, scope: !138)
!183 = !DILocation(line: 714, column: 18, scope: !138)
!184 = !DILocation(line: 714, column: 34, scope: !138)
!185 = !DILocation(line: 714, column: 2, scope: !138)
!186 = !DILocation(line: 716, column: 20, scope: !187)
!187 = distinct !DILexicalBlock(scope: !138, file: !123, line: 716, column: 6)
!188 = !DILocation(line: 716, column: 6, scope: !187)
!189 = !DILocation(line: 716, column: 51, scope: !187)
!190 = !DILocation(line: 716, column: 6, scope: !138)
!191 = !DILocation(line: 717, column: 3, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !123, line: 716, column: 58)
!193 = !DILocation(line: 720, column: 25, scope: !194)
!194 = distinct !DILexicalBlock(scope: !138, file: !123, line: 720, column: 6)
!195 = !DILocation(line: 720, column: 34, scope: !194)
!196 = !DILocation(line: 720, column: 11, scope: !194)
!197 = !DILocation(line: 720, column: 9, scope: !194)
!198 = !DILocation(line: 720, column: 58, scope: !194)
!199 = !DILocation(line: 720, column: 6, scope: !138)
!200 = !DILocation(line: 721, column: 3, scope: !201)
!201 = distinct !DILexicalBlock(scope: !194, file: !123, line: 720, column: 65)
!202 = !DILocation(line: 724, column: 6, scope: !203)
!203 = distinct !DILexicalBlock(scope: !138, file: !123, line: 724, column: 6)
!204 = !DILocation(line: 724, column: 8, scope: !203)
!205 = !DILocation(line: 724, column: 6, scope: !138)
!206 = !DILocation(line: 725, column: 4, scope: !207)
!207 = distinct !DILexicalBlock(scope: !203, file: !123, line: 724, column: 13)
!208 = !DILocation(line: 725, column: 8, scope: !207)
!209 = !DILocation(line: 726, column: 3, scope: !207)
!210 = !DILocation(line: 729, column: 10, scope: !138)
!211 = !DILocation(line: 729, column: 2, scope: !138)
!212 = !DILocation(line: 731, column: 3, scope: !213)
!213 = distinct !DILexicalBlock(scope: !138, file: !123, line: 729, column: 18)
!214 = !DILocation(line: 733, column: 4, scope: !213)
!215 = !DILocation(line: 733, column: 8, scope: !213)
!216 = !DILocation(line: 734, column: 3, scope: !213)
!217 = !DILocation(line: 736, column: 7, scope: !218)
!218 = distinct !DILexicalBlock(scope: !213, file: !123, line: 736, column: 7)
!219 = !DILocation(line: 736, column: 9, scope: !218)
!220 = !DILocation(line: 736, column: 7, scope: !213)
!221 = !DILocation(line: 737, column: 5, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !123, line: 736, column: 39)
!223 = !DILocation(line: 737, column: 9, scope: !222)
!224 = !DILocation(line: 738, column: 4, scope: !222)
!225 = !DILocation(line: 740, column: 19, scope: !213)
!226 = !DILocation(line: 740, column: 10, scope: !213)
!227 = !DILocation(line: 740, column: 4, scope: !213)
!228 = !DILocation(line: 740, column: 8, scope: !213)
!229 = !DILocation(line: 741, column: 3, scope: !213)
!230 = !DILocation(line: 741, column: 3, scope: !231)
!231 = !DILexicalBlockFile(scope: !213, file: !123, discriminator: 1)
!232 = !DILocation(line: 745, column: 4, scope: !213)
!233 = !DILocation(line: 745, column: 8, scope: !213)
!234 = !DILocation(line: 746, column: 3, scope: !213)
!235 = !DILocation(line: 749, column: 9, scope: !138)
!236 = !DILocation(line: 749, column: 2, scope: !138)
!237 = !DILocation(line: 750, column: 1, scope: !138)
!238 = distinct !DISubprogram(name: "privsep_server_openfile", scope: !123, file: !123, line: 184, type: !239, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!239 = !DISubroutineType(types: !240)
!240 = !{!51, !141, !51}
!241 = !DILocalVariable(name: "fn", arg: 1, scope: !238, file: !123, line: 184, type: !141)
!242 = !DILocation(line: 184, column: 37, scope: !238)
!243 = !DILocalVariable(name: "mkpath", arg: 2, scope: !238, file: !123, line: 184, type: !51)
!244 = !DILocation(line: 184, column: 45, scope: !238)
!245 = !DILocalVariable(name: "fd", scope: !238, file: !123, line: 186, type: !51)
!246 = !DILocation(line: 186, column: 6, scope: !238)
!247 = !DILocalVariable(name: "tmp", scope: !238, file: !123, line: 186, type: !51)
!248 = !DILocation(line: 186, column: 10, scope: !238)
!249 = !DILocation(line: 188, column: 6, scope: !250)
!250 = distinct !DILexicalBlock(scope: !238, file: !123, line: 188, column: 6)
!251 = !DILocation(line: 188, column: 6, scope: !238)
!252 = !DILocalVariable(name: "filedir", scope: !253, file: !123, line: 189, type: !86)
!253 = distinct !DILexicalBlock(scope: !250, file: !123, line: 188, column: 14)
!254 = !DILocation(line: 189, column: 9, scope: !253)
!255 = !DILocalVariable(name: "fn2", scope: !253, file: !123, line: 189, type: !86)
!256 = !DILocation(line: 189, column: 19, scope: !253)
!257 = !DILocation(line: 191, column: 16, scope: !253)
!258 = !DILocation(line: 191, column: 9, scope: !253)
!259 = !DILocation(line: 191, column: 7, scope: !253)
!260 = !DILocation(line: 192, column: 8, scope: !261)
!261 = distinct !DILexicalBlock(scope: !253, file: !123, line: 192, column: 7)
!262 = !DILocation(line: 192, column: 7, scope: !253)
!263 = !DILocation(line: 193, column: 11, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !123, line: 192, column: 13)
!265 = !DILocation(line: 193, column: 10, scope: !264)
!266 = !DILocation(line: 193, column: 8, scope: !264)
!267 = !DILocation(line: 195, column: 29, scope: !264)
!268 = !DILocation(line: 195, column: 28, scope: !264)
!269 = !DILocation(line: 195, column: 19, scope: !270)
!270 = !DILexicalBlockFile(scope: !264, file: !123, discriminator: 1)
!271 = !DILocation(line: 195, column: 37, scope: !272)
!272 = !DILexicalBlockFile(scope: !264, file: !123, discriminator: 2)
!273 = !DILocation(line: 195, column: 36, scope: !264)
!274 = !DILocation(line: 194, column: 4, scope: !264)
!275 = !DILocation(line: 196, column: 11, scope: !264)
!276 = !DILocation(line: 196, column: 5, scope: !264)
!277 = !DILocation(line: 196, column: 9, scope: !264)
!278 = !DILocation(line: 197, column: 4, scope: !264)
!279 = !DILocation(line: 199, column: 21, scope: !253)
!280 = !DILocation(line: 199, column: 13, scope: !253)
!281 = !DILocation(line: 199, column: 11, scope: !253)
!282 = !DILocation(line: 200, column: 8, scope: !283)
!283 = distinct !DILexicalBlock(scope: !253, file: !123, line: 200, column: 7)
!284 = !DILocation(line: 200, column: 7, scope: !253)
!285 = !DILocation(line: 201, column: 11, scope: !286)
!286 = distinct !DILexicalBlock(scope: !283, file: !123, line: 200, column: 17)
!287 = !DILocation(line: 201, column: 10, scope: !286)
!288 = !DILocation(line: 201, column: 8, scope: !286)
!289 = !DILocation(line: 203, column: 29, scope: !286)
!290 = !DILocation(line: 203, column: 28, scope: !286)
!291 = !DILocation(line: 203, column: 19, scope: !292)
!292 = !DILexicalBlockFile(scope: !286, file: !123, discriminator: 1)
!293 = !DILocation(line: 203, column: 37, scope: !294)
!294 = !DILexicalBlockFile(scope: !286, file: !123, discriminator: 2)
!295 = !DILocation(line: 203, column: 36, scope: !286)
!296 = !DILocation(line: 202, column: 4, scope: !286)
!297 = !DILocation(line: 204, column: 9, scope: !286)
!298 = !DILocation(line: 204, column: 4, scope: !286)
!299 = !DILocation(line: 205, column: 11, scope: !286)
!300 = !DILocation(line: 205, column: 5, scope: !286)
!301 = !DILocation(line: 205, column: 9, scope: !286)
!302 = !DILocation(line: 206, column: 4, scope: !286)
!303 = !DILocation(line: 208, column: 18, scope: !304)
!304 = distinct !DILexicalBlock(scope: !253, file: !123, line: 208, column: 7)
!305 = !DILocation(line: 208, column: 7, scope: !304)
!306 = !DILocation(line: 208, column: 33, scope: !304)
!307 = !DILocation(line: 208, column: 7, scope: !253)
!308 = !DILocation(line: 209, column: 11, scope: !309)
!309 = distinct !DILexicalBlock(scope: !304, file: !123, line: 208, column: 40)
!310 = !DILocation(line: 209, column: 10, scope: !309)
!311 = !DILocation(line: 209, column: 8, scope: !309)
!312 = !DILocation(line: 211, column: 19, scope: !309)
!313 = !DILocation(line: 211, column: 38, scope: !309)
!314 = !DILocation(line: 211, column: 37, scope: !309)
!315 = !DILocation(line: 211, column: 28, scope: !316)
!316 = !DILexicalBlockFile(scope: !309, file: !123, discriminator: 1)
!317 = !DILocation(line: 211, column: 46, scope: !318)
!318 = !DILexicalBlockFile(scope: !309, file: !123, discriminator: 2)
!319 = !DILocation(line: 211, column: 45, scope: !309)
!320 = !DILocation(line: 210, column: 4, scope: !309)
!321 = !DILocation(line: 212, column: 9, scope: !309)
!322 = !DILocation(line: 212, column: 4, scope: !309)
!323 = !DILocation(line: 213, column: 11, scope: !309)
!324 = !DILocation(line: 213, column: 5, scope: !309)
!325 = !DILocation(line: 213, column: 9, scope: !309)
!326 = !DILocation(line: 214, column: 4, scope: !309)
!327 = !DILocation(line: 216, column: 8, scope: !253)
!328 = !DILocation(line: 216, column: 3, scope: !253)
!329 = !DILocation(line: 217, column: 2, scope: !253)
!330 = !DILocation(line: 219, column: 12, scope: !238)
!331 = !DILocation(line: 219, column: 7, scope: !238)
!332 = !DILocation(line: 219, column: 5, scope: !238)
!333 = !DILocation(line: 220, column: 6, scope: !334)
!334 = distinct !DILexicalBlock(scope: !238, file: !123, line: 220, column: 6)
!335 = !DILocation(line: 220, column: 9, scope: !334)
!336 = !DILocation(line: 220, column: 6, scope: !238)
!337 = !DILocation(line: 221, column: 10, scope: !338)
!338 = distinct !DILexicalBlock(scope: !334, file: !123, line: 220, column: 16)
!339 = !DILocation(line: 221, column: 9, scope: !338)
!340 = !DILocation(line: 221, column: 7, scope: !338)
!341 = !DILocation(line: 223, column: 18, scope: !338)
!342 = !DILocation(line: 223, column: 32, scope: !338)
!343 = !DILocation(line: 223, column: 31, scope: !338)
!344 = !DILocation(line: 223, column: 22, scope: !345)
!345 = !DILexicalBlockFile(scope: !338, file: !123, discriminator: 1)
!346 = !DILocation(line: 223, column: 40, scope: !347)
!347 = !DILexicalBlockFile(scope: !338, file: !123, discriminator: 2)
!348 = !DILocation(line: 223, column: 39, scope: !338)
!349 = !DILocation(line: 222, column: 3, scope: !338)
!350 = !DILocation(line: 224, column: 10, scope: !338)
!351 = !DILocation(line: 224, column: 4, scope: !338)
!352 = !DILocation(line: 224, column: 8, scope: !338)
!353 = !DILocation(line: 225, column: 3, scope: !338)
!354 = !DILocation(line: 227, column: 12, scope: !355)
!355 = distinct !DILexicalBlock(scope: !238, file: !123, line: 227, column: 6)
!356 = !DILocation(line: 227, column: 6, scope: !355)
!357 = !DILocation(line: 227, column: 28, scope: !355)
!358 = !DILocation(line: 227, column: 6, scope: !238)
!359 = !DILocation(line: 228, column: 10, scope: !360)
!360 = distinct !DILexicalBlock(scope: !355, file: !123, line: 227, column: 35)
!361 = !DILocation(line: 228, column: 9, scope: !360)
!362 = !DILocation(line: 228, column: 7, scope: !360)
!363 = !DILocation(line: 230, column: 18, scope: !360)
!364 = !DILocation(line: 230, column: 32, scope: !360)
!365 = !DILocation(line: 230, column: 31, scope: !360)
!366 = !DILocation(line: 230, column: 22, scope: !367)
!367 = !DILexicalBlockFile(scope: !360, file: !123, discriminator: 1)
!368 = !DILocation(line: 230, column: 40, scope: !369)
!369 = !DILexicalBlockFile(scope: !360, file: !123, discriminator: 2)
!370 = !DILocation(line: 230, column: 39, scope: !360)
!371 = !DILocation(line: 229, column: 3, scope: !360)
!372 = !DILocation(line: 231, column: 10, scope: !360)
!373 = !DILocation(line: 231, column: 4, scope: !360)
!374 = !DILocation(line: 231, column: 8, scope: !360)
!375 = !DILocation(line: 232, column: 3, scope: !360)
!376 = !DILocation(line: 234, column: 9, scope: !238)
!377 = !DILocation(line: 234, column: 2, scope: !238)
!378 = !DILocation(line: 235, column: 1, scope: !238)
!379 = distinct !DISubprogram(name: "privsep_client_opensock", scope: !123, file: !123, line: 753, type: !380, isLocal: false, isDefinition: true, scopeLine: 754, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!380 = !DISubroutineType(types: !381)
!381 = !{!51, !51, !53}
!382 = !DILocalVariable(name: "clisock", arg: 1, scope: !379, file: !123, line: 753, type: !51)
!383 = !DILocation(line: 753, column: 29, scope: !379)
!384 = !DILocalVariable(name: "spec", arg: 2, scope: !379, file: !123, line: 753, type: !53)
!385 = !DILocation(line: 753, column: 57, scope: !379)
!386 = !DILocalVariable(name: "ans", scope: !379, file: !123, line: 755, type: !152)
!387 = !DILocation(line: 755, column: 7, scope: !379)
!388 = !DILocalVariable(name: "req", scope: !379, file: !123, line: 756, type: !389)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 72, align: 8, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 9)
!392 = !DILocation(line: 756, column: 7, scope: !379)
!393 = !DILocalVariable(name: "fd", scope: !379, file: !123, line: 757, type: !51)
!394 = !DILocation(line: 757, column: 6, scope: !379)
!395 = !DILocalVariable(name: "n", scope: !379, file: !123, line: 758, type: !45)
!396 = !DILocation(line: 758, column: 10, scope: !379)
!397 = !DILocation(line: 760, column: 6, scope: !398)
!398 = distinct !DILexicalBlock(scope: !379, file: !123, line: 760, column: 6)
!399 = !DILocation(line: 760, column: 6, scope: !379)
!400 = !DILocation(line: 761, column: 34, scope: !398)
!401 = !DILocation(line: 761, column: 10, scope: !398)
!402 = !DILocation(line: 761, column: 3, scope: !398)
!403 = !DILocation(line: 763, column: 2, scope: !379)
!404 = !DILocation(line: 763, column: 9, scope: !379)
!405 = !DILocation(line: 764, column: 37, scope: !379)
!406 = !DILocation(line: 764, column: 27, scope: !379)
!407 = !DILocation(line: 764, column: 2, scope: !379)
!408 = !DILocation(line: 764, column: 35, scope: !379)
!409 = !DILocation(line: 766, column: 20, scope: !410)
!410 = distinct !DILexicalBlock(scope: !379, file: !123, line: 766, column: 6)
!411 = !DILocation(line: 766, column: 29, scope: !410)
!412 = !DILocation(line: 766, column: 6, scope: !410)
!413 = !DILocation(line: 766, column: 51, scope: !410)
!414 = !DILocation(line: 766, column: 6, scope: !379)
!415 = !DILocation(line: 767, column: 3, scope: !416)
!416 = distinct !DILexicalBlock(scope: !410, file: !123, line: 766, column: 58)
!417 = !DILocation(line: 770, column: 25, scope: !418)
!418 = distinct !DILexicalBlock(scope: !379, file: !123, line: 770, column: 6)
!419 = !DILocation(line: 770, column: 34, scope: !418)
!420 = !DILocation(line: 770, column: 11, scope: !418)
!421 = !DILocation(line: 770, column: 9, scope: !418)
!422 = !DILocation(line: 770, column: 58, scope: !418)
!423 = !DILocation(line: 770, column: 6, scope: !379)
!424 = !DILocation(line: 771, column: 3, scope: !425)
!425 = distinct !DILexicalBlock(scope: !418, file: !123, line: 770, column: 65)
!426 = !DILocation(line: 774, column: 6, scope: !427)
!427 = distinct !DILexicalBlock(scope: !379, file: !123, line: 774, column: 6)
!428 = !DILocation(line: 774, column: 8, scope: !427)
!429 = !DILocation(line: 774, column: 6, scope: !379)
!430 = !DILocation(line: 775, column: 4, scope: !431)
!431 = distinct !DILexicalBlock(scope: !427, file: !123, line: 774, column: 13)
!432 = !DILocation(line: 775, column: 8, scope: !431)
!433 = !DILocation(line: 776, column: 3, scope: !431)
!434 = !DILocation(line: 779, column: 10, scope: !379)
!435 = !DILocation(line: 779, column: 2, scope: !379)
!436 = !DILocation(line: 781, column: 3, scope: !437)
!437 = distinct !DILexicalBlock(scope: !379, file: !123, line: 779, column: 18)
!438 = !DILocation(line: 783, column: 4, scope: !437)
!439 = !DILocation(line: 783, column: 8, scope: !437)
!440 = !DILocation(line: 784, column: 3, scope: !437)
!441 = !DILocation(line: 786, column: 7, scope: !442)
!442 = distinct !DILexicalBlock(scope: !437, file: !123, line: 786, column: 7)
!443 = !DILocation(line: 786, column: 9, scope: !442)
!444 = !DILocation(line: 786, column: 7, scope: !437)
!445 = !DILocation(line: 787, column: 5, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !123, line: 786, column: 39)
!447 = !DILocation(line: 787, column: 9, scope: !446)
!448 = !DILocation(line: 788, column: 4, scope: !446)
!449 = !DILocation(line: 790, column: 19, scope: !437)
!450 = !DILocation(line: 790, column: 10, scope: !437)
!451 = !DILocation(line: 790, column: 4, scope: !437)
!452 = !DILocation(line: 790, column: 8, scope: !437)
!453 = !DILocation(line: 791, column: 3, scope: !437)
!454 = !DILocation(line: 791, column: 3, scope: !455)
!455 = !DILexicalBlockFile(scope: !437, file: !123, discriminator: 1)
!456 = !DILocation(line: 795, column: 4, scope: !437)
!457 = !DILocation(line: 795, column: 8, scope: !437)
!458 = !DILocation(line: 796, column: 3, scope: !437)
!459 = !DILocation(line: 799, column: 9, scope: !379)
!460 = !DILocation(line: 799, column: 2, scope: !379)
!461 = !DILocation(line: 800, column: 1, scope: !379)
!462 = distinct !DISubprogram(name: "privsep_server_opensock", scope: !123, file: !123, line: 250, type: !463, isLocal: true, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!463 = !DISubroutineType(types: !464)
!464 = !{!51, !53}
!465 = !DILocalVariable(name: "spec", arg: 1, scope: !462, file: !123, line: 250, type: !53)
!466 = !DILocation(line: 250, column: 44, scope: !462)
!467 = !DILocalVariable(name: "fd", scope: !462, file: !123, line: 252, type: !51)
!468 = !DILocation(line: 252, column: 17, scope: !462)
!469 = !DILocalVariable(name: "on", scope: !462, file: !123, line: 253, type: !51)
!470 = !DILocation(line: 253, column: 6, scope: !462)
!471 = !DILocalVariable(name: "rv", scope: !462, file: !123, line: 254, type: !51)
!472 = !DILocation(line: 254, column: 6, scope: !462)
!473 = !DILocation(line: 256, column: 14, scope: !462)
!474 = !DILocation(line: 256, column: 20, scope: !462)
!475 = !DILocation(line: 256, column: 32, scope: !462)
!476 = !DILocation(line: 256, column: 7, scope: !462)
!477 = !DILocation(line: 256, column: 5, scope: !462)
!478 = !DILocation(line: 257, column: 6, scope: !479)
!479 = distinct !DILexicalBlock(scope: !462, file: !123, line: 257, column: 6)
!480 = !DILocation(line: 257, column: 9, scope: !479)
!481 = !DILocation(line: 257, column: 6, scope: !462)
!482 = !DILocation(line: 259, column: 28, scope: !483)
!483 = distinct !DILexicalBlock(scope: !479, file: !123, line: 257, column: 16)
!484 = !DILocation(line: 259, column: 27, scope: !483)
!485 = !DILocation(line: 259, column: 18, scope: !486)
!486 = !DILexicalBlockFile(scope: !483, file: !123, discriminator: 1)
!487 = !DILocation(line: 259, column: 36, scope: !488)
!488 = !DILexicalBlockFile(scope: !483, file: !123, discriminator: 2)
!489 = !DILocation(line: 259, column: 35, scope: !483)
!490 = !DILocation(line: 258, column: 3, scope: !483)
!491 = !DILocation(line: 260, column: 22, scope: !483)
!492 = !DILocation(line: 260, column: 3, scope: !483)
!493 = !DILocation(line: 261, column: 3, scope: !483)
!494 = !DILocation(line: 264, column: 38, scope: !462)
!495 = !DILocation(line: 264, column: 7, scope: !462)
!496 = !DILocation(line: 264, column: 5, scope: !462)
!497 = !DILocation(line: 265, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !462, file: !123, line: 265, column: 6)
!499 = !DILocation(line: 265, column: 9, scope: !498)
!500 = !DILocation(line: 265, column: 6, scope: !462)
!501 = !DILocation(line: 267, column: 28, scope: !502)
!502 = distinct !DILexicalBlock(scope: !498, file: !123, line: 265, column: 16)
!503 = !DILocation(line: 267, column: 27, scope: !502)
!504 = !DILocation(line: 267, column: 18, scope: !505)
!505 = !DILexicalBlockFile(scope: !502, file: !123, discriminator: 1)
!506 = !DILocation(line: 267, column: 36, scope: !507)
!507 = !DILexicalBlockFile(scope: !502, file: !123, discriminator: 2)
!508 = !DILocation(line: 267, column: 35, scope: !502)
!509 = !DILocation(line: 266, column: 3, scope: !502)
!510 = !DILocation(line: 268, column: 22, scope: !502)
!511 = !DILocation(line: 268, column: 3, scope: !502)
!512 = !DILocation(line: 269, column: 3, scope: !502)
!513 = !DILocation(line: 272, column: 18, scope: !462)
!514 = !DILocation(line: 272, column: 47, scope: !462)
!515 = !DILocation(line: 272, column: 7, scope: !462)
!516 = !DILocation(line: 272, column: 5, scope: !462)
!517 = !DILocation(line: 273, column: 6, scope: !518)
!518 = distinct !DILexicalBlock(scope: !462, file: !123, line: 273, column: 6)
!519 = !DILocation(line: 273, column: 9, scope: !518)
!520 = !DILocation(line: 273, column: 6, scope: !462)
!521 = !DILocation(line: 275, column: 28, scope: !522)
!522 = distinct !DILexicalBlock(scope: !518, file: !123, line: 273, column: 16)
!523 = !DILocation(line: 275, column: 27, scope: !522)
!524 = !DILocation(line: 275, column: 18, scope: !525)
!525 = !DILexicalBlockFile(scope: !522, file: !123, discriminator: 1)
!526 = !DILocation(line: 275, column: 36, scope: !527)
!527 = !DILexicalBlockFile(scope: !522, file: !123, discriminator: 2)
!528 = !DILocation(line: 275, column: 35, scope: !522)
!529 = !DILocation(line: 274, column: 3, scope: !522)
!530 = !DILocation(line: 276, column: 22, scope: !522)
!531 = !DILocation(line: 276, column: 3, scope: !522)
!532 = !DILocation(line: 277, column: 3, scope: !522)
!533 = !DILocation(line: 280, column: 43, scope: !462)
!534 = !DILocation(line: 280, column: 7, scope: !462)
!535 = !DILocation(line: 280, column: 5, scope: !462)
!536 = !DILocation(line: 281, column: 6, scope: !537)
!537 = distinct !DILexicalBlock(scope: !462, file: !123, line: 281, column: 6)
!538 = !DILocation(line: 281, column: 9, scope: !537)
!539 = !DILocation(line: 281, column: 6, scope: !462)
!540 = !DILocation(line: 283, column: 28, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !123, line: 281, column: 16)
!542 = !DILocation(line: 283, column: 27, scope: !541)
!543 = !DILocation(line: 283, column: 18, scope: !544)
!544 = !DILexicalBlockFile(scope: !541, file: !123, discriminator: 1)
!545 = !DILocation(line: 282, column: 3, scope: !541)
!546 = !DILocation(line: 284, column: 22, scope: !541)
!547 = !DILocation(line: 284, column: 3, scope: !541)
!548 = !DILocation(line: 285, column: 3, scope: !541)
!549 = !DILocation(line: 288, column: 6, scope: !550)
!550 = distinct !DILexicalBlock(scope: !462, file: !123, line: 288, column: 6)
!551 = !DILocation(line: 288, column: 12, scope: !550)
!552 = !DILocation(line: 288, column: 22, scope: !550)
!553 = !DILocation(line: 288, column: 26, scope: !554)
!554 = !DILexicalBlockFile(scope: !550, file: !123, discriminator: 1)
!555 = !DILocation(line: 288, column: 32, scope: !554)
!556 = !DILocation(line: 288, column: 42, scope: !554)
!557 = !DILocation(line: 288, column: 46, scope: !554)
!558 = !DILocation(line: 288, column: 6, scope: !554)
!559 = !DILocation(line: 289, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !550, file: !123, line: 288, column: 54)
!561 = !DILocation(line: 290, column: 22, scope: !560)
!562 = !DILocation(line: 290, column: 3, scope: !560)
!563 = !DILocation(line: 291, column: 3, scope: !560)
!564 = !DILocation(line: 294, column: 12, scope: !462)
!565 = !DILocation(line: 294, column: 16, scope: !462)
!566 = !DILocation(line: 294, column: 36, scope: !462)
!567 = !DILocation(line: 294, column: 42, scope: !462)
!568 = !DILocation(line: 295, column: 12, scope: !462)
!569 = !DILocation(line: 295, column: 18, scope: !462)
!570 = !DILocation(line: 294, column: 7, scope: !462)
!571 = !DILocation(line: 294, column: 5, scope: !462)
!572 = !DILocation(line: 296, column: 6, scope: !573)
!573 = distinct !DILexicalBlock(scope: !462, file: !123, line: 296, column: 6)
!574 = !DILocation(line: 296, column: 9, scope: !573)
!575 = !DILocation(line: 296, column: 6, scope: !462)
!576 = !DILocation(line: 297, column: 55, scope: !577)
!577 = distinct !DILexicalBlock(scope: !573, file: !123, line: 296, column: 16)
!578 = !DILocation(line: 297, column: 54, scope: !577)
!579 = !DILocation(line: 297, column: 45, scope: !580)
!580 = !DILexicalBlockFile(scope: !577, file: !123, discriminator: 1)
!581 = !DILocation(line: 297, column: 3, scope: !582)
!582 = !DILexicalBlockFile(scope: !577, file: !123, discriminator: 2)
!583 = !DILocation(line: 298, column: 22, scope: !577)
!584 = !DILocation(line: 298, column: 3, scope: !577)
!585 = !DILocation(line: 299, column: 3, scope: !577)
!586 = !DILocation(line: 302, column: 9, scope: !462)
!587 = !DILocation(line: 302, column: 2, scope: !462)
!588 = !DILocation(line: 303, column: 1, scope: !462)
!589 = distinct !DISubprogram(name: "privsep_client_certfile", scope: !123, file: !123, line: 803, type: !590, isLocal: false, isDefinition: true, scopeLine: 804, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!590 = !DISubroutineType(types: !591)
!591 = !{!51, !51, !141}
!592 = !DILocalVariable(name: "clisock", arg: 1, scope: !589, file: !123, line: 803, type: !51)
!593 = !DILocation(line: 803, column: 29, scope: !589)
!594 = !DILocalVariable(name: "fn", arg: 2, scope: !589, file: !123, line: 803, type: !141)
!595 = !DILocation(line: 803, column: 50, scope: !589)
!596 = !DILocalVariable(name: "ans", scope: !589, file: !123, line: 805, type: !152)
!597 = !DILocation(line: 805, column: 7, scope: !589)
!598 = !DILocation(line: 806, column: 22, scope: !589)
!599 = !DILocation(line: 806, column: 15, scope: !589)
!600 = !DILocation(line: 806, column: 13, scope: !589)
!601 = !DILocation(line: 806, column: 2, scope: !602)
!602 = !DILexicalBlockFile(scope: !589, file: !123, discriminator: 1)
!603 = !DILocation(line: 806, column: 2, scope: !589)
!604 = !DILocalVariable(name: "req", scope: !589, file: !123, line: 806, type: !163)
!605 = !DILocation(line: 806, column: 7, scope: !589)
!606 = !DILocalVariable(name: "fd", scope: !589, file: !123, line: 807, type: !51)
!607 = !DILocation(line: 807, column: 6, scope: !589)
!608 = !DILocalVariable(name: "n", scope: !589, file: !123, line: 808, type: !45)
!609 = !DILocation(line: 808, column: 10, scope: !589)
!610 = !DILocation(line: 810, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !589, file: !123, line: 810, column: 6)
!612 = !DILocation(line: 810, column: 6, scope: !589)
!613 = !DILocation(line: 811, column: 34, scope: !611)
!614 = !DILocation(line: 811, column: 10, scope: !611)
!615 = !DILocation(line: 811, column: 3, scope: !611)
!616 = !DILocation(line: 813, column: 2, scope: !589)
!617 = !DILocation(line: 813, column: 9, scope: !589)
!618 = !DILocation(line: 814, column: 13, scope: !589)
!619 = !DILocation(line: 814, column: 18, scope: !589)
!620 = !DILocation(line: 814, column: 34, scope: !589)
!621 = !DILocation(line: 814, column: 2, scope: !589)
!622 = !DILocation(line: 816, column: 20, scope: !623)
!623 = distinct !DILexicalBlock(scope: !589, file: !123, line: 816, column: 6)
!624 = !DILocation(line: 816, column: 6, scope: !623)
!625 = !DILocation(line: 816, column: 51, scope: !623)
!626 = !DILocation(line: 816, column: 6, scope: !589)
!627 = !DILocation(line: 817, column: 3, scope: !628)
!628 = distinct !DILexicalBlock(scope: !623, file: !123, line: 816, column: 58)
!629 = !DILocation(line: 820, column: 25, scope: !630)
!630 = distinct !DILexicalBlock(scope: !589, file: !123, line: 820, column: 6)
!631 = !DILocation(line: 820, column: 34, scope: !630)
!632 = !DILocation(line: 820, column: 11, scope: !630)
!633 = !DILocation(line: 820, column: 9, scope: !630)
!634 = !DILocation(line: 820, column: 58, scope: !630)
!635 = !DILocation(line: 820, column: 6, scope: !589)
!636 = !DILocation(line: 821, column: 3, scope: !637)
!637 = distinct !DILexicalBlock(scope: !630, file: !123, line: 820, column: 65)
!638 = !DILocation(line: 824, column: 6, scope: !639)
!639 = distinct !DILexicalBlock(scope: !589, file: !123, line: 824, column: 6)
!640 = !DILocation(line: 824, column: 8, scope: !639)
!641 = !DILocation(line: 824, column: 6, scope: !589)
!642 = !DILocation(line: 825, column: 4, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !123, line: 824, column: 13)
!644 = !DILocation(line: 825, column: 8, scope: !643)
!645 = !DILocation(line: 826, column: 3, scope: !643)
!646 = !DILocation(line: 829, column: 10, scope: !589)
!647 = !DILocation(line: 829, column: 2, scope: !589)
!648 = !DILocation(line: 831, column: 3, scope: !649)
!649 = distinct !DILexicalBlock(scope: !589, file: !123, line: 829, column: 18)
!650 = !DILocation(line: 833, column: 4, scope: !649)
!651 = !DILocation(line: 833, column: 8, scope: !649)
!652 = !DILocation(line: 834, column: 3, scope: !649)
!653 = !DILocation(line: 836, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !649, file: !123, line: 836, column: 7)
!655 = !DILocation(line: 836, column: 9, scope: !654)
!656 = !DILocation(line: 836, column: 7, scope: !649)
!657 = !DILocation(line: 837, column: 5, scope: !658)
!658 = distinct !DILexicalBlock(scope: !654, file: !123, line: 836, column: 39)
!659 = !DILocation(line: 837, column: 9, scope: !658)
!660 = !DILocation(line: 838, column: 4, scope: !658)
!661 = !DILocation(line: 840, column: 19, scope: !649)
!662 = !DILocation(line: 840, column: 10, scope: !649)
!663 = !DILocation(line: 840, column: 4, scope: !649)
!664 = !DILocation(line: 840, column: 8, scope: !649)
!665 = !DILocation(line: 841, column: 3, scope: !649)
!666 = !DILocation(line: 841, column: 3, scope: !667)
!667 = !DILexicalBlockFile(scope: !649, file: !123, discriminator: 1)
!668 = !DILocation(line: 845, column: 4, scope: !649)
!669 = !DILocation(line: 845, column: 8, scope: !649)
!670 = !DILocation(line: 846, column: 3, scope: !649)
!671 = !DILocation(line: 849, column: 9, scope: !589)
!672 = !DILocation(line: 849, column: 2, scope: !589)
!673 = !DILocation(line: 850, column: 1, scope: !589)
!674 = distinct !DISubprogram(name: "privsep_server_certfile", scope: !123, file: !123, line: 316, type: !675, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!675 = !DISubroutineType(types: !676)
!676 = !{!51, !141}
!677 = !DILocalVariable(name: "fn", arg: 1, scope: !674, file: !123, line: 316, type: !141)
!678 = !DILocation(line: 316, column: 37, scope: !674)
!679 = !DILocalVariable(name: "fd", scope: !674, file: !123, line: 318, type: !51)
!680 = !DILocation(line: 318, column: 6, scope: !674)
!681 = !DILocation(line: 320, column: 12, scope: !674)
!682 = !DILocation(line: 320, column: 7, scope: !674)
!683 = !DILocation(line: 320, column: 5, scope: !674)
!684 = !DILocation(line: 321, column: 6, scope: !685)
!685 = distinct !DILexicalBlock(scope: !674, file: !123, line: 321, column: 6)
!686 = !DILocation(line: 321, column: 9, scope: !685)
!687 = !DILocation(line: 321, column: 15, scope: !685)
!688 = !DILocation(line: 321, column: 19, scope: !689)
!689 = !DILexicalBlockFile(scope: !685, file: !123, discriminator: 1)
!690 = !DILocation(line: 321, column: 18, scope: !689)
!691 = !DILocation(line: 321, column: 23, scope: !689)
!692 = !DILocation(line: 321, column: 6, scope: !689)
!693 = !DILocation(line: 323, column: 18, scope: !694)
!694 = distinct !DILexicalBlock(scope: !685, file: !123, line: 321, column: 34)
!695 = !DILocation(line: 323, column: 32, scope: !694)
!696 = !DILocation(line: 323, column: 31, scope: !694)
!697 = !DILocation(line: 323, column: 22, scope: !698)
!698 = !DILexicalBlockFile(scope: !694, file: !123, discriminator: 1)
!699 = !DILocation(line: 323, column: 40, scope: !700)
!700 = !DILexicalBlockFile(scope: !694, file: !123, discriminator: 2)
!701 = !DILocation(line: 323, column: 39, scope: !694)
!702 = !DILocation(line: 322, column: 3, scope: !694)
!703 = !DILocation(line: 324, column: 3, scope: !694)
!704 = !DILocation(line: 326, column: 9, scope: !674)
!705 = !DILocation(line: 326, column: 2, scope: !674)
!706 = !DILocation(line: 327, column: 1, scope: !674)
!707 = distinct !DISubprogram(name: "privsep_client_close", scope: !123, file: !123, line: 853, type: !105, isLocal: false, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!708 = !DILocalVariable(name: "clisock", arg: 1, scope: !707, file: !123, line: 853, type: !51)
!709 = !DILocation(line: 853, column: 26, scope: !707)
!710 = !DILocalVariable(name: "req", scope: !707, file: !123, line: 855, type: !711)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8, align: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 1)
!714 = !DILocation(line: 855, column: 7, scope: !707)
!715 = !DILocation(line: 857, column: 2, scope: !707)
!716 = !DILocation(line: 857, column: 9, scope: !707)
!717 = !DILocation(line: 859, column: 20, scope: !718)
!718 = distinct !DILexicalBlock(scope: !707, file: !123, line: 859, column: 6)
!719 = !DILocation(line: 859, column: 29, scope: !718)
!720 = !DILocation(line: 859, column: 6, scope: !718)
!721 = !DILocation(line: 859, column: 51, scope: !718)
!722 = !DILocation(line: 859, column: 6, scope: !707)
!723 = !DILocation(line: 860, column: 9, scope: !724)
!724 = distinct !DILexicalBlock(scope: !718, file: !123, line: 859, column: 58)
!725 = !DILocation(line: 860, column: 3, scope: !724)
!726 = !DILocation(line: 861, column: 3, scope: !724)
!727 = !DILocation(line: 864, column: 8, scope: !707)
!728 = !DILocation(line: 864, column: 2, scope: !707)
!729 = !DILocation(line: 865, column: 2, scope: !707)
!730 = !DILocation(line: 866, column: 1, scope: !707)
!731 = distinct !DISubprogram(name: "privsep_fork", scope: !123, file: !123, line: 876, type: !732, isLocal: false, isDefinition: true, scopeLine: 877, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !143)
!732 = !DISubroutineType(types: !733)
!733 = !{!51, !734, !50, !896}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "opts_t", file: !56, line: 126, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opts", file: !56, line: 56, size: 1920, align: 64, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !736, file: !56, line: 57, baseType: !60, size: 1, align: 32, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !736, file: !56, line: 58, baseType: !60, size: 1, align: 32, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sslcomp", scope: !736, file: !56, line: 59, baseType: !60, size: 1, align: 32, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "no_ssl3", scope: !736, file: !56, line: 64, baseType: !60, size: 1, align: 32, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls10", scope: !736, file: !56, line: 67, baseType: !60, size: 1, align: 32, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls11", scope: !736, file: !56, line: 70, baseType: !60, size: 1, align: 32, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls12", scope: !736, file: !56, line: 73, baseType: !60, size: 1, align: 32, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "passthrough", scope: !736, file: !56, line: 75, baseType: !60, size: 1, align: 32, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "deny_ocsp", scope: !736, file: !56, line: 76, baseType: !60, size: 1, align: 32, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_isdir", scope: !736, file: !56, line: 77, baseType: !60, size: 1, align: 32, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_isspec", scope: !736, file: !56, line: 78, baseType: !60, size: 1, align: 32, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_isdir", scope: !736, file: !56, line: 79, baseType: !60, size: 1, align: 32, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_isspec", scope: !736, file: !56, line: 80, baseType: !60, size: 1, align: 32, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "certgen_writeall", scope: !736, file: !56, line: 84, baseType: !60, size: 1, align: 32, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "openssl_engine", scope: !736, file: !56, line: 86, baseType: !86, size: 64, align: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ciphers", scope: !736, file: !56, line: 88, baseType: !86, size: 64, align: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "certgendir", scope: !736, file: !56, line: 89, baseType: !86, size: 64, align: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tgcrtdir", scope: !736, file: !56, line: 90, baseType: !86, size: 64, align: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dropuser", scope: !736, file: !56, line: 91, baseType: !86, size: 64, align: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dropgroup", scope: !736, file: !56, line: 92, baseType: !86, size: 64, align: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "jaildir", scope: !736, file: !56, line: 93, baseType: !86, size: 64, align: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !736, file: !56, line: 94, baseType: !86, size: 64, align: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "conffile", scope: !736, file: !56, line: 95, baseType: !86, size: 64, align: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "connectlog", scope: !736, file: !56, line: 96, baseType: !86, size: 64, align: 64, offset: 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog", scope: !736, file: !56, line: 97, baseType: !86, size: 64, align: 64, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_basedir", scope: !736, file: !56, line: 98, baseType: !86, size: 64, align: 64, offset: 768)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "masterkeylog", scope: !736, file: !56, line: 99, baseType: !86, size: 64, align: 64, offset: 832)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog", scope: !736, file: !56, line: 100, baseType: !86, size: 64, align: 64, offset: 896)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_basedir", scope: !736, file: !56, line: 101, baseType: !86, size: 64, align: 64, offset: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mirrorif", scope: !736, file: !56, line: 103, baseType: !86, size: 64, align: 64, offset: 1024)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mirrortarget", scope: !736, file: !56, line: 104, baseType: !86, size: 64, align: 64, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sslmethod", scope: !736, file: !56, line: 106, baseType: !770, size: 64, align: 64, offset: 1152)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64, align: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !776, line: 374, baseType: !777)
!776 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !776, line: 438, size: 1856, align: 64, elements: !778)
!778 = !{!779, !780, !2379, !2383, !2384, !2385, !2386, !2390, !2391, !2395, !2396, !2397, !2398, !2402, !2406, !2410, !2411, !2415, !2419, !2423, !2427, !2431, !2435, !2439, !2445, !2446, !2449, !2450, !2457}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !777, file: !776, line: 439, baseType: !51, size: 32, align: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !777, file: !776, line: 440, baseType: !781, size: 64, align: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!51, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !786, line: 178, baseType: !787)
!786 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !776, line: 1422, size: 6592, align: 64, elements: !788)
!788 = !{!789, !790, !791, !792, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !900, !901, !902, !903, !906, !907, !970, !1445, !1877, !1878, !1882, !1883, !1884, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1916, !1917, !1918, !1919, !1926, !1927, !2096, !2100, !2101, !2102, !2106, !2110, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2319, !2320, !2321, !2322, !2323, !2324, !2327, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2347, !2352, !2353, !2360, !2361, !2362, !2363, !2364, !2365, !2372, !2373, !2374, !2375, !2376, !2377, !2378}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !787, file: !776, line: 1427, baseType: !51, size: 32, align: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !776, line: 1429, baseType: !51, size: 32, align: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !787, file: !776, line: 1431, baseType: !773, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rbio", scope: !787, file: !776, line: 1438, baseType: !793, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !795, line: 238, baseType: !796)
!795 = !DIFile(filename: "/usr/include/openssl/bio.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !795, line: 325, size: 896, align: 64, elements: !797)
!797 = !{!798, !836, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !796, file: !795, line: 326, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !795, line: 323, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !795, line: 312, size: 640, align: 64, elements: !802)
!802 = !{!803, !804, !805, !809, !813, !817, !818, !822, !826, !827}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !801, file: !795, line: 313, baseType: !51, size: 32, align: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !795, line: 314, baseType: !141, size: 64, align: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !801, file: !795, line: 315, baseType: !806, size: 64, align: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, align: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!51, !793, !141, !51}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !801, file: !795, line: 316, baseType: !810, size: 64, align: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!51, !793, !86, !51}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !801, file: !795, line: 317, baseType: !814, size: 64, align: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64, align: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!51, !793, !141}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !801, file: !795, line: 318, baseType: !810, size: 64, align: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !801, file: !795, line: 319, baseType: !819, size: 64, align: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!49, !793, !51, !49, !116}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !801, file: !795, line: 320, baseType: !823, size: 64, align: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!51, !793}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !801, file: !795, line: 321, baseType: !823, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !801, file: !795, line: 322, baseType: !828, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!49, !793, !51, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_info_cb", file: !795, line: 309, baseType: !833)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !835, !51, !141, !51, !49, !49}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !796, file: !795, line: 328, baseType: !837, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!49, !835, !51, !141, !51, !49, !49}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !796, file: !795, line: 329, baseType: !86, size: 64, align: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !796, file: !795, line: 330, baseType: !51, size: 32, align: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !796, file: !795, line: 331, baseType: !51, size: 32, align: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !795, line: 332, baseType: !51, size: 32, align: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "retry_reason", scope: !796, file: !795, line: 333, baseType: !51, size: 32, align: 32, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !796, file: !795, line: 334, baseType: !51, size: 32, align: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !796, file: !795, line: 335, baseType: !116, size: 64, align: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "next_bio", scope: !796, file: !795, line: 336, baseType: !835, size: 64, align: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bio", scope: !796, file: !795, line: 337, baseType: !835, size: 64, align: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !796, file: !795, line: 338, baseType: !51, size: 32, align: 32, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "num_read", scope: !796, file: !795, line: 339, baseType: !78, size: 64, align: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "num_write", scope: !796, file: !795, line: 340, baseType: !78, size: 64, align: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !796, file: !795, line: 341, baseType: !853, size: 128, align: 64, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !786, line: 195, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !855, line: 292, size: 128, align: 64, elements: !856)
!855 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!856 = !{!857, !877}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !854, file: !855, line: 293, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !855, line: 297, size: 256, align: 64, elements: !860)
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !859, file: !855, line: 297, baseType: !862, size: 256, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !863, line: 72, baseType: !864)
!863 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !863, line: 66, size: 256, align: 64, elements: !865)
!865 = !{!866, !867, !869, !870, !871}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !864, file: !863, line: 67, baseType: !51, size: 32, align: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !864, file: !863, line: 68, baseType: !868, size: 64, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !864, file: !863, line: 69, baseType: !51, size: 32, align: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !864, file: !863, line: 70, baseType: !51, size: 32, align: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !864, file: !863, line: 71, baseType: !872, size: 64, align: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!51, !875, !875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !854, file: !855, line: 295, baseType: !51, size: 32, align: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "wbio", scope: !787, file: !776, line: 1440, baseType: !793, size: 64, align: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bbio", scope: !787, file: !776, line: 1442, baseType: !793, size: 64, align: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rwstate", scope: !787, file: !776, line: 1455, baseType: !51, size: 32, align: 32, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "in_handshake", scope: !787, file: !776, line: 1457, baseType: !51, size: 32, align: 32, offset: 352)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_func", scope: !787, file: !776, line: 1458, baseType: !781, size: 64, align: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !787, file: !776, line: 1467, baseType: !51, size: 32, align: 32, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "new_session", scope: !787, file: !776, line: 1474, baseType: !51, size: 32, align: 32, offset: 480)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "quiet_shutdown", scope: !787, file: !776, line: 1476, baseType: !51, size: 32, align: 32, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !787, file: !776, line: 1478, baseType: !51, size: 32, align: 32, offset: 544)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !787, file: !776, line: 1480, baseType: !51, size: 32, align: 32, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rstate", scope: !787, file: !776, line: 1482, baseType: !51, size: 32, align: 32, offset: 608)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_buf", scope: !787, file: !776, line: 1483, baseType: !890, size: 64, align: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !786, line: 127, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !893, line: 77, size: 192, align: 64, elements: !894)
!893 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!894 = !{!895, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !892, file: !893, line: 78, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !897, line: 216, baseType: !78)
!897 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !892, file: !893, line: 79, baseType: !86, size: 64, align: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !892, file: !893, line: 80, baseType: !896, size: 64, align: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "init_msg", scope: !787, file: !776, line: 1484, baseType: !116, size: 64, align: 64, offset: 704)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "init_num", scope: !787, file: !776, line: 1486, baseType: !51, size: 32, align: 32, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "init_off", scope: !787, file: !776, line: 1487, baseType: !51, size: 32, align: 32, offset: 800)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !787, file: !776, line: 1489, baseType: !904, size: 64, align: 64, offset: 832)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !787, file: !776, line: 1490, baseType: !60, size: 32, align: 32, offset: 896)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !787, file: !776, line: 1491, baseType: !908, size: 64, align: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl2_state_st", file: !910, line: 163, size: 2752, align: 64, elements: !911)
!910 = !DIFile(filename: "/usr/include/openssl/ssl2.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !944, !945, !949, !950, !954, !955, !956}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "three_byte_header", scope: !909, file: !910, line: 164, baseType: !51, size: 32, align: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "clear_text", scope: !909, file: !910, line: 165, baseType: !51, size: 32, align: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !909, file: !910, line: 166, baseType: !51, size: 32, align: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ssl2_rollback", scope: !909, file: !910, line: 167, baseType: !51, size: 32, align: 32, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !909, file: !910, line: 171, baseType: !60, size: 32, align: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !909, file: !910, line: 172, baseType: !51, size: 32, align: 32, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !909, file: !910, line: 173, baseType: !919, size: 64, align: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_off", scope: !909, file: !910, line: 174, baseType: !51, size: 32, align: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_len", scope: !909, file: !910, line: 175, baseType: !51, size: 32, align: 32, offset: 288)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !909, file: !910, line: 176, baseType: !51, size: 32, align: 32, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_left", scope: !909, file: !910, line: 178, baseType: !51, size: 32, align: 32, offset: 352)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_offs", scope: !909, file: !910, line: 179, baseType: !51, size: 32, align: 32, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !909, file: !910, line: 180, baseType: !904, size: 64, align: 64, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !909, file: !910, line: 181, baseType: !904, size: 64, align: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !909, file: !910, line: 182, baseType: !904, size: 64, align: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !909, file: !910, line: 184, baseType: !60, size: 32, align: 32, offset: 640)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rlength", scope: !909, file: !910, line: 185, baseType: !60, size: 32, align: 32, offset: 672)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data_length", scope: !909, file: !910, line: 186, baseType: !51, size: 32, align: 32, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "wlength", scope: !909, file: !910, line: 187, baseType: !60, size: 32, align: 32, offset: 736)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data_length", scope: !909, file: !910, line: 188, baseType: !51, size: 32, align: 32, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data", scope: !909, file: !910, line: 189, baseType: !904, size: 64, align: 64, offset: 832)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data", scope: !909, file: !910, line: 190, baseType: !904, size: 64, align: 64, offset: 896)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mac_data", scope: !909, file: !910, line: 191, baseType: !904, size: 64, align: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "read_key", scope: !909, file: !910, line: 192, baseType: !904, size: 64, align: 64, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "write_key", scope: !909, file: !910, line: 193, baseType: !904, size: 64, align: 64, offset: 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "challenge_length", scope: !909, file: !910, line: 195, baseType: !60, size: 32, align: 32, offset: 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "challenge", scope: !909, file: !910, line: 196, baseType: !941, size: 256, align: 8, offset: 1184)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 256, align: 8, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !909, file: !910, line: 197, baseType: !60, size: 32, align: 32, offset: 1440)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id", scope: !909, file: !910, line: 198, baseType: !946, size: 128, align: 8, offset: 1472)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 128, align: 8, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 16)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "key_material_length", scope: !909, file: !910, line: 199, baseType: !60, size: 32, align: 32, offset: 1600)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "key_material", scope: !909, file: !910, line: 200, baseType: !951, size: 384, align: 8, offset: 1632)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 384, align: 8, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 48)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !909, file: !910, line: 201, baseType: !78, size: 64, align: 64, offset: 2048)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !909, file: !910, line: 202, baseType: !78, size: 64, align: 64, offset: 2112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !909, file: !910, line: 215, baseType: !957, size: 576, align: 32, offset: 2176)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !909, file: !910, line: 203, size: 576, align: 32, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !957, file: !910, line: 204, baseType: !60, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !957, file: !910, line: 205, baseType: !60, size: 32, align: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cert_length", scope: !957, file: !910, line: 206, baseType: !60, size: 32, align: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "csl", scope: !957, file: !910, line: 207, baseType: !60, size: 32, align: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !957, file: !910, line: 208, baseType: !60, size: 32, align: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !957, file: !910, line: 209, baseType: !60, size: 32, align: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ccl", scope: !957, file: !910, line: 210, baseType: !941, size: 256, align: 8, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_spec_length", scope: !957, file: !910, line: 211, baseType: !60, size: 32, align: 32, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_length", scope: !957, file: !910, line: 212, baseType: !60, size: 32, align: 32, offset: 480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "clen", scope: !957, file: !910, line: 213, baseType: !60, size: 32, align: 32, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rlen", scope: !957, file: !910, line: 214, baseType: !60, size: 32, align: 32, offset: 544)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !787, file: !776, line: 1492, baseType: !971, size: 64, align: 64, offset: 1024)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !973, line: 481, size: 9728, align: 64, elements: !974)
!973 = !DIFile(filename: "/usr/include/openssl/ssl3.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!974 = !{!975, !976, !977, !981, !982, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1002, !1003, !1015, !1016, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !973, line: 482, baseType: !49, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "delay_buf_pop_ret", scope: !972, file: !973, line: 483, baseType: !51, size: 32, align: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !972, file: !973, line: 484, baseType: !978, size: 64, align: 8, offset: 96)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 64, align: 8, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 8)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret_size", scope: !972, file: !973, line: 485, baseType: !51, size: 32, align: 32, offset: 160)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret", scope: !972, file: !973, line: 486, baseType: !983, size: 512, align: 8, offset: 192)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 512, align: 8, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !972, file: !973, line: 487, baseType: !978, size: 64, align: 8, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret_size", scope: !972, file: !973, line: 488, baseType: !51, size: 32, align: 32, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret", scope: !972, file: !973, line: 489, baseType: !983, size: 512, align: 8, offset: 800)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "server_random", scope: !972, file: !973, line: 490, baseType: !941, size: 256, align: 8, offset: 1312)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "client_random", scope: !972, file: !973, line: 491, baseType: !941, size: 256, align: 8, offset: 1568)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "need_empty_fragments", scope: !972, file: !973, line: 493, baseType: !51, size: 32, align: 32, offset: 1824)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "empty_fragment_done", scope: !972, file: !973, line: 494, baseType: !51, size: 32, align: 32, offset: 1856)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "init_extra", scope: !972, file: !973, line: 496, baseType: !51, size: 32, align: 32, offset: 1888)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !972, file: !973, line: 497, baseType: !995, size: 192, align: 64, offset: 1920)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_BUFFER", file: !973, line: 447, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_buffer_st", file: !973, line: 438, size: 192, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !996, file: !973, line: 440, baseType: !904, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !996, file: !973, line: 442, baseType: !896, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !996, file: !973, line: 444, baseType: !51, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !996, file: !973, line: 446, baseType: !51, size: 32, align: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !972, file: !973, line: 498, baseType: !995, size: 192, align: 64, offset: 2112)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rrec", scope: !972, file: !973, line: 499, baseType: !1004, size: 448, align: 64, offset: 2304)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !973, line: 436, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !973, line: 403, size: 448, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1005, file: !973, line: 407, baseType: !51, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1005, file: !973, line: 411, baseType: !60, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1005, file: !973, line: 415, baseType: !60, size: 32, align: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1005, file: !973, line: 419, baseType: !904, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1005, file: !973, line: 423, baseType: !904, size: 64, align: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1005, file: !973, line: 427, baseType: !904, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !1005, file: !973, line: 431, baseType: !78, size: 64, align: 64, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !1005, file: !973, line: 435, baseType: !978, size: 64, align: 8, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "wrec", scope: !972, file: !973, line: 500, baseType: !1004, size: 448, align: 64, offset: 2752)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment", scope: !972, file: !973, line: 505, baseType: !1017, size: 16, align: 8, offset: 3200)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 16, align: 8, elements: !1018)
!1018 = !{!1019}
!1019 = !DISubrange(count: 2)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment_len", scope: !972, file: !973, line: 506, baseType: !60, size: 32, align: 32, offset: 3232)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment", scope: !972, file: !973, line: 507, baseType: !1022, size: 32, align: 8, offset: 3264)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 32, align: 8, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 4)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment_len", scope: !972, file: !973, line: 508, baseType: !60, size: 32, align: 32, offset: 3296)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !972, file: !973, line: 510, baseType: !60, size: 32, align: 32, offset: 3328)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !972, file: !973, line: 511, baseType: !51, size: 32, align: 32, offset: 3360)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_type", scope: !972, file: !973, line: 512, baseType: !51, size: 32, align: 32, offset: 3392)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !972, file: !973, line: 513, baseType: !51, size: 32, align: 32, offset: 3424)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !972, file: !973, line: 514, baseType: !919, size: 64, align: 64, offset: 3456)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer", scope: !972, file: !973, line: 516, baseType: !793, size: 64, align: 64, offset: 3520)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_dgst", scope: !972, file: !973, line: 521, baseType: !1033, size: 64, align: 64, offset: 3584)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !786, line: 132, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_ctx_st", file: !1037, line: 268, size: 384, align: 64, elements: !1038)
!1037 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1038 = !{!1039, !1085, !1089, !1090, !1091, !1095}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1036, file: !1037, line: 269, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !786, line: 131, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_st", file: !1037, line: 160, size: 960, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1053, !1057, !1061, !1067, !1068, !1073, !1077, !1079, !1080, !1081}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1043, file: !1037, line: 161, baseType: !51, size: 32, align: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_type", scope: !1043, file: !1037, line: 162, baseType: !51, size: 32, align: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !1043, file: !1037, line: 163, baseType: !51, size: 32, align: 32, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1043, file: !1037, line: 164, baseType: !78, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1043, file: !1037, line: 165, baseType: !1050, size: 64, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!51, !1034}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1043, file: !1037, line: 166, baseType: !1054, size: 64, align: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!51, !1034, !875, !896}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1043, file: !1037, line: 167, baseType: !1058, size: 64, align: 64, offset: 320)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!51, !1034, !904}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !1043, file: !1037, line: 168, baseType: !1062, size: 64, align: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!51, !1034, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1043, file: !1037, line: 169, baseType: !1050, size: 64, align: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1043, file: !1037, line: 171, baseType: !1069, size: 64, align: 64, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!51, !51, !919, !60, !904, !1072, !116}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !1043, file: !1037, line: 173, baseType: !1074, size: 64, align: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!51, !51, !919, !60, !919, !60, !116}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "required_pkey_type", scope: !1043, file: !1037, line: 176, baseType: !1078, size: 160, align: 32, offset: 640)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, align: 32, elements: !153)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !1043, file: !1037, line: 177, baseType: !51, size: 32, align: 32, offset: 800)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !1043, file: !1037, line: 178, baseType: !51, size: 32, align: 32, offset: 832)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "md_ctrl", scope: !1043, file: !1037, line: 180, baseType: !1082, size: 64, align: 64, offset: 896)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!51, !1034, !51, !51, !116}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !1036, file: !1037, line: 270, baseType: !1086, size: 64, align: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !786, line: 177, baseType: !1088)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !786, line: 177, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !1037, line: 272, baseType: !78, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "md_data", scope: !1036, file: !1037, line: 273, baseType: !116, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !1036, file: !1037, line: 275, baseType: !1092, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !786, line: 138, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !786, line: 138, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1036, file: !1037, line: 277, baseType: !1054, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "change_cipher_spec", scope: !972, file: !973, line: 527, baseType: !51, size: 32, align: 32, offset: 3648)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "warn_alert", scope: !972, file: !973, line: 528, baseType: !51, size: 32, align: 32, offset: 3680)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_alert", scope: !972, file: !973, line: 529, baseType: !51, size: 32, align: 32, offset: 3712)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alert_dispatch", scope: !972, file: !973, line: 534, baseType: !51, size: 32, align: 32, offset: 3744)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "send_alert", scope: !972, file: !973, line: 535, baseType: !1017, size: 16, align: 8, offset: 3776)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate", scope: !972, file: !973, line: 540, baseType: !51, size: 32, align: 32, offset: 3808)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "total_renegotiations", scope: !972, file: !973, line: 541, baseType: !51, size: 32, align: 32, offset: 3840)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "num_renegotiations", scope: !972, file: !973, line: 542, baseType: !51, size: 32, align: 32, offset: 3872)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "in_read_app_data", scope: !972, file: !973, line: 543, baseType: !51, size: 32, align: 32, offset: 3904)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input", scope: !972, file: !973, line: 549, baseType: !116, size: 64, align: 64, offset: 3968)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input_len", scope: !972, file: !973, line: 550, baseType: !896, size: 64, align: 64, offset: 4032)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input", scope: !972, file: !973, line: 551, baseType: !116, size: 64, align: 64, offset: 4096)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input_len", scope: !972, file: !973, line: 552, baseType: !896, size: 64, align: 64, offset: 4160)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !972, file: !973, line: 592, baseType: !1110, size: 4224, align: 64, offset: 4224)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !972, file: !973, line: 553, size: 4224, align: 64, elements: !1111)
!1111 = !{!1112, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1140, !1236, !1241, !1242, !1243, !1244, !1245, !1246, !1252, !1253, !1254, !1255, !1388, !1389, !1390, !1391, !1435}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "cert_verify_md", scope: !1110, file: !973, line: 555, baseType: !1113, size: 1024, align: 8)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 1024, align: 8, elements: !1114)
!1114 = !{!1115}
!1115 = !DISubrange(count: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md", scope: !1110, file: !973, line: 557, baseType: !1113, size: 1024, align: 8, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md_len", scope: !1110, file: !973, line: 558, baseType: !51, size: 32, align: 32, offset: 2048)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md", scope: !1110, file: !973, line: 559, baseType: !1113, size: 1024, align: 8, offset: 2080)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md_len", scope: !1110, file: !973, line: 560, baseType: !51, size: 32, align: 32, offset: 3104)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !1110, file: !973, line: 561, baseType: !78, size: 64, align: 64, offset: 3136)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !1110, file: !973, line: 562, baseType: !51, size: 32, align: 32, offset: 3200)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "new_cipher", scope: !1110, file: !973, line: 564, baseType: !1123, size: 64, align: 64, offset: 3264)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CIPHER", file: !776, line: 375, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_cipher_st", file: !776, line: 418, size: 704, align: 64, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1126, file: !776, line: 419, baseType: !51, size: 32, align: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1126, file: !776, line: 420, baseType: !141, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1126, file: !776, line: 421, baseType: !78, size: 64, align: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mkey", scope: !1126, file: !776, line: 426, baseType: !78, size: 64, align: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_auth", scope: !1126, file: !776, line: 427, baseType: !78, size: 64, align: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_enc", scope: !1126, file: !776, line: 428, baseType: !78, size: 64, align: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mac", scope: !1126, file: !776, line: 429, baseType: !78, size: 64, align: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_ssl", scope: !1126, file: !776, line: 430, baseType: !78, size: 64, align: 64, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "algo_strength", scope: !1126, file: !776, line: 431, baseType: !78, size: 64, align: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm2", scope: !1126, file: !776, line: 432, baseType: !78, size: 64, align: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "strength_bits", scope: !1126, file: !776, line: 433, baseType: !51, size: 32, align: 32, offset: 640)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alg_bits", scope: !1126, file: !776, line: 434, baseType: !51, size: 32, align: 32, offset: 672)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !1110, file: !973, line: 566, baseType: !1141, size: 64, align: 64, offset: 3328)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !786, line: 140, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !1144, line: 135, size: 1152, align: 64, elements: !1145)
!1144 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1145 = !{!1146, !1147, !1148, !1160, !1161, !1162, !1163, !1164, !1165, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1235}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1143, file: !1144, line: 140, baseType: !51, size: 32, align: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1143, file: !1144, line: 141, baseType: !51, size: 32, align: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1143, file: !1144, line: 142, baseType: !1149, size: 64, align: 64, offset: 64)
