; ModuleID = './line21-cache.o.i'
source_filename = "./line21-cache.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cache = type { %union.pthread_mutex_t, i32 ()*, i32 ()*, i32 (i32)*, void (i32)*, i32 (i8*)*, i32 (i8*, i32*)*, void (i8*)*, void (i8*)*, i8* (i32)*, i8* (i32)*, void (i32, i8*)*, i8* (i8*, i32)*, void ()* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_mutexattr_t = type { i32 }

; Function Attrs: nounwind uwtable
define noalias %struct.cache* @cache_new(void (%struct.cache*)*) #0 !dbg !8 {
  %2 = alloca %struct.cache*, align 8
  %3 = alloca void (%struct.cache*)*, align 8
  %4 = alloca %struct.cache*, align 8
  store void (%struct.cache*)* %0, void (%struct.cache*)** %3, align 8
  call void @llvm.dbg.declare(metadata void (%struct.cache*)** %3, metadata !120, metadata !121), !dbg !122
  call void @llvm.dbg.declare(metadata %struct.cache** %4, metadata !123, metadata !121), !dbg !124
  %5 = call noalias i8* @malloc(i64 144) #3, !dbg !125
  %6 = bitcast i8* %5 to %struct.cache*, !dbg !125
  store %struct.cache* %6, %struct.cache** %4, align 8, !dbg !127
  %7 = icmp ne %struct.cache* %6, null, !dbg !127
  br i1 %7, label %9, label %8, !dbg !128


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line21-cache.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!8 = distinct !DISubprogram(name: "cache_new", scope: !9, file: !9, line: 44, type: !10, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "cache.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !115}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !14, line: 70, baseType: !15)
!14 = !DIFile(filename: "cache.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache", file: !14, line: 54, size: 1152, align: 64, elements: !16)
!16 = !{!17, !49, !55, !57, !62, !67, !73, !79, !84, !90, !95, !100, !105, !110}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !15, file: !14, line: 55, baseType: !18, size: 320, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !19, line: 128, baseType: !20)
!19 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !19, line: 90, size: 320, align: 64, elements: !21)
!21 = !{!22, !42, !47}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !20, file: !19, line: 125, baseType: !23, size: 320, align: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !19, line: 92, size: 320, align: 64, elements: !24)
!24 = !{!25, !27, !29, !30, !31, !32, !34, !35}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !23, file: !19, line: 94, baseType: !26, size: 32, align: 32)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !23, file: !19, line: 95, baseType: !28, size: 32, align: 32, offset: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !23, file: !19, line: 96, baseType: !26, size: 32, align: 32, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !23, file: !19, line: 98, baseType: !28, size: 32, align: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !23, file: !19, line: 102, baseType: !26, size: 32, align: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !23, file: !19, line: 104, baseType: !33, size: 16, align: 16, offset: 160)
!33 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !23, file: !19, line: 105, baseType: !33, size: 16, align: 16, offset: 176)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !23, file: !19, line: 106, baseType: !36, size: 128, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !19, line: 79, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !19, line: 75, size: 128, align: 64, elements: !38)
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !37, file: !19, line: 77, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !37, file: !19, line: 78, baseType: !40, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !20, file: !19, line: 126, baseType: !43, size: 320, align: 8)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 320, align: 8, elements: !45)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubrange(count: 40)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !20, file: !19, line: 127, baseType: !48, size: 64, align: 64)
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "begin_cb", scope: !15, file: !14, line: 57, baseType: !50, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_begin_cb_t", file: !14, line: 40, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_iter_t", file: !14, line: 38, baseType: !28)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "end_cb", scope: !15, file: !14, line: 58, baseType: !56, size: 64, align: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_end_cb_t", file: !14, line: 41, baseType: !51)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "exist_cb", scope: !15, file: !14, line: 59, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_exist_cb_t", file: !14, line: 42, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!26, !54}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "del_cb", scope: !15, file: !14, line: 60, baseType: !63, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_del_cb_t", file: !14, line: 43, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !54}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "get_cb", scope: !15, file: !14, line: 61, baseType: !68, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_cb_t", file: !14, line: 44, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!54, !72}
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_key_t", file: !14, line: 37, baseType: !4)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "put_cb", scope: !15, file: !14, line: 62, baseType: !74, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_put_cb_t", file: !14, line: 45, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!54, !72, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "free_key_cb", scope: !15, file: !14, line: 63, baseType: !80, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_free_key_cb_t", file: !14, line: 46, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !72}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "free_val_cb", scope: !15, file: !14, line: 64, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_free_val_cb_t", file: !14, line: 47, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_val_t", file: !14, line: 36, baseType: !4)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "get_key_cb", scope: !15, file: !14, line: 65, baseType: !91, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_key_cb_t", file: !14, line: 48, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!72, !54}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "get_val_cb", scope: !15, file: !14, line: 66, baseType: !96, size: 64, align: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_val_cb_t", file: !14, line: 49, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!89, !54}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "set_val_cb", scope: !15, file: !14, line: 67, baseType: !101, size: 64, align: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_set_val_cb_t", file: !14, line: 50, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !54, !89}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "unpackverify_val_cb", scope: !15, file: !14, line: 68, baseType: !106, size: 64, align: 64, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_unpackverify_val_cb_t", file: !14, line: 51, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!89, !89, !26}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fini_cb", scope: !15, file: !14, line: 69, baseType: !111, size: 64, align: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_fini_cb_t", file: !14, line: 52, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_init_cb_t", file: !14, line: 72, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!120 = !DILocalVariable(name: "init_cb", arg: 1, scope: !8, file: !9, line: 44, type: !115)
!121 = !DIExpression()
!122 = !DILocation(line: 44, column: 27, scope: !8)
!123 = !DILocalVariable(name: "cache", scope: !8, file: !9, line: 46, type: !12)
!124 = !DILocation(line: 46, column: 11, scope: !8)
!125 = !DILocation(line: 48, column: 16, scope: !126)
!126 = distinct !DILexicalBlock(scope: !8, file: !9, line: 48, column: 6)
!127 = !DILocation(line: 48, column: 14, scope: !126)
!128 = !DILocation(line: 48, column: 6, scope: !8)
!129 = !DILocation(line: 49, column: 3, scope: !126)
!130 = !DILocation(line: 51, column: 26, scope: !131)
!131 = distinct !DILexicalBlock(scope: !8, file: !9, line: 51, column: 6)
!132 = !DILocation(line: 51, column: 33, scope: !131)
!133 = !DILocation(line: 51, column: 6, scope: !131)
!134 = !DILocation(line: 51, column: 6, scope: !8)
!135 = !DILocation(line: 52, column: 8, scope: !136)
!136 = distinct !DILexicalBlock(scope: !131, file: !9, line: 51, column: 46)
!137 = !DILocation(line: 52, column: 3, scope: !136)
!138 = !DILocation(line: 53, column: 3, scope: !136)
!139 = !DILocation(line: 56, column: 2, scope: !8)
!140 = !DILocation(line: 56, column: 10, scope: !8)
!141 = !DILocation(line: 57, column: 9, scope: !8)
!142 = !DILocation(line: 57, column: 2, scope: !8)
!143 = !DILocation(line: 58, column: 1, scope: !8)
!144 = distinct !DISubprogram(name: "cache_reinit", scope: !9, file: !9, line: 64, type: !145, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!145 = !DISubroutineType(types: !146)
!146 = !{!26, !12}
!147 = !DILocalVariable(name: "cache", arg: 1, scope: !144, file: !9, line: 64, type: !12)
!148 = !DILocation(line: 64, column: 23, scope: !144)
!149 = !DILocation(line: 66, column: 29, scope: !144)
!150 = !DILocation(line: 66, column: 36, scope: !144)
!151 = !DILocation(line: 66, column: 9, scope: !144)
!152 = !DILocation(line: 66, column: 2, scope: !144)
!153 = distinct !DISubprogram(name: "cache_free", scope: !9, file: !9, line: 74, type: !154, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !12}
!156 = !DILocalVariable(name: "cache", arg: 1, scope: !153, file: !9, line: 74, type: !12)
!157 = !DILocation(line: 74, column: 21, scope: !153)
!158 = !DILocalVariable(name: "it", scope: !153, file: !9, line: 76, type: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "khiter_t", file: !160, line: 163, baseType: !161)
!160 = !DIFile(filename: "khash.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint_t", file: !160, line: 162, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "khint32_t", file: !160, line: 135, baseType: !28)
!163 = !DILocation(line: 76, column: 11, scope: !153)
!164 = !DILocation(line: 78, column: 12, scope: !165)
!165 = distinct !DILexicalBlock(scope: !153, file: !9, line: 78, column: 2)
!166 = !DILocation(line: 78, column: 19, scope: !165)
!167 = !DILocation(line: 78, column: 10, scope: !165)
!168 = !DILocation(line: 78, column: 7, scope: !165)
!169 = !DILocation(line: 78, column: 31, scope: !170)
