; ModuleID = './line1-nat.o.i'
source_filename = "./line1-nat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.engine = type { i8*, i8, i32 ()*, i32 ()*, void ()*, i32 (%struct.sockaddr*, i32*, i32, %struct.sockaddr*, i32)*, i32 (i32)* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%union.__SOCKADDR_ARG = type { %struct.sockaddr* }

@.str = private unnamed_addr constant [10 x i8] c"netfilter\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"tproxy\00", align 1
@engines = global [3 x %struct.engine] [%struct.engine { i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str, i32 0, i32 0), i8 1, i32 ()* null, i32 ()* null, void ()* null, i32 (%struct.sockaddr*, i32*, i32, %struct.sockaddr*, i32)* @nat_netfilter_lookup_cb, i32 (i32)* null }, %struct.engine { i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str.1, i32 0, i32 0), i8 1, i32 ()* null, i32 ()* null, void ()* null, i32 (%struct.sockaddr*, i32*, i32, %struct.sockaddr*, i32)* @nat_getsockname_lookup_cb, i32 (i32)* @nat_iptransparent_socket_cb }, %struct.engine zeroinitializer], align 16
@stdout = external global %struct._IO_FILE*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !5)
!1 = !DIFile(filename: "line1-nat.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6}
!6 = distinct !DIGlobalVariable(name: "engines", scope: !0, file: !7, line: 431, type: !8, isLocal: false, isDefinition: true, variable: [3 x %struct.engine]* @engines)
!7 = !DIFile(filename: "nat.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1344, align: 64, elements: !57)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "engine", file: !7, line: 420, size: 448, align: 64, elements: !10)
!10 = !{!11, !15, !17, !18, !24, !25, !30, !52}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !7, line: 421, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6", scope: !9, file: !7, line: 422, baseType: !16, size: 1, align: 32, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!16 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !9, file: !7, line: 423, baseType: !16, size: 1, align: 32, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "preinitcb", scope: !9, file: !7, line: 424, baseType: !19, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_init_cb_t", file: !7, line: 417, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!23}
!23 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "initcb", scope: !9, file: !7, line: 425, baseType: !19, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "finicb", scope: !9, file: !7, line: 426, baseType: !26, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_fini_cb_t", file: !7, line: 418, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "lookupcb", scope: !9, file: !7, line: 427, baseType: !31, size: 64, align: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_lookup_cb_t", file: !32, line: 39, baseType: !33)
!32 = !DIFile(filename: "nat.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!23, !36, !48, !23, !36, !49}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !38, line: 153, size: 128, align: 16, elements: !39)
!38 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!39 = !{!40, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !37, file: !38, line: 155, baseType: !41, size: 16, align: 16)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !42, line: 28, baseType: !43)
!42 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!43 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !37, file: !38, line: 156, baseType: !45, size: 112, align: 8, offset: 16)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 112, align: 8, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 14)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !38, line: 33, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !51, line: 189, baseType: !16)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "socketcb", scope: !9, file: !7, line: 428, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "nat_socket_cb_t", file: !32, line: 41, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!23, !23}
!57 = !{!58}
!58 = !DISubrange(count: 3)
!59 = !{i32 2, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!62 = distinct !DISubprogram(name: "nat_netfilter_lookup_cb", scope: !7, file: !7, line: 332, type: !34, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!63 = !DILocalVariable(name: "dst_addr", arg: 1, scope: !62, file: !7, line: 332, type: !36)
!64 = !DIExpression()
!65 = !DILocation(line: 332, column: 42, scope: !62)
!66 = !DILocalVariable(name: "dst_addrlen", arg: 2, scope: !62, file: !7, line: 332, type: !48)
!67 = !DILocation(line: 332, column: 63, scope: !62)
!68 = !DILocalVariable(name: "s", arg: 3, scope: !62, file: !7, line: 333, type: !23)
!69 = !DILocation(line: 333, column: 40, scope: !62)
!70 = !DILocalVariable(name: "src_addr", arg: 4, scope: !62, file: !7, line: 334, type: !36)
!71 = !DILocation(line: 334, column: 42, scope: !62)
!72 = !DILocalVariable(name: "src_addrlen", arg: 5, scope: !62, file: !7, line: 334, type: !49)
!73 = !DILocation(line: 334, column: 86, scope: !62)
!74 = !DILocalVariable(name: "rv", scope: !62, file: !7, line: 336, type: !23)
!75 = !DILocation(line: 336, column: 6, scope: !62)
!76 = !DILocation(line: 338, column: 6, scope: !77)
!77 = distinct !DILexicalBlock(scope: !62, file: !7, line: 338, column: 6)
!78 = !DILocation(line: 338, column: 16, scope: !77)
!79 = !DILocation(line: 338, column: 26, scope: !77)
!80 = !DILocation(line: 338, column: 6, scope: !62)
!81 = !DILocation(line: 339, column: 19, scope: !82)
!82 = distinct !DILexicalBlock(scope: !77, file: !7, line: 338, column: 37)
!83 = !DILocation(line: 340, column: 19, scope: !82)
!84 = !DILocation(line: 340, column: 29, scope: !82)
!85 = !DILocation(line: 339, column: 8, scope: !82)
!86 = !DILocation(line: 339, column: 6, scope: !82)
!87 = !DILocation(line: 341, column: 7, scope: !88)
!88 = distinct !DILexicalBlock(scope: !82, file: !7, line: 341, column: 7)
!89 = !DILocation(line: 341, column: 10, scope: !88)
!90 = !DILocation(line: 341, column: 7, scope: !82)
!91 = !DILocation(line: 344, column: 29, scope: !92)
!92 = distinct !DILexicalBlock(scope: !88, file: !7, line: 341, column: 17)
!93 = !DILocation(line: 344, column: 28, scope: !92)
!94 = !DILocation(line: 344, column: 19, scope: !95)
!95 = !DILexicalBlockFile(scope: !92, file: !7, discriminator: 1)
!96 = !DILocation(line: 342, column: 4, scope: !92)
!97 = !DILocation(line: 345, column: 3, scope: !92)
!98 = !DILocation(line: 346, column: 2, scope: !82)
!99 = !DILocation(line: 348, column: 19, scope: !100)
!100 = distinct !DILexicalBlock(scope: !77, file: !7, line: 346, column: 9)
!101 = !DILocation(line: 349, column: 19, scope: !100)
!102 = !DILocation(line: 349, column: 29, scope: !100)
!103 = !DILocation(line: 348, column: 8, scope: !100)
!104 = !DILocation(line: 348, column: 6, scope: !100)
!105 = !DILocation(line: 350, column: 7, scope: !106)
!106 = distinct !DILexicalBlock(scope: !100, file: !7, line: 350, column: 7)
!107 = !DILocation(line: 350, column: 10, scope: !106)
!108 = !DILocation(line: 350, column: 7, scope: !100)
!109 = !DILocation(line: 353, column: 29, scope: !110)
!110 = distinct !DILexicalBlock(scope: !106, file: !7, line: 350, column: 17)
!111 = !DILocation(line: 353, column: 28, scope: !110)
!112 = !DILocation(line: 353, column: 19, scope: !113)
!113 = !DILexicalBlockFile(scope: !110, file: !7, discriminator: 1)
!114 = !DILocation(line: 351, column: 4, scope: !110)
!115 = !DILocation(line: 354, column: 3, scope: !110)
