; ModuleID = './line10-thrqueue.o.i'
source_filename = "./line10-thrqueue.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.thrqueue = type { i8**, i64, i64, i64, i64, i8, %union.pthread_mutex_t, %union.pthread_cond_t, %union.pthread_cond_t }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.anon }
%struct.anon = type { i32, i32, i64, i64, i64, i8*, i32, i32 }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_condattr_t = type { i32 }

; Function Attrs: nounwind uwtable
define noalias %struct.thrqueue* @thrqueue_new(i64) #0 !dbg !8 {
  %2 = alloca %struct.thrqueue*, align 8
  %3 = alloca i64, align 8
  %4 = alloca %struct.thrqueue*, align 8
  store i64 %0, i64* %3, align 8
  call void @llvm.dbg.declare(metadata i64* %3, metadata !83, metadata !84), !dbg !85
  call void @llvm.dbg.declare(metadata %struct.thrqueue** %4, metadata !86, metadata !84), !dbg !87
  %5 = call noalias i8* @malloc(i64 184) #4, !dbg !88
  %6 = bitcast i8* %5 to %struct.thrqueue*, !dbg !88
  store %struct.thrqueue* %6, %struct.thrqueue** %4, align 8, !dbg !90
  %7 = icmp ne %struct.thrqueue* %6, null, !dbg !90
  br i1 %7, label %9, label %8, !dbg !91


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line10-thrqueue.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!8 = distinct !DISubprogram(name: "thrqueue_new", scope: !9, file: !9, line: 56, type: !10, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!9 = !DIFile(filename: "thrqueue.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !20}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "thrqueue_t", file: !14, line: 36, baseType: !15)
!14 = !DIFile(filename: "thrqueue.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thrqueue", file: !9, line: 41, size: 1472, align: 64, elements: !16)
!16 = !{!17, !19, !23, !24, !25, !26, !28, !29, !60, !82}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !15, file: !9, line: 42, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sz", scope: !15, file: !9, line: 43, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 216, baseType: !22)
!21 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!22 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !15, file: !9, line: 43, baseType: !20, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !15, file: !9, line: 44, baseType: !20, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !15, file: !9, line: 44, baseType: !20, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "block_enqueue", scope: !15, file: !9, line: 45, baseType: !27, size: 1, align: 32, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "block_dequeue", scope: !15, file: !9, line: 46, baseType: !27, size: 1, align: 32, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !15, file: !9, line: 47, baseType: !30, size: 320, align: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !31, line: 128, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !31, line: 90, size: 320, align: 64, elements: !33)
!33 = !{!34, !53, !58}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !32, file: !31, line: 125, baseType: !35, size: 320, align: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !31, line: 92, size: 320, align: 64, elements: !36)
!36 = !{!37, !39, !40, !41, !42, !43, !45, !46}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !35, file: !31, line: 94, baseType: !38, size: 32, align: 32)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !35, file: !31, line: 95, baseType: !27, size: 32, align: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !35, file: !31, line: 96, baseType: !38, size: 32, align: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !35, file: !31, line: 98, baseType: !27, size: 32, align: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !35, file: !31, line: 102, baseType: !38, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !35, file: !31, line: 104, baseType: !44, size: 16, align: 16, offset: 160)
!44 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !35, file: !31, line: 105, baseType: !44, size: 16, align: 16, offset: 176)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !35, file: !31, line: 106, baseType: !47, size: 128, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !31, line: 79, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !31, line: 75, size: 128, align: 64, elements: !49)
!49 = !{!50, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !48, file: !31, line: 77, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !48, file: !31, line: 78, baseType: !51, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !32, file: !31, line: 126, baseType: !54, size: 320, align: 8)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 320, align: 8, elements: !56)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !{!57}
!57 = !DISubrange(count: 40)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !32, file: !31, line: 127, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "notempty", scope: !15, file: !9, line: 48, baseType: !61, size: 384, align: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !31, line: 154, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !31, line: 139, size: 384, align: 64, elements: !63)
!63 = !{!64, !76, !80}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !62, file: !31, line: 151, baseType: !65, size: 384, align: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !62, file: !31, line: 141, size: 384, align: 64, elements: !66)
!66 = !{!67, !68, !69, !71, !72, !73, !74, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !65, file: !31, line: 143, baseType: !38, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !65, file: !31, line: 144, baseType: !27, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !65, file: !31, line: 145, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !65, file: !31, line: 146, baseType: !70, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !65, file: !31, line: 147, baseType: !70, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !65, file: !31, line: 148, baseType: !4, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !65, file: !31, line: 149, baseType: !27, size: 32, align: 32, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !65, file: !31, line: 150, baseType: !27, size: 32, align: 32, offset: 352)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !62, file: !31, line: 152, baseType: !77, size: 384, align: 8)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 384, align: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 48)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !62, file: !31, line: 153, baseType: !81, size: 64, align: 64)
!81 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "notfull", scope: !15, file: !9, line: 49, baseType: !61, size: 384, align: 64, offset: 1088)
!83 = !DILocalVariable(name: "sz", arg: 1, scope: !8, file: !9, line: 56, type: !20)
!84 = !DIExpression()
!85 = !DILocation(line: 56, column: 21, scope: !8)
!86 = !DILocalVariable(name: "queue", scope: !8, file: !9, line: 58, type: !12)
!87 = !DILocation(line: 58, column: 14, scope: !8)
!88 = !DILocation(line: 60, column: 16, scope: !89)
!89 = distinct !DILexicalBlock(scope: !8, file: !9, line: 60, column: 6)
!90 = !DILocation(line: 60, column: 14, scope: !89)
!91 = !DILocation(line: 60, column: 6, scope: !8)
!92 = !DILocation(line: 61, column: 3, scope: !89)
!93 = !DILocation(line: 62, column: 29, scope: !94)
!94 = distinct !DILexicalBlock(scope: !8, file: !9, line: 62, column: 6)
!95 = !DILocation(line: 62, column: 32, scope: !94)
!96 = !DILocation(line: 62, column: 22, scope: !94)
!97 = !DILocation(line: 62, column: 8, scope: !94)
!98 = !DILocation(line: 62, column: 15, scope: !94)
!99 = !DILocation(line: 62, column: 20, scope: !94)
!100 = !DILocation(line: 62, column: 6, scope: !8)
!101 = !DILocation(line: 63, column: 3, scope: !94)
!102 = !DILocation(line: 64, column: 26, scope: !103)
!103 = distinct !DILexicalBlock(scope: !8, file: !9, line: 64, column: 6)
!104 = !DILocation(line: 64, column: 33, scope: !103)
!105 = !DILocation(line: 64, column: 6, scope: !103)
!106 = !DILocation(line: 64, column: 6, scope: !8)
!107 = !DILocation(line: 65, column: 3, scope: !103)
!108 = !DILocation(line: 66, column: 25, scope: !109)
!109 = distinct !DILexicalBlock(scope: !8, file: !9, line: 66, column: 6)
!110 = !DILocation(line: 66, column: 32, scope: !109)
!111 = !DILocation(line: 66, column: 6, scope: !109)
!112 = !DILocation(line: 66, column: 6, scope: !8)
!113 = !DILocation(line: 67, column: 3, scope: !109)
!114 = !DILocation(line: 68, column: 25, scope: !115)
!115 = distinct !DILexicalBlock(scope: !8, file: !9, line: 68, column: 6)
!116 = !DILocation(line: 68, column: 32, scope: !115)
!117 = !DILocation(line: 68, column: 6, scope: !115)
!118 = !DILocation(line: 68, column: 6, scope: !8)
!119 = !DILocation(line: 69, column: 3, scope: !115)
!120 = !DILocation(line: 70, column: 14, scope: !8)
!121 = !DILocation(line: 70, column: 2, scope: !8)
!122 = !DILocation(line: 70, column: 9, scope: !8)
!123 = !DILocation(line: 70, column: 12, scope: !8)
!124 = !DILocation(line: 71, column: 2, scope: !8)
!125 = !DILocation(line: 71, column: 9, scope: !8)
!126 = !DILocation(line: 71, column: 11, scope: !8)
!127 = !DILocation(line: 72, column: 2, scope: !8)
!128 = !DILocation(line: 72, column: 9, scope: !8)
!129 = !DILocation(line: 72, column: 12, scope: !8)
!130 = !DILocation(line: 73, column: 2, scope: !8)
!131 = !DILocation(line: 73, column: 9, scope: !8)
!132 = !DILocation(line: 73, column: 13, scope: !8)
!133 = !DILocation(line: 74, column: 2, scope: !8)
!134 = !DILocation(line: 74, column: 9, scope: !8)
!135 = !DILocation(line: 74, column: 23, scope: !8)
!136 = !DILocation(line: 75, column: 2, scope: !8)
!137 = !DILocation(line: 75, column: 9, scope: !8)
!138 = !DILocation(line: 75, column: 23, scope: !8)
!139 = !DILocation(line: 76, column: 9, scope: !8)
!140 = !DILocation(line: 76, column: 2, scope: !8)
!141 = !DILocation(line: 79, column: 24, scope: !8)
!142 = !DILocation(line: 79, column: 31, scope: !8)
!143 = !DILocation(line: 79, column: 2, scope: !8)
!144 = !DILocation(line: 81, column: 25, scope: !8)
!145 = !DILocation(line: 81, column: 32, scope: !8)
!146 = !DILocation(line: 81, column: 2, scope: !8)
!147 = !DILocation(line: 83, column: 7, scope: !8)
!148 = !DILocation(line: 83, column: 14, scope: !8)
!149 = !DILocation(line: 83, column: 2, scope: !8)
!150 = !DILocation(line: 85, column: 7, scope: !8)
!151 = !DILocation(line: 85, column: 2, scope: !8)
!152 = !DILocation(line: 87, column: 2, scope: !8)
!153 = !DILocation(line: 88, column: 1, scope: !8)
