; ModuleID = './line9-sys.o.i'
source_filename = "./line9-sys.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.ifreq = type { %union.anon, %union.anon.0 }
%union.anon = type { [16 x i8] }
%union.anon.0 = type { %struct.ifmap }
%struct.ifmap = type { i64, i64, i16, i8, i8, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i32, i32 (i8*, i8*)*, i32 }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, i64, i8*, i8*, i8*, i32, i32, i16, i16, i64, i64, i64, i16, i16, i16, i16, %struct.stat*, [1 x i8] }
%struct.iovec = type { i8*, i64 }

!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !222, line: 24, size: 32, align: 32, elements: !223)
!222 = !DIFile(filename: "/usr/include/bits/socket_type.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!225 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!226 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!227 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!228 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!229 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!230 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!231 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!232 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 40, size: 32, align: 32, elements: !235)
!234 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!236 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!237 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!238 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!239 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!240 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!241 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!242 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!243 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!244 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!245 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!246 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!247 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!248 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!249 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!250 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!251 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!252 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!253 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!254 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!255 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!256 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!257 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!258 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!259 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!260 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!261 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !263, line: 303, size: 32, align: 32, elements: !264)
!263 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!264 = !{!265, !266}
!265 = !DIEnumerator(name: "SCM_RIGHTS", value: 1)
!266 = !DIEnumerator(name: "SCM_CREDENTIALS", value: 2)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !263, line: 175, size: 32, align: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!269 = !DIEnumerator(name: "MSG_OOB", value: 1)
!270 = !DIEnumerator(name: "MSG_PEEK", value: 2)
!271 = !DIEnumerator(name: "MSG_DONTROUTE", value: 4)
!272 = !DIEnumerator(name: "MSG_TRYHARD", value: 4)
!273 = !DIEnumerator(name: "MSG_CTRUNC", value: 8)
!274 = !DIEnumerator(name: "MSG_PROXY", value: 16)
!275 = !DIEnumerator(name: "MSG_TRUNC", value: 32)
!276 = !DIEnumerator(name: "MSG_DONTWAIT", value: 64)
!277 = !DIEnumerator(name: "MSG_EOR", value: 128)
!278 = !DIEnumerator(name: "MSG_WAITALL", value: 256)
!279 = !DIEnumerator(name: "MSG_FIN", value: 512)
!280 = !DIEnumerator(name: "MSG_SYN", value: 1024)
!281 = !DIEnumerator(name: "MSG_CONFIRM", value: 2048)
!282 = !DIEnumerator(name: "MSG_RST", value: 4096)
!283 = !DIEnumerator(name: "MSG_ERRQUEUE", value: 8192)
!284 = !DIEnumerator(name: "MSG_NOSIGNAL", value: 16384)
!285 = !DIEnumerator(name: "MSG_MORE", value: 32768)
!286 = !DIEnumerator(name: "MSG_WAITFORONE", value: 65536)
!287 = !DIEnumerator(name: "MSG_FASTOPEN", value: 536870912)
!288 = !DIEnumerator(name: "MSG_CMSG_CLOEXEC", value: 1073741824)
!289 = !{!290, !291, !292, !297, !298, !301, !312, !313, !325, !334}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!291 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !293, line: 109, baseType: !294)
!293 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !295, line: 172, baseType: !296)
!295 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!296 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!297 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !299, line: 216, baseType: !300)
!299 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!300 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmsghdr", file: !263, line: 246, size: 128, align: 64, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_len", scope: !302, file: !263, line: 248, baseType: !298, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_level", scope: !302, file: !263, line: 253, baseType: !291, size: 32, align: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cmsg_type", scope: !302, file: !263, line: 254, baseType: !291, size: 32, align: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__cmsg_data", scope: !302, file: !263, line: 256, baseType: !308, offset: 128)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, align: 8, elements: !310)
!309 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!310 = !{!311}
!311 = !DISubrange(count: -1)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !263, line: 153, size: 128, align: 16, elements: !315)
!315 = !{!316, !320}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !314, file: !263, line: 155, baseType: !317, size: 16, align: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !318, line: 28, baseType: !319)
!318 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!319 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !314, file: !263, line: 156, baseType: !321, size: 112, align: 8, offset: 16)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 112, align: 8, elements: !323)
!322 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!323 = !{!324}
!324 = !DISubrange(count: 14)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !327, line: 29, size: 880, align: 16, elements: !328)
!327 = !DIFile(filename: "/usr/include/sys/un.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !326, file: !327, line: 31, baseType: !317, size: 16, align: 16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !326, file: !327, line: 32, baseType: !331, size: 864, align: 8, offset: 16)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 864, align: 8, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 108)
!334 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!335 = !{!336, !345, !351}
!336 = distinct !DIGlobalVariable(name: "bufsize", scope: !337, file: !338, line: 314, type: !291, isLocal: true, isDefinition: true, variable: i32* @sys_user_str.bufsize)
!337 = distinct !DISubprogram(name: "sys_user_str", scope: !338, file: !338, line: 312, type: !339, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!338 = !DIFile(filename: "sys.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!339 = !DISubroutineType(types: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !293, line: 80, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !295, line: 125, baseType: !334)
!344 = !{}
!345 = distinct !DIGlobalVariable(name: "bufsize", scope: !346, file: !338, line: 367, type: !291, isLocal: true, isDefinition: true, variable: i32* @sys_group_str.bufsize)
!346 = distinct !DISubprogram(name: "sys_group_str", scope: !338, file: !338, line: 365, type: !347, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!347 = !DISubroutineType(types: !348)
!348 = !{!341, !349}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !293, line: 65, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !295, line: 126, baseType: !334)
!351 = distinct !DIGlobalVariable(name: "sys_rand_seeded", scope: !0, file: !338, line: 1014, type: !291, isLocal: true, isDefinition: true, variable: i32* @sys_rand_seeded)
!352 = !{i32 2, !"Dwarf Version", i32 4}
!353 = !{i32 2, !"Debug Info Version", i32 3}
!354 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!355 = distinct !DISubprogram(name: "sys_privdrop", scope: !338, file: !338, line: 78, type: !356, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!356 = !DISubroutineType(types: !357)
!357 = !{!291, !358, !358, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!360 = !DILocalVariable(name: "username", arg: 1, scope: !355, file: !338, line: 78, type: !358)
!361 = !DIExpression()
!362 = !DILocation(line: 78, column: 26, scope: !355)
!363 = !DILocalVariable(name: "groupname", arg: 2, scope: !355, file: !338, line: 78, type: !358)
!364 = !DILocation(line: 78, column: 48, scope: !355)
!365 = !DILocalVariable(name: "jaildir", arg: 3, scope: !355, file: !338, line: 78, type: !358)
!366 = !DILocation(line: 78, column: 71, scope: !355)
!367 = !DILocalVariable(name: "pw", scope: !355, file: !338, line: 80, type: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !370, line: 49, size: 384, align: 64, elements: !371)
!370 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!371 = !{!372, !373, !374, !375, !376, !377, !378}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !369, file: !370, line: 51, baseType: !341, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !369, file: !370, line: 52, baseType: !341, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !369, file: !370, line: 53, baseType: !343, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !369, file: !370, line: 54, baseType: !350, size: 32, align: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !369, file: !370, line: 55, baseType: !341, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !369, file: !370, line: 56, baseType: !341, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !369, file: !370, line: 57, baseType: !341, size: 64, align: 64, offset: 320)
!379 = !DILocation(line: 80, column: 17, scope: !355)
!380 = !DILocalVariable(name: "gr", scope: !355, file: !338, line: 81, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !383, line: 42, size: 256, align: 64, elements: !384)
!383 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !382, file: !383, line: 44, baseType: !341, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !382, file: !383, line: 45, baseType: !341, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !382, file: !383, line: 46, baseType: !350, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !382, file: !383, line: 47, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!390 = !DILocation(line: 81, column: 16, scope: !355)
!391 = !DILocalVariable(name: "ret", scope: !355, file: !338, line: 82, type: !291)
!392 = !DILocation(line: 82, column: 6, scope: !355)
!393 = !DILocation(line: 84, column: 6, scope: !394)
!394 = distinct !DILexicalBlock(scope: !355, file: !338, line: 84, column: 6)
!395 = !DILocation(line: 84, column: 6, scope: !355)
!396 = !DILocation(line: 85, column: 4, scope: !397)
!397 = distinct !DILexicalBlock(scope: !394, file: !338, line: 84, column: 17)
!398 = !DILocation(line: 85, column: 8, scope: !397)
!399 = !DILocation(line: 86, column: 23, scope: !400)
!400 = distinct !DILexicalBlock(scope: !397, file: !338, line: 86, column: 7)
!401 = !DILocation(line: 86, column: 14, scope: !400)
!402 = !DILocation(line: 86, column: 12, scope: !400)
!403 = !DILocation(line: 86, column: 7, scope: !397)
!404 = !DILocation(line: 88, column: 19, scope: !405)
!405 = distinct !DILexicalBlock(scope: !400, file: !338, line: 86, column: 36)
!406 = !DILocation(line: 88, column: 40, scope: !405)
!407 = !DILocation(line: 88, column: 39, scope: !405)
!408 = !DILocation(line: 88, column: 30, scope: !409)
!409 = !DILexicalBlockFile(scope: !405, file: !338, discriminator: 1)
!410 = !DILocation(line: 87, column: 4, scope: !405)
!411 = !DILocation(line: 89, column: 1, scope: !405)
!412 = !DILocation(line: 90, column: 4, scope: !405)
!413 = !DILocation(line: 92, column: 2, scope: !397)
!414 = !DILocation(line: 94, column: 6, scope: !415)
!415 = distinct !DILexicalBlock(scope: !355, file: !338, line: 94, column: 6)
!416 = !DILocation(line: 94, column: 6, scope: !355)
!417 = !DILocation(line: 94, column: 4, scope: !418)
!418 = !DILexicalBlockFile(scope: !419, file: !338, discriminator: 1)
!419 = distinct !DILexicalBlock(scope: !415, file: !338, line: 94, column: 16)
!420 = !DILocation(line: 94, column: 8, scope: !418)
!421 = !DILocation(line: 95, column: 23, scope: !422)
!422 = distinct !DILexicalBlock(scope: !419, file: !338, line: 95, column: 7)
!423 = !DILocation(line: 95, column: 14, scope: !422)
!424 = !DILocation(line: 95, column: 12, scope: !422)
!425 = !DILocation(line: 95, column: 7, scope: !419)
!426 = !DILocation(line: 97, column: 19, scope: !427)
!427 = distinct !DILexicalBlock(scope: !422, file: !338, line: 95, column: 35)
!428 = !DILocation(line: 97, column: 39, scope: !427)
!429 = !DILocation(line: 97, column: 38, scope: !427)
!430 = !DILocation(line: 97, column: 29, scope: !431)
!431 = !DILexicalBlockFile(scope: !427, file: !338, discriminator: 1)
!432 = !DILocation(line: 96, column: 4, scope: !427)
!433 = !DILocation(line: 98, column: 1, scope: !427)
!434 = !DILocation(line: 99, column: 4, scope: !427)
!435 = !DILocation(line: 102, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !419, file: !338, line: 102, column: 7)
!437 = !DILocation(line: 102, column: 10, scope: !436)
!438 = !DILocation(line: 102, column: 7, scope: !419)
!439 = !DILocation(line: 102, column: 17, scope: !440)
!440 = !DILexicalBlockFile(scope: !441, file: !338, discriminator: 1)
!441 = distinct !DILexicalBlock(scope: !436, file: !338, line: 101, column: 18)
!442 = !DILocation(line: 102, column: 21, scope: !440)
!443 = !DILocation(line: 102, column: 4, scope: !440)
!444 = !DILocation(line: 102, column: 8, scope: !440)
!445 = !DILocation(line: 102, column: 15, scope: !440)
!446 = !DILocation(line: 103, column: 3, scope: !441)
!447 = !DILocation(line: 105, column: 18, scope: !448)
!448 = distinct !DILexicalBlock(scope: !419, file: !338, line: 105, column: 7)
!449 = !DILocation(line: 105, column: 28, scope: !448)
!450 = !DILocation(line: 105, column: 32, scope: !448)
!451 = !DILocation(line: 105, column: 7, scope: !448)
!452 = !DILocation(line: 105, column: 40, scope: !448)
!453 = !DILocation(line: 105, column: 7, scope: !419)
!454 = !DILocation(line: 107, column: 19, scope: !455)
!455 = distinct !DILexicalBlock(scope: !448, file: !338, line: 105, column: 47)
!456 = !DILocation(line: 107, column: 39, scope: !455)
!457 = !DILocation(line: 107, column: 38, scope: !455)
!458 = !DILocation(line: 107, column: 29, scope: !459)
!459 = !DILexicalBlockFile(scope: !455, file: !338, discriminator: 1)
!460 = !DILocation(line: 106, column: 4, scope: !455)
!461 = !DILocation(line: 108, column: 1, scope: !455)
!462 = !DILocation(line: 109, column: 4, scope: !455)
!463 = !DILocation(line: 111, column: 2, scope: !419)
!464 = !DILocation(line: 113, column: 6, scope: !465)
!465 = distinct !DILexicalBlock(scope: !355, file: !338, line: 113, column: 6)
!466 = !DILocation(line: 113, column: 6, scope: !355)
!467 = !DILocation(line: 114, column: 14, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !338, line: 114, column: 7)
!469 = distinct !DILexicalBlock(scope: !465, file: !338, line: 113, column: 15)
!470 = !DILocation(line: 114, column: 7, scope: !468)
!471 = !DILocation(line: 114, column: 23, scope: !468)
!472 = !DILocation(line: 114, column: 7, scope: !469)
!473 = !DILocation(line: 116, column: 19, scope: !474)
!474 = distinct !DILexicalBlock(scope: !468, file: !338, line: 114, column: 30)
!475 = !DILocation(line: 115, column: 38, scope: !474)
!476 = !DILocation(line: 115, column: 37, scope: !474)
!477 = !DILocation(line: 116, column: 28, scope: !474)
!478 = !DILocation(line: 115, column: 4, scope: !479)
!479 = !DILexicalBlockFile(scope: !474, file: !338, discriminator: 1)
!480 = !DILocation(line: 116, column: 1, scope: !479)
!481 = !DILocation(line: 117, column: 4, scope: !474)
!482 = !DILocation(line: 119, column: 7, scope: !483)
!483 = distinct !DILexicalBlock(scope: !469, file: !338, line: 119, column: 7)
!484 = !DILocation(line: 119, column: 18, scope: !483)
!485 = !DILocation(line: 119, column: 7, scope: !469)
!486 = !DILocation(line: 120, column: 29, scope: !487)
!487 = distinct !DILexicalBlock(scope: !483, file: !338, line: 119, column: 25)
!488 = !DILocation(line: 120, column: 28, scope: !487)
!489 = !DILocation(line: 121, column: 19, scope: !487)
!490 = !DILocation(line: 120, column: 4, scope: !491)
!491 = !DILexicalBlockFile(scope: !487, file: !338, discriminator: 1)
!492 = !DILocation(line: 121, column: 1, scope: !491)
!493 = !DILocation(line: 122, column: 4, scope: !487)
!494 = !DILocation(line: 124, column: 2, scope: !469)
!495 = !DILocation(line: 126, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !355, file: !338, line: 126, column: 6)
!497 = !DILocation(line: 126, column: 6, scope: !355)
!498 = !DILocation(line: 127, column: 14, scope: !499)
!499 = distinct !DILexicalBlock(scope: !500, file: !338, line: 127, column: 7)
!500 = distinct !DILexicalBlock(scope: !496, file: !338, line: 126, column: 16)
!501 = !DILocation(line: 127, column: 18, scope: !499)
!502 = !DILocation(line: 127, column: 7, scope: !499)
!503 = !DILocation(line: 127, column: 26, scope: !499)
!504 = !DILocation(line: 127, column: 7, scope: !500)
!505 = !DILocation(line: 129, column: 19, scope: !506)
!506 = distinct !DILexicalBlock(scope: !499, file: !338, line: 127, column: 33)
!507 = !DILocation(line: 129, column: 23, scope: !506)
!508 = !DILocation(line: 128, column: 41, scope: !506)
!509 = !DILocation(line: 128, column: 40, scope: !506)
!510 = !DILocation(line: 129, column: 31, scope: !506)
!511 = !DILocation(line: 128, column: 4, scope: !512)
!512 = !DILexicalBlockFile(scope: !506, file: !338, discriminator: 1)
!513 = !DILocation(line: 129, column: 1, scope: !512)
!514 = !DILocation(line: 130, column: 4, scope: !506)
!515 = !DILocation(line: 132, column: 14, scope: !516)
!516 = distinct !DILexicalBlock(scope: !500, file: !338, line: 132, column: 7)
!517 = !DILocation(line: 132, column: 18, scope: !516)
!518 = !DILocation(line: 132, column: 7, scope: !516)
!519 = !DILocation(line: 132, column: 26, scope: !516)
!520 = !DILocation(line: 132, column: 7, scope: !500)
!521 = !DILocation(line: 134, column: 19, scope: !522)
!522 = distinct !DILexicalBlock(scope: !516, file: !338, line: 132, column: 33)
!523 = !DILocation(line: 134, column: 23, scope: !522)
!524 = !DILocation(line: 133, column: 41, scope: !522)
!525 = !DILocation(line: 133, column: 40, scope: !522)
!526 = !DILocation(line: 134, column: 31, scope: !522)
!527 = !DILocation(line: 133, column: 4, scope: !528)
!528 = !DILexicalBlockFile(scope: !522, file: !338, discriminator: 1)
!529 = !DILocation(line: 134, column: 1, scope: !528)
!530 = !DILocation(line: 135, column: 4, scope: !522)
!531 = !DILocation(line: 137, column: 2, scope: !500)
!532 = !DILocation(line: 137, column: 13, scope: !533)
!533 = !DILexicalBlockFile(scope: !534, file: !338, discriminator: 1)
!534 = distinct !DILexicalBlock(scope: !496, file: !338, line: 137, column: 13)
!535 = !DILocation(line: 137, column: 25, scope: !536)
!536 = !DILexicalBlockFile(scope: !533, file: !338, discriminator: 2)
!537 = !DILocation(line: 137, column: 22, scope: !533)
!538 = !DILocation(line: 138, column: 14, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !338, line: 138, column: 7)
!540 = distinct !DILexicalBlock(scope: !534, file: !338, line: 137, column: 36)
!541 = !DILocation(line: 138, column: 7, scope: !542)
!542 = !DILexicalBlockFile(scope: !539, file: !338, discriminator: 1)
!543 = !DILocation(line: 138, column: 24, scope: !539)
!544 = !DILocation(line: 138, column: 7, scope: !540)
!545 = !DILocation(line: 139, column: 29, scope: !546)
!546 = distinct !DILexicalBlock(scope: !539, file: !338, line: 138, column: 31)
!547 = !DILocation(line: 139, column: 28, scope: !546)
!548 = !DILocation(line: 140, column: 19, scope: !546)
!549 = !DILocation(line: 139, column: 4, scope: !550)
!550 = !DILexicalBlockFile(scope: !546, file: !338, discriminator: 1)
!551 = !DILocation(line: 140, column: 1, scope: !550)
!552 = !DILocation(line: 141, column: 4, scope: !546)
!553 = !DILocation(line: 143, column: 2, scope: !540)
!554 = !DILocation(line: 145, column: 6, scope: !355)
!555 = !DILocation(line: 145, column: 2, scope: !355)
!556 = !DILocation(line: 147, column: 6, scope: !557)
!557 = distinct !DILexicalBlock(scope: !355, file: !338, line: 147, column: 6)
!558 = !DILocation(line: 147, column: 6, scope: !355)
!559 = !DILocation(line: 148, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !557, file: !338, line: 147, column: 10)
!561 = !DILocation(line: 149, column: 2, scope: !560)
!562 = !DILocation(line: 150, column: 6, scope: !563)
!563 = distinct !DILexicalBlock(scope: !355, file: !338, line: 150, column: 6)
!564 = !DILocation(line: 150, column: 6, scope: !355)
!565 = !DILocation(line: 151, column: 3, scope: !566)
!566 = distinct !DILexicalBlock(scope: !563, file: !338, line: 150, column: 10)
!567 = !DILocation(line: 152, column: 2, scope: !566)
!568 = !DILocation(line: 153, column: 9, scope: !355)
!569 = !DILocation(line: 153, column: 2, scope: !355)
!570 = distinct !DISubprogram(name: "sys_uid", scope: !338, file: !338, line: 162, type: !571, isLocal: false, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!571 = !DISubroutineType(types: !572)
!572 = !{!291, !358, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!574 = !DILocalVariable(name: "username", arg: 1, scope: !570, file: !338, line: 162, type: !358)
!575 = !DILocation(line: 162, column: 21, scope: !570)
!576 = !DILocalVariable(name: "uid", arg: 2, scope: !570, file: !338, line: 162, type: !573)
!577 = !DILocation(line: 162, column: 38, scope: !570)
!578 = !DILocalVariable(name: "pw", scope: !570, file: !338, line: 164, type: !368)
!579 = !DILocation(line: 164, column: 17, scope: !570)
!580 = !DILocalVariable(name: "rv", scope: !570, file: !338, line: 165, type: !291)
!581 = !DILocation(line: 165, column: 6, scope: !570)
!582 = !DILocation(line: 166, column: 3, scope: !570)
!583 = !DILocation(line: 166, column: 7, scope: !570)
!584 = !DILocation(line: 167, column: 22, scope: !585)
!585 = distinct !DILexicalBlock(scope: !570, file: !338, line: 167, column: 6)
!586 = !DILocation(line: 167, column: 13, scope: !585)
!587 = !DILocation(line: 167, column: 11, scope: !585)
!588 = !DILocation(line: 167, column: 6, scope: !570)
!589 = !DILocation(line: 168, column: 8, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !338, line: 168, column: 6)
!591 = distinct !DILexicalBlock(scope: !585, file: !338, line: 167, column: 34)
!592 = !DILocation(line: 168, column: 7, scope: !590)
!593 = !DILocation(line: 168, column: 12, scope: !590)
!594 = !DILocation(line: 168, column: 17, scope: !590)
!595 = !DILocation(line: 168, column: 22, scope: !596)
!596 = !DILexicalBlockFile(scope: !590, file: !338, discriminator: 1)
!597 = !DILocation(line: 168, column: 21, scope: !596)
!598 = !DILocation(line: 168, column: 26, scope: !596)
!599 = !DILocation(line: 168, column: 6, scope: !596)
!600 = !DILocation(line: 170, column: 19, scope: !601)
!601 = distinct !DILexicalBlock(scope: !590, file: !338, line: 168, column: 37)
!602 = !DILocation(line: 170, column: 39, scope: !601)
!603 = !DILocation(line: 170, column: 38, scope: !601)
!604 = !DILocation(line: 170, column: 29, scope: !605)
!605 = !DILexicalBlockFile(scope: !601, file: !338, discriminator: 1)
!606 = !DILocation(line: 170, column: 47, scope: !607)
!607 = !DILexicalBlockFile(scope: !601, file: !338, discriminator: 2)
!608 = !DILocation(line: 170, column: 46, scope: !601)
!609 = !DILocation(line: 169, column: 4, scope: !601)
!610 = !DILocation(line: 171, column: 3, scope: !601)
!611 = !DILocation(line: 172, column: 6, scope: !591)
!612 = !DILocation(line: 173, column: 2, scope: !591)
!613 = !DILocation(line: 174, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !338, line: 174, column: 7)
!615 = distinct !DILexicalBlock(scope: !585, file: !338, line: 173, column: 9)
!616 = !DILocation(line: 174, column: 7, scope: !615)
!617 = !DILocation(line: 175, column: 11, scope: !614)
!618 = !DILocation(line: 175, column: 15, scope: !614)
!619 = !DILocation(line: 175, column: 5, scope: !614)
!620 = !DILocation(line: 175, column: 9, scope: !614)
!621 = !DILocation(line: 175, column: 4, scope: !614)
!622 = !DILocation(line: 176, column: 6, scope: !615)
!623 = !DILocation(line: 178, column: 2, scope: !570)
!624 = !DILocation(line: 179, column: 9, scope: !570)
!625 = !DILocation(line: 179, column: 2, scope: !570)
!626 = distinct !DISubprogram(name: "sys_isuser", scope: !338, file: !338, line: 186, type: !627, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!627 = !DISubroutineType(types: !628)
!628 = !{!291, !358}
!629 = !DILocalVariable(name: "username", arg: 1, scope: !626, file: !338, line: 186, type: !358)
!630 = !DILocation(line: 186, column: 24, scope: !626)
!631 = !DILocation(line: 188, column: 17, scope: !626)
!632 = !DILocation(line: 188, column: 9, scope: !626)
!633 = !DILocation(line: 188, column: 32, scope: !626)
!634 = !DILocation(line: 188, column: 2, scope: !626)
!635 = distinct !DISubprogram(name: "sys_gid", scope: !338, file: !338, line: 197, type: !636, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!636 = !DISubroutineType(types: !637)
!637 = !{!291, !358, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!639 = !DILocalVariable(name: "groupname", arg: 1, scope: !635, file: !338, line: 197, type: !358)
!640 = !DILocation(line: 197, column: 21, scope: !635)
!641 = !DILocalVariable(name: "gid", arg: 2, scope: !635, file: !338, line: 197, type: !638)
!642 = !DILocation(line: 197, column: 39, scope: !635)
!643 = !DILocalVariable(name: "gr", scope: !635, file: !338, line: 199, type: !381)
!644 = !DILocation(line: 199, column: 16, scope: !635)
!645 = !DILocalVariable(name: "rv", scope: !635, file: !338, line: 200, type: !291)
!646 = !DILocation(line: 200, column: 6, scope: !635)
!647 = !DILocation(line: 202, column: 3, scope: !635)
!648 = !DILocation(line: 202, column: 7, scope: !635)
!649 = !DILocation(line: 203, column: 22, scope: !650)
!650 = distinct !DILexicalBlock(scope: !635, file: !338, line: 203, column: 6)
!651 = !DILocation(line: 203, column: 13, scope: !650)
!652 = !DILocation(line: 203, column: 11, scope: !650)
!653 = !DILocation(line: 203, column: 6, scope: !635)
!654 = !DILocation(line: 204, column: 8, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !338, line: 204, column: 6)
!656 = distinct !DILexicalBlock(scope: !650, file: !338, line: 203, column: 35)
!657 = !DILocation(line: 204, column: 7, scope: !655)
!658 = !DILocation(line: 204, column: 12, scope: !655)
!659 = !DILocation(line: 204, column: 17, scope: !655)
!660 = !DILocation(line: 204, column: 22, scope: !661)
!661 = !DILexicalBlockFile(scope: !655, file: !338, discriminator: 1)
!662 = !DILocation(line: 204, column: 21, scope: !661)
!663 = !DILocation(line: 204, column: 26, scope: !661)
!664 = !DILocation(line: 204, column: 6, scope: !661)
!665 = !DILocation(line: 206, column: 19, scope: !666)
!666 = distinct !DILexicalBlock(scope: !655, file: !338, line: 204, column: 37)
!667 = !DILocation(line: 206, column: 40, scope: !666)
!668 = !DILocation(line: 206, column: 39, scope: !666)
!669 = !DILocation(line: 206, column: 30, scope: !670)
!670 = !DILexicalBlockFile(scope: !666, file: !338, discriminator: 1)
!671 = !DILocation(line: 206, column: 48, scope: !672)
!672 = !DILexicalBlockFile(scope: !666, file: !338, discriminator: 2)
!673 = !DILocation(line: 206, column: 47, scope: !666)
!674 = !DILocation(line: 205, column: 4, scope: !666)
!675 = !DILocation(line: 207, column: 3, scope: !666)
!676 = !DILocation(line: 208, column: 6, scope: !656)
!677 = !DILocation(line: 209, column: 2, scope: !656)
!678 = !DILocation(line: 210, column: 7, scope: !679)
!679 = distinct !DILexicalBlock(scope: !680, file: !338, line: 210, column: 7)
!680 = distinct !DILexicalBlock(scope: !650, file: !338, line: 209, column: 9)
!681 = !DILocation(line: 210, column: 7, scope: !680)
!682 = !DILocation(line: 211, column: 11, scope: !679)
!683 = !DILocation(line: 211, column: 15, scope: !679)
!684 = !DILocation(line: 211, column: 5, scope: !679)
!685 = !DILocation(line: 211, column: 9, scope: !679)
!686 = !DILocation(line: 211, column: 4, scope: !679)
!687 = !DILocation(line: 212, column: 6, scope: !680)
!688 = !DILocation(line: 214, column: 2, scope: !635)
!689 = !DILocation(line: 215, column: 9, scope: !635)
!690 = !DILocation(line: 215, column: 2, scope: !635)
!691 = distinct !DISubprogram(name: "sys_isgroup", scope: !338, file: !338, line: 222, type: !627, isLocal: false, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!692 = !DILocalVariable(name: "groupname", arg: 1, scope: !691, file: !338, line: 222, type: !358)
!693 = !DILocation(line: 222, column: 25, scope: !691)
!694 = !DILocation(line: 224, column: 17, scope: !691)
!695 = !DILocation(line: 224, column: 9, scope: !691)
!696 = !DILocation(line: 224, column: 33, scope: !691)
!697 = !DILocation(line: 224, column: 2, scope: !691)
!698 = distinct !DISubprogram(name: "sys_isgeteuid", scope: !338, file: !338, line: 232, type: !627, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!699 = !DILocalVariable(name: "username", arg: 1, scope: !698, file: !338, line: 232, type: !358)
!700 = !DILocation(line: 232, column: 27, scope: !698)
!701 = !DILocalVariable(name: "uid", scope: !698, file: !338, line: 234, type: !342)
!702 = !DILocation(line: 234, column: 8, scope: !698)
!703 = !DILocation(line: 236, column: 14, scope: !704)
!704 = distinct !DILexicalBlock(scope: !698, file: !338, line: 236, column: 6)
!705 = !DILocation(line: 236, column: 6, scope: !704)
!706 = !DILocation(line: 236, column: 30, scope: !704)
!707 = !DILocation(line: 236, column: 6, scope: !698)
!708 = !DILocation(line: 237, column: 3, scope: !704)
!709 = !DILocation(line: 238, column: 6, scope: !710)
!710 = distinct !DILexicalBlock(scope: !698, file: !338, line: 238, column: 6)
!711 = !DILocation(line: 238, column: 13, scope: !710)
!712 = !DILocation(line: 238, column: 10, scope: !710)
!713 = !DILocation(line: 238, column: 6, scope: !698)
!714 = !DILocation(line: 239, column: 3, scope: !710)
!715 = !DILocation(line: 240, column: 2, scope: !698)
!716 = !DILocation(line: 241, column: 1, scope: !698)
!717 = distinct !DISubprogram(name: "sys_pidf_open", scope: !338, file: !338, line: 248, type: !627, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!718 = !DILocalVariable(name: "fn", arg: 1, scope: !717, file: !338, line: 248, type: !358)
!719 = !DILocation(line: 248, column: 27, scope: !717)
!720 = !DILocalVariable(name: "fd", scope: !717, file: !338, line: 250, type: !291)
!721 = !DILocation(line: 250, column: 6, scope: !717)
!722 = !DILocation(line: 252, column: 17, scope: !723)
!723 = distinct !DILexicalBlock(scope: !717, file: !338, line: 252, column: 6)
!724 = !DILocation(line: 252, column: 12, scope: !723)
!725 = !DILocation(line: 252, column: 10, scope: !723)
!726 = !DILocation(line: 252, column: 43, scope: !723)
!727 = !DILocation(line: 252, column: 6, scope: !717)
!728 = !DILocation(line: 253, column: 47, scope: !729)
!729 = distinct !DILexicalBlock(scope: !723, file: !338, line: 252, column: 50)
!730 = !DILocation(line: 254, column: 28, scope: !729)
!731 = !DILocation(line: 254, column: 27, scope: !729)
!732 = !DILocation(line: 254, column: 18, scope: !733)
!733 = !DILexicalBlockFile(scope: !729, file: !338, discriminator: 1)
!734 = !DILocation(line: 253, column: 3, scope: !729)
!735 = !DILocation(line: 255, column: 3, scope: !729)
!736 = !DILocation(line: 257, column: 12, scope: !737)
!737 = distinct !DILexicalBlock(scope: !717, file: !338, line: 257, column: 6)
!738 = !DILocation(line: 257, column: 6, scope: !737)
!739 = !DILocation(line: 257, column: 32, scope: !737)
!740 = !DILocation(line: 257, column: 6, scope: !717)
!741 = !DILocation(line: 258, column: 47, scope: !742)
!742 = distinct !DILexicalBlock(scope: !737, file: !338, line: 257, column: 39)
!743 = !DILocation(line: 259, column: 28, scope: !742)
!744 = !DILocation(line: 259, column: 27, scope: !742)
!745 = !DILocation(line: 259, column: 18, scope: !746)
!746 = !DILexicalBlockFile(scope: !742, file: !338, discriminator: 1)
!747 = !DILocation(line: 258, column: 3, scope: !742)
!748 = !DILocation(line: 260, column: 9, scope: !742)
!749 = !DILocation(line: 260, column: 3, scope: !742)
!750 = !DILocation(line: 261, column: 3, scope: !742)
!751 = !DILocation(line: 264, column: 9, scope: !717)
!752 = !DILocation(line: 264, column: 2, scope: !717)
!753 = !DILocation(line: 265, column: 1, scope: !717)
!754 = distinct !DISubprogram(name: "sys_pidf_write", scope: !338, file: !338, line: 272, type: !755, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!755 = !DISubroutineType(types: !756)
!756 = !{!291, !291}
!757 = !DILocalVariable(name: "fd", arg: 1, scope: !754, file: !338, line: 272, type: !291)
!758 = !DILocation(line: 272, column: 20, scope: !754)
!759 = !DILocalVariable(name: "pidbuf", scope: !754, file: !338, line: 274, type: !760)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 128, align: 8, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 16)
!763 = !DILocation(line: 274, column: 7, scope: !754)
!764 = !DILocalVariable(name: "rv", scope: !754, file: !338, line: 275, type: !291)
!765 = !DILocation(line: 275, column: 6, scope: !754)
!766 = !DILocalVariable(name: "n", scope: !754, file: !338, line: 276, type: !292)
!767 = !DILocation(line: 276, column: 10, scope: !754)
!768 = !DILocation(line: 278, column: 16, scope: !754)
!769 = !DILocation(line: 278, column: 48, scope: !754)
!770 = !DILocation(line: 278, column: 7, scope: !771)
!771 = !DILexicalBlockFile(scope: !754, file: !338, discriminator: 1)
!772 = !DILocation(line: 278, column: 5, scope: !754)
!773 = !DILocation(line: 279, column: 6, scope: !774)
!774 = distinct !DILexicalBlock(scope: !754, file: !338, line: 279, column: 6)
!775 = !DILocation(line: 279, column: 9, scope: !774)
!776 = !DILocation(line: 279, column: 15, scope: !774)
!777 = !DILocation(line: 279, column: 18, scope: !778)
!778 = !DILexicalBlockFile(scope: !774, file: !338, discriminator: 1)
!779 = !DILocation(line: 279, column: 21, scope: !778)
!780 = !DILocation(line: 279, column: 6, scope: !778)
!781 = !DILocation(line: 280, column: 3, scope: !774)
!782 = !DILocation(line: 282, column: 12, scope: !754)
!783 = !DILocation(line: 282, column: 16, scope: !754)
!784 = !DILocation(line: 282, column: 31, scope: !754)
!785 = !DILocation(line: 282, column: 24, scope: !754)
!786 = !DILocation(line: 282, column: 6, scope: !771)
!787 = !DILocation(line: 282, column: 4, scope: !754)
!788 = !DILocation(line: 283, column: 6, scope: !789)
!789 = distinct !DILexicalBlock(scope: !754, file: !338, line: 283, column: 6)
!790 = !DILocation(line: 283, column: 26, scope: !789)
!791 = !DILocation(line: 283, column: 19, scope: !789)
!792 = !DILocation(line: 283, column: 8, scope: !789)
!793 = !DILocation(line: 283, column: 6, scope: !754)
!794 = !DILocation(line: 284, column: 3, scope: !789)
!795 = !DILocation(line: 286, column: 13, scope: !754)
!796 = !DILocation(line: 286, column: 7, scope: !754)
!797 = !DILocation(line: 286, column: 5, scope: !754)
!798 = !DILocation(line: 287, column: 6, scope: !799)
!799 = distinct !DILexicalBlock(scope: !754, file: !338, line: 287, column: 6)
!800 = !DILocation(line: 287, column: 9, scope: !799)
!801 = !DILocation(line: 287, column: 6, scope: !754)
!802 = !DILocation(line: 288, column: 3, scope: !799)
!803 = !DILocation(line: 290, column: 13, scope: !754)
!804 = !DILocation(line: 290, column: 31, scope: !754)
!805 = !DILocation(line: 290, column: 25, scope: !754)
!806 = !DILocation(line: 290, column: 44, scope: !754)
!807 = !DILocation(line: 290, column: 7, scope: !771)
!808 = !DILocation(line: 290, column: 5, scope: !754)
!809 = !DILocation(line: 291, column: 6, scope: !810)
!810 = distinct !DILexicalBlock(scope: !754, file: !338, line: 291, column: 6)
!811 = !DILocation(line: 291, column: 9, scope: !810)
!812 = !DILocation(line: 291, column: 6, scope: !754)
!813 = !DILocation(line: 292, column: 3, scope: !810)
!814 = !DILocation(line: 294, column: 2, scope: !754)
!815 = !DILocation(line: 295, column: 1, scope: !754)
!816 = distinct !DISubprogram(name: "sys_pidf_close", scope: !338, file: !338, line: 301, type: !817, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !291, !358}
!819 = !DILocalVariable(name: "fd", arg: 1, scope: !816, file: !338, line: 301, type: !291)
!820 = !DILocation(line: 301, column: 20, scope: !816)
!821 = !DILocalVariable(name: "fn", arg: 2, scope: !816, file: !338, line: 301, type: !358)
!822 = !DILocation(line: 301, column: 36, scope: !816)
!823 = !DILocation(line: 303, column: 9, scope: !816)
!824 = !DILocation(line: 303, column: 2, scope: !816)
!825 = !DILocation(line: 304, column: 8, scope: !816)
!826 = !DILocation(line: 304, column: 2, scope: !816)
!827 = !DILocation(line: 305, column: 1, scope: !816)
!828 = !DILocalVariable(name: "uid", arg: 1, scope: !337, file: !338, line: 312, type: !342)
!829 = !DILocation(line: 312, column: 20, scope: !337)
!830 = !DILocation(line: 316, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !337, file: !338, line: 316, column: 6)
!832 = !DILocation(line: 316, column: 6, scope: !337)
!833 = !DILocation(line: 318, column: 18, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !338, line: 318, column: 7)
!835 = distinct !DILexicalBlock(scope: !831, file: !338, line: 316, column: 16)
!836 = !DILocation(line: 318, column: 16, scope: !834)
!837 = !DILocation(line: 318, column: 48, scope: !834)
!838 = !DILocation(line: 318, column: 7, scope: !835)
!839 = !DILocation(line: 319, column: 12, scope: !840)
!840 = distinct !DILexicalBlock(scope: !834, file: !338, line: 318, column: 55)
!841 = !DILocation(line: 320, column: 3, scope: !840)
!842 = !DILocation(line: 321, column: 2, scope: !835)
!843 = !DILocalVariable(name: "buf", scope: !337, file: !338, line: 323, type: !341)
!844 = !DILocation(line: 323, column: 8, scope: !337)
!845 = !DILocalVariable(name: "newbuf", scope: !337, file: !338, line: 323, type: !341)
!846 = !DILocation(line: 323, column: 14, scope: !337)
!847 = !DILocalVariable(name: "pwd", scope: !337, file: !338, line: 324, type: !369)
!848 = !DILocation(line: 324, column: 16, scope: !337)
!849 = !DILocalVariable(name: "result", scope: !337, file: !338, line: 324, type: !368)
!850 = !DILocation(line: 324, column: 22, scope: !337)
!851 = !DILocalVariable(name: "rv", scope: !337, file: !338, line: 325, type: !291)
!852 = !DILocation(line: 325, column: 6, scope: !337)
!853 = !DILocalVariable(name: "name", scope: !337, file: !338, line: 326, type: !341)
!854 = !DILocation(line: 326, column: 8, scope: !337)
!855 = !DILocation(line: 328, column: 21, scope: !856)
!856 = distinct !DILexicalBlock(scope: !337, file: !338, line: 328, column: 6)
!857 = !DILocation(line: 328, column: 14, scope: !856)
!858 = !DILocation(line: 328, column: 12, scope: !856)
!859 = !DILocation(line: 328, column: 6, scope: !337)
!860 = !DILocation(line: 329, column: 3, scope: !856)
!861 = !DILocation(line: 331, column: 2, scope: !337)
!862 = distinct !{!862, !861}
!863 = !DILocation(line: 332, column: 19, scope: !864)
!864 = distinct !DILexicalBlock(scope: !337, file: !338, line: 331, column: 5)
!865 = !DILocation(line: 332, column: 30, scope: !864)
!866 = !DILocation(line: 332, column: 35, scope: !864)
!867 = !DILocation(line: 332, column: 8, scope: !864)
!868 = !DILocation(line: 332, column: 6, scope: !864)
!869 = !DILocation(line: 333, column: 7, scope: !870)
!870 = distinct !DILexicalBlock(scope: !864, file: !338, line: 333, column: 7)
!871 = !DILocation(line: 333, column: 10, scope: !870)
!872 = !DILocation(line: 333, column: 7, scope: !864)
!873 = !DILocation(line: 334, column: 8, scope: !874)
!874 = distinct !DILexicalBlock(scope: !875, file: !338, line: 334, column: 8)
!875 = distinct !DILexicalBlock(scope: !870, file: !338, line: 333, column: 16)
!876 = !DILocation(line: 334, column: 8, scope: !875)
!877 = !DILocation(line: 335, column: 23, scope: !878)
!878 = distinct !DILexicalBlock(scope: !874, file: !338, line: 334, column: 16)
!879 = !DILocation(line: 335, column: 12, scope: !878)
!880 = !DILocation(line: 335, column: 10, scope: !878)
!881 = !DILocation(line: 336, column: 10, scope: !878)
!882 = !DILocation(line: 336, column: 5, scope: !878)
!883 = !DILocation(line: 337, column: 12, scope: !878)
!884 = !DILocation(line: 337, column: 5, scope: !878)
!885 = !DILocation(line: 339, column: 9, scope: !875)
!886 = !DILocation(line: 339, column: 4, scope: !875)
!887 = !DILocation(line: 342, column: 44, scope: !888)
!888 = distinct !DILexicalBlock(scope: !875, file: !338, line: 342, column: 8)
!889 = !DILocation(line: 342, column: 32, scope: !888)
!890 = !DILocation(line: 342, column: 8, scope: !888)
!891 = !DILocation(line: 342, column: 49, scope: !888)
!892 = !DILocation(line: 342, column: 8, scope: !875)
!893 = !DILocation(line: 343, column: 5, scope: !894)
!894 = distinct !DILexicalBlock(scope: !888, file: !338, line: 342, column: 54)
!895 = !DILocation(line: 345, column: 11, scope: !875)
!896 = !DILocation(line: 345, column: 4, scope: !875)
!897 = !DILocation(line: 347, column: 11, scope: !864)
!898 = !DILocation(line: 348, column: 26, scope: !899)
!899 = distinct !DILexicalBlock(scope: !864, file: !338, line: 348, column: 7)
!900 = !DILocation(line: 348, column: 31, scope: !899)
!901 = !DILocation(line: 348, column: 18, scope: !899)
!902 = !DILocation(line: 348, column: 16, scope: !899)
!903 = !DILocation(line: 348, column: 7, scope: !864)
!904 = !DILocation(line: 349, column: 9, scope: !905)
!905 = distinct !DILexicalBlock(scope: !899, file: !338, line: 348, column: 42)
!906 = !DILocation(line: 349, column: 4, scope: !905)
!907 = !DILocation(line: 350, column: 4, scope: !905)
!908 = !DILocation(line: 352, column: 9, scope: !864)
!909 = !DILocation(line: 352, column: 7, scope: !864)
!910 = !DILocation(line: 353, column: 2, scope: !864)
!911 = !DILocation(line: 353, column: 11, scope: !912)
!912 = !DILexicalBlockFile(scope: !337, file: !338, discriminator: 1)
!913 = !DILocation(line: 353, column: 14, scope: !912)
!914 = !DILocation(line: 353, column: 2, scope: !912)
!915 = !DILocation(line: 355, column: 7, scope: !337)
!916 = !DILocation(line: 355, column: 2, scope: !337)
!917 = !DILocation(line: 356, column: 61, scope: !337)
!918 = !DILocation(line: 356, column: 52, scope: !337)
!919 = !DILocation(line: 356, column: 66, scope: !337)
!920 = !DILocation(line: 356, column: 2, scope: !912)
!921 = !DILocation(line: 357, column: 2, scope: !337)
!922 = !DILocation(line: 358, column: 1, scope: !337)
!923 = !DILocalVariable(name: "gid", arg: 1, scope: !346, file: !338, line: 365, type: !349)
!924 = !DILocation(line: 365, column: 21, scope: !346)
!925 = !DILocation(line: 369, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !346, file: !338, line: 369, column: 6)
!927 = !DILocation(line: 369, column: 6, scope: !346)
!928 = !DILocation(line: 371, column: 18, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !338, line: 371, column: 7)
!930 = distinct !DILexicalBlock(scope: !926, file: !338, line: 369, column: 16)
!931 = !DILocation(line: 371, column: 16, scope: !929)
!932 = !DILocation(line: 371, column: 48, scope: !929)
!933 = !DILocation(line: 371, column: 7, scope: !930)
!934 = !DILocation(line: 372, column: 12, scope: !935)
!935 = distinct !DILexicalBlock(scope: !929, file: !338, line: 371, column: 55)
!936 = !DILocation(line: 373, column: 3, scope: !935)
!937 = !DILocation(line: 374, column: 2, scope: !930)
!938 = !DILocalVariable(name: "buf", scope: !346, file: !338, line: 376, type: !341)
!939 = !DILocation(line: 376, column: 8, scope: !346)
!940 = !DILocalVariable(name: "newbuf", scope: !346, file: !338, line: 376, type: !341)
!941 = !DILocation(line: 376, column: 14, scope: !346)
!942 = !DILocalVariable(name: "grp", scope: !346, file: !338, line: 377, type: !382)
!943 = !DILocation(line: 377, column: 15, scope: !346)
!944 = !DILocalVariable(name: "result", scope: !346, file: !338, line: 377, type: !381)
!945 = !DILocation(line: 377, column: 21, scope: !346)
!946 = !DILocalVariable(name: "rv", scope: !346, file: !338, line: 378, type: !291)
!947 = !DILocation(line: 378, column: 6, scope: !346)
!948 = !DILocalVariable(name: "name", scope: !346, file: !338, line: 379, type: !341)
!949 = !DILocation(line: 379, column: 8, scope: !346)
!950 = !DILocation(line: 381, column: 21, scope: !951)
!951 = distinct !DILexicalBlock(scope: !346, file: !338, line: 381, column: 6)
!952 = !DILocation(line: 381, column: 14, scope: !951)
!953 = !DILocation(line: 381, column: 12, scope: !951)
!954 = !DILocation(line: 381, column: 6, scope: !346)
!955 = !DILocation(line: 382, column: 3, scope: !951)
!956 = !DILocation(line: 384, column: 2, scope: !346)
!957 = distinct !{!957, !956}
!958 = !DILocation(line: 385, column: 19, scope: !959)
!959 = distinct !DILexicalBlock(scope: !346, file: !338, line: 384, column: 5)
!960 = !DILocation(line: 385, column: 30, scope: !959)
!961 = !DILocation(line: 385, column: 35, scope: !959)
!962 = !DILocation(line: 385, column: 8, scope: !959)
!963 = !DILocation(line: 385, column: 6, scope: !959)
!964 = !DILocation(line: 386, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !959, file: !338, line: 386, column: 7)
!966 = !DILocation(line: 386, column: 10, scope: !965)
!967 = !DILocation(line: 386, column: 7, scope: !959)
!968 = !DILocation(line: 387, column: 8, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !338, line: 387, column: 8)
!970 = distinct !DILexicalBlock(scope: !965, file: !338, line: 386, column: 16)
!971 = !DILocation(line: 387, column: 8, scope: !970)
!972 = !DILocation(line: 388, column: 23, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !338, line: 387, column: 16)
!974 = !DILocation(line: 388, column: 12, scope: !973)
!975 = !DILocation(line: 388, column: 10, scope: !973)
!976 = !DILocation(line: 389, column: 10, scope: !973)
!977 = !DILocation(line: 389, column: 5, scope: !973)
!978 = !DILocation(line: 390, column: 12, scope: !973)
!979 = !DILocation(line: 390, column: 5, scope: !973)
!980 = !DILocation(line: 392, column: 9, scope: !970)
!981 = !DILocation(line: 392, column: 4, scope: !970)
!982 = !DILocation(line: 395, column: 44, scope: !983)
!983 = distinct !DILexicalBlock(scope: !970, file: !338, line: 395, column: 8)
!984 = !DILocation(line: 395, column: 32, scope: !983)
!985 = !DILocation(line: 395, column: 8, scope: !983)
!986 = !DILocation(line: 395, column: 49, scope: !983)
!987 = !DILocation(line: 395, column: 8, scope: !970)
!988 = !DILocation(line: 396, column: 5, scope: !989)
!989 = distinct !DILexicalBlock(scope: !983, file: !338, line: 395, column: 54)
!990 = !DILocation(line: 398, column: 11, scope: !970)
!991 = !DILocation(line: 398, column: 4, scope: !970)
!992 = !DILocation(line: 400, column: 11, scope: !959)
!993 = !DILocation(line: 401, column: 26, scope: !994)
!994 = distinct !DILexicalBlock(scope: !959, file: !338, line: 401, column: 7)
!995 = !DILocation(line: 401, column: 31, scope: !994)
!996 = !DILocation(line: 401, column: 18, scope: !994)
!997 = !DILocation(line: 401, column: 16, scope: !994)
!998 = !DILocation(line: 401, column: 7, scope: !959)
!999 = !DILocation(line: 402, column: 9, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !994, file: !338, line: 401, column: 42)
!1001 = !DILocation(line: 402, column: 4, scope: !1000)
!1002 = !DILocation(line: 403, column: 4, scope: !1000)
!1003 = !DILocation(line: 405, column: 9, scope: !959)
!1004 = !DILocation(line: 405, column: 7, scope: !959)
!1005 = !DILocation(line: 406, column: 2, scope: !959)
!1006 = !DILocation(line: 406, column: 11, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !346, file: !338, discriminator: 1)
!1008 = !DILocation(line: 406, column: 14, scope: !1007)
!1009 = !DILocation(line: 406, column: 2, scope: !1007)
!1010 = !DILocation(line: 408, column: 7, scope: !346)
!1011 = !DILocation(line: 408, column: 2, scope: !346)
!1012 = !DILocation(line: 409, column: 61, scope: !346)
!1013 = !DILocation(line: 409, column: 52, scope: !346)
!1014 = !DILocation(line: 409, column: 66, scope: !346)
!1015 = !DILocation(line: 409, column: 2, scope: !1007)
!1016 = !DILocation(line: 410, column: 2, scope: !346)
!1017 = !DILocation(line: 411, column: 1, scope: !346)
!1018 = distinct !DISubprogram(name: "sys_get_af", scope: !338, file: !338, line: 417, type: !627, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1019 = !DILocalVariable(name: "addr", arg: 1, scope: !1018, file: !338, line: 417, type: !358)
!1020 = !DILocation(line: 417, column: 24, scope: !1018)
!1021 = !DILocation(line: 419, column: 13, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1018, file: !338, line: 419, column: 6)
!1023 = !DILocation(line: 419, column: 6, scope: !1022)
!1024 = !DILocation(line: 419, column: 6, scope: !1018)
!1025 = !DILocation(line: 420, column: 3, scope: !1022)
!1026 = !DILocation(line: 421, column: 20, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !338, line: 421, column: 11)
!1028 = !DILocation(line: 421, column: 12, scope: !1027)
!1029 = !DILocation(line: 421, column: 11, scope: !1022)
!1030 = !DILocation(line: 424, column: 3, scope: !1027)
!1031 = !DILocation(line: 426, column: 3, scope: !1027)
!1032 = !DILocation(line: 427, column: 1, scope: !1018)
!1033 = distinct !DISubprogram(name: "sys_sockaddr_parse", scope: !338, file: !338, line: 435, type: !1034, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!291, !1036, !1045, !341, !341, !291, !291}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !263, line: 166, size: 1024, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !1037, file: !263, line: 168, baseType: !317, size: 16, align: 16)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !1037, file: !263, line: 169, baseType: !1041, size: 944, align: 8, offset: 16)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 944, align: 8, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 118)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !1037, file: !263, line: 170, baseType: !300, size: 64, align: 64, offset: 960)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !263, line: 33, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !295, line: 189, baseType: !334)
!1048 = !DILocalVariable(name: "addr", arg: 1, scope: !1033, file: !338, line: 435, type: !1036)
!1049 = !DILocation(line: 435, column: 45, scope: !1033)
!1050 = !DILocalVariable(name: "addrlen", arg: 2, scope: !1033, file: !338, line: 435, type: !1045)
!1051 = !DILocation(line: 435, column: 62, scope: !1033)
!1052 = !DILocalVariable(name: "naddr", arg: 3, scope: !1033, file: !338, line: 436, type: !341)
!1053 = !DILocation(line: 436, column: 26, scope: !1033)
!1054 = !DILocalVariable(name: "nport", arg: 4, scope: !1033, file: !338, line: 436, type: !341)
!1055 = !DILocation(line: 436, column: 39, scope: !1033)
!1056 = !DILocalVariable(name: "af", arg: 5, scope: !1033, file: !338, line: 436, type: !291)
!1057 = !DILocation(line: 436, column: 50, scope: !1033)
!1058 = !DILocalVariable(name: "flags", arg: 6, scope: !1033, file: !338, line: 436, type: !291)
!1059 = !DILocation(line: 436, column: 58, scope: !1033)
!1060 = !DILocalVariable(name: "hints", scope: !1033, file: !338, line: 438, type: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !1062, line: 567, size: 384, align: 64, elements: !1063)
!1062 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !1061, file: !1062, line: 569, baseType: !291, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !1061, file: !1062, line: 570, baseType: !291, size: 32, align: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !1061, file: !1062, line: 571, baseType: !291, size: 32, align: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !1061, file: !1062, line: 572, baseType: !291, size: 32, align: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !1061, file: !1062, line: 573, baseType: !1046, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !1061, file: !1062, line: 574, baseType: !313, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !1061, file: !1062, line: 575, baseType: !341, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !1061, file: !1062, line: 576, baseType: !1072, size: 64, align: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1073 = !DILocation(line: 438, column: 24, scope: !1033)
!1074 = !DILocalVariable(name: "ai", scope: !1033, file: !338, line: 439, type: !1072)
!1075 = !DILocation(line: 439, column: 25, scope: !1033)
!1076 = !DILocalVariable(name: "rv", scope: !1033, file: !338, line: 440, type: !291)
!1077 = !DILocation(line: 440, column: 6, scope: !1033)
!1078 = !DILocation(line: 442, column: 2, scope: !1033)
!1079 = !DILocation(line: 443, column: 20, scope: !1033)
!1080 = !DILocation(line: 443, column: 8, scope: !1033)
!1081 = !DILocation(line: 443, column: 18, scope: !1033)
!1082 = !DILocation(line: 444, column: 8, scope: !1033)
!1083 = !DILocation(line: 444, column: 20, scope: !1033)
!1084 = !DILocation(line: 445, column: 8, scope: !1033)
!1085 = !DILocation(line: 445, column: 20, scope: !1033)
!1086 = !DILocation(line: 446, column: 41, scope: !1033)
!1087 = !DILocation(line: 446, column: 39, scope: !1033)
!1088 = !DILocation(line: 446, column: 8, scope: !1033)
!1089 = !DILocation(line: 446, column: 17, scope: !1033)
!1090 = !DILocation(line: 447, column: 26, scope: !1033)
!1091 = !DILocation(line: 447, column: 33, scope: !1033)
!1092 = !DILocation(line: 447, column: 7, scope: !1033)
!1093 = !DILocation(line: 447, column: 5, scope: !1033)
!1094 = !DILocation(line: 448, column: 6, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1033, file: !338, line: 448, column: 6)
!1096 = !DILocation(line: 448, column: 9, scope: !1095)
!1097 = !DILocation(line: 448, column: 6, scope: !1033)
!1098 = !DILocation(line: 450, column: 18, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !338, line: 448, column: 15)
!1100 = !DILocation(line: 450, column: 25, scope: !1099)
!1101 = !DILocation(line: 450, column: 45, scope: !1099)
!1102 = !DILocation(line: 450, column: 32, scope: !1099)
!1103 = !DILocation(line: 449, column: 3, scope: !1099)
!1104 = !DILocation(line: 451, column: 3, scope: !1099)
!1105 = !DILocation(line: 453, column: 9, scope: !1033)
!1106 = !DILocation(line: 453, column: 2, scope: !1033)
!1107 = !DILocation(line: 453, column: 15, scope: !1033)
!1108 = !DILocation(line: 453, column: 19, scope: !1033)
!1109 = !DILocation(line: 453, column: 28, scope: !1033)
!1110 = !DILocation(line: 453, column: 32, scope: !1033)
!1111 = !DILocation(line: 454, column: 13, scope: !1033)
!1112 = !DILocation(line: 454, column: 17, scope: !1033)
!1113 = !DILocation(line: 454, column: 3, scope: !1033)
!1114 = !DILocation(line: 454, column: 11, scope: !1033)
!1115 = !DILocation(line: 455, column: 7, scope: !1033)
!1116 = !DILocation(line: 455, column: 11, scope: !1033)
!1117 = !DILocation(line: 455, column: 5, scope: !1033)
!1118 = !DILocation(line: 456, column: 15, scope: !1033)
!1119 = !DILocation(line: 456, column: 2, scope: !1033)
!1120 = !DILocation(line: 457, column: 9, scope: !1033)
!1121 = !DILocation(line: 457, column: 2, scope: !1033)
!1122 = !DILocation(line: 458, column: 1, scope: !1033)
!1123 = distinct !DISubprogram(name: "sys_sockaddr_str", scope: !338, file: !338, line: 469, type: !1124, isLocal: false, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!291, !313, !1046, !389, !389}
!1126 = !DILocalVariable(name: "addr", arg: 1, scope: !1123, file: !338, line: 469, type: !313)
!1127 = !DILocation(line: 469, column: 35, scope: !1123)
!1128 = !DILocalVariable(name: "addrlen", arg: 2, scope: !1123, file: !338, line: 469, type: !1046)
!1129 = !DILocation(line: 469, column: 51, scope: !1123)
!1130 = !DILocalVariable(name: "host", arg: 3, scope: !1123, file: !338, line: 470, type: !389)
!1131 = !DILocation(line: 470, column: 25, scope: !1123)
!1132 = !DILocalVariable(name: "serv", arg: 4, scope: !1123, file: !338, line: 470, type: !389)
!1133 = !DILocation(line: 470, column: 38, scope: !1123)
!1134 = !DILocalVariable(name: "tmphost", scope: !1123, file: !338, line: 472, type: !1135)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 368, align: 8, elements: !1136)
!1136 = !{!1137}
!1137 = !DISubrange(count: 46)
!1138 = !DILocation(line: 472, column: 7, scope: !1123)
!1139 = !DILocalVariable(name: "rv", scope: !1123, file: !338, line: 473, type: !291)
!1140 = !DILocation(line: 473, column: 6, scope: !1123)
!1141 = !DILocalVariable(name: "hostsz", scope: !1123, file: !338, line: 474, type: !298)
!1142 = !DILocation(line: 474, column: 9, scope: !1123)
!1143 = !DILocation(line: 476, column: 10, scope: !1123)
!1144 = !DILocation(line: 476, column: 3, scope: !1123)
!1145 = !DILocation(line: 476, column: 8, scope: !1123)
!1146 = !DILocation(line: 477, column: 8, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1123, file: !338, line: 477, column: 6)
!1148 = !DILocation(line: 477, column: 7, scope: !1147)
!1149 = !DILocation(line: 477, column: 6, scope: !1123)
!1150 = !DILocation(line: 478, column: 3, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1147, file: !338, line: 477, column: 14)
!1152 = !DILocation(line: 479, column: 3, scope: !1151)
!1153 = !DILocation(line: 481, column: 19, scope: !1123)
!1154 = !DILocation(line: 481, column: 25, scope: !1123)
!1155 = !DILocation(line: 482, column: 19, scope: !1123)
!1156 = !DILocation(line: 483, column: 20, scope: !1123)
!1157 = !DILocation(line: 483, column: 19, scope: !1123)
!1158 = !DILocation(line: 481, column: 7, scope: !1123)
!1159 = !DILocation(line: 481, column: 5, scope: !1123)
!1160 = !DILocation(line: 485, column: 6, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1123, file: !338, line: 485, column: 6)
!1162 = !DILocation(line: 485, column: 9, scope: !1161)
!1163 = !DILocation(line: 485, column: 6, scope: !1123)
!1164 = !DILocation(line: 487, column: 31, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !338, line: 485, column: 15)
!1166 = !DILocation(line: 487, column: 18, scope: !1165)
!1167 = !DILocation(line: 486, column: 3, scope: !1165)
!1168 = !DILocation(line: 488, column: 9, scope: !1165)
!1169 = !DILocation(line: 488, column: 8, scope: !1165)
!1170 = !DILocation(line: 488, column: 3, scope: !1165)
!1171 = !DILocation(line: 489, column: 3, scope: !1165)
!1172 = !DILocation(line: 491, column: 18, scope: !1123)
!1173 = !DILocation(line: 491, column: 11, scope: !1123)
!1174 = !DILocation(line: 491, column: 27, scope: !1123)
!1175 = !DILocation(line: 491, column: 9, scope: !1123)
!1176 = !DILocation(line: 492, column: 17, scope: !1123)
!1177 = !DILocation(line: 492, column: 10, scope: !1123)
!1178 = !DILocation(line: 492, column: 3, scope: !1123)
!1179 = !DILocation(line: 492, column: 8, scope: !1123)
!1180 = !DILocation(line: 493, column: 8, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1123, file: !338, line: 493, column: 6)
!1182 = !DILocation(line: 493, column: 7, scope: !1181)
!1183 = !DILocation(line: 493, column: 6, scope: !1123)
!1184 = !DILocation(line: 494, column: 3, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !338, line: 493, column: 14)
!1186 = !DILocation(line: 495, column: 9, scope: !1185)
!1187 = !DILocation(line: 495, column: 8, scope: !1185)
!1188 = !DILocation(line: 495, column: 3, scope: !1185)
!1189 = !DILocation(line: 496, column: 3, scope: !1185)
!1190 = !DILocation(line: 498, column: 10, scope: !1123)
!1191 = !DILocation(line: 498, column: 9, scope: !1123)
!1192 = !DILocation(line: 498, column: 2, scope: !1123)
!1193 = !DILocation(line: 498, column: 25, scope: !1123)
!1194 = !DILocation(line: 499, column: 2, scope: !1123)
!1195 = !DILocation(line: 500, column: 1, scope: !1123)
!1196 = distinct !DISubprogram(name: "sys_ip46str_sanitize", scope: !338, file: !338, line: 514, type: !1197, isLocal: false, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!341, !358}
!1199 = !DILocalVariable(name: "s", arg: 1, scope: !1196, file: !338, line: 514, type: !358)
!1200 = !DILocation(line: 514, column: 34, scope: !1196)
!1201 = !DILocalVariable(name: "copy", scope: !1196, file: !338, line: 516, type: !341)
!1202 = !DILocation(line: 516, column: 8, scope: !1196)
!1203 = !DILocalVariable(name: "p", scope: !1196, file: !338, line: 516, type: !341)
!1204 = !DILocation(line: 516, column: 15, scope: !1196)
!1205 = !DILocation(line: 518, column: 16, scope: !1196)
!1206 = !DILocation(line: 518, column: 9, scope: !1196)
!1207 = !DILocation(line: 518, column: 7, scope: !1196)
!1208 = !DILocation(line: 519, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1196, file: !338, line: 519, column: 6)
!1210 = !DILocation(line: 519, column: 6, scope: !1196)
!1211 = !DILocation(line: 520, column: 3, scope: !1209)
!1212 = !DILocation(line: 521, column: 6, scope: !1196)
!1213 = !DILocation(line: 521, column: 4, scope: !1196)
!1214 = !DILocation(line: 522, column: 2, scope: !1196)
!1215 = !DILocation(line: 522, column: 10, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1196, file: !338, discriminator: 1)
!1217 = !DILocation(line: 522, column: 9, scope: !1216)
!1218 = !DILocation(line: 522, column: 2, scope: !1216)
!1219 = !DILocation(line: 523, column: 12, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1196, file: !338, line: 522, column: 13)
!1221 = !DILocation(line: 523, column: 11, scope: !1220)
!1222 = !DILocation(line: 523, column: 3, scope: !1220)
!1223 = !DILocation(line: 526, column: 5, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1220, file: !338, line: 523, column: 15)
!1225 = !DILocation(line: 526, column: 7, scope: !1224)
!1226 = !DILocation(line: 527, column: 4, scope: !1224)
!1227 = !DILocation(line: 529, column: 4, scope: !1220)
!1228 = !DILocation(line: 522, column: 2, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1196, file: !338, discriminator: 2)
!1230 = distinct !{!1230, !1214}
!1231 = !DILocation(line: 532, column: 9, scope: !1196)
!1232 = !DILocation(line: 532, column: 2, scope: !1196)
!1233 = !DILocation(line: 533, column: 1, scope: !1196)
!1234 = distinct !DISubprogram(name: "sys_get_mtu", scope: !338, file: !338, line: 539, type: !1235, isLocal: false, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!298, !358}
!1237 = !DILocalVariable(name: "ifname", arg: 1, scope: !1234, file: !338, line: 539, type: !358)
!1238 = !DILocation(line: 539, column: 25, scope: !1234)
!1239 = !DILocalVariable(name: "ifr", scope: !1234, file: !338, line: 541, type: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !1241, line: 126, size: 320, align: 64, elements: !1242)
!1241 = !DIFile(filename: "/usr/include/net/if.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1242 = !{!1243, !1247}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !1240, file: !1241, line: 133, baseType: !1244, size: 128, align: 8)
!1244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1240, file: !1241, line: 130, size: 128, align: 8, elements: !1245)
!1245 = !{!1246}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !1244, file: !1241, line: 132, baseType: !760, size: 128, align: 8)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !1240, file: !1241, line: 149, baseType: !1248, size: 192, align: 64, offset: 128)
!1248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1240, file: !1241, line: 135, size: 192, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1257, !1258, !1259, !1268, !1269, !1270}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !1248, file: !1241, line: 137, baseType: !314, size: 128, align: 16)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !1248, file: !1241, line: 138, baseType: !314, size: 128, align: 16)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !1248, file: !1241, line: 139, baseType: !314, size: 128, align: 16)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !1248, file: !1241, line: 140, baseType: !314, size: 128, align: 16)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !1248, file: !1241, line: 141, baseType: !314, size: 128, align: 16)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !1248, file: !1241, line: 142, baseType: !1256, size: 16, align: 16)
!1256 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !1248, file: !1241, line: 143, baseType: !291, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !1248, file: !1241, line: 144, baseType: !291, size: 32, align: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !1248, file: !1241, line: 145, baseType: !1260, size: 192, align: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !1241, line: 111, size: 192, align: 64, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !1260, file: !1241, line: 113, baseType: !300, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !1260, file: !1241, line: 114, baseType: !300, size: 64, align: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !1260, file: !1241, line: 115, baseType: !319, size: 16, align: 16, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1260, file: !1241, line: 116, baseType: !309, size: 8, align: 8, offset: 144)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !1260, file: !1241, line: 117, baseType: !309, size: 8, align: 8, offset: 152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1260, file: !1241, line: 118, baseType: !309, size: 8, align: 8, offset: 160)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !1248, file: !1241, line: 146, baseType: !760, size: 128, align: 8)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !1248, file: !1241, line: 147, baseType: !760, size: 128, align: 8)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !1248, file: !1241, line: 148, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !295, line: 183, baseType: !341)
!1272 = !DILocation(line: 541, column: 15, scope: !1234)
!1273 = !DILocalVariable(name: "ifnamelen", scope: !1234, file: !338, line: 542, type: !298)
!1274 = !DILocation(line: 542, column: 9, scope: !1234)
!1275 = !DILocalVariable(name: "s", scope: !1234, file: !338, line: 543, type: !291)
!1276 = !DILocation(line: 543, column: 6, scope: !1234)
!1277 = !DILocation(line: 545, column: 21, scope: !1234)
!1278 = !DILocation(line: 545, column: 14, scope: !1234)
!1279 = !DILocation(line: 545, column: 12, scope: !1234)
!1280 = !DILocation(line: 546, column: 6, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1234, file: !338, line: 546, column: 6)
!1282 = !DILocation(line: 546, column: 16, scope: !1281)
!1283 = !DILocation(line: 546, column: 6, scope: !1234)
!1284 = !DILocation(line: 547, column: 3, scope: !1281)
!1285 = !DILocation(line: 548, column: 12, scope: !1234)
!1286 = !DILocation(line: 548, column: 21, scope: !1234)
!1287 = !DILocation(line: 548, column: 2, scope: !1234)
!1288 = !DILocation(line: 548, column: 22, scope: !1234)
!1289 = !DILocation(line: 548, column: 30, scope: !1234)
!1290 = !DILocation(line: 549, column: 14, scope: !1234)
!1291 = !DILocation(line: 549, column: 5, scope: !1234)
!1292 = !DILocation(line: 549, column: 2, scope: !1234)
!1293 = !DILocation(line: 549, column: 25, scope: !1234)
!1294 = !DILocation(line: 551, column: 6, scope: !1234)
!1295 = !DILocation(line: 551, column: 4, scope: !1234)
!1296 = !DILocation(line: 552, column: 6, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1234, file: !338, line: 552, column: 6)
!1298 = !DILocation(line: 552, column: 8, scope: !1297)
!1299 = !DILocation(line: 552, column: 6, scope: !1234)
!1300 = !DILocation(line: 553, column: 3, scope: !1297)
!1301 = !DILocation(line: 554, column: 12, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1234, file: !338, line: 554, column: 6)
!1303 = !DILocation(line: 554, column: 6, scope: !1302)
!1304 = !DILocation(line: 554, column: 32, scope: !1302)
!1305 = !DILocation(line: 554, column: 6, scope: !1234)
!1306 = !DILocation(line: 555, column: 9, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1302, file: !338, line: 554, column: 39)
!1308 = !DILocation(line: 555, column: 3, scope: !1307)
!1309 = !DILocation(line: 556, column: 3, scope: !1307)
!1310 = !DILocation(line: 558, column: 8, scope: !1234)
!1311 = !DILocation(line: 558, column: 2, scope: !1234)
!1312 = !DILocation(line: 559, column: 12, scope: !1234)
!1313 = !DILocation(line: 559, column: 21, scope: !1234)
!1314 = !DILocation(line: 559, column: 9, scope: !1234)
!1315 = !DILocation(line: 559, column: 2, scope: !1234)
!1316 = !DILocation(line: 560, column: 1, scope: !1234)
!1317 = distinct !DISubprogram(name: "sys_isdir", scope: !338, file: !338, line: 567, type: !627, isLocal: false, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1318 = !DILocalVariable(name: "path", arg: 1, scope: !1317, file: !338, line: 567, type: !358)
!1319 = !DILocation(line: 567, column: 23, scope: !1317)
!1320 = !DILocalVariable(name: "s", scope: !1317, file: !338, line: 569, type: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1322, line: 46, size: 1152, align: 64, elements: !1323)
!1322 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1323 = !{!1324, !1326, !1328, !1330, !1332, !1333, !1334, !1335, !1336, !1338, !1340, !1342, !1350, !1351, !1352}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1321, file: !1322, line: 48, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !295, line: 124, baseType: !300)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1321, file: !1322, line: 53, baseType: !1327, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !295, line: 127, baseType: !300)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1321, file: !1322, line: 61, baseType: !1329, size: 64, align: 64, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !295, line: 130, baseType: !300)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1321, file: !1322, line: 62, baseType: !1331, size: 32, align: 32, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !295, line: 129, baseType: !334)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1321, file: !1322, line: 64, baseType: !343, size: 32, align: 32, offset: 224)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1321, file: !1322, line: 65, baseType: !350, size: 32, align: 32, offset: 256)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1321, file: !1322, line: 67, baseType: !291, size: 32, align: 32, offset: 288)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1321, file: !1322, line: 69, baseType: !1325, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1321, file: !1322, line: 74, baseType: !1337, size: 64, align: 64, offset: 384)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !295, line: 131, baseType: !296)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1321, file: !1322, line: 78, baseType: !1339, size: 64, align: 64, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !295, line: 153, baseType: !296)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1321, file: !1322, line: 80, baseType: !1341, size: 64, align: 64, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !295, line: 158, baseType: !296)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1321, file: !1322, line: 91, baseType: !1343, size: 128, align: 64, offset: 576)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1344, line: 120, size: 128, align: 64, elements: !1345)
!1344 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1345 = !{!1346, !1348}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1343, file: !1344, line: 122, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !295, line: 139, baseType: !296)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1343, file: !1344, line: 123, baseType: !1349, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !295, line: 175, baseType: !296)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1321, file: !1322, line: 92, baseType: !1343, size: 128, align: 64, offset: 704)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1321, file: !1322, line: 93, baseType: !1343, size: 128, align: 64, offset: 832)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1321, file: !1322, line: 106, baseType: !1353, size: 192, align: 64, offset: 960)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1349, size: 192, align: 64, elements: !1354)
!1354 = !{!1355}
!1355 = !DISubrange(count: 3)
!1356 = !DILocation(line: 569, column: 14, scope: !1317)
!1357 = !DILocation(line: 571, column: 11, scope: !1358)
!1358 = distinct !DILexicalBlock(scope: !1317, file: !338, line: 571, column: 6)
!1359 = !DILocation(line: 571, column: 6, scope: !1358)
!1360 = !DILocation(line: 571, column: 21, scope: !1358)
!1361 = !DILocation(line: 571, column: 6, scope: !1317)
!1362 = !DILocation(line: 572, column: 8, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1364, file: !338, line: 572, column: 6)
!1364 = distinct !DILexicalBlock(scope: !1358, file: !338, line: 571, column: 28)
!1365 = !DILocation(line: 572, column: 7, scope: !1363)
!1366 = !DILocation(line: 572, column: 12, scope: !1363)
!1367 = !DILocation(line: 572, column: 6, scope: !1364)
!1368 = !DILocation(line: 574, column: 29, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1363, file: !338, line: 572, column: 23)
!1370 = !DILocation(line: 574, column: 28, scope: !1369)
!1371 = !DILocation(line: 574, column: 19, scope: !1372)
!1372 = !DILexicalBlockFile(scope: !1369, file: !338, discriminator: 1)
!1373 = !DILocation(line: 574, column: 37, scope: !1374)
!1374 = !DILexicalBlockFile(scope: !1369, file: !338, discriminator: 2)
!1375 = !DILocation(line: 574, column: 36, scope: !1369)
!1376 = !DILocation(line: 573, column: 4, scope: !1369)
!1377 = !DILocation(line: 575, column: 3, scope: !1369)
!1378 = !DILocation(line: 576, column: 3, scope: !1364)
!1379 = !DILocation(line: 578, column: 8, scope: !1380)
!1380 = distinct !DILexicalBlock(scope: !1317, file: !338, line: 578, column: 6)
!1381 = !DILocation(line: 578, column: 16, scope: !1380)
!1382 = !DILocation(line: 578, column: 6, scope: !1317)
!1383 = !DILocation(line: 579, column: 3, scope: !1380)
!1384 = !DILocation(line: 580, column: 2, scope: !1317)
!1385 = !DILocation(line: 581, column: 1, scope: !1317)
!1386 = distinct !DISubprogram(name: "sys_mkpath", scope: !338, file: !338, line: 589, type: !1387, isLocal: false, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!291, !358, !1389}
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !293, line: 70, baseType: !1331)
!1390 = !DILocalVariable(name: "path", arg: 1, scope: !1386, file: !338, line: 589, type: !358)
!1391 = !DILocation(line: 589, column: 24, scope: !1386)
!1392 = !DILocalVariable(name: "mode", arg: 2, scope: !1386, file: !338, line: 589, type: !1389)
!1393 = !DILocation(line: 589, column: 37, scope: !1386)
!1394 = !DILocation(line: 591, column: 21, scope: !1386)
!1395 = !DILocation(line: 591, column: 14, scope: !1386)
!1396 = !DILocation(line: 591, column: 26, scope: !1386)
!1397 = !DILocation(line: 591, column: 2, scope: !1398)
!1398 = !DILexicalBlockFile(scope: !1386, file: !338, discriminator: 1)
!1399 = !DILocation(line: 591, column: 2, scope: !1386)
!1400 = !DILocalVariable(name: "parent", scope: !1386, file: !338, line: 591, type: !1401)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, align: 8, elements: !310)
!1402 = !DIExpression(DW_OP_deref)
!1403 = !DILocation(line: 591, column: 7, scope: !1386)
!1404 = !DILocalVariable(name: "p", scope: !1386, file: !338, line: 592, type: !341)
!1405 = !DILocation(line: 592, column: 8, scope: !1386)
!1406 = !DILocation(line: 594, column: 17, scope: !1386)
!1407 = !DILocation(line: 594, column: 2, scope: !1386)
!1408 = !DILocation(line: 596, column: 4, scope: !1386)
!1409 = !DILocation(line: 597, column: 2, scope: !1386)
!1410 = distinct !{!1410, !1409}
!1411 = !DILocation(line: 599, column: 3, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1386, file: !338, line: 597, column: 5)
!1413 = !DILocation(line: 599, column: 11, scope: !1414)
!1414 = !DILexicalBlockFile(scope: !1412, file: !338, discriminator: 1)
!1415 = !DILocation(line: 599, column: 10, scope: !1414)
!1416 = !DILocation(line: 599, column: 13, scope: !1414)
!1417 = !DILocation(line: 599, column: 3, scope: !1414)
!1418 = !DILocation(line: 599, column: 22, scope: !1419)
!1419 = !DILexicalBlockFile(scope: !1412, file: !338, discriminator: 2)
!1420 = !DILocation(line: 599, column: 3, scope: !1419)
!1421 = distinct !{!1421, !1411}
!1422 = !DILocation(line: 600, column: 14, scope: !1412)
!1423 = !DILocation(line: 600, column: 7, scope: !1412)
!1424 = !DILocation(line: 600, column: 5, scope: !1412)
!1425 = !DILocation(line: 601, column: 7, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1412, file: !338, line: 601, column: 7)
!1427 = !DILocation(line: 601, column: 7, scope: !1412)
!1428 = !DILocation(line: 604, column: 5, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1426, file: !338, line: 601, column: 10)
!1430 = !DILocation(line: 604, column: 7, scope: !1429)
!1431 = !DILocation(line: 605, column: 3, scope: !1429)
!1432 = !DILocalVariable(name: "sbuf", scope: !1412, file: !338, line: 607, type: !1321)
!1433 = !DILocation(line: 607, column: 15, scope: !1412)
!1434 = !DILocation(line: 608, column: 7, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1412, file: !338, line: 608, column: 7)
!1436 = !DILocation(line: 608, column: 27, scope: !1435)
!1437 = !DILocation(line: 608, column: 7, scope: !1412)
!1438 = !DILocation(line: 609, column: 9, scope: !1439)
!1439 = distinct !DILexicalBlock(scope: !1440, file: !338, line: 609, column: 7)
!1440 = distinct !DILexicalBlock(scope: !1435, file: !338, line: 608, column: 34)
!1441 = !DILocation(line: 609, column: 8, scope: !1439)
!1442 = !DILocation(line: 609, column: 13, scope: !1439)
!1443 = !DILocation(line: 609, column: 7, scope: !1440)
!1444 = !DILocation(line: 610, column: 23, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1446, file: !338, line: 610, column: 9)
!1446 = distinct !DILexicalBlock(scope: !1439, file: !338, line: 609, column: 24)
!1447 = !DILocation(line: 610, column: 9, scope: !1445)
!1448 = !DILocation(line: 610, column: 29, scope: !1445)
!1449 = !DILocation(line: 610, column: 9, scope: !1446)
!1450 = !DILocation(line: 611, column: 6, scope: !1445)
!1451 = !DILocation(line: 612, column: 4, scope: !1446)
!1452 = !DILocation(line: 613, column: 5, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1439, file: !338, line: 612, column: 11)
!1454 = !DILocation(line: 615, column: 3, scope: !1440)
!1455 = !DILocation(line: 615, column: 19, scope: !1456)
!1456 = !DILexicalBlockFile(scope: !1457, file: !338, discriminator: 1)
!1457 = distinct !DILexicalBlock(scope: !1435, file: !338, line: 615, column: 14)
!1458 = !DILocation(line: 615, column: 17, scope: !1456)
!1459 = !DILocation(line: 615, column: 28, scope: !1456)
!1460 = !DILocation(line: 615, column: 14, scope: !1456)
!1461 = !DILocation(line: 616, column: 5, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1457, file: !338, line: 615, column: 37)
!1463 = !DILocation(line: 616, column: 9, scope: !1462)
!1464 = !DILocation(line: 617, column: 4, scope: !1462)
!1465 = !DILocation(line: 620, column: 7, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1412, file: !338, line: 620, column: 7)
!1467 = !DILocation(line: 620, column: 7, scope: !1412)
!1468 = !DILocation(line: 622, column: 5, scope: !1469)
!1469 = distinct !DILexicalBlock(scope: !1466, file: !338, line: 620, column: 10)
!1470 = !DILocation(line: 622, column: 7, scope: !1469)
!1471 = !DILocation(line: 623, column: 5, scope: !1469)
!1472 = !DILocation(line: 624, column: 3, scope: !1469)
!1473 = !DILocation(line: 625, column: 2, scope: !1412)
!1474 = !DILocation(line: 625, column: 11, scope: !1398)
!1475 = !DILocation(line: 625, column: 2, scope: !1398)
!1476 = !DILocation(line: 627, column: 2, scope: !1386)
!1477 = !DILocation(line: 628, column: 1, scope: !1386)
!1478 = distinct !DISubprogram(name: "sys_realdir", scope: !338, file: !338, line: 636, type: !1197, isLocal: false, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1479 = !DILocalVariable(name: "path", arg: 1, scope: !1478, file: !338, line: 636, type: !358)
!1480 = !DILocation(line: 636, column: 25, scope: !1478)
!1481 = !DILocalVariable(name: "sep", scope: !1478, file: !338, line: 638, type: !341)
!1482 = !DILocation(line: 638, column: 8, scope: !1478)
!1483 = !DILocalVariable(name: "udir", scope: !1478, file: !338, line: 638, type: !341)
!1484 = !DILocation(line: 638, column: 14, scope: !1478)
!1485 = !DILocalVariable(name: "rdir", scope: !1478, file: !338, line: 638, type: !341)
!1486 = !DILocation(line: 638, column: 21, scope: !1478)
!1487 = !DILocalVariable(name: "p", scope: !1478, file: !338, line: 638, type: !341)
!1488 = !DILocation(line: 638, column: 28, scope: !1478)
!1489 = !DILocalVariable(name: "rerrno", scope: !1478, file: !338, line: 639, type: !291)
!1490 = !DILocation(line: 639, column: 6, scope: !1478)
!1491 = !DILocalVariable(name: "rv", scope: !1478, file: !338, line: 639, type: !291)
!1492 = !DILocation(line: 639, column: 14, scope: !1478)
!1493 = !DILocation(line: 641, column: 6, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1478, file: !338, line: 641, column: 6)
!1495 = !DILocation(line: 641, column: 14, scope: !1494)
!1496 = !DILocation(line: 641, column: 6, scope: !1478)
!1497 = !DILocation(line: 642, column: 4, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1494, file: !338, line: 641, column: 23)
!1499 = !DILocation(line: 642, column: 8, scope: !1498)
!1500 = !DILocation(line: 643, column: 3, scope: !1498)
!1501 = !DILocation(line: 646, column: 16, scope: !1478)
!1502 = !DILocation(line: 646, column: 9, scope: !1478)
!1503 = !DILocation(line: 646, column: 7, scope: !1478)
!1504 = !DILocation(line: 647, column: 7, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1478, file: !338, line: 647, column: 6)
!1506 = !DILocation(line: 647, column: 6, scope: !1478)
!1507 = !DILocation(line: 648, column: 3, scope: !1505)
!1508 = !DILocation(line: 650, column: 16, scope: !1478)
!1509 = !DILocation(line: 650, column: 8, scope: !1478)
!1510 = !DILocation(line: 650, column: 6, scope: !1478)
!1511 = !DILocation(line: 651, column: 7, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1478, file: !338, line: 651, column: 6)
!1513 = !DILocation(line: 651, column: 6, scope: !1478)
!1514 = !DILocation(line: 652, column: 8, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1512, file: !338, line: 651, column: 12)
!1516 = !DILocation(line: 652, column: 3, scope: !1515)
!1517 = !DILocation(line: 653, column: 32, scope: !1515)
!1518 = !DILocation(line: 653, column: 8, scope: !1515)
!1519 = !DILocation(line: 653, column: 6, scope: !1515)
!1520 = !DILocation(line: 654, column: 7, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1515, file: !338, line: 654, column: 7)
!1522 = !DILocation(line: 654, column: 10, scope: !1521)
!1523 = !DILocation(line: 654, column: 7, scope: !1515)
!1524 = !DILocation(line: 655, column: 4, scope: !1521)
!1525 = !DILocation(line: 656, column: 9, scope: !1515)
!1526 = !DILocation(line: 656, column: 14, scope: !1515)
!1527 = !DILocation(line: 656, column: 7, scope: !1515)
!1528 = !DILocation(line: 657, column: 2, scope: !1515)
!1529 = !DILocation(line: 657, column: 13, scope: !1530)
!1530 = !DILexicalBlockFile(scope: !1531, file: !338, discriminator: 1)
!1531 = distinct !DILexicalBlock(scope: !1512, file: !338, line: 657, column: 13)
!1532 = !DILocation(line: 657, column: 20, scope: !1530)
!1533 = !DILocation(line: 657, column: 17, scope: !1530)
!1534 = !DILocation(line: 658, column: 10, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1531, file: !338, line: 657, column: 26)
!1536 = !DILocation(line: 658, column: 3, scope: !1535)
!1537 = !DILocation(line: 660, column: 3, scope: !1478)
!1538 = !DILocation(line: 660, column: 7, scope: !1478)
!1539 = !DILocation(line: 661, column: 18, scope: !1478)
!1540 = !DILocation(line: 661, column: 9, scope: !1478)
!1541 = !DILocation(line: 661, column: 7, scope: !1478)
!1542 = !DILocation(line: 662, column: 7, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1478, file: !338, line: 662, column: 6)
!1544 = !DILocation(line: 662, column: 6, scope: !1478)
!1545 = !DILocation(line: 663, column: 13, scope: !1546)
!1546 = distinct !DILexicalBlock(scope: !1543, file: !338, line: 662, column: 13)
!1547 = !DILocation(line: 663, column: 12, scope: !1546)
!1548 = !DILocation(line: 663, column: 10, scope: !1546)
!1549 = !DILocation(line: 664, column: 8, scope: !1546)
!1550 = !DILocation(line: 664, column: 3, scope: !1546)
!1551 = !DILocation(line: 665, column: 10, scope: !1546)
!1552 = !DILocation(line: 665, column: 4, scope: !1546)
!1553 = !DILocation(line: 665, column: 8, scope: !1546)
!1554 = !DILocation(line: 666, column: 3, scope: !1546)
!1555 = !DILocation(line: 668, column: 29, scope: !1478)
!1556 = !DILocation(line: 668, column: 35, scope: !1478)
!1557 = !DILocation(line: 668, column: 39, scope: !1478)
!1558 = !DILocation(line: 668, column: 7, scope: !1478)
!1559 = !DILocation(line: 668, column: 5, scope: !1478)
!1560 = !DILocation(line: 669, column: 12, scope: !1478)
!1561 = !DILocation(line: 669, column: 11, scope: !1478)
!1562 = !DILocation(line: 669, column: 9, scope: !1478)
!1563 = !DILocation(line: 670, column: 7, scope: !1478)
!1564 = !DILocation(line: 670, column: 2, scope: !1478)
!1565 = !DILocation(line: 671, column: 7, scope: !1478)
!1566 = !DILocation(line: 671, column: 2, scope: !1478)
!1567 = !DILocation(line: 672, column: 9, scope: !1478)
!1568 = !DILocation(line: 672, column: 3, scope: !1478)
!1569 = !DILocation(line: 672, column: 7, scope: !1478)
!1570 = !DILocation(line: 673, column: 6, scope: !1571)
!1571 = distinct !DILexicalBlock(scope: !1478, file: !338, line: 673, column: 6)
!1572 = !DILocation(line: 673, column: 9, scope: !1571)
!1573 = !DILocation(line: 673, column: 6, scope: !1478)
!1574 = !DILocation(line: 674, column: 3, scope: !1571)
!1575 = !DILocation(line: 675, column: 9, scope: !1478)
!1576 = !DILocation(line: 675, column: 2, scope: !1478)
!1577 = !DILocation(line: 676, column: 1, scope: !1478)
!1578 = distinct !DISubprogram(name: "sys_dir_eachfile", scope: !338, file: !338, line: 684, type: !1579, isLocal: false, isDefinition: true, scopeLine: 685, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !344)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{!291, !358, !1581, !290}
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dir_eachfile_cb_t", file: !1582, line: 64, baseType: !1583)
!1582 = !DIFile(filename: "sys.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!291, !358, !290}
!1586 = !DILocalVariable(name: "dirname", arg: 1, scope: !1578, file: !338, line: 684, type: !358)
!1587 = !DILocation(line: 684, column: 30, scope: !1578)
!1588 = !DILocalVariable(name: "cb", arg: 2, scope: !1578, file: !338, line: 684, type: !1581)
!1589 = !DILocation(line: 684, column: 61, scope: !1578)
!1590 = !DILocalVariable(name: "arg", arg: 3, scope: !1578, file: !338, line: 684, type: !290)
!1591 = !DILocation(line: 684, column: 71, scope: !1578)
!1592 = !DILocalVariable(name: "tree", scope: !1578, file: !338, line: 686, type: !1593)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1595, line: 81, baseType: !1596)
!1595 = !DIFile(filename: "/usr/include/fts.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1595, line: 57, size: 576, align: 64, elements: !1597)
!1597 = !{!1598, !1631, !1632, !1634, !1635, !1636, !1637, !1638, !1639, !1645}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1596, file: !1595, line: 58, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1595, line: 98, size: 960, align: 64, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1614, !1615, !1617, !1619, !1621, !1622, !1623, !1624, !1625, !1627}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1600, file: !1595, line: 99, baseType: !1599, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1600, file: !1595, line: 100, baseType: !1599, size: 64, align: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1600, file: !1595, line: 101, baseType: !1599, size: 64, align: 64, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1600, file: !1595, line: 102, baseType: !296, size: 64, align: 64, offset: 192)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1600, file: !1595, line: 103, baseType: !290, size: 64, align: 64, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1600, file: !1595, line: 104, baseType: !341, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1600, file: !1595, line: 105, baseType: !341, size: 64, align: 64, offset: 384)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1600, file: !1595, line: 106, baseType: !291, size: 32, align: 32, offset: 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1600, file: !1595, line: 107, baseType: !291, size: 32, align: 32, offset: 480)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1600, file: !1595, line: 108, baseType: !1612, size: 16, align: 16, offset: 512)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !293, line: 34, baseType: !1613)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !295, line: 31, baseType: !319)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1600, file: !1595, line: 109, baseType: !1612, size: 16, align: 16, offset: 528)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "fts_ino", scope: !1600, file: !1595, line: 111, baseType: !1616, size: 64, align: 64, offset: 576)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !293, line: 48, baseType: !1327)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1600, file: !1595, line: 112, baseType: !1618, size: 64, align: 64, offset: 640)
