; ModuleID = './line14-cachemgr.o.i'
source_filename = "./line14-cachemgr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cache = type { %union.pthread_mutex_t, i32 ()*, i32 ()*, i32 (i32)*, void (i32)*, i32 (i8*)*, i32 (i8*, i32*)*, void (i8*)*, void (i8*)*, i8* (i32)*, i8* (i32)*, void (i32, i8*)*, i8* (i8*, i32)*, void ()* }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_attr_t = type { i64, [48 x i8] }

@cachemgr_fkcrt = common global %struct.cache* null, align 8
@cachemgr_tgcrt = common global %struct.cache* null, align 8
@cachemgr_ssess = common global %struct.cache* null, align 8
@cachemgr_dsess = common global %struct.cache* null, align 8
@.str = private unnamed_addr constant [40 x i8] c"cachemgr_gc: pthread_create failed: %s\0A\00", align 1
@.str.1 = private unnamed_addr constant [38 x i8] c"cachemgr_gc: pthread_join failed: %s\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @cachemgr_preinit() #0 !dbg !117 {
  %1 = alloca i32, align 4
  %2 = call noalias %struct.cache* @cache_new(void (%struct.cache*)* @cachefkcrt_init_cb), !dbg !120
  store %struct.cache* %2, %struct.cache** @cachemgr_fkcrt, align 8, !dbg !122

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !5)
!1 = !DIFile(filename: "line14-cachemgr.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !111, !112, !113}
!6 = distinct !DIGlobalVariable(name: "cachemgr_fkcrt", scope: !0, file: !7, line: 43, type: !8, isLocal: false, isDefinition: true, variable: %struct.cache** @cachemgr_fkcrt)
!7 = !DIFile(filename: "cachemgr.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_t", file: !10, line: 70, baseType: !11)
!10 = !DIFile(filename: "cache.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cache", file: !10, line: 54, size: 1152, align: 64, elements: !12)
!12 = !{!13, !45, !51, !53, !58, !63, !69, !75, !80, !86, !91, !96, !101, !106}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !11, file: !10, line: 55, baseType: !14, size: 320, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !15, line: 128, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !15, line: 90, size: 320, align: 64, elements: !17)
!17 = !{!18, !38, !43}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !16, file: !15, line: 125, baseType: !19, size: 320, align: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !15, line: 92, size: 320, align: 64, elements: !20)
!20 = !{!21, !23, !25, !26, !27, !28, !30, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !19, file: !15, line: 94, baseType: !22, size: 32, align: 32)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !19, file: !15, line: 95, baseType: !24, size: 32, align: 32, offset: 32)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !19, file: !15, line: 96, baseType: !22, size: 32, align: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !19, file: !15, line: 98, baseType: !24, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !19, file: !15, line: 102, baseType: !22, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !19, file: !15, line: 104, baseType: !29, size: 16, align: 16, offset: 160)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !19, file: !15, line: 105, baseType: !29, size: 16, align: 16, offset: 176)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !19, file: !15, line: 106, baseType: !32, size: 128, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !15, line: 79, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !15, line: 75, size: 128, align: 64, elements: !34)
!34 = !{!35, !37}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !33, file: !15, line: 77, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !33, file: !15, line: 78, baseType: !36, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !16, file: !15, line: 126, baseType: !39, size: 320, align: 8)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 320, align: 8, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 40)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !16, file: !15, line: 127, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "begin_cb", scope: !11, file: !10, line: 57, baseType: !46, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_begin_cb_t", file: !10, line: 40, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_iter_t", file: !10, line: 38, baseType: !24)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "end_cb", scope: !11, file: !10, line: 58, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_end_cb_t", file: !10, line: 41, baseType: !47)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "exist_cb", scope: !11, file: !10, line: 59, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_exist_cb_t", file: !10, line: 42, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!22, !50}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "del_cb", scope: !11, file: !10, line: 60, baseType: !59, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_del_cb_t", file: !10, line: 43, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !50}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "get_cb", scope: !11, file: !10, line: 61, baseType: !64, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_cb_t", file: !10, line: 44, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!50, !68}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_key_t", file: !10, line: 37, baseType: !4)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "put_cb", scope: !11, file: !10, line: 62, baseType: !70, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_put_cb_t", file: !10, line: 45, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!50, !68, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "free_key_cb", scope: !11, file: !10, line: 63, baseType: !76, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_free_key_cb_t", file: !10, line: 46, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !68}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "free_val_cb", scope: !11, file: !10, line: 64, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_free_val_cb_t", file: !10, line: 47, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !85}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_val_t", file: !10, line: 36, baseType: !4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "get_key_cb", scope: !11, file: !10, line: 65, baseType: !87, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_key_cb_t", file: !10, line: 48, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !50}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "get_val_cb", scope: !11, file: !10, line: 66, baseType: !92, size: 64, align: 64, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_get_val_cb_t", file: !10, line: 49, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!85, !50}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "set_val_cb", scope: !11, file: !10, line: 67, baseType: !97, size: 64, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_set_val_cb_t", file: !10, line: 50, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !50, !85}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "unpackverify_val_cb", scope: !11, file: !10, line: 68, baseType: !102, size: 64, align: 64, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_unpackverify_val_cb_t", file: !10, line: 51, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!85, !85, !22}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fini_cb", scope: !11, file: !10, line: 69, baseType: !107, size: 64, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "cache_fini_cb_t", file: !10, line: 52, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null}
!111 = distinct !DIGlobalVariable(name: "cachemgr_tgcrt", scope: !0, file: !7, line: 44, type: !8, isLocal: false, isDefinition: true, variable: %struct.cache** @cachemgr_tgcrt)
!112 = distinct !DIGlobalVariable(name: "cachemgr_ssess", scope: !0, file: !7, line: 45, type: !8, isLocal: false, isDefinition: true, variable: %struct.cache** @cachemgr_ssess)
!113 = distinct !DIGlobalVariable(name: "cachemgr_dsess", scope: !0, file: !7, line: 46, type: !8, isLocal: false, isDefinition: true, variable: %struct.cache** @cachemgr_dsess)
!114 = !{i32 2, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!117 = distinct !DISubprogram(name: "cachemgr_preinit", scope: !7, file: !7, line: 65, type: !118, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!118 = !DISubroutineType(types: !119)
!119 = !{!22}
!120 = !DILocation(line: 67, column: 25, scope: !121)
!121 = distinct !DILexicalBlock(scope: !117, file: !7, line: 67, column: 6)
!122 = !DILocation(line: 67, column: 23, scope: !121)
!123 = !DILocation(line: 67, column: 6, scope: !117)
!124 = !DILocation(line: 68, column: 3, scope: !121)
!125 = !DILocation(line: 69, column: 25, scope: !126)
!126 = distinct !DILexicalBlock(scope: !117, file: !7, line: 69, column: 6)
!127 = !DILocation(line: 69, column: 23, scope: !126)
!128 = !DILocation(line: 69, column: 6, scope: !117)
!129 = !DILocation(line: 70, column: 3, scope: !126)
!130 = !DILocation(line: 71, column: 25, scope: !131)
!131 = distinct !DILexicalBlock(scope: !117, file: !7, line: 71, column: 6)
!132 = !DILocation(line: 71, column: 23, scope: !131)
!133 = !DILocation(line: 71, column: 6, scope: !117)
!134 = !DILocation(line: 72, column: 3, scope: !131)
!135 = !DILocation(line: 73, column: 25, scope: !136)
!136 = distinct !DILexicalBlock(scope: !117, file: !7, line: 73, column: 6)
!137 = !DILocation(line: 73, column: 23, scope: !136)
!138 = !DILocation(line: 73, column: 6, scope: !117)
!139 = !DILocation(line: 74, column: 3, scope: !136)
!140 = !DILocation(line: 75, column: 2, scope: !117)
!141 = !DILocation(line: 78, column: 13, scope: !117)
!142 = !DILocation(line: 78, column: 2, scope: !117)
!143 = !DILocation(line: 80, column: 13, scope: !117)
!144 = !DILocation(line: 80, column: 2, scope: !117)
!145 = !DILocation(line: 82, column: 13, scope: !117)
!146 = !DILocation(line: 82, column: 2, scope: !117)
!147 = !DILocation(line: 84, column: 2, scope: !117)
!148 = !DILocation(line: 85, column: 1, scope: !117)
!149 = distinct !DISubprogram(name: "cachemgr_init", scope: !7, file: !7, line: 92, type: !118, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!150 = !DILocation(line: 94, column: 19, scope: !151)
!151 = distinct !DILexicalBlock(scope: !149, file: !7, line: 94, column: 6)
!152 = !DILocation(line: 94, column: 6, scope: !151)
!153 = !DILocation(line: 94, column: 6, scope: !149)
!154 = !DILocation(line: 95, column: 3, scope: !151)
!155 = !DILocation(line: 96, column: 19, scope: !156)
!156 = distinct !DILexicalBlock(scope: !149, file: !7, line: 96, column: 6)
!157 = !DILocation(line: 96, column: 6, scope: !156)
!158 = !DILocation(line: 96, column: 6, scope: !149)
!159 = !DILocation(line: 97, column: 3, scope: !156)
!160 = !DILocation(line: 98, column: 19, scope: !161)
!161 = distinct !DILexicalBlock(scope: !149, file: !7, line: 98, column: 6)
!162 = !DILocation(line: 98, column: 6, scope: !161)
!163 = !DILocation(line: 98, column: 6, scope: !149)
