; ModuleID = './line5-log.o.i'
source_filename = "./line5-log.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.proxy_ctx = type opaque
%struct.logger = type opaque
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.log_content_ctx = type { %struct.log_content_file_ctx*, %struct.log_content_pcap_ctx*, %struct.log_content_mirror_ctx* }
%struct.log_content_file_ctx = type { %union.anon }
%union.anon = type { %struct.anon }
%struct.anon = type { i8*, i8* }
%struct.log_content_pcap_ctx = type { %union.anon.2, %struct.logpkt_ctx_t }
%union.anon.2 = type { %struct.anon.3 }
%struct.anon.3 = type { i32, i8* }
%struct.logpkt_ctx_t = type { %struct.libnet_context*, [6 x i8], [6 x i8], %struct.sockaddr_storage, %struct.sockaddr_storage, i32, i32, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !11)
!1 = !DIFile(filename: "line5-log.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{}
!3 = !{!4, !5, !7, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!11 = !{!12, !18, !19, !25, !26, !31, !33, !34, !35, !36, !43, !44, !45, !100, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!12 = distinct !DIGlobalVariable(name: "masterkey_log", scope: !0, file: !13, line: 183, type: !14, isLocal: false, isDefinition: true, variable: %struct.logger** @masterkey_log)
!13 = !DIFile(filename: "log.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "logger_t", file: !16, line: 45, baseType: !17)
!16 = !DIFile(filename: "logger.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "logger", file: !16, line: 45, flags: DIFlagFwdDecl)
!18 = distinct !DIGlobalVariable(name: "connect_log", scope: !0, file: !13, line: 250, type: !14, isLocal: false, isDefinition: true, variable: %struct.logger** @connect_log)
!19 = distinct !DIGlobalVariable(name: "content_mirror_src_ether", scope: !0, file: !13, line: 390, type: !20, isLocal: true, isDefinition: true, variable: [6 x i8]* @content_mirror_src_ether)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 48, align: 8, elements: !23)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 48, baseType: !6)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!23 = !{!24}
!24 = !DISubrange(count: 6)
!25 = distinct !DIGlobalVariable(name: "content_mirror_dst_ether", scope: !0, file: !13, line: 391, type: !20, isLocal: true, isDefinition: true, variable: [6 x i8]* @content_mirror_dst_ether)
!26 = distinct !DIGlobalVariable(name: "proxy_ctx", scope: !0, file: !13, line: 60, type: !27, isLocal: true, isDefinition: true, variable: %struct.proxy_ctx** @proxy_ctx)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "proxy_ctx_t", file: !29, line: 35, baseType: !30)
!29 = !DIFile(filename: "proxy.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "proxy_ctx", file: !29, line: 35, flags: DIFlagFwdDecl)
!31 = distinct !DIGlobalVariable(name: "err_shortcut_logger", scope: !0, file: !13, line: 78, type: !32, isLocal: true, isDefinition: true, variable: i32* @err_shortcut_logger)
!32 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!33 = distinct !DIGlobalVariable(name: "err_log", scope: !0, file: !13, line: 77, type: !14, isLocal: true, isDefinition: true, variable: %struct.logger** @err_log)
!34 = distinct !DIGlobalVariable(name: "err_mode", scope: !0, file: !13, line: 79, type: !32, isLocal: true, isDefinition: true, variable: i32* @err_mode)
!35 = distinct !DIGlobalVariable(name: "dbg_mode", scope: !0, file: !13, line: 130, type: !32, isLocal: true, isDefinition: true, variable: i32* @dbg_mode)
!36 = distinct !DIGlobalVariable(name: "iso8601", scope: !37, file: !13, line: 481, type: !40, isLocal: true, isDefinition: true, variable: [15 x i8]* @log_content_format_pathspec.iso8601)
!37 = distinct !DISubprogram(name: "log_content_format_pathspec", scope: !13, file: !13, line: 459, type: !38, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!38 = !DISubroutineType(types: !39)
!39 = !{!10, !7, !10, !10, !10, !10, !10, !10, !10}
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 120, align: 8, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 15)
!43 = distinct !DIGlobalVariable(name: "content_pcap_src_ether", scope: !0, file: !13, line: 382, type: !20, isLocal: true, isDefinition: true, variable: [6 x i8]* @content_pcap_src_ether)
!44 = distinct !DIGlobalVariable(name: "content_pcap_dst_ether", scope: !0, file: !13, line: 384, type: !20, isLocal: true, isDefinition: true, variable: [6 x i8]* @content_pcap_dst_ether)
!45 = distinct !DIGlobalVariable(name: "content_mirror_libnet", scope: !0, file: !13, line: 388, type: !46, isLocal: true, isDefinition: true, variable: %struct.libnet_context** @content_mirror_libnet)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !48, line: 235, baseType: !49)
!48 = !DIFile(filename: "/usr/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !48, line: 186, size: 3200, align: 64, elements: !50)
!50 = !{!51, !52, !53, !76, !77, !78, !79, !80, !81, !82, !90, !91, !95, !99}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !49, file: !48, line: 192, baseType: !32, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !49, file: !48, line: 194, baseType: !32, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !49, file: !48, line: 206, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !48, line: 178, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !48, line: 77, size: 384, align: 64, elements: !57)
!57 = !{!58, !60, !63, !66, !67, !68, !69, !73, !75}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !56, file: !48, line: 79, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !56, file: !48, line: 80, baseType: !61, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 51, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !56, file: !48, line: 81, baseType: !64, size: 16, align: 16, offset: 96)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 49, baseType: !65)
!65 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !56, file: !48, line: 92, baseType: !61, size: 32, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !48, line: 94, baseType: !21, size: 8, align: 8, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !48, line: 168, baseType: !21, size: 8, align: 8, offset: 168)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !56, file: !48, line: 170, baseType: !70, size: 32, align: 32, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !48, line: 70, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !72, line: 196, baseType: !32)
!72 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !48, line: 175, baseType: !74, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !56, file: !48, line: 176, baseType: !74, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !49, file: !48, line: 207, baseType: !54, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !49, file: !48, line: 208, baseType: !61, size: 32, align: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !49, file: !48, line: 210, baseType: !32, size: 32, align: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !49, file: !48, line: 224, baseType: !32, size: 32, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !49, file: !48, line: 225, baseType: !32, size: 32, align: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !49, file: !48, line: 226, baseType: !10, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !49, file: !48, line: 228, baseType: !83, size: 192, align: 64, offset: 384)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !48, line: 52, size: 192, align: 64, elements: !84)
!84 = !{!85, !88, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !83, file: !48, line: 55, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 55, baseType: !87)
!87 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !83, file: !48, line: 56, baseType: !86, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !83, file: !48, line: 57, baseType: !86, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !49, file: !48, line: 229, baseType: !70, size: 32, align: 32, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !49, file: !48, line: 230, baseType: !92, size: 512, align: 8, offset: 608)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 512, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !49, file: !48, line: 232, baseType: !96, size: 2048, align: 8, offset: 1120)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !49, file: !48, line: 233, baseType: !61, size: 32, align: 32, offset: 3168)
!100 = distinct !DIGlobalVariable(name: "content_mirror_mtu", scope: !0, file: !13, line: 389, type: !101, isLocal: true, isDefinition: true, variable: i64* @content_mirror_mtu)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 216, baseType: !87)
!102 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!103 = distinct !DIGlobalVariable(name: "content_file_log", scope: !0, file: !13, line: 379, type: !14, isLocal: true, isDefinition: true, variable: %struct.logger** @content_file_log)
!104 = distinct !DIGlobalVariable(name: "content_pcap_log", scope: !0, file: !13, line: 381, type: !14, isLocal: true, isDefinition: true, variable: %struct.logger** @content_pcap_log)
!105 = distinct !DIGlobalVariable(name: "content_mirror_log", scope: !0, file: !13, line: 387, type: !14, isLocal: true, isDefinition: true, variable: %struct.logger** @content_mirror_log)
!106 = distinct !DIGlobalVariable(name: "content_file_single_fd", scope: !0, file: !13, line: 1016, type: !32, isLocal: true, isDefinition: true, variable: i32* @content_file_single_fd)
!107 = distinct !DIGlobalVariable(name: "content_file_single_fn", scope: !0, file: !13, line: 1017, type: !10, isLocal: true, isDefinition: true, variable: i8** @content_file_single_fn)
!108 = distinct !DIGlobalVariable(name: "content_pcap_fd", scope: !0, file: !13, line: 1151, type: !32, isLocal: true, isDefinition: true, variable: i32* @content_pcap_fd)
!109 = distinct !DIGlobalVariable(name: "content_pcap_fn", scope: !0, file: !13, line: 1152, type: !10, isLocal: true, isDefinition: true, variable: i8** @content_pcap_fn)
!110 = distinct !DIGlobalVariable(name: "connect_fd", scope: !0, file: !13, line: 251, type: !32, isLocal: true, isDefinition: true, variable: i32* @connect_fd)
!111 = distinct !DIGlobalVariable(name: "connect_fn", scope: !0, file: !13, line: 252, type: !10, isLocal: true, isDefinition: true, variable: i8** @connect_fn)
!112 = distinct !DIGlobalVariable(name: "masterkey_fd", scope: !0, file: !13, line: 184, type: !32, isLocal: true, isDefinition: true, variable: i32* @masterkey_fd)
!113 = distinct !DIGlobalVariable(name: "masterkey_fn", scope: !0, file: !13, line: 185, type: !10, isLocal: true, isDefinition: true, variable: i8** @masterkey_fn)
!114 = distinct !DIGlobalVariable(name: "cert_log", scope: !0, file: !13, line: 1431, type: !14, isLocal: true, isDefinition: true, variable: %struct.logger** @cert_log)
!115 = distinct !DIGlobalVariable(name: "masterkey_clisock", scope: !0, file: !13, line: 186, type: !32, isLocal: true, isDefinition: true, variable: i32* @masterkey_clisock)
!116 = distinct !DIGlobalVariable(name: "connect_clisock", scope: !0, file: !13, line: 253, type: !32, isLocal: true, isDefinition: true, variable: i32* @connect_clisock)
!117 = distinct !DIGlobalVariable(name: "content_file_clisock", scope: !0, file: !13, line: 378, type: !32, isLocal: true, isDefinition: true, variable: i32* @content_file_clisock)
!118 = distinct !DIGlobalVariable(name: "content_pcap_clisock", scope: !0, file: !13, line: 380, type: !32, isLocal: true, isDefinition: true, variable: i32* @content_pcap_clisock)
!119 = distinct !DIGlobalVariable(name: "cert_clisock", scope: !0, file: !13, line: 1432, type: !32, isLocal: true, isDefinition: true, variable: i32* @cert_clisock)
!120 = !{i32 2, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!123 = distinct !DISubprogram(name: "log_exceptcb", scope: !13, file: !13, line: 63, type: !124, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!124 = !DISubroutineType(types: !125)
!125 = !{null}
!126 = !DILocation(line: 65, column: 6, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !13, line: 65, column: 6)
!128 = !DILocation(line: 65, column: 6, scope: !123)
!129 = !DILocation(line: 66, column: 19, scope: !130)
!130 = distinct !DILexicalBlock(scope: !127, file: !13, line: 65, column: 17)
!131 = !DILocation(line: 66, column: 3, scope: !130)
!132 = !DILocation(line: 67, column: 13, scope: !130)
!133 = !DILocation(line: 68, column: 2, scope: !130)
!134 = !DILocation(line: 69, column: 1, scope: !123)
!135 = distinct !DISubprogram(name: "log_err_printf", scope: !13, file: !13, line: 96, type: !136, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!136 = !DISubroutineType(types: !137)
!137 = !{!32, !7, null}
!138 = !DILocalVariable(name: "fmt", arg: 1, scope: !135, file: !13, line: 96, type: !7)
!139 = !DIExpression()
!140 = !DILocation(line: 96, column: 28, scope: !135)
!141 = !DILocalVariable(name: "ap", scope: !135, file: !13, line: 98, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 98, baseType: !144)
!143 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !143, line: 40, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 98, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, align: 64, elements: !153)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 98, size: 192, align: 64, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !147, file: !1, line: 98, baseType: !62, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !147, file: !1, line: 98, baseType: !62, size: 32, align: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !147, file: !1, line: 98, baseType: !4, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !147, file: !1, line: 98, baseType: !4, size: 64, align: 64, offset: 128)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DILocation(line: 98, column: 10, scope: !135)
!156 = !DILocalVariable(name: "buf", scope: !135, file: !13, line: 99, type: !10)
!157 = !DILocation(line: 99, column: 8, scope: !135)
!158 = !DILocalVariable(name: "rv", scope: !135, file: !13, line: 100, type: !32)
!159 = !DILocation(line: 100, column: 6, scope: !135)
!160 = !DILocation(line: 102, column: 1, scope: !135)
!161 = !DILocation(line: 103, column: 23, scope: !135)
!162 = !DILocation(line: 103, column: 28, scope: !135)
!163 = !DILocation(line: 103, column: 7, scope: !135)
!164 = !DILocation(line: 103, column: 5, scope: !135)
!165 = !DILocation(line: 104, column: 1, scope: !135)
!166 = !DILocation(line: 105, column: 6, scope: !167)
!167 = distinct !DILexicalBlock(scope: !135, file: !13, line: 105, column: 6)
!168 = !DILocation(line: 105, column: 9, scope: !167)
!169 = !DILocation(line: 105, column: 6, scope: !135)
!170 = !DILocation(line: 106, column: 3, scope: !167)
!171 = !DILocation(line: 107, column: 6, scope: !172)
!172 = distinct !DILexicalBlock(scope: !135, file: !13, line: 107, column: 6)
!173 = !DILocation(line: 107, column: 6, scope: !135)
!174 = !DILocation(line: 108, column: 31, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !13, line: 107, column: 27)
!176 = !DILocation(line: 109, column: 31, scope: !175)
!177 = !DILocation(line: 109, column: 43, scope: !175)
!178 = !DILocation(line: 109, column: 36, scope: !175)
!179 = !DILocation(line: 109, column: 48, scope: !175)
!180 = !DILocation(line: 108, column: 10, scope: !175)
!181 = !DILocation(line: 108, column: 3, scope: !175)
!182 = !DILocation(line: 111, column: 43, scope: !183)
!183 = distinct !DILexicalBlock(scope: !172, file: !13, line: 110, column: 9)
!184 = !DILocation(line: 111, column: 55, scope: !183)
!185 = !DILocation(line: 111, column: 48, scope: !183)
!186 = !DILocation(line: 111, column: 60, scope: !183)
!187 = !DILocation(line: 111, column: 3, scope: !188)
!188 = !DILexicalBlockFile(scope: !183, file: !13, discriminator: 1)
!189 = !DILocation(line: 112, column: 8, scope: !183)
!190 = !DILocation(line: 112, column: 3, scope: !183)
!191 = !DILocation(line: 114, column: 2, scope: !135)
!192 = !DILocation(line: 115, column: 1, scope: !135)
!193 = distinct !DISubprogram(name: "log_err_writecb", scope: !13, file: !13, line: 82, type: !194, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !4, !87, !200, !101}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !72, line: 109, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !198, line: 172, baseType: !199)
!198 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!199 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!202 = !DILocalVariable(name: "fh", arg: 1, scope: !193, file: !13, line: 82, type: !4)
!203 = !DILocation(line: 82, column: 47, scope: !193)
!204 = !DILocalVariable(name: "ctl", arg: 2, scope: !193, file: !13, line: 82, type: !87)
!205 = !DILocation(line: 82, column: 89, scope: !193)
!206 = !DILocalVariable(name: "buf", arg: 3, scope: !193, file: !13, line: 83, type: !200)
!207 = !DILocation(line: 83, column: 29, scope: !193)
!208 = !DILocalVariable(name: "sz", arg: 4, scope: !193, file: !13, line: 83, type: !101)
!209 = !DILocation(line: 83, column: 41, scope: !193)
!210 = !DILocation(line: 85, column: 10, scope: !193)
!211 = !DILocation(line: 85, column: 2, scope: !193)
!212 = !DILocation(line: 87, column: 18, scope: !213)
!213 = distinct !DILexicalBlock(scope: !193, file: !13, line: 85, column: 20)
!214 = !DILocation(line: 87, column: 23, scope: !213)
!215 = !DILocation(line: 87, column: 26, scope: !213)
!216 = !DILocation(line: 87, column: 33, scope: !213)
!217 = !DILocation(line: 87, column: 11, scope: !213)
!218 = !DILocation(line: 87, column: 4, scope: !213)
!219 = !DILocation(line: 89, column: 39, scope: !213)
!220 = !DILocation(line: 89, column: 4, scope: !213)
!221 = !DILocation(line: 90, column: 11, scope: !213)
!222 = !DILocation(line: 90, column: 4, scope: !213)
!223 = !DILocation(line: 92, column: 2, scope: !193)
!224 = !DILocation(line: 93, column: 1, scope: !193)
!225 = distinct !DISubprogram(name: "log_err_mode", scope: !13, file: !13, line: 118, type: !226, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !32}
!228 = !DILocalVariable(name: "mode", arg: 1, scope: !225, file: !13, line: 118, type: !32)
!229 = !DILocation(line: 118, column: 18, scope: !225)
!230 = !DILocation(line: 120, column: 13, scope: !225)
!231 = !DILocation(line: 120, column: 11, scope: !225)
!232 = !DILocation(line: 121, column: 1, scope: !225)
!233 = distinct !DISubprogram(name: "log_dbg_write_free", scope: !13, file: !13, line: 133, type: !234, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!234 = !DISubroutineType(types: !235)
!235 = !{!32, !4, !101}
!236 = !DILocalVariable(name: "buf", arg: 1, scope: !233, file: !13, line: 133, type: !4)
!237 = !DILocation(line: 133, column: 26, scope: !233)
!238 = !DILocalVariable(name: "sz", arg: 2, scope: !233, file: !13, line: 133, type: !101)
!239 = !DILocation(line: 133, column: 38, scope: !233)
!240 = !DILocation(line: 135, column: 6, scope: !241)
!241 = distinct !DILexicalBlock(scope: !233, file: !13, line: 135, column: 6)
!242 = !DILocation(line: 135, column: 15, scope: !241)
!243 = !DILocation(line: 135, column: 6, scope: !233)
!244 = !DILocation(line: 136, column: 3, scope: !241)
!245 = !DILocation(line: 138, column: 6, scope: !246)
!246 = distinct !DILexicalBlock(scope: !233, file: !13, line: 138, column: 6)
!247 = !DILocation(line: 138, column: 6, scope: !233)
!248 = !DILocation(line: 139, column: 31, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !13, line: 138, column: 27)
!250 = !DILocation(line: 139, column: 48, scope: !249)
!251 = !DILocation(line: 139, column: 53, scope: !249)
!252 = !DILocation(line: 139, column: 10, scope: !249)
!253 = !DILocation(line: 139, column: 3, scope: !249)
!254 = !DILocation(line: 141, column: 27, scope: !255)
!255 = distinct !DILexicalBlock(scope: !246, file: !13, line: 140, column: 9)
!256 = !DILocation(line: 141, column: 32, scope: !255)
!257 = !DILocation(line: 141, column: 3, scope: !255)
!258 = !DILocation(line: 142, column: 8, scope: !255)
!259 = !DILocation(line: 142, column: 3, scope: !255)
!260 = !DILocation(line: 144, column: 2, scope: !233)
!261 = !DILocation(line: 145, column: 1, scope: !233)
!262 = distinct !DISubprogram(name: "log_dbg_print_free", scope: !13, file: !13, line: 148, type: !263, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!263 = !DISubroutineType(types: !264)
!264 = !{!32, !10}
!265 = !DILocalVariable(name: "s", arg: 1, scope: !262, file: !13, line: 148, type: !10)
!266 = !DILocation(line: 148, column: 26, scope: !262)
!267 = !DILocation(line: 150, column: 28, scope: !262)
!268 = !DILocation(line: 150, column: 38, scope: !262)
!269 = !DILocation(line: 150, column: 31, scope: !262)
!270 = !DILocation(line: 150, column: 41, scope: !262)
!271 = !DILocation(line: 150, column: 9, scope: !272)
!272 = !DILexicalBlockFile(scope: !262, file: !13, discriminator: 1)
!273 = !DILocation(line: 150, column: 2, scope: !262)
!274 = distinct !DISubprogram(name: "log_dbg_printf", scope: !13, file: !13, line: 154, type: !136, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!275 = !DILocalVariable(name: "fmt", arg: 1, scope: !274, file: !13, line: 154, type: !7)
!276 = !DILocation(line: 154, column: 28, scope: !274)
!277 = !DILocalVariable(name: "ap", scope: !274, file: !13, line: 156, type: !142)
!278 = !DILocation(line: 156, column: 10, scope: !274)
!279 = !DILocalVariable(name: "buf", scope: !274, file: !13, line: 157, type: !10)
!280 = !DILocation(line: 157, column: 8, scope: !274)
!281 = !DILocalVariable(name: "rv", scope: !274, file: !13, line: 158, type: !32)
!282 = !DILocation(line: 158, column: 6, scope: !274)
!283 = !DILocation(line: 160, column: 6, scope: !284)
!284 = distinct !DILexicalBlock(scope: !274, file: !13, line: 160, column: 6)
!285 = !DILocation(line: 160, column: 15, scope: !284)
!286 = !DILocation(line: 160, column: 6, scope: !274)
!287 = !DILocation(line: 161, column: 3, scope: !284)
!288 = !DILocation(line: 163, column: 1, scope: !274)
!289 = !DILocation(line: 164, column: 23, scope: !274)
!290 = !DILocation(line: 164, column: 28, scope: !274)
!291 = !DILocation(line: 164, column: 7, scope: !274)
!292 = !DILocation(line: 164, column: 5, scope: !274)
!293 = !DILocation(line: 165, column: 1, scope: !274)
!294 = !DILocation(line: 166, column: 6, scope: !295)
!295 = distinct !DILexicalBlock(scope: !274, file: !13, line: 166, column: 6)
!296 = !DILocation(line: 166, column: 9, scope: !295)
!297 = !DILocation(line: 166, column: 6, scope: !274)
!298 = !DILocation(line: 167, column: 3, scope: !295)
!299 = !DILocation(line: 168, column: 28, scope: !274)
!300 = !DILocation(line: 168, column: 9, scope: !274)
!301 = !DILocation(line: 168, column: 2, scope: !274)
!302 = !DILocation(line: 169, column: 1, scope: !274)
!303 = distinct !DISubprogram(name: "log_dbg_mode", scope: !13, file: !13, line: 172, type: !226, isLocal: false, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!304 = !DILocalVariable(name: "mode", arg: 1, scope: !303, file: !13, line: 172, type: !32)
!305 = !DILocation(line: 172, column: 18, scope: !303)
!306 = !DILocation(line: 174, column: 13, scope: !303)
!307 = !DILocation(line: 174, column: 11, scope: !303)
!308 = !DILocation(line: 175, column: 1, scope: !303)
!309 = distinct !DISubprogram(name: "log_content_split_pathspec", scope: !13, file: !13, line: 401, type: !310, isLocal: false, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!310 = !DISubroutineType(types: !311)
!311 = !{!32, !7, !312, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!313 = !DILocalVariable(name: "path", arg: 1, scope: !309, file: !13, line: 401, type: !7)
!314 = !DILocation(line: 401, column: 40, scope: !309)
!315 = !DILocalVariable(name: "lhs", arg: 2, scope: !309, file: !13, line: 401, type: !312)
!316 = !DILocation(line: 401, column: 53, scope: !309)
!317 = !DILocalVariable(name: "rhs", arg: 3, scope: !309, file: !13, line: 401, type: !312)
!318 = !DILocation(line: 401, column: 65, scope: !309)
!319 = !DILocalVariable(name: "p", scope: !309, file: !13, line: 403, type: !7)
!320 = !DILocation(line: 403, column: 14, scope: !309)
!321 = !DILocalVariable(name: "q", scope: !309, file: !13, line: 403, type: !7)
!322 = !DILocation(line: 403, column: 18, scope: !309)
!323 = !DILocalVariable(name: "r", scope: !309, file: !13, line: 403, type: !7)
!324 = !DILocation(line: 403, column: 22, scope: !309)
!325 = !DILocation(line: 405, column: 13, scope: !309)
!326 = !DILocation(line: 405, column: 6, scope: !309)
!327 = !DILocation(line: 405, column: 4, scope: !309)
!328 = !DILocation(line: 409, column: 2, scope: !309)
!329 = !DILocation(line: 409, column: 9, scope: !330)
!330 = !DILexicalBlockFile(scope: !309, file: !13, discriminator: 1)
!331 = !DILocation(line: 409, column: 11, scope: !330)
!332 = !DILocation(line: 409, column: 14, scope: !333)
!333 = !DILexicalBlockFile(scope: !309, file: !13, discriminator: 2)
!334 = !DILocation(line: 409, column: 19, scope: !333)
!335 = !DILocation(line: 409, column: 2, scope: !336)
!336 = !DILexicalBlockFile(scope: !309, file: !13, discriminator: 3)
!337 = !DILocation(line: 410, column: 14, scope: !338)
!338 = distinct !DILexicalBlock(scope: !309, file: !13, line: 409, column: 27)
!339 = !DILocation(line: 410, column: 16, scope: !338)
!340 = !DILocation(line: 410, column: 7, scope: !338)
!341 = !DILocation(line: 410, column: 5, scope: !338)
!342 = !DILocation(line: 409, column: 2, scope: !343)
!343 = !DILexicalBlockFile(scope: !309, file: !13, discriminator: 4)
!344 = distinct !{!344, !328}
!345 = !DILocation(line: 414, column: 7, scope: !346)
!346 = distinct !DILexicalBlock(scope: !309, file: !13, line: 414, column: 6)
!347 = !DILocation(line: 414, column: 9, scope: !346)
!348 = !DILocation(line: 414, column: 13, scope: !349)
!349 = !DILexicalBlockFile(scope: !346, file: !13, discriminator: 1)
!350 = !DILocation(line: 414, column: 6, scope: !349)
!351 = !DILocation(line: 416, column: 7, scope: !352)
!352 = distinct !DILexicalBlock(scope: !346, file: !13, line: 414, column: 19)
!353 = !DILocation(line: 416, column: 21, scope: !352)
!354 = !DILocation(line: 416, column: 14, scope: !352)
!355 = !DILocation(line: 416, column: 12, scope: !352)
!356 = !DILocation(line: 416, column: 5, scope: !352)
!357 = !DILocation(line: 417, column: 2, scope: !352)
!358 = !DILocation(line: 421, column: 22, scope: !359)
!359 = distinct !DILexicalBlock(scope: !309, file: !13, line: 421, column: 2)
!360 = !DILocation(line: 421, column: 15, scope: !359)
!361 = !DILocation(line: 421, column: 13, scope: !359)
!362 = !DILocation(line: 421, column: 9, scope: !359)
!363 = !DILocation(line: 421, column: 7, scope: !359)
!364 = !DILocation(line: 421, column: 34, scope: !365)
!365 = !DILexicalBlockFile(scope: !366, file: !13, discriminator: 1)
!366 = distinct !DILexicalBlock(scope: !359, file: !13, line: 421, column: 2)
!367 = !DILocation(line: 421, column: 36, scope: !365)
!368 = !DILocation(line: 421, column: 40, scope: !369)
!369 = !DILexicalBlockFile(scope: !366, file: !13, discriminator: 2)
!370 = !DILocation(line: 421, column: 44, scope: !369)
!371 = !DILocation(line: 421, column: 42, scope: !369)
!372 = !DILocation(line: 421, column: 2, scope: !373)
!373 = !DILexicalBlockFile(scope: !359, file: !13, discriminator: 3)
!374 = !DILocation(line: 422, column: 7, scope: !375)
!375 = distinct !DILexicalBlock(scope: !366, file: !13, line: 421, column: 72)
!376 = !DILocation(line: 422, column: 5, scope: !375)
!377 = !DILocation(line: 423, column: 2, scope: !375)
!378 = !DILocation(line: 421, column: 59, scope: !379)
!379 = !DILexicalBlockFile(scope: !366, file: !13, discriminator: 4)
!380 = !DILocation(line: 421, column: 61, scope: !379)
!381 = !DILocation(line: 421, column: 52, scope: !379)
!382 = !DILocation(line: 421, column: 50, scope: !379)
!383 = !DILocation(line: 421, column: 2, scope: !379)
!384 = distinct !{!384, !385}
!385 = !DILocation(line: 421, column: 2, scope: !309)
!386 = !DILocation(line: 424, column: 12, scope: !387)
!387 = distinct !DILexicalBlock(scope: !309, file: !13, line: 424, column: 6)
!388 = !DILocation(line: 424, column: 10, scope: !387)
!389 = !DILocation(line: 424, column: 6, scope: !309)
!390 = !DILocation(line: 426, column: 10, scope: !391)
!391 = distinct !DILexicalBlock(scope: !387, file: !13, line: 424, column: 16)
!392 = !DILocation(line: 426, column: 4, scope: !391)
!393 = !DILocation(line: 426, column: 8, scope: !391)
!394 = !DILocation(line: 427, column: 9, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !13, line: 427, column: 7)
!396 = !DILocation(line: 427, column: 8, scope: !395)
!397 = !DILocation(line: 427, column: 7, scope: !391)
!398 = !DILocation(line: 428, column: 4, scope: !395)
!399 = !DILocation(line: 429, column: 17, scope: !391)
!400 = !DILocation(line: 429, column: 10, scope: !391)
!401 = !DILocation(line: 429, column: 4, scope: !391)
!402 = !DILocation(line: 429, column: 8, scope: !391)
!403 = !DILocation(line: 430, column: 9, scope: !404)
!404 = distinct !DILexicalBlock(scope: !391, file: !13, line: 430, column: 7)
!405 = !DILocation(line: 430, column: 8, scope: !404)
!406 = !DILocation(line: 430, column: 7, scope: !391)
!407 = !DILocation(line: 431, column: 10, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !13, line: 430, column: 14)
!409 = !DILocation(line: 431, column: 9, scope: !408)
!410 = !DILocation(line: 431, column: 4, scope: !408)
!411 = !DILocation(line: 432, column: 4, scope: !408)
!412 = !DILocation(line: 434, column: 3, scope: !391)
!413 = !DILocation(line: 438, column: 3, scope: !309)
!414 = !DILocation(line: 439, column: 16, scope: !309)
!415 = !DILocation(line: 439, column: 20, scope: !309)
!416 = !DILocation(line: 439, column: 18, scope: !309)
!417 = !DILocation(line: 439, column: 25, scope: !309)
!418 = !DILocation(line: 439, column: 9, scope: !309)
!419 = !DILocation(line: 439, column: 3, scope: !309)
!420 = !DILocation(line: 439, column: 7, scope: !309)
!421 = !DILocation(line: 440, column: 8, scope: !422)
!422 = distinct !DILexicalBlock(scope: !309, file: !13, line: 440, column: 6)
!423 = !DILocation(line: 440, column: 7, scope: !422)
!424 = !DILocation(line: 440, column: 6, scope: !309)
!425 = !DILocation(line: 441, column: 3, scope: !422)
!426 = !DILocation(line: 442, column: 10, scope: !309)
!427 = !DILocation(line: 442, column: 9, scope: !309)
!428 = !DILocation(line: 442, column: 15, scope: !309)
!429 = !DILocation(line: 442, column: 21, scope: !309)
!430 = !DILocation(line: 442, column: 25, scope: !309)
!431 = !DILocation(line: 442, column: 23, scope: !309)
!432 = !DILocation(line: 442, column: 2, scope: !309)
!433 = !DILocation(line: 443, column: 9, scope: !309)
!434 = !DILocation(line: 443, column: 13, scope: !309)
!435 = !DILocation(line: 443, column: 11, scope: !309)
!436 = !DILocation(line: 443, column: 4, scope: !309)
!437 = !DILocation(line: 443, column: 3, scope: !309)
!438 = !DILocation(line: 443, column: 2, scope: !309)
!439 = !DILocation(line: 443, column: 19, scope: !309)
!440 = !DILocation(line: 444, column: 16, scope: !309)
!441 = !DILocation(line: 444, column: 9, scope: !309)
!442 = !DILocation(line: 444, column: 3, scope: !309)
!443 = !DILocation(line: 444, column: 7, scope: !309)
!444 = !DILocation(line: 445, column: 8, scope: !445)
!445 = distinct !DILexicalBlock(scope: !309, file: !13, line: 445, column: 6)
!446 = !DILocation(line: 445, column: 7, scope: !445)
!447 = !DILocation(line: 445, column: 6, scope: !309)
!448 = !DILocation(line: 446, column: 9, scope: !449)
!449 = distinct !DILexicalBlock(scope: !445, file: !13, line: 445, column: 13)
!450 = !DILocation(line: 446, column: 8, scope: !449)
!451 = !DILocation(line: 446, column: 3, scope: !449)
!452 = !DILocation(line: 447, column: 3, scope: !449)
!453 = !DILocation(line: 450, column: 2, scope: !309)
!454 = !DILocation(line: 451, column: 1, scope: !309)
!455 = distinct !DISubprogram(name: "log_content_open", scope: !13, file: !13, line: 611, type: !456, isLocal: false, isDefinition: true, scopeLine: 617, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!456 = !DISubroutineType(types: !457)
!457 = !{!32, !458, !531, !2302, !2271, !2302, !2271, !10, !10, !10, !10, !10, !10, !10}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_content_ctx_t", file: !460, line: 73, baseType: !461)
!460 = !DIFile(filename: "log.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_content_ctx", file: !460, line: 77, size: 192, align: 64, elements: !462)
!462 = !{!463, !485, !526}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !461, file: !460, line: 78, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_content_file_ctx", file: !13, line: 341, size: 128, align: 64, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !465, file: !13, line: 355, baseType: !468, size: 128, align: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !465, file: !13, line: 342, size: 128, align: 64, elements: !469)
!469 = !{!470, !475, !480}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "single", scope: !468, file: !13, line: 346, baseType: !471, size: 128, align: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !13, line: 343, size: 128, align: 64, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "header_req", scope: !471, file: !13, line: 344, baseType: !10, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "header_resp", scope: !471, file: !13, line: 345, baseType: !10, size: 64, align: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !468, file: !13, line: 350, baseType: !476, size: 128, align: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !13, line: 347, size: 128, align: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !476, file: !13, line: 348, baseType: !32, size: 32, align: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !476, file: !13, line: 349, baseType: !10, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !468, file: !13, line: 354, baseType: !481, size: 128, align: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !13, line: 351, size: 128, align: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !481, file: !13, line: 352, baseType: !32, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !481, file: !13, line: 353, baseType: !10, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pcap", scope: !461, file: !460, line: 79, baseType: !486, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_content_pcap_ctx", file: !13, line: 358, size: 2496, align: 64, elements: !488)
!488 = !{!489, !502}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !487, file: !13, line: 368, baseType: !490, size: 128, align: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !487, file: !13, line: 359, size: 128, align: 64, elements: !491)
!491 = !{!492, !497}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !490, file: !13, line: 363, baseType: !493, size: 128, align: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !13, line: 360, size: 128, align: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !493, file: !13, line: 361, baseType: !32, size: 32, align: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !493, file: !13, line: 362, baseType: !10, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !490, file: !13, line: 367, baseType: !498, size: 128, align: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !490, file: !13, line: 364, size: 128, align: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !13, line: 365, baseType: !32, size: 32, align: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !498, file: !13, line: 366, baseType: !10, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !487, file: !13, line: 369, baseType: !503, size: 2368, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "logpkt_ctx_t", file: !504, line: 54, baseType: !505)
!504 = !DIFile(filename: "logpkt.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 45, size: 2368, align: 64, elements: !506)
!506 = !{!507, !508, !509, !510, !522, !523, !524, !525}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "libnet", scope: !505, file: !504, line: 46, baseType: !46, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "src_ether", scope: !505, file: !504, line: 47, baseType: !20, size: 48, align: 8, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ether", scope: !505, file: !504, line: 48, baseType: !20, size: 48, align: 8, offset: 112)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !505, file: !504, line: 49, baseType: !511, size: 1024, align: 64, offset: 192)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !512, line: 166, size: 1024, align: 64, elements: !513)
!512 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!513 = !{!514, !517, !521}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !511, file: !512, line: 168, baseType: !515, size: 16, align: 16)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !516, line: 28, baseType: !65)
!516 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !511, file: !512, line: 169, baseType: !518, size: 944, align: 8, offset: 16)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 944, align: 8, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 118)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !511, file: !512, line: 170, baseType: !87, size: 64, align: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !505, file: !504, line: 50, baseType: !511, size: 1024, align: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "src_seq", scope: !505, file: !504, line: 51, baseType: !61, size: 32, align: 32, offset: 2240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dst_seq", scope: !505, file: !504, line: 52, baseType: !61, size: 32, align: 32, offset: 2272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !505, file: !504, line: 53, baseType: !101, size: 64, align: 64, offset: 2304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mirror", scope: !461, file: !460, line: 80, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_content_mirror_ctx", file: !13, line: 373, size: 2368, align: 64, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !528, file: !13, line: 374, baseType: !503, size: 2368, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "opts_t", file: !533, line: 126, baseType: !534)
!533 = !DIFile(filename: "opts.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opts", file: !533, line: 56, size: 1920, align: 64, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2299, !2300, !2301}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !534, file: !533, line: 57, baseType: !62, size: 1, align: 32, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "detach", scope: !534, file: !533, line: 58, baseType: !62, size: 1, align: 32, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sslcomp", scope: !534, file: !533, line: 59, baseType: !62, size: 1, align: 32, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "no_ssl3", scope: !534, file: !533, line: 64, baseType: !62, size: 1, align: 32, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls10", scope: !534, file: !533, line: 67, baseType: !62, size: 1, align: 32, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls11", scope: !534, file: !533, line: 70, baseType: !62, size: 1, align: 32, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "no_tls12", scope: !534, file: !533, line: 73, baseType: !62, size: 1, align: 32, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "passthrough", scope: !534, file: !533, line: 75, baseType: !62, size: 1, align: 32, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "deny_ocsp", scope: !534, file: !533, line: 76, baseType: !62, size: 1, align: 32, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_isdir", scope: !534, file: !533, line: 77, baseType: !62, size: 1, align: 32, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_isspec", scope: !534, file: !533, line: 78, baseType: !62, size: 1, align: 32, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_isdir", scope: !534, file: !533, line: 79, baseType: !62, size: 1, align: 32, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_isspec", scope: !534, file: !533, line: 80, baseType: !62, size: 1, align: 32, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "certgen_writeall", scope: !534, file: !533, line: 84, baseType: !62, size: 1, align: 32, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "openssl_engine", scope: !534, file: !533, line: 86, baseType: !10, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ciphers", scope: !534, file: !533, line: 88, baseType: !10, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "certgendir", scope: !534, file: !533, line: 89, baseType: !10, size: 64, align: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tgcrtdir", scope: !534, file: !533, line: 90, baseType: !10, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dropuser", scope: !534, file: !533, line: 91, baseType: !10, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dropgroup", scope: !534, file: !533, line: 92, baseType: !10, size: 64, align: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "jaildir", scope: !534, file: !533, line: 93, baseType: !10, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pidfile", scope: !534, file: !533, line: 94, baseType: !10, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "conffile", scope: !534, file: !533, line: 95, baseType: !10, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "connectlog", scope: !534, file: !533, line: 96, baseType: !10, size: 64, align: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog", scope: !534, file: !533, line: 97, baseType: !10, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "contentlog_basedir", scope: !534, file: !533, line: 98, baseType: !10, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "masterkeylog", scope: !534, file: !533, line: 99, baseType: !10, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog", scope: !534, file: !533, line: 100, baseType: !10, size: 64, align: 64, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pcaplog_basedir", scope: !534, file: !533, line: 101, baseType: !10, size: 64, align: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mirrorif", scope: !534, file: !533, line: 103, baseType: !10, size: 64, align: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mirrortarget", scope: !534, file: !533, line: 104, baseType: !10, size: 64, align: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sslmethod", scope: !534, file: !533, line: 106, baseType: !568, size: 64, align: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !574, line: 374, baseType: !575)
!574 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !574, line: 438, size: 1856, align: 64, elements: !576)
!576 = !{!577, !578, !2172, !2176, !2177, !2178, !2179, !2183, !2184, !2188, !2189, !2190, !2191, !2195, !2199, !2203, !2204, !2208, !2212, !2216, !2220, !2224, !2228, !2232, !2238, !2239, !2242, !2243, !2248}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !575, file: !574, line: 439, baseType: !32, size: 32, align: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !575, file: !574, line: 440, baseType: !579, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!32, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !584, line: 178, baseType: !585)
!584 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !574, line: 1422, size: 6592, align: 64, elements: !586)
!586 = !{!587, !588, !589, !590, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !693, !694, !695, !696, !697, !698, !761, !1239, !1670, !1671, !1675, !1676, !1677, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1709, !1710, !1711, !1712, !1719, !1720, !1889, !1893, !1894, !1895, !1899, !1903, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2112, !2113, !2114, !2115, !2116, !2117, !2120, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2140, !2145, !2146, !2153, !2154, !2155, !2156, !2157, !2158, !2165, !2166, !2167, !2168, !2169, !2170, !2171}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !585, file: !574, line: 1427, baseType: !32, size: 32, align: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !585, file: !574, line: 1429, baseType: !32, size: 32, align: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !585, file: !574, line: 1431, baseType: !571, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rbio", scope: !585, file: !574, line: 1438, baseType: !591, size: 64, align: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO", file: !593, line: 238, baseType: !594)
!593 = !DIFile(filename: "/usr/include/openssl/bio.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_st", file: !593, line: 325, size: 896, align: 64, elements: !595)
!595 = !{!596, !634, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !594, file: !593, line: 326, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIO_METHOD", file: !593, line: 323, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bio_method_st", file: !593, line: 312, size: 640, align: 64, elements: !600)
!600 = !{!601, !602, !603, !607, !611, !615, !616, !620, !624, !625}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !593, line: 313, baseType: !32, size: 32, align: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !593, line: 314, baseType: !7, size: 64, align: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bwrite", scope: !599, file: !593, line: 315, baseType: !604, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!32, !591, !7, !32}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bread", scope: !599, file: !593, line: 316, baseType: !608, size: 64, align: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!32, !591, !10, !32}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bputs", scope: !599, file: !593, line: 317, baseType: !612, size: 64, align: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!32, !591, !7}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bgets", scope: !599, file: !593, line: 318, baseType: !608, size: 64, align: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !599, file: !593, line: 319, baseType: !617, size: 64, align: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!199, !591, !32, !199, !4}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !599, file: !593, line: 320, baseType: !621, size: 64, align: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!32, !591}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !599, file: !593, line: 321, baseType: !621, size: 64, align: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "callback_ctrl", scope: !599, file: !593, line: 322, baseType: !626, size: 64, align: 64, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!199, !591, !32, !629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "bio_info_cb", file: !593, line: 309, baseType: !631)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !633, !32, !7, !32, !199, !199}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !594, file: !593, line: 328, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!199, !633, !32, !7, !32, !199, !199}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cb_arg", scope: !594, file: !593, line: 329, baseType: !10, size: 64, align: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !594, file: !593, line: 330, baseType: !32, size: 32, align: 32, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !594, file: !593, line: 331, baseType: !32, size: 32, align: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !594, file: !593, line: 332, baseType: !32, size: 32, align: 32, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "retry_reason", scope: !594, file: !593, line: 333, baseType: !32, size: 32, align: 32, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !594, file: !593, line: 334, baseType: !32, size: 32, align: 32, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !594, file: !593, line: 335, baseType: !4, size: 64, align: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next_bio", scope: !594, file: !593, line: 336, baseType: !633, size: 64, align: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bio", scope: !594, file: !593, line: 337, baseType: !633, size: 64, align: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !594, file: !593, line: 338, baseType: !32, size: 32, align: 32, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "num_read", scope: !594, file: !593, line: 339, baseType: !87, size: 64, align: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "num_write", scope: !594, file: !593, line: 340, baseType: !87, size: 64, align: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !594, file: !593, line: 341, baseType: !651, size: 128, align: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !584, line: 195, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !653, line: 292, size: 128, align: 64, elements: !654)
!653 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!654 = !{!655, !672}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !652, file: !653, line: 293, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !653, line: 297, size: 256, align: 64, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !657, file: !653, line: 297, baseType: !660, size: 256, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !661, line: 72, baseType: !662)
!661 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !661, line: 66, size: 256, align: 64, elements: !663)
!663 = !{!664, !665, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !662, file: !661, line: 67, baseType: !32, size: 32, align: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !662, file: !661, line: 68, baseType: !312, size: 64, align: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !662, file: !661, line: 69, baseType: !32, size: 32, align: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !662, file: !661, line: 70, baseType: !32, size: 32, align: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !662, file: !661, line: 71, baseType: !669, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!32, !200, !200}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !652, file: !653, line: 295, baseType: !32, size: 32, align: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "wbio", scope: !585, file: !574, line: 1440, baseType: !591, size: 64, align: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bbio", scope: !585, file: !574, line: 1442, baseType: !591, size: 64, align: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rwstate", scope: !585, file: !574, line: 1455, baseType: !32, size: 32, align: 32, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "in_handshake", scope: !585, file: !574, line: 1457, baseType: !32, size: 32, align: 32, offset: 352)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_func", scope: !585, file: !574, line: 1458, baseType: !579, size: 64, align: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !585, file: !574, line: 1467, baseType: !32, size: 32, align: 32, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "new_session", scope: !585, file: !574, line: 1474, baseType: !32, size: 32, align: 32, offset: 480)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "quiet_shutdown", scope: !585, file: !574, line: 1476, baseType: !32, size: 32, align: 32, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !585, file: !574, line: 1478, baseType: !32, size: 32, align: 32, offset: 544)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !585, file: !574, line: 1480, baseType: !32, size: 32, align: 32, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rstate", scope: !585, file: !574, line: 1482, baseType: !32, size: 32, align: 32, offset: 608)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "init_buf", scope: !585, file: !574, line: 1483, baseType: !685, size: 64, align: 64, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !584, line: 127, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !688, line: 77, size: 192, align: 64, elements: !689)
!688 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !687, file: !688, line: 78, baseType: !101, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !687, file: !688, line: 79, baseType: !10, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !687, file: !688, line: 80, baseType: !101, size: 64, align: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "init_msg", scope: !585, file: !574, line: 1484, baseType: !4, size: 64, align: 64, offset: 704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "init_num", scope: !585, file: !574, line: 1486, baseType: !32, size: 32, align: 32, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init_off", scope: !585, file: !574, line: 1487, baseType: !32, size: 32, align: 32, offset: 800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !585, file: !574, line: 1489, baseType: !5, size: 64, align: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !585, file: !574, line: 1490, baseType: !62, size: 32, align: 32, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "s2", scope: !585, file: !574, line: 1491, baseType: !699, size: 64, align: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl2_state_st", file: !701, line: 163, size: 2752, align: 64, elements: !702)
!701 = !DIFile(filename: "/usr/include/openssl/ssl2.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!702 = !{!703, !704, !705, !706, !707, !708, !709, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !735, !736, !740, !741, !745, !746, !747}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "three_byte_header", scope: !700, file: !701, line: 164, baseType: !32, size: 32, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "clear_text", scope: !700, file: !701, line: 165, baseType: !32, size: 32, align: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "escape", scope: !700, file: !701, line: 166, baseType: !32, size: 32, align: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ssl2_rollback", scope: !700, file: !701, line: 167, baseType: !32, size: 32, align: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !700, file: !701, line: 171, baseType: !62, size: 32, align: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !700, file: !701, line: 172, baseType: !32, size: 32, align: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !700, file: !701, line: 173, baseType: !710, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_off", scope: !700, file: !701, line: 174, baseType: !32, size: 32, align: 32, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_len", scope: !700, file: !701, line: 175, baseType: !32, size: 32, align: 32, offset: 288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !700, file: !701, line: 176, baseType: !32, size: 32, align: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_left", scope: !700, file: !701, line: 178, baseType: !32, size: 32, align: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf_offs", scope: !700, file: !701, line: 179, baseType: !32, size: 32, align: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !700, file: !701, line: 180, baseType: !5, size: 64, align: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !700, file: !701, line: 181, baseType: !5, size: 64, align: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !700, file: !701, line: 182, baseType: !5, size: 64, align: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !700, file: !701, line: 184, baseType: !62, size: 32, align: 32, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rlength", scope: !700, file: !701, line: 185, baseType: !62, size: 32, align: 32, offset: 672)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data_length", scope: !700, file: !701, line: 186, baseType: !32, size: 32, align: 32, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "wlength", scope: !700, file: !701, line: 187, baseType: !62, size: 32, align: 32, offset: 736)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data_length", scope: !700, file: !701, line: 188, baseType: !32, size: 32, align: 32, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ract_data", scope: !700, file: !701, line: 189, baseType: !5, size: 64, align: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "wact_data", scope: !700, file: !701, line: 190, baseType: !5, size: 64, align: 64, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mac_data", scope: !700, file: !701, line: 191, baseType: !5, size: 64, align: 64, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "read_key", scope: !700, file: !701, line: 192, baseType: !5, size: 64, align: 64, offset: 1024)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "write_key", scope: !700, file: !701, line: 193, baseType: !5, size: 64, align: 64, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "challenge_length", scope: !700, file: !701, line: 195, baseType: !62, size: 32, align: 32, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "challenge", scope: !700, file: !701, line: 196, baseType: !732, size: 256, align: 8, offset: 1184)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, align: 8, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !700, file: !701, line: 197, baseType: !62, size: 32, align: 32, offset: 1440)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id", scope: !700, file: !701, line: 198, baseType: !737, size: 128, align: 8, offset: 1472)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, align: 8, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "key_material_length", scope: !700, file: !701, line: 199, baseType: !62, size: 32, align: 32, offset: 1600)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "key_material", scope: !700, file: !701, line: 200, baseType: !742, size: 384, align: 8, offset: 1632)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 384, align: 8, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 48)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !700, file: !701, line: 201, baseType: !87, size: 64, align: 64, offset: 2048)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !700, file: !701, line: 202, baseType: !87, size: 64, align: 64, offset: 2112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !700, file: !701, line: 215, baseType: !748, size: 576, align: 32, offset: 2176)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !701, line: 203, size: 576, align: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "conn_id_length", scope: !748, file: !701, line: 204, baseType: !62, size: 32, align: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cert_type", scope: !748, file: !701, line: 205, baseType: !62, size: 32, align: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cert_length", scope: !748, file: !701, line: 206, baseType: !62, size: 32, align: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "csl", scope: !748, file: !701, line: 207, baseType: !62, size: 32, align: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !748, file: !701, line: 208, baseType: !62, size: 32, align: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !748, file: !701, line: 209, baseType: !62, size: 32, align: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ccl", scope: !748, file: !701, line: 210, baseType: !732, size: 256, align: 8, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_spec_length", scope: !748, file: !701, line: 211, baseType: !62, size: 32, align: 32, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "session_id_length", scope: !748, file: !701, line: 212, baseType: !62, size: 32, align: 32, offset: 480)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clen", scope: !748, file: !701, line: 213, baseType: !62, size: 32, align: 32, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rlen", scope: !748, file: !701, line: 214, baseType: !62, size: 32, align: 32, offset: 544)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !585, file: !574, line: 1492, baseType: !762, size: 64, align: 64, offset: 1024)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !764, line: 481, size: 9728, align: 64, elements: !765)
!764 = !DIFile(filename: "/usr/include/openssl/ssl3.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!765 = !{!766, !767, !768, !772, !773, !775, !776, !777, !778, !779, !780, !781, !782, !783, !791, !792, !804, !805, !809, !810, !814, !815, !816, !817, !818, !819, !820, !821, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !764, line: 482, baseType: !199, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "delay_buf_pop_ret", scope: !763, file: !764, line: 483, baseType: !32, size: 32, align: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !763, file: !764, line: 484, baseType: !769, size: 64, align: 8, offset: 96)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, align: 8, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret_size", scope: !763, file: !764, line: 485, baseType: !32, size: 32, align: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "read_mac_secret", scope: !763, file: !764, line: 486, baseType: !774, size: 512, align: 8, offset: 192)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, align: 8, elements: !93)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "write_sequence", scope: !763, file: !764, line: 487, baseType: !769, size: 64, align: 8, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret_size", scope: !763, file: !764, line: 488, baseType: !32, size: 32, align: 32, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "write_mac_secret", scope: !763, file: !764, line: 489, baseType: !774, size: 512, align: 8, offset: 800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "server_random", scope: !763, file: !764, line: 490, baseType: !732, size: 256, align: 8, offset: 1312)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "client_random", scope: !763, file: !764, line: 491, baseType: !732, size: 256, align: 8, offset: 1568)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "need_empty_fragments", scope: !763, file: !764, line: 493, baseType: !32, size: 32, align: 32, offset: 1824)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "empty_fragment_done", scope: !763, file: !764, line: 494, baseType: !32, size: 32, align: 32, offset: 1856)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "init_extra", scope: !763, file: !764, line: 496, baseType: !32, size: 32, align: 32, offset: 1888)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rbuf", scope: !763, file: !764, line: 497, baseType: !784, size: 192, align: 64, offset: 1920)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_BUFFER", file: !764, line: 447, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_buffer_st", file: !764, line: 438, size: 192, align: 64, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !785, file: !764, line: 440, baseType: !5, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !785, file: !764, line: 442, baseType: !101, size: 64, align: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !785, file: !764, line: 444, baseType: !32, size: 32, align: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !785, file: !764, line: 446, baseType: !32, size: 32, align: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "wbuf", scope: !763, file: !764, line: 498, baseType: !784, size: 192, align: 64, offset: 2112)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rrec", scope: !763, file: !764, line: 499, baseType: !793, size: 448, align: 64, offset: 2304)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !764, line: 436, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !764, line: 403, size: 448, align: 64, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !794, file: !764, line: 407, baseType: !32, size: 32, align: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !794, file: !764, line: 411, baseType: !62, size: 32, align: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !794, file: !764, line: 415, baseType: !62, size: 32, align: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !764, line: 419, baseType: !5, size: 64, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !794, file: !764, line: 423, baseType: !5, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !794, file: !764, line: 427, baseType: !5, size: 64, align: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !794, file: !764, line: 431, baseType: !87, size: 64, align: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "seq_num", scope: !794, file: !764, line: 435, baseType: !769, size: 64, align: 8, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "wrec", scope: !763, file: !764, line: 500, baseType: !793, size: 448, align: 64, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment", scope: !763, file: !764, line: 505, baseType: !806, size: 16, align: 8, offset: 3200)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 16, align: 8, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 2)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "alert_fragment_len", scope: !763, file: !764, line: 506, baseType: !62, size: 32, align: 32, offset: 3232)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment", scope: !763, file: !764, line: 507, baseType: !811, size: 32, align: 8, offset: 3264)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, align: 8, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 4)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_fragment_len", scope: !763, file: !764, line: 508, baseType: !62, size: 32, align: 32, offset: 3296)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wnum", scope: !763, file: !764, line: 510, baseType: !62, size: 32, align: 32, offset: 3328)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_tot", scope: !763, file: !764, line: 511, baseType: !32, size: 32, align: 32, offset: 3360)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_type", scope: !763, file: !764, line: 512, baseType: !32, size: 32, align: 32, offset: 3392)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_ret", scope: !763, file: !764, line: 513, baseType: !32, size: 32, align: 32, offset: 3424)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "wpend_buf", scope: !763, file: !764, line: 514, baseType: !710, size: 64, align: 64, offset: 3456)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_buffer", scope: !763, file: !764, line: 516, baseType: !591, size: 64, align: 64, offset: 3520)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "handshake_dgst", scope: !763, file: !764, line: 521, baseType: !822, size: 64, align: 64, offset: 3584)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD_CTX", file: !584, line: 132, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_ctx_st", file: !826, line: 268, size: 384, align: 64, elements: !827)
!826 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!827 = !{!828, !876, !880, !881, !882, !886}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !825, file: !826, line: 269, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_MD", file: !584, line: 131, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "env_md_st", file: !826, line: 160, size: 960, align: 64, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !842, !846, !850, !856, !857, !862, !866, !870, !871, !872}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !832, file: !826, line: 161, baseType: !32, size: 32, align: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_type", scope: !832, file: !826, line: 162, baseType: !32, size: 32, align: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "md_size", scope: !832, file: !826, line: 163, baseType: !32, size: 32, align: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !832, file: !826, line: 164, baseType: !87, size: 64, align: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !832, file: !826, line: 165, baseType: !839, size: 64, align: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64, align: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!32, !823}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !832, file: !826, line: 166, baseType: !843, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64, align: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!32, !823, !200, !101}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !832, file: !826, line: 167, baseType: !847, size: 64, align: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!32, !823, !5}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "copy", scope: !832, file: !826, line: 168, baseType: !851, size: 64, align: 64, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!32, !823, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !832, file: !826, line: 169, baseType: !839, size: 64, align: 64, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !832, file: !826, line: 171, baseType: !858, size: 64, align: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!32, !32, !710, !62, !5, !861, !4}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !832, file: !826, line: 173, baseType: !863, size: 64, align: 64, offset: 576)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!32, !32, !710, !62, !710, !62, !4}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "required_pkey_type", scope: !832, file: !826, line: 176, baseType: !867, size: 160, align: 32, offset: 640)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 32, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 5)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !832, file: !826, line: 177, baseType: !32, size: 32, align: 32, offset: 800)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_size", scope: !832, file: !826, line: 178, baseType: !32, size: 32, align: 32, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "md_ctrl", scope: !832, file: !826, line: 180, baseType: !873, size: 64, align: 64, offset: 896)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!32, !823, !32, !32, !4}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !825, file: !826, line: 270, baseType: !877, size: 64, align: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !584, line: 177, baseType: !879)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !584, line: 177, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !825, file: !826, line: 272, baseType: !87, size: 64, align: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "md_data", scope: !825, file: !826, line: 273, baseType: !4, size: 64, align: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pctx", scope: !825, file: !826, line: 275, baseType: !883, size: 64, align: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_CTX", file: !584, line: 138, baseType: !885)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_ctx_st", file: !584, line: 138, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !825, file: !826, line: 277, baseType: !843, size: 64, align: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "change_cipher_spec", scope: !763, file: !764, line: 527, baseType: !32, size: 32, align: 32, offset: 3648)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "warn_alert", scope: !763, file: !764, line: 528, baseType: !32, size: 32, align: 32, offset: 3680)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_alert", scope: !763, file: !764, line: 529, baseType: !32, size: 32, align: 32, offset: 3712)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "alert_dispatch", scope: !763, file: !764, line: 534, baseType: !32, size: 32, align: 32, offset: 3744)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "send_alert", scope: !763, file: !764, line: 535, baseType: !806, size: 16, align: 8, offset: 3776)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "renegotiate", scope: !763, file: !764, line: 540, baseType: !32, size: 32, align: 32, offset: 3808)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "total_renegotiations", scope: !763, file: !764, line: 541, baseType: !32, size: 32, align: 32, offset: 3840)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "num_renegotiations", scope: !763, file: !764, line: 542, baseType: !32, size: 32, align: 32, offset: 3872)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "in_read_app_data", scope: !763, file: !764, line: 543, baseType: !32, size: 32, align: 32, offset: 3904)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input", scope: !763, file: !764, line: 549, baseType: !4, size: 64, align: 64, offset: 3968)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "client_opaque_prf_input_len", scope: !763, file: !764, line: 550, baseType: !101, size: 64, align: 64, offset: 4032)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input", scope: !763, file: !764, line: 551, baseType: !4, size: 64, align: 64, offset: 4096)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "server_opaque_prf_input_len", scope: !763, file: !764, line: 552, baseType: !101, size: 64, align: 64, offset: 4160)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !763, file: !764, line: 592, baseType: !901, size: 4224, align: 64, offset: 4224)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !763, file: !764, line: 553, size: 4224, align: 64, elements: !902)
!902 = !{!903, !907, !908, !909, !910, !911, !912, !913, !931, !1027, !1032, !1033, !1034, !1035, !1036, !1040, !1046, !1047, !1048, !1049, !1182, !1183, !1184, !1185, !1229}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cert_verify_md", scope: !901, file: !764, line: 555, baseType: !904, size: 1024, align: 8)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1024, align: 8, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md", scope: !901, file: !764, line: 557, baseType: !904, size: 1024, align: 8, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "finish_md_len", scope: !901, file: !764, line: 558, baseType: !32, size: 32, align: 32, offset: 2048)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md", scope: !901, file: !764, line: 559, baseType: !904, size: 1024, align: 8, offset: 2080)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "peer_finish_md_len", scope: !901, file: !764, line: 560, baseType: !32, size: 32, align: 32, offset: 3104)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !901, file: !764, line: 561, baseType: !87, size: 64, align: 64, offset: 3136)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "message_type", scope: !901, file: !764, line: 562, baseType: !32, size: 32, align: 32, offset: 3200)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "new_cipher", scope: !901, file: !764, line: 564, baseType: !914, size: 64, align: 64, offset: 3264)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CIPHER", file: !574, line: 375, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_cipher_st", file: !574, line: 418, size: 704, align: 64, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !917, file: !574, line: 419, baseType: !32, size: 32, align: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !917, file: !574, line: 420, baseType: !7, size: 64, align: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !917, file: !574, line: 421, baseType: !87, size: 64, align: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mkey", scope: !917, file: !574, line: 426, baseType: !87, size: 64, align: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_auth", scope: !917, file: !574, line: 427, baseType: !87, size: 64, align: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_enc", scope: !917, file: !574, line: 428, baseType: !87, size: 64, align: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_mac", scope: !917, file: !574, line: 429, baseType: !87, size: 64, align: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_ssl", scope: !917, file: !574, line: 430, baseType: !87, size: 64, align: 64, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "algo_strength", scope: !917, file: !574, line: 431, baseType: !87, size: 64, align: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm2", scope: !917, file: !574, line: 432, baseType: !87, size: 64, align: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "strength_bits", scope: !917, file: !574, line: 433, baseType: !32, size: 32, align: 32, offset: 640)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alg_bits", scope: !917, file: !574, line: 434, baseType: !32, size: 32, align: 32, offset: 672)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !901, file: !764, line: 566, baseType: !932, size: 64, align: 64, offset: 3328)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !584, line: 140, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !935, line: 135, size: 1152, align: 64, elements: !936)
!935 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!936 = !{!937, !938, !939, !951, !952, !953, !954, !955, !956, !968, !969, !970, !971, !972, !973, !974, !975, !1026}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !934, file: !935, line: 140, baseType: !32, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !934, file: !935, line: 141, baseType: !32, size: 32, align: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !934, file: !935, line: 142, baseType: !940, size: 64, align: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !584, line: 120, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !943, line: 313, size: 192, align: 64, elements: !944)
!943 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!944 = !{!945, !947, !948, !949, !950}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !942, file: !943, line: 314, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !942, file: !943, line: 316, baseType: !32, size: 32, align: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !942, file: !943, line: 318, baseType: !32, size: 32, align: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !942, file: !943, line: 319, baseType: !32, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !943, line: 320, baseType: !32, size: 32, align: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !934, file: !935, line: 143, baseType: !940, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !934, file: !935, line: 144, baseType: !199, size: 64, align: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !934, file: !935, line: 145, baseType: !940, size: 64, align: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !934, file: !935, line: 146, baseType: !940, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !934, file: !935, line: 147, baseType: !32, size: 32, align: 32, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !934, file: !935, line: 148, baseType: !957, size: 64, align: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !584, line: 123, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !943, line: 324, size: 832, align: 64, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !967}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !959, file: !943, line: 325, baseType: !32, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !959, file: !943, line: 326, baseType: !941, size: 192, align: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !959, file: !943, line: 327, baseType: !941, size: 192, align: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !959, file: !943, line: 328, baseType: !941, size: 192, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !959, file: !943, line: 330, baseType: !966, size: 128, align: 64, offset: 640)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, align: 64, elements: !807)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !943, line: 333, baseType: !32, size: 32, align: 32, offset: 768)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !934, file: !935, line: 150, baseType: !940, size: 64, align: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !934, file: !935, line: 151, baseType: !940, size: 64, align: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !934, file: !935, line: 152, baseType: !5, size: 64, align: 64, offset: 640)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !934, file: !935, line: 153, baseType: !32, size: 32, align: 32, offset: 704)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !934, file: !935, line: 154, baseType: !940, size: 64, align: 64, offset: 768)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !934, file: !935, line: 155, baseType: !32, size: 32, align: 32, offset: 832)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !934, file: !935, line: 156, baseType: !651, size: 128, align: 64, offset: 896)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !934, file: !935, line: 157, baseType: !976, size: 64, align: 64, offset: 1024)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
