; ModuleID = './line18-logpkt.o.i'
source_filename = "./line18-logpkt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pcap_file_hdr_t = type { i32, i16, i16, i32, i32, i32, i32 }
%struct.logpkt_ctx_t = type { %struct.libnet_context*, [6 x i8], [6 x i8], %struct.sockaddr_storage, %struct.sockaddr_storage, i32, i32, i64 }
%struct.sockaddr_storage = type { i16, [118 x i8], i64 }
%struct.libnet_context = type { i32, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block*, i32, i32, i32, i32, i8*, %struct.libnet_stats, i32, [64 x i8], [256 x i8], i32 }
%struct.libnet_protocol_block = type { i8*, i32, i16, i32, i8, i8, i32, %struct.libnet_protocol_block*, %struct.libnet_protocol_block* }
%struct.libnet_stats = type { i64, i64, i64 }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.libnet_ether_addr = type { [6 x i8] }
%struct.bpf_program = type { i32, %struct.bpf_insn* }
%struct.bpf_insn = type { i16, i8, i8, i32 }
%struct.logpkt_recv_arp_reply_ctx_t = type { i32, i32, [6 x i8] }
%struct.pcap = type opaque
%struct.pcap_pkthdr = type { %struct.timeval, i32, i32 }
%struct.timeval = type { i64, i64 }
%struct.libnet_802_3_hdr = type { [6 x i8], [6 x i8], i16 }
%struct.libnet_arp_hdr = type { i16, i16, i8, i8, i16 }
%struct.ether_hdr_t = type { [6 x i8], [6 x i8], i16 }
%struct.ip4_hdr_t = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ip6_hdr_t = type { i32, i16, i8, i8, [16 x i8], [16 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32)
!1 = !DIFile(filename: "line18-logpkt.o.i", directory: "/home/lichi/Desktop/sslsplit/task1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 40, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!6 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!7 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!8 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!9 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!10 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!11 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!12 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!13 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!14 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!15 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!16 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!17 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!18 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!19 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!20 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!21 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!22 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!23 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!24 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!25 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!26 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!27 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!28 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!29 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!30 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!31 = !DIEnumerator(name: "IPPROTO_MAX", value: 256)
!32 = !{!33, !35, !38, !39, !42, !47, !73, !86, !98, !112, !128, !129, !141, !154, !175, !97, !177, !187}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 51, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !36, line: 48, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_handler", file: !43, line: 237, baseType: !44)
!43 = !DIFile(filename: "/usr/include/pcap/pcap.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47, !52, !71}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !49, line: 33, baseType: !50)
!49 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_char", file: !51, line: 30, baseType: !41)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pcap_pkthdr", file: !43, line: 160, size: 192, align: 64, elements: !55)
!55 = !{!56, !65, !70}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ts", scope: !54, file: !43, line: 161, baseType: !57, size: 128, align: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !58, line: 30, size: 128, align: 64, elements: !59)
!58 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!59 = !{!60, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !57, file: !58, line: 32, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !51, line: 139, baseType: !62)
!62 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !57, file: !58, line: 33, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !51, line: 141, baseType: !62)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "caplen", scope: !54, file: !43, line: 162, baseType: !66, size: 32, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "bpf_u_int32", file: !67, line: 87, baseType: !68)
!67 = !DIFile(filename: "/usr/include/pcap/bpf.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !49, line: 35, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !51, line: 32, baseType: !37)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !43, line: 163, baseType: !66, size: 32, align: 32, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !76, line: 153, size: 128, align: 16, elements: !77)
!76 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!77 = !{!78, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !75, file: !76, line: 155, baseType: !79, size: 16, align: 16)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !80, line: 28, baseType: !81)
!80 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!81 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !75, file: !76, line: 156, baseType: !83, size: 112, align: 8, offset: 16)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 112, align: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 14)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ether_hdr_t", file: !88, line: 72, baseType: !89)
!88 = !DIFile(filename: "logpkt.c", directory: "/home/lichi/Desktop/sslsplit/task1")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 68, size: 112, align: 8, elements: !90)
!90 = !{!91, !95, !96}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "dst_mac", scope: !89, file: !88, line: 69, baseType: !92, size: 48, align: 8)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 48, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 6)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "src_mac", scope: !89, file: !88, line: 70, baseType: !92, size: 48, align: 8, offset: 48)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ethertype", scope: !89, file: !88, line: 71, baseType: !97, size: 16, align: 16, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !36, line: 49, baseType: !81)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip4_hdr_t", file: !88, line: 92, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 81, size: 160, align: 8, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "version_ihl", scope: !100, file: !88, line: 82, baseType: !40, size: 8, align: 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dscp_ecn", scope: !100, file: !88, line: 83, baseType: !40, size: 8, align: 8, offset: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !100, file: !88, line: 84, baseType: !97, size: 16, align: 16, offset: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !100, file: !88, line: 85, baseType: !97, size: 16, align: 16, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "frag", scope: !100, file: !88, line: 86, baseType: !97, size: 16, align: 16, offset: 48)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !100, file: !88, line: 87, baseType: !40, size: 8, align: 8, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !100, file: !88, line: 88, baseType: !40, size: 8, align: 8, offset: 72)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !100, file: !88, line: 89, baseType: !97, size: 16, align: 16, offset: 80)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !100, file: !88, line: 90, baseType: !35, size: 32, align: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !100, file: !88, line: 91, baseType: !35, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !4, line: 239, size: 128, align: 32, elements: !115)
!115 = !{!116, !117, !119, !124}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !114, file: !4, line: 241, baseType: !79, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !114, file: !4, line: 242, baseType: !118, size: 16, align: 16, offset: 16)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !4, line: 119, baseType: !97)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !114, file: !4, line: 243, baseType: !120, size: 32, align: 32, offset: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !4, line: 31, size: 32, align: 32, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !120, file: !4, line: 33, baseType: !123, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !4, line: 30, baseType: !35)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !114, file: !4, line: 246, baseType: !125, size: 64, align: 8, offset: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcp_hdr_t", file: !88, line: 112, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 103, size: 160, align: 8, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !131, file: !88, line: 104, baseType: !97, size: 16, align: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !131, file: !88, line: 105, baseType: !97, size: 16, align: 16, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !131, file: !88, line: 106, baseType: !35, size: 32, align: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !131, file: !88, line: 107, baseType: !35, size: 32, align: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !88, line: 108, baseType: !97, size: 16, align: 16, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !131, file: !88, line: 109, baseType: !97, size: 16, align: 16, offset: 112)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chksum", scope: !131, file: !88, line: 110, baseType: !97, size: 16, align: 16, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "urgp", scope: !131, file: !88, line: 111, baseType: !97, size: 16, align: 16, offset: 144)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ip6_hdr_t", file: !88, line: 101, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 94, size: 320, align: 8, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !153}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !88, line: 95, baseType: !35, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !143, file: !88, line: 96, baseType: !97, size: 16, align: 16, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next_hdr", scope: !143, file: !88, line: 97, baseType: !40, size: 8, align: 8, offset: 48)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !143, file: !88, line: 98, baseType: !40, size: 8, align: 8, offset: 56)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !143, file: !88, line: 99, baseType: !150, size: 128, align: 8, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, align: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !143, file: !88, line: 100, baseType: !150, size: 128, align: 8, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !4, line: 254, size: 224, align: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !174}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !156, file: !4, line: 256, baseType: !79, size: 16, align: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !156, file: !4, line: 257, baseType: !118, size: 16, align: 16, offset: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !156, file: !4, line: 258, baseType: !35, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !156, file: !4, line: 259, baseType: !162, size: 128, align: 32, offset: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !4, line: 211, size: 128, align: 32, elements: !163)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !162, file: !4, line: 220, baseType: !165, size: 128, align: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !162, file: !4, line: 213, size: 128, align: 32, elements: !166)
!166 = !{!167, !168, !170}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !165, file: !4, line: 215, baseType: !150, size: 128, align: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !165, file: !4, line: 217, baseType: !169, size: 128, align: 16)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, align: 16, elements: !126)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !165, file: !4, line: 218, baseType: !171, size: 128, align: 32)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, align: 32, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 4)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !156, file: !4, line: 260, baseType: !35, size: 32, align: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !49, line: 109, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !51, line: 172, baseType: !62)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_in6_addr", file: !179, line: 741, size: 128, align: 32, elements: !180)
!179 = !DIFile(filename: "/usr/include/libnet/libnet-headers.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr", scope: !178, file: !179, line: 748, baseType: !182, size: 128, align: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !178, file: !179, line: 743, size: 128, align: 32, elements: !183)
!183 = !{!184, !185, !186}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !182, file: !179, line: 745, baseType: !150, size: 128, align: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !182, file: !179, line: 746, baseType: !169, size: 128, align: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !182, file: !179, line: 747, baseType: !171, size: 128, align: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "logpkt_recv_arp_reply_ctx_t", file: !88, line: 685, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 681, size: 128, align: 32, elements: !190)
!190 = !{!191, !192, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !189, file: !88, line: 682, baseType: !35, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !189, file: !88, line: 683, baseType: !193, size: 32, align: 32, offset: 32)
!193 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ether", scope: !189, file: !88, line: 684, baseType: !92, size: 48, align: 8, offset: 64)
!195 = !{i32 2, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!198 = distinct !DISubprogram(name: "logpkt_pcap_open_fd", scope: !88, file: !88, line: 218, type: !199, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!199 = !DISubroutineType(types: !200)
!200 = !{!193, !193}
!201 = !{}
!202 = !DILocalVariable(name: "fd", arg: 1, scope: !198, file: !88, line: 218, type: !193)
!203 = !DIExpression()
!204 = !DILocation(line: 218, column: 25, scope: !198)
!205 = !DILocalVariable(name: "hdr", scope: !198, file: !88, line: 219, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_file_hdr_t", file: !88, line: 57, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 49, size: 192, align: 8, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "magic_number", scope: !207, file: !88, line: 50, baseType: !35, size: 32, align: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "version_major", scope: !207, file: !88, line: 51, baseType: !97, size: 16, align: 16, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "version_minor", scope: !207, file: !88, line: 52, baseType: !97, size: 16, align: 16, offset: 48)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "thiszone", scope: !207, file: !88, line: 53, baseType: !35, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sigfigs", scope: !207, file: !88, line: 54, baseType: !35, size: 32, align: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "snaplen", scope: !207, file: !88, line: 55, baseType: !35, size: 32, align: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "network", scope: !207, file: !88, line: 56, baseType: !35, size: 32, align: 32, offset: 160)
!216 = !DILocation(line: 219, column: 18, scope: !198)
!217 = !DILocalVariable(name: "sz", scope: !198, file: !88, line: 220, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !49, line: 86, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !51, line: 131, baseType: !62)
!220 = !DILocation(line: 220, column: 8, scope: !198)
!221 = !DILocalVariable(name: "n", scope: !198, file: !88, line: 221, type: !175)
!222 = !DILocation(line: 221, column: 10, scope: !198)
!223 = !DILocation(line: 223, column: 13, scope: !198)
!224 = !DILocation(line: 223, column: 7, scope: !198)
!225 = !DILocation(line: 223, column: 5, scope: !198)
!226 = !DILocation(line: 224, column: 6, scope: !227)
!227 = distinct !DILexicalBlock(scope: !198, file: !88, line: 224, column: 6)
!228 = !DILocation(line: 224, column: 9, scope: !227)
!229 = !DILocation(line: 224, column: 6, scope: !198)
!230 = !DILocation(line: 225, column: 3, scope: !227)
!231 = !DILocation(line: 227, column: 6, scope: !232)
!232 = distinct !DILexicalBlock(scope: !198, file: !88, line: 227, column: 6)
!233 = !DILocation(line: 227, column: 9, scope: !232)
!234 = !DILocation(line: 227, column: 6, scope: !198)
!235 = !DILocation(line: 228, column: 13, scope: !236)
!236 = distinct !DILexicalBlock(scope: !237, file: !88, line: 228, column: 7)
!237 = distinct !DILexicalBlock(scope: !232, file: !88, line: 227, column: 14)
!238 = !DILocation(line: 228, column: 7, scope: !236)
!239 = !DILocation(line: 228, column: 29, scope: !236)
!240 = !DILocation(line: 228, column: 7, scope: !237)
!241 = !DILocation(line: 229, column: 4, scope: !236)
!242 = !DILocation(line: 230, column: 12, scope: !237)
!243 = !DILocation(line: 230, column: 16, scope: !237)
!244 = !DILocation(line: 230, column: 7, scope: !237)
!245 = !DILocation(line: 230, column: 5, scope: !237)
!246 = !DILocation(line: 231, column: 7, scope: !247)
!247 = distinct !DILexicalBlock(scope: !237, file: !88, line: 231, column: 7)
!248 = !DILocation(line: 231, column: 9, scope: !247)
!249 = !DILocation(line: 231, column: 7, scope: !237)
!250 = !DILocation(line: 232, column: 4, scope: !247)
!251 = !DILocation(line: 233, column: 11, scope: !252)
!252 = distinct !DILexicalBlock(scope: !237, file: !88, line: 233, column: 7)
!253 = !DILocation(line: 233, column: 24, scope: !252)
!254 = !DILocation(line: 233, column: 7, scope: !237)
!255 = !DILocation(line: 234, column: 17, scope: !252)
!256 = !DILocation(line: 234, column: 11, scope: !252)
!257 = !DILocation(line: 234, column: 33, scope: !252)
!258 = !DILocation(line: 234, column: 4, scope: !252)
!259 = !DILocation(line: 235, column: 13, scope: !260)
!260 = distinct !DILexicalBlock(scope: !237, file: !88, line: 235, column: 7)
!261 = !DILocation(line: 235, column: 7, scope: !260)
!262 = !DILocation(line: 235, column: 29, scope: !260)
!263 = !DILocation(line: 235, column: 7, scope: !237)
!264 = !DILocation(line: 236, column: 4, scope: !260)
!265 = !DILocation(line: 237, column: 17, scope: !266)
!266 = distinct !DILexicalBlock(scope: !237, file: !88, line: 237, column: 7)
!267 = !DILocation(line: 237, column: 7, scope: !266)
!268 = !DILocation(line: 237, column: 24, scope: !266)
!269 = !DILocation(line: 237, column: 7, scope: !237)
!270 = !DILocation(line: 238, column: 4, scope: !266)
!271 = !DILocation(line: 239, column: 2, scope: !237)
!272 = !DILocation(line: 241, column: 38, scope: !198)
!273 = !DILocation(line: 241, column: 9, scope: !198)
!274 = !DILocation(line: 241, column: 2, scope: !198)
!275 = !DILocation(line: 242, column: 1, scope: !198)
!276 = distinct !DISubprogram(name: "logpkt_write_global_pcap_hdr", scope: !88, file: !88, line: 193, type: !199, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!277 = !DILocalVariable(name: "fd", arg: 1, scope: !276, file: !88, line: 193, type: !193)
!278 = !DILocation(line: 193, column: 34, scope: !276)
!279 = !DILocalVariable(name: "hdr", scope: !276, file: !88, line: 195, type: !206)
!280 = !DILocation(line: 195, column: 18, scope: !276)
!281 = !DILocation(line: 197, column: 2, scope: !276)
!282 = !DILocation(line: 198, column: 6, scope: !276)
!283 = !DILocation(line: 198, column: 19, scope: !276)
!284 = !DILocation(line: 199, column: 6, scope: !276)
!285 = !DILocation(line: 199, column: 20, scope: !276)
!286 = !DILocation(line: 200, column: 6, scope: !276)
!287 = !DILocation(line: 200, column: 20, scope: !276)
!288 = !DILocation(line: 201, column: 6, scope: !276)
!289 = !DILocation(line: 201, column: 14, scope: !276)
!290 = !DILocation(line: 202, column: 6, scope: !276)
!291 = !DILocation(line: 202, column: 14, scope: !276)
!292 = !DILocation(line: 203, column: 15, scope: !276)
!293 = !DILocation(line: 203, column: 19, scope: !276)
!294 = !DILocation(line: 203, column: 9, scope: !276)
!295 = !DILocation(line: 203, column: 38, scope: !276)
!296 = !DILocation(line: 203, column: 2, scope: !276)
!297 = distinct !DISubprogram(name: "logpkt_ctx_init", scope: !88, file: !88, line: 254, type: !298, isLocal: false, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300, !306, !369, !371, !371, !73, !373, !73, !373}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "logpkt_ctx_t", file: !302, line: 54, baseType: !303)
!302 = !DIFile(filename: "logpkt.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !302, line: 45, size: 2368, align: 64, elements: !304)
!304 = !{!305, !354, !355, !356, !365, !366, !367, !368}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "libnet", scope: !303, file: !302, line: 46, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_t", file: !308, line: 235, baseType: !309)
!308 = !DIFile(filename: "/usr/include/libnet/libnet-structures.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_context", file: !308, line: 186, size: 3200, align: 64, elements: !310)
!310 = !{!311, !312, !313, !330, !331, !332, !333, !334, !335, !336, !344, !345, !349, !353}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !309, file: !308, line: 192, baseType: !193, size: 32, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "injection_type", scope: !309, file: !308, line: 194, baseType: !193, size: 32, align: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blocks", scope: !309, file: !308, line: 206, baseType: !314, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_pblock_t", file: !308, line: 178, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_protocol_block", file: !308, line: 77, size: 384, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !327, !329}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !316, file: !308, line: 79, baseType: !39, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_len", scope: !316, file: !308, line: 80, baseType: !35, size: 32, align: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "h_len", scope: !316, file: !308, line: 81, baseType: !97, size: 16, align: 16, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "copied", scope: !316, file: !308, line: 92, baseType: !35, size: 32, align: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !308, line: 94, baseType: !40, size: 8, align: 8, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !308, line: 168, baseType: !40, size: 8, align: 8, offset: 168)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ptag", scope: !316, file: !308, line: 170, baseType: !325, size: 32, align: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "libnet_ptag_t", file: !308, line: 70, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !49, line: 196, baseType: !193)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !308, line: 175, baseType: !328, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !316, file: !308, line: 176, baseType: !328, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pblock_end", scope: !309, file: !308, line: 207, baseType: !314, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "n_pblocks", scope: !309, file: !308, line: 208, baseType: !35, size: 32, align: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "link_type", scope: !309, file: !308, line: 210, baseType: !193, size: 32, align: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "link_offset", scope: !309, file: !308, line: 224, baseType: !193, size: 32, align: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "aligner", scope: !309, file: !308, line: 225, baseType: !193, size: 32, align: 32, offset: 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !309, file: !308, line: 226, baseType: !33, size: 64, align: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !309, file: !308, line: 228, baseType: !337, size: 192, align: 64, offset: 384)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_stats", file: !308, line: 52, size: 192, align: 64, elements: !338)
!338 = !{!339, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "packets_sent", scope: !337, file: !308, line: 55, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !36, line: 55, baseType: !341)
!341 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "packet_errors", scope: !337, file: !308, line: 56, baseType: !340, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_written", scope: !337, file: !308, line: 57, baseType: !340, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ptag_state", scope: !309, file: !308, line: 229, baseType: !325, size: 32, align: 32, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !309, file: !308, line: 230, baseType: !346, size: 512, align: 8, offset: 608)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 512, align: 8, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "err_buf", scope: !309, file: !308, line: 232, baseType: !350, size: 2048, align: 8, offset: 1120)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, align: 8, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !309, file: !308, line: 233, baseType: !35, size: 32, align: 32, offset: 3168)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "src_ether", scope: !303, file: !302, line: 47, baseType: !92, size: 48, align: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ether", scope: !303, file: !302, line: 48, baseType: !92, size: 48, align: 8, offset: 112)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr", scope: !303, file: !302, line: 49, baseType: !357, size: 1024, align: 64, offset: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", file: !76, line: 166, size: 1024, align: 64, elements: !358)
!358 = !{!359, !360, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !357, file: !76, line: 168, baseType: !79, size: 16, align: 16)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_padding", scope: !357, file: !76, line: 169, baseType: !361, size: 944, align: 8, offset: 16)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 944, align: 8, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 118)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !357, file: !76, line: 170, baseType: !341, size: 64, align: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr", scope: !303, file: !302, line: 50, baseType: !357, size: 1024, align: 64, offset: 1216)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "src_seq", scope: !303, file: !302, line: 51, baseType: !35, size: 32, align: 32, offset: 2240)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dst_seq", scope: !303, file: !302, line: 52, baseType: !35, size: 32, align: 32, offset: 2272)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mss", scope: !303, file: !302, line: 53, baseType: !369, size: 64, align: 64, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !370, line: 216, baseType: !341)
!370 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/sslsplit/task1")
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !76, line: 33, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !51, line: 189, baseType: !37)
!375 = !DILocalVariable(name: "ctx", arg: 1, scope: !297, file: !88, line: 254, type: !300)
!376 = !DILocation(line: 254, column: 31, scope: !297)
!377 = !DILocalVariable(name: "libnet", arg: 2, scope: !297, file: !88, line: 254, type: !306)
!378 = !DILocation(line: 254, column: 46, scope: !297)
!379 = !DILocalVariable(name: "mtu", arg: 3, scope: !297, file: !88, line: 254, type: !369)
!380 = !DILocation(line: 254, column: 61, scope: !297)
!381 = !DILocalVariable(name: "src_ether", arg: 4, scope: !297, file: !88, line: 255, type: !371)
!382 = !DILocation(line: 255, column: 32, scope: !297)
!383 = !DILocalVariable(name: "dst_ether", arg: 5, scope: !297, file: !88, line: 255, type: !371)
!384 = !DILocation(line: 255, column: 58, scope: !297)
!385 = !DILocalVariable(name: "src_addr", arg: 6, scope: !297, file: !88, line: 256, type: !73)
!386 = !DILocation(line: 256, column: 40, scope: !297)
!387 = !DILocalVariable(name: "src_addr_len", arg: 7, scope: !297, file: !88, line: 256, type: !373)
!388 = !DILocation(line: 256, column: 60, scope: !297)
!389 = !DILocalVariable(name: "dst_addr", arg: 8, scope: !297, file: !88, line: 257, type: !73)
!390 = !DILocation(line: 257, column: 40, scope: !297)
!391 = !DILocalVariable(name: "dst_addr_len", arg: 9, scope: !297, file: !88, line: 257, type: !373)
!392 = !DILocation(line: 257, column: 60, scope: !297)
!393 = !DILocation(line: 259, column: 16, scope: !297)
!394 = !DILocation(line: 259, column: 2, scope: !297)
!395 = !DILocation(line: 259, column: 7, scope: !297)
!396 = !DILocation(line: 259, column: 14, scope: !297)
!397 = !DILocation(line: 260, column: 9, scope: !297)
!398 = !DILocation(line: 260, column: 14, scope: !297)
!399 = !DILocation(line: 260, column: 2, scope: !297)
!400 = !DILocation(line: 260, column: 25, scope: !297)
!401 = !DILocation(line: 261, column: 9, scope: !297)
!402 = !DILocation(line: 261, column: 14, scope: !297)
!403 = !DILocation(line: 261, column: 2, scope: !297)
!404 = !DILocation(line: 261, column: 25, scope: !297)
!405 = !DILocation(line: 262, column: 10, scope: !297)
!406 = !DILocation(line: 262, column: 15, scope: !297)
!407 = !DILocation(line: 262, column: 2, scope: !297)
!408 = !DILocation(line: 262, column: 25, scope: !297)
!409 = !DILocation(line: 262, column: 35, scope: !297)
!410 = !DILocation(line: 263, column: 10, scope: !297)
!411 = !DILocation(line: 263, column: 15, scope: !297)
!412 = !DILocation(line: 263, column: 2, scope: !297)
!413 = !DILocation(line: 263, column: 25, scope: !297)
!414 = !DILocation(line: 263, column: 35, scope: !297)
!415 = !DILocation(line: 264, column: 2, scope: !297)
!416 = !DILocation(line: 264, column: 7, scope: !297)
!417 = !DILocation(line: 264, column: 15, scope: !297)
!418 = !DILocation(line: 265, column: 2, scope: !297)
!419 = !DILocation(line: 265, column: 7, scope: !297)
!420 = !DILocation(line: 265, column: 15, scope: !297)
!421 = !DILocation(line: 266, column: 6, scope: !422)
!422 = distinct !DILexicalBlock(scope: !297, file: !88, line: 266, column: 6)
!423 = !DILocation(line: 266, column: 6, scope: !297)
!424 = !DILocation(line: 267, column: 14, scope: !425)
!425 = distinct !DILexicalBlock(scope: !422, file: !88, line: 266, column: 11)
!426 = !DILocation(line: 267, column: 18, scope: !425)
!427 = !DILocation(line: 268, column: 21, scope: !425)
!428 = !DILocation(line: 268, column: 31, scope: !425)
!429 = !DILocation(line: 268, column: 41, scope: !425)
!430 = !DILocation(line: 268, column: 18, scope: !425)
!431 = !DILocation(line: 267, column: 3, scope: !425)
!432 = !DILocation(line: 267, column: 8, scope: !425)
!433 = !DILocation(line: 267, column: 12, scope: !425)
!434 = !DILocation(line: 271, column: 2, scope: !425)
!435 = !DILocation(line: 272, column: 14, scope: !436)
!436 = distinct !DILexicalBlock(scope: !422, file: !88, line: 271, column: 9)
!437 = !DILocation(line: 272, column: 24, scope: !436)
!438 = !DILocation(line: 272, column: 34, scope: !436)
!439 = !DILocation(line: 272, column: 3, scope: !436)
!440 = !DILocation(line: 272, column: 8, scope: !436)
!441 = !DILocation(line: 272, column: 12, scope: !436)
!442 = !DILocation(line: 274, column: 1, scope: !297)
!443 = distinct !DISubprogram(name: "logpkt_write_payload", scope: !88, file: !88, line: 598, type: !444, isLocal: false, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!444 = !DISubroutineType(types: !445)
!445 = !{!193, !300, !193, !193, !371, !369}
!446 = !DILocalVariable(name: "ctx", arg: 1, scope: !443, file: !88, line: 598, type: !300)
!447 = !DILocation(line: 598, column: 36, scope: !443)
!448 = !DILocalVariable(name: "fd", arg: 2, scope: !443, file: !88, line: 598, type: !193)
!449 = !DILocation(line: 598, column: 45, scope: !443)
!450 = !DILocalVariable(name: "direction", arg: 3, scope: !443, file: !88, line: 598, type: !193)
!451 = !DILocation(line: 598, column: 53, scope: !443)
!452 = !DILocalVariable(name: "payload", arg: 4, scope: !443, file: !88, line: 599, type: !371)
!453 = !DILocation(line: 599, column: 37, scope: !443)
!454 = !DILocalVariable(name: "payloadlen", arg: 5, scope: !443, file: !88, line: 599, type: !369)
!455 = !DILocation(line: 599, column: 53, scope: !443)
!456 = !DILocalVariable(name: "other_direction", scope: !443, file: !88, line: 601, type: !193)
!457 = !DILocation(line: 601, column: 6, scope: !443)
!458 = !DILocation(line: 601, column: 25, scope: !443)
!459 = !DILocation(line: 601, column: 35, scope: !443)
!460 = !DILocation(line: 601, column: 24, scope: !443)
!461 = !DILocation(line: 604, column: 6, scope: !462)
!462 = distinct !DILexicalBlock(scope: !443, file: !88, line: 604, column: 6)
!463 = !DILocation(line: 604, column: 11, scope: !462)
!464 = !DILocation(line: 604, column: 19, scope: !462)
!465 = !DILocation(line: 604, column: 6, scope: !443)
!466 = !DILocation(line: 605, column: 34, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !88, line: 605, column: 7)
!468 = distinct !DILexicalBlock(scope: !462, file: !88, line: 604, column: 25)
!469 = !DILocation(line: 605, column: 39, scope: !467)
!470 = !DILocation(line: 605, column: 7, scope: !467)
!471 = !DILocation(line: 605, column: 43, scope: !467)
!472 = !DILocation(line: 605, column: 7, scope: !468)
!473 = !DILocation(line: 606, column: 4, scope: !467)
!474 = !DILocation(line: 607, column: 2, scope: !468)
!475 = !DILocation(line: 609, column: 2, scope: !443)
!476 = !DILocation(line: 609, column: 9, scope: !477)
!477 = !DILexicalBlockFile(scope: !443, file: !88, discriminator: 1)
!478 = !DILocation(line: 609, column: 20, scope: !477)
!479 = !DILocation(line: 609, column: 2, scope: !477)
!480 = !DILocalVariable(name: "n", scope: !481, file: !88, line: 610, type: !369)
!481 = distinct !DILexicalBlock(scope: !443, file: !88, line: 609, column: 25)
!482 = !DILocation(line: 610, column: 10, scope: !481)
!483 = !DILocation(line: 610, column: 14, scope: !481)
!484 = !DILocation(line: 610, column: 27, scope: !481)
!485 = !DILocation(line: 610, column: 32, scope: !481)
!486 = !DILocation(line: 610, column: 25, scope: !481)
!487 = !DILocation(line: 610, column: 38, scope: !488)
!488 = !DILexicalBlockFile(scope: !481, file: !88, discriminator: 1)
!489 = !DILocation(line: 610, column: 43, scope: !488)
!490 = !DILocation(line: 610, column: 14, scope: !488)
!491 = !DILocation(line: 610, column: 49, scope: !492)
!492 = !DILexicalBlockFile(scope: !481, file: !88, discriminator: 2)
!493 = !DILocation(line: 610, column: 14, scope: !492)
!494 = !DILocation(line: 610, column: 14, scope: !495)
!495 = !DILexicalBlockFile(scope: !481, file: !88, discriminator: 3)
!496 = !DILocation(line: 610, column: 10, scope: !495)
!497 = !DILocation(line: 611, column: 27, scope: !498)
!498 = distinct !DILexicalBlock(scope: !481, file: !88, line: 611, column: 7)
!499 = !DILocation(line: 611, column: 32, scope: !498)
!500 = !DILocation(line: 611, column: 36, scope: !498)
!501 = !DILocation(line: 612, column: 42, scope: !498)
!502 = !DILocation(line: 612, column: 51, scope: !498)
!503 = !DILocation(line: 611, column: 7, scope: !498)
!504 = !DILocation(line: 612, column: 54, scope: !498)
!505 = !DILocation(line: 611, column: 7, scope: !481)
!506 = !DILocation(line: 614, column: 39, scope: !507)
!507 = distinct !DILexicalBlock(scope: !498, file: !88, line: 612, column: 61)
!508 = !DILocation(line: 614, column: 38, scope: !507)
!509 = !DILocation(line: 614, column: 29, scope: !510)
!510 = !DILexicalBlockFile(scope: !507, file: !88, discriminator: 1)
!511 = !DILocation(line: 613, column: 4, scope: !507)
!512 = !DILocation(line: 615, column: 4, scope: !507)
!513 = !DILocation(line: 617, column: 7, scope: !514)
!514 = distinct !DILexicalBlock(scope: !481, file: !88, line: 617, column: 7)
!515 = !DILocation(line: 617, column: 17, scope: !514)
!516 = !DILocation(line: 617, column: 7, scope: !481)
!517 = !DILocation(line: 618, column: 20, scope: !518)
!518 = distinct !DILexicalBlock(scope: !514, file: !88, line: 617, column: 23)
!519 = !DILocation(line: 618, column: 4, scope: !518)
!520 = !DILocation(line: 618, column: 9, scope: !518)
!521 = !DILocation(line: 618, column: 17, scope: !518)
!522 = !DILocation(line: 619, column: 3, scope: !518)
!523 = !DILocation(line: 620, column: 20, scope: !524)
!524 = distinct !DILexicalBlock(scope: !514, file: !88, line: 619, column: 10)
!525 = !DILocation(line: 620, column: 4, scope: !524)
!526 = !DILocation(line: 620, column: 9, scope: !524)
!527 = !DILocation(line: 620, column: 17, scope: !524)
!528 = !DILocation(line: 622, column: 14, scope: !481)
!529 = !DILocation(line: 622, column: 11, scope: !481)
!530 = !DILocation(line: 623, column: 17, scope: !481)
!531 = !DILocation(line: 623, column: 14, scope: !481)
!532 = !DILocation(line: 609, column: 2, scope: !533)
!533 = !DILexicalBlockFile(scope: !443, file: !88, discriminator: 2)
!534 = distinct !{!534, !475}
!535 = !DILocation(line: 626, column: 26, scope: !536)
!536 = distinct !DILexicalBlock(scope: !443, file: !88, line: 626, column: 6)
!537 = !DILocation(line: 626, column: 31, scope: !536)
!538 = !DILocation(line: 626, column: 35, scope: !536)
!539 = !DILocation(line: 626, column: 6, scope: !536)
!540 = !DILocation(line: 627, column: 42, scope: !536)
!541 = !DILocation(line: 626, column: 6, scope: !443)
!542 = !DILocation(line: 629, column: 28, scope: !543)
!543 = distinct !DILexicalBlock(scope: !536, file: !88, line: 627, column: 49)
!544 = !DILocation(line: 629, column: 27, scope: !543)
!545 = !DILocation(line: 629, column: 18, scope: !546)
!546 = !DILexicalBlockFile(scope: !543, file: !88, discriminator: 1)
!547 = !DILocation(line: 628, column: 3, scope: !543)
!548 = !DILocation(line: 630, column: 3, scope: !543)
!549 = !DILocation(line: 632, column: 2, scope: !443)
!550 = !DILocation(line: 633, column: 1, scope: !443)
!551 = distinct !DISubprogram(name: "logpkt_write_syn_handshake", scope: !88, file: !88, line: 574, type: !552, isLocal: true, isDefinition: true, scopeLine: 575, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!552 = !DISubroutineType(types: !553)
!553 = !{!193, !300, !193}
!554 = !DILocalVariable(name: "ctx", arg: 1, scope: !551, file: !88, line: 574, type: !300)
!555 = !DILocation(line: 574, column: 42, scope: !551)
!556 = !DILocalVariable(name: "fd", arg: 2, scope: !551, file: !88, line: 574, type: !193)
!557 = !DILocation(line: 574, column: 51, scope: !551)
!558 = !DILocation(line: 576, column: 17, scope: !551)
!559 = !DILocation(line: 576, column: 2, scope: !551)
!560 = !DILocation(line: 576, column: 7, scope: !551)
!561 = !DILocation(line: 576, column: 15, scope: !551)
!562 = !DILocation(line: 577, column: 26, scope: !563)
!563 = distinct !DILexicalBlock(scope: !551, file: !88, line: 577, column: 6)
!564 = !DILocation(line: 577, column: 31, scope: !563)
!565 = !DILocation(line: 577, column: 6, scope: !563)
!566 = !DILocation(line: 578, column: 42, scope: !563)
!567 = !DILocation(line: 577, column: 6, scope: !551)
!568 = !DILocation(line: 579, column: 3, scope: !563)
!569 = !DILocation(line: 580, column: 2, scope: !551)
!570 = !DILocation(line: 580, column: 7, scope: !551)
!571 = !DILocation(line: 580, column: 15, scope: !551)
!572 = !DILocation(line: 581, column: 17, scope: !551)
!573 = !DILocation(line: 581, column: 2, scope: !551)
!574 = !DILocation(line: 581, column: 7, scope: !551)
!575 = !DILocation(line: 581, column: 15, scope: !551)
!576 = !DILocation(line: 582, column: 26, scope: !577)
!577 = distinct !DILexicalBlock(scope: !551, file: !88, line: 582, column: 6)
!578 = !DILocation(line: 582, column: 31, scope: !577)
!579 = !DILocation(line: 582, column: 6, scope: !577)
!580 = !DILocation(line: 583, column: 49, scope: !577)
!581 = !DILocation(line: 582, column: 6, scope: !551)
!582 = !DILocation(line: 584, column: 3, scope: !577)
!583 = !DILocation(line: 585, column: 2, scope: !551)
!584 = !DILocation(line: 585, column: 7, scope: !551)
!585 = !DILocation(line: 585, column: 15, scope: !551)
!586 = !DILocation(line: 586, column: 26, scope: !587)
!587 = distinct !DILexicalBlock(scope: !551, file: !88, line: 586, column: 6)
!588 = !DILocation(line: 586, column: 31, scope: !587)
!589 = !DILocation(line: 586, column: 6, scope: !587)
!590 = !DILocation(line: 587, column: 42, scope: !587)
!591 = !DILocation(line: 586, column: 6, scope: !551)
!592 = !DILocation(line: 588, column: 3, scope: !587)
!593 = !DILocation(line: 589, column: 2, scope: !551)
!594 = !DILocation(line: 590, column: 1, scope: !551)
!595 = distinct !DISubprogram(name: "logpkt_write_packet", scope: !88, file: !88, line: 501, type: !596, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!596 = !DISubroutineType(types: !597)
!597 = !{!193, !300, !193, !193, !34, !371, !369}
!598 = !DILocalVariable(name: "ctx", arg: 1, scope: !595, file: !88, line: 501, type: !300)
!599 = !DILocation(line: 501, column: 35, scope: !595)
!600 = !DILocalVariable(name: "fd", arg: 2, scope: !595, file: !88, line: 501, type: !193)
!601 = !DILocation(line: 501, column: 44, scope: !595)
!602 = !DILocalVariable(name: "direction", arg: 3, scope: !595, file: !88, line: 501, type: !193)
!603 = !DILocation(line: 501, column: 52, scope: !595)
!604 = !DILocalVariable(name: "flags", arg: 4, scope: !595, file: !88, line: 501, type: !34)
!605 = !DILocation(line: 501, column: 68, scope: !595)
!606 = !DILocalVariable(name: "payload", arg: 5, scope: !595, file: !88, line: 502, type: !371)
!607 = !DILocation(line: 502, column: 36, scope: !595)
!608 = !DILocalVariable(name: "payloadlen", arg: 6, scope: !595, file: !88, line: 502, type: !369)
!609 = !DILocation(line: 502, column: 52, scope: !595)
!610 = !DILocalVariable(name: "rv", scope: !595, file: !88, line: 504, type: !193)
!611 = !DILocation(line: 504, column: 6, scope: !595)
!612 = !DILocation(line: 506, column: 6, scope: !613)
!613 = distinct !DILexicalBlock(scope: !595, file: !88, line: 506, column: 6)
!614 = !DILocation(line: 506, column: 9, scope: !613)
!615 = !DILocation(line: 506, column: 6, scope: !595)
!616 = !DILocalVariable(name: "buf", scope: !617, file: !88, line: 507, type: !618)
!617 = distinct !DILexicalBlock(scope: !613, file: !88, line: 506, column: 16)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 12112, align: 8, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 1514)
!621 = !DILocation(line: 507, column: 11, scope: !617)
!622 = !DILocalVariable(name: "sz", scope: !617, file: !88, line: 508, type: !369)
!623 = !DILocation(line: 508, column: 10, scope: !617)
!624 = !DILocation(line: 509, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !617, file: !88, line: 509, column: 7)
!626 = !DILocation(line: 509, column: 17, scope: !625)
!627 = !DILocation(line: 509, column: 7, scope: !617)
!628 = !DILocation(line: 510, column: 27, scope: !629)
!629 = distinct !DILexicalBlock(scope: !625, file: !88, line: 509, column: 23)
!630 = !DILocation(line: 511, column: 27, scope: !629)
!631 = !DILocation(line: 511, column: 32, scope: !629)
!632 = !DILocation(line: 511, column: 43, scope: !629)
!633 = !DILocation(line: 511, column: 48, scope: !629)
!634 = !DILocation(line: 512, column: 55, scope: !629)
!635 = !DILocation(line: 512, column: 60, scope: !629)
!636 = !DILocation(line: 512, column: 28, scope: !629)
!637 = !DILocation(line: 513, column: 55, scope: !629)
!638 = !DILocation(line: 513, column: 60, scope: !629)
!639 = !DILocation(line: 513, column: 28, scope: !629)
!640 = !DILocation(line: 514, column: 27, scope: !629)
!641 = !DILocation(line: 515, column: 27, scope: !629)
!642 = !DILocation(line: 515, column: 32, scope: !629)
!643 = !DILocation(line: 515, column: 41, scope: !629)
!644 = !DILocation(line: 515, column: 46, scope: !629)
!645 = !DILocation(line: 516, column: 27, scope: !629)
!646 = !DILocation(line: 516, column: 36, scope: !629)
!647 = !DILocation(line: 510, column: 9, scope: !629)
!648 = !DILocation(line: 510, column: 7, scope: !629)
!649 = !DILocation(line: 517, column: 3, scope: !629)
!650 = !DILocation(line: 518, column: 27, scope: !651)
!651 = distinct !DILexicalBlock(scope: !625, file: !88, line: 517, column: 10)
!652 = !DILocation(line: 519, column: 27, scope: !651)
!653 = !DILocation(line: 519, column: 32, scope: !651)
!654 = !DILocation(line: 519, column: 43, scope: !651)
!655 = !DILocation(line: 519, column: 48, scope: !651)
!656 = !DILocation(line: 520, column: 55, scope: !651)
!657 = !DILocation(line: 520, column: 60, scope: !651)
!658 = !DILocation(line: 520, column: 28, scope: !651)
!659 = !DILocation(line: 521, column: 55, scope: !651)
!660 = !DILocation(line: 521, column: 60, scope: !651)
!661 = !DILocation(line: 521, column: 28, scope: !651)
!662 = !DILocation(line: 522, column: 27, scope: !651)
!663 = !DILocation(line: 523, column: 27, scope: !651)
!664 = !DILocation(line: 523, column: 32, scope: !651)
!665 = !DILocation(line: 523, column: 41, scope: !651)
!666 = !DILocation(line: 523, column: 46, scope: !651)
!667 = !DILocation(line: 524, column: 27, scope: !651)
!668 = !DILocation(line: 524, column: 36, scope: !651)
!669 = !DILocation(line: 518, column: 9, scope: !651)
!670 = !DILocation(line: 518, column: 7, scope: !651)
!671 = !DILocation(line: 526, column: 26, scope: !617)
!672 = !DILocation(line: 526, column: 31, scope: !617)
!673 = !DILocation(line: 526, column: 35, scope: !617)
!674 = !DILocation(line: 526, column: 8, scope: !617)
!675 = !DILocation(line: 526, column: 6, scope: !617)
!676 = !DILocation(line: 527, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !617, file: !88, line: 527, column: 7)
!678 = !DILocation(line: 527, column: 10, scope: !677)
!679 = !DILocation(line: 527, column: 7, scope: !617)
!680 = !DILocation(line: 528, column: 4, scope: !681)
!681 = distinct !DILexicalBlock(scope: !677, file: !88, line: 527, column: 17)
!682 = !DILocation(line: 529, column: 4, scope: !681)
!683 = !DILocation(line: 531, column: 2, scope: !617)
!684 = !DILocation(line: 536, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !88, line: 536, column: 7)
!686 = distinct !DILexicalBlock(scope: !613, file: !88, line: 531, column: 9)
!687 = !DILocation(line: 536, column: 17, scope: !685)
!688 = !DILocation(line: 536, column: 7, scope: !686)
!689 = !DILocation(line: 537, column: 29, scope: !690)
!690 = distinct !DILexicalBlock(scope: !685, file: !88, line: 536, column: 23)
!691 = !DILocation(line: 537, column: 34, scope: !690)
!692 = !DILocation(line: 538, column: 29, scope: !690)
!693 = !DILocation(line: 538, column: 34, scope: !690)
!694 = !DILocation(line: 538, column: 45, scope: !690)
!695 = !DILocation(line: 538, column: 50, scope: !690)
!696 = !DILocation(line: 539, column: 57, scope: !690)
!697 = !DILocation(line: 539, column: 62, scope: !690)
!698 = !DILocation(line: 539, column: 30, scope: !690)
!699 = !DILocation(line: 540, column: 57, scope: !690)
!700 = !DILocation(line: 540, column: 62, scope: !690)
!701 = !DILocation(line: 540, column: 30, scope: !690)
!702 = !DILocation(line: 541, column: 29, scope: !690)
!703 = !DILocation(line: 542, column: 29, scope: !690)
!704 = !DILocation(line: 542, column: 34, scope: !690)
!705 = !DILocation(line: 542, column: 43, scope: !690)
!706 = !DILocation(line: 542, column: 48, scope: !690)
!707 = !DILocation(line: 543, column: 29, scope: !690)
!708 = !DILocation(line: 543, column: 38, scope: !690)
!709 = !DILocation(line: 537, column: 9, scope: !690)
!710 = !DILocation(line: 537, column: 7, scope: !690)
!711 = !DILocation(line: 544, column: 3, scope: !690)
!712 = !DILocation(line: 545, column: 29, scope: !713)
!713 = distinct !DILexicalBlock(scope: !685, file: !88, line: 544, column: 10)
!714 = !DILocation(line: 545, column: 34, scope: !713)
!715 = !DILocation(line: 546, column: 29, scope: !713)
!716 = !DILocation(line: 546, column: 34, scope: !713)
!717 = !DILocation(line: 546, column: 45, scope: !713)
!718 = !DILocation(line: 546, column: 50, scope: !713)
!719 = !DILocation(line: 547, column: 57, scope: !713)
!720 = !DILocation(line: 547, column: 62, scope: !713)
!721 = !DILocation(line: 547, column: 30, scope: !713)
!722 = !DILocation(line: 548, column: 57, scope: !713)
!723 = !DILocation(line: 548, column: 62, scope: !713)
!724 = !DILocation(line: 548, column: 30, scope: !713)
!725 = !DILocation(line: 549, column: 29, scope: !713)
!726 = !DILocation(line: 550, column: 29, scope: !713)
!727 = !DILocation(line: 550, column: 34, scope: !713)
!728 = !DILocation(line: 550, column: 43, scope: !713)
!729 = !DILocation(line: 550, column: 48, scope: !713)
!730 = !DILocation(line: 551, column: 29, scope: !713)
!731 = !DILocation(line: 551, column: 38, scope: !713)
!732 = !DILocation(line: 545, column: 9, scope: !713)
!733 = !DILocation(line: 545, column: 7, scope: !713)
!734 = !DILocation(line: 553, column: 7, scope: !735)
!735 = distinct !DILexicalBlock(scope: !686, file: !88, line: 553, column: 7)
!736 = !DILocation(line: 553, column: 10, scope: !735)
!737 = !DILocation(line: 553, column: 7, scope: !686)
!738 = !DILocation(line: 554, column: 4, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !88, line: 553, column: 17)
!740 = !DILocation(line: 555, column: 4, scope: !739)
!741 = !DILocation(line: 557, column: 21, scope: !686)
!742 = !DILocation(line: 557, column: 26, scope: !686)
!743 = !DILocation(line: 557, column: 8, scope: !686)
!744 = !DILocation(line: 557, column: 6, scope: !686)
!745 = !DILocation(line: 558, column: 7, scope: !746)
!746 = distinct !DILexicalBlock(scope: !686, file: !88, line: 558, column: 7)
!747 = !DILocation(line: 558, column: 10, scope: !746)
!748 = !DILocation(line: 558, column: 7, scope: !686)
!749 = !DILocation(line: 560, column: 35, scope: !750)
!750 = distinct !DILexicalBlock(scope: !746, file: !88, line: 558, column: 17)
!751 = !DILocation(line: 560, column: 40, scope: !750)
!752 = !DILocation(line: 560, column: 19, scope: !750)
!753 = !DILocation(line: 559, column: 4, scope: !750)
!754 = !DILocation(line: 561, column: 3, scope: !750)
!755 = !DILocation(line: 562, column: 23, scope: !686)
!756 = !DILocation(line: 562, column: 28, scope: !686)
!757 = !DILocation(line: 562, column: 3, scope: !686)
!758 = !DILocation(line: 567, column: 9, scope: !595)
!759 = !DILocation(line: 567, column: 2, scope: !595)
!760 = !DILocation(line: 568, column: 1, scope: !595)
!761 = distinct !DISubprogram(name: "logpkt_write_close", scope: !88, file: !88, line: 640, type: !762, isLocal: false, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!762 = !DISubroutineType(types: !763)
!763 = !{!193, !300, !193, !193}
!764 = !DILocalVariable(name: "ctx", arg: 1, scope: !761, file: !88, line: 640, type: !300)
!765 = !DILocation(line: 640, column: 34, scope: !761)
!766 = !DILocalVariable(name: "fd", arg: 2, scope: !761, file: !88, line: 640, type: !193)
!767 = !DILocation(line: 640, column: 43, scope: !761)
!768 = !DILocalVariable(name: "direction", arg: 3, scope: !761, file: !88, line: 640, type: !193)
!769 = !DILocation(line: 640, column: 51, scope: !761)
!770 = !DILocalVariable(name: "other_direction", scope: !761, file: !88, line: 641, type: !193)
!771 = !DILocation(line: 641, column: 6, scope: !761)
!772 = !DILocation(line: 641, column: 25, scope: !761)
!773 = !DILocation(line: 641, column: 35, scope: !761)
!774 = !DILocation(line: 641, column: 24, scope: !761)
!775 = !DILocation(line: 644, column: 6, scope: !776)
!776 = distinct !DILexicalBlock(scope: !761, file: !88, line: 644, column: 6)
!777 = !DILocation(line: 644, column: 11, scope: !776)
!778 = !DILocation(line: 644, column: 19, scope: !776)
!779 = !DILocation(line: 644, column: 6, scope: !761)
!780 = !DILocation(line: 645, column: 34, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !88, line: 645, column: 7)
!782 = distinct !DILexicalBlock(scope: !776, file: !88, line: 644, column: 25)
!783 = !DILocation(line: 645, column: 39, scope: !781)
!784 = !DILocation(line: 645, column: 7, scope: !781)
!785 = !DILocation(line: 645, column: 43, scope: !781)
!786 = !DILocation(line: 645, column: 7, scope: !782)
!787 = !DILocation(line: 646, column: 4, scope: !781)
!788 = !DILocation(line: 647, column: 2, scope: !782)
!789 = !DILocation(line: 649, column: 26, scope: !790)
!790 = distinct !DILexicalBlock(scope: !761, file: !88, line: 649, column: 6)
!791 = !DILocation(line: 649, column: 31, scope: !790)
!792 = !DILocation(line: 649, column: 35, scope: !790)
!793 = !DILocation(line: 649, column: 6, scope: !790)
!794 = !DILocation(line: 650, column: 49, scope: !790)
!795 = !DILocation(line: 649, column: 6, scope: !761)
!796 = !DILocation(line: 651, column: 3, scope: !797)
!797 = distinct !DILexicalBlock(scope: !790, file: !88, line: 650, column: 56)
!798 = !DILocation(line: 652, column: 3, scope: !797)
!799 = !DILocation(line: 654, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !761, file: !88, line: 654, column: 6)
!801 = !DILocation(line: 654, column: 16, scope: !800)
!802 = !DILocation(line: 654, column: 6, scope: !761)
!803 = !DILocation(line: 655, column: 3, scope: !804)
!804 = distinct !DILexicalBlock(scope: !800, file: !88, line: 654, column: 22)
!805 = !DILocation(line: 655, column: 8, scope: !804)
!806 = !DILocation(line: 655, column: 16, scope: !804)
!807 = !DILocation(line: 656, column: 2, scope: !804)
!808 = !DILocation(line: 657, column: 3, scope: !809)
!809 = distinct !DILexicalBlock(scope: !800, file: !88, line: 656, column: 9)
!810 = !DILocation(line: 657, column: 8, scope: !809)
!811 = !DILocation(line: 657, column: 16, scope: !809)
!812 = !DILocation(line: 660, column: 26, scope: !813)
!813 = distinct !DILexicalBlock(scope: !761, file: !88, line: 660, column: 6)
!814 = !DILocation(line: 660, column: 31, scope: !813)
!815 = !DILocation(line: 660, column: 35, scope: !813)
!816 = !DILocation(line: 660, column: 6, scope: !813)
!817 = !DILocation(line: 661, column: 49, scope: !813)
!818 = !DILocation(line: 660, column: 6, scope: !761)
!819 = !DILocation(line: 662, column: 3, scope: !820)
!820 = distinct !DILexicalBlock(scope: !813, file: !88, line: 661, column: 56)
!821 = !DILocation(line: 663, column: 3, scope: !820)
!822 = !DILocation(line: 665, column: 6, scope: !823)
!823 = distinct !DILexicalBlock(scope: !761, file: !88, line: 665, column: 6)
!824 = !DILocation(line: 665, column: 22, scope: !823)
!825 = !DILocation(line: 665, column: 6, scope: !761)
!826 = !DILocation(line: 666, column: 3, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !88, line: 665, column: 28)
!828 = !DILocation(line: 666, column: 8, scope: !827)
!829 = !DILocation(line: 666, column: 16, scope: !827)
!830 = !DILocation(line: 667, column: 2, scope: !827)
!831 = !DILocation(line: 668, column: 3, scope: !832)
!832 = distinct !DILexicalBlock(scope: !823, file: !88, line: 667, column: 9)
!833 = !DILocation(line: 668, column: 8, scope: !832)
!834 = !DILocation(line: 668, column: 16, scope: !832)
!835 = !DILocation(line: 671, column: 26, scope: !836)
!836 = distinct !DILexicalBlock(scope: !761, file: !88, line: 671, column: 6)
!837 = !DILocation(line: 671, column: 31, scope: !836)
!838 = !DILocation(line: 671, column: 35, scope: !836)
!839 = !DILocation(line: 671, column: 6, scope: !836)
!840 = !DILocation(line: 672, column: 42, scope: !836)
!841 = !DILocation(line: 671, column: 6, scope: !761)
!842 = !DILocation(line: 673, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !836, file: !88, line: 672, column: 49)
!844 = !DILocation(line: 674, column: 3, scope: !843)
!845 = !DILocation(line: 677, column: 2, scope: !761)
!846 = !DILocation(line: 678, column: 1, scope: !761)
!847 = distinct !DISubprogram(name: "logpkt_ether_lookup", scope: !88, file: !88, line: 728, type: !848, isLocal: false, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!848 = !DISubroutineType(types: !849)
!849 = !{!193, !306, !39, !39, !850, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!852 = !DILocalVariable(name: "libnet", arg: 1, scope: !847, file: !88, line: 728, type: !306)
!853 = !DILocation(line: 728, column: 31, scope: !847)
!854 = !DILocalVariable(name: "src_ether", arg: 2, scope: !847, file: !88, line: 729, type: !39)
!855 = !DILocation(line: 729, column: 30, scope: !847)
!856 = !DILocalVariable(name: "dst_ether", arg: 3, scope: !847, file: !88, line: 729, type: !39)
!857 = !DILocation(line: 729, column: 50, scope: !847)
!858 = !DILocalVariable(name: "dst_ip_s", arg: 4, scope: !847, file: !88, line: 730, type: !850)
!859 = !DILocation(line: 730, column: 33, scope: !847)
!860 = !DILocalVariable(name: "dst_if_s", arg: 5, scope: !847, file: !88, line: 730, type: !850)
!861 = !DILocation(line: 730, column: 55, scope: !847)
!862 = !DILocalVariable(name: "errbuf", scope: !847, file: !88, line: 732, type: !350)
!863 = !DILocation(line: 732, column: 7, scope: !847)
!864 = !DILocalVariable(name: "broadcast_ether", scope: !847, file: !88, line: 733, type: !92)
!865 = !DILocation(line: 733, column: 10, scope: !847)
!866 = !DILocalVariable(name: "zero_ether", scope: !847, file: !88, line: 735, type: !92)
!867 = !DILocation(line: 735, column: 10, scope: !847)
!868 = !DILocalVariable(name: "src_ether_addr", scope: !847, file: !88, line: 737, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_ether_addr", file: !179, line: 530, size: 48, align: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ether_addr_octet", scope: !870, file: !179, line: 532, baseType: !92, size: 48, align: 8)
!873 = !DILocation(line: 737, column: 28, scope: !847)
!874 = !DILocalVariable(name: "src_ip", scope: !847, file: !88, line: 738, type: !35)
!875 = !DILocation(line: 738, column: 11, scope: !847)
!876 = !DILocalVariable(name: "bp", scope: !847, file: !88, line: 739, type: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_program", file: !67, line: 106, size: 128, align: 64, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bf_len", scope: !877, file: !67, line: 107, baseType: !68, size: 32, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bf_insns", scope: !877, file: !67, line: 108, baseType: !881, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_insn", file: !67, line: 1472, size: 64, align: 32, elements: !883)
!883 = !{!884, !887, !888, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !882, file: !67, line: 1473, baseType: !885, size: 16, align: 16)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_short", file: !49, line: 34, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_short", file: !51, line: 31, baseType: !81)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "jt", scope: !882, file: !67, line: 1474, baseType: !48, size: 8, align: 8, offset: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "jf", scope: !882, file: !67, line: 1475, baseType: !48, size: 8, align: 8, offset: 24)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !882, file: !67, line: 1476, baseType: !66, size: 32, align: 32, offset: 32)
!890 = !DILocation(line: 739, column: 21, scope: !847)
!891 = !DILocalVariable(name: "count", scope: !847, file: !88, line: 740, type: !193)
!892 = !DILocation(line: 740, column: 6, scope: !847)
!893 = !DILocalVariable(name: "ctx", scope: !847, file: !88, line: 741, type: !188)
!894 = !DILocation(line: 741, column: 30, scope: !847)
!895 = !DILocation(line: 743, column: 17, scope: !896)
!896 = distinct !DILexicalBlock(scope: !847, file: !88, line: 743, column: 6)
!897 = !DILocation(line: 743, column: 6, scope: !896)
!898 = !DILocation(line: 743, column: 27, scope: !896)
!899 = !DILocation(line: 743, column: 6, scope: !847)
!900 = !DILocation(line: 744, column: 3, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !88, line: 743, column: 38)
!902 = !DILocation(line: 745, column: 3, scope: !901)
!903 = !DILocation(line: 748, column: 6, scope: !847)
!904 = !DILocation(line: 748, column: 13, scope: !847)
!905 = !DILocation(line: 749, column: 29, scope: !847)
!906 = !DILocation(line: 749, column: 45, scope: !847)
!907 = !DILocation(line: 749, column: 11, scope: !847)
!908 = !DILocation(line: 749, column: 6, scope: !847)
!909 = !DILocation(line: 749, column: 9, scope: !847)
!910 = !DILocation(line: 751, column: 10, scope: !911)
!911 = distinct !DILexicalBlock(scope: !847, file: !88, line: 751, column: 6)
!912 = !DILocation(line: 751, column: 13, scope: !911)
!913 = !DILocation(line: 751, column: 6, scope: !847)
!914 = !DILocation(line: 753, column: 34, scope: !915)
!915 = distinct !DILexicalBlock(scope: !911, file: !88, line: 751, column: 30)
!916 = !DILocation(line: 753, column: 18, scope: !915)
!917 = !DILocation(line: 752, column: 3, scope: !915)
!918 = !DILocation(line: 754, column: 3, scope: !915)
!919 = !DILocation(line: 756, column: 30, scope: !847)
!920 = !DILocation(line: 756, column: 11, scope: !847)
!921 = !DILocation(line: 756, column: 9, scope: !847)
!922 = !DILocation(line: 757, column: 6, scope: !923)
!923 = distinct !DILexicalBlock(scope: !847, file: !88, line: 757, column: 6)
!924 = !DILocation(line: 757, column: 13, scope: !923)
!925 = !DILocation(line: 757, column: 6, scope: !847)
!926 = !DILocation(line: 759, column: 34, scope: !927)
!927 = distinct !DILexicalBlock(scope: !923, file: !88, line: 757, column: 30)
!928 = !DILocation(line: 759, column: 18, scope: !927)
!929 = !DILocation(line: 758, column: 3, scope: !927)
!930 = !DILocation(line: 760, column: 3, scope: !927)
!931 = !DILocation(line: 762, column: 37, scope: !847)
!932 = !DILocation(line: 762, column: 19, scope: !847)
!933 = !DILocation(line: 762, column: 17, scope: !847)
!934 = !DILocation(line: 763, column: 6, scope: !935)
!935 = distinct !DILexicalBlock(scope: !847, file: !88, line: 763, column: 6)
!936 = !DILocation(line: 763, column: 21, scope: !935)
!937 = !DILocation(line: 763, column: 6, scope: !847)
!938 = !DILocation(line: 765, column: 34, scope: !939)
!939 = distinct !DILexicalBlock(scope: !935, file: !88, line: 763, column: 29)
!940 = !DILocation(line: 765, column: 18, scope: !939)
!941 = !DILocation(line: 764, column: 3, scope: !939)
!942 = !DILocation(line: 766, column: 3, scope: !939)
!943 = !DILocation(line: 768, column: 9, scope: !847)
!944 = !DILocation(line: 768, column: 20, scope: !847)
!945 = !DILocation(line: 768, column: 36, scope: !847)
!946 = !DILocation(line: 768, column: 2, scope: !847)
!947 = !DILocation(line: 771, column: 27, scope: !948)
!948 = distinct !DILexicalBlock(scope: !847, file: !88, line: 770, column: 6)
!949 = !DILocation(line: 772, column: 27, scope: !948)
!950 = !DILocation(line: 773, column: 27, scope: !948)
!951 = !DILocation(line: 774, column: 42, scope: !948)
!952 = !DILocation(line: 774, column: 27, scope: !948)
!953 = !DILocation(line: 775, column: 27, scope: !948)
!954 = !DILocation(line: 770, column: 6, scope: !948)
!955 = !DILocation(line: 775, column: 35, scope: !948)
!956 = !DILocation(line: 770, column: 6, scope: !847)
!957 = !DILocation(line: 777, column: 34, scope: !958)
!958 = distinct !DILexicalBlock(scope: !948, file: !88, line: 775, column: 42)
!959 = !DILocation(line: 777, column: 18, scope: !958)
!960 = !DILocation(line: 776, column: 3, scope: !958)
!961 = !DILocation(line: 778, column: 3, scope: !958)
!962 = !DILocation(line: 781, column: 32, scope: !963)
!963 = distinct !DILexicalBlock(scope: !847, file: !88, line: 781, column: 6)
!964 = !DILocation(line: 783, column: 32, scope: !963)
!965 = !DILocation(line: 781, column: 6, scope: !963)
!966 = !DILocation(line: 783, column: 40, scope: !963)
!967 = !DILocation(line: 781, column: 6, scope: !847)
!968 = !DILocation(line: 785, column: 34, scope: !969)
!969 = distinct !DILexicalBlock(scope: !963, file: !88, line: 783, column: 47)
!970 = !DILocation(line: 785, column: 18, scope: !969)
!971 = !DILocation(line: 784, column: 3, scope: !969)
!972 = !DILocation(line: 786, column: 3, scope: !969)
!973 = !DILocalVariable(name: "pcap", scope: !847, file: !88, line: 789, type: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcap_t", file: !43, line: 79, baseType: !976)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "pcap", file: !43, line: 79, flags: DIFlagFwdDecl)
!977 = !DILocation(line: 789, column: 10, scope: !847)
!978 = !DILocation(line: 789, column: 32, scope: !847)
!979 = !DILocation(line: 789, column: 54, scope: !847)
!980 = !DILocation(line: 789, column: 17, scope: !847)
!981 = !DILocation(line: 790, column: 6, scope: !982)
!982 = distinct !DILexicalBlock(scope: !847, file: !88, line: 790, column: 6)
!983 = !DILocation(line: 790, column: 11, scope: !982)
!984 = !DILocation(line: 790, column: 6, scope: !847)
!985 = !DILocation(line: 791, column: 53, scope: !986)
!986 = distinct !DILexicalBlock(scope: !982, file: !88, line: 790, column: 19)
!987 = !DILocation(line: 791, column: 3, scope: !986)
!988 = !DILocation(line: 792, column: 3, scope: !986)
!989 = !DILocation(line: 795, column: 19, scope: !990)
!990 = distinct !DILexicalBlock(scope: !847, file: !88, line: 795, column: 6)
!991 = !DILocation(line: 795, column: 6, scope: !990)
!992 = !DILocation(line: 795, column: 44, scope: !990)
!993 = !DILocation(line: 795, column: 6, scope: !847)
!994 = !DILocation(line: 797, column: 30, scope: !995)
!995 = distinct !DILexicalBlock(scope: !990, file: !88, line: 795, column: 51)
!996 = !DILocation(line: 797, column: 18, scope: !995)
!997 = !DILocation(line: 796, column: 3, scope: !995)
!998 = !DILocation(line: 798, column: 3, scope: !995)
!999 = !DILocation(line: 800, column: 21, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !847, file: !88, line: 800, column: 6)
!1001 = !DILocation(line: 800, column: 6, scope: !1000)
!1002 = !DILocation(line: 800, column: 32, scope: !1000)
!1003 = !DILocation(line: 800, column: 6, scope: !847)
!1004 = !DILocation(line: 802, column: 30, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !88, line: 800, column: 39)
!1006 = !DILocation(line: 802, column: 18, scope: !1005)
!1007 = !DILocation(line: 801, column: 3, scope: !1005)
!1008 = !DILocation(line: 803, column: 3, scope: !1005)
!1009 = !DILocation(line: 806, column: 2, scope: !847)
!1010 = distinct !{!1010, !1009}
!1011 = !DILocation(line: 807, column: 20, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !88, line: 807, column: 7)
!1013 = distinct !DILexicalBlock(scope: !847, file: !88, line: 806, column: 5)
!1014 = !DILocation(line: 807, column: 7, scope: !1012)
!1015 = !DILocation(line: 807, column: 28, scope: !1012)
!1016 = !DILocation(line: 807, column: 7, scope: !1013)
!1017 = !DILocation(line: 810, column: 22, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !88, line: 810, column: 8)
!1019 = distinct !DILexicalBlock(scope: !1012, file: !88, line: 807, column: 35)
!1020 = !DILocation(line: 812, column: 22, scope: !1018)
!1021 = !DILocation(line: 810, column: 8, scope: !1018)
!1022 = !DILocation(line: 812, column: 37, scope: !1018)
!1023 = !DILocation(line: 810, column: 8, scope: !1019)
!1024 = !DILocation(line: 814, column: 32, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1018, file: !88, line: 812, column: 42)
!1026 = !DILocation(line: 814, column: 20, scope: !1025)
!1027 = !DILocation(line: 813, column: 5, scope: !1025)
!1028 = !DILocation(line: 815, column: 5, scope: !1025)
!1029 = !DILocation(line: 817, column: 3, scope: !1019)
!1030 = !DILocation(line: 819, column: 35, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1012, file: !88, line: 817, column: 10)
!1032 = !DILocation(line: 819, column: 19, scope: !1031)
!1033 = !DILocation(line: 818, column: 4, scope: !1031)
!1034 = !DILocation(line: 820, column: 4, scope: !1031)
!1035 = !DILocation(line: 822, column: 3, scope: !1013)
!1036 = !DILocation(line: 823, column: 2, scope: !1013)
!1037 = !DILocation(line: 823, column: 15, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !847, file: !88, discriminator: 1)
!1039 = !DILocation(line: 823, column: 22, scope: !1038)
!1040 = !DILocation(line: 823, column: 28, scope: !1038)
!1041 = !DILocation(line: 823, column: 31, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !847, file: !88, discriminator: 2)
!1043 = !DILocation(line: 823, column: 39, scope: !1042)
!1044 = !DILocation(line: 823, column: 2, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1013, file: !88, discriminator: 3)
!1046 = !DILocation(line: 825, column: 10, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !847, file: !88, line: 825, column: 6)
!1048 = !DILocation(line: 825, column: 17, scope: !1047)
!1049 = !DILocation(line: 825, column: 6, scope: !847)
!1050 = !DILocation(line: 826, column: 10, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !88, line: 825, column: 23)
!1052 = !DILocation(line: 826, column: 26, scope: !1051)
!1053 = !DILocation(line: 826, column: 3, scope: !1051)
!1054 = !DILocation(line: 829, column: 18, scope: !1051)
!1055 = !DILocation(line: 829, column: 32, scope: !1051)
!1056 = !DILocation(line: 829, column: 46, scope: !1051)
!1057 = !DILocation(line: 830, column: 18, scope: !1051)
!1058 = !DILocation(line: 830, column: 32, scope: !1051)
!1059 = !DILocation(line: 830, column: 46, scope: !1051)
!1060 = !DILocation(line: 827, column: 3, scope: !1051)
!1061 = !DILocation(line: 831, column: 2, scope: !1051)
!1062 = !DILocation(line: 825, column: 20, scope: !1063)
!1063 = !DILexicalBlockFile(scope: !1047, file: !88, discriminator: 1)
!1064 = !DILocation(line: 834, column: 2, scope: !847)
!1065 = !DILocation(line: 836, column: 13, scope: !847)
!1066 = !DILocation(line: 836, column: 2, scope: !847)
!1067 = !DILocation(line: 838, column: 22, scope: !847)
!1068 = !DILocation(line: 838, column: 2, scope: !847)
!1069 = !DILocation(line: 839, column: 13, scope: !847)
!1070 = !DILocation(line: 839, column: 2, scope: !847)
!1071 = !DILocation(line: 840, column: 1, scope: !847)
!1072 = distinct !DISubprogram(name: "logpkt_recv_arp_reply", scope: !88, file: !88, line: 691, type: !1073, isLocal: true, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !39, !52, !371}
!1075 = !DILocalVariable(name: "user", arg: 1, scope: !1072, file: !88, line: 691, type: !39)
!1076 = !DILocation(line: 691, column: 32, scope: !1072)
!1077 = !DILocalVariable(name: "h", arg: 2, scope: !1072, file: !88, line: 692, type: !52)
!1078 = !DILocation(line: 692, column: 73, scope: !1072)
!1079 = !DILocalVariable(name: "packet", arg: 3, scope: !1072, file: !88, line: 693, type: !371)
!1080 = !DILocation(line: 693, column: 38, scope: !1072)
!1081 = !DILocalVariable(name: "ctx", scope: !1072, file: !88, line: 695, type: !187)
!1082 = !DILocation(line: 695, column: 31, scope: !1072)
!1083 = !DILocation(line: 695, column: 67, scope: !1072)
!1084 = !DILocation(line: 695, column: 37, scope: !1072)
!1085 = !DILocalVariable(name: "heth", scope: !1072, file: !88, line: 696, type: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_802_3_hdr", file: !179, line: 183, size: 112, align: 16, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_802_3_dhost", scope: !1087, file: !179, line: 185, baseType: !92, size: 48, align: 8)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_802_3_shost", scope: !1087, file: !179, line: 186, baseType: !92, size: 48, align: 8, offset: 48)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_802_3_len", scope: !1087, file: !179, line: 187, baseType: !97, size: 16, align: 16, offset: 96)
!1092 = !DILocation(line: 696, column: 27, scope: !1072)
!1093 = !DILocation(line: 696, column: 41, scope: !1072)
!1094 = !DILocation(line: 696, column: 34, scope: !1072)
!1095 = !DILocalVariable(name: "harp", scope: !1072, file: !88, line: 697, type: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libnet_arp_hdr", file: !179, line: 196, size: 64, align: 16, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1103}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hrd", scope: !1097, file: !179, line: 198, baseType: !97, size: 16, align: 16)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pro", scope: !1097, file: !179, line: 213, baseType: !97, size: 16, align: 16, offset: 16)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hln", scope: !1097, file: !179, line: 214, baseType: !40, size: 8, align: 8, offset: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pln", scope: !1097, file: !179, line: 215, baseType: !40, size: 8, align: 8, offset: 40)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ar_op", scope: !1097, file: !179, line: 216, baseType: !97, size: 16, align: 16, offset: 48)
!1104 = !DILocation(line: 697, column: 25, scope: !1072)
!1105 = !DILocation(line: 697, column: 47, scope: !1072)
!1106 = !DILocation(line: 697, column: 40, scope: !1072)
!1107 = !DILocation(line: 697, column: 52, scope: !1072)
!1108 = !DILocation(line: 697, column: 32, scope: !1072)
!1109 = !DILocation(line: 700, column: 12, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1072, file: !88, line: 700, column: 6)
!1111 = !DILocation(line: 700, column: 18, scope: !1110)
!1112 = !DILocation(line: 700, column: 6, scope: !1110)
!1113 = !DILocation(line: 700, column: 25, scope: !1110)
!1114 = !DILocation(line: 700, column: 6, scope: !1072)
!1115 = !DILocation(line: 701, column: 3, scope: !1110)
!1116 = !DILocation(line: 702, column: 12, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1072, file: !88, line: 702, column: 6)
!1118 = !DILocation(line: 702, column: 18, scope: !1117)
!1119 = !DILocation(line: 702, column: 6, scope: !1117)
!1120 = !DILocation(line: 702, column: 26, scope: !1117)
!1121 = !DILocation(line: 702, column: 6, scope: !1072)
!1122 = !DILocation(line: 703, column: 3, scope: !1117)
!1123 = !DILocation(line: 704, column: 12, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1072, file: !88, line: 704, column: 6)
!1125 = !DILocation(line: 704, column: 18, scope: !1124)
!1126 = !DILocation(line: 704, column: 6, scope: !1124)
!1127 = !DILocation(line: 704, column: 26, scope: !1124)
!1128 = !DILocation(line: 704, column: 6, scope: !1072)
!1129 = !DILocation(line: 705, column: 3, scope: !1124)
!1130 = !DILocation(line: 708, column: 16, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1072, file: !88, line: 708, column: 6)
!1132 = !DILocation(line: 708, column: 21, scope: !1131)
!1133 = !DILocation(line: 708, column: 15, scope: !1131)
!1134 = !DILocation(line: 708, column: 32, scope: !1131)
!1135 = !DILocation(line: 708, column: 25, scope: !1131)
!1136 = !DILocation(line: 708, column: 39, scope: !1131)
!1137 = !DILocation(line: 708, column: 45, scope: !1131)
!1138 = !DILocation(line: 708, column: 37, scope: !1131)
!1139 = !DILocation(line: 708, column: 52, scope: !1131)
!1140 = !DILocation(line: 708, column: 8, scope: !1131)
!1141 = !DILocation(line: 708, column: 6, scope: !1072)
!1142 = !DILocation(line: 709, column: 3, scope: !1131)
!1143 = !DILocation(line: 712, column: 24, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1072, file: !88, line: 712, column: 6)
!1145 = !DILocation(line: 712, column: 15, scope: !1144)
!1146 = !DILocation(line: 712, column: 29, scope: !1144)
!1147 = !DILocation(line: 713, column: 15, scope: !1144)
!1148 = !DILocation(line: 713, column: 21, scope: !1144)
!1149 = !DILocation(line: 712, column: 8, scope: !1144)
!1150 = !DILocation(line: 712, column: 6, scope: !1072)
!1151 = !DILocation(line: 714, column: 3, scope: !1144)
!1152 = !DILocation(line: 716, column: 9, scope: !1072)
!1153 = !DILocation(line: 716, column: 14, scope: !1072)
!1154 = !DILocation(line: 716, column: 2, scope: !1072)
!1155 = !DILocation(line: 717, column: 18, scope: !1072)
!1156 = !DILocation(line: 717, column: 9, scope: !1072)
!1157 = !DILocation(line: 717, column: 23, scope: !1072)
!1158 = !DILocation(line: 719, column: 2, scope: !1072)
!1159 = !DILocation(line: 719, column: 7, scope: !1072)
!1160 = !DILocation(line: 719, column: 14, scope: !1072)
!1161 = !DILocation(line: 720, column: 1, scope: !1072)
!1162 = !DILocation(line: 720, column: 1, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1072, file: !88, discriminator: 1)
!1164 = distinct !DISubprogram(name: "logpkt_pcap_build", scope: !88, file: !88, line: 316, type: !1165, isLocal: true, isDefinition: true, scopeLine: 322, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !201)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!369, !39, !39, !39, !73, !73, !34, !35, !35, !371, !369}
!1167 = !DILocalVariable(name: "pkt", arg: 1, scope: !1164, file: !88, line: 316, type: !39)
!1168 = !DILocation(line: 316, column: 28, scope: !1164)
!1169 = !DILocalVariable(name: "src_ether", arg: 2, scope: !1164, file: !88, line: 317, type: !39)
!1170 = !DILocation(line: 317, column: 28, scope: !1164)
!1171 = !DILocalVariable(name: "dst_ether", arg: 3, scope: !1164, file: !88, line: 317, type: !39)
!1172 = !DILocation(line: 317, column: 48, scope: !1164)
!1173 = !DILocalVariable(name: "src_addr", arg: 4, scope: !1164, file: !88, line: 318, type: !73)
!1174 = !DILocation(line: 318, column: 42, scope: !1164)
!1175 = !DILocalVariable(name: "dst_addr", arg: 5, scope: !1164, file: !88, line: 319, type: !73)
!1176 = !DILocation(line: 319, column: 42, scope: !1164)
!1177 = !DILocalVariable(name: "flags", arg: 6, scope: !1164, file: !88, line: 320, type: !34)
!1178 = !DILocation(line: 320, column: 24, scope: !1164)
!1179 = !DILocalVariable(name: "seq", arg: 7, scope: !1164, file: !88, line: 320, type: !35)
!1180 = !DILocation(line: 320, column: 40, scope: !1164)
!1181 = !DILocalVariable(name: "ack", arg: 8, scope: !1164, file: !88, line: 320, type: !35)
!1182 = !DILocation(line: 320, column: 54, scope: !1164)
!1183 = !DILocalVariable(name: "payload", arg: 9, scope: !1164, file: !88, line: 321, type: !371)
!1184 = !DILocation(line: 321, column: 34, scope: !1164)
!1185 = !DILocalVariable(name: "payloadlen", arg: 10, scope: !1164, file: !88, line: 321, type: !369)
!1186 = !DILocation(line: 321, column: 50, scope: !1164)
!1187 = !DILocalVariable(name: "ether_hdr", scope: !1164, file: !88, line: 323, type: !86)
!1188 = !DILocation(line: 323, column: 15, scope: !1164)
!1189 = !DILocalVariable(name: "ip4_hdr", scope: !1164, file: !88, line: 324, type: !98)
!1190 = !DILocation(line: 324, column: 13, scope: !1164)
!1191 = !DILocalVariable(name: "ip6_hdr", scope: !1164, file: !88, line: 325, type: !141)
!1192 = !DILocation(line: 325, column: 13, scope: !1164)
!1193 = !DILocalVariable(name: "tcp_hdr", scope: !1164, file: !88, line: 326, type: !129)
!1194 = !DILocation(line: 326, column: 13, scope: !1164)
!1195 = !DILocalVariable(name: "sz", scope: !1164, file: !88, line: 327, type: !369)
!1196 = !DILocation(line: 327, column: 9, scope: !1164)
!1197 = !DILocalVariable(name: "sum", scope: !1164, file: !88, line: 328, type: !35)
!1198 = !DILocation(line: 328, column: 11, scope: !1164)
!1199 = !DILocation(line: 330, column: 29, scope: !1164)
!1200 = !DILocation(line: 330, column: 14, scope: !1164)
!1201 = !DILocation(line: 330, column: 12, scope: !1164)
!1202 = !DILocation(line: 331, column: 9, scope: !1164)
!1203 = !DILocation(line: 331, column: 20, scope: !1164)
!1204 = !DILocation(line: 331, column: 2, scope: !1164)
!1205 = !DILocation(line: 331, column: 29, scope: !1164)
!1206 = !DILocation(line: 332, column: 9, scope: !1164)
!1207 = !DILocation(line: 332, column: 20, scope: !1164)
!1208 = !DILocation(line: 332, column: 2, scope: !1164)
!1209 = !DILocation(line: 332, column: 29, scope: !1164)
!1210 = !DILocation(line: 333, column: 5, scope: !1164)
!1211 = !DILocation(line: 335, column: 6, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1164, file: !88, line: 335, column: 6)
!1213 = !DILocation(line: 335, column: 16, scope: !1212)
!1214 = !DILocation(line: 335, column: 26, scope: !1212)
!1215 = !DILocation(line: 335, column: 6, scope: !1164)
!1216 = !DILocation(line: 336, column: 26, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1212, file: !88, line: 335, column: 37)
!1218 = !DILocation(line: 336, column: 3, scope: !1217)
!1219 = !DILocation(line: 336, column: 14, scope: !1217)
!1220 = !DILocation(line: 336, column: 24, scope: !1217)
!1221 = !DILocation(line: 337, column: 39, scope: !1217)
!1222 = !DILocation(line: 337, column: 28, scope: !1217)
!1223 = !DILocation(line: 337, column: 50, scope: !1217)
!1224 = !DILocation(line: 337, column: 13, scope: !1217)
!1225 = !DILocation(line: 337, column: 11, scope: !1217)
!1226 = !DILocation(line: 339, column: 3, scope: !1217)
!1227 = !DILocation(line: 339, column: 12, scope: !1217)
!1228 = !DILocation(line: 339, column: 24, scope: !1217)
!1229 = !DILocation(line: 340, column: 3, scope: !1217)
!1230 = !DILocation(line: 340, column: 12, scope: !1217)
!1231 = !DILocation(line: 340, column: 21, scope: !1217)
!1232 = !DILocation(line: 342, column: 44, scope: !1217)
!1233 = !DILocation(line: 342, column: 42, scope: !1217)
!1234 = !DILocation(line: 341, column: 24, scope: !1217)
!1235 = !DILocation(line: 341, column: 18, scope: !1217)
!1236 = !DILocation(line: 341, column: 3, scope: !1217)
!1237 = !DILocation(line: 341, column: 12, scope: !1217)
!1238 = !DILocation(line: 341, column: 16, scope: !1217)
!1239 = !DILocation(line: 343, column: 17, scope: !1217)
!1240 = !DILocation(line: 343, column: 3, scope: !1217)
!1241 = !DILocation(line: 343, column: 12, scope: !1217)
!1242 = !DILocation(line: 343, column: 15, scope: !1217)
!1243 = !DILocation(line: 344, column: 3, scope: !1217)
!1244 = !DILocation(line: 344, column: 12, scope: !1217)
!1245 = !DILocation(line: 344, column: 17, scope: !1217)
!1246 = !DILocation(line: 345, column: 3, scope: !1217)
!1247 = !DILocation(line: 345, column: 12, scope: !1217)
!1248 = !DILocation(line: 345, column: 16, scope: !1217)
!1249 = !DILocation(line: 346, column: 3, scope: !1217)
!1250 = !DILocation(line: 346, column: 12, scope: !1217)
!1251 = !DILocation(line: 346, column: 18, scope: !1217)
!1252 = !DILocation(line: 347, column: 53, scope: !1217)
!1253 = !DILocation(line: 347, column: 65, scope: !1217)
!1254 = !DILocation(line: 347, column: 74, scope: !1217)
!1255 = !DILocation(line: 347, column: 3, scope: !1217)
!1256 = !DILocation(line: 347, column: 12, scope: !1217)
!1257 = !DILocation(line: 347, column: 21, scope: !1217)
!1258 = !DILocation(line: 348, column: 53, scope: !1217)
!1259 = !DILocation(line: 348, column: 65, scope: !1217)
!1260 = !DILocation(line: 348, column: 74, scope: !1217)
!1261 = !DILocation(line: 348, column: 3, scope: !1217)
!1262 = !DILocation(line: 348, column: 12, scope: !1217)
!1263 = !DILocation(line: 348, column: 21, scope: !1217)
!1264 = !DILocation(line: 349, column: 3, scope: !1217)
!1265 = !DILocation(line: 349, column: 12, scope: !1217)
!1266 = !DILocation(line: 349, column: 19, scope: !1217)
!1267 = !DILocation(line: 350, column: 11, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 350, column: 3)
!1269 = !DILocalVariable(name: "p", scope: !1270, file: !88, line: 351, type: !128)
!1270 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 351, column: 3)
!1271 = !DILocation(line: 351, column: 15, scope: !1270)
!1272 = !DILocation(line: 351, column: 32, scope: !1270)
!1273 = !DILocation(line: 351, column: 19, scope: !1270)
!1274 = !DILocalVariable(name: "words", scope: !1270, file: !88, line: 351, type: !369)
!1275 = !DILocation(line: 351, column: 49, scope: !1270)
!1276 = !DILocation(line: 351, column: 83, scope: !1270)
!1277 = !DILocation(line: 351, column: 95, scope: !1278)
!1278 = !DILexicalBlockFile(scope: !1270, file: !88, discriminator: 1)
!1279 = !DILocation(line: 351, column: 83, scope: !1278)
!1280 = !DILocation(line: 351, column: 112, scope: !1281)
!1281 = !DILexicalBlockFile(scope: !1282, file: !88, discriminator: 2)
!1282 = distinct !DILexicalBlock(scope: !1270, file: !88, line: 351, column: 99)
!1283 = !DILocation(line: 351, column: 110, scope: !1281)
!1284 = !DILocation(line: 351, column: 107, scope: !1281)
!1285 = !DILocation(line: 351, column: 83, scope: !1281)
!1286 = distinct !{!1286, !1276}
!1287 = !DILocation(line: 352, column: 15, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 352, column: 3)
!1289 = !DILocation(line: 352, column: 20, scope: !1288)
!1290 = !DILocation(line: 352, column: 31, scope: !1288)
!1291 = !DILocation(line: 352, column: 36, scope: !1288)
!1292 = !DILocation(line: 352, column: 27, scope: !1288)
!1293 = !DILocation(line: 352, column: 11, scope: !1288)
!1294 = !DILocation(line: 352, column: 58, scope: !1288)
!1295 = !DILocation(line: 352, column: 63, scope: !1288)
!1296 = !DILocation(line: 352, column: 53, scope: !1288)
!1297 = !DILocation(line: 352, column: 81, scope: !1288)
!1298 = !DILocation(line: 352, column: 79, scope: !1288)
!1299 = !DILocation(line: 352, column: 77, scope: !1288)
!1300 = !DILocation(line: 353, column: 21, scope: !1217)
!1301 = !DILocation(line: 353, column: 3, scope: !1217)
!1302 = !DILocation(line: 353, column: 12, scope: !1217)
!1303 = !DILocation(line: 353, column: 19, scope: !1217)
!1304 = !DILocation(line: 354, column: 6, scope: !1217)
!1305 = !DILocation(line: 355, column: 39, scope: !1217)
!1306 = !DILocation(line: 355, column: 28, scope: !1217)
!1307 = !DILocation(line: 355, column: 48, scope: !1217)
!1308 = !DILocation(line: 355, column: 13, scope: !1217)
!1309 = !DILocation(line: 355, column: 11, scope: !1217)
!1310 = !DILocation(line: 357, column: 53, scope: !1217)
!1311 = !DILocation(line: 357, column: 65, scope: !1217)
!1312 = !DILocation(line: 357, column: 3, scope: !1217)
!1313 = !DILocation(line: 357, column: 12, scope: !1217)
!1314 = !DILocation(line: 357, column: 21, scope: !1217)
!1315 = !DILocation(line: 358, column: 53, scope: !1217)
!1316 = !DILocation(line: 358, column: 65, scope: !1217)
!1317 = !DILocation(line: 358, column: 3, scope: !1217)
!1318 = !DILocation(line: 358, column: 12, scope: !1217)
!1319 = !DILocation(line: 358, column: 21, scope: !1217)
!1320 = !DILocation(line: 360, column: 11, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 360, column: 3)
!1322 = !DILocation(line: 361, column: 16, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 361, column: 3)
!1324 = !DILocation(line: 361, column: 25, scope: !1323)
!1325 = !DILocation(line: 361, column: 35, scope: !1323)
!1326 = !DILocation(line: 361, column: 46, scope: !1323)
!1327 = !DILocation(line: 361, column: 55, scope: !1323)
!1328 = !DILocation(line: 361, column: 65, scope: !1323)
!1329 = !DILocation(line: 361, column: 42, scope: !1323)
!1330 = !DILocation(line: 361, column: 11, scope: !1323)
!1331 = !DILocation(line: 362, column: 16, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 362, column: 3)
!1333 = !DILocation(line: 362, column: 25, scope: !1332)
!1334 = !DILocation(line: 362, column: 35, scope: !1332)
!1335 = !DILocation(line: 362, column: 46, scope: !1332)
!1336 = !DILocation(line: 362, column: 55, scope: !1332)
!1337 = !DILocation(line: 362, column: 65, scope: !1332)
!1338 = !DILocation(line: 362, column: 42, scope: !1332)
!1339 = !DILocation(line: 362, column: 11, scope: !1332)
!1340 = !DILocation(line: 363, column: 21, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 363, column: 3)
!1342 = !DILocation(line: 363, column: 30, scope: !1341)
!1343 = !DILocation(line: 363, column: 15, scope: !1341)
!1344 = !DILocation(line: 363, column: 14, scope: !1341)
!1345 = !DILocation(line: 363, column: 11, scope: !1341)
!1346 = !DILocation(line: 364, column: 41, scope: !1347)
!1347 = distinct !DILexicalBlock(scope: !1217, file: !88, line: 364, column: 3)
!1348 = !DILocation(line: 364, column: 39, scope: !1347)
!1349 = !DILocation(line: 364, column: 21, scope: !1347)
!1350 = !DILocation(line: 364, column: 15, scope: !1347)
!1351 = !DILocation(line: 364, column: 14, scope: !1347)
!1352 = !DILocation(line: 364, column: 11, scope: !1347)
!1353 = !DILocation(line: 365, column: 2, scope: !1217)
!1354 = !DILocation(line: 366, column: 26, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1212, file: !88, line: 365, column: 9)
!1356 = !DILocation(line: 366, column: 3, scope: !1355)
!1357 = !DILocation(line: 366, column: 14, scope: !1355)
!1358 = !DILocation(line: 366, column: 24, scope: !1355)
!1359 = !DILocation(line: 367, column: 39, scope: !1355)
!1360 = !DILocation(line: 367, column: 28, scope: !1355)
!1361 = !DILocation(line: 367, column: 50, scope: !1355)
!1362 = !DILocation(line: 367, column: 13, scope: !1355)
!1363 = !DILocation(line: 367, column: 11, scope: !1355)
!1364 = !DILocation(line: 369, column: 20, scope: !1355)
!1365 = !DILocation(line: 369, column: 3, scope: !1355)
!1366 = !DILocation(line: 369, column: 12, scope: !1355)
!1367 = !DILocation(line: 369, column: 18, scope: !1355)
!1368 = !DILocation(line: 370, column: 44, scope: !1355)
!1369 = !DILocation(line: 370, column: 42, scope: !1355)
!1370 = !DILocation(line: 370, column: 24, scope: !1355)
!1371 = !DILocation(line: 370, column: 18, scope: !1355)
!1372 = !DILocation(line: 370, column: 3, scope: !1355)
!1373 = !DILocation(line: 370, column: 12, scope: !1355)
!1374 = !DILocation(line: 370, column: 16, scope: !1355)
!1375 = !DILocation(line: 371, column: 3, scope: !1355)
!1376 = !DILocation(line: 371, column: 12, scope: !1355)
!1377 = !DILocation(line: 371, column: 21, scope: !1355)
!1378 = !DILocation(line: 372, column: 3, scope: !1355)
!1379 = !DILocation(line: 372, column: 12, scope: !1355)
!1380 = !DILocation(line: 372, column: 22, scope: !1355)
!1381 = !DILocation(line: 373, column: 10, scope: !1355)
!1382 = !DILocation(line: 373, column: 19, scope: !1355)
!1383 = !DILocation(line: 373, column: 3, scope: !1355)
!1384 = !DILocation(line: 373, column: 60, scope: !1355)
!1385 = !DILocation(line: 373, column: 72, scope: !1355)
!1386 = !DILocation(line: 373, column: 55, scope: !1355)
!1387 = !DILocation(line: 373, column: 63, scope: !1355)
!1388 = !DILocation(line: 375, column: 10, scope: !1355)
!1389 = !DILocation(line: 375, column: 19, scope: !1355)
!1390 = !DILocation(line: 375, column: 3, scope: !1355)
!1391 = !DILocation(line: 375, column: 60, scope: !1355)
!1392 = !DILocation(line: 375, column: 72, scope: !1355)
!1393 = !DILocation(line: 375, column: 55, scope: !1355)
!1394 = !DILocation(line: 375, column: 63, scope: !1355)
