; ModuleID = './vmtoolsd-serviceObj.o.i'
source_filename = "./vmtoolsd-serviceObj.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GTypeInfo = type { i16, void (i8*)*, void (i8*)*, void (i8*, i8*)*, void (i8*, i8*)*, i8*, i16, i16, void (%struct._GTypeInstance*, i8*)*, %struct._GTypeValueTable* }
%struct._GTypeInstance = type { %struct._GTypeClass* }
%struct._GTypeClass = type { i64 }
%struct._GTypeValueTable = type { void (%struct._GValue*)*, void (%struct._GValue*)*, void (%struct._GValue*, %struct._GValue*)*, i8* (%struct._GValue*)*, i8*, i8* (%struct._GValue*, i32, %union._GTypeCValue*, i32)*, i8*, i8* (%struct._GValue*, i32, %union._GTypeCValue*, i32)* }
%struct._GValue = type { i64, [2 x %union.anon] }
%union.anon = type { i64 }
%union._GTypeCValue = type opaque
%struct.ToolsCoreServiceClass = type { %struct._GObjectClass }
%struct._GObjectClass = type { %struct._GTypeClass, %struct._GSList*, %struct._GObject* (i64, i32, %struct._GObjectConstructParam*)*, void (%struct._GObject*, i32, %struct._GValue*, %struct._GParamSpec*)*, void (%struct._GObject*, i32, %struct._GValue*, %struct._GParamSpec*)*, void (%struct._GObject*)*, void (%struct._GObject*)*, void (%struct._GObject*, i32, %struct._GParamSpec**)*, void (%struct._GObject*, %struct._GParamSpec*)*, void (%struct._GObject*)*, i64, [6 x i8*] }
%struct._GSList = type { i8*, %struct._GSList* }

!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 303, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/plugin.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "TOOLS_CAP_OLD", value: 0)
!34 = !DIEnumerator(name: "TOOLS_CAP_OLD_NOVAL", value: 1)
!35 = !DIEnumerator(name: "TOOLS_CAP_NEW", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 44, size: 32, align: 32, elements: !38)
!37 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/guestrpc/capabilities.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!39 = !DIEnumerator(name: "UNITY_CAP_START_MENU", value: 0)
!40 = !DIEnumerator(name: "UNITY_CAP_VIRTUAL_DESK", value: 1)
!41 = !DIEnumerator(name: "UNITY_CAP_WORK_AREA", value: 2)
!42 = !DIEnumerator(name: "UNITY_CAP_MULTI_MON", value: 3)
!43 = !DIEnumerator(name: "GHI_CAP_SHELL_ACTION_BROWSE", value: 4)
!44 = !DIEnumerator(name: "GHI_CAP_SHELL_LOCATION_HGFS", value: 5)
!45 = !DIEnumerator(name: "GHI_CAP_SHELL_ACTION_RUN", value: 6)
!46 = !DIEnumerator(name: "GHI_CAP_CMD_SHELL_ACTION", value: 7)
!47 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DESKTOP", value: 8)
!48 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DOCUMENTS", value: 9)
!49 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_MUSIC", value: 10)
!50 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_PICTURES", value: 11)
!51 = !DIEnumerator(name: "HGFSU_CAP_DESKTOP_SHORTCUT", value: 12)
!52 = !DIEnumerator(name: "HGFSU_CAP_MAP_DRIVE", value: 13)
!53 = !DIEnumerator(name: "GHI_CAP_SET_HANDLER", value: 14)
!54 = !DIEnumerator(name: "UNITY_CAP_STATUS_UNITY_ACTIVE", value: 15)
!55 = !DIEnumerator(name: "GHI_CAP_SET_OUTLOOK_TEMP_FOLDER", value: 16)
!56 = !DIEnumerator(name: "CAP_SET_TOPO_MODES", value: 18)
!57 = !DIEnumerator(name: "GHI_CAP_TRAY_ICONS", value: 19)
!58 = !DIEnumerator(name: "GHI_CAP_SET_FOCUSED_WINDOW", value: 20)
!59 = !DIEnumerator(name: "GHI_CAP_GET_EXEC_INFO_HASH", value: 21)
!60 = !DIEnumerator(name: "UNITY_CAP_STICKY_WINDOWS", value: 22)
!61 = !DIEnumerator(name: "CAP_CHANGE_HOST_3D_AVAILABILITY_HINT", value: 23)
!62 = !DIEnumerator(name: "CAP_AUTOUPGRADE_AT_SHUTDOWN", value: 24)
!63 = !DIEnumerator(name: "GHI_CAP_AUTOLOGON", value: 25)
!64 = !DIEnumerator(name: "CAP_DESKTOP_AUTOLOCK", value: 26)
!65 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DOWNLOADS", value: 28)
!66 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_MOVIES", value: 29)
!67 = !DIEnumerator(name: "GHI_CAP_TOGGLE_START_UI", value: 30)
!68 = !DIEnumerator(name: "GHI_CAP_SET_DISPLAY_SCALING", value: 31)
!69 = !DIEnumerator(name: "UNITY_CAP_DISABLE_MOUSE_BUTTON_SWAPPING", value: 32)
!70 = !DIEnumerator(name: "UNITY_CAP_CARET_POSITION", value: 33)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 51, size: 32, align: 32, elements: !73)
!72 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82}
!74 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!75 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!76 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!77 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!78 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!79 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!80 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!81 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!82 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!83 = !{!84, !89, !226, !113, !227, !128, !228, !238, !260}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "GType", file: !85, line: 382, baseType: !86)
!85 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gtype.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !87, line: 66, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!88 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreServiceClass", file: !91, line: 48, baseType: !92)
!91 = !DIFile(filename: "serviceObj.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsCoreServiceClass", file: !91, line: 46, size: 1088, align: 64, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "parentClass", scope: !92, file: !91, line: 47, baseType: !95, size: 1088, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObjectClass", file: !96, line: 188, baseType: !97)
!96 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gobject.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObjectClass", file: !96, line: 316, size: 1088, align: 64, elements: !98)
!98 = !{!99, !104, !115, !196, !202, !206, !210, !211, !216, !220, !221, !222}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_class", scope: !97, file: !96, line: 318, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeClass", file: !85, line: 389, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeClass", file: !85, line: 406, size: 64, align: 64, elements: !102)
!102 = !{!103}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !101, file: !85, line: 409, baseType: !84, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "construct_properties", scope: !97, file: !96, line: 321, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !107, line: 37, baseType: !108)
!107 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !107, line: 39, size: 128, align: 64, elements: !109)
!109 = !{!110, !114}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !107, line: 41, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !112, line: 77, baseType: !113)
!112 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !108, file: !107, line: 42, baseType: !105, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !97, file: !96, line: 325, baseType: !116, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !84, !131, !138}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObject", file: !96, line: 187, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObject", file: !96, line: 245, size: 192, align: 64, elements: !122)
!122 = !{!123, !129, !133}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !121, file: !96, line: 247, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInstance", file: !85, line: 391, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInstance", file: !85, line: 416, size: 64, align: 64, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "g_class", scope: !125, file: !85, line: 419, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !121, file: !96, line: 250, baseType: !130, size: 32, align: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !112, line: 55, baseType: !132)
!132 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !121, file: !96, line: 251, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !136, line: 36, baseType: !137)
!136 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !136, line: 36, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GObjectConstructParam", file: !96, line: 191, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GObjectConstructParam", file: !96, line: 365, size: 128, align: 64, elements: !141)
!141 = !{!142, !163}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pspec", scope: !140, file: !96, line: 367, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GParamSpec", file: !4, line: 193, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GParamSpec", file: !4, line: 208, size: 576, align: 64, elements: !146)
!146 = !{!147, !148, !153, !155, !156, !157, !159, !160, !161, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "g_type_instance", scope: !145, file: !4, line: 210, baseType: !124, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !4, line: 212, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !112, line: 46, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !4, line: 213, baseType: !154, size: 32, align: 32, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GParamFlags", file: !4, line: 167, baseType: !3)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "value_type", scope: !145, file: !4, line: 214, baseType: !84, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "owner_type", scope: !145, file: !4, line: 215, baseType: !84, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_nick", scope: !145, file: !4, line: 218, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_blurb", scope: !145, file: !4, line: 219, baseType: !158, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !145, file: !4, line: 220, baseType: !134, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !145, file: !4, line: 221, baseType: !131, size: 32, align: 32, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "param_id", scope: !145, file: !4, line: 222, baseType: !131, size: 32, align: 32, offset: 544)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !140, file: !96, line: 368, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GValue", file: !85, line: 386, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GValue", file: !167, line: 106, size: 192, align: 64, elements: !168)
!167 = !DIFile(filename: "/usr/include/glib-2.0/gobject/gvalue.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "g_type", scope: !166, file: !167, line: 109, baseType: !84, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 122, baseType: !171, size: 128, align: 64, offset: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 128, align: 64, elements: !194)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !167, line: 112, size: 64, align: 64, elements: !173)
!173 = !{!174, !177, !178, !181, !183, !185, !187, !190, !193}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !172, file: !167, line: 113, baseType: !175, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !112, line: 49, baseType: !176)
!176 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint", scope: !172, file: !167, line: 114, baseType: !131, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v_long", scope: !172, file: !167, line: 115, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !112, line: 48, baseType: !180)
!180 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v_ulong", scope: !172, file: !167, line: 116, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !112, line: 54, baseType: !88)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !172, file: !167, line: 117, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !87, line: 51, baseType: !180)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v_uint64", scope: !172, file: !167, line: 118, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !87, line: 52, baseType: !88)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !172, file: !167, line: 119, baseType: !188, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfloat", file: !112, line: 57, baseType: !189)
!189 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v_double", scope: !172, file: !167, line: 120, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !112, line: 58, baseType: !192)
!192 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v_pointer", scope: !172, file: !167, line: 121, baseType: !111, size: 64, align: 64)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "set_property", scope: !97, file: !96, line: 329, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !119, !131, !200, !143}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "get_property", scope: !97, file: !96, line: 333, baseType: !203, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !119, !131, !164, !143}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !97, file: !96, line: 337, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !119}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !97, file: !96, line: 338, baseType: !207, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch_properties_changed", scope: !97, file: !96, line: 340, baseType: !212, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !119, !131, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !97, file: !96, line: 344, baseType: !217, size: 64, align: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !119, !143}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "constructed", scope: !97, file: !96, line: 348, baseType: !207, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !96, line: 351, baseType: !86, size: 64, align: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pdummy", scope: !97, file: !96, line: 354, baseType: !223, size: 384, align: 64, offset: 704)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 384, align: 64, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 6)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCapability", file: !31, line: 333, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCapability", file: !31, line: 318, size: 192, align: 64, elements: !231)
!231 = !{!232, !234, !235, !237}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !230, file: !31, line: 320, baseType: !233, size: 32, align: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCapabilityType", file: !31, line: 307, baseType: !30)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !31, line: 325, baseType: !149, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !230, file: !31, line: 330, baseType: !236, size: 32, align: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestCapabilities", file: !37, line: 79, baseType: !36)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !230, file: !31, line: 332, baseType: !131, size: 32, align: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreService", file: !91, line: 44, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsCoreService", file: !91, line: 40, size: 320, align: 64, elements: !241)
!241 = !{!242, !243, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !240, file: !91, line: 41, baseType: !120, size: 192, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !91, line: 42, baseType: !244, size: 64, align: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !246, line: 51, baseType: !247)
!246 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !246, line: 58, size: 64, align: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !247, file: !246, line: 61, baseType: !111, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !247, file: !246, line: 62, baseType: !251, size: 64, align: 32)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, align: 32, elements: !194)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !240, file: !91, line: 43, baseType: !253, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !255, line: 37, baseType: !256)
!255 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !255, line: 41, size: 128, align: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !255, line: 43, baseType: !158, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !256, file: !255, line: 44, baseType: !131, size: 32, align: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ServiceProperty", file: !262, line: 34, baseType: !263)
!262 = !DIFile(filename: "serviceObj.c", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ServiceProperty", file: !262, line: 30, size: 192, align: 64, elements: !264)
!264 = !{!265, !266, !267}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !263, file: !262, line: 31, baseType: !131, size: 32, align: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !262, line: 32, baseType: !158, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !263, file: !262, line: 33, baseType: !111, size: 64, align: 64, offset: 128)
!268 = !{!269, !274, !339, !350}
!269 = distinct !DIGlobalVariable(name: "type", scope: !270, file: !262, line: 415, type: !84, isLocal: true, isDefinition: true, variable: i64* @ToolsCore_Service_get_type.type)
!270 = distinct !DISubprogram(name: "ToolsCore_Service_get_type", scope: !262, file: !262, line: 413, type: !271, isLocal: false, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{!84}
!273 = !{}
!274 = distinct !DIGlobalVariable(name: "info", scope: !270, file: !262, line: 417, type: !275, isLocal: true, isDefinition: true, variable: %struct._GTypeInfo* @ToolsCore_Service_get_type.info)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeInfo", file: !85, line: 392, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeInfo", file: !85, line: 1032, size: 576, align: 64, elements: !278)
!278 = !{!279, !282, !287, !289, !294, !296, !300, !301, !302, !307}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "class_size", scope: !277, file: !85, line: 1035, baseType: !280, size: 16, align: 16)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint16", file: !87, line: 40, baseType: !281)
!281 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "base_init", scope: !277, file: !85, line: 1037, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBaseInitFunc", file: !85, line: 760, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !111}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "base_finalize", scope: !277, file: !85, line: 1038, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "GBaseFinalizeFunc", file: !85, line: 771, baseType: !284)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "class_init", scope: !277, file: !85, line: 1041, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GClassInitFunc", file: !85, line: 873, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !111, !111}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "class_finalize", scope: !277, file: !85, line: 1042, baseType: !295, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "GClassFinalizeFunc", file: !85, line: 888, baseType: !291)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "class_data", scope: !277, file: !85, line: 1043, baseType: !297, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !112, line: 78, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "instance_size", scope: !277, file: !85, line: 1046, baseType: !280, size: 16, align: 16, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "n_preallocs", scope: !277, file: !85, line: 1047, baseType: !280, size: 16, align: 16, offset: 400)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "instance_init", scope: !277, file: !85, line: 1048, baseType: !303, size: 64, align: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInstanceInitFunc", file: !85, line: 908, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !226, !111}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "value_table", scope: !277, file: !85, line: 1051, baseType: !308, size: 64, align: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeValueTable", file: !85, line: 395, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTypeValueTable", file: !85, line: 1237, size: 512, align: 64, elements: !312)
!312 = !{!313, !317, !318, !322, !326, !327, !334, !335}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value_init", scope: !311, file: !85, line: 1239, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !164}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "value_free", scope: !311, file: !85, line: 1240, baseType: !314, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "value_copy", scope: !311, file: !85, line: 1241, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !200, !164}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value_peek_pointer", scope: !311, file: !85, line: 1244, baseType: !323, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!111, !200}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "collect_format", scope: !311, file: !85, line: 1245, baseType: !149, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "collect_value", scope: !311, file: !85, line: 1246, baseType: !328, size: 64, align: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!158, !164, !131, !331, !131}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTypeCValue", file: !85, line: 387, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_union_type, name: "_GTypeCValue", file: !85, line: 387, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "lcopy_format", scope: !311, file: !85, line: 1250, baseType: !149, size: 64, align: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "lcopy_value", scope: !311, file: !85, line: 1251, baseType: !336, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!158, !200, !131, !331, !131}
!339 = distinct !DIGlobalVariable(name: "PROP_ID_SEQ", scope: !340, file: !262, line: 453, type: !131, isLocal: true, isDefinition: true, variable: i32* @ToolsCoreService_RegisterProperty.PROP_ID_SEQ)
!340 = distinct !DISubprogram(name: "ToolsCoreService_RegisterProperty", scope: !262, file: !262, line: 450, type: !341, isLocal: false, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !238, !343}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceProperty", file: !31, line: 468, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceProperty", file: !31, line: 466, size: 64, align: 64, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !31, line: 467, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!350 = distinct !DIGlobalVariable(name: "gToolsCoreServiceParentClass", scope: !0, file: !262, line: 36, type: !111, isLocal: true, isDefinition: true, variable: i8** @gToolsCoreServiceParentClass)
!351 = !{i32 2, !"Dwarf Version", i32 4}
!352 = !{i32 2, !"Debug Info Version", i32 3}
!353 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!354 = !DILocation(line: 416, column: 8, scope: !355)
!355 = distinct !DILexicalBlock(scope: !270, file: !262, line: 416, column: 8)
!356 = !DILocation(line: 416, column: 13, scope: !355)
!357 = !DILocation(line: 416, column: 8, scope: !270)
!358 = !DILocation(line: 428, column: 14, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !262, line: 416, column: 19)
!360 = !DILocation(line: 428, column: 12, scope: !359)
!361 = !DILocation(line: 432, column: 4, scope: !359)
!362 = !DILocation(line: 433, column: 11, scope: !270)
!363 = !DILocation(line: 433, column: 4, scope: !270)
!364 = distinct !DISubprogram(name: "ToolsCore_Service_class_init", scope: !262, file: !262, line: 311, type: !292, isLocal: true, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!365 = !DILocalVariable(name: "_klass", arg: 1, scope: !364, file: !262, line: 311, type: !111)
!366 = !DIExpression()
!367 = !DILocation(line: 311, column: 39, scope: !364)
!368 = !DILocalVariable(name: "klassData", arg: 2, scope: !364, file: !262, line: 312, type: !111)
!369 = !DILocation(line: 312, column: 39, scope: !364)
!370 = !DILocalVariable(name: "klass", scope: !364, file: !262, line: 314, type: !89)
!371 = !DILocation(line: 314, column: 27, scope: !364)
!372 = !DILocation(line: 314, column: 35, scope: !364)
!373 = !DILocation(line: 316, column: 60, scope: !364)
!374 = !DILocation(line: 316, column: 35, scope: !364)
!375 = !DILocation(line: 316, column: 33, scope: !364)
!376 = !DILocation(line: 319, column: 35, scope: !364)
!377 = !DILocation(line: 319, column: 44, scope: !364)
!378 = !DILocation(line: 318, column: 4, scope: !364)
!379 = !DILocation(line: 330, column: 35, scope: !364)
!380 = !DILocation(line: 330, column: 44, scope: !364)
!381 = !DILocation(line: 329, column: 4, scope: !364)
!382 = !DILocation(line: 340, column: 35, scope: !364)
!383 = !DILocation(line: 340, column: 44, scope: !364)
!384 = !DILocation(line: 339, column: 4, scope: !364)
!385 = !DILocation(line: 350, column: 35, scope: !364)
!386 = !DILocation(line: 350, column: 44, scope: !364)
!387 = !DILocation(line: 349, column: 4, scope: !364)
!388 = !DILocation(line: 360, column: 35, scope: !364)
!389 = !DILocation(line: 360, column: 44, scope: !364)
!390 = !DILocation(line: 359, column: 4, scope: !364)
!391 = !DILocation(line: 372, column: 35, scope: !364)
!392 = !DILocation(line: 372, column: 44, scope: !364)
!393 = !DILocation(line: 371, column: 4, scope: !364)
!394 = !DILocation(line: 398, column: 64, scope: !364)
!395 = !DILocation(line: 398, column: 48, scope: !364)
!396 = !DILocation(line: 398, column: 23, scope: !364)
!397 = !DILocation(line: 398, column: 104, scope: !364)
!398 = !DILocation(line: 398, column: 116, scope: !364)
!399 = !DILocation(line: 399, column: 64, scope: !364)
!400 = !DILocation(line: 399, column: 48, scope: !364)
!401 = !DILocation(line: 399, column: 23, scope: !364)
!402 = !DILocation(line: 399, column: 104, scope: !364)
!403 = !DILocation(line: 399, column: 113, scope: !364)
!404 = !DILocation(line: 400, column: 64, scope: !364)
!405 = !DILocation(line: 400, column: 48, scope: !364)
!406 = !DILocation(line: 400, column: 23, scope: !364)
!407 = !DILocation(line: 400, column: 104, scope: !364)
!408 = !DILocation(line: 400, column: 117, scope: !364)
!409 = !DILocation(line: 401, column: 64, scope: !364)
!410 = !DILocation(line: 401, column: 48, scope: !364)
!411 = !DILocation(line: 401, column: 23, scope: !364)
!412 = !DILocation(line: 401, column: 104, scope: !364)
!413 = !DILocation(line: 401, column: 117, scope: !364)
!414 = !DILocation(line: 402, column: 1, scope: !364)
!415 = !DILocalVariable(name: "obj", arg: 1, scope: !340, file: !262, line: 450, type: !238)
!416 = !DILocation(line: 450, column: 53, scope: !340)
!417 = !DILocalVariable(name: "prop", arg: 2, scope: !340, file: !262, line: 451, type: !343)
!418 = !DILocation(line: 451, column: 57, scope: !340)
!419 = !DILocalVariable(name: "sprop", scope: !340, file: !262, line: 455, type: !261)
!420 = !DILocation(line: 455, column: 20, scope: !340)
!421 = !DILocalVariable(name: "klass", scope: !340, file: !262, line: 456, type: !89)
!422 = !DILocation(line: 456, column: 27, scope: !340)
!423 = !DILocation(line: 456, column: 84, scope: !340)
!424 = !DILocation(line: 456, column: 92, scope: !340)
!425 = !DILocation(line: 456, column: 38, scope: !340)
!426 = !DILocalVariable(name: "pspec", scope: !340, file: !262, line: 457, type: !143)
!427 = !DILocation(line: 457, column: 16, scope: !340)
!428 = !DILocation(line: 457, column: 45, scope: !340)
!429 = !DILocation(line: 457, column: 51, scope: !340)
!430 = !DILocation(line: 458, column: 45, scope: !340)
!431 = !DILocation(line: 458, column: 51, scope: !340)
!432 = !DILocation(line: 459, column: 45, scope: !340)
!433 = !DILocation(line: 459, column: 51, scope: !340)
!434 = !DILocation(line: 457, column: 24, scope: !340)
!435 = !DILocation(line: 462, column: 17, scope: !340)
!436 = !DILocation(line: 462, column: 22, scope: !340)
!437 = !DILocation(line: 462, column: 4, scope: !340)
!438 = !DILocation(line: 464, column: 15, scope: !340)
!439 = !DILocation(line: 464, column: 10, scope: !340)
!440 = !DILocation(line: 464, column: 13, scope: !340)
!441 = !DILocation(line: 465, column: 26, scope: !340)
!442 = !DILocation(line: 465, column: 32, scope: !340)
!443 = !DILocation(line: 465, column: 17, scope: !340)
!444 = !DILocation(line: 465, column: 10, scope: !340)
!445 = !DILocation(line: 465, column: 15, scope: !340)
!446 = !DILocation(line: 466, column: 10, scope: !340)
!447 = !DILocation(line: 466, column: 16, scope: !340)
!448 = !DILocation(line: 467, column: 25, scope: !340)
!449 = !DILocation(line: 467, column: 30, scope: !340)
!450 = !DILocation(line: 467, column: 37, scope: !340)
!451 = !DILocation(line: 467, column: 4, scope: !340)
!452 = !DILocation(line: 468, column: 96, scope: !340)
!453 = !DILocation(line: 468, column: 80, scope: !340)
!454 = !DILocation(line: 468, column: 55, scope: !340)
!455 = !DILocation(line: 468, column: 39, scope: !340)
!456 = !DILocation(line: 468, column: 142, scope: !340)
!457 = !DILocation(line: 468, column: 146, scope: !340)
!458 = !DILocation(line: 468, column: 4, scope: !459)
!459 = !DILexicalBlockFile(scope: !340, file: !262, discriminator: 1)
!460 = !DILocation(line: 470, column: 19, scope: !340)
!461 = !DILocation(line: 470, column: 24, scope: !340)
!462 = !DILocation(line: 470, column: 4, scope: !340)
!463 = !DILocation(line: 471, column: 1, scope: !340)
!464 = distinct !DISubprogram(name: "ToolsCoreCapabilitiesAccumulator", scope: !262, file: !262, line: 76, type: !465, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !468, !164, !200, !111}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !112, line: 50, baseType: !175)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSignalInvocationHint", file: !19, line: 33, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSignalInvocationHint", file: !19, line: 223, size: 96, align: 32, elements: !471)
!471 = !{!472, !473, !477}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "signal_id", scope: !470, file: !19, line: 225, baseType: !131, size: 32, align: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "detail", scope: !470, file: !19, line: 226, baseType: !474, size: 32, align: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !475, line: 36, baseType: !476)
!475 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1389")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !87, line: 45, baseType: !132)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "run_type", scope: !470, file: !19, line: 227, baseType: !478, size: 32, align: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSignalFlags", file: !19, line: 138, baseType: !18)
!479 = !DILocalVariable(name: "ihint", arg: 1, scope: !464, file: !262, line: 76, type: !468)
!480 = !DILocation(line: 76, column: 57, scope: !464)
!481 = !DILocalVariable(name: "retval", arg: 2, scope: !464, file: !262, line: 77, type: !164)
!482 = !DILocation(line: 77, column: 42, scope: !464)
!483 = !DILocalVariable(name: "handlerRet", arg: 3, scope: !464, file: !262, line: 78, type: !200)
!484 = !DILocation(line: 78, column: 48, scope: !464)
!485 = !DILocalVariable(name: "data", arg: 4, scope: !464, file: !262, line: 79, type: !111)
!486 = !DILocation(line: 79, column: 43, scope: !464)
!487 = !DILocalVariable(name: "caps", scope: !464, file: !262, line: 81, type: !253)
!488 = !DILocation(line: 81, column: 12, scope: !464)
!489 = !DILocation(line: 81, column: 39, scope: !464)
!490 = !DILocation(line: 81, column: 19, scope: !464)
!491 = !DILocation(line: 83, column: 8, scope: !492)
!492 = distinct !DILexicalBlock(scope: !464, file: !262, line: 83, column: 8)
!493 = !DILocation(line: 83, column: 13, scope: !492)
!494 = !DILocation(line: 83, column: 8, scope: !464)
!495 = !DILocalVariable(name: "i", scope: !496, file: !262, line: 84, type: !131)
!496 = distinct !DILexicalBlock(scope: !492, file: !262, line: 83, column: 21)
!497 = !DILocation(line: 84, column: 13, scope: !496)
!498 = !DILocalVariable(name: "acc", scope: !496, file: !262, line: 85, type: !253)
!499 = !DILocation(line: 85, column: 15, scope: !496)
!500 = !DILocation(line: 85, column: 41, scope: !496)
!501 = !DILocation(line: 85, column: 21, scope: !496)
!502 = !DILocation(line: 87, column: 11, scope: !503)
!503 = distinct !DILexicalBlock(scope: !496, file: !262, line: 87, column: 11)
!504 = !DILocation(line: 87, column: 15, scope: !503)
!505 = !DILocation(line: 87, column: 11, scope: !496)
!506 = !DILocation(line: 88, column: 16, scope: !507)
!507 = distinct !DILexicalBlock(scope: !503, file: !262, line: 87, column: 23)
!508 = !DILocation(line: 88, column: 14, scope: !507)
!509 = !DILocation(line: 89, column: 30, scope: !507)
!510 = !DILocation(line: 89, column: 38, scope: !507)
!511 = !DILocation(line: 89, column: 10, scope: !507)
!512 = !DILocation(line: 90, column: 7, scope: !507)
!513 = !DILocation(line: 92, column: 14, scope: !514)
!514 = distinct !DILexicalBlock(scope: !496, file: !262, line: 92, column: 7)
!515 = !DILocation(line: 92, column: 12, scope: !514)
!516 = !DILocation(line: 92, column: 19, scope: !517)
!517 = !DILexicalBlockFile(scope: !518, file: !262, discriminator: 1)
!518 = distinct !DILexicalBlock(scope: !514, file: !262, line: 92, column: 7)
!519 = !DILocation(line: 92, column: 23, scope: !517)
!520 = !DILocation(line: 92, column: 29, scope: !517)
!521 = !DILocation(line: 92, column: 21, scope: !517)
!522 = !DILocation(line: 92, column: 7, scope: !517)
!523 = !DILocation(line: 93, column: 31, scope: !524)
!524 = distinct !DILexicalBlock(scope: !518, file: !262, line: 92, column: 39)
!525 = !DILocation(line: 93, column: 87, scope: !524)
!526 = !DILocation(line: 93, column: 39, scope: !524)
!527 = !DILocation(line: 93, column: 72, scope: !524)
!528 = !DILocation(line: 93, column: 79, scope: !524)
!529 = !DILocation(line: 93, column: 40, scope: !524)
!530 = !DILocation(line: 93, column: 36, scope: !524)
!531 = !DILocation(line: 93, column: 10, scope: !524)
!532 = !DILocation(line: 94, column: 7, scope: !524)
!533 = !DILocation(line: 92, column: 35, scope: !534)
!534 = !DILexicalBlockFile(scope: !518, file: !262, discriminator: 2)
!535 = !DILocation(line: 92, column: 7, scope: !534)
!536 = distinct !{!536, !537}
!537 = !DILocation(line: 92, column: 7, scope: !496)
!538 = !DILocation(line: 96, column: 20, scope: !496)
!539 = !DILocation(line: 96, column: 7, scope: !496)
!540 = !DILocation(line: 97, column: 4, scope: !496)
