; ModuleID = './libvix_la-vixTools.o.i'
source_filename = "./libvix_la-vixTools.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.HgfsServerMgrData = type { i8*, i8*, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%struct.HashTable = type opaque
%struct.VixToolsStartedProgramState = type { i8*, i8*, i8*, i64, i64, i32, i64, i8, %struct.ProcMgr_AsyncProc*, %struct.VixToolsStartedProgramState* }
%struct.ProcMgr_AsyncProc = type opaque
%struct._GKeyFile = type opaque
%struct.VixToolsCachedListProcessesResult = type { i8*, i64, i32, i32 }
%struct.VixCommandRequestHeader = type <{ %struct.VixMsgHeader, i32, i32, i32, i64, i32, i32 }>
%struct.VixMsgHeader = type <{ i32, i16, i32, i32, i32, i32, i8 }>
%struct.VixMsgRunProgramRequest = type <{ %struct.VixCommandRequestHeader, i32, i32, i32 }>

!1129 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_50939", value: 302)
!1130 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51936", value: 303)
!1131 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_51950", value: 304)
!1132 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57002", value: 305)
!1133 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57003", value: 306)
!1134 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57004", value: 307)
!1135 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57005", value: 308)
!1136 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57006", value: 309)
!1137 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57007", value: 310)
!1138 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57008", value: 311)
!1139 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57009", value: 312)
!1140 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57010", value: 313)
!1141 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_57011", value: 314)
!1142 = !DIEnumerator(name: "STRING_ENCODING_IBM_813", value: 315)
!1143 = !DIEnumerator(name: "STRING_ENCODING_IBM_943_P130_1999", value: 316)
!1144 = !DIEnumerator(name: "STRING_ENCODING_IBM_33722", value: 317)
!1145 = !DIEnumerator(name: "STRING_ENCODING_WINDOWS_949", value: 318)
!1146 = !DIEnumerator(name: "STRING_ENCODING_IBM_1363", value: 319)
!1147 = !DIEnumerator(name: "STRING_ENCODING_IBM_1386", value: 320)
!1148 = !DIEnumerator(name: "STRING_ENCODING_IBM_1373", value: 321)
!1149 = !DIEnumerator(name: "STRING_ENCODING_IBM_5471", value: 322)
!1150 = !DIEnumerator(name: "STRING_ENCODING_IBM_874", value: 323)
!1151 = !DIEnumerator(name: "STRING_ENCODING_MAX_SPECIFIED", value: 324)
!1152 = !DIEnumerator(name: "STRING_ENCODING_DEFAULT", value: -1)
!1153 = !DIEnumerator(name: "STRING_ENCODING_UNKNOWN", value: -2)
!1154 = !DIEnumerator(name: "STRING_ENCODING_UTF16", value: 1)
!1155 = !DIEnumerator(name: "STRING_ENCODING_UTF32", value: 4)
!1156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 615, size: 32, align: 32, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164}
!1158 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_ACCESS_DATE", value: 1)
!1159 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_MODIFY_DATE", value: 2)
!1160 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_READONLY", value: 4)
!1161 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_HIDDEN", value: 8)
!1162 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_UNIX_OWNERID", value: 16)
!1163 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_UNIX_GROUPID", value: 32)
!1164 = !DIEnumerator(name: "VIX_FILE_ATTRIBUTE_SET_UNIX_PERMISSIONS", value: 64)
!1165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NicInfoAddrType", file: !1166, line: 28, size: 32, align: 32, elements: !1167)
!1166 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/guestrpc/nicinfo.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1167 = !{!1168, !1169}
!1168 = !DIEnumerator(name: "NICINFO_ADDR_IPV4", value: 0)
!1169 = !DIEnumerator(name: "NICINFO_ADDR_IPV6", value: 1)
!1170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdr_op", file: !1171, line: 81, size: 32, align: 32, elements: !1172)
!1171 = !DIFile(filename: "/usr/include/rpc/xdr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1172 = !{!1173, !1174, !1175}
!1173 = !DIEnumerator(name: "XDR_ENCODE", value: 0)
!1174 = !DIEnumerator(name: "XDR_DECODE", value: 1)
!1175 = !DIEnumerator(name: "XDR_FREE", value: 2)
!1176 = !{!1177, !1178, !1224, !1212, !1237, !1239, !1221, !1242, !1249, !1258, !1261, !1269, !1238, !1270, !1274, !1279, !1285, !1301, !1308, !1316, !1327, !1339, !1350, !1195, !1365, !1380, !1381, !1345, !1382, !1390, !1401, !1408, !1416, !1425, !1434, !1444, !1218, !1453, !1463, !1470, !1478, !1479, !1486, !1495, !1509, !1510, !1514, !1585}
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgRunProgramRequest", file: !372, line: 517, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgRunProgramRequest", file: !372, line: 509, size: 504, align: 8, elements: !1181)
!1181 = !{!1182, !1217, !1222, !1223}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1180, file: !372, line: 510, baseType: !1183, size: 408, align: 8)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandRequestHeader", file: !372, line: 196, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandRequestHeader", file: !372, line: 182, size: 408, align: 8, elements: !1185)
!1185 = !{!1186, !1208, !1209, !1210, !1211, !1215, !1216}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "commonHeader", scope: !1184, file: !372, line: 183, baseType: !1187, size: 184, align: 8)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgHeader", file: !372, line: 170, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgHeader", file: !372, line: 158, size: 184, align: 8, elements: !1189)
!1189 = !{!1190, !1196, !1200, !1201, !1202, !1203, !1204}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1188, file: !372, line: 159, baseType: !1191, size: 32, align: 32)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !1192, line: 173, baseType: !1193)
!1192 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1194, line: 51, baseType: !1195)
!1194 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1195 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "messageVersion", scope: !1188, file: !372, line: 160, baseType: !1197, size: 16, align: 16, offset: 32)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !1192, line: 175, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1194, line: 49, baseType: !1199)
!1199 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "totalMessageLength", scope: !1188, file: !372, line: 162, baseType: !1191, size: 32, align: 32, offset: 48)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "headerLength", scope: !1188, file: !372, line: 163, baseType: !1191, size: 32, align: 32, offset: 80)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "bodyLength", scope: !1188, file: !372, line: 164, baseType: !1191, size: 32, align: 32, offset: 112)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "credentialLength", scope: !1188, file: !372, line: 165, baseType: !1191, size: 32, align: 32, offset: 144)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "commonFlags", scope: !1188, file: !372, line: 167, baseType: !1205, size: 8, align: 8, offset: 176)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8", file: !1192, line: 177, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1194, line: 48, baseType: !1207)
!1207 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "opCode", scope: !1184, file: !372, line: 185, baseType: !1191, size: 32, align: 32, offset: 184)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "requestFlags", scope: !1184, file: !372, line: 186, baseType: !1191, size: 32, align: 32, offset: 216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "timeOut", scope: !1184, file: !372, line: 188, baseType: !1191, size: 32, align: 32, offset: 248)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1184, file: !372, line: 190, baseType: !1212, size: 64, align: 64, offset: 280)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !1192, line: 171, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1194, line: 55, baseType: !1214)
!1214 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "clientHandleId", scope: !1184, file: !372, line: 191, baseType: !1191, size: 32, align: 32, offset: 344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "userCredentialType", scope: !1184, file: !372, line: 193, baseType: !1191, size: 32, align: 32, offset: 376)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "runProgramOptions", scope: !1180, file: !372, line: 512, baseType: !1218, size: 32, align: 32, offset: 408)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !1192, line: 174, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1220, line: 196, baseType: !1221)
!1220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1221 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "programNameLength", scope: !1180, file: !372, line: 513, baseType: !1191, size: 32, align: 32, offset: 440)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "commandLineArgsLength", scope: !1180, file: !372, line: 514, baseType: !1191, size: 32, align: 32, offset: 472)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgStartProgramRequest", file: !372, line: 1600, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgStartProgramRequest", file: !372, line: 1587, size: 576, align: 8, elements: !1227)
!1227 = !{!1228, !1229, !1232, !1233, !1234, !1235, !1236}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1226, file: !372, line: 1588, baseType: !1183, size: 408, align: 8)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "startMinimized", scope: !1226, file: !372, line: 1590, baseType: !1230, size: 8, align: 8, offset: 408)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !1192, line: 230, baseType: !1231)
!1231 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "programPathLength", scope: !1226, file: !372, line: 1591, baseType: !1191, size: 32, align: 32, offset: 416)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "argumentsLength", scope: !1226, file: !372, line: 1592, baseType: !1191, size: 32, align: 32, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "workingDirLength", scope: !1226, file: !372, line: 1593, baseType: !1191, size: 32, align: 32, offset: 480)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "numEnvVars", scope: !1226, file: !372, line: 1594, baseType: !1191, size: 32, align: 32, offset: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "envVarLength", scope: !1226, file: !372, line: 1595, baseType: !1191, size: 32, align: 32, offset: 544)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !1192, line: 172, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1220, line: 197, baseType: !1241)
!1241 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgSimpleFileRequest", file: !372, line: 726, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgSimpleFileRequest", file: !372, line: 719, size: 472, align: 8, elements: !1245)
!1245 = !{!1246, !1247, !1248}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1244, file: !372, line: 720, baseType: !1183, size: 408, align: 8)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1244, file: !372, line: 722, baseType: !1218, size: 32, align: 32, offset: 408)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1244, file: !372, line: 723, baseType: !1191, size: 32, align: 32, offset: 440)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgDeleteDirectoryRequest", file: !372, line: 1434, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 1425, size: 512, align: 8, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1251, file: !372, line: 1426, baseType: !1183, size: 408, align: 8)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1251, file: !372, line: 1428, baseType: !1218, size: 32, align: 32, offset: 408)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1251, file: !372, line: 1429, baseType: !1191, size: 32, align: 32, offset: 440)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "filePropertiesLength", scope: !1251, file: !372, line: 1430, baseType: !1191, size: 32, align: 32, offset: 472)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !1251, file: !372, line: 1431, baseType: !1230, size: 8, align: 8, offset: 504)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1231)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgListProcessesExRequest", file: !372, line: 1619, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgListProcessesExRequest", file: !372, line: 1604, size: 504, align: 8, elements: !1264)
!1264 = !{!1265, !1266, !1267, !1268}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1263, file: !372, line: 1605, baseType: !1183, size: 408, align: 8)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1263, file: !372, line: 1609, baseType: !1191, size: 32, align: 32, offset: 408)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1263, file: !372, line: 1613, baseType: !1191, size: 32, align: 32, offset: 440)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "numPids", scope: !1263, file: !372, line: 1614, baseType: !1191, size: 32, align: 32, offset: 472)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !1271, line: 270, baseType: !1272)
!1271 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !1273, line: 186, baseType: !1241)
!1273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandTicketedSession", file: !372, line: 317, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandTicketedSession", file: !372, line: 313, size: 32, align: 8, elements: !1277)
!1277 = !{!1278}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ticketLength", scope: !1276, file: !372, line: 314, baseType: !1191, size: 32, align: 32)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandNamePassword", file: !372, line: 305, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandNamePassword", file: !372, line: 300, size: 64, align: 8, elements: !1282)
!1282 = !{!1283, !1284}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !1281, file: !372, line: 301, baseType: !1191, size: 32, align: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "passwordLength", scope: !1281, file: !372, line: 302, baseType: !1191, size: 32, align: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AuthToken", file: !1286, line: 42, baseType: !1287)
!1286 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/auth.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1290, line: 49, size: 384, align: 64, elements: !1291)
!1290 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1291 = !{!1292, !1293, !1294, !1296, !1298, !1299, !1300}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1289, file: !1290, line: 51, baseType: !1238, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1289, file: !1290, line: 52, baseType: !1238, size: 64, align: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1289, file: !1290, line: 53, baseType: !1295, size: 32, align: 32, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !1273, line: 125, baseType: !1195)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1289, file: !1290, line: 54, baseType: !1297, size: 32, align: 32, offset: 160)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !1273, line: 126, baseType: !1195)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1289, file: !1290, line: 55, baseType: !1238, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1289, file: !1290, line: 56, baseType: !1238, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1289, file: !1290, line: 57, baseType: !1238, size: 64, align: 64, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandHgfsSendPacket", file: !372, line: 691, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandHgfsSendPacket", file: !372, line: 684, size: 472, align: 8, elements: !1304)
!1304 = !{!1305, !1306, !1307}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1303, file: !372, line: 685, baseType: !1183, size: 408, align: 8)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hgfsPacketSize", scope: !1303, file: !372, line: 687, baseType: !1191, size: 32, align: 32, offset: 408)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1303, file: !372, line: 688, baseType: !1218, size: 32, align: 32, offset: 440)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixErrorFields", file: !314, line: 121, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixErrorFields", file: !314, line: 112, size: 64, align: 8, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1310, file: !314, line: 113, baseType: !1197, size: 16, align: 16)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1310, file: !314, line: 115, baseType: !1205, size: 8, align: 8, offset: 16)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extraErrorType", scope: !1310, file: !314, line: 117, baseType: !1205, size: 8, align: 8, offset: 24)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "extraError", scope: !1310, file: !314, line: 118, baseType: !1191, size: 32, align: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsStartProgramState", file: !1318, line: 301, baseType: !1319)
!1318 = !DIFile(filename: "vixTools.c", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixToolsStartProgramState", file: !1318, line: 297, size: 128, align: 64, elements: !1320)
!1320 = !{!1321, !1326}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "procState", scope: !1319, file: !1318, line: 298, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_AsyncProc", file: !1324, line: 42, baseType: !1325)
!1324 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/procMgr.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgr_AsyncProc", file: !1324, line: 42, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "eventQueue", scope: !1319, file: !1318, line: 300, baseType: !1177, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsRunProgramState", file: !1318, line: 291, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixToolsRunProgramState", file: !1318, line: 279, size: 448, align: 64, elements: !1330)
!1330 = !{!1331, !1333, !1334, !1335, !1336, !1337, !1338}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "runProgramOptions", scope: !1329, file: !1318, line: 280, baseType: !1332, size: 32, align: 32)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixRunProgramOptions", file: !4, line: 852, baseType: !1221)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "procState", scope: !1329, file: !1318, line: 281, baseType: !1322, size: 64, align: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "tempScriptFilePath", scope: !1329, file: !1318, line: 283, baseType: !1238, size: 64, align: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "requestName", scope: !1329, file: !1318, line: 285, baseType: !1238, size: 64, align: 64, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "userName", scope: !1329, file: !1318, line: 287, baseType: !1238, size: 64, align: 64, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !1329, file: !1318, line: 288, baseType: !1238, size: 64, align: 64, offset: 320)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "eventQueue", scope: !1329, file: !1318, line: 290, baseType: !1177, size: 64, align: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsCachedListProcessesResult", file: !1318, line: 365, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixToolsCachedListProcessesResult", file: !1318, line: 356, size: 192, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1347, !1348}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "resultBuffer", scope: !1341, file: !1318, line: 357, baseType: !1238, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "resultBufferLen", scope: !1341, file: !1318, line: 358, baseType: !1345, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1346, line: 216, baseType: !1214)
!1346 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1341, file: !1318, line: 359, baseType: !1221, size: 32, align: 32, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "euid", scope: !1341, file: !1318, line: 363, baseType: !1349, size: 32, align: 32, offset: 160)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !1220, line: 80, baseType: !1295)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynArray", file: !1353, line: 42, baseType: !1354)
!1353 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynarray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynArray", file: !1353, line: 39, size: 256, align: 64, elements: !1355)
!1355 = !{!1356, !1364}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1354, file: !1353, line: 40, baseType: !1357, size: 192, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynBuf", file: !1358, line: 40, baseType: !1359)
!1358 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/dynbuf.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynBuf", file: !1358, line: 36, size: 192, align: 64, elements: !1360)
!1360 = !{!1361, !1362, !1363}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1359, file: !1358, line: 37, baseType: !1238, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1359, file: !1358, line: 38, baseType: !1345, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1359, file: !1358, line: 39, baseType: !1345, size: 64, align: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1354, file: !1353, line: 41, baseType: !1345, size: 64, align: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgrProcInfo", file: !1324, line: 65, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProcMgrProcInfo", file: !1324, line: 56, size: 320, align: 64, elements: !1368)
!1368 = !{!1369, !1373, !1374, !1375, !1376}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "procId", scope: !1367, file: !1324, line: 57, baseType: !1370, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProcMgr_Pid", file: !1324, line: 47, baseType: !1371)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1220, line: 98, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !1273, line: 133, baseType: !1221)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "procCmdName", scope: !1367, file: !1324, line: 58, baseType: !1238, size: 64, align: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "procCmdLine", scope: !1367, file: !1324, line: 59, baseType: !1238, size: 64, align: 64, offset: 128)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "procOwner", scope: !1367, file: !1324, line: 60, baseType: !1238, size: 64, align: 64, offset: 192)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "procStartTime", scope: !1367, file: !1324, line: 64, baseType: !1377, size: 64, align: 64, offset: 256)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1378, line: 75, baseType: !1379)
!1378 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1273, line: 139, baseType: !1241)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgListDirectoryRequest", file: !372, line: 738, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgListDirectoryRequest", file: !372, line: 730, size: 536, align: 8, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1384, file: !372, line: 731, baseType: !1183, size: 408, align: 8)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1384, file: !372, line: 733, baseType: !1218, size: 32, align: 32, offset: 408)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1384, file: !372, line: 734, baseType: !1191, size: 32, align: 32, offset: 440)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1384, file: !372, line: 735, baseType: !1239, size: 64, align: 64, offset: 472)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgListFilesRequest", file: !372, line: 757, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgListFilesRequest", file: !372, line: 746, size: 632, align: 8, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1398, !1399, !1400}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1392, file: !372, line: 747, baseType: !1183, size: 408, align: 8)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1392, file: !372, line: 749, baseType: !1218, size: 32, align: 32, offset: 408)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1392, file: !372, line: 750, baseType: !1191, size: 32, align: 32, offset: 440)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "patternLength", scope: !1392, file: !372, line: 751, baseType: !1191, size: 32, align: 32, offset: 472)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1392, file: !372, line: 752, baseType: !1218, size: 32, align: 32, offset: 504)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "maxResults", scope: !1392, file: !372, line: 753, baseType: !1218, size: 32, align: 32, offset: 536)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1392, file: !372, line: 754, baseType: !1212, size: 64, align: 64, offset: 568)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandKillProcessRequest", file: !372, line: 1336, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandKillProcessRequest", file: !372, line: 1329, size: 504, align: 8, elements: !1404)
!1404 = !{!1405, !1406, !1407}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1403, file: !372, line: 1330, baseType: !1183, size: 408, align: 8)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !1403, file: !372, line: 1332, baseType: !1212, size: 64, align: 64, offset: 408)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1403, file: !372, line: 1333, baseType: !1191, size: 32, align: 32, offset: 472)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgCreateFileRequest", file: !372, line: 802, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgCreateFileRequest", file: !372, line: 794, size: 504, align: 8, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1410, file: !372, line: 795, baseType: !1183, size: 408, align: 8)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1410, file: !372, line: 797, baseType: !1218, size: 32, align: 32, offset: 408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1410, file: !372, line: 798, baseType: !1191, size: 32, align: 32, offset: 440)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "filePropertiesLength", scope: !1410, file: !372, line: 799, baseType: !1191, size: 32, align: 32, offset: 472)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgCreateFileRequestEx", file: !372, line: 815, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgCreateFileRequestEx", file: !372, line: 806, size: 512, align: 8, elements: !1419)
!1419 = !{!1420, !1421, !1422, !1423, !1424}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1418, file: !372, line: 807, baseType: !1183, size: 408, align: 8)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1418, file: !372, line: 809, baseType: !1218, size: 32, align: 32, offset: 408)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1418, file: !372, line: 810, baseType: !1191, size: 32, align: 32, offset: 440)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "filePropertiesLength", scope: !1418, file: !372, line: 811, baseType: !1191, size: 32, align: 32, offset: 472)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "createParentDirectories", scope: !1418, file: !372, line: 812, baseType: !1230, size: 8, align: 8, offset: 504)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandRenameFileRequest", file: !372, line: 666, baseType: !1427)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandRenameFileRequest", file: !372, line: 657, size: 536, align: 8, elements: !1428)
!1428 = !{!1429, !1430, !1431, !1432, !1433}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1427, file: !372, line: 658, baseType: !1183, size: 408, align: 8)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "copyFileOptions", scope: !1427, file: !372, line: 660, baseType: !1218, size: 32, align: 32, offset: 408)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "oldPathNameLength", scope: !1427, file: !372, line: 661, baseType: !1191, size: 32, align: 32, offset: 440)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "newPathNameLength", scope: !1427, file: !372, line: 662, baseType: !1191, size: 32, align: 32, offset: 472)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "filePropertiesLength", scope: !1427, file: !372, line: 663, baseType: !1191, size: 32, align: 32, offset: 504)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandRenameFileRequestEx", file: !372, line: 680, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandRenameFileRequestEx", file: !372, line: 670, size: 544, align: 8, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441, !1442, !1443}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1436, file: !372, line: 671, baseType: !1183, size: 408, align: 8)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "copyFileOptions", scope: !1436, file: !372, line: 673, baseType: !1218, size: 32, align: 32, offset: 408)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "oldPathNameLength", scope: !1436, file: !372, line: 674, baseType: !1191, size: 32, align: 32, offset: 440)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "newPathNameLength", scope: !1436, file: !372, line: 675, baseType: !1191, size: 32, align: 32, offset: 472)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "filePropertiesLength", scope: !1436, file: !372, line: 676, baseType: !1191, size: 32, align: 32, offset: 504)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !1436, file: !372, line: 677, baseType: !1230, size: 8, align: 8, offset: 536)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgRunScriptRequest", file: !372, line: 1254, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgRunScriptRequest", file: !372, line: 1244, size: 536, align: 8, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1446, file: !372, line: 1245, baseType: !1183, size: 408, align: 8)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "scriptOptions", scope: !1446, file: !372, line: 1247, baseType: !1218, size: 32, align: 32, offset: 408)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "interpreterNameLength", scope: !1446, file: !372, line: 1249, baseType: !1191, size: 32, align: 32, offset: 440)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "scriptLength", scope: !1446, file: !372, line: 1250, baseType: !1191, size: 32, align: 32, offset: 472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "propertiesLength", scope: !1446, file: !372, line: 1251, baseType: !1191, size: 32, align: 32, offset: 504)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgCreateTempFileRequestEx", file: !372, line: 1420, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgCreateTempFileRequestEx", file: !372, line: 1410, size: 568, align: 8, elements: !1456)
!1456 = !{!1457, !1458, !1459, !1460, !1461, !1462}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1455, file: !372, line: 1411, baseType: !1183, size: 408, align: 8)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1455, file: !372, line: 1413, baseType: !1218, size: 32, align: 32, offset: 408)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "filePrefixLength", scope: !1455, file: !372, line: 1414, baseType: !1191, size: 32, align: 32, offset: 440)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "fileSuffixLength", scope: !1455, file: !372, line: 1415, baseType: !1191, size: 32, align: 32, offset: 472)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "directoryPathLength", scope: !1455, file: !372, line: 1416, baseType: !1191, size: 32, align: 32, offset: 504)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "propertyListLength", scope: !1455, file: !372, line: 1417, baseType: !1191, size: 32, align: 32, offset: 536)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsGetTempFileCreateNameFuncData", file: !1318, line: 382, baseType: !1465)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixToolsGetTempFileCreateNameFuncData", file: !1318, line: 378, size: 192, align: 64, elements: !1466)
!1466 = !{!1467, !1468, !1469}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "filePrefix", scope: !1465, file: !1318, line: 379, baseType: !1238, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1465, file: !1318, line: 380, baseType: !1238, size: 64, align: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "fileSuffix", scope: !1465, file: !1318, line: 381, baseType: !1238, size: 64, align: 64, offset: 128)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgReadVariableRequest", file: !372, line: 1353, baseType: !1472)
!1472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgReadVariableRequest", file: !372, line: 1345, size: 504, align: 8, elements: !1473)
!1473 = !{!1474, !1475, !1476, !1477}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1472, file: !372, line: 1346, baseType: !1183, size: 408, align: 8)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "variableType", scope: !1472, file: !372, line: 1348, baseType: !1218, size: 32, align: 32, offset: 408)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1472, file: !372, line: 1349, baseType: !1218, size: 32, align: 32, offset: 440)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !1472, file: !372, line: 1350, baseType: !1191, size: 32, align: 32, offset: 472)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgReadEnvironmentVariablesRequest", file: !372, line: 1632, baseType: !1481)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgReadEnvironmentVariablesRequest", file: !372, line: 1623, size: 472, align: 8, elements: !1482)
!1482 = !{!1483, !1484, !1485}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1481, file: !372, line: 1624, baseType: !1183, size: 408, align: 8)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "numNames", scope: !1481, file: !372, line: 1626, baseType: !1191, size: 32, align: 32, offset: 408)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "namesLength", scope: !1481, file: !372, line: 1627, baseType: !1191, size: 32, align: 32, offset: 440)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgWriteVariableRequest", file: !372, line: 1384, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgWriteVariableRequest", file: !372, line: 1374, size: 536, align: 8, elements: !1489)
!1489 = !{!1490, !1491, !1492, !1493, !1494}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1488, file: !372, line: 1375, baseType: !1183, size: 408, align: 8)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "variableType", scope: !1488, file: !372, line: 1377, baseType: !1218, size: 32, align: 32, offset: 408)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1488, file: !372, line: 1378, baseType: !1218, size: 32, align: 32, offset: 440)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "nameLength", scope: !1488, file: !372, line: 1380, baseType: !1191, size: 32, align: 32, offset: 472)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "valueLength", scope: !1488, file: !372, line: 1381, baseType: !1191, size: 32, align: 32, offset: 504)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixMsgSetGuestFileAttributesRequest", file: !372, line: 709, baseType: !1497)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixMsgSetGuestFileAttributesRequest", file: !372, line: 695, size: 712, align: 8, elements: !1498)
!1498 = !{!1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1497, file: !372, line: 696, baseType: !1183, size: 408, align: 8)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "fileOptions", scope: !1497, file: !372, line: 698, baseType: !1218, size: 32, align: 32, offset: 408)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "accessTime", scope: !1497, file: !372, line: 699, baseType: !1239, size: 64, align: 64, offset: 440)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "modificationTime", scope: !1497, file: !372, line: 700, baseType: !1239, size: 64, align: 64, offset: 504)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "ownerId", scope: !1497, file: !372, line: 701, baseType: !1218, size: 32, align: 32, offset: 568)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "groupId", scope: !1497, file: !372, line: 702, baseType: !1218, size: 32, align: 32, offset: 600)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !1497, file: !372, line: 703, baseType: !1218, size: 32, align: 32, offset: 632)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hidden", scope: !1497, file: !372, line: 704, baseType: !1230, size: 8, align: 8, offset: 664)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "readOnly", scope: !1497, file: !372, line: 705, baseType: !1230, size: 8, align: 8, offset: 672)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1497, file: !372, line: 706, baseType: !1191, size: 32, align: 32, offset: 680)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !1512, line: 56, baseType: !1513)
!1512 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !1512, line: 56, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "xdrproc_t", file: !1171, line: 152, baseType: !1515)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!1518, !1520, !1177, null}
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool_t", file: !1519, line: 37, baseType: !1221)
!1519 = !DIFile(filename: "/usr/include/rpc/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "XDR", file: !1171, line: 109, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "XDR", file: !1171, line: 110, size: 384, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1581, !1582, !1583, !1584}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "x_op", scope: !1522, file: !1171, line: 112, baseType: !1170, size: 32, align: 32)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "x_ops", scope: !1522, file: !1171, line: 136, baseType: !1526, size: 64, align: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdr_ops", file: !1171, line: 113, size: 640, align: 64, elements: !1528)
!1528 = !{!1529, !1534, !1540, !1548, !1552, !1558, !1562, !1567, !1571, !1575}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "x_getlong", scope: !1527, file: !1171, line: 115, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!1518, !1520, !1533}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "x_putlong", scope: !1527, file: !1171, line: 117, baseType: !1535, size: 64, align: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!1518, !1520, !1538}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "x_getbytes", scope: !1527, file: !1171, line: 119, baseType: !1541, size: 64, align: 64, offset: 128)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1518, !1520, !1544, !1546}
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !1220, line: 116, baseType: !1545)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__caddr_t", file: !1273, line: 183, baseType: !1238)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int", file: !1220, line: 35, baseType: !1547)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u_int", file: !1273, line: 32, baseType: !1195)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "x_putbytes", scope: !1527, file: !1171, line: 121, baseType: !1549, size: 64, align: 64, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!1518, !1520, !1259, !1546}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "x_getpostn", scope: !1527, file: !1171, line: 123, baseType: !1553, size: 64, align: 64, offset: 256)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!1546, !1556}
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1521)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "x_setpostn", scope: !1527, file: !1171, line: 125, baseType: !1559, size: 64, align: 64, offset: 320)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!1518, !1520, !1546}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "x_inline", scope: !1527, file: !1171, line: 127, baseType: !1563, size: 64, align: 64, offset: 384)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!1566, !1520, !1546}
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "x_destroy", scope: !1527, file: !1171, line: 129, baseType: !1568, size: 64, align: 64, offset: 448)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{null, !1520}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "x_getint32", scope: !1527, file: !1171, line: 131, baseType: !1572, size: 64, align: 64, offset: 512)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!1518, !1520, !1566}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "x_putint32", scope: !1527, file: !1171, line: 133, baseType: !1576, size: 64, align: 64, offset: 576)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1518, !1520, !1579}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "x_public", scope: !1522, file: !1171, line: 137, baseType: !1544, size: 64, align: 64, offset: 128)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "x_private", scope: !1522, file: !1171, line: 138, baseType: !1544, size: 64, align: 64, offset: 192)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "x_base", scope: !1522, file: !1171, line: 139, baseType: !1544, size: 64, align: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "x_handy", scope: !1522, file: !1171, line: 140, baseType: !1546, size: 32, align: 32, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixCommandInitiateFileTransferToGuestRequest", file: !372, line: 769, baseType: !1587)
!1587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixCommandInitiateFileTransferToGuestRequest", file: !372, line: 761, size: 480, align: 8, elements: !1588)
!1588 = !{!1589, !1590, !1591, !1592}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1587, file: !372, line: 762, baseType: !1183, size: 408, align: 8)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1587, file: !372, line: 764, baseType: !1218, size: 32, align: 32, offset: 408)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "guestPathNameLength", scope: !1587, file: !372, line: 765, baseType: !1191, size: 32, align: 32, offset: 440)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !1587, file: !372, line: 766, baseType: !1230, size: 8, align: 8, offset: 472)
!1593 = !{!1594, !1595, !1604, !1606, !1610, !1617, !1621, !1629, !1638, !1641, !1642, !1648, !1649, !1654, !1735, !1736, !1737, !1742, !1758, !1759, !1764, !1771, !1772, !1773, !1774, !1776, !1777, !1785}
!1594 = distinct !DIGlobalVariable(name: "gImpersonatedUsername", scope: !0, file: !1318, line: 201, type: !1238, isLocal: false, isDefinition: true, variable: i8** @gImpersonatedUsername)
!1595 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1596, file: !1318, line: 1093, type: !1601, isLocal: true, isDefinition: true, variable: [32 x i8]* @VixTools_RunProgram.resultBuffer)
!1596 = distinct !DISubprogram(name: "VixTools_RunProgram", scope: !1318, file: !1318, line: 1081, type: !1597, isLocal: false, isDefinition: true, scopeLine: 1085, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!1599, !1509, !1238, !1177, !1237}
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixError", file: !4, line: 79, baseType: !1212)
!1600 = !{}
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 256, align: 8, elements: !1602)
!1602 = !{!1603}
!1603 = !DISubrange(count: 32)
!1604 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1605, file: !1318, line: 1203, type: !1601, isLocal: true, isDefinition: true, variable: [32 x i8]* @VixTools_StartProgram.resultBuffer)
!1605 = distinct !DISubprogram(name: "VixTools_StartProgram", scope: !1318, file: !1318, line: 1186, type: !1597, isLocal: false, isDefinition: true, scopeLine: 1190, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1606 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1607, file: !1318, line: 3640, type: !1601, isLocal: true, isDefinition: true, variable: [32 x i8]* @VixToolsObjectExists.resultBuffer)
!1607 = distinct !DISubprogram(name: "VixToolsObjectExists", scope: !1318, file: !1318, line: 3633, type: !1608, isLocal: false, isDefinition: true, scopeLine: 3635, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!1599, !1509, !1237}
!1610 = distinct !DIGlobalVariable(name: "resultHeaderFormatString", scope: !1611, file: !1318, line: 5415, type: !1614, isLocal: true, isDefinition: true, variable: [66 x i8]* @VixToolsListProcessesEx.resultHeaderFormatString)
!1611 = distinct !DISubprogram(name: "VixToolsListProcessesEx", scope: !1318, file: !1318, line: 5390, type: !1612, isLocal: false, isDefinition: true, scopeLine: 5394, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!1599, !1509, !1345, !1177, !1237}
!1614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1260, size: 528, align: 8, elements: !1615)
!1615 = !{!1616}
!1616 = !DISubrange(count: 66)
!1617 = distinct !DIGlobalVariable(name: "leftHeaderFormatString", scope: !1611, file: !1318, line: 5420, type: !1618, isLocal: true, isDefinition: true, variable: [28 x i8]* @VixToolsListProcessesEx.leftHeaderFormatString)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1260, size: 224, align: 8, elements: !1619)
!1619 = !{!1620}
!1620 = !DISubrange(count: 28)
!1621 = distinct !DIGlobalVariable(name: "bytesToEscape", scope: !1622, file: !1318, line: 11261, type: !1625, isLocal: true, isDefinition: true, variable: [256 x i32]* @VixToolsEscapeXMLString.bytesToEscape)
!1622 = distinct !DISubprogram(name: "VixToolsEscapeXMLString", scope: !1318, file: !1318, line: 11254, type: !1623, isLocal: false, isDefinition: true, scopeLine: 11255, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!1238, !1259}
!1625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1626, size: 8192, align: 32, elements: !1627)
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1627 = !{!1628}
!1628 = !DISubrange(count: 256)
!1629 = distinct !DIGlobalVariable(name: "gVixHgfsBkdrConn", scope: !0, file: !1318, line: 422, type: !1630, isLocal: true, isDefinition: true, variable: %struct.HgfsServerMgrData* @gVixHgfsBkdrConn)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "HgfsServerMgrData", file: !1631, line: 49, baseType: !1632)
!1631 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hgfsServerManager.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HgfsServerMgrData", file: !1631, line: 44, size: 256, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "appName", scope: !1632, file: !1631, line: 45, baseType: !1259, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !1632, file: !1631, line: 46, baseType: !1177, size: 64, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rpcCallback", scope: !1632, file: !1631, line: 47, baseType: !1177, size: 64, align: 64, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !1632, file: !1631, line: 48, baseType: !1177, size: 64, align: 64, offset: 192)
!1638 = distinct !DIGlobalVariable(name: "gHgfsSessionInvalidatorTimerId", scope: !0, file: !1318, line: 437, type: !1639, isLocal: true, isDefinition: true, variable: i32* @gHgfsSessionInvalidatorTimerId)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !1640, line: 55, baseType: !1195)
!1640 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1641 = distinct !DIGlobalVariable(name: "thisProcessRunsAsRoot", scope: !0, file: !1318, line: 387, type: !1230, isLocal: true, isDefinition: true, variable: i8* @thisProcessRunsAsRoot)
!1642 = distinct !DIGlobalVariable(name: "reportProgramDoneProc", scope: !0, file: !1318, line: 389, type: !1643, isLocal: true, isDefinition: true, variable: void (i8*, i64, i32, i64, i8*)** @reportProgramDoneProc)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsReportProgramDoneProcType", file: !1644, line: 60, baseType: !1645)
!1644 = !DIFile(filename: "vixToolsInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1259, !1599, !1221, !1239, !1177}
!1648 = distinct !DIGlobalVariable(name: "reportProgramDoneData", scope: !0, file: !1318, line: 390, type: !1177, isLocal: true, isDefinition: true, variable: i8** @reportProgramDoneData)
!1649 = distinct !DIGlobalVariable(name: "listProcessesResultsTable", scope: !0, file: !1318, line: 346, type: !1650, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @listProcessesResultsTable)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !1652, line: 37, baseType: !1653)
!1652 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !1652, line: 37, flags: DIFlagFwdDecl)
!1654 = distinct !DIGlobalVariable(name: "gHgfsSessionInvalidatorTimer", scope: !0, file: !1318, line: 436, type: !1655, isLocal: true, isDefinition: true, variable: %struct._GSource** @gHgfsSessionInvalidatorTimer)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !1512, line: 64, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !1512, line: 171, size: 768, align: 64, elements: !1658)
!1658 = !{!1659, !1661, !1683, !1712, !1713, !1717, !1718, !1719, !1720, !1728, !1729, !1730, !1731}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !1657, file: !1512, line: 174, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !1640, line: 77, baseType: !1177)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !1657, file: !1512, line: 175, baseType: !1662, size: 64, align: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !1512, line: 77, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !1512, line: 196, size: 192, align: 64, elements: !1665)
!1665 = !{!1666, !1670, !1671}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1664, file: !1512, line: 198, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{null, !1660}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !1664, file: !1512, line: 199, baseType: !1667, size: 64, align: 64, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !1664, file: !1512, line: 200, baseType: !1672, size: 64, align: 64, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{null, !1660, !1655, !1675, !1682}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !1512, line: 155, baseType: !1677)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!1680, !1660}
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !1640, line: 50, baseType: !1681)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !1640, line: 49, baseType: !1221)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !1657, file: !1512, line: 177, baseType: !1684, size: 64, align: 64, offset: 128)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1686)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !1512, line: 130, baseType: !1687)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !1512, line: 214, size: 384, align: 64, elements: !1688)
!1688 = !{!1689, !1694, !1698, !1702, !1706, !1707}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !1687, file: !1512, line: 216, baseType: !1690, size: 64, align: 64)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!1680, !1655, !1693}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1687, file: !1512, line: 218, baseType: !1695, size: 64, align: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!1680, !1655}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !1687, file: !1512, line: 219, baseType: !1699, size: 64, align: 64, offset: 128)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!1680, !1655, !1676, !1660}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !1687, file: !1512, line: 222, baseType: !1703, size: 64, align: 64, offset: 192)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !1655}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !1687, file: !1512, line: 226, baseType: !1676, size: 64, align: 64, offset: 256)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !1687, file: !1512, line: 227, baseType: !1708, size: 64, align: 64, offset: 320)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !1512, line: 212, baseType: !1709)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{null}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1657, file: !1512, line: 178, baseType: !1639, size: 32, align: 32, offset: 192)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1657, file: !1512, line: 180, baseType: !1714, size: 64, align: 64, offset: 256)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !1512, line: 48, baseType: !1716)
!1716 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !1512, line: 48, flags: DIFlagFwdDecl)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1657, file: !1512, line: 182, baseType: !1681, size: 32, align: 32, offset: 320)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1657, file: !1512, line: 183, baseType: !1639, size: 32, align: 32, offset: 352)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !1657, file: !1512, line: 184, baseType: !1639, size: 32, align: 32, offset: 384)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !1657, file: !1512, line: 186, baseType: !1721, size: 64, align: 64, offset: 448)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !1723, line: 37, baseType: !1724)
!1723 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !1723, line: 39, size: 128, align: 64, elements: !1725)
!1725 = !{!1726, !1727}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1724, file: !1723, line: 41, baseType: !1660, size: 64, align: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1724, file: !1723, line: 42, baseType: !1721, size: 64, align: 64, offset: 64)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1657, file: !1512, line: 188, baseType: !1655, size: 64, align: 64, offset: 512)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1657, file: !1512, line: 189, baseType: !1655, size: 64, align: 64, offset: 576)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1657, file: !1512, line: 191, baseType: !1238, size: 64, align: 64, offset: 640)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1657, file: !1512, line: 193, baseType: !1732, size: 64, align: 64, offset: 704)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !1512, line: 65, baseType: !1734)
!1734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !1512, line: 65, flags: DIFlagFwdDecl)
!1735 = distinct !DIGlobalVariable(name: "gRestrictCommands", scope: !0, file: !1318, line: 409, type: !1680, isLocal: true, isDefinition: true, variable: i32* @gRestrictCommands)
!1736 = distinct !DIGlobalVariable(name: "allowConsoleUserOps", scope: !0, file: !1318, line: 388, type: !1230, isLocal: true, isDefinition: true, variable: i8* @allowConsoleUserOps)
!1737 = distinct !DIGlobalVariable(name: "userEnvironmentTable", scope: !0, file: !1318, line: 420, type: !1738, isLocal: true, isDefinition: true, variable: %struct.HashTable** @userEnvironmentTable)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_typedef, name: "HashTable", file: !1740, line: 40, baseType: !1741)
!1740 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/hashTable.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1741 = !DICompositeType(tag: DW_TAG_structure_type, name: "HashTable", file: !1740, line: 40, flags: DIFlagFwdDecl)
!1742 = distinct !DIGlobalVariable(name: "startedProcessList", scope: !0, file: !1318, line: 334, type: !1743, isLocal: true, isDefinition: true, variable: %struct.VixToolsStartedProgramState** @startedProcessList)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_typedef, name: "VixToolsStartedProgramState", file: !1318, line: 332, baseType: !1745)
!1745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VixToolsStartedProgramState", file: !1318, line: 321, size: 640, align: 64, elements: !1746)
!1746 = !{!1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "cmdName", scope: !1745, file: !1318, line: 322, baseType: !1238, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "fullCommandLine", scope: !1745, file: !1318, line: 323, baseType: !1238, size: 64, align: 64, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1745, file: !1318, line: 324, baseType: !1238, size: 64, align: 64, offset: 128)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !1745, file: !1318, line: 325, baseType: !1212, size: 64, align: 64, offset: 192)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "startTime", scope: !1745, file: !1318, line: 326, baseType: !1377, size: 64, align: 64, offset: 256)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "exitCode", scope: !1745, file: !1318, line: 327, baseType: !1221, size: 32, align: 32, offset: 320)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "endTime", scope: !1745, file: !1318, line: 328, baseType: !1377, size: 64, align: 64, offset: 384)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "isRunning", scope: !1745, file: !1318, line: 329, baseType: !1230, size: 8, align: 8, offset: 448)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "procState", scope: !1745, file: !1318, line: 330, baseType: !1322, size: 64, align: 64, offset: 512)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1745, file: !1318, line: 331, baseType: !1757, size: 64, align: 64, offset: 576)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1758 = distinct !DIGlobalVariable(name: "listProcessesResultsKey", scope: !0, file: !1318, line: 370, type: !1191, isLocal: true, isDefinition: true, variable: i32* @listProcessesResultsKey)
!1759 = distinct !DIGlobalVariable(name: "gConfDictRef", scope: !0, file: !1318, line: 397, type: !1760, isLocal: true, isDefinition: true, variable: %struct._GKeyFile** @gConfDictRef)
!1760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1761, size: 64, align: 64)
!1761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !1762, line: 48, baseType: !1763)
!1762 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1550")
!1763 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !1762, line: 48, flags: DIFlagFwdDecl)
!1764 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1765, file: !1318, line: 4976, type: !1768, isLocal: true, isDefinition: true, variable: [65536 x i8]* @VixToolsListProcesses.resultBuffer)
!1765 = distinct !DISubprogram(name: "VixToolsListProcesses", scope: !1318, file: !1318, line: 4970, type: !1766, isLocal: true, isDefinition: true, scopeLine: 4973, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1766 = !DISubroutineType(types: !1767)
!1767 = !{!1599, !1509, !1345, !1237}
!1768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 524288, align: 8, elements: !1769)
!1769 = !{!1770}
!1770 = !DISubrange(count: 65536)
!1771 = distinct !DIGlobalVariable(name: "fileInfoFormatString", scope: !0, file: !1318, line: 456, type: !1259, isLocal: true, isDefinition: true, variable: i8** @fileInfoFormatString)
!1772 = distinct !DIGlobalVariable(name: "listFilesRemainingFormatString", scope: !0, file: !1318, line: 463, type: !1259, isLocal: true, isDefinition: true, variable: i8** @listFilesRemainingFormatString)
!1773 = distinct !DIGlobalVariable(name: "fileExtendedInfoLinuxFormatString", scope: !0, file: !1318, line: 475, type: !1259, isLocal: true, isDefinition: true, variable: i8** @fileExtendedInfoLinuxFormatString)
!1774 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1775, file: !1318, line: 7225, type: !1601, isLocal: true, isDefinition: true, variable: [32 x i8]* @VixToolsRunScript.resultBuffer)
!1775 = distinct !DISubprogram(name: "VixToolsRunScript", scope: !1318, file: !1318, line: 7203, type: !1597, isLocal: true, isDefinition: true, scopeLine: 7207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1776 = distinct !DIGlobalVariable(name: "scriptFileBaseName", scope: !0, file: !1318, line: 512, type: !1259, isLocal: true, isDefinition: true, variable: i8** @scriptFileBaseName)
!1777 = distinct !DIGlobalVariable(name: "hgfsReplyPacket", scope: !1778, file: !1318, line: 8467, type: !1782, isLocal: true, isDefinition: true, variable: [63488 x i8]* @VixToolsProcessHgfsPacket.hgfsReplyPacket)
!1778 = distinct !DISubprogram(name: "VixToolsProcessHgfsPacket", scope: !1318, file: !1318, line: 8457, type: !1779, isLocal: true, isDefinition: true, scopeLine: 8461, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1779 = !DISubroutineType(types: !1780)
!1780 = !{!1599, !1301, !1510, !1237, !1781}
!1781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 507904, align: 8, elements: !1783)
!1783 = !{!1784}
!1784 = !DISubrange(count: 63488)
!1785 = distinct !DIGlobalVariable(name: "resultBuffer", scope: !1786, file: !1318, line: 8553, type: !1768, isLocal: true, isDefinition: true, variable: [65536 x i8]* @VixToolsListFileSystems.resultBuffer)
!1786 = distinct !DISubprogram(name: "VixToolsListFileSystems", scope: !1318, file: !1318, line: 8549, type: !1608, isLocal: true, isDefinition: true, scopeLine: 8551, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1787 = !{i32 2, !"Dwarf Version", i32 4}
!1788 = !{i32 2, !"Debug Info Version", i32 3}
!1789 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!1790 = distinct !DISubprogram(name: "VixTools_Initialize", scope: !1318, file: !1318, line: 710, type: !1791, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1791 = !DISubroutineType(types: !1792)
!1792 = !{!1599, !1230, !1793, !1643, !1177}
!1793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64, align: 64)
!1794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1795 = !DILocalVariable(name: "thisProcessRunsAsRootParam", arg: 1, scope: !1790, file: !1318, line: 710, type: !1230)
!1796 = !DIExpression()
!1797 = !DILocation(line: 710, column: 26, scope: !1790)
!1798 = !DILocalVariable(name: "originalEnvp", arg: 2, scope: !1790, file: !1318, line: 711, type: !1793)
!1799 = !DILocation(line: 711, column: 41, scope: !1790)
!1800 = !DILocalVariable(name: "reportProgramDoneProcParam", arg: 3, scope: !1790, file: !1318, line: 712, type: !1643)
!1801 = !DILocation(line: 712, column: 55, scope: !1790)
!1802 = !DILocalVariable(name: "clientData", arg: 4, scope: !1790, file: !1318, line: 713, type: !1177)
!1803 = !DILocation(line: 713, column: 27, scope: !1790)
!1804 = !DILocalVariable(name: "err", scope: !1790, file: !1318, line: 715, type: !1599)
!1805 = !DILocation(line: 715, column: 13, scope: !1790)
!1806 = !DILocation(line: 733, column: 28, scope: !1790)
!1807 = !DILocation(line: 733, column: 26, scope: !1790)
!1808 = !DILocation(line: 734, column: 28, scope: !1790)
!1809 = !DILocation(line: 734, column: 26, scope: !1790)
!1810 = !DILocation(line: 735, column: 28, scope: !1790)
!1811 = !DILocation(line: 735, column: 26, scope: !1790)
!1812 = !DILocation(line: 738, column: 38, scope: !1790)
!1813 = !DILocation(line: 738, column: 4, scope: !1790)
!1814 = !DILocation(line: 742, column: 4, scope: !1790)
!1815 = distinct !{!1815, !1814}
!1816 = !DILocation(line: 742, column: 38, scope: !1817)
!1817 = !DILexicalBlockFile(scope: !1818, file: !1318, discriminator: 1)
!1818 = distinct !DILexicalBlock(scope: !1790, file: !1318, line: 742, column: 7)
!1819 = !DILocation(line: 742, column: 94, scope: !1817)
!1820 = !DILocation(line: 742, column: 39, scope: !1817)
!1821 = !DILocation(line: 742, column: 5, scope: !1817)
!1822 = !DILocation(line: 746, column: 4, scope: !1790)
!1823 = !DILocation(line: 748, column: 32, scope: !1790)
!1824 = !DILocation(line: 748, column: 30, scope: !1790)
!1825 = !DILocation(line: 771, column: 11, scope: !1790)
!1826 = !DILocation(line: 771, column: 4, scope: !1790)
!1827 = distinct !DISubprogram(name: "VixToolsBuildUserEnvironmentTable", scope: !1318, file: !1318, line: 850, type: !1828, isLocal: true, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1828 = !DISubroutineType(types: !1829)
!1829 = !{null, !1793}
!1830 = !DILocalVariable(name: "envp", arg: 1, scope: !1827, file: !1318, line: 850, type: !1793)
!1831 = !DILocation(line: 850, column: 55, scope: !1827)
!1832 = !DILocation(line: 852, column: 15, scope: !1833)
!1833 = distinct !DILexicalBlock(scope: !1827, file: !1318, line: 852, column: 7)
!1834 = !DILocation(line: 852, column: 12, scope: !1833)
!1835 = !DILocation(line: 852, column: 7, scope: !1827)
!1836 = !DILocation(line: 854, column: 7, scope: !1837)
!1837 = distinct !DILexicalBlock(scope: !1833, file: !1318, line: 852, column: 21)
!1838 = !DILocation(line: 857, column: 15, scope: !1839)
!1839 = distinct !DILexicalBlock(scope: !1827, file: !1318, line: 857, column: 7)
!1840 = !DILocation(line: 857, column: 12, scope: !1839)
!1841 = !DILocation(line: 857, column: 7, scope: !1827)
!1842 = !DILocation(line: 858, column: 30, scope: !1843)
!1843 = distinct !DILexicalBlock(scope: !1839, file: !1318, line: 857, column: 37)
!1844 = !DILocation(line: 858, column: 28, scope: !1843)
!1845 = !DILocation(line: 861, column: 4, scope: !1843)
!1846 = !DILocation(line: 867, column: 23, scope: !1847)
!1847 = distinct !DILexicalBlock(scope: !1839, file: !1318, line: 861, column: 11)
!1848 = !DILocation(line: 867, column: 7, scope: !1847)
!1849 = !DILocation(line: 870, column: 4, scope: !1827)
!1850 = !DILocation(line: 870, column: 19, scope: !1851)
!1851 = !DILexicalBlockFile(scope: !1852, file: !1318, discriminator: 1)
!1852 = distinct !DILexicalBlock(scope: !1853, file: !1318, line: 870, column: 4)
!1853 = distinct !DILexicalBlock(scope: !1827, file: !1318, line: 870, column: 4)
!1854 = !DILocation(line: 870, column: 18, scope: !1851)
!1855 = !DILocation(line: 870, column: 15, scope: !1851)
!1856 = !DILocation(line: 870, column: 4, scope: !1851)
!1857 = !DILocalVariable(name: "name", scope: !1858, file: !1318, line: 871, type: !1238)
!1858 = distinct !DILexicalBlock(scope: !1852, file: !1318, line: 870, column: 33)
!1859 = !DILocation(line: 871, column: 13, scope: !1858)
!1860 = !DILocalVariable(name: "value", scope: !1858, file: !1318, line: 872, type: !1238)
!1861 = !DILocation(line: 872, column: 13, scope: !1858)
!1862 = !DILocalVariable(name: "whereToSplit", scope: !1858, file: !1318, line: 873, type: !1238)
!1863 = !DILocation(line: 873, column: 13, scope: !1858)
!1864 = !DILocalVariable(name: "nameLen", scope: !1858, file: !1318, line: 874, type: !1345)
!1865 = !DILocation(line: 874, column: 14, scope: !1858)
!1866 = !DILocation(line: 876, column: 30, scope: !1858)
!1867 = !DILocation(line: 876, column: 29, scope: !1858)
!1868 = !DILocation(line: 876, column: 22, scope: !1858)
!1869 = !DILocation(line: 876, column: 20, scope: !1858)
!1870 = !DILocation(line: 877, column: 18, scope: !1871)
!1871 = distinct !DILexicalBlock(scope: !1858, file: !1318, line: 877, column: 10)
!1872 = !DILocation(line: 877, column: 15, scope: !1871)
!1873 = !DILocation(line: 877, column: 10, scope: !1858)
!1874 = !DILocation(line: 880, column: 10, scope: !1875)
!1875 = distinct !DILexicalBlock(scope: !1871, file: !1318, line: 877, column: 32)
!1876 = !DILocation(line: 883, column: 17, scope: !1858)
!1877 = !DILocation(line: 883, column: 33, scope: !1858)
!1878 = !DILocation(line: 883, column: 32, scope: !1858)
!1879 = !DILocation(line: 883, column: 30, scope: !1858)
!1880 = !DILocation(line: 883, column: 15, scope: !1858)
!1881 = !DILocation(line: 884, column: 31, scope: !1858)
!1882 = !DILocation(line: 884, column: 39, scope: !1858)
!1883 = !DILocation(line: 884, column: 14, scope: !1858)
!1884 = !DILocation(line: 884, column: 12, scope: !1858)
!1885 = !DILocation(line: 885, column: 14, scope: !1858)
!1886 = !DILocation(line: 885, column: 21, scope: !1858)
!1887 = !DILocation(line: 885, column: 20, scope: !1858)
!1888 = !DILocation(line: 885, column: 27, scope: !1858)
!1889 = !DILocation(line: 885, column: 7, scope: !1858)
!1890 = !DILocation(line: 886, column: 12, scope: !1858)
!1891 = !DILocation(line: 886, column: 7, scope: !1858)
!1892 = !DILocation(line: 886, column: 21, scope: !1858)
!1893 = !DILocation(line: 888, column: 19, scope: !1858)
!1894 = !DILocation(line: 890, column: 32, scope: !1858)
!1895 = !DILocation(line: 890, column: 15, scope: !1858)
!1896 = !DILocation(line: 890, column: 13, scope: !1858)
!1897 = !DILocation(line: 892, column: 24, scope: !1858)
!1898 = !DILocation(line: 892, column: 46, scope: !1858)
!1899 = !DILocation(line: 892, column: 52, scope: !1858)
!1900 = !DILocation(line: 892, column: 7, scope: !1858)
!1901 = !DILocation(line: 895, column: 12, scope: !1858)
!1902 = !DILocation(line: 895, column: 7, scope: !1858)
!1903 = !DILocation(line: 897, column: 4, scope: !1858)
!1904 = !DILocation(line: 870, column: 29, scope: !1905)
!1905 = !DILexicalBlockFile(scope: !1852, file: !1318, discriminator: 2)
!1906 = !DILocation(line: 870, column: 4, scope: !1905)
!1907 = distinct !{!1907, !1849}
!1908 = !DILocation(line: 898, column: 1, scope: !1827)
!1909 = distinct !DISubprogram(name: "VixToolsFreeCachedResult", scope: !1318, file: !1318, line: 5154, type: !1668, isLocal: true, isDefinition: true, scopeLine: 5155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1910 = !DILocalVariable(name: "ptr", arg: 1, scope: !1909, file: !1318, line: 5154, type: !1660)
!1911 = !DILocation(line: 5154, column: 35, scope: !1909)
!1912 = !DILocalVariable(name: "p", scope: !1909, file: !1318, line: 5156, type: !1339)
!1913 = !DILocation(line: 5156, column: 39, scope: !1909)
!1914 = !DILocation(line: 5156, column: 81, scope: !1909)
!1915 = !DILocation(line: 5156, column: 43, scope: !1909)
!1916 = !DILocation(line: 5158, column: 15, scope: !1917)
!1917 = distinct !DILexicalBlock(scope: !1909, file: !1318, line: 5158, column: 7)
!1918 = !DILocation(line: 5158, column: 12, scope: !1917)
!1919 = !DILocation(line: 5158, column: 7, scope: !1909)
!1920 = !DILocation(line: 5159, column: 12, scope: !1921)
!1921 = distinct !DILexicalBlock(scope: !1917, file: !1318, line: 5158, column: 18)
!1922 = !DILocation(line: 5159, column: 15, scope: !1921)
!1923 = !DILocation(line: 5159, column: 7, scope: !1921)
!1924 = !DILocation(line: 5163, column: 12, scope: !1921)
!1925 = !DILocation(line: 5163, column: 7, scope: !1921)
!1926 = !DILocation(line: 5164, column: 4, scope: !1921)
!1927 = !DILocation(line: 5165, column: 1, scope: !1909)
!1928 = distinct !DISubprogram(name: "VixTools_Uninitialize", scope: !1318, file: !1318, line: 791, type: !1710, isLocal: false, isDefinition: true, scopeLine: 792, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1929 = !DILocation(line: 793, column: 15, scope: !1930)
!1930 = distinct !DILexicalBlock(scope: !1928, file: !1318, line: 793, column: 7)
!1931 = !DILocation(line: 793, column: 12, scope: !1930)
!1932 = !DILocation(line: 793, column: 7, scope: !1928)
!1933 = !DILocation(line: 794, column: 23, scope: !1934)
!1934 = distinct !DILexicalBlock(scope: !1930, file: !1318, line: 793, column: 45)
!1935 = !DILocation(line: 794, column: 7, scope: !1934)
!1936 = !DILocation(line: 795, column: 22, scope: !1934)
!1937 = !DILocation(line: 795, column: 7, scope: !1934)
!1938 = !DILocation(line: 796, column: 36, scope: !1934)
!1939 = !DILocation(line: 797, column: 38, scope: !1934)
!1940 = !DILocation(line: 798, column: 7, scope: !1934)
!1941 = !DILocation(line: 799, column: 4, scope: !1934)
!1942 = !DILocation(line: 801, column: 4, scope: !1928)
!1943 = !DILocation(line: 802, column: 1, scope: !1928)
!1944 = distinct !DISubprogram(name: "VixTools_RestrictCommands", scope: !1318, file: !1318, line: 821, type: !1945, isLocal: false, isDefinition: true, scopeLine: 822, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1945 = !DISubroutineType(types: !1946)
!1946 = !{null, !1680}
!1947 = !DILocalVariable(name: "restricted", arg: 1, scope: !1944, file: !1318, line: 821, type: !1680)
!1948 = !DILocation(line: 821, column: 36, scope: !1944)
!1949 = !DILocation(line: 823, column: 24, scope: !1944)
!1950 = !DILocation(line: 823, column: 22, scope: !1944)
!1951 = !DILocation(line: 824, column: 1, scope: !1944)
!1952 = distinct !DISubprogram(name: "VixTools_SetConsoleUserPolicy", scope: !1318, file: !1318, line: 1029, type: !1953, isLocal: false, isDefinition: true, scopeLine: 1030, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1953 = !DISubroutineType(types: !1954)
!1954 = !{null, !1230}
!1955 = !DILocalVariable(name: "allowConsoleUserOpsParam", arg: 1, scope: !1952, file: !1318, line: 1029, type: !1230)
!1956 = !DILocation(line: 1029, column: 36, scope: !1952)
!1957 = !DILocation(line: 1031, column: 26, scope: !1952)
!1958 = !DILocation(line: 1031, column: 24, scope: !1952)
!1959 = !DILocation(line: 1032, column: 1, scope: !1952)
!1960 = distinct !DISubprogram(name: "VixTools_SetRunProgramCallback", scope: !1318, file: !1318, line: 1056, type: !1961, isLocal: false, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!1961 = !DISubroutineType(types: !1962)
!1962 = !{null, !1643, !1177}
!1963 = !DILocalVariable(name: "reportProgramDoneProcParam", arg: 1, scope: !1960, file: !1318, line: 1056, type: !1643)
!1964 = !DILocation(line: 1056, column: 66, scope: !1960)
!1965 = !DILocalVariable(name: "clientData", arg: 2, scope: !1960, file: !1318, line: 1057, type: !1177)
!1966 = !DILocation(line: 1057, column: 38, scope: !1960)
!1967 = !DILocation(line: 1059, column: 28, scope: !1960)
!1968 = !DILocation(line: 1059, column: 26, scope: !1960)
!1969 = !DILocation(line: 1060, column: 28, scope: !1960)
!1970 = !DILocation(line: 1060, column: 26, scope: !1960)
!1971 = !DILocation(line: 1061, column: 1, scope: !1960)
!1972 = !DILocalVariable(name: "requestMsg", arg: 1, scope: !1596, file: !1318, line: 1081, type: !1509)
!1973 = !DILocation(line: 1081, column: 46, scope: !1596)
!1974 = !DILocalVariable(name: "requestName", arg: 2, scope: !1596, file: !1318, line: 1082, type: !1238)
!1975 = !DILocation(line: 1082, column: 27, scope: !1596)
!1976 = !DILocalVariable(name: "eventQueue", arg: 3, scope: !1596, file: !1318, line: 1083, type: !1177)
!1977 = !DILocation(line: 1083, column: 27, scope: !1596)
!1978 = !DILocalVariable(name: "result", arg: 4, scope: !1596, file: !1318, line: 1084, type: !1237)
!1979 = !DILocation(line: 1084, column: 28, scope: !1596)
!1980 = !DILocalVariable(name: "err", scope: !1596, file: !1318, line: 1086, type: !1599)
!1981 = !DILocation(line: 1086, column: 13, scope: !1596)
!1982 = !DILocalVariable(name: "runProgramRequest", scope: !1596, file: !1318, line: 1087, type: !1178)
!1983 = !DILocation(line: 1087, column: 29, scope: !1596)
!1984 = !DILocalVariable(name: "commandLine", scope: !1596, file: !1318, line: 1088, type: !1259)
!1985 = !DILocation(line: 1088, column: 16, scope: !1596)
!1986 = !DILocalVariable(name: "commandLineArgs", scope: !1596, file: !1318, line: 1089, type: !1259)
!1987 = !DILocation(line: 1089, column: 16, scope: !1596)
!1988 = !DILocalVariable(name: "impersonatingVMWareUser", scope: !1596, file: !1318, line: 1090, type: !1230)
!1989 = !DILocation(line: 1090, column: 9, scope: !1596)
!1990 = !DILocalVariable(name: "userToken", scope: !1596, file: !1318, line: 1091, type: !1177)
!1991 = !DILocation(line: 1091, column: 10, scope: !1596)
!1992 = !DILocalVariable(name: "pid", scope: !1596, file: !1318, line: 1092, type: !1239)
!1993 = !DILocation(line: 1092, column: 10, scope: !1596)
!1994 = !DILocalVariable(name: "parser", scope: !1596, file: !1318, line: 1094, type: !1995)
!1995 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMAutomationRequestParser", file: !372, line: 2582, baseType: !1996)
!1996 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMAutomationMsgParser", file: !372, line: 2579, baseType: !1997)
!1997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 2576, size: 128, align: 64, elements: !1998)
!1998 = !{!1999, !2000}
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "currentPtr", scope: !1997, file: !372, line: 2577, baseType: !1259, size: 64, align: 64)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "endPtr", scope: !1997, file: !372, line: 2578, baseType: !1259, size: 64, align: 64, offset: 64)
!2001 = !DILocation(line: 1094, column: 30, scope: !1596)
!2002 = !DILocation(line: 1096, column: 74, scope: !1596)
!2003 = !DILocation(line: 1096, column: 10, scope: !1596)
!2004 = !DILocation(line: 1096, column: 8, scope: !1596)
!2005 = !DILocation(line: 1098, column: 18, scope: !2006)
!2006 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1098, column: 8)
!2007 = !DILocation(line: 1098, column: 15, scope: !2006)
!2008 = !DILocation(line: 1098, column: 8, scope: !1596)
!2009 = !DILocation(line: 1099, column: 7, scope: !2010)
!2010 = distinct !DILexicalBlock(scope: !2006, file: !1318, line: 1098, column: 23)
!2011 = !DILocation(line: 1102, column: 52, scope: !1596)
!2012 = !DILocation(line: 1102, column: 24, scope: !1596)
!2013 = !DILocation(line: 1102, column: 22, scope: !1596)
!2014 = !DILocation(line: 1104, column: 72, scope: !1596)
!2015 = !DILocation(line: 1104, column: 91, scope: !1596)
!2016 = !DILocation(line: 1104, column: 10, scope: !1596)
!2017 = !DILocation(line: 1104, column: 8, scope: !1596)
!2018 = !DILocation(line: 1107, column: 18, scope: !2019)
!2019 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1107, column: 8)
!2020 = !DILocation(line: 1107, column: 15, scope: !2019)
!2021 = !DILocation(line: 1107, column: 8, scope: !1596)
!2022 = !DILocation(line: 1108, column: 7, scope: !2023)
!2023 = distinct !DILexicalBlock(scope: !2019, file: !1318, line: 1107, column: 23)
!2024 = !DILocation(line: 1111, column: 14, scope: !2025)
!2025 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1111, column: 8)
!2026 = !DILocation(line: 1111, column: 13, scope: !2025)
!2027 = !DILocation(line: 1111, column: 10, scope: !2025)
!2028 = !DILocation(line: 1111, column: 8, scope: !1596)
!2029 = !DILocation(line: 1112, column: 11, scope: !2030)
!2030 = distinct !DILexicalBlock(scope: !2025, file: !1318, line: 1111, column: 27)
!2031 = !DILocation(line: 1113, column: 7, scope: !2030)
!2032 = !DILocation(line: 1115, column: 8, scope: !2033)
!2033 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1115, column: 8)
!2034 = !DILocation(line: 1115, column: 27, scope: !2033)
!2035 = !DILocation(line: 1115, column: 49, scope: !2033)
!2036 = !DILocation(line: 1115, column: 8, scope: !1596)
!2037 = !DILocation(line: 1116, column: 75, scope: !2038)
!2038 = distinct !DILexicalBlock(scope: !2033, file: !1318, line: 1115, column: 54)
!2039 = !DILocation(line: 1116, column: 94, scope: !2038)
!2040 = !DILocation(line: 1116, column: 13, scope: !2038)
!2041 = !DILocation(line: 1116, column: 11, scope: !2038)
!2042 = !DILocation(line: 1119, column: 21, scope: !2043)
!2043 = distinct !DILexicalBlock(scope: !2038, file: !1318, line: 1119, column: 11)
!2044 = !DILocation(line: 1119, column: 18, scope: !2043)
!2045 = !DILocation(line: 1119, column: 11, scope: !2038)
!2046 = !DILocation(line: 1120, column: 10, scope: !2047)
!2047 = distinct !DILexicalBlock(scope: !2043, file: !1318, line: 1119, column: 26)
!2048 = !DILocation(line: 1122, column: 4, scope: !2038)
!2049 = !DILocation(line: 1134, column: 15, scope: !2050)
!2050 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1134, column: 7)
!2051 = !DILocation(line: 1134, column: 12, scope: !2050)
!2052 = !DILocation(line: 1134, column: 7, scope: !1596)
!2053 = !DILocation(line: 1135, column: 37, scope: !2054)
!2054 = distinct !DILexicalBlock(scope: !2050, file: !1318, line: 1134, column: 26)
!2055 = !DILocation(line: 1135, column: 13, scope: !2054)
!2056 = !DILocation(line: 1135, column: 11, scope: !2054)
!2057 = !DILocation(line: 1136, column: 21, scope: !2058)
!2058 = distinct !DILexicalBlock(scope: !2054, file: !1318, line: 1136, column: 11)
!2059 = !DILocation(line: 1136, column: 18, scope: !2058)
!2060 = !DILocation(line: 1136, column: 11, scope: !2054)
!2061 = !DILocation(line: 1137, column: 10, scope: !2062)
!2062 = distinct !DILexicalBlock(scope: !2058, file: !1318, line: 1136, column: 26)
!2063 = !DILocation(line: 1139, column: 31, scope: !2054)
!2064 = !DILocation(line: 1140, column: 4, scope: !2054)
!2065 = !DILocation(line: 1142, column: 33, scope: !1596)
!2066 = !DILocation(line: 1143, column: 33, scope: !1596)
!2067 = !DILocation(line: 1144, column: 33, scope: !1596)
!2068 = !DILocation(line: 1145, column: 33, scope: !1596)
!2069 = !DILocation(line: 1145, column: 52, scope: !1596)
!2070 = !DILocation(line: 1146, column: 33, scope: !1596)
!2071 = !DILocation(line: 1147, column: 33, scope: !1596)
!2072 = !DILocation(line: 1142, column: 10, scope: !1596)
!2073 = !DILocation(line: 1142, column: 8, scope: !1596)
!2074 = !DILocation(line: 1142, column: 4, scope: !1596)
!2075 = !DILocation(line: 1151, column: 8, scope: !2076)
!2076 = distinct !DILexicalBlock(scope: !1596, file: !1318, line: 1151, column: 8)
!2077 = !DILocation(line: 1151, column: 8, scope: !1596)
!2078 = !DILocation(line: 1152, column: 33, scope: !2079)
!2079 = distinct !DILexicalBlock(scope: !2076, file: !1318, line: 1151, column: 33)
!2080 = !DILocation(line: 1152, column: 7, scope: !2079)
!2081 = !DILocation(line: 1153, column: 4, scope: !2079)
!2082 = !DILocation(line: 1154, column: 23, scope: !1596)
!2083 = !DILocation(line: 1154, column: 4, scope: !1596)
!2084 = !DILocation(line: 1156, column: 63, scope: !1596)
!2085 = !DILocation(line: 1156, column: 4, scope: !1596)
!2086 = !DILocation(line: 1157, column: 5, scope: !1596)
!2087 = !DILocation(line: 1157, column: 12, scope: !1596)
!2088 = !DILocation(line: 1159, column: 90, scope: !1596)
!2089 = !DILocation(line: 1159, column: 102, scope: !1596)
!2090 = !DILocation(line: 1159, column: 110, scope: !1596)
!2091 = !DILocation(line: 1159, column: 4, scope: !1596)
!2092 = !DILocation(line: 1162, column: 11, scope: !1596)
!2093 = !DILocation(line: 1162, column: 4, scope: !1596)
!2094 = distinct !DISubprogram(name: "VixToolsImpersonateUser", scope: !1318, file: !1318, line: 7554, type: !2095, isLocal: false, isDefinition: true, scopeLine: 7556, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1600)
!2095 = !DISubroutineType(types: !2096)
!2096 = !{!1599, !1509, !1478}
!2097 = !DILocalVariable(name: "requestMsg", arg: 1, scope: !2094, file: !1318, line: 7554, type: !1509)
!2098 = !DILocation(line: 7554, column: 50, scope: !2094)
!2099 = !DILocalVariable(name: "userToken", arg: 2, scope: !2094, file: !1318, line: 7555, type: !1478)
!2100 = !DILocation(line: 7555, column: 32, scope: !2094)
!2101 = !DILocalVariable(name: "err", scope: !2094, file: !1318, line: 7557, type: !1599)
!2102 = !DILocation(line: 7557, column: 13, scope: !2094)
!2103 = !DILocalVariable(name: "credentialField", scope: !2094, file: !1318, line: 7558, type: !1238)
!2104 = !DILocation(line: 7558, column: 10, scope: !2094)
!2105 = !DILocalVariable(name: "credentialType", scope: !2094, file: !1318, line: 7559, type: !1221)
!2106 = !DILocation(line: 7559, column: 8, scope: !2094)
!2107 = !DILocation(line: 7561, column: 32, scope: !2094)
!2108 = !DILocation(line: 7561, column: 23, scope: !2094)
!2109 = !DILocation(line: 7562, column: 30, scope: !2094)
!2110 = !DILocation(line: 7562, column: 42, scope: !2094)
!2111 = !DILocation(line: 7562, column: 55, scope: !2094)
!2112 = !DILocation(line: 7562, column: 28, scope: !2094)
!2113 = !DILocation(line: 7563, column: 30, scope: !2094)
!2114 = !DILocation(line: 7563, column: 42, scope: !2094)
!2115 = !DILocation(line: 7563, column: 55, scope: !2094)
!2116 = !DILocation(line: 7563, column: 28, scope: !2094)
!2117 = !DILocation(line: 7561, column: 20, scope: !2094)
!2118 = !DILocation(line: 7565, column: 21, scope: !2094)
!2119 = !DILocation(line: 7565, column: 33, scope: !2094)
!2120 = !DILocation(line: 7565, column: 19, scope: !2094)
!2121 = !DILocation(line: 7567, column: 12, scope: !2094)
!2122 = !DILocation(line: 7567, column: 4, scope: !2094)
!2123 = !DILocalVariable(name: "commandTicketedSession", scope: !2124, file: !1318, line: 7570, type: !1274)
!2124 = distinct !DILexicalBlock(scope: !2125, file: !1318, line: 7569, column: 4)
!2125 = distinct !DILexicalBlock(scope: !2094, file: !1318, line: 7567, column: 28)
