; ModuleID = './vmtoolsd-toolsRpc.o.i'
source_filename = "./vmtoolsd-toolsRpc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.RpcChannelCallback = type { i8*, i32 (%struct.RpcInData*)*, i8*, i8*, i8*, i64 }
%struct.RpcInData = type { i8*, i8*, i64, i8*, i64, i32, i8*, i8* }
%struct.ToolsServiceState = type { i8*, i8*, i64, i32, i32, i32, i8*, i8*, %struct._GPtrArray*, i8*, %struct._GModule*, i8*, %struct.RpcDebugLibData*, %struct.ToolsAppCtx, %struct._GArray*, i32, i32 }
%struct._GPtrArray = type { i8**, i32 }
%struct._GModule = type opaque
%struct.RpcDebugLibData = type { %struct._RpcChannel* (%struct.ToolsAppCtx*, %struct.RpcDebugLibData*)*, i32 (%struct.ToolsAppCtx*, i8*, i8*, %struct.RpcDebugLibData*)*, %struct.RpcDebugPlugin* }
%struct._RpcChannel = type opaque
%struct.RpcDebugPlugin = type { %struct.RpcDebugRecvMapping*, i32 (i8*, i64, i8**, i64*)*, i32 (%struct.RpcDebugMsgMapping*)*, void (%struct.ToolsAppCtx*, %struct.RpcDebugPlugin*)*, %struct.ToolsPluginData* }
%struct.RpcDebugRecvMapping = type { i8*, i32 (i8*, i64, i8**, i64*)*, i8*, i64 }
%struct.RpcDebugMsgMapping = type { i8*, i64, i32 (%struct.RpcInData*, i32)*, i32 }
%struct.ToolsPluginData = type { i8*, %struct._GArray*, i32 (%struct.ToolsAppCtx*, i32, i8*, %struct.ToolsPluginData*)*, i8* }
%struct.ToolsAppCtx = type { i32, i8*, i32, i32, %struct._GMainLoop*, %struct._RpcChannel*, %struct._GKeyFile*, i32, i32, i8**, i8* }

!11 = !DIEnumerator(name: "TOOLS_APP_PROVIDER", value: 3)
!12 = !DIEnumerator(name: "TOOLS_SVC_PROPERTY", value: 4)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 51, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24}
!16 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!17 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!18 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!19 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!20 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!21 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!22 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!23 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!24 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 303, size: 32, align: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "TOOLS_CAP_OLD", value: 0)
!28 = !DIEnumerator(name: "TOOLS_CAP_OLD_NOVAL", value: 1)
!29 = !DIEnumerator(name: "TOOLS_CAP_NEW", value: 2)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 44, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/guestrpc/capabilities.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!33 = !DIEnumerator(name: "UNITY_CAP_START_MENU", value: 0)
!34 = !DIEnumerator(name: "UNITY_CAP_VIRTUAL_DESK", value: 1)
!35 = !DIEnumerator(name: "UNITY_CAP_WORK_AREA", value: 2)
!36 = !DIEnumerator(name: "UNITY_CAP_MULTI_MON", value: 3)
!37 = !DIEnumerator(name: "GHI_CAP_SHELL_ACTION_BROWSE", value: 4)
!38 = !DIEnumerator(name: "GHI_CAP_SHELL_LOCATION_HGFS", value: 5)
!39 = !DIEnumerator(name: "GHI_CAP_SHELL_ACTION_RUN", value: 6)
!40 = !DIEnumerator(name: "GHI_CAP_CMD_SHELL_ACTION", value: 7)
!41 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DESKTOP", value: 8)
!42 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DOCUMENTS", value: 9)
!43 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_MUSIC", value: 10)
!44 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_PICTURES", value: 11)
!45 = !DIEnumerator(name: "HGFSU_CAP_DESKTOP_SHORTCUT", value: 12)
!46 = !DIEnumerator(name: "HGFSU_CAP_MAP_DRIVE", value: 13)
!47 = !DIEnumerator(name: "GHI_CAP_SET_HANDLER", value: 14)
!48 = !DIEnumerator(name: "UNITY_CAP_STATUS_UNITY_ACTIVE", value: 15)
!49 = !DIEnumerator(name: "GHI_CAP_SET_OUTLOOK_TEMP_FOLDER", value: 16)
!50 = !DIEnumerator(name: "CAP_SET_TOPO_MODES", value: 18)
!51 = !DIEnumerator(name: "GHI_CAP_TRAY_ICONS", value: 19)
!52 = !DIEnumerator(name: "GHI_CAP_SET_FOCUSED_WINDOW", value: 20)
!53 = !DIEnumerator(name: "GHI_CAP_GET_EXEC_INFO_HASH", value: 21)
!54 = !DIEnumerator(name: "UNITY_CAP_STICKY_WINDOWS", value: 22)
!55 = !DIEnumerator(name: "CAP_CHANGE_HOST_3D_AVAILABILITY_HINT", value: 23)
!56 = !DIEnumerator(name: "CAP_AUTOUPGRADE_AT_SHUTDOWN", value: 24)
!57 = !DIEnumerator(name: "GHI_CAP_AUTOLOGON", value: 25)
!58 = !DIEnumerator(name: "CAP_DESKTOP_AUTOLOCK", value: 26)
!59 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_DOWNLOADS", value: 28)
!60 = !DIEnumerator(name: "HGFSU_CAP_MIRROR_MOVIES", value: 29)
!61 = !DIEnumerator(name: "GHI_CAP_TOGGLE_START_UI", value: 30)
!62 = !DIEnumerator(name: "GHI_CAP_SET_DISPLAY_SCALING", value: 31)
!63 = !DIEnumerator(name: "UNITY_CAP_DISABLE_MOUSE_BUTTON_SWAPPING", value: 32)
!64 = !DIEnumerator(name: "UNITY_CAP_CARET_POSITION", value: 33)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 77, size: 32, align: 32, elements: !67)
!66 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_tools_version.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!67 = !{!68, !69, !70, !71, !72, !73, !74}
!68 = !DIEnumerator(name: "TOOLS_TYPE_UNSET", value: -1)
!69 = !DIEnumerator(name: "TOOLS_TYPE_UNKNOWN", value: 0)
!70 = !DIEnumerator(name: "TOOLS_TYPE_MSI", value: 1)
!71 = !DIEnumerator(name: "TOOLS_TYPE_TARBALL", value: 2)
!72 = !DIEnumerator(name: "TOOLS_TYPE_OSP", value: 3)
!73 = !DIEnumerator(name: "TOOLS_TYPE_OVT", value: 4)
!74 = !DIEnumerator(name: "TOOLS_TYPE_MAX", value: 5)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !76, line: 24, size: 32, align: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!79 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!80 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!81 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!82 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!83 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!84 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!85 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!86 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!87 = !{!88, !89}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCapability", file: !4, line: 333, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCapability", file: !4, line: 318, size: 192, align: 64, elements: !92)
!92 = !{!93, !95, !101, !103}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !4, line: 320, baseType: !94, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCapabilityType", file: !4, line: 307, baseType: !25)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !4, line: 325, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !99, line: 46, baseType: !100)
!99 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!100 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !91, file: !4, line: 330, baseType: !102, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "GuestCapabilities", file: !31, line: 79, baseType: !30)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !91, file: !4, line: 332, baseType: !104, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !99, line: 55, baseType: !105)
!105 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!106 = !{!107, !298}
!107 = distinct !DIGlobalVariable(name: "rpcs", scope: !108, file: !109, line: 285, type: !282, isLocal: true, isDefinition: true, variable: [2 x %struct.RpcChannelCallback]* @ToolsCore_InitRpc.rpcs)
!108 = distinct !DISubprogram(name: "ToolsCore_InitRpc", scope: !109, file: !109, line: 283, type: !110, isLocal: false, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
!109 = !DIFile(filename: "toolsRpc.c", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !115}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !99, line: 50, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !99, line: 49, baseType: !114)
!114 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsServiceState", file: !117, line: 100, baseType: !118)
!117 = !DIFile(filename: "toolsCoreInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsServiceState", file: !117, line: 69, size: 1472, align: 64, elements: !119)
!119 = !{!120, !122, !123, !129, !130, !131, !132, !133, !134, !144, !145, !150, !151, !277, !278, !279, !280}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !117, line: 70, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "configFile", scope: !118, file: !117, line: 71, baseType: !121, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "configMtime", scope: !118, file: !117, line: 72, baseType: !124, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !125, line: 75, baseType: !126)
!125 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 139, baseType: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!128 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "configCheckTask", scope: !118, file: !117, line: 73, baseType: !104, size: 32, align: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mainService", scope: !118, file: !117, line: 74, baseType: !112, size: 32, align: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "capsRegistered", scope: !118, file: !117, line: 75, baseType: !112, size: 32, align: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "commonPath", scope: !118, file: !117, line: 76, baseType: !121, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pluginPath", scope: !118, file: !117, line: 77, baseType: !121, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "plugins", scope: !118, file: !117, line: 78, baseType: !135, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !137, line: 39, baseType: !138)
!137 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !137, line: 53, size: 128, align: 64, elements: !139)
!139 = !{!140, !143}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !138, file: !137, line: 55, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !99, line: 77, baseType: !88)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !137, line: 56, baseType: !104, size: 32, align: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pidFile", scope: !118, file: !117, line: 82, baseType: !121, size: 64, align: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "debugLib", scope: !118, file: !117, line: 84, baseType: !146, size: 64, align: 64, offset: 576)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GModule", file: !148, line: 49, baseType: !149)
!148 = !DIFile(filename: "/usr/include/glib-2.0/gmodule.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GModule", file: !148, line: 49, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !118, file: !117, line: 85, baseType: !121, size: 64, align: 64, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "debugData", scope: !118, file: !117, line: 86, baseType: !152, size: 64, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugLibData", file: !154, line: 150, baseType: !155)
!154 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/rpcdebug.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugLibData", file: !154, line: 142, size: 192, align: 64, elements: !156)
!156 = !{!157, !193, !197}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "newDebugChannel", scope: !155, file: !154, line: 143, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !165, !192}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannel", file: !163, line: 48, baseType: !164)
!163 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vmware/tools/guestrpc.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RpcChannel", file: !163, line: 48, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppCtx", file: !4, line: 274, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsAppCtx", file: !4, line: 241, size: 576, align: 64, elements: !168)
!168 = !{!169, !171, !172, !173, !174, !179, !180, !185, !186, !187, !191}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !167, file: !4, line: 243, baseType: !170, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsCoreAPI", file: !4, line: 234, baseType: !3)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !4, line: 245, baseType: !96, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "isVMware", scope: !167, file: !4, line: 247, baseType: !112, size: 32, align: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "errorCode", scope: !167, file: !4, line: 249, baseType: !114, size: 32, align: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mainLoop", scope: !167, file: !4, line: 251, baseType: !175, size: 64, align: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !177, line: 56, baseType: !178)
!177 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !177, line: 56, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rpc", scope: !167, file: !4, line: 253, baseType: !161, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !167, file: !4, line: 255, baseType: !181, size: 64, align: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GKeyFile", file: !183, line: 48, baseType: !184)
!183 = !DIFile(filename: "/usr/include/glib-2.0/glib/gkeyfile.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GKeyFile", file: !183, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "blockFD", scope: !167, file: !4, line: 261, baseType: !114, size: 32, align: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "uinputFD", scope: !167, file: !4, line: 263, baseType: !114, size: 32, align: 32, offset: 416)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !167, file: !4, line: 265, baseType: !188, size: 64, align: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "serviceObj", scope: !167, file: !4, line: 273, baseType: !142, size: 64, align: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !155, file: !154, line: 145, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!114, !165, !142, !142, !192}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "debugPlugin", scope: !155, file: !154, line: 149, baseType: !198, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugPlugin", file: !154, line: 126, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugPlugin", file: !154, line: 112, size: 320, align: 64, elements: !201)
!201 = !{!202, !221, !222, !251, !257}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "recvFns", scope: !200, file: !154, line: 114, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvMapping", file: !154, line: 69, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugRecvMapping", file: !154, line: 59, size: 256, align: 64, elements: !206)
!206 = !{!207, !208, !219, !220}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !154, line: 60, baseType: !121, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recvFn", scope: !205, file: !154, line: 61, baseType: !209, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugRecvFn", file: !154, line: 53, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!112, !213, !214, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !215, line: 216, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!216 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "xdrProc", scope: !205, file: !154, line: 66, baseType: !142, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "xdrSize", scope: !205, file: !154, line: 68, baseType: !214, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dfltRecvFn", scope: !200, file: !154, line: 119, baseType: !209, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sendFn", scope: !200, file: !154, line: 121, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugSendFn", file: !154, line: 102, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!112, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugMsgMapping", file: !154, line: 86, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcDebugMsgMapping", file: !154, line: 81, size: 256, align: 64, elements: !230)
!230 = !{!231, !232, !233, !250}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !229, file: !154, line: 82, baseType: !121, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "messageLen", scope: !229, file: !154, line: 83, baseType: !214, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "validateFn", scope: !229, file: !154, line: 84, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugValidateFn", file: !154, line: 77, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!112, !238, !112}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcInData", file: !163, line: 77, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcInData", file: !163, line: 51, size: 512, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !163, line: 53, baseType: !189, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !240, file: !163, line: 58, baseType: !189, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "argsSize", scope: !240, file: !163, line: 60, baseType: !214, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !240, file: !163, line: 65, baseType: !213, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "resultLen", scope: !240, file: !163, line: 67, baseType: !214, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "freeResult", scope: !240, file: !163, line: 72, baseType: !112, size: 32, align: 32, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "appCtx", scope: !240, file: !163, line: 74, baseType: !88, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !240, file: !163, line: 76, baseType: !88, size: 64, align: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "freeMsg", scope: !229, file: !154, line: 85, baseType: !112, size: 32, align: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "shutdownFn", scope: !200, file: !154, line: 123, baseType: !252, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcDebugShutdownFn", file: !154, line: 105, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !165, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "plugin", scope: !200, file: !154, line: 125, baseType: !258, size: 64, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsPluginData", file: !4, line: 545, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolsPluginData", file: !4, line: 501, size: 256, align: 64, elements: !261)
!261 = !{!262, !263, !270, !276}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !4, line: 503, baseType: !189, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !260, file: !4, line: 508, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !137, line: 37, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !137, line: 41, size: 128, align: 64, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !266, file: !137, line: 43, baseType: !121, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !266, file: !137, line: 44, baseType: !104, size: 32, align: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "errorCb", scope: !260, file: !4, line: 539, baseType: !271, size: 64, align: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!112, !165, !274, !142, !275}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolsAppType", file: !4, line: 360, baseType: !7)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !260, file: !4, line: 544, baseType: !142, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !118, file: !117, line: 87, baseType: !166, size: 576, align: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "providers", scope: !118, file: !117, line: 88, baseType: !264, size: 64, align: 64, offset: 1344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vsockDev", scope: !118, file: !117, line: 97, baseType: !114, size: 32, align: 32, offset: 1408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vsockFamily", scope: !118, file: !117, line: 98, baseType: !114, size: 32, align: 32, offset: 1440)
!281 = !{}
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 768, align: 64, elements: !296)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcChannelCallback", file: !163, line: 115, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RpcChannelCallback", file: !163, line: 94, size: 384, align: 64, elements: !285)
!285 = !{!286, !287, !292, !293, !294, !295}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !163, line: 96, baseType: !189, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !284, file: !163, line: 98, baseType: !288, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "RpcIn_Callback", file: !163, line: 90, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!112, !238}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "clientData", scope: !284, file: !163, line: 100, baseType: !142, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "xdrIn", scope: !284, file: !163, line: 102, baseType: !142, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xdrOut", scope: !284, file: !163, line: 109, baseType: !142, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "xdrInSize", scope: !284, file: !163, line: 114, baseType: !214, size: 64, align: 64, offset: 320)
!296 = !{!297}
!297 = !DISubrange(count: 2)
!298 = distinct !DIGlobalVariable(name: "version_sent", scope: !299, file: !109, line: 61, type: !112, isLocal: true, isDefinition: true, variable: i32* @ToolsCoreCheckReset.version_sent)
!299 = distinct !DISubprogram(name: "ToolsCoreCheckReset", scope: !109, file: !109, line: 56, type: !300, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !161, !112, !142}
!302 = !{i32 2, !"Dwarf Version", i32 4}
!303 = !{i32 2, !"Debug Info Version", i32 3}
!304 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!305 = !DILocalVariable(name: "state", arg: 1, scope: !108, file: !109, line: 283, type: !115)
!306 = !DIExpression()
!307 = !DILocation(line: 283, column: 38, scope: !108)
!308 = !DILocalVariable(name: "i", scope: !108, file: !109, line: 290, type: !214)
!309 = !DILocation(line: 290, column: 11, scope: !108)
!310 = !DILocalVariable(name: "app", scope: !108, file: !109, line: 291, type: !96)
!311 = !DILocation(line: 291, column: 17, scope: !108)
!312 = !DILocalVariable(name: "mainCtx", scope: !108, file: !109, line: 292, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !177, line: 48, baseType: !315)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !177, line: 48, flags: DIFlagFwdDecl)
!316 = !DILocation(line: 292, column: 18, scope: !108)
!317 = !DILocation(line: 292, column: 52, scope: !108)
!318 = !DILocation(line: 292, column: 59, scope: !108)
!319 = !DILocation(line: 292, column: 63, scope: !108)
!320 = !DILocation(line: 292, column: 28, scope: !108)
!321 = !DILocation(line: 296, column: 8, scope: !322)
!322 = distinct !DILexicalBlock(scope: !108, file: !109, line: 296, column: 8)
!323 = !DILocation(line: 296, column: 15, scope: !322)
!324 = !DILocation(line: 296, column: 27, scope: !322)
!325 = !DILocation(line: 296, column: 8, scope: !108)
!326 = !DILocation(line: 297, column: 11, scope: !327)
!327 = distinct !DILexicalBlock(scope: !322, file: !109, line: 296, column: 35)
!328 = !DILocation(line: 298, column: 24, scope: !327)
!329 = !DILocation(line: 298, column: 31, scope: !327)
!330 = !DILocation(line: 298, column: 42, scope: !327)
!331 = !DILocation(line: 298, column: 59, scope: !327)
!332 = !DILocation(line: 298, column: 66, scope: !327)
!333 = !DILocation(line: 299, column: 58, scope: !327)
!334 = !DILocation(line: 299, column: 65, scope: !327)
!335 = !DILocation(line: 298, column: 7, scope: !327)
!336 = !DILocation(line: 298, column: 14, scope: !327)
!337 = !DILocation(line: 298, column: 18, scope: !327)
!338 = !DILocation(line: 298, column: 22, scope: !327)
!339 = !DILocation(line: 300, column: 4, scope: !327)
!340 = !DILocation(line: 310, column: 12, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !109, line: 310, column: 11)
!342 = distinct !DILexicalBlock(scope: !322, file: !109, line: 300, column: 11)
!343 = !DILocation(line: 310, column: 19, scope: !341)
!344 = !DILocation(line: 310, column: 23, scope: !341)
!345 = !DILocation(line: 310, column: 11, scope: !342)
!346 = !DILocation(line: 311, column: 106, scope: !347)
!347 = distinct !DILexicalBlock(scope: !341, file: !109, line: 310, column: 33)
!348 = !DILocation(line: 311, column: 113, scope: !347)
!349 = !DILocation(line: 311, column: 10, scope: !347)
!350 = !DILocation(line: 313, column: 10, scope: !347)
!351 = !DILocation(line: 313, column: 17, scope: !347)
!352 = !DILocation(line: 313, column: 21, scope: !347)
!353 = !DILocation(line: 313, column: 25, scope: !347)
!354 = !DILocation(line: 314, column: 7, scope: !347)
!355 = !DILocation(line: 315, column: 27, scope: !356)
!356 = distinct !DILexicalBlock(scope: !341, file: !109, line: 314, column: 14)
!357 = !DILocation(line: 315, column: 10, scope: !356)
!358 = !DILocation(line: 315, column: 17, scope: !356)
!359 = !DILocation(line: 315, column: 21, scope: !356)
!360 = !DILocation(line: 315, column: 25, scope: !356)
!361 = !DILocation(line: 317, column: 35, scope: !342)
!362 = !DILocation(line: 317, column: 13, scope: !342)
!363 = !DILocation(line: 317, column: 11, scope: !342)
!364 = !DILocation(line: 318, column: 11, scope: !365)
!365 = distinct !DILexicalBlock(scope: !342, file: !109, line: 318, column: 11)
!366 = !DILocation(line: 318, column: 15, scope: !365)
!367 = !DILocation(line: 318, column: 11, scope: !342)
!368 = !DILocation(line: 319, column: 107, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !109, line: 318, column: 23)
!370 = !DILocation(line: 319, column: 114, scope: !369)
!371 = !DILocation(line: 319, column: 10, scope: !369)
!372 = !DILocation(line: 320, column: 10, scope: !369)
!373 = !DILocation(line: 324, column: 8, scope: !374)
!374 = distinct !DILexicalBlock(scope: !108, file: !109, line: 324, column: 8)
!375 = !DILocation(line: 324, column: 15, scope: !374)
!376 = !DILocation(line: 324, column: 19, scope: !374)
!377 = !DILocation(line: 324, column: 8, scope: !108)
!378 = !DILocation(line: 325, column: 24, scope: !379)
!379 = distinct !DILexicalBlock(scope: !374, file: !109, line: 324, column: 24)
!380 = !DILocation(line: 325, column: 31, scope: !379)
!381 = !DILocation(line: 325, column: 35, scope: !379)
!382 = !DILocation(line: 326, column: 24, scope: !379)
!383 = !DILocation(line: 327, column: 24, scope: !379)
!384 = !DILocation(line: 328, column: 25, scope: !379)
!385 = !DILocation(line: 328, column: 32, scope: !379)
!386 = !DILocation(line: 328, column: 24, scope: !379)
!387 = !DILocation(line: 330, column: 24, scope: !379)
!388 = !DILocation(line: 325, column: 7, scope: !379)
!389 = !DILocation(line: 333, column: 14, scope: !390)
!390 = distinct !DILexicalBlock(scope: !379, file: !109, line: 333, column: 7)
!391 = !DILocation(line: 333, column: 12, scope: !390)
!392 = !DILocation(line: 333, column: 19, scope: !393)
!393 = !DILexicalBlockFile(scope: !394, file: !109, discriminator: 1)
!394 = distinct !DILexicalBlock(scope: !390, file: !109, line: 333, column: 7)
!395 = !DILocation(line: 333, column: 21, scope: !393)
!396 = !DILocation(line: 333, column: 7, scope: !393)
!397 = !DILocalVariable(name: "rpc", scope: !398, file: !109, line: 334, type: !399)
!398 = distinct !DILexicalBlock(scope: !394, file: !109, line: 333, column: 62)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!400 = !DILocation(line: 334, column: 30, scope: !398)
!401 = !DILocation(line: 334, column: 42, scope: !398)
!402 = !DILocation(line: 334, column: 37, scope: !398)
!403 = !DILocation(line: 335, column: 28, scope: !398)
!404 = !DILocation(line: 335, column: 10, scope: !398)
!405 = !DILocation(line: 335, column: 15, scope: !398)
!406 = !DILocation(line: 335, column: 26, scope: !398)
!407 = !DILocation(line: 336, column: 38, scope: !398)
!408 = !DILocation(line: 336, column: 45, scope: !398)
!409 = !DILocation(line: 336, column: 49, scope: !398)
!410 = !DILocation(line: 336, column: 54, scope: !398)
!411 = !DILocation(line: 336, column: 10, scope: !398)
!412 = !DILocation(line: 337, column: 7, scope: !398)
!413 = !DILocation(line: 333, column: 58, scope: !414)
!414 = !DILexicalBlockFile(scope: !394, file: !109, discriminator: 2)
!415 = !DILocation(line: 333, column: 7, scope: !414)
!416 = distinct !{!416, !417}
!417 = !DILocation(line: 333, column: 7, scope: !379)
!418 = !DILocation(line: 338, column: 4, scope: !379)
!419 = !DILocation(line: 340, column: 4, scope: !108)
!420 = !DILocation(line: 341, column: 1, scope: !108)
!421 = distinct !DISubprogram(name: "ToolsCoreRpcCapReg", scope: !109, file: !109, line: 124, type: !290, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
!422 = !DILocalVariable(name: "data", arg: 1, scope: !421, file: !109, line: 124, type: !238)
!423 = !DILocation(line: 124, column: 31, scope: !421)
!424 = !DILocalVariable(name: "confPath", scope: !421, file: !109, line: 126, type: !213)
!425 = !DILocation(line: 126, column: 10, scope: !421)
!426 = !DILocation(line: 126, column: 21, scope: !421)
!427 = !DILocalVariable(name: "msg", scope: !421, file: !109, line: 127, type: !121)
!428 = !DILocation(line: 127, column: 11, scope: !421)
!429 = !DILocalVariable(name: "pcaps", scope: !421, file: !109, line: 128, type: !264)
!430 = !DILocation(line: 128, column: 12, scope: !421)
!431 = !DILocalVariable(name: "state", scope: !421, file: !109, line: 129, type: !115)
!432 = !DILocation(line: 129, column: 23, scope: !421)
!433 = !DILocation(line: 129, column: 31, scope: !421)
!434 = !DILocation(line: 129, column: 37, scope: !421)
!435 = !DILocation(line: 131, column: 26, scope: !421)
!436 = !DILocation(line: 131, column: 33, scope: !421)
!437 = !DILocation(line: 131, column: 37, scope: !421)
!438 = !DILocation(line: 133, column: 27, scope: !421)
!439 = !DILocation(line: 133, column: 34, scope: !421)
!440 = !DILocation(line: 131, column: 4, scope: !421)
!441 = !DILocation(line: 137, column: 8, scope: !442)
!442 = distinct !DILexicalBlock(scope: !421, file: !109, line: 137, column: 8)
!443 = !DILocation(line: 137, column: 14, scope: !442)
!444 = !DILocation(line: 137, column: 8, scope: !421)
!445 = !DILocation(line: 138, column: 33, scope: !446)
!446 = distinct !DILexicalBlock(scope: !442, file: !109, line: 137, column: 22)
!447 = !DILocation(line: 138, column: 40, scope: !446)
!448 = !DILocation(line: 138, column: 44, scope: !446)
!449 = !DILocation(line: 138, column: 49, scope: !446)
!450 = !DILocation(line: 138, column: 7, scope: !446)
!451 = !DILocation(line: 139, column: 20, scope: !446)
!452 = !DILocation(line: 139, column: 7, scope: !446)
!453 = !DILocation(line: 140, column: 4, scope: !446)
!454 = !DILocation(line: 143, column: 70, scope: !421)
!455 = !DILocation(line: 143, column: 10, scope: !421)
!456 = !DILocation(line: 143, column: 8, scope: !421)
!457 = !DILocation(line: 144, column: 25, scope: !458)
!458 = distinct !DILexicalBlock(scope: !421, file: !109, line: 144, column: 8)
!459 = !DILocation(line: 144, column: 32, scope: !458)
!460 = !DILocation(line: 144, column: 36, scope: !458)
!461 = !DILocation(line: 144, column: 41, scope: !458)
!462 = !DILocation(line: 144, column: 53, scope: !458)
!463 = !DILocation(line: 144, column: 46, scope: !458)
!464 = !DILocation(line: 144, column: 58, scope: !458)
!465 = !DILocation(line: 144, column: 9, scope: !466)
!466 = !DILexicalBlockFile(scope: !458, file: !109, discriminator: 1)
!467 = !DILocation(line: 144, column: 9, scope: !458)
!468 = !DILocation(line: 144, column: 8, scope: !421)
!469 = !DILocation(line: 145, column: 7, scope: !470)
!470 = distinct !DILexicalBlock(scope: !458, file: !109, line: 144, column: 75)
!471 = !DILocation(line: 146, column: 4, scope: !470)
!472 = !DILocation(line: 147, column: 11, scope: !421)
!473 = !DILocation(line: 147, column: 4, scope: !421)
!474 = !DILocation(line: 148, column: 8, scope: !421)
!475 = !DILocation(line: 151, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !421, file: !109, line: 151, column: 8)
!477 = !DILocation(line: 151, column: 15, scope: !476)
!478 = !DILocation(line: 151, column: 8, scope: !421)
!479 = !DILocalVariable(name: "version", scope: !480, file: !109, line: 152, type: !481)
!480 = distinct !DILexicalBlock(scope: !476, file: !109, line: 151, column: 28)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !482, line: 173, baseType: !483)
!482 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !484, line: 51, baseType: !105)
!484 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!485 = !DILocation(line: 152, column: 14, scope: !480)
!486 = !DILocalVariable(name: "type", scope: !480, file: !109, line: 153, type: !481)
!487 = !DILocation(line: 153, column: 14, scope: !480)
!488 = !DILocalVariable(name: "result", scope: !480, file: !109, line: 154, type: !213)
!489 = !DILocation(line: 154, column: 13, scope: !480)
!490 = !DILocalVariable(name: "resultLen", scope: !480, file: !109, line: 155, type: !214)
!491 = !DILocation(line: 155, column: 14, scope: !480)
!492 = !DILocalVariable(name: "toolsVersion", scope: !480, file: !109, line: 156, type: !121)
!493 = !DILocation(line: 156, column: 14, scope: !480)
!494 = !DILocalVariable(name: "hideVersion", scope: !480, file: !109, line: 157, type: !112)
!495 = !DILocation(line: 157, column: 16, scope: !480)
!496 = !DILocation(line: 157, column: 53, scope: !480)
!497 = !DILocation(line: 157, column: 60, scope: !480)
!498 = !DILocation(line: 157, column: 64, scope: !480)
!499 = !DILocation(line: 157, column: 30, scope: !480)
!500 = !DILocation(line: 166, column: 12, scope: !480)
!501 = !DILocation(line: 179, column: 17, scope: !480)
!502 = !DILocation(line: 179, column: 15, scope: !480)
!503 = !DILocation(line: 185, column: 69, scope: !480)
!504 = !DILocation(line: 185, column: 78, scope: !480)
!505 = !DILocation(line: 185, column: 22, scope: !480)
!506 = !DILocation(line: 185, column: 20, scope: !480)
!507 = !DILocation(line: 187, column: 28, scope: !508)
!508 = distinct !DILexicalBlock(scope: !480, file: !109, line: 187, column: 11)
!509 = !DILocation(line: 187, column: 35, scope: !508)
!510 = !DILocation(line: 187, column: 39, scope: !508)
!511 = !DILocation(line: 187, column: 44, scope: !508)
!512 = !DILocation(line: 187, column: 65, scope: !508)
!513 = !DILocation(line: 187, column: 58, scope: !508)
!514 = !DILocation(line: 187, column: 79, scope: !508)
!515 = !DILocation(line: 187, column: 12, scope: !516)
!516 = !DILexicalBlockFile(scope: !508, file: !109, discriminator: 1)
!517 = !DILocation(line: 187, column: 12, scope: !508)
!518 = !DILocation(line: 187, column: 11, scope: !480)
!519 = !DILocalVariable(name: "gerror", scope: !520, file: !109, line: 189, type: !521)
!520 = distinct !DILexicalBlock(scope: !508, file: !109, line: 188, column: 50)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !523, line: 42, baseType: !524)
!523 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !523, line: 44, size: 128, align: 64, elements: !525)
!525 = !{!526, !531, !532}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !524, file: !523, line: 46, baseType: !527, size: 32, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !528, line: 36, baseType: !529)
!528 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !530, line: 45, baseType: !105)
!530 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line1393")
!531 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !524, file: !523, line: 47, baseType: !113, size: 32, align: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !524, file: !523, line: 48, baseType: !121, size: 64, align: 64, offset: 64)
!533 = !DILocation(line: 189, column: 18, scope: !520)
!534 = !DILocalVariable(name: "disableVersion", scope: !520, file: !109, line: 190, type: !112)
!535 = !DILocation(line: 190, column: 19, scope: !520)
!536 = !DILocation(line: 191, column: 18, scope: !520)
!537 = !DILocation(line: 191, column: 10, scope: !520)
!538 = !DILocation(line: 192, column: 17, scope: !520)
!539 = !DILocation(line: 192, column: 10, scope: !520)
!540 = !DILocation(line: 198, column: 50, scope: !520)
!541 = !DILocation(line: 198, column: 57, scope: !520)
!542 = !DILocation(line: 198, column: 61, scope: !520)
!543 = !DILocation(line: 198, column: 27, scope: !520)
!544 = !DILocation(line: 198, column: 25, scope: !520)
!545 = !DILocation(line: 204, column: 14, scope: !546)
!546 = distinct !DILexicalBlock(scope: !520, file: !109, line: 204, column: 14)
!547 = !DILocation(line: 204, column: 19, scope: !546)
!548 = !DILocation(line: 204, column: 37, scope: !546)
!549 = !DILocation(line: 204, column: 40, scope: !550)
!550 = !DILexicalBlockFile(scope: !546, file: !109, discriminator: 1)
!551 = !DILocation(line: 204, column: 47, scope: !550)
!552 = !DILocation(line: 204, column: 14, scope: !550)
!553 = !DILocation(line: 205, column: 95, scope: !554)
!554 = distinct !DILexicalBlock(scope: !546, file: !109, line: 204, column: 55)
!555 = !DILocation(line: 205, column: 103, scope: !554)
!556 = !DILocation(line: 205, column: 13, scope: !554)
!557 = !DILocation(line: 206, column: 13, scope: !554)
!558 = !DILocation(line: 207, column: 28, scope: !554)
!559 = !DILocation(line: 208, column: 10, scope: !554)
!560 = !DILocation(line: 210, column: 20, scope: !520)
!561 = !DILocation(line: 210, column: 18, scope: !520)
!562 = !DILocation(line: 211, column: 65, scope: !520)
!563 = !DILocation(line: 211, column: 25, scope: !520)
!564 = !DILocation(line: 211, column: 23, scope: !520)
!565 = !DILocation(line: 213, column: 31, scope: !566)
!566 = distinct !DILexicalBlock(scope: !520, file: !109, line: 213, column: 14)
!567 = !DILocation(line: 213, column: 38, scope: !566)
!568 = !DILocation(line: 213, column: 42, scope: !566)
!569 = !DILocation(line: 213, column: 47, scope: !566)
!570 = !DILocation(line: 213, column: 68, scope: !566)
!571 = !DILocation(line: 213, column: 61, scope: !566)
!572 = !DILocation(line: 213, column: 82, scope: !566)
!573 = !DILocation(line: 213, column: 15, scope: !574)
!574 = !DILexicalBlockFile(scope: !566, file: !109, discriminator: 1)
!575 = !DILocation(line: 213, column: 15, scope: !566)
!576 = !DILocation(line: 213, column: 14, scope: !520)
!577 = !DILocation(line: 215, column: 91, scope: !578)
!578 = distinct !DILexicalBlock(scope: !566, file: !109, line: 214, column: 53)
!579 = !DILocation(line: 215, column: 13, scope: !578)
!580 = !DILocation(line: 216, column: 10, scope: !578)
!581 = !DILocation(line: 217, column: 7, scope: !520)
!582 = !DILocation(line: 218, column: 15, scope: !480)
!583 = !DILocation(line: 218, column: 7, scope: !480)
!584 = !DILocation(line: 219, column: 14, scope: !480)
!585 = !DILocation(line: 219, column: 7, scope: !480)
!586 = !DILocation(line: 220, column: 4, scope: !480)
!587 = !DILocation(line: 222, column: 4, scope: !421)
!588 = !DILocation(line: 222, column: 11, scope: !421)
!589 = !DILocation(line: 222, column: 26, scope: !421)
!590 = !DILocation(line: 223, column: 9, scope: !421)
!591 = !DILocation(line: 223, column: 4, scope: !421)
!592 = !DILocation(line: 224, column: 33, scope: !421)
!593 = !DILocation(line: 224, column: 11, scope: !421)
!594 = !DILocation(line: 224, column: 4, scope: !421)
!595 = distinct !DISubprogram(name: "ToolsCoreRpcSetOption", scope: !109, file: !109, line: 238, type: !290, isLocal: true, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !281)
