; ModuleID = './libGlibUtils_la-fileLogger.o.i'
source_filename = "./libGlibUtils_la-fileLogger.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GlibLogger = type { i32, i32, void (i8*, i32, i8*, i8*)*, void (i8*)* }
%struct.FileLogger = type { %struct.GlibLogger, %struct._GIOChannel*, i8*, i32, i64, i32, i32, i32, %struct.GStaticMutex }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !55)
!1 = !DIFile(filename: "libGlibUtils_la-fileLogger.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!2 = !{!3, !15, !22, !27, !36, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!19 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!20 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!21 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 77, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!25 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!26 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 31, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "G_IO_IN", value: 1)
!31 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!32 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!33 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!34 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!35 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 84, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!39 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!40 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!41 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!42 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!43 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!44 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!45 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!46 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 66, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/usr/include/glib-2.0/glib/gfileutils.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIEnumerator(name: "G_FILE_TEST_IS_REGULAR", value: 1)
!51 = !DIEnumerator(name: "G_FILE_TEST_IS_SYMLINK", value: 2)
!52 = !DIEnumerator(name: "G_FILE_TEST_IS_DIR", value: 4)
!53 = !DIEnumerator(name: "G_FILE_TEST_IS_EXECUTABLE", value: 8)
!54 = !DIEnumerator(name: "G_FILE_TEST_EXISTS", value: 16)
!55 = !{!56, !57, !61, !63, !75, !215, !122}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !59, line: 46, baseType: !60)
!59 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileLogger", file: !65, line: 48, baseType: !66)
!65 = !DIFile(filename: "fileLogger.c", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileLogger", file: !65, line: 38, size: 960, align: 64, elements: !67)
!67 = !{!68, !92, !267, !268, !269, !271, !272, !273, !274}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !66, file: !65, line: 39, baseType: !69, size: 192, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlibLogger", file: !70, line: 57, baseType: !71)
!70 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/glibUtils.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlibLogger", file: !70, line: 52, size: 192, align: 64, elements: !72)
!72 = !{!73, !77, !78, !87}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !71, file: !70, line: 53, baseType: !74, size: 32, align: 32)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !59, line: 50, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !59, line: 49, baseType: !76)
!76 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "addsTimestamp", scope: !71, file: !70, line: 54, baseType: !74, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "logfn", scope: !71, file: !70, line: 55, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogFunc", file: !4, line: 71, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !83, !85, !83, !86}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogLevelFlags", file: !4, line: 66, baseType: !3)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !59, line: 77, baseType: !56)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dtor", scope: !71, file: !70, line: 56, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !59, line: 87, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !86}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !66, file: !65, line: 40, baseType: !93, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !16, line: 41, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !16, line: 97, size: 896, align: 64, elements: !96)
!96 = !{!97, !98, !234, !235, !240, !241, !242, !243, !244, !253, !254, !255, !259, !260, !261, !262, !263, !264, !265, !266}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !95, file: !16, line: 100, baseType: !75, size: 32, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !95, file: !16, line: 101, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !16, line: 42, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !16, line: 131, size: 512, align: 64, elements: !102)
!102 = !{!103, !125, !129, !136, !140, !221, !225, !230}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !101, file: !16, line: 133, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !93, !57, !108, !111, !112}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !16, line: 75, baseType: !15)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !109, line: 66, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !115, line: 42, baseType: !116)
!115 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !115, line: 44, size: 128, align: 64, elements: !117)
!117 = !{!118, !123, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !116, file: !115, line: 46, baseType: !119, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !120, line: 36, baseType: !121)
!120 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !109, line: 45, baseType: !122)
!122 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !116, file: !115, line: 47, baseType: !75, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !115, line: 48, baseType: !57, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !101, file: !16, line: 138, baseType: !126, size: 64, align: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!107, !93, !83, !108, !111, !112}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !101, file: !16, line: 143, baseType: !130, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!107, !93, !133, !135, !112}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !109, line: 51, baseType: !134)
!134 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !16, line: 82, baseType: !22)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !101, file: !16, line: 147, baseType: !137, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!107, !93, !112}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !101, file: !16, line: 149, baseType: !141, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !93, !220}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !28, line: 64, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !28, line: 171, size: 768, align: 64, elements: !147)
!147 = !{!148, !149, !166, !195, !197, !201, !202, !203, !204, !212, !213, !214, !216}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !146, file: !28, line: 174, baseType: !86, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !146, file: !28, line: 175, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !28, line: 77, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !28, line: 196, size: 192, align: 64, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !152, file: !28, line: 198, baseType: !89, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !152, file: !28, line: 199, baseType: !89, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !152, file: !28, line: 200, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !86, !144, !160, !165}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !28, line: 155, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!74, !86}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !146, file: !28, line: 177, baseType: !167, size: 64, align: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !28, line: 130, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !28, line: 214, size: 384, align: 64, elements: !171)
!171 = !{!172, !177, !181, !185, !189, !190}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !170, file: !28, line: 216, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!74, !144, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !170, file: !28, line: 218, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!74, !144}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !170, file: !28, line: 219, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!74, !144, !161, !86}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !170, file: !28, line: 222, baseType: !186, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !144}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !170, file: !28, line: 226, baseType: !161, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !170, file: !28, line: 227, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !28, line: 212, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !146, file: !28, line: 178, baseType: !196, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !59, line: 55, baseType: !122)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !146, file: !28, line: 180, baseType: !198, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !28, line: 48, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !28, line: 48, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !146, file: !28, line: 182, baseType: !75, size: 32, align: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !28, line: 183, baseType: !196, size: 32, align: 32, offset: 352)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !146, file: !28, line: 184, baseType: !196, size: 32, align: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !146, file: !28, line: 186, baseType: !205, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !207, line: 37, baseType: !208)
!207 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !207, line: 39, size: 128, align: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !207, line: 41, baseType: !86, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !207, line: 42, baseType: !205, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !28, line: 188, baseType: !144, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !28, line: 189, baseType: !144, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !28, line: 191, baseType: !215, size: 64, align: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !146, file: !28, line: 193, baseType: !217, size: 64, align: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !28, line: 65, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !28, line: 65, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !28, line: 39, baseType: !27)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !101, file: !16, line: 151, baseType: !222, size: 64, align: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !93}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !101, file: !16, line: 152, baseType: !226, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!107, !93, !229, !112}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !16, line: 95, baseType: !36)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !101, file: !16, line: 155, baseType: !231, size: 64, align: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!229, !93}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !95, file: !16, line: 103, baseType: !57, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !95, file: !16, line: 104, baseType: !236, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !237, line: 77, baseType: !238)
!237 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !237, line: 77, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !95, file: !16, line: 105, baseType: !236, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !95, file: !16, line: 106, baseType: !57, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !95, file: !16, line: 107, baseType: !196, size: 32, align: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !95, file: !16, line: 109, baseType: !108, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !95, file: !16, line: 110, baseType: !245, size: 64, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !247, line: 39, baseType: !248)
!247 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !247, line: 41, size: 192, align: 64, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !248, file: !247, line: 43, baseType: !57, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !247, line: 44, baseType: !108, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !248, file: !247, line: 45, baseType: !108, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !95, file: !16, line: 111, baseType: !245, size: 64, align: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !95, file: !16, line: 112, baseType: !245, size: 64, align: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !95, file: !16, line: 113, baseType: !256, size: 48, align: 8, offset: 704)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, align: 8, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 6)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !95, file: !16, line: 117, baseType: !196, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !95, file: !16, line: 118, baseType: !196, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !95, file: !16, line: 119, baseType: !196, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !95, file: !16, line: 120, baseType: !196, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !95, file: !16, line: 121, baseType: !196, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !95, file: !16, line: 122, baseType: !196, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !95, file: !16, line: 124, baseType: !86, size: 64, align: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !95, file: !16, line: 125, baseType: !86, size: 64, align: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !66, file: !65, line: 41, baseType: !57, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "logSize", scope: !66, file: !65, line: 42, baseType: !75, size: 32, align: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "maxSize", scope: !66, file: !65, line: 43, baseType: !270, size: 64, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !109, line: 52, baseType: !110)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maxFiles", scope: !66, file: !65, line: 44, baseType: !196, size: 32, align: 32, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !66, file: !65, line: 45, baseType: !74, size: 32, align: 32, offset: 480)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !66, file: !65, line: 46, baseType: !74, size: 32, align: 32, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !66, file: !65, line: 47, baseType: !275, size: 384, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStaticMutex", file: !276, line: 140, baseType: !277)
!276 = !DIFile(filename: "/usr/include/glib-2.0/glib/deprecated/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 133, size: 384, align: 64, elements: !278)
!278 = !{!279, !290}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !277, file: !276, line: 135, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMutex", file: !282, line: 51, baseType: !283)
!282 = !DIFile(filename: "/usr/include/glib-2.0/glib/gthread.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GMutex", file: !282, line: 58, size: 64, align: 64, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !283, file: !282, line: 61, baseType: !86, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !283, file: !282, line: 62, baseType: !287, size: 64, align: 32)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 64, align: 32, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !277, file: !276, line: 138, baseType: !291, size: 320, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !292, line: 128, baseType: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !292, line: 90, size: 320, align: 64, elements: !294)
!294 = !{!295, !313, !317}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !293, file: !292, line: 125, baseType: !296, size: 320, align: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !292, line: 92, size: 320, align: 64, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !305, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !296, file: !292, line: 94, baseType: !76, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !296, file: !292, line: 95, baseType: !122, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !296, file: !292, line: 96, baseType: !76, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !296, file: !292, line: 98, baseType: !122, size: 32, align: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !296, file: !292, line: 102, baseType: !76, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !296, file: !292, line: 104, baseType: !304, size: 16, align: 16, offset: 160)
!304 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !296, file: !292, line: 105, baseType: !304, size: 16, align: 16, offset: 176)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !296, file: !292, line: 106, baseType: !307, size: 128, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !292, line: 79, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !292, line: 75, size: 128, align: 64, elements: !309)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !308, file: !292, line: 77, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !308, file: !292, line: 78, baseType: !311, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !293, file: !292, line: 126, baseType: !314, size: 320, align: 8)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 320, align: 8, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 40)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !293, file: !292, line: 127, baseType: !134, size: 64, align: 64)
!318 = !{i32 2, !"Dwarf Version", i32 4}
!319 = !{i32 2, !"Debug Info Version", i32 3}
!320 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!321 = distinct !DISubprogram(name: "GlibGetUserName", scope: !65, file: !65, line: 107, type: !322, isLocal: false, isDefinition: true, scopeLine: 108, isOptimized: false, unit: !0, variables: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!61}
!324 = !{}
!325 = !DILocation(line: 110, column: 11, scope: !321)
!326 = !DILocation(line: 110, column: 4, scope: !321)
!327 = distinct !DISubprogram(name: "GlibUtils_CreateFileLogger", scope: !65, file: !65, line: 420, type: !328, isLocal: false, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !324)
!328 = !DISubroutineType(types: !329)
!329 = !{!330, !61, !74, !196, !196}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!331 = !DILocalVariable(name: "path", arg: 1, scope: !327, file: !65, line: 420, type: !61)
!332 = !DIExpression()
!333 = !DILocation(line: 420, column: 40, scope: !327)
!334 = !DILocalVariable(name: "append", arg: 2, scope: !327, file: !65, line: 421, type: !74)
!335 = !DILocation(line: 421, column: 37, scope: !327)
!336 = !DILocalVariable(name: "maxSize", arg: 3, scope: !327, file: !65, line: 422, type: !196)
!337 = !DILocation(line: 422, column: 34, scope: !327)
!338 = !DILocalVariable(name: "maxFiles", arg: 4, scope: !327, file: !65, line: 423, type: !196)
!339 = !DILocation(line: 423, column: 34, scope: !327)
!340 = !DILocalVariable(name: "data", scope: !327, file: !65, line: 425, type: !63)
!341 = !DILocation(line: 425, column: 16, scope: !327)
!342 = !DILocation(line: 427, column: 4, scope: !327)
!343 = distinct !{!343, !342}
!344 = !DILocation(line: 427, column: 12, scope: !345)
!345 = !DILexicalBlockFile(scope: !346, file: !65, discriminator: 1)
!346 = distinct !DILexicalBlock(scope: !347, file: !65, line: 427, column: 12)
!347 = distinct !DILexicalBlock(scope: !327, file: !65, line: 427, column: 6)
!348 = !DILocation(line: 427, column: 17, scope: !345)
!349 = !DILocation(line: 427, column: 7, scope: !350)
!350 = !DILexicalBlockFile(scope: !351, file: !65, discriminator: 2)
!351 = distinct !DILexicalBlock(scope: !346, file: !65, line: 427, column: 5)
!352 = !DILocation(line: 427, column: 16, scope: !353)
!353 = !DILexicalBlockFile(scope: !354, file: !65, discriminator: 3)
!354 = distinct !DILexicalBlock(scope: !346, file: !65, line: 427, column: 14)
!355 = !DILocation(line: 427, column: 101, scope: !353)
!356 = !DILocation(line: 427, column: 9, scope: !357)
!357 = !DILexicalBlockFile(scope: !347, file: !65, discriminator: 4)
!358 = !DILocation(line: 429, column: 27, scope: !327)
!359 = !DILocation(line: 429, column: 12, scope: !327)
!360 = !DILocation(line: 429, column: 9, scope: !327)
!361 = !DILocation(line: 430, column: 4, scope: !327)
!362 = !DILocation(line: 430, column: 10, scope: !327)
!363 = !DILocation(line: 430, column: 18, scope: !327)
!364 = !DILocation(line: 430, column: 32, scope: !327)
!365 = !DILocation(line: 431, column: 4, scope: !327)
!366 = !DILocation(line: 431, column: 10, scope: !327)
!367 = !DILocation(line: 431, column: 18, scope: !327)
!368 = !DILocation(line: 431, column: 25, scope: !327)
!369 = !DILocation(line: 432, column: 4, scope: !327)
!370 = !DILocation(line: 432, column: 10, scope: !327)
!371 = !DILocation(line: 432, column: 18, scope: !327)
!372 = !DILocation(line: 432, column: 24, scope: !327)
!373 = !DILocation(line: 433, column: 4, scope: !327)
!374 = !DILocation(line: 433, column: 10, scope: !327)
!375 = !DILocation(line: 433, column: 18, scope: !327)
!376 = !DILocation(line: 433, column: 23, scope: !327)
!377 = !DILocation(line: 435, column: 38, scope: !327)
!378 = !DILocation(line: 435, column: 17, scope: !327)
!379 = !DILocation(line: 435, column: 4, scope: !327)
!380 = !DILocation(line: 435, column: 10, scope: !327)
!381 = !DILocation(line: 435, column: 15, scope: !327)
!382 = !DILocation(line: 436, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !327, file: !65, line: 436, column: 8)
!384 = !DILocation(line: 436, column: 14, scope: !383)
!385 = !DILocation(line: 436, column: 19, scope: !383)
!386 = !DILocation(line: 436, column: 8, scope: !327)
!387 = !DILocation(line: 437, column: 14, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !65, line: 436, column: 27)
!389 = !DILocation(line: 437, column: 7, scope: !388)
!390 = !DILocation(line: 438, column: 7, scope: !388)
!391 = !DILocation(line: 441, column: 19, scope: !327)
!392 = !DILocation(line: 441, column: 4, scope: !327)
!393 = !DILocation(line: 441, column: 10, scope: !327)
!394 = !DILocation(line: 441, column: 17, scope: !327)
!395 = !DILocation(line: 442, column: 20, scope: !327)
!396 = !DILocation(line: 442, column: 28, scope: !327)
!397 = !DILocation(line: 442, column: 35, scope: !327)
!398 = !DILocation(line: 442, column: 4, scope: !327)
!399 = !DILocation(line: 442, column: 10, scope: !327)
!400 = !DILocation(line: 442, column: 18, scope: !327)
!401 = !DILocation(line: 443, column: 21, scope: !327)
!402 = !DILocation(line: 443, column: 30, scope: !327)
!403 = !DILocation(line: 443, column: 4, scope: !327)
!404 = !DILocation(line: 443, column: 10, scope: !327)
!405 = !DILocation(line: 443, column: 19, scope: !327)
!406 = !DILocation(line: 444, column: 25, scope: !327)
!407 = !DILocation(line: 444, column: 31, scope: !327)
!408 = !DILocation(line: 444, column: 4, scope: !327)
!409 = !DILocation(line: 446, column: 12, scope: !327)
!410 = !DILocation(line: 446, column: 18, scope: !327)
!411 = !DILocation(line: 446, column: 4, scope: !327)
!412 = !DILocation(line: 447, column: 1, scope: !327)
!413 = distinct !DISubprogram(name: "FileLoggerLog", scope: !65, file: !65, line: 328, type: !81, isLocal: true, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !324)
!414 = !DILocalVariable(name: "domain", arg: 1, scope: !413, file: !65, line: 328, type: !83)
!415 = !DILocation(line: 328, column: 28, scope: !413)
!416 = !DILocalVariable(name: "level", arg: 2, scope: !413, file: !65, line: 329, type: !85)
!417 = !DILocation(line: 329, column: 30, scope: !413)
!418 = !DILocalVariable(name: "message", arg: 3, scope: !413, file: !65, line: 330, type: !83)
!419 = !DILocation(line: 330, column: 28, scope: !413)
!420 = !DILocalVariable(name: "data", arg: 4, scope: !413, file: !65, line: 331, type: !86)
!421 = !DILocation(line: 331, column: 24, scope: !413)
!422 = !DILocalVariable(name: "logger", scope: !413, file: !65, line: 333, type: !63)
!423 = !DILocation(line: 333, column: 16, scope: !413)
!424 = !DILocation(line: 333, column: 25, scope: !413)
!425 = !DILocalVariable(name: "written", scope: !413, file: !65, line: 334, type: !108)
!426 = !DILocation(line: 334, column: 10, scope: !413)
!427 = !DILocation(line: 336, column: 50, scope: !413)
!428 = !DILocation(line: 336, column: 58, scope: !413)
!429 = !DILocation(line: 336, column: 18, scope: !413)
!430 = !DILocation(line: 336, column: 4, scope: !431)
!431 = !DILexicalBlockFile(scope: !413, file: !65, discriminator: 1)
!432 = !DILocation(line: 338, column: 8, scope: !433)
!433 = distinct !DILexicalBlock(scope: !413, file: !65, line: 338, column: 8)
!434 = !DILocation(line: 338, column: 16, scope: !433)
!435 = !DILocation(line: 338, column: 8, scope: !413)
!436 = !DILocation(line: 339, column: 7, scope: !437)
!437 = distinct !DILexicalBlock(scope: !433, file: !65, line: 338, column: 23)
!438 = !DILocation(line: 342, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !413, file: !65, line: 342, column: 8)
!440 = !DILocation(line: 342, column: 16, scope: !439)
!441 = !DILocation(line: 342, column: 21, scope: !439)
!442 = !DILocation(line: 342, column: 8, scope: !413)
!443 = !DILocation(line: 343, column: 11, scope: !444)
!444 = distinct !DILexicalBlock(scope: !445, file: !65, line: 343, column: 11)
!445 = distinct !DILexicalBlock(scope: !439, file: !65, line: 342, column: 29)
!446 = !DILocation(line: 343, column: 19, scope: !444)
!447 = !DILocation(line: 343, column: 24, scope: !444)
!448 = !DILocation(line: 343, column: 11, scope: !445)
!449 = !DILocation(line: 344, column: 40, scope: !450)
!450 = distinct !DILexicalBlock(scope: !444, file: !65, line: 343, column: 32)
!451 = !DILocation(line: 344, column: 25, scope: !450)
!452 = !DILocation(line: 344, column: 10, scope: !450)
!453 = !DILocation(line: 344, column: 18, scope: !450)
!454 = !DILocation(line: 344, column: 23, scope: !450)
!455 = !DILocation(line: 345, column: 7, scope: !450)
!456 = !DILocation(line: 346, column: 11, scope: !457)
!457 = distinct !DILexicalBlock(scope: !445, file: !65, line: 346, column: 11)
!458 = !DILocation(line: 346, column: 19, scope: !457)
!459 = !DILocation(line: 346, column: 24, scope: !457)
!460 = !DILocation(line: 346, column: 11, scope: !445)
!461 = !DILocation(line: 347, column: 10, scope: !462)
!462 = distinct !DILexicalBlock(scope: !457, file: !65, line: 346, column: 32)
!463 = !DILocation(line: 347, column: 18, scope: !462)
!464 = !DILocation(line: 347, column: 24, scope: !462)
!465 = !DILocation(line: 348, column: 10, scope: !462)
!466 = !DILocation(line: 350, column: 4, scope: !445)
!467 = !DILocation(line: 352, column: 27, scope: !468)
!468 = distinct !DILexicalBlock(scope: !413, file: !65, line: 352, column: 8)
!469 = !DILocation(line: 352, column: 9, scope: !468)
!470 = !DILocation(line: 352, column: 8, scope: !413)
!471 = !DILocation(line: 353, column: 7, scope: !472)
!472 = distinct !DILexicalBlock(scope: !468, file: !65, line: 352, column: 36)
!473 = !DILocation(line: 353, column: 15, scope: !472)
!474 = !DILocation(line: 353, column: 21, scope: !472)
!475 = !DILocation(line: 354, column: 7, scope: !472)
!476 = !DILocation(line: 358, column: 33, scope: !477)
!477 = distinct !DILexicalBlock(scope: !413, file: !65, line: 358, column: 8)
!478 = !DILocation(line: 358, column: 41, scope: !477)
!479 = !DILocation(line: 358, column: 47, scope: !477)
!480 = !DILocation(line: 358, column: 8, scope: !477)
!481 = !DILocation(line: 358, column: 75, scope: !477)
!482 = !DILocation(line: 358, column: 8, scope: !413)
!483 = !DILocation(line: 360, column: 11, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !65, line: 360, column: 11)
!485 = distinct !DILexicalBlock(scope: !477, file: !65, line: 359, column: 28)
!486 = !DILocation(line: 360, column: 19, scope: !484)
!487 = !DILocation(line: 360, column: 27, scope: !484)
!488 = !DILocation(line: 360, column: 11, scope: !485)
!489 = !DILocation(line: 361, column: 36, scope: !490)
!490 = distinct !DILexicalBlock(scope: !484, file: !65, line: 360, column: 32)
!491 = !DILocation(line: 361, column: 29, scope: !490)
!492 = !DILocation(line: 361, column: 10, scope: !490)
!493 = !DILocation(line: 361, column: 18, scope: !490)
!494 = !DILocation(line: 361, column: 26, scope: !490)
!495 = !DILocation(line: 362, column: 14, scope: !496)
!496 = distinct !DILexicalBlock(scope: !490, file: !65, line: 362, column: 14)
!497 = !DILocation(line: 362, column: 22, scope: !496)
!498 = !DILocation(line: 362, column: 33, scope: !496)
!499 = !DILocation(line: 362, column: 41, scope: !496)
!500 = !DILocation(line: 362, column: 30, scope: !496)
!501 = !DILocation(line: 362, column: 14, scope: !490)
!502 = !DILocation(line: 363, column: 32, scope: !503)
!503 = distinct !DILexicalBlock(scope: !496, file: !65, line: 362, column: 50)
!504 = !DILocation(line: 363, column: 40, scope: !503)
!505 = !DILocation(line: 363, column: 13, scope: !503)
!506 = !DILocation(line: 364, column: 13, scope: !503)
!507 = !DILocation(line: 364, column: 21, scope: !503)
!508 = !DILocation(line: 364, column: 28, scope: !503)
!509 = !DILocation(line: 365, column: 43, scope: !503)
!510 = !DILocation(line: 365, column: 28, scope: !503)
!511 = !DILocation(line: 365, column: 13, scope: !503)
!512 = !DILocation(line: 365, column: 21, scope: !503)
!513 = !DILocation(line: 365, column: 26, scope: !503)
!514 = !DILocation(line: 366, column: 10, scope: !503)
!515 = !DILocation(line: 367, column: 32, scope: !516)
!516 = distinct !DILexicalBlock(scope: !496, file: !65, line: 366, column: 17)
!517 = !DILocation(line: 367, column: 40, scope: !516)
!518 = !DILocation(line: 367, column: 13, scope: !516)
!519 = !DILocation(line: 369, column: 7, scope: !490)
!520 = !DILocation(line: 370, column: 29, scope: !521)
!521 = distinct !DILexicalBlock(scope: !484, file: !65, line: 369, column: 14)
!522 = !DILocation(line: 370, column: 37, scope: !521)
!523 = !DILocation(line: 370, column: 10, scope: !521)
!524 = !DILocation(line: 372, column: 4, scope: !485)
!525 = !DILocation(line: 359, column: 8, scope: !477)
!526 = !DILocation(line: 375, column: 52, scope: !413)
!527 = !DILocation(line: 375, column: 60, scope: !413)
!528 = !DILocation(line: 375, column: 20, scope: !413)
!529 = !DILocation(line: 375, column: 4, scope: !431)
!530 = !DILocation(line: 376, column: 1, scope: !413)
!531 = distinct !DISubprogram(name: "FileLoggerDestroy", scope: !65, file: !65, line: 391, type: !90, isLocal: true, isDefinition: true, scopeLine: 392, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !324)
!532 = !DILocalVariable(name: "data", arg: 1, scope: !531, file: !65, line: 391, type: !86)
!533 = !DILocation(line: 391, column: 28, scope: !531)
!534 = !DILocalVariable(name: "logger", scope: !531, file: !65, line: 393, type: !63)
!535 = !DILocation(line: 393, column: 16, scope: !531)
!536 = !DILocation(line: 393, column: 25, scope: !531)
!537 = !DILocation(line: 394, column: 8, scope: !538)
!538 = distinct !DILexicalBlock(scope: !531, file: !65, line: 394, column: 8)
!539 = !DILocation(line: 394, column: 16, scope: !538)
!540 = !DILocation(line: 394, column: 21, scope: !538)
!541 = !DILocation(line: 394, column: 8, scope: !531)
!542 = !DILocation(line: 395, column: 26, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !65, line: 394, column: 29)
!544 = !DILocation(line: 395, column: 34, scope: !543)
!545 = !DILocation(line: 395, column: 7, scope: !543)
!546 = !DILocation(line: 396, column: 4, scope: !543)
!547 = !DILocation(line: 397, column: 25, scope: !531)
!548 = !DILocation(line: 397, column: 33, scope: !531)
!549 = !DILocation(line: 397, column: 4, scope: !531)
!550 = !DILocation(line: 398, column: 11, scope: !531)
!551 = !DILocation(line: 398, column: 19, scope: !531)
!552 = !DILocation(line: 398, column: 4, scope: !531)
!553 = !DILocation(line: 399, column: 11, scope: !531)
!554 = !DILocation(line: 399, column: 4, scope: !531)
!555 = !DILocation(line: 400, column: 1, scope: !531)
!556 = distinct !DISubprogram(name: "FileLoggerOpen", scope: !65, file: !65, line: 233, type: !557, isLocal: true, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !324)
!557 = !DISubroutineType(types: !558)
!558 = !{!93, !63}
!559 = !DILocalVariable(name: "data", arg: 1, scope: !556, file: !65, line: 233, type: !63)
!560 = !DILocation(line: 233, column: 28, scope: !556)
!561 = !DILocalVariable(name: "logfile", scope: !556, file: !65, line: 235, type: !93)
!562 = !DILocation(line: 235, column: 16, scope: !556)
!563 = !DILocalVariable(name: "path", scope: !556, file: !65, line: 236, type: !57)
!564 = !DILocation(line: 236, column: 11, scope: !556)
!565 = !DILocation(line: 238, column: 4, scope: !556)
!566 = distinct !{!566, !565}
!567 = !DILocation(line: 238, column: 12, scope: !568)
!568 = !DILexicalBlockFile(scope: !569, file: !65, discriminator: 1)
!569 = distinct !DILexicalBlock(scope: !570, file: !65, line: 238, column: 12)
!570 = distinct !DILexicalBlock(scope: !556, file: !65, line: 238, column: 6)
!571 = !DILocation(line: 238, column: 17, scope: !568)
!572 = !DILocation(line: 238, column: 7, scope: !573)
!573 = !DILexicalBlockFile(scope: !574, file: !65, discriminator: 2)
!574 = distinct !DILexicalBlock(scope: !569, file: !65, line: 238, column: 5)
!575 = !DILocation(line: 238, column: 16, scope: !576)
!576 = !DILexicalBlockFile(scope: !577, file: !65, discriminator: 3)
!577 = distinct !DILexicalBlock(scope: !569, file: !65, line: 238, column: 14)
!578 = !DILocation(line: 238, column: 101, scope: !576)
!579 = !DILocation(line: 238, column: 9, scope: !580)
!580 = !DILexicalBlockFile(scope: !570, file: !65, discriminator: 4)
!581 = !DILocation(line: 239, column: 29, scope: !556)
!582 = !DILocation(line: 239, column: 11, scope: !556)
!583 = !DILocation(line: 239, column: 9, scope: !556)
!584 = !DILocation(line: 241, column: 20, scope: !585)
!585 = distinct !DILexicalBlock(scope: !556, file: !65, line: 241, column: 8)
!586 = !DILocation(line: 241, column: 8, scope: !585)
!587 = !DILocation(line: 241, column: 8, scope: !556)
!588 = !DILocalVariable(name: "fstats", scope: !589, file: !65, line: 244, type: !590)
!589 = distinct !DILexicalBlock(scope: !585, file: !65, line: 241, column: 47)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "GStatBuf", file: !591, line: 50, baseType: !592)
!591 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstdio.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !593, line: 46, size: 1152, align: 64, elements: !594)
!593 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!594 = !{!595, !598, !600, !602, !604, !606, !608, !609, !610, !612, !614, !616, !624, !625, !626}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !592, file: !593, line: 48, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !597, line: 124, baseType: !110)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !592, file: !593, line: 53, baseType: !599, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !597, line: 127, baseType: !110)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !592, file: !593, line: 61, baseType: !601, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !597, line: 130, baseType: !110)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !592, file: !593, line: 62, baseType: !603, size: 32, align: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !597, line: 129, baseType: !122)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !592, file: !593, line: 64, baseType: !605, size: 32, align: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !597, line: 125, baseType: !122)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !592, file: !593, line: 65, baseType: !607, size: 32, align: 32, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !597, line: 126, baseType: !122)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !592, file: !593, line: 67, baseType: !76, size: 32, align: 32, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !592, file: !593, line: 69, baseType: !596, size: 64, align: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !592, file: !593, line: 74, baseType: !611, size: 64, align: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !597, line: 131, baseType: !134)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !592, file: !593, line: 78, baseType: !613, size: 64, align: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !597, line: 153, baseType: !134)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !592, file: !593, line: 80, baseType: !615, size: 64, align: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !597, line: 158, baseType: !134)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !592, file: !593, line: 91, baseType: !617, size: 128, align: 64, offset: 576)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !618, line: 120, size: 128, align: 64, elements: !619)
!618 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !617, file: !618, line: 122, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !597, line: 139, baseType: !134)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !617, file: !618, line: 123, baseType: !623, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !597, line: 175, baseType: !134)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !592, file: !593, line: 92, baseType: !617, size: 128, align: 64, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !592, file: !593, line: 93, baseType: !617, size: 128, align: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !592, file: !593, line: 106, baseType: !627, size: 192, align: 64, offset: 960)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 192, align: 64, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 3)
!630 = !DILocation(line: 244, column: 16, scope: !589)
!631 = !DILocation(line: 249, column: 16, scope: !632)
!632 = distinct !DILexicalBlock(scope: !589, file: !65, line: 249, column: 11)
!633 = !DILocation(line: 249, column: 11, scope: !632)
!634 = !DILocation(line: 249, column: 31, scope: !632)
!635 = !DILocation(line: 249, column: 11, scope: !589)
!636 = !DILocation(line: 250, column: 40, scope: !637)
!637 = distinct !DILexicalBlock(scope: !632, file: !65, line: 249, column: 37)
!638 = !DILocation(line: 250, column: 26, scope: !637)
!639 = !DILocation(line: 250, column: 10, scope: !637)
!640 = !DILocation(line: 250, column: 16, scope: !637)
!641 = !DILocation(line: 250, column: 24, scope: !637)
!642 = !DILocation(line: 251, column: 7, scope: !637)
!643 = !DILocation(line: 253, column: 12, scope: !644)
!644 = distinct !DILexicalBlock(scope: !589, file: !65, line: 253, column: 11)
!645 = !DILocation(line: 253, column: 18, scope: !644)
!646 = !DILocation(line: 253, column: 25, scope: !644)
!647 = !DILocation(line: 253, column: 28, scope: !648)
!648 = !DILexicalBlockFile(scope: !644, file: !65, discriminator: 1)
!649 = !DILocation(line: 253, column: 34, scope: !648)
!650 = !DILocation(line: 253, column: 45, scope: !648)
!651 = !DILocation(line: 253, column: 51, scope: !648)
!652 = !DILocation(line: 253, column: 42, scope: !648)
!653 = !DILocation(line: 253, column: 11, scope: !648)
!654 = !DILocalVariable(name: "log", scope: !655, file: !65, line: 260, type: !57)
!655 = distinct !DILexicalBlock(scope: !644, file: !65, line: 253, column: 60)
!656 = !DILocation(line: 260, column: 17, scope: !655)
!657 = !DILocalVariable(name: "id", scope: !655, file: !65, line: 261, type: !196)
!658 = !DILocation(line: 261, column: 16, scope: !655)
!659 = !DILocalVariable(name: "logfiles", scope: !655, file: !65, line: 262, type: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPtrArray", file: !662, line: 39, baseType: !663)
!662 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/open-vm-tools/line267")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GPtrArray", file: !662, line: 53, size: 128, align: 64, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !663, file: !662, line: 55, baseType: !165, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !663, file: !662, line: 56, baseType: !196, size: 32, align: 32, offset: 64)
!667 = !DILocation(line: 262, column: 21, scope: !655)
!668 = !DILocation(line: 262, column: 32, scope: !655)
!669 = !DILocation(line: 269, column: 18, scope: !670)
!670 = distinct !DILexicalBlock(scope: !655, file: !65, line: 269, column: 10)
!671 = !DILocation(line: 269, column: 15, scope: !670)
!672 = !DILocation(line: 269, column: 23, scope: !673)
!673 = !DILexicalBlockFile(scope: !674, file: !65, discriminator: 1)
!674 = distinct !DILexicalBlock(scope: !670, file: !65, line: 269, column: 10)
!675 = !DILocation(line: 269, column: 28, scope: !673)
!676 = !DILocation(line: 269, column: 34, scope: !673)
!677 = !DILocation(line: 269, column: 26, scope: !673)
!678 = !DILocation(line: 269, column: 10, scope: !673)
!679 = !DILocation(line: 270, column: 37, scope: !680)
!680 = distinct !DILexicalBlock(scope: !674, file: !65, line: 269, column: 50)
!681 = !DILocation(line: 270, column: 43, scope: !680)
!682 = !DILocation(line: 270, column: 19, scope: !680)
!683 = !DILocation(line: 270, column: 17, scope: !680)
!684 = !DILocation(line: 271, column: 29, scope: !680)
!685 = !DILocation(line: 271, column: 39, scope: !680)
!686 = !DILocation(line: 271, column: 13, scope: !680)
!687 = !DILocation(line: 272, column: 30, scope: !688)
!688 = distinct !DILexicalBlock(scope: !680, file: !65, line: 272, column: 17)
!689 = !DILocation(line: 272, column: 18, scope: !688)
!690 = !DILocation(line: 272, column: 17, scope: !680)
!691 = !DILocation(line: 273, column: 16, scope: !692)
!692 = distinct !DILexicalBlock(scope: !688, file: !65, line: 272, column: 60)
!693 = !DILocation(line: 275, column: 10, scope: !680)
!694 = !DILocation(line: 269, column: 46, scope: !695)
!695 = !DILexicalBlockFile(scope: !674, file: !65, discriminator: 2)
!696 = !DILocation(line: 269, column: 10, scope: !695)
!697 = distinct !{!697, !698}
!698 = !DILocation(line: 269, column: 10, scope: !655)
!699 = !DILocation(line: 278, column: 20, scope: !700)
!700 = distinct !DILexicalBlock(scope: !655, file: !65, line: 278, column: 10)
!701 = !DILocation(line: 278, column: 30, scope: !700)
!702 = !DILocation(line: 278, column: 34, scope: !700)
!703 = !DILocation(line: 278, column: 18, scope: !700)
!704 = !DILocation(line: 278, column: 15, scope: !700)
!705 = !DILocation(line: 278, column: 39, scope: !706)
!706 = !DILexicalBlockFile(scope: !707, file: !65, discriminator: 1)
!707 = distinct !DILexicalBlock(scope: !700, file: !65, line: 278, column: 10)
!708 = !DILocation(line: 278, column: 42, scope: !706)
!709 = !DILocation(line: 278, column: 10, scope: !706)
!710 = !DILocalVariable(name: "dest", scope: !711, file: !65, line: 279, type: !57)
!711 = distinct !DILexicalBlock(scope: !707, file: !65, line: 278, column: 53)
!712 = !DILocation(line: 279, column: 20, scope: !711)
!713 = !DILocation(line: 279, column: 47, scope: !711)
!714 = !DILocation(line: 279, column: 27, scope: !711)
!715 = !DILocation(line: 279, column: 29, scope: !711)
!716 = !DILocation(line: 279, column: 40, scope: !711)
!717 = !DILocalVariable(name: "src", scope: !711, file: !65, line: 280, type: !57)
!718 = !DILocation(line: 280, column: 20, scope: !711)
!719 = !DILocation(line: 280, column: 46, scope: !711)
!720 = !DILocation(line: 280, column: 49, scope: !711)
!721 = !DILocation(line: 280, column: 26, scope: !711)
!722 = !DILocation(line: 280, column: 28, scope: !711)
!723 = !DILocation(line: 280, column: 39, scope: !711)
!724 = !DILocation(line: 282, column: 30, scope: !725)
!725 = distinct !DILexicalBlock(scope: !711, file: !65, line: 282, column: 17)
!726 = !DILocation(line: 282, column: 18, scope: !725)
!727 = !DILocation(line: 282, column: 56, scope: !725)
!728 = !DILocation(line: 283, column: 31, scope: !725)
!729 = !DILocation(line: 283, column: 19, scope: !725)
!730 = !DILocation(line: 283, column: 57, scope: !725)
!731 = !DILocation(line: 284, column: 27, scope: !725)
