; ModuleID = '/home/lichi/Desktop/genwqe/[task]tools--genwqe_csv2vpd/[inter]tools--genwqe_csv2vpd.o.i'
source_filename = "/home/lichi/Desktop/genwqe/[task]tools--genwqe_csv2vpd/[inter]tools--genwqe_csv2vpd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@arg_index = internal global i32 0, align 4
@.str = private unnamed_addr constant [3 x i8] c"-h\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"-o\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@output_fn = internal global [512 x i8] zeroinitializer, align 16
@.str.3 = private unnamed_addr constant [3 x i8] c"-i\00", align 1
@input_fn = internal global [512 x i8] zeroinitializer, align 16
@.str.4 = private unnamed_addr constant [3 x i8] c"-v\00", align 1
@verbose_flag = internal global i32 0, align 4
@.str.5 = private unnamed_addr constant [5 x i8] c"-crc\00", align 1
@add_crc = internal global i32 0, align 4
@.str.6 = private unnamed_addr constant [24 x i8] c"\0AInput Filename:   '%s'\00", align 1
@.str.7 = private unnamed_addr constant [24 x i8] c"\0AOutput Filename:  '%s'\00", align 1

!146 = distinct !DILexicalBlock(scope: !50, file: !4, line: 445, column: 6)
!147 = !DILocation(line: 445, column: 12, scope: !146)
!148 = !DILocation(line: 445, column: 29, scope: !146)
!149 = !DILocation(line: 445, column: 41, scope: !150)
!150 = !DILexicalBlockFile(scope: !146, file: !4, discriminator: 1)
!151 = !DILocation(line: 445, column: 38, scope: !150)
!152 = !DILocation(line: 445, column: 6, scope: !150)
!153 = !DILocation(line: 446, column: 3, scope: !146)
!154 = !DILocation(line: 448, column: 3, scope: !146)
!155 = !DILocation(line: 450, column: 6, scope: !156)
!156 = distinct !DILexicalBlock(scope: !50, file: !4, line: 450, column: 6)
!157 = !DILocation(line: 450, column: 6, scope: !50)
!158 = !DILocation(line: 451, column: 3, scope: !156)
!159 = !DILocation(line: 452, column: 2, scope: !50)
!160 = !DILocation(line: 453, column: 1, scope: !50)
!161 = distinct !DISubprogram(name: "set_args", scope: !4, file: !4, line: 373, type: !162, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !16, !53}
!164 = !DILocalVariable(name: "argc", arg: 1, scope: !161, file: !4, line: 373, type: !16)
!165 = !DILocation(line: 373, column: 26, scope: !161)
!166 = !DILocalVariable(name: "argv", arg: 2, scope: !161, file: !4, line: 373, type: !53)
!167 = !DILocation(line: 373, column: 38, scope: !161)
!168 = !DILocalVariable(name: "i", scope: !161, file: !4, line: 375, type: !16)
!169 = !DILocation(line: 375, column: 6, scope: !161)
!170 = !DILocation(line: 377, column: 14, scope: !161)
!171 = !DILocation(line: 377, column: 12, scope: !161)
!172 = !DILocation(line: 378, column: 9, scope: !173)
!173 = distinct !DILexicalBlock(scope: !161, file: !4, line: 378, column: 2)
!174 = !DILocation(line: 378, column: 7, scope: !173)
!175 = !DILocation(line: 378, column: 14, scope: !176)
!176 = !DILexicalBlockFile(scope: !177, file: !4, discriminator: 1)
!177 = distinct !DILexicalBlock(scope: !173, file: !4, line: 378, column: 2)
!178 = !DILocation(line: 378, column: 18, scope: !176)
!179 = !DILocation(line: 378, column: 16, scope: !176)
!180 = !DILocation(line: 378, column: 2, scope: !176)
!181 = !DILocation(line: 379, column: 24, scope: !177)
!182 = !DILocation(line: 379, column: 19, scope: !177)
!183 = !DILocation(line: 379, column: 14, scope: !177)
!184 = !DILocation(line: 379, column: 3, scope: !177)
!185 = !DILocation(line: 379, column: 17, scope: !177)
!186 = !DILocation(line: 378, column: 25, scope: !187)
!187 = !DILexicalBlockFile(scope: !177, file: !4, discriminator: 2)
!188 = !DILocation(line: 378, column: 2, scope: !187)
!189 = distinct !{!189, !190}
!190 = !DILocation(line: 378, column: 2, scope: !161)
!191 = !DILocation(line: 380, column: 12, scope: !161)
!192 = !DILocation(line: 381, column: 1, scope: !161)
!193 = distinct !DISubprogram(name: "next_arg", scope: !4, file: !4, line: 383, type: !194, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!194 = !DISubroutineType(types: !195)
!195 = !{!13}
!196 = !DILocation(line: 385, column: 6, scope: !197)
!197 = distinct !DILexicalBlock(scope: !193, file: !4, line: 385, column: 6)
!198 = !DILocation(line: 385, column: 18, scope: !197)
!199 = !DILocation(line: 385, column: 16, scope: !197)
!200 = !DILocation(line: 385, column: 6, scope: !193)
!201 = !DILocation(line: 386, column: 22, scope: !197)
!202 = !DILocation(line: 386, column: 11, scope: !197)
!203 = !DILocation(line: 386, column: 3, scope: !197)
!204 = !DILocation(line: 387, column: 2, scope: !193)
!205 = !DILocation(line: 388, column: 1, scope: !193)
!206 = distinct !DISubprogram(name: "help", scope: !4, file: !4, line: 397, type: !207, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!207 = !DISubroutineType(types: !208)
!208 = !{null}
!209 = !DILocation(line: 399, column: 2, scope: !206)
!210 = !DILocation(line: 402, column: 2, scope: !206)
!211 = distinct !DISubprogram(name: "get_next_arg", scope: !4, file: !4, line: 390, type: !194, isLocal: true, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!212 = !DILocation(line: 392, column: 6, scope: !213)
!213 = distinct !DILexicalBlock(scope: !211, file: !4, line: 392, column: 6)
!214 = !DILocation(line: 392, column: 18, scope: !213)
!215 = !DILocation(line: 392, column: 16, scope: !213)
!216 = !DILocation(line: 392, column: 6, scope: !211)
!217 = !DILocation(line: 393, column: 31, scope: !213)
!218 = !DILocation(line: 393, column: 11, scope: !213)
!219 = !DILocation(line: 393, column: 3, scope: !213)
!220 = !DILocation(line: 394, column: 2, scope: !211)
!221 = !DILocation(line: 395, column: 1, scope: !211)
!222 = distinct !DISubprogram(name: "convert_csv", scope: !4, file: !4, line: 178, type: !223, isLocal: true, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !54)
!223 = !DISubroutineType(types: !224)
!224 = !{!35}
!225 = !DILocalVariable(name: "ip", scope: !222, file: !4, line: 180, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !228, line: 48, baseType: !229)
!228 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !230, line: 241, size: 1728, align: 64, elements: !231)
!230 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !252, !253, !254, !255, !259, !261, !263, !267, !270, !272, !273, !274, !275, !276, !279, !280}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !229, file: !230, line: 242, baseType: !16, size: 32, align: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !229, file: !230, line: 247, baseType: !13, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !229, file: !230, line: 248, baseType: !13, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !229, file: !230, line: 249, baseType: !13, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !229, file: !230, line: 250, baseType: !13, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !229, file: !230, line: 251, baseType: !13, size: 64, align: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !229, file: !230, line: 252, baseType: !13, size: 64, align: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !229, file: !230, line: 253, baseType: !13, size: 64, align: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !229, file: !230, line: 254, baseType: !13, size: 64, align: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !229, file: !230, line: 256, baseType: !13, size: 64, align: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !229, file: !230, line: 257, baseType: !13, size: 64, align: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !229, file: !230, line: 258, baseType: !13, size: 64, align: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !229, file: !230, line: 260, baseType: !245, size: 64, align: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !230, line: 156, size: 192, align: 64, elements: !247)
!247 = !{!248, !249, !251}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !246, file: !230, line: 157, baseType: !245, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !246, file: !230, line: 158, baseType: !250, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !246, file: !230, line: 162, baseType: !16, size: 32, align: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !229, file: !230, line: 262, baseType: !250, size: 64, align: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !229, file: !230, line: 264, baseType: !16, size: 32, align: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !229, file: !230, line: 268, baseType: !16, size: 32, align: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !229, file: !230, line: 270, baseType: !256, size: 64, align: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 131, baseType: !258)
!257 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop")
!258 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !229, file: !230, line: 274, baseType: !260, size: 16, align: 16, offset: 1024)
!260 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !229, file: !230, line: 275, baseType: !262, size: 8, align: 8, offset: 1040)
!262 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !229, file: !230, line: 276, baseType: !264, size: 8, align: 8, offset: 1048)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, align: 8, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 1)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !229, file: !230, line: 280, baseType: !268, size: 64, align: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !230, line: 150, baseType: null)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !229, file: !230, line: 289, baseType: !271, size: 64, align: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 132, baseType: !258)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !229, file: !230, line: 297, baseType: !15, size: 64, align: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !229, file: !230, line: 298, baseType: !15, size: 64, align: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !229, file: !230, line: 299, baseType: !15, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !229, file: !230, line: 300, baseType: !15, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !229, file: !230, line: 302, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !278, line: 216, baseType: !20)
!278 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !229, file: !230, line: 303, baseType: !16, size: 32, align: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !229, file: !230, line: 305, baseType: !281, size: 160, align: 8, offset: 1568)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, align: 8, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 20)
!284 = !DILocation(line: 180, column: 8, scope: !222)
!285 = !DILocalVariable(name: "op", scope: !222, file: !4, line: 180, type: !226)
!286 = !DILocation(line: 180, column: 13, scope: !222)
!287 = !DILocalVariable(name: "line", scope: !222, file: !4, line: 181, type: !25)
!288 = !DILocation(line: 181, column: 7, scope: !222)
!289 = !DILocalVariable(name: "token", scope: !222, file: !4, line: 182, type: !25)
!290 = !DILocation(line: 182, column: 7, scope: !222)
!291 = !DILocalVariable(name: "line_nr", scope: !222, file: !4, line: 183, type: !21)
!292 = !DILocation(line: 183, column: 11, scope: !222)
!293 = !DILocalVariable(name: "offset", scope: !222, file: !4, line: 184, type: !16)
!294 = !DILocation(line: 184, column: 6, scope: !222)
!295 = !DILocalVariable(name: "crc32_seek", scope: !222, file: !4, line: 185, type: !21)
!296 = !DILocation(line: 185, column: 15, scope: !222)
!297 = !DILocalVariable(name: "value", scope: !222, file: !4, line: 186, type: !21)
!298 = !DILocation(line: 186, column: 15, scope: !222)
!299 = !DILocalVariable(name: "desc", scope: !222, file: !4, line: 187, type: !25)
!300 = !DILocation(line: 187, column: 7, scope: !222)
!301 = !DILocalVariable(name: "crc32", scope: !222, file: !4, line: 188, type: !44)
!302 = !DILocation(line: 188, column: 11, scope: !222)
!303 = !DILocalVariable(name: "data", scope: !222, file: !4, line: 189, type: !17)
!304 = !DILocation(line: 189, column: 10, scope: !222)
!305 = !DILocalVariable(name: "i", scope: !222, file: !4, line: 190, type: !16)
!306 = !DILocation(line: 190, column: 6, scope: !222)
!307 = !DILocalVariable(name: "j", scope: !222, file: !4, line: 190, type: !16)
!308 = !DILocation(line: 190, column: 9, scope: !222)
!309 = !DILocalVariable(name: "parse_error", scope: !222, file: !4, line: 191, type: !35)
!310 = !DILocation(line: 191, column: 7, scope: !222)
!311 = !DILocalVariable(name: "last_byte", scope: !222, file: !4, line: 192, type: !16)
!312 = !DILocation(line: 192, column: 6, scope: !222)
!313 = !DILocalVariable(name: "nrw", scope: !222, file: !4, line: 193, type: !16)
!314 = !DILocation(line: 193, column: 6, scope: !222)
!315 = !DILocalVariable(name: "endianness", scope: !222, file: !4, line: 194, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "SOS_ENDIANNESS", file: !4, line: 56, baseType: !8)
!317 = !DILocation(line: 194, column: 17, scope: !222)
!318 = !DILocalVariable(name: "buffer", scope: !222, file: !4, line: 195, type: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!320 = !DILocation(line: 195, column: 11, scope: !222)
!321 = !DILocation(line: 197, column: 7, scope: !222)
!322 = !DILocation(line: 197, column: 5, scope: !222)
!323 = !DILocation(line: 198, column: 6, scope: !324)
!324 = distinct !DILexicalBlock(scope: !222, file: !4, line: 198, column: 6)
!325 = !DILocation(line: 198, column: 9, scope: !324)
!326 = !DILocation(line: 198, column: 6, scope: !222)
!327 = !DILocation(line: 199, column: 3, scope: !328)
!328 = distinct !DILexicalBlock(scope: !324, file: !4, line: 198, column: 18)
!329 = !DILocation(line: 200, column: 3, scope: !328)
!330 = !DILocation(line: 203, column: 7, scope: !222)
!331 = !DILocation(line: 203, column: 5, scope: !222)
!332 = !DILocation(line: 204, column: 6, scope: !333)
!333 = distinct !DILexicalBlock(scope: !222, file: !4, line: 204, column: 6)
!334 = !DILocation(line: 204, column: 9, scope: !333)
!335 = !DILocation(line: 204, column: 6, scope: !222)
!336 = !DILocation(line: 205, column: 3, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !4, line: 204, column: 18)
!338 = !DILocation(line: 206, column: 10, scope: !337)
!339 = !DILocation(line: 206, column: 3, scope: !337)
