; ModuleID = './ulRec.o.i'
source_filename = "./ulRec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.MX_MutexRec = type opaque
%struct.MXUserRecLock = type { %struct.MXUserHeader, %struct.MXRecLock, %struct.Atomic_uint64, %struct.Atomic_uint64, %struct.Atomic_uint32, %struct.MX_MutexRec* }
%struct.MXUserHeader = type { i32, i8*, i32, %struct.anon, void (%struct.MXUserHeader*)*, void (%struct.MXUserHeader*)*, %struct.ListItem }
%struct.anon = type { i32 }
%struct.ListItem = type { %struct.ListItem*, %struct.ListItem* }
%struct.MXRecLock = type { %union.pthread_mutex_t, i32, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%struct.Atomic_uint64 = type { i64 }
%struct.Atomic_uint32 = type { i32 }
%struct.MXUserHeldStats = type { i64, %struct.MXUserBasicStats, %struct.Atomic_uint64 }
%struct.MXUserBasicStats = type { i8*, i64, i64, i64, i64, double }
%struct.MXUserAcquireStats = type { %struct.MXUserAcquisitionStats, %struct.Atomic_uint64 }
%struct.MXUserAcquisitionStats = type { double, i64, i64, i64, i64, i64, i64, i64, %struct.MXUserBasicStats }
%struct.MXUserHisto = type opaque
%struct.MXUserCondVar = type opaque
%union.pthread_mutexattr_t = type { i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "ulRec.o.i", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "ulInt.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "MXUSER_TYPE_NEVER_USE", value: 0)
!7 = !DIEnumerator(name: "MXUSER_TYPE_RW", value: 1)
!8 = !DIEnumerator(name: "MXUSER_TYPE_REC", value: 2)
!9 = !DIEnumerator(name: "MXUSER_TYPE_RANK", value: 3)
!10 = !DIEnumerator(name: "MXUSER_TYPE_EXCL", value: 4)
!11 = !DIEnumerator(name: "MXUSER_TYPE_SEMA", value: 5)
!12 = !DIEnumerator(name: "MXUSER_TYPE_CONDVAR", value: 6)
!13 = !DIEnumerator(name: "MXUSER_TYPE_BARRIER", value: 7)
!14 = !DIEnumerator(name: "MXUSER_TYPE_EVENT", value: 8)
!15 = !{!16, !17, !28, !116, !104}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserRecLock", file: !19, line: 39, baseType: !20)
!19 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/userlock.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserRecLock", file: !21, line: 26, size: 1152, align: 64, elements: !22)
!21 = !DIFile(filename: "ulRec.c", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!22 = !{!23, !57, !96, !106, !107, !113}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !20, file: !21, line: 28, baseType: !24, size: 448, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeader", file: !4, line: 469, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MXUserHeader", file: !4, line: 456, size: 448, align: 64, elements: !26)
!26 = !{!27, !33, !36, !38, !43, !48, !49}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !25, file: !4, line: 457, baseType: !28, size: 32, align: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32", file: !29, line: 173, baseType: !30)
!29 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_basic_types.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 51, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!32 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !4, line: 458, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rank", scope: !25, file: !4, line: 459, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "MX_Rank", file: !29, line: 1167, baseType: !28)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !25, file: !4, line: 464, baseType: !39, size: 32, align: 32, offset: 160)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !4, line: 461, size: 32, align: 32, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !39, file: !4, line: 462, baseType: !32, size: 24, align: 32, flags: DIFlagBitField, extraData: i64 0)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "badHeader", scope: !39, file: !4, line: 463, baseType: !32, size: 1, align: 32, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "dumpFunc", scope: !25, file: !4, line: 466, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "statsFunc", scope: !25, file: !4, line: 467, baseType: !44, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !25, file: !4, line: 468, baseType: !50, size: 128, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/circList.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListItem", file: !51, line: 42, size: 128, align: 64, elements: !53)
!53 = !{!54, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !51, line: 43, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !51, line: 44, baseType: !55, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "recursiveLock", scope: !20, file: !21, line: 29, baseType: !58, size: 448, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXRecLock", file: !4, line: 67, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 58, size: 448, align: 64, elements: !60)
!60 = !{!61, !91, !92}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nativeLock", scope: !59, file: !4, line: 62, baseType: !62, size: 320, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !63, line: 128, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!64 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !63, line: 90, size: 320, align: 64, elements: !65)
!65 = !{!66, !85, !89}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !64, file: !63, line: 125, baseType: !67, size: 320, align: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !63, line: 92, size: 320, align: 64, elements: !68)
!68 = !{!69, !71, !72, !73, !74, !75, !77, !78}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !67, file: !63, line: 94, baseType: !70, size: 32, align: 32)
!70 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !67, file: !63, line: 95, baseType: !32, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !67, file: !63, line: 96, baseType: !70, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !67, file: !63, line: 98, baseType: !32, size: 32, align: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !67, file: !63, line: 102, baseType: !70, size: 32, align: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !67, file: !63, line: 104, baseType: !76, size: 16, align: 16, offset: 160)
!76 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !67, file: !63, line: 105, baseType: !76, size: 16, align: 16, offset: 176)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !67, file: !63, line: 106, baseType: !79, size: 128, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !63, line: 79, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !63, line: 75, size: 128, align: 64, elements: !81)
!81 = !{!82, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !80, file: !63, line: 77, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !80, file: !63, line: 78, baseType: !83, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !64, file: !63, line: 126, baseType: !86, size: 320, align: 8)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 320, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 40)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !64, file: !63, line: 127, baseType: !90, size: 64, align: 64)
!90 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "referenceCount", scope: !59, file: !4, line: 65, baseType: !70, size: 32, align: 32, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nativeThreadID", scope: !59, file: !4, line: 66, baseType: !93, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserThreadID", file: !4, line: 39, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !63, line: 60, baseType: !95)
!95 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "heldStatsMem", scope: !20, file: !21, line: 30, baseType: !97, size: 64, align: 64, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_Ptr", file: !98, line: 3829, baseType: !99)
!98 = !DIFile(filename: "/home/ubuntu_1604/lichi/package_include_openssl_lib/open-vm-tools/open-vm-tools/lib/include/vm_atomic.h", directory: "/home/lichi/Desktop/open-vm-tools/line496")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint64", file: !98, line: 139, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint64", file: !98, line: 137, size: 64, align: 64, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !98, line: 138, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !29, line: 171, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 55, baseType: !95)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "acquireStatsMem", scope: !20, file: !21, line: 31, baseType: !97, size: 64, align: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "refCount", scope: !20, file: !21, line: 32, baseType: !108, size: 32, align: 32, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "Atomic_uint32", file: !98, line: 135, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Atomic_uint32", file: !98, line: 133, size: 32, align: 32, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !109, file: !98, line: 134, baseType: !112, size: 32, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vmmLock", scope: !20, file: !21, line: 45, baseType: !114, size: 64, align: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "MX_MutexRec", file: !19, line: 327, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !31, line: 122, baseType: !95)
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!120 = distinct !DISubprogram(name: "MXUser_EnableStatsRecLock", scope: !21, file: !21, line: 139, type: !121, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !17, !123, !123}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bool", file: !29, line: 230, baseType: !35)
!124 = !{}
!125 = !DILocalVariable(name: "lock", arg: 1, scope: !120, file: !21, line: 139, type: !17)
!126 = !DIExpression()
!127 = !DILocation(line: 139, column: 42, scope: !120)
!128 = !DILocalVariable(name: "trackAcquisitionTime", arg: 2, scope: !120, file: !21, line: 140, type: !123)
!129 = !DILocation(line: 140, column: 32, scope: !120)
!130 = !DILocalVariable(name: "trackHeldTime", arg: 3, scope: !120, file: !21, line: 141, type: !123)
!131 = !DILocation(line: 141, column: 32, scope: !120)
!132 = !DILocation(line: 144, column: 26, scope: !120)
!133 = !DILocation(line: 144, column: 32, scope: !120)
!134 = !DILocation(line: 144, column: 4, scope: !120)
!135 = !DILocation(line: 151, column: 4, scope: !120)
!136 = distinct !DISubprogram(name: "MXUserValidateHeader", scope: !4, file: !4, line: 507, type: !137, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !139, !140}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserObjectType", file: !4, line: 450, baseType: !3)
!141 = !DILocalVariable(name: "header", arg: 1, scope: !136, file: !4, line: 507, type: !139)
!142 = !DILocation(line: 507, column: 36, scope: !136)
!143 = !DILocalVariable(name: "objectType", arg: 2, scope: !136, file: !4, line: 508, type: !140)
!144 = !DILocation(line: 508, column: 39, scope: !136)
!145 = !DILocation(line: 510, column: 4, scope: !136)
!146 = distinct !DISubprogram(name: "MXUser_DisableStatsRecLock", scope: !21, file: !21, line: 173, type: !147, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!147 = !DISubroutineType(types: !148)
!148 = !{!123, !17}
!149 = !DILocalVariable(name: "lock", arg: 1, scope: !146, file: !21, line: 173, type: !17)
!150 = !DILocation(line: 173, column: 43, scope: !146)
!151 = !DILocation(line: 176, column: 26, scope: !146)
!152 = !DILocation(line: 176, column: 32, scope: !146)
!153 = !DILocation(line: 176, column: 4, scope: !146)
!154 = !DILocation(line: 182, column: 4, scope: !146)
!155 = distinct !DISubprogram(name: "MXUser_SetContentionRatioFloorRecLock", scope: !21, file: !21, line: 204, type: !156, isLocal: false, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!156 = !DISubroutineType(types: !157)
!157 = !{!123, !17, !158}
!158 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!159 = !DILocalVariable(name: "lock", arg: 1, scope: !155, file: !21, line: 204, type: !17)
!160 = !DILocation(line: 204, column: 54, scope: !155)
!161 = !DILocalVariable(name: "ratio", arg: 2, scope: !155, file: !21, line: 205, type: !158)
!162 = !DILocation(line: 205, column: 46, scope: !155)
!163 = !DILocalVariable(name: "result", scope: !155, file: !21, line: 207, type: !123)
!164 = !DILocation(line: 207, column: 9, scope: !155)
!165 = !DILocation(line: 210, column: 26, scope: !155)
!166 = !DILocation(line: 210, column: 32, scope: !155)
!167 = !DILocation(line: 210, column: 4, scope: !155)
!168 = !DILocation(line: 215, column: 14, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !21, line: 214, column: 11)
!170 = distinct !DILexicalBlock(scope: !155, file: !21, line: 212, column: 8)
!171 = !DILocation(line: 218, column: 11, scope: !155)
!172 = !DILocation(line: 218, column: 4, scope: !155)
!173 = distinct !DISubprogram(name: "MXUser_SetContentionCountFloorRecLock", scope: !21, file: !21, line: 240, type: !174, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!174 = !DISubroutineType(types: !175)
!175 = !{!123, !17, !104}
!176 = !DILocalVariable(name: "lock", arg: 1, scope: !173, file: !21, line: 240, type: !17)
!177 = !DILocation(line: 240, column: 54, scope: !173)
!178 = !DILocalVariable(name: "count", arg: 2, scope: !173, file: !21, line: 241, type: !104)
!179 = !DILocation(line: 241, column: 46, scope: !173)
!180 = !DILocalVariable(name: "result", scope: !173, file: !21, line: 243, type: !123)
!181 = !DILocation(line: 243, column: 9, scope: !173)
!182 = !DILocation(line: 246, column: 26, scope: !173)
!183 = !DILocation(line: 246, column: 32, scope: !173)
!184 = !DILocation(line: 246, column: 4, scope: !173)
!185 = !DILocation(line: 251, column: 14, scope: !186)
!186 = distinct !DILexicalBlock(scope: !187, file: !21, line: 250, column: 11)
!187 = distinct !DILexicalBlock(scope: !173, file: !21, line: 248, column: 8)
!188 = !DILocation(line: 254, column: 11, scope: !173)
!189 = !DILocation(line: 254, column: 4, scope: !173)
!190 = distinct !DISubprogram(name: "MXUser_SetContentionDurationFloorRecLock", scope: !21, file: !21, line: 276, type: !174, isLocal: false, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!191 = !DILocalVariable(name: "lock", arg: 1, scope: !190, file: !21, line: 276, type: !17)
!192 = !DILocation(line: 276, column: 57, scope: !190)
!193 = !DILocalVariable(name: "duration", arg: 2, scope: !190, file: !21, line: 277, type: !104)
!194 = !DILocation(line: 277, column: 49, scope: !190)
!195 = !DILocalVariable(name: "result", scope: !190, file: !21, line: 279, type: !123)
!196 = !DILocation(line: 279, column: 9, scope: !190)
!197 = !DILocation(line: 282, column: 26, scope: !190)
!198 = !DILocation(line: 282, column: 32, scope: !190)
!199 = !DILocation(line: 282, column: 4, scope: !190)
!200 = !DILocation(line: 288, column: 14, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !21, line: 287, column: 11)
!202 = distinct !DILexicalBlock(scope: !190, file: !21, line: 284, column: 8)
!203 = !DILocation(line: 291, column: 11, scope: !190)
!204 = !DILocation(line: 291, column: 4, scope: !190)
!205 = distinct !DISubprogram(name: "MXUser_CreateRecLock", scope: !21, file: !21, line: 355, type: !206, isLocal: false, isDefinition: true, scopeLine: 357, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!206 = !DISubroutineType(types: !207)
!207 = !{!17, !208, !37}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!210 = !DILocalVariable(name: "userName", arg: 1, scope: !205, file: !21, line: 355, type: !208)
!211 = !DILocation(line: 355, column: 34, scope: !205)
!212 = !DILocalVariable(name: "rank", arg: 2, scope: !205, file: !21, line: 356, type: !37)
!213 = !DILocation(line: 356, column: 30, scope: !205)
!214 = !DILocalVariable(name: "statsMode", scope: !205, file: !21, line: 358, type: !28)
!215 = !DILocation(line: 358, column: 11, scope: !205)
!216 = !DILocalVariable(name: "properName", scope: !205, file: !21, line: 359, type: !34)
!217 = !DILocation(line: 359, column: 10, scope: !205)
!218 = !DILocalVariable(name: "lock", scope: !205, file: !21, line: 360, type: !17)
!219 = !DILocation(line: 360, column: 19, scope: !205)
!220 = !DILocation(line: 360, column: 26, scope: !205)
!221 = !DILocation(line: 362, column: 8, scope: !222)
!222 = distinct !DILexicalBlock(scope: !205, file: !21, line: 362, column: 8)
!223 = !DILocation(line: 362, column: 17, scope: !222)
!224 = !DILocation(line: 362, column: 8, scope: !205)
!225 = !DILocation(line: 363, column: 50, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !21, line: 362, column: 25)
!227 = !DILocation(line: 363, column: 20, scope: !228)
!228 = !DILexicalBlockFile(scope: !226, file: !21, discriminator: 1)
!229 = !DILocation(line: 363, column: 18, scope: !226)
!230 = !DILocation(line: 364, column: 4, scope: !226)
!231 = !DILocation(line: 365, column: 37, scope: !232)
!232 = distinct !DILexicalBlock(scope: !222, file: !21, line: 364, column: 11)
!233 = !DILocation(line: 365, column: 20, scope: !232)
!234 = !DILocation(line: 365, column: 18, scope: !232)
!235 = !DILocation(line: 368, column: 42, scope: !236)
!236 = distinct !DILexicalBlock(scope: !205, file: !21, line: 368, column: 8)
!237 = !DILocation(line: 368, column: 48, scope: !236)
!238 = !DILocation(line: 368, column: 27, scope: !236)
!239 = !DILocation(line: 368, column: 26, scope: !236)
!240 = !DILocation(line: 368, column: 25, scope: !236)
!241 = !DILocation(line: 368, column: 8, scope: !236)
!242 = !DILocation(line: 368, column: 8, scope: !205)
!243 = !DILocation(line: 369, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !236, file: !21, line: 368, column: 69)
!245 = !DILocation(line: 372, column: 4, scope: !205)
!246 = !DILocation(line: 372, column: 10, scope: !205)
!247 = !DILocation(line: 372, column: 18, scope: !205)
!248 = !DILocation(line: 373, column: 20, scope: !205)
!249 = !DILocation(line: 373, column: 26, scope: !205)
!250 = !DILocation(line: 373, column: 4, scope: !205)
!251 = !DILocation(line: 375, column: 29, scope: !205)
!252 = !DILocation(line: 375, column: 4, scope: !205)
!253 = !DILocation(line: 375, column: 10, scope: !205)
!254 = !DILocation(line: 375, column: 17, scope: !205)
!255 = !DILocation(line: 375, column: 27, scope: !205)
!256 = !DILocation(line: 376, column: 24, scope: !205)
!257 = !DILocation(line: 376, column: 4, scope: !205)
!258 = !DILocation(line: 376, column: 10, scope: !205)
!259 = !DILocation(line: 376, column: 17, scope: !205)
!260 = !DILocation(line: 376, column: 22, scope: !205)
!261 = !DILocation(line: 377, column: 24, scope: !205)
!262 = !DILocation(line: 377, column: 4, scope: !205)
!263 = !DILocation(line: 377, column: 10, scope: !205)
!264 = !DILocation(line: 377, column: 17, scope: !205)
!265 = !DILocation(line: 377, column: 22, scope: !205)
!266 = !DILocation(line: 378, column: 37, scope: !205)
!267 = !DILocation(line: 378, column: 4, scope: !205)
!268 = !DILocation(line: 378, column: 10, scope: !205)
!269 = !DILocation(line: 378, column: 17, scope: !205)
!270 = !DILocation(line: 378, column: 22, scope: !205)
!271 = !DILocation(line: 378, column: 35, scope: !205)
!272 = !DILocation(line: 379, column: 4, scope: !205)
!273 = !DILocation(line: 379, column: 10, scope: !205)
!274 = !DILocation(line: 379, column: 17, scope: !205)
!275 = !DILocation(line: 379, column: 26, scope: !205)
!276 = !DILocation(line: 381, column: 16, scope: !205)
!277 = !DILocation(line: 381, column: 14, scope: !205)
!278 = !DILocation(line: 383, column: 12, scope: !205)
!279 = !DILocation(line: 383, column: 4, scope: !205)
!280 = !DILocation(line: 385, column: 27, scope: !281)
!281 = distinct !DILexicalBlock(scope: !205, file: !21, line: 383, column: 23)
!282 = !DILocation(line: 385, column: 33, scope: !281)
!283 = !DILocation(line: 385, column: 51, scope: !281)
!284 = !DILocation(line: 385, column: 57, scope: !281)
!285 = !DILocation(line: 385, column: 7, scope: !281)
!286 = !DILocation(line: 386, column: 7, scope: !281)
!287 = !DILocation(line: 386, column: 13, scope: !281)
!288 = !DILocation(line: 386, column: 20, scope: !281)
!289 = !DILocation(line: 386, column: 30, scope: !281)
!290 = !DILocation(line: 387, column: 7, scope: !281)
!291 = !DILocation(line: 390, column: 26, scope: !281)
!292 = !DILocation(line: 390, column: 32, scope: !281)
!293 = !DILocation(line: 390, column: 7, scope: !281)
!294 = !DILocation(line: 391, column: 7, scope: !281)
!295 = !DILocation(line: 391, column: 13, scope: !281)
!296 = !DILocation(line: 391, column: 20, scope: !281)
!297 = !DILocation(line: 391, column: 30, scope: !281)
!298 = !DILocation(line: 392, column: 7, scope: !281)
!299 = !DILocation(line: 395, column: 26, scope: !281)
!300 = !DILocation(line: 395, column: 32, scope: !281)
!301 = !DILocation(line: 395, column: 50, scope: !281)
!302 = !DILocation(line: 395, column: 56, scope: !281)
!303 = !DILocation(line: 395, column: 7, scope: !281)
!304 = !DILocation(line: 396, column: 7, scope: !281)
!305 = !DILocation(line: 396, column: 13, scope: !281)
!306 = !DILocation(line: 396, column: 20, scope: !281)
!307 = !DILocation(line: 396, column: 30, scope: !281)
!308 = !DILocation(line: 397, column: 7, scope: !281)
!309 = !DILocation(line: 400, column: 60, scope: !281)
!310 = !DILocation(line: 400, column: 7, scope: !281)
!311 = !DILocation(line: 403, column: 21, scope: !205)
!312 = !DILocation(line: 403, column: 27, scope: !205)
!313 = !DILocation(line: 403, column: 4, scope: !205)
!314 = !DILocation(line: 405, column: 11, scope: !205)
!315 = !DILocation(line: 405, column: 4, scope: !205)
!316 = distinct !DISubprogram(name: "MXRecLockInit", scope: !4, file: !4, line: 264, type: !317, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!317 = !DISubroutineType(types: !318)
!318 = !{!123, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!320 = !DILocalVariable(name: "lock", arg: 1, scope: !316, file: !4, line: 264, type: !319)
!321 = !DILocation(line: 264, column: 26, scope: !316)
!322 = !DILocalVariable(name: "success", scope: !316, file: !4, line: 266, type: !123)
!323 = !DILocation(line: 266, column: 9, scope: !316)
!324 = !DILocation(line: 266, column: 44, scope: !316)
!325 = !DILocation(line: 266, column: 20, scope: !316)
!326 = !DILocation(line: 266, column: 50, scope: !316)
!327 = !DILocation(line: 266, column: 19, scope: !316)
!328 = !DILocation(line: 268, column: 8, scope: !329)
!329 = distinct !DILexicalBlock(scope: !316, file: !4, line: 268, column: 8)
!330 = !DILocation(line: 268, column: 8, scope: !316)
!331 = !DILocation(line: 269, column: 27, scope: !332)
!332 = distinct !DILexicalBlock(scope: !329, file: !4, line: 268, column: 17)
!333 = !DILocation(line: 269, column: 7, scope: !332)
!334 = !DILocation(line: 271, column: 7, scope: !332)
!335 = !DILocation(line: 271, column: 13, scope: !332)
!336 = !DILocation(line: 271, column: 28, scope: !332)
!337 = !DILocation(line: 272, column: 4, scope: !332)
!338 = !DILocation(line: 274, column: 11, scope: !316)
!339 = !DILocation(line: 274, column: 4, scope: !316)
!340 = distinct !DISubprogram(name: "Atomic_Write32", scope: !98, file: !98, line: 1037, type: !341, isLocal: true, isDefinition: true, scopeLine: 1039, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !343, !28}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!344 = !DILocalVariable(name: "var", arg: 1, scope: !340, file: !98, line: 1037, type: !343)
!345 = !DILocation(line: 1037, column: 31, scope: !340)
!346 = !DILocalVariable(name: "val", arg: 2, scope: !340, file: !98, line: 1038, type: !28)
!347 = !DILocation(line: 1038, column: 23, scope: !340)
!348 = !DILocation(line: 1083, column: 15, scope: !340)
!349 = !DILocation(line: 1083, column: 20, scope: !340)
!350 = !DILocation(line: 1084, column: 14, scope: !340)
!351 = !DILocation(line: 1081, column: 4, scope: !340)
!352 = !{i32 125784}
!353 = !DILocation(line: 1098, column: 1, scope: !340)
!354 = distinct !DISubprogram(name: "MXUserDumpRecLock", scope: !21, file: !21, line: 312, type: !355, isLocal: true, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !139}
!357 = !DILocalVariable(name: "header", arg: 1, scope: !354, file: !21, line: 312, type: !139)
!358 = !DILocation(line: 312, column: 33, scope: !354)
!359 = !DILocalVariable(name: "lock", scope: !354, file: !21, line: 314, type: !17)
!360 = !DILocation(line: 314, column: 19, scope: !354)
!361 = !DILocation(line: 314, column: 44, scope: !354)
!362 = !DILocation(line: 314, column: 26, scope: !354)
!363 = !DILocation(line: 316, column: 55, scope: !354)
!364 = !DILocation(line: 316, column: 4, scope: !354)
!365 = !DILocation(line: 318, column: 34, scope: !354)
!366 = !DILocation(line: 318, column: 40, scope: !354)
!367 = !DILocation(line: 318, column: 47, scope: !354)
!368 = !DILocation(line: 318, column: 4, scope: !354)
!369 = !DILocation(line: 319, column: 27, scope: !354)
!370 = !DILocation(line: 319, column: 33, scope: !354)
!371 = !DILocation(line: 319, column: 40, scope: !354)
!372 = !DILocation(line: 319, column: 4, scope: !354)
!373 = !DILocation(line: 320, column: 29, scope: !354)
!374 = !DILocation(line: 320, column: 35, scope: !354)
!375 = !DILocation(line: 320, column: 42, scope: !354)
!376 = !DILocation(line: 320, column: 4, scope: !354)
!377 = !DILocation(line: 321, column: 36, scope: !354)
!378 = !DILocation(line: 321, column: 42, scope: !354)
!379 = !DILocation(line: 321, column: 49, scope: !354)
!380 = !DILocation(line: 321, column: 54, scope: !354)
!381 = !DILocation(line: 321, column: 4, scope: !354)
!382 = !DILocation(line: 322, column: 53, scope: !354)
!383 = !DILocation(line: 322, column: 59, scope: !354)
!384 = !DILocation(line: 322, column: 38, scope: !354)
!385 = !DILocation(line: 322, column: 4, scope: !386)
!386 = !DILexicalBlockFile(scope: !354, file: !21, discriminator: 1)
!387 = !DILocation(line: 324, column: 8, scope: !388)
!388 = distinct !DILexicalBlock(scope: !354, file: !21, line: 324, column: 8)
!389 = !DILocation(line: 324, column: 14, scope: !388)
!390 = !DILocation(line: 324, column: 22, scope: !388)
!391 = !DILocation(line: 324, column: 8, scope: !354)
!392 = !DILocation(line: 325, column: 52, scope: !393)
!393 = distinct !DILexicalBlock(scope: !388, file: !21, line: 324, column: 30)
!394 = !DILocation(line: 325, column: 58, scope: !393)
!395 = !DILocation(line: 325, column: 36, scope: !393)
!396 = !DILocation(line: 325, column: 7, scope: !397)
!397 = !DILexicalBlockFile(scope: !393, file: !21, discriminator: 1)
!398 = !DILocation(line: 328, column: 16, scope: !393)
!399 = !DILocation(line: 328, column: 22, scope: !393)
!400 = !DILocation(line: 328, column: 36, scope: !393)
!401 = !DILocation(line: 327, column: 7, scope: !393)
!402 = !DILocation(line: 329, column: 4, scope: !393)
!403 = !DILocation(line: 330, column: 33, scope: !404)
!404 = distinct !DILexicalBlock(scope: !388, file: !21, line: 329, column: 11)
!405 = !DILocation(line: 330, column: 39, scope: !404)
!406 = !DILocation(line: 330, column: 7, scope: !404)
!407 = !DILocation(line: 332, column: 1, scope: !354)
!408 = distinct !DISubprogram(name: "MXUserStatsActionRec", scope: !21, file: !21, line: 66, type: !355, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !124)
!409 = !DILocalVariable(name: "header", arg: 1, scope: !408, file: !21, line: 66, type: !139)
!410 = !DILocation(line: 66, column: 36, scope: !408)
!411 = !DILocalVariable(name: "lock", scope: !408, file: !21, line: 68, type: !17)
!412 = !DILocation(line: 68, column: 19, scope: !408)
!413 = !DILocation(line: 68, column: 44, scope: !408)
!414 = !DILocation(line: 68, column: 26, scope: !408)
!415 = !DILocalVariable(name: "heldStats", scope: !408, file: !21, line: 69, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserHeldStats", file: !4, line: 569, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 564, size: 512, align: 64, elements: !419)
!419 = !{!420, !424, !434}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "holdStart", scope: !418, file: !4, line: 566, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "VmTimeType", file: !29, line: 354, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !29, line: 172, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !31, line: 40, baseType: !90)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !4, line: 567, baseType: !425, size: 384, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserBasicStats", file: !4, line: 539, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 532, size: 384, align: 64, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "typeName", scope: !426, file: !4, line: 533, baseType: !34, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "numSamples", scope: !426, file: !4, line: 534, baseType: !104, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "minTime", scope: !426, file: !4, line: 535, baseType: !104, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "maxTime", scope: !426, file: !4, line: 536, baseType: !104, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "timeSum", scope: !426, file: !4, line: 537, baseType: !104, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "timeSquaredSum", scope: !426, file: !4, line: 538, baseType: !158, size: 64, align: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !418, file: !4, line: 568, baseType: !97, size: 64, align: 64, offset: 448)
!435 = !DILocation(line: 69, column: 21, scope: !408)
!436 = !DILocation(line: 69, column: 49, scope: !408)
!437 = !DILocation(line: 69, column: 55, scope: !408)
!438 = !DILocation(line: 69, column: 33, scope: !408)
!439 = !DILocalVariable(name: "acquireStats", scope: !408, file: !21, line: 70, type: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquireStats", file: !4, line: 562, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 558, size: 960, align: 64, elements: !443)
!443 = !{!444, !457}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !4, line: 560, baseType: !445, size: 896, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "MXUserAcquisitionStats", file: !4, line: 552, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 541, size: 896, align: 64, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "contentionRatioFloor", scope: !446, file: !4, line: 542, baseType: !158, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "contentionCountFloor", scope: !446, file: !4, line: 543, baseType: !104, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "contentionDurationFloor", scope: !446, file: !4, line: 544, baseType: !104, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "numAttempts", scope: !446, file: !4, line: 545, baseType: !104, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccesses", scope: !446, file: !4, line: 546, baseType: !104, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "numSuccessesContended", scope: !446, file: !4, line: 547, baseType: !104, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "successContentionTime", scope: !446, file: !4, line: 548, baseType: !104, size: 64, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "totalContentionTime", scope: !446, file: !4, line: 549, baseType: !104, size: 64, align: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "basicStats", scope: !446, file: !4, line: 551, baseType: !425, size: 384, align: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "histo", scope: !442, file: !4, line: 561, baseType: !97, size: 64, align: 64, offset: 896)
!458 = !DILocation(line: 70, column: 24, scope: !408)
!459 = !DILocation(line: 70, column: 55, scope: !408)
!460 = !DILocation(line: 70, column: 61, scope: !408)
!461 = !DILocation(line: 70, column: 39, scope: !408)
!462 = !DILocation(line: 72, column: 26, scope: !463)
!463 = distinct !DILexicalBlock(scope: !408, file: !21, line: 72, column: 8)
!464 = !DILocation(line: 72, column: 36, scope: !463)
!465 = !DILocation(line: 72, column: 25, scope: !463)
!466 = !DILocation(line: 72, column: 8, scope: !463)
!467 = !DILocation(line: 72, column: 8, scope: !408)
!468 = !DILocation(line: 73, column: 29, scope: !469)
!469 = distinct !DILexicalBlock(scope: !463, file: !21, line: 72, column: 14)
!470 = !DILocation(line: 73, column: 40, scope: !469)
!471 = !DILocation(line: 73, column: 46, scope: !469)
!472 = !DILocation(line: 73, column: 7, scope: !469)
!473 = !DILocation(line: 75, column: 27, scope: !474)
!474 = distinct !DILexicalBlock(scope: !469, file: !21, line: 75, column: 11)
!475 = !DILocation(line: 75, column: 38, scope: !474)
!476 = !DILocation(line: 75, column: 11, scope: !474)
!477 = !DILocation(line: 75, column: 45, scope: !474)
!478 = !DILocation(line: 75, column: 11, scope: !469)
!479 = !DILocation(line: 76, column: 42, scope: !480)
!480 = distinct !DILexicalBlock(scope: !474, file: !21, line: 75, column: 53)
!481 = !DILocation(line: 76, column: 53, scope: !480)
!482 = !DILocation(line: 76, column: 26, scope: !480)
!483 = !DILocation(line: 76, column: 61, scope: !480)
!484 = !DILocation(line: 76, column: 10, scope: !485)
!485 = !DILexicalBlockFile(scope: !480, file: !21, discriminator: 1)
!486 = !DILocation(line: 77, column: 7, scope: !480)
!487 = !DILocation(line: 78, column: 4, scope: !469)
!488 = !DILocation(line: 80, column: 28, scope: !489)
!489 = distinct !DILexicalBlock(scope: !408, file: !21, line: 80, column: 8)
!490 = !DILocation(line: 80, column: 41, scope: !489)
!491 = !DILocation(line: 80, column: 26, scope: !489)
!492 = !DILocation(line: 80, column: 25, scope: !489)
!493 = !DILocation(line: 80, column: 8, scope: !489)
!494 = !DILocation(line: 80, column: 8, scope: !408)
!495 = !DILocalVariable(name: "isHot", scope: !496, file: !21, line: 81, type: !123)
!496 = distinct !DILexicalBlock(scope: !489, file: !21, line: 80, column: 14)
!497 = !DILocation(line: 81, column: 12, scope: !496)
!498 = !DILocalVariable(name: "doLog", scope: !496, file: !21, line: 82, type: !123)
!499 = !DILocation(line: 82, column: 12, scope: !496)
!500 = !DILocalVariable(name: "contentionRatio", scope: !496, file: !21, line: 83, type: !158)
!501 = !DILocation(line: 83, column: 14, scope: !496)
!502 = !DILocation(line: 89, column: 35, scope: !496)
!503 = !DILocation(line: 89, column: 49, scope: !496)
!504 = !DILocation(line: 89, column: 55, scope: !496)
!505 = !DILocation(line: 89, column: 7, scope: !496)
!506 = !DILocation(line: 91, column: 27, scope: !507)
!507 = distinct !DILexicalBlock(scope: !496, file: !21, line: 91, column: 11)
!508 = !DILocation(line: 91, column: 41, scope: !507)
!509 = !DILocation(line: 91, column: 11, scope: !507)
!510 = !DILocation(line: 91, column: 48, scope: !507)
!511 = !DILocation(line: 91, column: 11, scope: !496)
!512 = !DILocation(line: 92, column: 42, scope: !513)
!513 = distinct !DILexicalBlock(scope: !507, file: !21, line: 91, column: 56)
!514 = !DILocation(line: 92, column: 56, scope: !513)
!515 = !DILocation(line: 92, column: 26, scope: !513)
!516 = !DILocation(line: 92, column: 64, scope: !513)
!517 = !DILocation(line: 92, column: 10, scope: !518)
!518 = !DILexicalBlockFile(scope: !513, file: !21, discriminator: 1)
!519 = !DILocation(line: 93, column: 7, scope: !513)
!520 = !DILocation(line: 99, column: 22, scope: !496)
!521 = !DILocation(line: 99, column: 36, scope: !496)
!522 = !DILocation(line: 99, column: 7, scope: !496)
!523 = !DILocation(line: 101, column: 29, scope: !524)
