; ModuleID = './line326-fe-sasl.o.i'
source_filename = "./line326-fe-sasl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!143 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!144 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !{!193, !200}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !194, line: 9, baseType: !195)
!194 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !198, !198, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !{i32 2, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!204 = distinct !DISubprogram(name: "fe_sasl_init", scope: !205, file: !205, line: 43, type: !206, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !208)
!205 = !DIFile(filename: "fe-sasl.c", directory: "/home/lichi/Desktop/irssi/task1")
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !{}
!209 = !DILocation(line: 45, column: 2, scope: !204)
!210 = !DILocation(line: 46, column: 2, scope: !204)
!211 = !DILocation(line: 47, column: 1, scope: !204)
!212 = distinct !DISubprogram(name: "sig_sasl_success", scope: !205, file: !205, line: 33, type: !213, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !208)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !217, line: 6, baseType: !218)
!217 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !219, line: 42, size: 39168, align: 64, elements: !220)
!219 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!220 = !{!221, !224, !225, !226, !471, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !489, !493, !494, !495, !499, !504, !505, !506, !507, !508, !509, !510, !511, !518, !519, !520, !521, !522, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !846, !848}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !218, file: !222, line: 3, baseType: !223, size: 32, align: 32)
!222 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!223 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !218, file: !222, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !218, file: !222, line: 6, baseType: !223, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !218, file: !222, line: 8, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !217, line: 5, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !219, line: 24, size: 2496, align: 64, elements: !230)
!230 = !{!231, !233, !234, !235, !238, !239, !240, !241, !242, !244, !245, !246, !247, !248, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !232, line: 3, baseType: !223, size: 32, align: 32)
!232 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!233 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !229, file: !232, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !229, file: !232, line: 6, baseType: !223, size: 32, align: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !229, file: !232, line: 9, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !229, file: !232, line: 10, baseType: !223, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !229, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !229, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !229, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !229, file: !232, line: 13, baseType: !243, size: 16, align: 16, offset: 448)
!243 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !229, file: !232, line: 14, baseType: !236, size: 64, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !229, file: !232, line: 15, baseType: !236, size: 64, align: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !229, file: !232, line: 16, baseType: !223, size: 32, align: 32, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !229, file: !232, line: 17, baseType: !236, size: 64, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !229, file: !232, line: 19, baseType: !249, size: 64, align: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !251, line: 99, baseType: !252)
!251 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !251, line: 99, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !229, file: !232, line: 19, baseType: !249, size: 64, align: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !229, file: !232, line: 21, baseType: !236, size: 64, align: 64, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !229, file: !232, line: 22, baseType: !236, size: 64, align: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !229, file: !232, line: 23, baseType: !236, size: 64, align: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !229, file: !232, line: 24, baseType: !236, size: 64, align: 64, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !229, file: !232, line: 26, baseType: !236, size: 64, align: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !229, file: !232, line: 27, baseType: !236, size: 64, align: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !229, file: !232, line: 28, baseType: !236, size: 64, align: 64, offset: 1280)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !229, file: !232, line: 29, baseType: !236, size: 64, align: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !229, file: !232, line: 30, baseType: !236, size: 64, align: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !229, file: !232, line: 31, baseType: !236, size: 64, align: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !229, file: !232, line: 32, baseType: !236, size: 64, align: 64, offset: 1536)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !229, file: !232, line: 33, baseType: !236, size: 64, align: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !229, file: !232, line: 35, baseType: !267, size: 64, align: 64, offset: 1664)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !270)
!270 = !{!271, !274, !416, !417, !422, !423, !424, !425, !426, !435, !436, !437, !441, !442, !443, !444, !445, !446, !447, !448}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !269, file: !4, line: 100, baseType: !272, size: 32, align: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !273, line: 49, baseType: !223)
!273 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !269, file: !4, line: 101, baseType: !275, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !278)
!278 = !{!279, !303, !309, !316, !320, !403, !407, !412}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !277, file: !4, line: 133, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !267, !284, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !273, line: 46, baseType: !237)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !287, line: 66, baseType: !288)
!287 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!288 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !293, line: 42, baseType: !294)
!293 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !293, line: 44, size: 128, align: 64, elements: !295)
!295 = !{!296, !301, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !294, file: !293, line: 46, baseType: !297, size: 32, align: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !298, line: 36, baseType: !299)
!298 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !287, line: 45, baseType: !300)
!300 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !294, file: !293, line: 47, baseType: !272, size: 32, align: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !294, file: !293, line: 48, baseType: !284, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !277, file: !4, line: 138, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!283, !267, !307, !286, !289, !290}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !277, file: !4, line: 143, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!283, !267, !313, !315, !290}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !287, line: 51, baseType: !314)
!314 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !277, file: !4, line: 147, baseType: !317, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!283, !267, !290}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !277, file: !4, line: 149, baseType: !321, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!324, !267, !402}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !327)
!327 = !{!328, !330, !351, !378, !380, !384, !385, !386, !387, !395, !396, !397, !398}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !326, file: !16, line: 174, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !273, line: 77, baseType: !200)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !326, file: !16, line: 175, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !334)
!334 = !{!335, !339, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !333, file: !16, line: 198, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !329}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !333, file: !16, line: 199, baseType: !336, size: 64, align: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !333, file: !16, line: 200, baseType: !341, size: 64, align: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !329, !324, !344, !350}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !329}
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !273, line: 50, baseType: !272)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !326, file: !16, line: 177, baseType: !352, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !356)
!356 = !{!357, !362, !366, !370, !374, !375}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !355, file: !16, line: 216, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!349, !324, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !355, file: !16, line: 218, baseType: !363, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!349, !324}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !355, file: !16, line: 219, baseType: !367, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!349, !324, !345, !329}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !355, file: !16, line: 222, baseType: !371, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !324}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !355, file: !16, line: 226, baseType: !345, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !355, file: !16, line: 227, baseType: !376, size: 64, align: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !326, file: !16, line: 178, baseType: !379, size: 32, align: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !273, line: 55, baseType: !300)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !326, file: !16, line: 180, baseType: !381, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !326, file: !16, line: 182, baseType: !272, size: 32, align: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !16, line: 183, baseType: !379, size: 32, align: 32, offset: 352)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !326, file: !16, line: 184, baseType: !379, size: 32, align: 32, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !326, file: !16, line: 186, baseType: !388, size: 64, align: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !390, line: 37, baseType: !391)
!390 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !390, line: 39, size: 128, align: 64, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !391, file: !390, line: 41, baseType: !329, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !390, line: 42, baseType: !388, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !326, file: !16, line: 188, baseType: !324, size: 64, align: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !16, line: 189, baseType: !324, size: 64, align: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !16, line: 191, baseType: !236, size: 64, align: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !326, file: !16, line: 193, baseType: !399, size: 64, align: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !277, file: !4, line: 151, baseType: !404, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !267}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !277, file: !4, line: 152, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!283, !267, !411, !290}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !277, file: !4, line: 155, baseType: !413, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!411, !267}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !269, file: !4, line: 103, baseType: !284, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !269, file: !4, line: 104, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !419, line: 77, baseType: !420)
!419 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !419, line: 77, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !269, file: !4, line: 105, baseType: !418, size: 64, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !269, file: !4, line: 106, baseType: !284, size: 64, align: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !269, file: !4, line: 107, baseType: !379, size: 32, align: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !269, file: !4, line: 109, baseType: !286, size: 64, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !269, file: !4, line: 110, baseType: !427, size: 64, align: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !429, line: 39, baseType: !430)
!429 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !429, line: 41, size: 192, align: 64, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !430, file: !429, line: 43, baseType: !284, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !430, file: !429, line: 44, baseType: !286, size: 64, align: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !430, file: !429, line: 45, baseType: !286, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !269, file: !4, line: 111, baseType: !427, size: 64, align: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !269, file: !4, line: 112, baseType: !427, size: 64, align: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !269, file: !4, line: 113, baseType: !438, size: 48, align: 8, offset: 704)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 48, align: 8, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 6)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !269, file: !4, line: 117, baseType: !379, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !269, file: !4, line: 118, baseType: !379, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !269, file: !4, line: 119, baseType: !379, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !269, file: !4, line: 120, baseType: !379, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !269, file: !4, line: 121, baseType: !379, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !269, file: !4, line: 122, baseType: !379, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !269, file: !4, line: 124, baseType: !329, size: 64, align: 64, offset: 768)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !269, file: !4, line: 125, baseType: !329, size: 64, align: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !229, file: !232, line: 38, baseType: !300, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !229, file: !232, line: 39, baseType: !300, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !229, file: !232, line: 40, baseType: !300, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !229, file: !232, line: 41, baseType: !300, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !229, file: !232, line: 42, baseType: !300, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !229, file: !232, line: 43, baseType: !300, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !229, file: !232, line: 44, baseType: !300, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !229, file: !232, line: 45, baseType: !300, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !229, file: !232, line: 46, baseType: !236, size: 64, align: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !229, file: !232, line: 47, baseType: !236, size: 64, align: 64, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !229, file: !219, line: 27, baseType: !236, size: 64, align: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !229, file: !219, line: 28, baseType: !236, size: 64, align: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !229, file: !219, line: 30, baseType: !223, size: 32, align: 32, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !229, file: !219, line: 31, baseType: !236, size: 64, align: 64, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !229, file: !219, line: 32, baseType: !236, size: 64, align: 64, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !229, file: !219, line: 34, baseType: !223, size: 32, align: 32, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !229, file: !219, line: 35, baseType: !223, size: 32, align: 32, offset: 2272)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !229, file: !219, line: 36, baseType: !223, size: 32, align: 32, offset: 2304)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !229, file: !219, line: 38, baseType: !223, size: 32, align: 32, offset: 2336)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !229, file: !219, line: 38, baseType: !223, size: 32, align: 32, offset: 2368)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !229, file: !219, line: 38, baseType: !223, size: 32, align: 32, offset: 2400)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !229, file: !219, line: 38, baseType: !223, size: 32, align: 32, offset: 2432)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !218, file: !222, line: 9, baseType: !472, size: 64, align: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !473, line: 75, baseType: !474)
!473 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !475, line: 139, baseType: !314)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !218, file: !222, line: 10, baseType: !472, size: 64, align: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !218, file: !222, line: 12, baseType: !236, size: 64, align: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !218, file: !222, line: 13, baseType: !236, size: 64, align: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !218, file: !222, line: 15, baseType: !300, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !218, file: !222, line: 16, baseType: !300, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !218, file: !222, line: 17, baseType: !300, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !218, file: !222, line: 18, baseType: !300, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !218, file: !222, line: 19, baseType: !300, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !218, file: !222, line: 21, baseType: !485, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !251, line: 102, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !251, line: 102, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !218, file: !222, line: 22, baseType: !223, size: 32, align: 32, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !218, file: !222, line: 25, baseType: !490, size: 128, align: 64, offset: 640)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 128, align: 64, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 2)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !218, file: !222, line: 26, baseType: !223, size: 32, align: 32, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !218, file: !222, line: 27, baseType: !223, size: 32, align: 32, offset: 800)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !218, file: !222, line: 29, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !251, line: 103, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !251, line: 103, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !218, file: !222, line: 30, baseType: !500, size: 64, align: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !502, line: 37, baseType: !503)
!502 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !502, line: 37, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !218, file: !222, line: 32, baseType: !236, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !218, file: !222, line: 33, baseType: !236, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !218, file: !222, line: 34, baseType: !236, size: 64, align: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !218, file: !222, line: 35, baseType: !300, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !218, file: !222, line: 36, baseType: !300, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !218, file: !222, line: 37, baseType: !300, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !218, file: !222, line: 38, baseType: !300, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !218, file: !222, line: 40, baseType: !512, size: 128, align: 64, offset: 1216)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !273, line: 504, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !273, line: 506, size: 128, align: 64, elements: !514)
!514 = !{!515, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !513, file: !273, line: 508, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !273, line: 48, baseType: !314)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !513, file: !273, line: 509, baseType: !516, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !218, file: !222, line: 41, baseType: !472, size: 64, align: 64, offset: 1344)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !218, file: !222, line: 42, baseType: !223, size: 32, align: 32, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !218, file: !222, line: 44, baseType: !388, size: 64, align: 64, offset: 1472)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !218, file: !222, line: 45, baseType: !388, size: 64, align: 64, offset: 1536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !218, file: !222, line: 53, baseType: !523, size: 64, align: 64, offset: 1600)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526, !614, !223}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !251, line: 107, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !529, line: 30, size: 2240, align: 64, elements: !530)
!529 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!530 = !{!531, !532, !533, !534, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !610, !616, !620, !624, !629, !722, !729, !733}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !222, line: 3, baseType: !223, size: 32, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !528, file: !222, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !528, file: !222, line: 6, baseType: !223, size: 32, align: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !528, file: !222, line: 8, baseType: !535, size: 64, align: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !251, line: 113, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !529, line: 25, size: 1920, align: 64, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !232, line: 3, baseType: !223, size: 32, align: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !537, file: !232, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !537, file: !232, line: 6, baseType: !223, size: 32, align: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !537, file: !232, line: 9, baseType: !236, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !537, file: !232, line: 10, baseType: !223, size: 32, align: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !537, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !537, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !537, file: !232, line: 11, baseType: !236, size: 64, align: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !537, file: !232, line: 13, baseType: !243, size: 16, align: 16, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !537, file: !232, line: 14, baseType: !236, size: 64, align: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !537, file: !232, line: 15, baseType: !236, size: 64, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !537, file: !232, line: 16, baseType: !223, size: 32, align: 32, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !537, file: !232, line: 17, baseType: !236, size: 64, align: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !537, file: !232, line: 19, baseType: !249, size: 64, align: 64, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !537, file: !232, line: 19, baseType: !249, size: 64, align: 64, offset: 832)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !537, file: !232, line: 21, baseType: !236, size: 64, align: 64, offset: 896)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !537, file: !232, line: 22, baseType: !236, size: 64, align: 64, offset: 960)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !537, file: !232, line: 23, baseType: !236, size: 64, align: 64, offset: 1024)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !537, file: !232, line: 24, baseType: !236, size: 64, align: 64, offset: 1088)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !537, file: !232, line: 26, baseType: !236, size: 64, align: 64, offset: 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !537, file: !232, line: 27, baseType: !236, size: 64, align: 64, offset: 1216)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !537, file: !232, line: 28, baseType: !236, size: 64, align: 64, offset: 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !537, file: !232, line: 29, baseType: !236, size: 64, align: 64, offset: 1344)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !537, file: !232, line: 30, baseType: !236, size: 64, align: 64, offset: 1408)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !537, file: !232, line: 31, baseType: !236, size: 64, align: 64, offset: 1472)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !537, file: !232, line: 32, baseType: !236, size: 64, align: 64, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !537, file: !232, line: 33, baseType: !236, size: 64, align: 64, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !537, file: !232, line: 35, baseType: !267, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !537, file: !232, line: 38, baseType: !300, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !537, file: !232, line: 39, baseType: !300, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !537, file: !232, line: 40, baseType: !300, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !537, file: !232, line: 41, baseType: !300, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !537, file: !232, line: 42, baseType: !300, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !537, file: !232, line: 43, baseType: !300, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !537, file: !232, line: 44, baseType: !300, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !537, file: !232, line: 45, baseType: !300, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !537, file: !232, line: 46, baseType: !236, size: 64, align: 64, offset: 1792)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !537, file: !232, line: 47, baseType: !236, size: 64, align: 64, offset: 1856)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !528, file: !222, line: 9, baseType: !472, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !528, file: !222, line: 10, baseType: !472, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !528, file: !222, line: 12, baseType: !236, size: 64, align: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !528, file: !222, line: 13, baseType: !236, size: 64, align: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !528, file: !222, line: 15, baseType: !300, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !528, file: !222, line: 16, baseType: !300, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !528, file: !222, line: 17, baseType: !300, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !528, file: !222, line: 18, baseType: !300, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !528, file: !222, line: 19, baseType: !300, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !528, file: !222, line: 21, baseType: !485, size: 64, align: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !528, file: !222, line: 22, baseType: !223, size: 32, align: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !528, file: !222, line: 25, baseType: !490, size: 128, align: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !528, file: !222, line: 26, baseType: !223, size: 32, align: 32, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !528, file: !222, line: 27, baseType: !223, size: 32, align: 32, offset: 800)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !528, file: !222, line: 29, baseType: !496, size: 64, align: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !528, file: !222, line: 30, baseType: !500, size: 64, align: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !528, file: !222, line: 32, baseType: !236, size: 64, align: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !528, file: !222, line: 33, baseType: !236, size: 64, align: 64, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !528, file: !222, line: 34, baseType: !236, size: 64, align: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !528, file: !222, line: 35, baseType: !300, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !528, file: !222, line: 36, baseType: !300, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !528, file: !222, line: 37, baseType: !300, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !528, file: !222, line: 38, baseType: !300, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !528, file: !222, line: 40, baseType: !512, size: 128, align: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !528, file: !222, line: 41, baseType: !472, size: 64, align: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !528, file: !222, line: 42, baseType: !223, size: 32, align: 32, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !528, file: !222, line: 44, baseType: !388, size: 64, align: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !528, file: !222, line: 45, baseType: !388, size: 64, align: 64, offset: 1536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !528, file: !222, line: 53, baseType: !523, size: 64, align: 64, offset: 1600)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !528, file: !222, line: 55, baseType: !607, size: 64, align: 64, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!223, !526, !237}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !528, file: !222, line: 57, baseType: !611, size: 64, align: 64, offset: 1728)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!223, !526, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !528, file: !222, line: 60, baseType: !617, size: 64, align: 64, offset: 1792)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!614, !526}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !528, file: !222, line: 62, baseType: !621, size: 64, align: 64, offset: 1856)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !526, !614, !614, !223}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !528, file: !222, line: 65, baseType: !625, size: 64, align: 64, offset: 1920)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !526, !614, !614}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !528, file: !222, line: 69, baseType: !630, size: 64, align: 64, offset: 1984)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !526, !614}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !251, line: 109, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !636, line: 15, size: 1408, align: 64, elements: !637)
!636 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!637 = !{!638, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !673, !674, !676, !677, !678, !679, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !635, file: !639, line: 3, baseType: !223, size: 32, align: 32)
!639 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !635, file: !639, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !635, file: !639, line: 5, baseType: !500, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !635, file: !639, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !635, file: !639, line: 8, baseType: !526, size: 64, align: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !635, file: !639, line: 9, baseType: !236, size: 64, align: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !635, file: !639, line: 10, baseType: !236, size: 64, align: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !635, file: !639, line: 11, baseType: !472, size: 64, align: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !635, file: !639, line: 12, baseType: !223, size: 32, align: 32, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !635, file: !639, line: 13, baseType: !236, size: 64, align: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !635, file: !639, line: 15, baseType: !650, size: 64, align: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !251, line: 108, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !656, line: 5, size: 704, align: 64, elements: !657)
!656 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !639, line: 3, baseType: !223, size: 32, align: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !655, file: !639, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !655, file: !639, line: 5, baseType: !500, size: 64, align: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !655, file: !639, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !655, file: !639, line: 8, baseType: !526, size: 64, align: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !655, file: !639, line: 9, baseType: !236, size: 64, align: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !655, file: !639, line: 10, baseType: !236, size: 64, align: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !655, file: !639, line: 11, baseType: !472, size: 64, align: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !655, file: !639, line: 12, baseType: !223, size: 32, align: 32, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !655, file: !639, line: 13, baseType: !236, size: 64, align: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !655, file: !639, line: 15, baseType: !650, size: 64, align: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !655, file: !639, line: 17, baseType: !670, size: 64, align: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!614, !653}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !635, file: !639, line: 17, baseType: !670, size: 64, align: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !635, file: !675, line: 5, baseType: !236, size: 64, align: 64, offset: 704)
!675 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!676 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !635, file: !675, line: 6, baseType: !236, size: 64, align: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !635, file: !675, line: 7, baseType: !472, size: 64, align: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !635, file: !675, line: 9, baseType: !500, size: 64, align: 64, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !635, file: !675, line: 10, baseType: !680, size: 64, align: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !251, line: 111, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !683, line: 13, size: 576, align: 64, elements: !684)
!683 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!684 = !{!685, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !703, !704}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !686, line: 3, baseType: !223, size: 32, align: 32)
!686 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !682, file: !686, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !682, file: !686, line: 6, baseType: !472, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !682, file: !686, line: 8, baseType: !236, size: 64, align: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !682, file: !686, line: 9, baseType: !236, size: 64, align: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !682, file: !686, line: 10, baseType: !236, size: 64, align: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !682, file: !686, line: 11, baseType: !223, size: 32, align: 32, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !682, file: !686, line: 14, baseType: !300, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !682, file: !686, line: 15, baseType: !300, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !682, file: !686, line: 18, baseType: !300, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !682, file: !686, line: 19, baseType: !300, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !682, file: !686, line: 20, baseType: !300, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !682, file: !686, line: 21, baseType: !300, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !682, file: !686, line: 22, baseType: !700, size: 64, align: 8, offset: 360)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 64, align: 8, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !682, file: !686, line: 26, baseType: !200, size: 64, align: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !686, line: 28, baseType: !680, size: 64, align: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !635, file: !675, line: 12, baseType: !300, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !635, file: !675, line: 13, baseType: !236, size: 64, align: 64, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !635, file: !675, line: 14, baseType: !223, size: 32, align: 32, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !635, file: !675, line: 15, baseType: !236, size: 64, align: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !635, file: !675, line: 17, baseType: !300, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !635, file: !675, line: 18, baseType: !300, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !635, file: !675, line: 19, baseType: !300, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !635, file: !675, line: 20, baseType: !300, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !635, file: !675, line: 22, baseType: !300, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !635, file: !675, line: 23, baseType: !300, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !635, file: !675, line: 24, baseType: !300, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !635, file: !675, line: 25, baseType: !300, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !635, file: !675, line: 26, baseType: !300, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !635, file: !675, line: 31, baseType: !719, size: 64, align: 64, offset: 1344)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!236, !633}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !528, file: !222, line: 70, baseType: !723, size: 64, align: 64, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !526, !614}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !251, line: 110, baseType: !728)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !251, line: 110, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !528, file: !222, line: 71, baseType: !730, size: 64, align: 64, offset: 2112)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!223, !614, !614}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !528, file: !222, line: 73, baseType: !730, size: 64, align: 64, offset: 2176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !218, file: !222, line: 55, baseType: !607, size: 64, align: 64, offset: 1664)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !218, file: !222, line: 57, baseType: !611, size: 64, align: 64, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !218, file: !222, line: 60, baseType: !617, size: 64, align: 64, offset: 1792)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !218, file: !222, line: 62, baseType: !621, size: 64, align: 64, offset: 1856)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !218, file: !222, line: 65, baseType: !625, size: 64, align: 64, offset: 1920)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !218, file: !222, line: 69, baseType: !630, size: 64, align: 64, offset: 1984)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !218, file: !222, line: 70, baseType: !723, size: 64, align: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !218, file: !222, line: 71, baseType: !730, size: 64, align: 64, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !218, file: !222, line: 73, baseType: !730, size: 64, align: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !218, file: !219, line: 46, baseType: !388, size: 64, align: 64, offset: 2240)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !218, file: !219, line: 47, baseType: !388, size: 64, align: 64, offset: 2304)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !218, file: !219, line: 48, baseType: !746, size: 64, align: 64, offset: 2368)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !217, line: 8, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !217, line: 8, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !218, file: !219, line: 49, baseType: !388, size: 64, align: 64, offset: 2432)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !218, file: !219, line: 51, baseType: !236, size: 64, align: 64, offset: 2496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !218, file: !219, line: 53, baseType: !236, size: 64, align: 64, offset: 2560)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !218, file: !219, line: 54, baseType: !236, size: 64, align: 64, offset: 2624)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !218, file: !219, line: 55, baseType: !236, size: 64, align: 64, offset: 2688)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !218, file: !219, line: 56, baseType: !236, size: 64, align: 64, offset: 2752)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !218, file: !219, line: 57, baseType: !223, size: 32, align: 32, offset: 2816)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !218, file: !219, line: 59, baseType: !300, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !218, file: !219, line: 60, baseType: !300, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !218, file: !219, line: 62, baseType: !300, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !218, file: !219, line: 63, baseType: !300, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !218, file: !219, line: 64, baseType: !300, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !218, file: !219, line: 65, baseType: !300, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !218, file: !219, line: 66, baseType: !300, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !218, file: !219, line: 67, baseType: !300, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !218, file: !219, line: 68, baseType: !300, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !218, file: !219, line: 69, baseType: !300, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !218, file: !219, line: 70, baseType: !300, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !218, file: !219, line: 71, baseType: !300, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !218, file: !219, line: 72, baseType: !300, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !218, file: !219, line: 74, baseType: !223, size: 32, align: 32, offset: 2880)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !218, file: !219, line: 75, baseType: !223, size: 32, align: 32, offset: 2912)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !218, file: !219, line: 76, baseType: !223, size: 32, align: 32, offset: 2944)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !218, file: !219, line: 77, baseType: !223, size: 32, align: 32, offset: 2976)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !218, file: !219, line: 79, baseType: !500, size: 64, align: 64, offset: 3008)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !218, file: !219, line: 80, baseType: !388, size: 64, align: 64, offset: 3072)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !218, file: !219, line: 81, baseType: !388, size: 64, align: 64, offset: 3136)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !218, file: !219, line: 83, baseType: !427, size: 64, align: 64, offset: 3200)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !218, file: !219, line: 84, baseType: !379, size: 32, align: 32, offset: 3264)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !218, file: !219, line: 87, baseType: !223, size: 32, align: 32, offset: 3296)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !218, file: !219, line: 91, baseType: !388, size: 64, align: 64, offset: 3328)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !218, file: !219, line: 92, baseType: !512, size: 128, align: 64, offset: 3392)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !218, file: !219, line: 93, baseType: !512, size: 128, align: 64, offset: 3520)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !218, file: !219, line: 95, baseType: !223, size: 32, align: 32, offset: 3648)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !218, file: !219, line: 96, baseType: !223, size: 32, align: 32, offset: 3680)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !218, file: !219, line: 97, baseType: !223, size: 32, align: 32, offset: 3712)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !218, file: !219, line: 100, baseType: !388, size: 64, align: 64, offset: 3776)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !218, file: !219, line: 103, baseType: !388, size: 64, align: 64, offset: 3840)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !218, file: !219, line: 106, baseType: !388, size: 64, align: 64, offset: 3904)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !218, file: !219, line: 108, baseType: !500, size: 64, align: 64, offset: 3968)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !218, file: !219, line: 109, baseType: !388, size: 64, align: 64, offset: 4032)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !218, file: !219, line: 111, baseType: !388, size: 64, align: 64, offset: 4096)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !218, file: !219, line: 114, baseType: !200, size: 64, align: 64, offset: 4160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !218, file: !219, line: 116, baseType: !500, size: 64, align: 64, offset: 4224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !218, file: !219, line: 117, baseType: !794, size: 32768, align: 64, offset: 4288)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 32768, align: 64, elements: !844)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !796, line: 10, size: 128, align: 64, elements: !797)
!796 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!797 = !{!798, !843}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !795, file: !796, line: 11, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !796, line: 7, baseType: !801)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !803, !614, !237, !237, !236, !427}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !217, line: 7, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !806, line: 15, size: 1600, align: 64, elements: !807)
!806 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !805, file: !639, line: 3, baseType: !223, size: 32, align: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !805, file: !639, line: 4, baseType: !223, size: 32, align: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !805, file: !639, line: 5, baseType: !500, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !805, file: !639, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !805, file: !639, line: 8, baseType: !215, size: 64, align: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !805, file: !639, line: 9, baseType: !236, size: 64, align: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !805, file: !639, line: 10, baseType: !236, size: 64, align: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !805, file: !639, line: 11, baseType: !472, size: 64, align: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !805, file: !639, line: 12, baseType: !223, size: 32, align: 32, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !805, file: !639, line: 13, baseType: !236, size: 64, align: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !805, file: !639, line: 15, baseType: !650, size: 64, align: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !805, file: !639, line: 17, baseType: !670, size: 64, align: 64, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !805, file: !675, line: 5, baseType: !236, size: 64, align: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !805, file: !675, line: 6, baseType: !236, size: 64, align: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !805, file: !675, line: 7, baseType: !472, size: 64, align: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !805, file: !675, line: 9, baseType: !500, size: 64, align: 64, offset: 896)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !805, file: !675, line: 10, baseType: !680, size: 64, align: 64, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !805, file: !675, line: 12, baseType: !300, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !805, file: !675, line: 13, baseType: !236, size: 64, align: 64, offset: 1088)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !805, file: !675, line: 14, baseType: !223, size: 32, align: 32, offset: 1152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !805, file: !675, line: 15, baseType: !236, size: 64, align: 64, offset: 1216)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !805, file: !675, line: 17, baseType: !300, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !805, file: !675, line: 18, baseType: !300, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !805, file: !675, line: 19, baseType: !300, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !805, file: !675, line: 20, baseType: !300, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !805, file: !675, line: 22, baseType: !300, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !805, file: !675, line: 23, baseType: !300, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !805, file: !675, line: 24, baseType: !300, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !805, file: !675, line: 25, baseType: !300, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !805, file: !675, line: 26, baseType: !300, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !805, file: !675, line: 31, baseType: !719, size: 64, align: 64, offset: 1344)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !805, file: !806, line: 18, baseType: !388, size: 64, align: 64, offset: 1408)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !805, file: !806, line: 20, baseType: !472, size: 64, align: 64, offset: 1472)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !805, file: !806, line: 21, baseType: !223, size: 32, align: 32, offset: 1536)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !805, file: !806, line: 22, baseType: !223, size: 32, align: 32, offset: 1568)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !795, file: !796, line: 12, baseType: !237, size: 8, align: 8, offset: 64)
!844 = !{!845}
!845 = !DISubrange(count: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !218, file: !219, line: 118, baseType: !847, size: 2048, align: 8, offset: 37056)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 2048, align: 8, elements: !844)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !218, file: !219, line: 120, baseType: !730, size: 64, align: 64, offset: 39104)
!849 = !DILocalVariable(name: "server", arg: 1, scope: !212, file: !205, line: 33, type: !215)
!850 = !DIExpression()
!851 = !DILocation(line: 33, column: 46, scope: !212)
!852 = !DILocation(line: 35, column: 38, scope: !212)
!853 = !DILocation(line: 35, column: 2, scope: !212)
!854 = !DILocation(line: 36, column: 1, scope: !212)
!855 = distinct !DISubprogram(name: "sig_sasl_failure", scope: !205, file: !205, line: 38, type: !856, isLocal: true, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !208)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !215, !614}
!858 = !DILocalVariable(name: "server", arg: 1, scope: !855, file: !205, line: 38, type: !215)
!859 = !DILocation(line: 38, column: 46, scope: !855)
!860 = !DILocalVariable(name: "reason", arg: 2, scope: !855, file: !205, line: 38, type: !614)
!861 = !DILocation(line: 38, column: 66, scope: !855)
!862 = !DILocation(line: 40, column: 38, scope: !855)
!863 = !DILocation(line: 40, column: 37, scope: !855)
!864 = !DILocation(line: 40, column: 2, scope: !855)
!865 = !DILocation(line: 41, column: 1, scope: !855)
!866 = distinct !DISubprogram(name: "fe_sasl_deinit", scope: !205, file: !205, line: 49, type: !206, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !208)
!867 = !DILocation(line: 51, column: 2, scope: !866)
!868 = !DILocation(line: 52, column: 2, scope: !866)
!869 = !DILocation(line: 53, column: 1, scope: !866)
