; ModuleID = './line380-irssi.o.i'
source_filename = "./line380-irssi.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GOptionEntry = type { i8*, i8, i32, i32, i8*, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GMainLoop = type opaque
%struct._FORMAT_REC = type { i8*, i8*, i32, [10 x i32] }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GMainContext = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct.MODULE_FILE_REC = type { %struct._MODULE_REC*, i8*, i8*, void ()*, %struct._GModule*, i8 }
%struct._MODULE_REC = type { i8*, %struct._GSList* }
%struct._GModule = type opaque
%struct.STATUSBAR_REC = type { %struct.STATUSBAR_GROUP_REC*, %struct.STATUSBAR_CONFIG_REC*, %struct.MAIN_WINDOW_REC*, %struct._GSList*, i8*, i32, i8, i32 }
%struct.STATUSBAR_GROUP_REC = type { i8*, %struct._GSList*, %struct._GSList* }

!76 = !DIEnumerator(name: "TXT_WINDOW_SET_STICKY", value: 15)
!77 = !DIEnumerator(name: "TXT_WINDOW_UNSET_STICKY", value: 16)
!78 = !DIEnumerator(name: "TXT_WINDOW_INFO_STICKY", value: 17)
!79 = !DIEnumerator(name: "TXT_WINDOW_INFO_SCROLL", value: 18)
!80 = !DIEnumerator(name: "TXT_WINDOW_SCROLL", value: 19)
!81 = !DIEnumerator(name: "TXT_WINDOW_SCROLL_UNKNOWN", value: 20)
!82 = !DIEnumerator(name: "TXT_WINDOW_HIDELEVEL", value: 21)
!83 = !DIEnumerator(name: "TXT_FILL_3", value: 22)
!84 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_HEADER", value: 23)
!85 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_FOOTER", value: 24)
!86 = !DIEnumerator(name: "TXT_STATUSBAR_LIST", value: 25)
!87 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_NAME", value: 26)
!88 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_TYPE", value: 27)
!89 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_PLACEMENT", value: 28)
!90 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_POSITION", value: 29)
!91 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_VISIBLE", value: 30)
!92 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_HEADER", value: 31)
!93 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_FOOTER", value: 32)
!94 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_NAME", value: 33)
!95 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_FOUND", value: 34)
!96 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_ENABLED", value: 35)
!97 = !DIEnumerator(name: "TXT_STATUSBAR_ITEM_NOT_FOUND", value: 36)
!98 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_COMMAND", value: 37)
!99 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_TYPE", value: 38)
!100 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_PLACEMENT", value: 39)
!101 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_VISIBILITY", value: 40)
!102 = !DIEnumerator(name: "TXT_FILL_4", value: 41)
!103 = !DIEnumerator(name: "TXT_PASTE_WARNING", value: 42)
!104 = !DIEnumerator(name: "TXT_PASTE_PROMPT", value: 43)
!105 = !DIEnumerator(name: "TXT_FILL_5", value: 44)
!106 = !DIEnumerator(name: "TXT_IRSSI_BANNER", value: 45)
!107 = !DIEnumerator(name: "TXT_WELCOME_FIRSTTIME", value: 46)
!108 = !DIEnumerator(name: "TXT_WELCOME_INIT_SETTINGS", value: 47)
!109 = !DIEnumerator(name: "TXT_COUNT", value: 48)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !111, line: 33, size: 32, align: 32, elements: !112)
!111 = !DIFile(filename: "../../src/core/settings.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "USER_SETTINGS_REAL_NAME", value: 1)
!114 = !DIEnumerator(name: "USER_SETTINGS_USER_NAME", value: 2)
!115 = !DIEnumerator(name: "USER_SETTINGS_NICK", value: 4)
!116 = !DIEnumerator(name: "USER_SETTINGS_HOSTNAME", value: 8)
!117 = !{!118, !124, !131, !132, !135}
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !119, line: 85, baseType: !120)
!119 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123}
!123 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !125, line: 9, baseType: !126)
!125 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !129, !129, !129, !129, !129, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !133, line: 55, baseType: !134)
!133 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!134 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !133, line: 54, baseType: !136)
!136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!137 = !{!138, !147, !167, !168, !169, !174, !175, !176}
!138 = distinct !DIGlobalVariable(name: "version", scope: !139, file: !140, line: 282, type: !123, isLocal: true, isDefinition: true, variable: i32* @main.version)
!139 = distinct !DISubprogram(name: "main", scope: !140, file: !140, line: 280, type: !141, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!140 = !DIFile(filename: "irssi.c", directory: "/home/lichi/Desktop/irssi/task1")
!141 = !DISubroutineType(types: !142)
!142 = !{!123, !123, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!146 = !{}
!147 = distinct !DIGlobalVariable(name: "options", scope: !139, file: !140, line: 283, type: !148, isLocal: true, isDefinition: true, variable: [2 x %struct._GOptionEntry]* @main.options)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 768, align: 64, elements: !165)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !4, line: 52, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !4, line: 257, size: 384, align: 64, elements: !151)
!151 = !{!152, !156, !157, !159, !161, !163, !164}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !150, file: !4, line: 259, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !133, line: 46, baseType: !145)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !150, file: !4, line: 260, baseType: !155, size: 8, align: 8, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !150, file: !4, line: 261, baseType: !158, size: 32, align: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !133, line: 49, baseType: !123)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !150, file: !4, line: 263, baseType: !160, size: 32, align: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !4, line: 129, baseType: !3)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !150, file: !4, line: 264, baseType: !162, size: 64, align: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !133, line: 77, baseType: !131)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !150, file: !4, line: 266, baseType: !153, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !150, file: !4, line: 267, baseType: !153, size: 64, align: 64, offset: 320)
!165 = !{!166}
!166 = !DISubrange(count: 2)
!167 = distinct !DIGlobalVariable(name: "dirty", scope: !0, file: !140, line: 83, type: !123, isLocal: true, isDefinition: true, variable: i32* @dirty)
!168 = distinct !DIGlobalVariable(name: "full_redraw", scope: !0, file: !140, line: 83, type: !123, isLocal: true, isDefinition: true, variable: i32* @full_redraw)
!169 = distinct !DIGlobalVariable(name: "main_loop", scope: !0, file: !140, line: 85, type: !170, isLocal: true, isDefinition: true, variable: %struct._GMainLoop** @main_loop)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainLoop", file: !172, line: 56, baseType: !173)
!172 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainLoop", file: !172, line: 56, flags: DIFlagFwdDecl)
!174 = distinct !DIGlobalVariable(name: "quitting", scope: !0, file: !140, line: 86, type: !123, isLocal: false, isDefinition: true, variable: i32* @quitting)
!175 = distinct !DIGlobalVariable(name: "display_firsttimer", scope: !0, file: !140, line: 88, type: !123, isLocal: true, isDefinition: true, variable: i32* @display_firsttimer)
!176 = distinct !DIGlobalVariable(name: "user_settings_changed", scope: !0, file: !140, line: 89, type: !134, isLocal: true, isDefinition: true, variable: i32* @user_settings_changed)
!177 = !{i32 2, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!180 = distinct !DISubprogram(name: "irssi_redraw", scope: !140, file: !140, line: 103, type: !181, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !DILocation(line: 105, column: 8, scope: !180)
!184 = !DILocation(line: 106, column: 21, scope: !180)
!185 = !DILocation(line: 107, column: 1, scope: !180)
!186 = distinct !DISubprogram(name: "irssi_set_dirty", scope: !140, file: !140, line: 109, type: !181, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!187 = !DILocation(line: 111, column: 15, scope: !186)
!188 = !DILocation(line: 112, column: 1, scope: !186)
!189 = !DILocalVariable(name: "argc", arg: 1, scope: !139, file: !140, line: 280, type: !123)
!190 = !DIExpression()
!191 = !DILocation(line: 280, column: 14, scope: !139)
!192 = !DILocalVariable(name: "argv", arg: 2, scope: !139, file: !140, line: 280, type: !143)
!193 = !DILocation(line: 280, column: 27, scope: !139)
!194 = !DILocalVariable(name: "loglev", scope: !139, file: !140, line: 287, type: !123)
!195 = !DILocation(line: 287, column: 6, scope: !139)
!196 = !DILocation(line: 289, column: 2, scope: !139)
!197 = !DILocation(line: 290, column: 2, scope: !139)
!198 = !DILocation(line: 291, column: 2, scope: !139)
!199 = !DILocation(line: 292, column: 15, scope: !139)
!200 = !DILocation(line: 292, column: 21, scope: !139)
!201 = !DILocation(line: 292, column: 2, scope: !139)
!202 = !DILocation(line: 294, column: 7, scope: !203)
!203 = distinct !DILexicalBlock(scope: !139, file: !140, line: 294, column: 7)
!204 = !DILocation(line: 294, column: 7, scope: !139)
!205 = !DILocation(line: 295, column: 3, scope: !206)
!206 = distinct !DILexicalBlock(scope: !203, file: !140, line: 294, column: 16)
!207 = !DILocation(line: 297, column: 3, scope: !206)
!208 = !DILocation(line: 300, column: 8, scope: !139)
!209 = !DILocation(line: 300, column: 2, scope: !210)
!210 = !DILexicalBlockFile(scope: !139, file: !140, discriminator: 1)
!211 = !DILocation(line: 302, column: 11, scope: !139)
!212 = !DILocation(line: 303, column: 15, scope: !139)
!213 = !DILocation(line: 303, column: 2, scope: !139)
!214 = !DILocation(line: 305, column: 2, scope: !139)
!215 = !DILocation(line: 320, column: 2, scope: !139)
!216 = !DILocation(line: 322, column: 11, scope: !139)
!217 = !DILocation(line: 322, column: 9, scope: !139)
!218 = !DILocation(line: 323, column: 2, scope: !139)
!219 = !DILocation(line: 325, column: 7, scope: !220)
!220 = distinct !DILexicalBlock(scope: !139, file: !140, line: 325, column: 6)
!221 = !DILocation(line: 325, column: 6, scope: !139)
!222 = !DILocation(line: 326, column: 10, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !140, line: 325, column: 20)
!224 = !DILocation(line: 326, column: 3, scope: !223)
!225 = !DILocation(line: 327, column: 3, scope: !223)
!226 = !DILocation(line: 330, column: 25, scope: !139)
!227 = !DILocation(line: 330, column: 2, scope: !139)
!228 = !DILocation(line: 331, column: 2, scope: !139)
!229 = !DILocation(line: 332, column: 14, scope: !139)
!230 = !DILocation(line: 332, column: 12, scope: !139)
!231 = !DILocation(line: 336, column: 2, scope: !139)
!232 = !DILocation(line: 336, column: 10, scope: !210)
!233 = !DILocation(line: 336, column: 9, scope: !210)
!234 = !DILocation(line: 336, column: 2, scope: !210)
!235 = !DILocation(line: 337, column: 7, scope: !236)
!236 = distinct !DILexicalBlock(scope: !237, file: !140, line: 337, column: 7)
!237 = distinct !DILexicalBlock(scope: !139, file: !140, line: 336, column: 20)
!238 = !DILocation(line: 337, column: 7, scope: !237)
!239 = !DILocation(line: 339, column: 18, scope: !240)
!240 = distinct !DILexicalBlock(scope: !236, file: !140, line: 337, column: 22)
!241 = !DILocation(line: 340, column: 4, scope: !240)
!242 = !DILocation(line: 341, column: 3, scope: !240)
!243 = !DILocation(line: 343, column: 3, scope: !237)
!244 = !DILocation(line: 345, column: 3, scope: !237)
!245 = !DILocation(line: 346, column: 3, scope: !237)
!246 = !DILocation(line: 347, column: 3, scope: !237)
!247 = !DILocation(line: 336, column: 2, scope: !248)
!248 = !DILexicalBlockFile(scope: !139, file: !140, discriminator: 2)
!249 = distinct !{!249, !231}
!250 = !DILocation(line: 350, column: 20, scope: !139)
!251 = !DILocation(line: 350, column: 2, scope: !139)
!252 = !DILocation(line: 351, column: 2, scope: !139)
!253 = !DILocation(line: 353, column: 2, scope: !139)
!254 = !DILocation(line: 354, column: 2, scope: !139)
!255 = !DILocation(line: 355, column: 1, scope: !139)
!256 = distinct !DISubprogram(name: "check_files", scope: !140, file: !140, line: 270, type: !181, isLocal: true, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!257 = !DILocalVariable(name: "statbuf", scope: !256, file: !140, line: 272, type: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !259, line: 46, size: 1152, align: 64, elements: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/irssi/task1")
!260 = !{!261, !264, !266, !268, !270, !272, !274, !275, !276, !279, !281, !283, !291, !292, !293}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !258, file: !259, line: 48, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !263, line: 124, baseType: !136)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !258, file: !259, line: 53, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !263, line: 127, baseType: !136)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !258, file: !259, line: 61, baseType: !267, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !263, line: 130, baseType: !136)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !258, file: !259, line: 62, baseType: !269, size: 32, align: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !263, line: 129, baseType: !134)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !258, file: !259, line: 64, baseType: !271, size: 32, align: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !263, line: 125, baseType: !134)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !258, file: !259, line: 65, baseType: !273, size: 32, align: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !263, line: 126, baseType: !134)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !258, file: !259, line: 67, baseType: !123, size: 32, align: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !258, file: !259, line: 69, baseType: !262, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !258, file: !259, line: 74, baseType: !277, size: 64, align: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !263, line: 131, baseType: !278)
!278 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !258, file: !259, line: 78, baseType: !280, size: 64, align: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !263, line: 153, baseType: !278)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !258, file: !259, line: 80, baseType: !282, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !263, line: 158, baseType: !278)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !258, file: !259, line: 91, baseType: !284, size: 128, align: 64, offset: 576)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !285, line: 120, size: 128, align: 64, elements: !286)
!285 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !284, file: !285, line: 122, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !263, line: 139, baseType: !278)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !284, file: !285, line: 123, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !263, line: 175, baseType: !278)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !258, file: !259, line: 92, baseType: !284, size: 128, align: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !258, file: !259, line: 93, baseType: !284, size: 128, align: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !258, file: !259, line: 106, baseType: !294, size: 192, align: 64, offset: 960)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 192, align: 64, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 3)
!297 = !DILocation(line: 272, column: 14, scope: !256)
!298 = !DILocation(line: 274, column: 11, scope: !299)
!299 = distinct !DILexicalBlock(scope: !256, file: !140, line: 274, column: 6)
!300 = !DILocation(line: 274, column: 6, scope: !301)
!301 = !DILexicalBlockFile(scope: !299, file: !140, discriminator: 1)
!302 = !DILocation(line: 274, column: 38, scope: !299)
!303 = !DILocation(line: 274, column: 6, scope: !256)
!304 = !DILocation(line: 276, column: 22, scope: !305)
!305 = distinct !DILexicalBlock(scope: !299, file: !140, line: 274, column: 44)
!306 = !DILocation(line: 277, column: 2, scope: !305)
!307 = !DILocation(line: 278, column: 1, scope: !256)
!308 = distinct !DISubprogram(name: "textui_init", scope: !140, file: !140, line: 140, type: !181, isLocal: true, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!309 = !DILocalVariable(name: "act", scope: !308, file: !140, line: 143, type: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !311, line: 24, size: 1216, align: 64, elements: !312)
!311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = !{!313, !391, !400, !401}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !310, file: !311, line: 35, baseType: !314, size: 64, align: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !311, line: 28, size: 64, align: 64, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !314, file: !311, line: 31, baseType: !118, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !314, file: !311, line: 33, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !123, !321, !131}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !323, line: 133, baseType: !324)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/irssi/task1")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 62, size: 1024, align: 64, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !324, file: !323, line: 64, baseType: !123, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !324, file: !323, line: 65, baseType: !123, size: 32, align: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !324, file: !323, line: 67, baseType: !123, size: 32, align: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !324, file: !323, line: 132, baseType: !330, size: 896, align: 64, offset: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 69, size: 896, align: 64, elements: !331)
!331 = !{!332, !336, !342, !353, !359, !369, !380, !385}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !330, file: !323, line: 71, baseType: !333, size: 896, align: 32)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 896, align: 32, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 28)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !330, file: !323, line: 78, baseType: !337, size: 64, align: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 74, size: 64, align: 32, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !337, file: !323, line: 76, baseType: !340, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !263, line: 133, baseType: !123)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !337, file: !323, line: 77, baseType: !271, size: 32, align: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !330, file: !323, line: 86, baseType: !343, size: 128, align: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 81, size: 128, align: 64, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !343, file: !323, line: 83, baseType: !123, size: 32, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !343, file: !323, line: 84, baseType: !123, size: 32, align: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !343, file: !323, line: 85, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !323, line: 36, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !323, line: 32, size: 64, align: 64, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !349, file: !323, line: 34, baseType: !123, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !349, file: !323, line: 35, baseType: !131, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !330, file: !323, line: 94, baseType: !354, size: 128, align: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 89, size: 128, align: 64, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !354, file: !323, line: 91, baseType: !340, size: 32, align: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !354, file: !323, line: 92, baseType: !271, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !354, file: !323, line: 93, baseType: !348, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !330, file: !323, line: 104, baseType: !360, size: 256, align: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 97, size: 256, align: 64, elements: !361)
!361 = !{!362, !363, !364, !365, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !360, file: !323, line: 99, baseType: !340, size: 32, align: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !360, file: !323, line: 100, baseType: !271, size: 32, align: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !360, file: !323, line: 101, baseType: !123, size: 32, align: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !360, file: !323, line: 102, baseType: !366, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !323, line: 58, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !263, line: 135, baseType: !278)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !360, file: !323, line: 103, baseType: !366, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !330, file: !323, line: 116, baseType: !370, size: 256, align: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 107, size: 256, align: 64, elements: !371)
!371 = !{!372, !373, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !370, file: !323, line: 109, baseType: !131, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !370, file: !323, line: 110, baseType: !374, size: 16, align: 16, offset: 64)
!374 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !370, file: !323, line: 115, baseType: !376, size: 128, align: 64, offset: 128)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !370, file: !323, line: 111, size: 128, align: 64, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !376, file: !323, line: 113, baseType: !131, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !376, file: !323, line: 114, baseType: !131, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !330, file: !323, line: 123, baseType: !381, size: 128, align: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 119, size: 128, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !381, file: !323, line: 121, baseType: !278, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !381, file: !323, line: 122, baseType: !123, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !330, file: !323, line: 131, baseType: !386, size: 128, align: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !323, line: 126, size: 128, align: 64, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !386, file: !323, line: 128, baseType: !131, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !386, file: !323, line: 129, baseType: !123, size: 32, align: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !386, file: !323, line: 130, baseType: !134, size: 32, align: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !310, file: !311, line: 43, baseType: !392, size: 1024, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !393, line: 30, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/irssi/task1")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 27, size: 1024, align: 64, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !394, file: !393, line: 29, baseType: !397, size: 1024, align: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, align: 64, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !310, file: !311, line: 46, baseType: !123, size: 32, align: 32, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !310, file: !311, line: 49, baseType: !402, size: 64, align: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!403 = !DILocation(line: 143, column: 19, scope: !308)
!404 = !DILocation(line: 145, column: 19, scope: !308)
!405 = !DILocation(line: 145, column: 2, scope: !308)
!406 = !DILocation(line: 146, column: 6, scope: !308)
!407 = !DILocation(line: 146, column: 15, scope: !308)
!408 = !DILocation(line: 147, column: 5, scope: !308)
!409 = !DILocation(line: 147, column: 25, scope: !308)
!410 = !DILocation(line: 147, column: 16, scope: !308)
!411 = !DILocation(line: 148, column: 2, scope: !308)
!412 = !DILocation(line: 151, column: 12, scope: !308)
!413 = !DILocation(line: 152, column: 2, scope: !308)
!414 = !DILocation(line: 153, column: 2, scope: !308)
!415 = !DILocation(line: 154, column: 2, scope: !308)
!416 = !DILocation(line: 155, column: 2, scope: !308)
!417 = !DILocation(line: 157, column: 2, scope: !308)
!418 = !DILocation(line: 158, column: 2, scope: !308)
!419 = !DILocation(line: 159, column: 2, scope: !308)
!420 = !DILocation(line: 160, column: 1, scope: !308)
!421 = distinct !DISubprogram(name: "textui_finish_init", scope: !140, file: !140, line: 162, type: !181, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!422 = !DILocation(line: 164, column: 11, scope: !421)
!423 = !DILocation(line: 166, column: 2, scope: !421)
!424 = !DILocation(line: 167, column: 2, scope: !421)
!425 = !DILocation(line: 168, column: 2, scope: !421)
!426 = !DILocation(line: 169, column: 2, scope: !421)
!427 = !DILocation(line: 170, column: 2, scope: !421)
!428 = !DILocation(line: 171, column: 2, scope: !421)
!429 = !DILocation(line: 172, column: 2, scope: !421)
!430 = !DILocation(line: 173, column: 2, scope: !421)
!431 = !DILocation(line: 174, column: 2, scope: !421)
!432 = !DILocation(line: 175, column: 2, scope: !421)
!433 = !DILocation(line: 176, column: 2, scope: !421)
!434 = !DILocation(line: 177, column: 2, scope: !421)
!435 = !DILocation(line: 178, column: 2, scope: !421)
!436 = !DILocation(line: 179, column: 2, scope: !421)
!437 = !DILocation(line: 180, column: 2, scope: !421)
!438 = !DILocation(line: 182, column: 2, scope: !421)
!439 = !DILocation(line: 184, column: 2, scope: !421)
!440 = !DILocation(line: 195, column: 2, scope: !421)
!441 = !DILocation(line: 197, column: 2, scope: !421)
!442 = !DILocation(line: 198, column: 2, scope: !421)
!443 = !DILocation(line: 199, column: 2, scope: !421)
!444 = !DILocation(line: 201, column: 6, scope: !445)
!445 = distinct !DILexicalBlock(scope: !421, file: !140, line: 201, column: 6)
!446 = !DILocation(line: 201, column: 14, scope: !445)
!447 = !DILocation(line: 201, column: 21, scope: !445)
!448 = !DILocation(line: 201, column: 24, scope: !449)
!449 = !DILexicalBlockFile(scope: !445, file: !140, discriminator: 1)
!450 = !DILocation(line: 201, column: 39, scope: !449)
!451 = !DILocation(line: 201, column: 6, scope: !449)
!452 = !DILocation(line: 202, column: 3, scope: !453)
!453 = distinct !DILexicalBlock(scope: !445, file: !140, line: 201, column: 48)
!454 = !DILocation(line: 203, column: 2, scope: !453)
!455 = !DILocation(line: 205, column: 6, scope: !456)
!456 = distinct !DILexicalBlock(scope: !421, file: !140, line: 205, column: 6)
!457 = !DILocation(line: 205, column: 6, scope: !421)
!458 = !DILocation(line: 206, column: 3, scope: !459)
!459 = distinct !DILexicalBlock(scope: !456, file: !140, line: 205, column: 26)
!460 = !DILocation(line: 207, column: 2, scope: !459)
!461 = !DILocation(line: 210, column: 6, scope: !462)
!462 = distinct !DILexicalBlock(scope: !421, file: !140, line: 210, column: 6)
!463 = !DILocation(line: 210, column: 6, scope: !421)
!464 = !DILocation(line: 211, column: 3, scope: !462)
!465 = !DILocation(line: 212, column: 6, scope: !466)
