; ModuleID = './line27-chat-protocols.o.i'
source_filename = "./line27-chat-protocols.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._CHAT_PROTOCOL_REC = type { i32, i8, i8*, i8*, i8*, %struct._CHATNET_REC* ()*, %struct._SERVER_SETUP_REC* ()*, %struct._CHANNEL_SETUP_REC* ()*, %struct._SERVER_CONNECT_REC* ()*, void (%struct._SERVER_CONNECT_REC*)*, %struct._SERVER_REC* (%struct._SERVER_CONNECT_REC*)*, void (%struct._SERVER_REC*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*, i8*, i32)*, %struct._QUERY_REC* (i8*, i8*, i32)* }
%struct._CHATNET_REC = type { i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IPADDR*, %struct._IPADDR* }
%struct._IPADDR = type opaque
%struct._SERVER_SETUP_REC = type { i32, i32, i8*, i16, i8*, i32, i8*, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IPADDR*, %struct._IPADDR*, i64, i8, %struct._GHashTable* }
%struct._GHashTable = type opaque
%struct._CHANNEL_SETUP_REC = type { i32, i32, i8*, i8*, i8*, i8*, i8*, i8, %struct._GHashTable* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !496)
!1 = !DIFile(filename: "line27-chat-protocols.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !39, !41, !45, !47, !50, !52, !63, !70, !93, !141, !160}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !40, line: 77, baseType: !36)
!40 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !43, line: 38, baseType: !44)
!43 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !40, line: 48, baseType: !46)
!46 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !40, line: 46, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !54, line: 105, baseType: !55)
!54 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !56, line: 4, size: 832, align: 64, elements: !57)
!56 = !DIFile(filename: "chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!57 = !{!58, !59, !61, !62, !64, !65, !66, !89, !137, !156, !381, !385, !484, !488, !492}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !55, file: !56, line: 5, baseType: !38, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !55, file: !56, line: 7, baseType: !60, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !55, file: !56, line: 8, baseType: !60, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !56, line: 10, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !55, file: !56, line: 11, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !55, file: !56, line: 12, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !55, file: !56, line: 14, baseType: !67, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !54, line: 106, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !73, line: 13, size: 576, align: 64, elements: !74)
!73 = !DIFile(filename: "chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !{!75, !77, !78, !79, !80, !81, !82, !83, !84, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !76, line: 1, baseType: !38, size: 32, align: 32)
!76 = !DIFile(filename: "chatnet-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !72, file: !76, line: 2, baseType: !38, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !76, line: 4, baseType: !63, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !72, file: !76, line: 6, baseType: !63, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !72, file: !76, line: 7, baseType: !63, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !72, file: !76, line: 8, baseType: !63, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !72, file: !76, line: 10, baseType: !63, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !72, file: !76, line: 11, baseType: !63, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !72, file: !76, line: 12, baseType: !85, size: 64, align: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !54, line: 99, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !54, line: 99, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !72, file: !76, line: 12, baseType: !85, size: 64, align: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !55, file: !56, line: 15, baseType: !90, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !54, line: 114, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !96, line: 13, size: 1408, align: 64, elements: !97)
!96 = !DIFile(filename: "servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = !{!98, !100, !101, !102, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !125, !126, !127, !128, !129, !130, !131, !132}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !99, line: 1, baseType: !38, size: 32, align: 32)
!99 = !DIFile(filename: "server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !95, file: !99, line: 2, baseType: !38, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !95, file: !99, line: 4, baseType: !63, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !95, file: !99, line: 6, baseType: !103, size: 16, align: 16, offset: 128)
!103 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !95, file: !99, line: 7, baseType: !63, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !95, file: !99, line: 8, baseType: !38, size: 32, align: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !95, file: !99, line: 9, baseType: !63, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !95, file: !99, line: 11, baseType: !38, size: 32, align: 32, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !95, file: !99, line: 12, baseType: !63, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !95, file: !99, line: 14, baseType: !63, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !95, file: !99, line: 15, baseType: !63, size: 64, align: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !95, file: !99, line: 16, baseType: !63, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !95, file: !99, line: 17, baseType: !63, size: 64, align: 64, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !95, file: !99, line: 18, baseType: !63, size: 64, align: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !95, file: !99, line: 19, baseType: !63, size: 64, align: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !95, file: !99, line: 20, baseType: !63, size: 64, align: 64, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !95, file: !99, line: 21, baseType: !63, size: 64, align: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !95, file: !99, line: 23, baseType: !63, size: 64, align: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !95, file: !99, line: 24, baseType: !85, size: 64, align: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !95, file: !99, line: 24, baseType: !85, size: 64, align: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !95, file: !99, line: 26, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !122, line: 75, baseType: !123)
!122 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !124, line: 139, baseType: !46)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !95, file: !99, line: 28, baseType: !60, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !95, file: !99, line: 29, baseType: !60, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !95, file: !99, line: 30, baseType: !60, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !95, file: !99, line: 31, baseType: !60, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !95, file: !99, line: 32, baseType: !60, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !95, file: !99, line: 33, baseType: !60, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !95, file: !99, line: 34, baseType: !60, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !95, file: !99, line: 36, baseType: !133, size: 64, align: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !135, line: 37, baseType: !136)
!135 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !135, line: 37, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !55, file: !56, line: 16, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !54, line: 115, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !144, line: 12, size: 512, align: 64, elements: !145)
!144 = !DIFile(filename: "channels-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!145 = !{!146, !148, !149, !150, !151, !152, !153, !154, !155}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !147, line: 1, baseType: !38, size: 32, align: 32)
!147 = !DIFile(filename: "channel-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !143, file: !147, line: 2, baseType: !38, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !147, line: 4, baseType: !63, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !143, file: !147, line: 5, baseType: !63, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !143, file: !147, line: 6, baseType: !63, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "botmasks", scope: !143, file: !147, line: 8, baseType: !63, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !143, file: !147, line: 9, baseType: !63, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "autojoin", scope: !143, file: !147, line: 11, baseType: !60, size: 1, align: 32, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !143, file: !147, line: 12, baseType: !133, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !55, file: !56, line: 17, baseType: !157, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !54, line: 113, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !163, line: 25, size: 1920, align: 64, elements: !164)
!163 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = !{!165, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !166, line: 3, baseType: !38, size: 32, align: 32)
!166 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !162, file: !166, line: 4, baseType: !38, size: 32, align: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !162, file: !166, line: 6, baseType: !38, size: 32, align: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !162, file: !166, line: 9, baseType: !63, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !162, file: !166, line: 10, baseType: !38, size: 32, align: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !162, file: !166, line: 11, baseType: !63, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !162, file: !166, line: 11, baseType: !63, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !162, file: !166, line: 11, baseType: !63, size: 64, align: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !162, file: !166, line: 13, baseType: !103, size: 16, align: 16, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !162, file: !166, line: 14, baseType: !63, size: 64, align: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !162, file: !166, line: 15, baseType: !63, size: 64, align: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !162, file: !166, line: 16, baseType: !38, size: 32, align: 32, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !162, file: !166, line: 17, baseType: !63, size: 64, align: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !162, file: !166, line: 19, baseType: !85, size: 64, align: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !162, file: !166, line: 19, baseType: !85, size: 64, align: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !162, file: !166, line: 21, baseType: !63, size: 64, align: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !162, file: !166, line: 22, baseType: !63, size: 64, align: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !162, file: !166, line: 23, baseType: !63, size: 64, align: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !162, file: !166, line: 24, baseType: !63, size: 64, align: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !162, file: !166, line: 26, baseType: !63, size: 64, align: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !162, file: !166, line: 27, baseType: !63, size: 64, align: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !162, file: !166, line: 28, baseType: !63, size: 64, align: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !162, file: !166, line: 29, baseType: !63, size: 64, align: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !162, file: !166, line: 30, baseType: !63, size: 64, align: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !162, file: !166, line: 31, baseType: !63, size: 64, align: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !162, file: !166, line: 32, baseType: !63, size: 64, align: 64, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !162, file: !166, line: 33, baseType: !63, size: 64, align: 64, offset: 1600)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !162, file: !166, line: 35, baseType: !194, size: 64, align: 64, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !197)
!197 = !{!198, !200, !338, !339, !344, !345, !346, !347, !348, !357, !358, !359, !363, !364, !365, !366, !367, !368, !369, !370}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !196, file: !4, line: 100, baseType: !199, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !40, line: 49, baseType: !38)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !196, file: !4, line: 101, baseType: !201, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !204)
!204 = !{!205, !225, !231, !237, !241, !325, !329, !334}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !203, file: !4, line: 133, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !194, !47, !210, !212, !213}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !43, line: 66, baseType: !211)
!211 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !216, line: 42, baseType: !217)
!216 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !216, line: 44, size: 128, align: 64, elements: !218)
!218 = !{!219, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !217, file: !216, line: 46, baseType: !220, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !221, line: 36, baseType: !222)
!221 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !43, line: 45, baseType: !60)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !217, file: !216, line: 47, baseType: !199, size: 32, align: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !217, file: !216, line: 48, baseType: !47, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !203, file: !4, line: 138, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!209, !194, !229, !210, !212, !213}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !203, file: !4, line: 143, baseType: !232, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!209, !194, !235, !236, !213}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !43, line: 51, baseType: !46)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !203, file: !4, line: 147, baseType: !238, size: 64, align: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!209, !194, !213}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !203, file: !4, line: 149, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !194, !324}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !248)
!248 = !{!249, !250, !271, !300, !302, !306, !307, !308, !309, !317, !318, !319, !320}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !247, file: !16, line: 174, baseType: !39, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !247, file: !16, line: 175, baseType: !251, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !254)
!254 = !{!255, !259, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !253, file: !16, line: 198, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !39}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !253, file: !16, line: 199, baseType: !256, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !253, file: !16, line: 200, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !39, !245, !264, !270}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !39}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !40, line: 50, baseType: !199)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !247, file: !16, line: 177, baseType: !272, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !276)
!276 = !{!277, !282, !286, !290, !294, !295}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !275, file: !16, line: 216, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!269, !245, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !275, file: !16, line: 218, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!269, !245}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !275, file: !16, line: 219, baseType: !287, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!269, !245, !265, !39}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !275, file: !16, line: 222, baseType: !291, size: 64, align: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !245}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !275, file: !16, line: 226, baseType: !265, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !275, file: !16, line: 227, baseType: !296, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !247, file: !16, line: 178, baseType: !301, size: 32, align: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !40, line: 55, baseType: !60)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !247, file: !16, line: 180, baseType: !303, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !247, file: !16, line: 182, baseType: !199, size: 32, align: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !247, file: !16, line: 183, baseType: !301, size: 32, align: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !247, file: !16, line: 184, baseType: !301, size: 32, align: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !247, file: !16, line: 186, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !312, line: 37, baseType: !313)
!312 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !312, line: 39, size: 128, align: 64, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !312, line: 41, baseType: !39, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !312, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !247, file: !16, line: 188, baseType: !245, size: 64, align: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !16, line: 189, baseType: !245, size: 64, align: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !16, line: 191, baseType: !63, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !247, file: !16, line: 193, baseType: !321, size: 64, align: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !203, file: !4, line: 151, baseType: !326, size: 64, align: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !194}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !203, file: !4, line: 152, baseType: !330, size: 64, align: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!209, !194, !333, !213}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !203, file: !4, line: 155, baseType: !335, size: 64, align: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!333, !194}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !196, file: !4, line: 103, baseType: !47, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !196, file: !4, line: 104, baseType: !340, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !341, line: 77, baseType: !342)
!341 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !341, line: 77, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !196, file: !4, line: 105, baseType: !340, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !196, file: !4, line: 106, baseType: !47, size: 64, align: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !196, file: !4, line: 107, baseType: !301, size: 32, align: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !196, file: !4, line: 109, baseType: !210, size: 64, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !196, file: !4, line: 110, baseType: !349, size: 64, align: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !351, line: 39, baseType: !352)
!351 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !351, line: 41, size: 192, align: 64, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !352, file: !351, line: 43, baseType: !47, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !352, file: !351, line: 44, baseType: !210, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !352, file: !351, line: 45, baseType: !210, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !196, file: !4, line: 111, baseType: !349, size: 64, align: 64, offset: 576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !196, file: !4, line: 112, baseType: !349, size: 64, align: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !196, file: !4, line: 113, baseType: !360, size: 48, align: 8, offset: 704)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, align: 8, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 6)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !196, file: !4, line: 117, baseType: !301, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !196, file: !4, line: 118, baseType: !301, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !196, file: !4, line: 119, baseType: !301, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !196, file: !4, line: 120, baseType: !301, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !196, file: !4, line: 121, baseType: !301, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !196, file: !4, line: 122, baseType: !301, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !196, file: !4, line: 124, baseType: !39, size: 64, align: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !196, file: !4, line: 125, baseType: !39, size: 64, align: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !162, file: !166, line: 38, baseType: !60, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !162, file: !166, line: 39, baseType: !60, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !162, file: !166, line: 40, baseType: !60, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !162, file: !166, line: 41, baseType: !60, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !162, file: !166, line: 42, baseType: !60, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !162, file: !166, line: 43, baseType: !60, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !162, file: !166, line: 44, baseType: !60, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !162, file: !166, line: 45, baseType: !60, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !162, file: !166, line: 46, baseType: !63, size: 64, align: 64, offset: 1792)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !162, file: !166, line: 47, baseType: !63, size: 64, align: 64, offset: 1856)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !55, file: !56, line: 18, baseType: !382, size: 64, align: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !160}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !55, file: !56, line: 20, baseType: !386, size: 64, align: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !160}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !54, line: 107, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !163, line: 30, size: 2240, align: 64, elements: !392)
!392 = !{!393, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !416, !417, !418, !422, !423, !424, !425, !426, !427, !428, !429, !430, !436, !437, !438, !439, !440, !444, !448, !452, !456, !460, !465, !472, !479, !483}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !391, file: !394, line: 3, baseType: !38, size: 32, align: 32)
!394 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !391, file: !394, line: 4, baseType: !38, size: 32, align: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !391, file: !394, line: 6, baseType: !38, size: 32, align: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !391, file: !394, line: 8, baseType: !160, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !391, file: !394, line: 9, baseType: !121, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !391, file: !394, line: 10, baseType: !121, size: 64, align: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !391, file: !394, line: 12, baseType: !63, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !391, file: !394, line: 13, baseType: !63, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !391, file: !394, line: 15, baseType: !60, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !391, file: !394, line: 16, baseType: !60, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !391, file: !394, line: 17, baseType: !60, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !391, file: !394, line: 18, baseType: !60, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !391, file: !394, line: 19, baseType: !60, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !391, file: !394, line: 21, baseType: !408, size: 64, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !54, line: 102, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !54, line: 102, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !391, file: !394, line: 22, baseType: !38, size: 32, align: 32, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !391, file: !394, line: 25, baseType: !413, size: 128, align: 64, offset: 640)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 128, align: 64, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !391, file: !394, line: 26, baseType: !38, size: 32, align: 32, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !391, file: !394, line: 27, baseType: !38, size: 32, align: 32, offset: 800)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !391, file: !394, line: 29, baseType: !419, size: 64, align: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !54, line: 103, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !54, line: 103, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !391, file: !394, line: 30, baseType: !133, size: 64, align: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !391, file: !394, line: 32, baseType: !63, size: 64, align: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !391, file: !394, line: 33, baseType: !63, size: 64, align: 64, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !391, file: !394, line: 34, baseType: !63, size: 64, align: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !391, file: !394, line: 35, baseType: !60, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !391, file: !394, line: 36, baseType: !60, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !391, file: !394, line: 37, baseType: !60, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !391, file: !394, line: 38, baseType: !60, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !391, file: !394, line: 40, baseType: !431, size: 128, align: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !40, line: 504, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !40, line: 506, size: 128, align: 64, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !432, file: !40, line: 508, baseType: !45, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !432, file: !40, line: 509, baseType: !45, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !391, file: !394, line: 41, baseType: !121, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !391, file: !394, line: 42, baseType: !38, size: 32, align: 32, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !391, file: !394, line: 44, baseType: !310, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !391, file: !394, line: 45, baseType: !310, size: 64, align: 64, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !391, file: !394, line: 53, baseType: !441, size: 64, align: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !389, !50, !38}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !391, file: !394, line: 55, baseType: !445, size: 64, align: 64, offset: 1664)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!38, !389, !49}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !391, file: !394, line: 57, baseType: !449, size: 64, align: 64, offset: 1728)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!38, !389, !50}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !391, file: !394, line: 60, baseType: !453, size: 64, align: 64, offset: 1792)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!50, !389}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !391, file: !394, line: 62, baseType: !457, size: 64, align: 64, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !389, !50, !50, !38}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !391, file: !394, line: 65, baseType: !461, size: 64, align: 64, offset: 1920)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!464, !389, !50, !50}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !391, file: !394, line: 69, baseType: !466, size: 64, align: 64, offset: 1984)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !389, !50}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !54, line: 109, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !54, line: 109, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !391, file: !394, line: 70, baseType: !473, size: 64, align: 64, offset: 2048)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !389, !50}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !54, line: 110, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !54, line: 110, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !391, file: !394, line: 71, baseType: !480, size: 64, align: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!38, !50, !50}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !391, file: !394, line: 73, baseType: !480, size: 64, align: 64, offset: 2176)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "server_connect", scope: !55, file: !56, line: 21, baseType: !485, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !389}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "channel_create", scope: !55, file: !56, line: 22, baseType: !489, size: 64, align: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!469, !389, !50, !50, !38}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "query_create", scope: !55, file: !56, line: 24, baseType: !493, size: 64, align: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!476, !50, !50, !38}
!496 = !{!497, !499}
!497 = distinct !DIGlobalVariable(name: "chat_protocols", scope: !0, file: !498, line: 31, type: !310, isLocal: false, isDefinition: true, variable: %struct._GSList** @chat_protocols)
!498 = !DIFile(filename: "chat-protocols.c", directory: "/home/lichi/Desktop/irssi/task1")
!499 = distinct !DIGlobalVariable(name: "default_proto", scope: !0, file: !498, line: 33, type: !52, isLocal: true, isDefinition: true, variable: %struct._CHAT_PROTOCOL_REC** @default_proto)
!500 = !{i32 2, !"Dwarf Version", i32 4}
!501 = !{i32 2, !"Debug Info Version", i32 3}
!502 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!503 = distinct !DISubprogram(name: "chat_protocol_check_cast", scope: !498, file: !498, line: 35, type: !504, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!36, !36, !38, !50}
!506 = !{}
!507 = !DILocalVariable(name: "object", arg: 1, scope: !503, file: !498, line: 35, type: !36)
!508 = !DIExpression()
!509 = !DILocation(line: 35, column: 38, scope: !503)
!510 = !DILocalVariable(name: "type_pos", arg: 2, scope: !503, file: !498, line: 35, type: !38)
!511 = !DILocation(line: 35, column: 50, scope: !503)
!512 = !DILocalVariable(name: "id", arg: 3, scope: !503, file: !498, line: 35, type: !50)
!513 = !DILocation(line: 35, column: 72, scope: !503)
!514 = !DILocation(line: 37, column: 9, scope: !503)
!515 = !DILocation(line: 37, column: 16, scope: !503)
!516 = !DILocation(line: 37, column: 23, scope: !503)
!517 = !DILocation(line: 38, column: 24, scope: !503)
!518 = !DILocation(line: 38, column: 3, scope: !503)
!519 = !DILocation(line: 39, column: 37, scope: !503)
!520 = !DILocation(line: 39, column: 58, scope: !503)
!521 = !DILocation(line: 39, column: 48, scope: !503)
!522 = !DILocation(line: 39, column: 46, scope: !503)
!523 = !DILocation(line: 39, column: 5, scope: !503)
!524 = !DILocation(line: 39, column: 4, scope: !503)
!525 = !DILocation(line: 38, column: 28, scope: !503)
!526 = !DILocation(line: 37, column: 9, scope: !527)
!527 = !DILexicalBlockFile(scope: !503, file: !498, discriminator: 1)
!528 = !DILocation(line: 37, column: 9, scope: !529)
!529 = !DILexicalBlockFile(scope: !503, file: !498, discriminator: 2)
!530 = !DILocation(line: 39, column: 50, scope: !527)
!531 = !DILocation(line: 37, column: 9, scope: !532)
!532 = !DILexicalBlockFile(scope: !503, file: !498, discriminator: 3)
!533 = !DILocation(line: 37, column: 9, scope: !534)
!534 = !DILexicalBlockFile(scope: !503, file: !498, discriminator: 4)
!535 = !DILocation(line: 37, column: 2, scope: !534)
!536 = distinct !DISubprogram(name: "chat_protocol_lookup", scope: !498, file: !498, line: 43, type: !537, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !506)
!537 = !DISubroutineType(types: !538)
!538 = !{!38, !50}
!539 = !DILocalVariable(name: "name", arg: 1, scope: !536, file: !498, line: 43, type: !50)
!540 = !DILocation(line: 43, column: 38, scope: !536)
!541 = !DILocalVariable(name: "rec", scope: !536, file: !498, line: 45, type: !52)
!542 = !DILocation(line: 45, column: 21, scope: !536)
!543 = !DILocation(line: 47, column: 2, scope: !536)
!544 = distinct !{!544, !543}
!545 = !DILocation(line: 47, column: 10, scope: !546)
!546 = !DILexicalBlockFile(scope: !547, file: !498, discriminator: 1)
!547 = distinct !DILexicalBlock(scope: !548, file: !498, line: 47, column: 10)
!548 = distinct !DILexicalBlock(scope: !536, file: !498, line: 47, column: 4)
!549 = !DILocation(line: 47, column: 15, scope: !546)
!550 = !DILocation(line: 47, column: 5, scope: !551)
