; ModuleID = './line328-fe-cap.o.i'
source_filename = "./line328-fe-cap.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { i8*, i32 }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!119 = !DIEnumerator(name: "IRCTXT_BANLIST_LONG", value: 50)
!120 = !DIEnumerator(name: "IRCTXT_EBANLIST", value: 51)
!121 = !DIEnumerator(name: "IRCTXT_EBANLIST_LONG", value: 52)
!122 = !DIEnumerator(name: "IRCTXT_NO_INVITELIST", value: 53)
!123 = !DIEnumerator(name: "IRCTXT_INVITELIST", value: 54)
!124 = !DIEnumerator(name: "IRCTXT_INVITELIST_LONG", value: 55)
!125 = !DIEnumerator(name: "IRCTXT_NO_SUCH_CHANNEL", value: 56)
!126 = !DIEnumerator(name: "IRCTXT_CHANNEL_SYNCED", value: 57)
!127 = !DIEnumerator(name: "IRCTXT_FILL_4", value: 58)
!128 = !DIEnumerator(name: "IRCTXT_USERMODE_CHANGE", value: 59)
!129 = !DIEnumerator(name: "IRCTXT_USER_MODE", value: 60)
!130 = !DIEnumerator(name: "IRCTXT_AWAY", value: 61)
!131 = !DIEnumerator(name: "IRCTXT_UNAWAY", value: 62)
!132 = !DIEnumerator(name: "IRCTXT_NICK_AWAY", value: 63)
!133 = !DIEnumerator(name: "IRCTXT_NO_SUCH_NICK", value: 64)
!134 = !DIEnumerator(name: "IRCTXT_NICK_IN_USE", value: 65)
!135 = !DIEnumerator(name: "IRCTXT_NICK_UNAVAILABLE", value: 66)
!136 = !DIEnumerator(name: "IRCTXT_YOUR_NICK_OWNED", value: 67)
!137 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!138 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!139 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!140 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!141 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!142 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!143 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!144 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !{!193, !200}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !194, line: 9, baseType: !195)
!194 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !198, !198, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !{!202}
!202 = distinct !DIGlobalVariable(name: "fe_cap_messages", scope: !0, file: !203, line: 34, type: !204, isLocal: true, isDefinition: true, variable: [6 x %struct.anon]* @fe_cap_messages)
!203 = !DIFile(filename: "fe-cap.c", directory: "/home/lichi/Desktop/irssi/task1")
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 768, align: 64, elements: !215)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 31, size: 128, align: 64, elements: !207)
!207 = !{!208, !212}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !206, file: !203, line: 32, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "template", scope: !206, file: !203, line: 33, baseType: !213, size: 32, align: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!215 = !{!216}
!216 = !DISubrange(count: 6)
!217 = !{i32 2, !"Dwarf Version", i32 4}
!218 = !{i32 2, !"Debug Info Version", i32 3}
!219 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!220 = distinct !DISubprogram(name: "fe_cap_init", scope: !203, file: !203, line: 74, type: !221, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !223)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !{}
!224 = !DILocation(line: 76, column: 2, scope: !220)
!225 = !DILocation(line: 77, column: 2, scope: !220)
!226 = !DILocation(line: 78, column: 1, scope: !220)
!227 = distinct !DISubprogram(name: "event_cap", scope: !203, file: !203, line: 43, type: !228, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !223)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230, !250, !250, !250}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !232, line: 6, baseType: !233)
!232 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !234, line: 42, size: 39168, align: 64, elements: !235)
!234 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!235 = !{!236, !238, !239, !240, !482, !487, !488, !489, !490, !491, !492, !493, !494, !495, !499, !500, !504, !505, !506, !510, !515, !516, !517, !518, !519, !520, !521, !522, !529, !530, !531, !532, !533, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !855, !857}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !237, line: 3, baseType: !214, size: 32, align: 32)
!237 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !233, file: !237, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !233, file: !237, line: 6, baseType: !214, size: 32, align: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !233, file: !237, line: 8, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !232, line: 5, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !234, line: 24, size: 2496, align: 64, elements: !244)
!244 = !{!245, !247, !248, !249, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !246, line: 3, baseType: !214, size: 32, align: 32)
!246 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !243, file: !246, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !243, file: !246, line: 6, baseType: !214, size: 32, align: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !243, file: !246, line: 9, baseType: !250, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !243, file: !246, line: 10, baseType: !214, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !243, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !243, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !243, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !243, file: !246, line: 13, baseType: !256, size: 16, align: 16, offset: 448)
!256 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !243, file: !246, line: 14, baseType: !250, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !243, file: !246, line: 15, baseType: !250, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !243, file: !246, line: 16, baseType: !214, size: 32, align: 32, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !243, file: !246, line: 17, baseType: !250, size: 64, align: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !243, file: !246, line: 19, baseType: !262, size: 64, align: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !264, line: 99, baseType: !265)
!264 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !264, line: 99, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !243, file: !246, line: 19, baseType: !262, size: 64, align: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !243, file: !246, line: 21, baseType: !250, size: 64, align: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !243, file: !246, line: 22, baseType: !250, size: 64, align: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !243, file: !246, line: 23, baseType: !250, size: 64, align: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !243, file: !246, line: 24, baseType: !250, size: 64, align: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !243, file: !246, line: 26, baseType: !250, size: 64, align: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !243, file: !246, line: 27, baseType: !250, size: 64, align: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !243, file: !246, line: 28, baseType: !250, size: 64, align: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !243, file: !246, line: 29, baseType: !250, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !243, file: !246, line: 30, baseType: !250, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !243, file: !246, line: 31, baseType: !250, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !243, file: !246, line: 32, baseType: !250, size: 64, align: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !243, file: !246, line: 33, baseType: !250, size: 64, align: 64, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !243, file: !246, line: 35, baseType: !280, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !283)
!283 = !{!284, !287, !429, !430, !435, !436, !437, !438, !439, !448, !449, !450, !452, !453, !454, !455, !456, !457, !458, !459}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !282, file: !4, line: 100, baseType: !285, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !286, line: 49, baseType: !214)
!286 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !282, file: !4, line: 101, baseType: !288, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !291)
!291 = !{!292, !316, !322, !329, !333, !416, !420, !425}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !290, file: !4, line: 133, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!296, !280, !297, !299, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !286, line: 46, baseType: !211)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !300, line: 66, baseType: !301)
!300 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!301 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !306, line: 42, baseType: !307)
!306 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !306, line: 44, size: 128, align: 64, elements: !308)
!308 = !{!309, !314, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !307, file: !306, line: 46, baseType: !310, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !311, line: 36, baseType: !312)
!311 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !300, line: 45, baseType: !313)
!313 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !307, file: !306, line: 47, baseType: !285, size: 32, align: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !307, file: !306, line: 48, baseType: !297, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !290, file: !4, line: 138, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!296, !280, !320, !299, !302, !303}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !290, file: !4, line: 143, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!296, !280, !326, !328, !303}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !300, line: 51, baseType: !327)
!327 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !290, file: !4, line: 147, baseType: !330, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!296, !280, !303}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !290, file: !4, line: 149, baseType: !334, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !280, !415}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !340)
!340 = !{!341, !343, !364, !391, !393, !397, !398, !399, !400, !408, !409, !410, !411}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !339, file: !16, line: 174, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !286, line: 77, baseType: !200)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !339, file: !16, line: 175, baseType: !344, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !347)
!347 = !{!348, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !346, file: !16, line: 198, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !342}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !346, file: !16, line: 199, baseType: !349, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !346, file: !16, line: 200, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !342, !337, !357, !363}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!362, !342}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !286, line: 50, baseType: !285)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !339, file: !16, line: 177, baseType: !365, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !369)
!369 = !{!370, !375, !379, !383, !387, !388}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !368, file: !16, line: 216, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!362, !337, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !368, file: !16, line: 218, baseType: !376, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!362, !337}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !368, file: !16, line: 219, baseType: !380, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!362, !337, !358, !342}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !368, file: !16, line: 222, baseType: !384, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !337}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !368, file: !16, line: 226, baseType: !358, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !368, file: !16, line: 227, baseType: !389, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !339, file: !16, line: 178, baseType: !392, size: 32, align: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !286, line: 55, baseType: !313)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !339, file: !16, line: 180, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !339, file: !16, line: 182, baseType: !285, size: 32, align: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !16, line: 183, baseType: !392, size: 32, align: 32, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !339, file: !16, line: 184, baseType: !392, size: 32, align: 32, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !339, file: !16, line: 186, baseType: !401, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !403, line: 37, baseType: !404)
!403 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !403, line: 39, size: 128, align: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !403, line: 41, baseType: !342, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !403, line: 42, baseType: !401, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !16, line: 188, baseType: !337, size: 64, align: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !16, line: 189, baseType: !337, size: 64, align: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !16, line: 191, baseType: !250, size: 64, align: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !339, file: !16, line: 193, baseType: !412, size: 64, align: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !290, file: !4, line: 151, baseType: !417, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !280}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !290, file: !4, line: 152, baseType: !421, size: 64, align: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!296, !280, !424, !303}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !290, file: !4, line: 155, baseType: !426, size: 64, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!424, !280}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !282, file: !4, line: 103, baseType: !297, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !282, file: !4, line: 104, baseType: !431, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !432, line: 77, baseType: !433)
!432 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !432, line: 77, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !282, file: !4, line: 105, baseType: !431, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !282, file: !4, line: 106, baseType: !297, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !282, file: !4, line: 107, baseType: !392, size: 32, align: 32, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !282, file: !4, line: 109, baseType: !299, size: 64, align: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !282, file: !4, line: 110, baseType: !440, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !442, line: 39, baseType: !443)
!442 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !442, line: 41, size: 192, align: 64, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !443, file: !442, line: 43, baseType: !297, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !443, file: !442, line: 44, baseType: !299, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !443, file: !442, line: 45, baseType: !299, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !282, file: !4, line: 111, baseType: !440, size: 64, align: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !282, file: !4, line: 112, baseType: !440, size: 64, align: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !282, file: !4, line: 113, baseType: !451, size: 48, align: 8, offset: 704)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 48, align: 8, elements: !215)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !282, file: !4, line: 117, baseType: !392, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !282, file: !4, line: 118, baseType: !392, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !282, file: !4, line: 119, baseType: !392, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !282, file: !4, line: 120, baseType: !392, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !282, file: !4, line: 121, baseType: !392, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !282, file: !4, line: 122, baseType: !392, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !282, file: !4, line: 124, baseType: !342, size: 64, align: 64, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !282, file: !4, line: 125, baseType: !342, size: 64, align: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !243, file: !246, line: 38, baseType: !313, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !243, file: !246, line: 39, baseType: !313, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !243, file: !246, line: 40, baseType: !313, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !243, file: !246, line: 41, baseType: !313, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !243, file: !246, line: 42, baseType: !313, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !243, file: !246, line: 43, baseType: !313, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !243, file: !246, line: 44, baseType: !313, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !243, file: !246, line: 45, baseType: !313, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !243, file: !246, line: 46, baseType: !250, size: 64, align: 64, offset: 1792)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !243, file: !246, line: 47, baseType: !250, size: 64, align: 64, offset: 1856)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !243, file: !234, line: 27, baseType: !250, size: 64, align: 64, offset: 1920)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !243, file: !234, line: 28, baseType: !250, size: 64, align: 64, offset: 1984)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !243, file: !234, line: 30, baseType: !214, size: 32, align: 32, offset: 2048)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !243, file: !234, line: 31, baseType: !250, size: 64, align: 64, offset: 2112)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !243, file: !234, line: 32, baseType: !250, size: 64, align: 64, offset: 2176)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !243, file: !234, line: 34, baseType: !214, size: 32, align: 32, offset: 2240)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !243, file: !234, line: 35, baseType: !214, size: 32, align: 32, offset: 2272)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !243, file: !234, line: 36, baseType: !214, size: 32, align: 32, offset: 2304)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !243, file: !234, line: 38, baseType: !214, size: 32, align: 32, offset: 2336)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !243, file: !234, line: 38, baseType: !214, size: 32, align: 32, offset: 2368)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !243, file: !234, line: 38, baseType: !214, size: 32, align: 32, offset: 2400)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !243, file: !234, line: 38, baseType: !214, size: 32, align: 32, offset: 2432)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !233, file: !237, line: 9, baseType: !483, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !484, line: 75, baseType: !485)
!484 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !486, line: 139, baseType: !327)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !233, file: !237, line: 10, baseType: !483, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !233, file: !237, line: 12, baseType: !250, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !233, file: !237, line: 13, baseType: !250, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !233, file: !237, line: 15, baseType: !313, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !233, file: !237, line: 16, baseType: !313, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !233, file: !237, line: 17, baseType: !313, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !233, file: !237, line: 18, baseType: !313, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !233, file: !237, line: 19, baseType: !313, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !233, file: !237, line: 21, baseType: !496, size: 64, align: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !264, line: 102, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !264, line: 102, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !233, file: !237, line: 22, baseType: !214, size: 32, align: 32, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !233, file: !237, line: 25, baseType: !501, size: 128, align: 64, offset: 640)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, align: 64, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 2)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !233, file: !237, line: 26, baseType: !214, size: 32, align: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !233, file: !237, line: 27, baseType: !214, size: 32, align: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !233, file: !237, line: 29, baseType: !507, size: 64, align: 64, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !264, line: 103, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !264, line: 103, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !233, file: !237, line: 30, baseType: !511, size: 64, align: 64, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !513, line: 37, baseType: !514)
!513 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !513, line: 37, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !233, file: !237, line: 32, baseType: !250, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !233, file: !237, line: 33, baseType: !250, size: 64, align: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !233, file: !237, line: 34, baseType: !250, size: 64, align: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !233, file: !237, line: 35, baseType: !313, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !233, file: !237, line: 36, baseType: !313, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !233, file: !237, line: 37, baseType: !313, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !233, file: !237, line: 38, baseType: !313, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !233, file: !237, line: 40, baseType: !523, size: 128, align: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !286, line: 504, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !286, line: 506, size: 128, align: 64, elements: !525)
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !524, file: !286, line: 508, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !286, line: 48, baseType: !327)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !524, file: !286, line: 509, baseType: !527, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !233, file: !237, line: 41, baseType: !483, size: 64, align: 64, offset: 1344)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !233, file: !237, line: 42, baseType: !214, size: 32, align: 32, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !233, file: !237, line: 44, baseType: !401, size: 64, align: 64, offset: 1472)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !233, file: !237, line: 45, baseType: !401, size: 64, align: 64, offset: 1536)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !233, file: !237, line: 53, baseType: !534, size: 64, align: 64, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !537, !209, !214}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !264, line: 107, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !540, line: 30, size: 2240, align: 64, elements: !541)
!540 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!541 = !{!542, !543, !544, !545, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !621, !625, !629, !633, !638, !731, !738, !742}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !237, line: 3, baseType: !214, size: 32, align: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !539, file: !237, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !539, file: !237, line: 6, baseType: !214, size: 32, align: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !539, file: !237, line: 8, baseType: !546, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !264, line: 113, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !540, line: 25, size: 1920, align: 64, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !548, file: !246, line: 3, baseType: !214, size: 32, align: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !548, file: !246, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !548, file: !246, line: 6, baseType: !214, size: 32, align: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !548, file: !246, line: 9, baseType: !250, size: 64, align: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !548, file: !246, line: 10, baseType: !214, size: 32, align: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !548, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !548, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !548, file: !246, line: 11, baseType: !250, size: 64, align: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !548, file: !246, line: 13, baseType: !256, size: 16, align: 16, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !548, file: !246, line: 14, baseType: !250, size: 64, align: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !548, file: !246, line: 15, baseType: !250, size: 64, align: 64, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !548, file: !246, line: 16, baseType: !214, size: 32, align: 32, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !548, file: !246, line: 17, baseType: !250, size: 64, align: 64, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !548, file: !246, line: 19, baseType: !262, size: 64, align: 64, offset: 768)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !548, file: !246, line: 19, baseType: !262, size: 64, align: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !548, file: !246, line: 21, baseType: !250, size: 64, align: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !548, file: !246, line: 22, baseType: !250, size: 64, align: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !548, file: !246, line: 23, baseType: !250, size: 64, align: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !548, file: !246, line: 24, baseType: !250, size: 64, align: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !548, file: !246, line: 26, baseType: !250, size: 64, align: 64, offset: 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !548, file: !246, line: 27, baseType: !250, size: 64, align: 64, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !548, file: !246, line: 28, baseType: !250, size: 64, align: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !548, file: !246, line: 29, baseType: !250, size: 64, align: 64, offset: 1344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !548, file: !246, line: 30, baseType: !250, size: 64, align: 64, offset: 1408)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !548, file: !246, line: 31, baseType: !250, size: 64, align: 64, offset: 1472)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !548, file: !246, line: 32, baseType: !250, size: 64, align: 64, offset: 1536)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !548, file: !246, line: 33, baseType: !250, size: 64, align: 64, offset: 1600)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !548, file: !246, line: 35, baseType: !280, size: 64, align: 64, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !548, file: !246, line: 38, baseType: !313, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !548, file: !246, line: 39, baseType: !313, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !548, file: !246, line: 40, baseType: !313, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !548, file: !246, line: 41, baseType: !313, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !548, file: !246, line: 42, baseType: !313, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !548, file: !246, line: 43, baseType: !313, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !548, file: !246, line: 44, baseType: !313, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !548, file: !246, line: 45, baseType: !313, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !548, file: !246, line: 46, baseType: !250, size: 64, align: 64, offset: 1792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !548, file: !246, line: 47, baseType: !250, size: 64, align: 64, offset: 1856)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !539, file: !237, line: 9, baseType: !483, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !539, file: !237, line: 10, baseType: !483, size: 64, align: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !539, file: !237, line: 12, baseType: !250, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !539, file: !237, line: 13, baseType: !250, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !539, file: !237, line: 15, baseType: !313, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !539, file: !237, line: 16, baseType: !313, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !539, file: !237, line: 17, baseType: !313, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !539, file: !237, line: 18, baseType: !313, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !539, file: !237, line: 19, baseType: !313, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !539, file: !237, line: 21, baseType: !496, size: 64, align: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !539, file: !237, line: 22, baseType: !214, size: 32, align: 32, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !539, file: !237, line: 25, baseType: !501, size: 128, align: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !539, file: !237, line: 26, baseType: !214, size: 32, align: 32, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !539, file: !237, line: 27, baseType: !214, size: 32, align: 32, offset: 800)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !539, file: !237, line: 29, baseType: !507, size: 64, align: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !539, file: !237, line: 30, baseType: !511, size: 64, align: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !539, file: !237, line: 32, baseType: !250, size: 64, align: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !539, file: !237, line: 33, baseType: !250, size: 64, align: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !539, file: !237, line: 34, baseType: !250, size: 64, align: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !539, file: !237, line: 35, baseType: !313, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !539, file: !237, line: 36, baseType: !313, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !539, file: !237, line: 37, baseType: !313, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !539, file: !237, line: 38, baseType: !313, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !539, file: !237, line: 40, baseType: !523, size: 128, align: 64, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !539, file: !237, line: 41, baseType: !483, size: 64, align: 64, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !539, file: !237, line: 42, baseType: !214, size: 32, align: 32, offset: 1408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !539, file: !237, line: 44, baseType: !401, size: 64, align: 64, offset: 1472)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !539, file: !237, line: 45, baseType: !401, size: 64, align: 64, offset: 1536)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !539, file: !237, line: 53, baseType: !534, size: 64, align: 64, offset: 1600)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !539, file: !237, line: 55, baseType: !618, size: 64, align: 64, offset: 1664)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!214, !537, !211}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !539, file: !237, line: 57, baseType: !622, size: 64, align: 64, offset: 1728)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!214, !537, !209}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !539, file: !237, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!209, !537}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !539, file: !237, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !537, !209, !209, !214}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !539, file: !237, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !537, !209, !209}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !539, file: !237, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !537, !209}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !264, line: 109, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !645, line: 15, size: 1408, align: 64, elements: !646)
!645 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!646 = !{!647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !682, !683, !685, !686, !687, !688, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !648, line: 3, baseType: !214, size: 32, align: 32)
!648 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !644, file: !648, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !644, file: !648, line: 5, baseType: !511, size: 64, align: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !644, file: !648, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !644, file: !648, line: 8, baseType: !537, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !644, file: !648, line: 9, baseType: !250, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !648, line: 10, baseType: !250, size: 64, align: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !644, file: !648, line: 11, baseType: !483, size: 64, align: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !644, file: !648, line: 12, baseType: !214, size: 32, align: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !644, file: !648, line: 13, baseType: !250, size: 64, align: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !644, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !264, line: 108, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !665, line: 5, size: 704, align: 64, elements: !666)
!665 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !648, line: 3, baseType: !214, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !664, file: !648, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !664, file: !648, line: 5, baseType: !511, size: 64, align: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !664, file: !648, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !664, file: !648, line: 8, baseType: !537, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !664, file: !648, line: 9, baseType: !250, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !648, line: 10, baseType: !250, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !664, file: !648, line: 11, baseType: !483, size: 64, align: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !664, file: !648, line: 12, baseType: !214, size: 32, align: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !664, file: !648, line: 13, baseType: !250, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !664, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !664, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!209, !662}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !644, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !644, file: !684, line: 5, baseType: !250, size: 64, align: 64, offset: 704)
!684 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !644, file: !684, line: 6, baseType: !250, size: 64, align: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !644, file: !684, line: 7, baseType: !483, size: 64, align: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !644, file: !684, line: 9, baseType: !511, size: 64, align: 64, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !644, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !264, line: 111, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !692, line: 13, size: 576, align: 64, elements: !693)
!692 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!693 = !{!694, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !712, !713}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !695, line: 3, baseType: !214, size: 32, align: 32)
!695 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !691, file: !695, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !691, file: !695, line: 6, baseType: !483, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !691, file: !695, line: 8, baseType: !250, size: 64, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !691, file: !695, line: 9, baseType: !250, size: 64, align: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !691, file: !695, line: 10, baseType: !250, size: 64, align: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !691, file: !695, line: 11, baseType: !214, size: 32, align: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !691, file: !695, line: 14, baseType: !313, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !691, file: !695, line: 15, baseType: !313, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !691, file: !695, line: 18, baseType: !313, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !691, file: !695, line: 19, baseType: !313, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !691, file: !695, line: 20, baseType: !313, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !691, file: !695, line: 21, baseType: !313, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !691, file: !695, line: 22, baseType: !709, size: 64, align: 8, offset: 360)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 64, align: 8, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !691, file: !695, line: 26, baseType: !200, size: 64, align: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !695, line: 28, baseType: !689, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !644, file: !684, line: 12, baseType: !313, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !644, file: !684, line: 13, baseType: !250, size: 64, align: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !644, file: !684, line: 14, baseType: !214, size: 32, align: 32, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !644, file: !684, line: 15, baseType: !250, size: 64, align: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !644, file: !684, line: 17, baseType: !313, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !644, file: !684, line: 18, baseType: !313, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !644, file: !684, line: 19, baseType: !313, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !644, file: !684, line: 20, baseType: !313, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !644, file: !684, line: 22, baseType: !313, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !644, file: !684, line: 23, baseType: !313, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !644, file: !684, line: 24, baseType: !313, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !644, file: !684, line: 25, baseType: !313, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !644, file: !684, line: 26, baseType: !313, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !644, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!250, !642}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !539, file: !237, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !537, !209}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !264, line: 110, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !264, line: 110, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !539, file: !237, line: 71, baseType: !739, size: 64, align: 64, offset: 2112)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64, align: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!214, !209, !209}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !539, file: !237, line: 73, baseType: !739, size: 64, align: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !233, file: !237, line: 55, baseType: !618, size: 64, align: 64, offset: 1664)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !233, file: !237, line: 57, baseType: !622, size: 64, align: 64, offset: 1728)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !233, file: !237, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !233, file: !237, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !233, file: !237, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !233, file: !237, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !233, file: !237, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !233, file: !237, line: 71, baseType: !739, size: 64, align: 64, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !233, file: !237, line: 73, baseType: !739, size: 64, align: 64, offset: 2176)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !233, file: !234, line: 46, baseType: !401, size: 64, align: 64, offset: 2240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !233, file: !234, line: 47, baseType: !401, size: 64, align: 64, offset: 2304)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !233, file: !234, line: 48, baseType: !755, size: 64, align: 64, offset: 2368)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !232, line: 8, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !232, line: 8, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !233, file: !234, line: 49, baseType: !401, size: 64, align: 64, offset: 2432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !233, file: !234, line: 51, baseType: !250, size: 64, align: 64, offset: 2496)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !233, file: !234, line: 53, baseType: !250, size: 64, align: 64, offset: 2560)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !233, file: !234, line: 54, baseType: !250, size: 64, align: 64, offset: 2624)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !233, file: !234, line: 55, baseType: !250, size: 64, align: 64, offset: 2688)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !233, file: !234, line: 56, baseType: !250, size: 64, align: 64, offset: 2752)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !233, file: !234, line: 57, baseType: !214, size: 32, align: 32, offset: 2816)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !233, file: !234, line: 59, baseType: !313, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !233, file: !234, line: 60, baseType: !313, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !233, file: !234, line: 62, baseType: !313, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !233, file: !234, line: 63, baseType: !313, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !233, file: !234, line: 64, baseType: !313, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !233, file: !234, line: 65, baseType: !313, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !233, file: !234, line: 66, baseType: !313, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !233, file: !234, line: 67, baseType: !313, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !233, file: !234, line: 68, baseType: !313, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !233, file: !234, line: 69, baseType: !313, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !233, file: !234, line: 70, baseType: !313, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !233, file: !234, line: 71, baseType: !313, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !233, file: !234, line: 72, baseType: !313, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !233, file: !234, line: 74, baseType: !214, size: 32, align: 32, offset: 2880)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !233, file: !234, line: 75, baseType: !214, size: 32, align: 32, offset: 2912)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !233, file: !234, line: 76, baseType: !214, size: 32, align: 32, offset: 2944)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !233, file: !234, line: 77, baseType: !214, size: 32, align: 32, offset: 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !233, file: !234, line: 79, baseType: !511, size: 64, align: 64, offset: 3008)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !233, file: !234, line: 80, baseType: !401, size: 64, align: 64, offset: 3072)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !233, file: !234, line: 81, baseType: !401, size: 64, align: 64, offset: 3136)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !233, file: !234, line: 83, baseType: !440, size: 64, align: 64, offset: 3200)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !233, file: !234, line: 84, baseType: !392, size: 32, align: 32, offset: 3264)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !233, file: !234, line: 87, baseType: !214, size: 32, align: 32, offset: 3296)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !233, file: !234, line: 91, baseType: !401, size: 64, align: 64, offset: 3328)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !233, file: !234, line: 92, baseType: !523, size: 128, align: 64, offset: 3392)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !233, file: !234, line: 93, baseType: !523, size: 128, align: 64, offset: 3520)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !233, file: !234, line: 95, baseType: !214, size: 32, align: 32, offset: 3648)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !233, file: !234, line: 96, baseType: !214, size: 32, align: 32, offset: 3680)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !233, file: !234, line: 97, baseType: !214, size: 32, align: 32, offset: 3712)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !233, file: !234, line: 100, baseType: !401, size: 64, align: 64, offset: 3776)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !233, file: !234, line: 103, baseType: !401, size: 64, align: 64, offset: 3840)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !233, file: !234, line: 106, baseType: !401, size: 64, align: 64, offset: 3904)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !233, file: !234, line: 108, baseType: !511, size: 64, align: 64, offset: 3968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !233, file: !234, line: 109, baseType: !401, size: 64, align: 64, offset: 4032)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !233, file: !234, line: 111, baseType: !401, size: 64, align: 64, offset: 4096)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !233, file: !234, line: 114, baseType: !200, size: 64, align: 64, offset: 4160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !233, file: !234, line: 116, baseType: !511, size: 64, align: 64, offset: 4224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !233, file: !234, line: 117, baseType: !803, size: 32768, align: 64, offset: 4288)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 32768, align: 64, elements: !853)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !805, line: 10, size: 128, align: 64, elements: !806)
!805 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!806 = !{!807, !852}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !804, file: !805, line: 11, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !805, line: 7, baseType: !810)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !812, !209, !211, !211, !250, !440}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !232, line: 7, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !815, line: 15, size: 1600, align: 64, elements: !816)
!815 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !814, file: !648, line: 3, baseType: !214, size: 32, align: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !814, file: !648, line: 4, baseType: !214, size: 32, align: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !814, file: !648, line: 5, baseType: !511, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !814, file: !648, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !814, file: !648, line: 8, baseType: !230, size: 64, align: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !814, file: !648, line: 9, baseType: !250, size: 64, align: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !648, line: 10, baseType: !250, size: 64, align: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !814, file: !648, line: 11, baseType: !483, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !814, file: !648, line: 12, baseType: !214, size: 32, align: 32, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !814, file: !648, line: 13, baseType: !250, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !814, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !814, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !814, file: !684, line: 5, baseType: !250, size: 64, align: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !814, file: !684, line: 6, baseType: !250, size: 64, align: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !814, file: !684, line: 7, baseType: !483, size: 64, align: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !814, file: !684, line: 9, baseType: !511, size: 64, align: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !814, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !814, file: !684, line: 12, baseType: !313, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !814, file: !684, line: 13, baseType: !250, size: 64, align: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !814, file: !684, line: 14, baseType: !214, size: 32, align: 32, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !814, file: !684, line: 15, baseType: !250, size: 64, align: 64, offset: 1216)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !814, file: !684, line: 17, baseType: !313, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !814, file: !684, line: 18, baseType: !313, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !814, file: !684, line: 19, baseType: !313, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !814, file: !684, line: 20, baseType: !313, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !814, file: !684, line: 22, baseType: !313, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !814, file: !684, line: 23, baseType: !313, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !814, file: !684, line: 24, baseType: !313, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !814, file: !684, line: 25, baseType: !313, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !814, file: !684, line: 26, baseType: !313, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !814, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !814, file: !815, line: 18, baseType: !401, size: 64, align: 64, offset: 1408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !814, file: !815, line: 20, baseType: !483, size: 64, align: 64, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !814, file: !815, line: 21, baseType: !214, size: 32, align: 32, offset: 1536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !814, file: !815, line: 22, baseType: !214, size: 32, align: 32, offset: 1568)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !804, file: !805, line: 12, baseType: !211, size: 8, align: 8, offset: 64)
!853 = !{!854}
!854 = !DISubrange(count: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !233, file: !234, line: 118, baseType: !856, size: 2048, align: 8, offset: 37056)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 2048, align: 8, elements: !853)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !233, file: !234, line: 120, baseType: !739, size: 64, align: 64, offset: 39104)
!858 = !DILocalVariable(name: "server", arg: 1, scope: !227, file: !203, line: 43, type: !230)
!859 = !DIExpression()
!860 = !DILocation(line: 43, column: 39, scope: !227)
!861 = !DILocalVariable(name: "args", arg: 2, scope: !227, file: !203, line: 43, type: !250)
!862 = !DILocation(line: 43, column: 53, scope: !227)
!863 = !DILocalVariable(name: "nick", arg: 3, scope: !227, file: !203, line: 43, type: !250)
!864 = !DILocation(line: 43, column: 65, scope: !227)
!865 = !DILocalVariable(name: "address", arg: 4, scope: !227, file: !203, line: 43, type: !250)
!866 = !DILocation(line: 43, column: 77, scope: !227)
!867 = !DILocalVariable(name: "i", scope: !227, file: !203, line: 45, type: !214)
!868 = !DILocation(line: 45, column: 6, scope: !227)
!869 = !DILocalVariable(name: "params", scope: !227, file: !203, line: 46, type: !250)
!870 = !DILocation(line: 46, column: 8, scope: !227)
!871 = !DILocalVariable(name: "evt", scope: !227, file: !203, line: 46, type: !250)
!872 = !DILocation(line: 46, column: 17, scope: !227)
!873 = !DILocalVariable(name: "list", scope: !227, file: !203, line: 46, type: !250)
!874 = !DILocation(line: 46, column: 23, scope: !227)
!875 = !DILocalVariable(name: "star", scope: !227, file: !203, line: 46, type: !250)
!876 = !DILocation(line: 46, column: 30, scope: !227)
!877 = !DILocation(line: 48, column: 28, scope: !227)
!878 = !DILocation(line: 48, column: 11, scope: !227)
!879 = !DILocation(line: 48, column: 9, scope: !227)
!880 = !DILocation(line: 50, column: 6, scope: !881)
!881 = distinct !DILexicalBlock(scope: !227, file: !203, line: 50, column: 6)
!882 = !DILocation(line: 50, column: 13, scope: !881)
!883 = !DILocation(line: 50, column: 6, scope: !227)
!884 = !DILocation(line: 51, column: 3, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !203, line: 50, column: 21)
!886 = !DILocation(line: 56, column: 13, scope: !887)
!887 = distinct !DILexicalBlock(scope: !227, file: !203, line: 56, column: 6)
!888 = !DILocation(line: 56, column: 6, scope: !887)
!889 = !DILocation(line: 56, column: 24, scope: !887)
!890 = !DILocation(line: 56, column: 29, scope: !887)
!891 = !DILocation(line: 56, column: 32, scope: !892)
!892 = !DILexicalBlockFile(scope: !887, file: !203, discriminator: 1)
!893 = !DILocation(line: 56, column: 40, scope: !892)
!894 = !DILocation(line: 56, column: 6, scope: !892)
!895 = !DILocation(line: 57, column: 10, scope: !896)
!896 = distinct !DILexicalBlock(scope: !887, file: !203, line: 56, column: 49)
!897 = !DILocation(line: 57, column: 8, scope: !896)
!898 = !DILocation(line: 58, column: 2, scope: !896)
!899 = !DILocation(line: 60, column: 9, scope: !900)
!900 = distinct !DILexicalBlock(scope: !227, file: !203, line: 60, column: 2)
!901 = !DILocation(line: 60, column: 7, scope: !900)
!902 = !DILocation(line: 60, column: 14, scope: !903)
!903 = !DILexicalBlockFile(scope: !904, file: !203, discriminator: 1)
!904 = distinct !DILexicalBlock(scope: !900, file: !203, line: 60, column: 2)
!905 = !DILocation(line: 60, column: 16, scope: !903)
!906 = !DILocation(line: 60, column: 2, scope: !903)
!907 = !DILocation(line: 61, column: 27, scope: !908)
!908 = distinct !DILexicalBlock(scope: !909, file: !203, line: 61, column: 7)
!909 = distinct !DILexicalBlock(scope: !904, file: !203, line: 60, column: 83)
!910 = !DILocation(line: 61, column: 48, scope: !908)
!911 = !DILocation(line: 61, column: 32, scope: !908)
!912 = !DILocation(line: 61, column: 51, scope: !908)
!913 = !DILocation(line: 61, column: 8, scope: !908)
!914 = !DILocation(line: 61, column: 7, scope: !909)
!915 = !DILocation(line: 62, column: 40, scope: !916)
!916 = distinct !DILexicalBlock(scope: !908, file: !203, line: 61, column: 61)
!917 = !DILocation(line: 62, column: 36, scope: !916)
!918 = !DILocation(line: 62, column: 20, scope: !916)
!919 = !DILocation(line: 62, column: 39, scope: !916)
