; ModuleID = './line135-irc-servers.o.i'
source_filename = "./line135-irc-servers.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._IRC_SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)*, %struct._GSList*, i64, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42, globals: !728)
!1 = !DIFile(filename: "line135-irc-servers.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 24, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "sasl.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "SASL_MECHANISM_NONE", value: 0)
!39 = !DIEnumerator(name: "SASL_MECHANISM_PLAIN", value: 1)
!40 = !DIEnumerator(name: "SASL_MECHANISM_EXTERNAL", value: 2)
!41 = !DIEnumerator(name: "SASL_MECHANISM_MAX", value: 3)
!42 = !{!43, !293, !103, !336, !149, !338, !421, !165, !705, !478, !712, !51, !713, !559, !714, !719, !723, !724}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !45, line: 5, baseType: !46)
!45 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !47, line: 24, size: 2496, align: 64, elements: !48)
!47 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!48 = !{!49, !52, !53, !54, !57, !58, !59, !60, !61, !63, !64, !65, !66, !67, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !50, line: 3, baseType: !51, size: 32, align: 32)
!50 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !46, file: !50, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !46, file: !50, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !46, file: !50, line: 9, baseType: !55, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !46, file: !50, line: 10, baseType: !51, size: 32, align: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !46, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !46, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !46, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !46, file: !50, line: 13, baseType: !62, size: 16, align: 16, offset: 448)
!62 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !46, file: !50, line: 14, baseType: !55, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !46, file: !50, line: 15, baseType: !55, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !46, file: !50, line: 16, baseType: !51, size: 32, align: 32, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !46, file: !50, line: 17, baseType: !55, size: 64, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !46, file: !50, line: 19, baseType: !68, size: 64, align: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !70, line: 99, baseType: !71)
!70 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !70, line: 99, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !46, file: !50, line: 19, baseType: !68, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !46, file: !50, line: 21, baseType: !55, size: 64, align: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !46, file: !50, line: 22, baseType: !55, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !46, file: !50, line: 23, baseType: !55, size: 64, align: 64, offset: 1024)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !46, file: !50, line: 24, baseType: !55, size: 64, align: 64, offset: 1088)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !46, file: !50, line: 26, baseType: !55, size: 64, align: 64, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !46, file: !50, line: 27, baseType: !55, size: 64, align: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !46, file: !50, line: 28, baseType: !55, size: 64, align: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !46, file: !50, line: 29, baseType: !55, size: 64, align: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !46, file: !50, line: 30, baseType: !55, size: 64, align: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !46, file: !50, line: 31, baseType: !55, size: 64, align: 64, offset: 1472)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !46, file: !50, line: 32, baseType: !55, size: 64, align: 64, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !46, file: !50, line: 33, baseType: !55, size: 64, align: 64, offset: 1600)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !46, file: !50, line: 35, baseType: !86, size: 64, align: 64, offset: 1664)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !89)
!89 = !{!90, !93, !238, !239, !244, !245, !246, !247, !248, !257, !258, !259, !263, !264, !265, !266, !267, !268, !269, !270}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !88, file: !4, line: 100, baseType: !91, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !92, line: 49, baseType: !51)
!92 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !88, file: !4, line: 101, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !97)
!97 = !{!98, !122, !128, !135, !139, !225, !229, !234}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !96, file: !4, line: 133, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !86, !103, !105, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !92, line: 46, baseType: !56)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !106, line: 66, baseType: !107)
!106 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !112, line: 42, baseType: !113)
!112 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !112, line: 44, size: 128, align: 64, elements: !114)
!114 = !{!115, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !113, file: !112, line: 46, baseType: !116, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !117, line: 36, baseType: !118)
!117 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !106, line: 45, baseType: !119)
!119 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !113, file: !112, line: 47, baseType: !91, size: 32, align: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !113, file: !112, line: 48, baseType: !103, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !96, file: !4, line: 138, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!102, !86, !126, !105, !108, !109}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !96, file: !4, line: 143, baseType: !129, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!102, !86, !132, !134, !109}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !106, line: 51, baseType: !133)
!133 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !96, file: !4, line: 147, baseType: !136, size: 64, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!102, !86, !109}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !96, file: !4, line: 149, baseType: !140, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !86, !224}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !146)
!146 = !{!147, !150, !171, !200, !202, !206, !207, !208, !209, !217, !218, !219, !220}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !145, file: !16, line: 174, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !92, line: 77, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !145, file: !16, line: 175, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !154)
!154 = !{!155, !159, !160}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !153, file: !16, line: 198, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !148}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !153, file: !16, line: 199, baseType: !156, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !153, file: !16, line: 200, baseType: !161, size: 64, align: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !148, !143, !164, !170}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !148}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !92, line: 50, baseType: !91)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !145, file: !16, line: 177, baseType: !172, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !176)
!176 = !{!177, !182, !186, !190, !194, !195}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !175, file: !16, line: 216, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!169, !143, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !175, file: !16, line: 218, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!169, !143}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !175, file: !16, line: 219, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!169, !143, !165, !148}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !175, file: !16, line: 222, baseType: !191, size: 64, align: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !143}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !175, file: !16, line: 226, baseType: !165, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !175, file: !16, line: 227, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !145, file: !16, line: 178, baseType: !201, size: 32, align: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !92, line: 55, baseType: !119)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !145, file: !16, line: 180, baseType: !203, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !145, file: !16, line: 182, baseType: !91, size: 32, align: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !16, line: 183, baseType: !201, size: 32, align: 32, offset: 352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !145, file: !16, line: 184, baseType: !201, size: 32, align: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !145, file: !16, line: 186, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !212, line: 37, baseType: !213)
!212 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !212, line: 39, size: 128, align: 64, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !212, line: 41, baseType: !148, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !212, line: 42, baseType: !210, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !16, line: 188, baseType: !143, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !16, line: 189, baseType: !143, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !16, line: 191, baseType: !55, size: 64, align: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !145, file: !16, line: 193, baseType: !221, size: 64, align: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !96, file: !4, line: 151, baseType: !226, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !86}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !96, file: !4, line: 152, baseType: !230, size: 64, align: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!102, !86, !233, !109}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !96, file: !4, line: 155, baseType: !235, size: 64, align: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!233, !86}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !88, file: !4, line: 103, baseType: !103, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !88, file: !4, line: 104, baseType: !240, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !241, line: 77, baseType: !242)
!241 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !241, line: 77, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !88, file: !4, line: 105, baseType: !240, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !88, file: !4, line: 106, baseType: !103, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !88, file: !4, line: 107, baseType: !201, size: 32, align: 32, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !88, file: !4, line: 109, baseType: !105, size: 64, align: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !88, file: !4, line: 110, baseType: !249, size: 64, align: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !251, line: 39, baseType: !252)
!251 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !251, line: 41, size: 192, align: 64, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !252, file: !251, line: 43, baseType: !103, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !251, line: 44, baseType: !105, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !252, file: !251, line: 45, baseType: !105, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !88, file: !4, line: 111, baseType: !249, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !88, file: !4, line: 112, baseType: !249, size: 64, align: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !88, file: !4, line: 113, baseType: !260, size: 48, align: 8, offset: 704)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 48, align: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 6)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !88, file: !4, line: 117, baseType: !201, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !88, file: !4, line: 118, baseType: !201, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !88, file: !4, line: 119, baseType: !201, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !88, file: !4, line: 120, baseType: !201, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !88, file: !4, line: 121, baseType: !201, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !88, file: !4, line: 122, baseType: !201, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !88, file: !4, line: 124, baseType: !148, size: 64, align: 64, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !88, file: !4, line: 125, baseType: !148, size: 64, align: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !46, file: !50, line: 38, baseType: !119, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !46, file: !50, line: 39, baseType: !119, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !46, file: !50, line: 40, baseType: !119, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !46, file: !50, line: 41, baseType: !119, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !46, file: !50, line: 42, baseType: !119, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !46, file: !50, line: 43, baseType: !119, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !46, file: !50, line: 44, baseType: !119, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !46, file: !50, line: 45, baseType: !119, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !46, file: !50, line: 46, baseType: !55, size: 64, align: 64, offset: 1792)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !46, file: !50, line: 47, baseType: !55, size: 64, align: 64, offset: 1856)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !46, file: !47, line: 27, baseType: !55, size: 64, align: 64, offset: 1920)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !46, file: !47, line: 28, baseType: !55, size: 64, align: 64, offset: 1984)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !46, file: !47, line: 30, baseType: !51, size: 32, align: 32, offset: 2048)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !46, file: !47, line: 31, baseType: !55, size: 64, align: 64, offset: 2112)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !46, file: !47, line: 32, baseType: !55, size: 64, align: 64, offset: 2176)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !46, file: !47, line: 34, baseType: !51, size: 32, align: 32, offset: 2240)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !46, file: !47, line: 35, baseType: !51, size: 32, align: 32, offset: 2272)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !46, file: !47, line: 36, baseType: !51, size: 32, align: 32, offset: 2304)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !46, file: !47, line: 38, baseType: !51, size: 32, align: 32, offset: 2336)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !46, file: !47, line: 38, baseType: !51, size: 32, align: 32, offset: 2368)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !46, file: !47, line: 38, baseType: !51, size: 32, align: 32, offset: 2400)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !46, file: !47, line: 38, baseType: !51, size: 32, align: 32, offset: 2432)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !70, line: 113, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !296, line: 25, size: 1920, align: 64, elements: !297)
!296 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !50, line: 3, baseType: !51, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !295, file: !50, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !295, file: !50, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !295, file: !50, line: 9, baseType: !55, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !295, file: !50, line: 10, baseType: !51, size: 32, align: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !295, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !295, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !295, file: !50, line: 11, baseType: !55, size: 64, align: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !295, file: !50, line: 13, baseType: !62, size: 16, align: 16, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !295, file: !50, line: 14, baseType: !55, size: 64, align: 64, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !295, file: !50, line: 15, baseType: !55, size: 64, align: 64, offset: 576)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !295, file: !50, line: 16, baseType: !51, size: 32, align: 32, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !295, file: !50, line: 17, baseType: !55, size: 64, align: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !295, file: !50, line: 19, baseType: !68, size: 64, align: 64, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !295, file: !50, line: 19, baseType: !68, size: 64, align: 64, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !295, file: !50, line: 21, baseType: !55, size: 64, align: 64, offset: 896)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !295, file: !50, line: 22, baseType: !55, size: 64, align: 64, offset: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !295, file: !50, line: 23, baseType: !55, size: 64, align: 64, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !295, file: !50, line: 24, baseType: !55, size: 64, align: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !295, file: !50, line: 26, baseType: !55, size: 64, align: 64, offset: 1152)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !295, file: !50, line: 27, baseType: !55, size: 64, align: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !295, file: !50, line: 28, baseType: !55, size: 64, align: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !295, file: !50, line: 29, baseType: !55, size: 64, align: 64, offset: 1344)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !295, file: !50, line: 30, baseType: !55, size: 64, align: 64, offset: 1408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !295, file: !50, line: 31, baseType: !55, size: 64, align: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !295, file: !50, line: 32, baseType: !55, size: 64, align: 64, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !295, file: !50, line: 33, baseType: !55, size: 64, align: 64, offset: 1600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !295, file: !50, line: 35, baseType: !86, size: 64, align: 64, offset: 1664)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !295, file: !50, line: 38, baseType: !119, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !295, file: !50, line: 39, baseType: !119, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !295, file: !50, line: 40, baseType: !119, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !295, file: !50, line: 41, baseType: !119, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !295, file: !50, line: 42, baseType: !119, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !295, file: !50, line: 43, baseType: !119, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !295, file: !50, line: 44, baseType: !119, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !295, file: !50, line: 45, baseType: !119, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !295, file: !50, line: 46, baseType: !55, size: 64, align: 64, offset: 1792)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !295, file: !50, line: 47, baseType: !55, size: 64, align: 64, offset: 1856)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !45, line: 6, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !47, line: 42, size: 39168, align: 64, elements: !341)
!341 = !{!342, !344, !345, !346, !347, !352, !353, !354, !355, !356, !357, !358, !359, !360, !377, !378, !382, !383, !384, !394, !399, !400, !401, !402, !403, !404, !405, !406, !413, !414, !415, !416, !417, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !702, !704}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !343, line: 3, baseType: !51, size: 32, align: 32)
!343 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !340, file: !343, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !340, file: !343, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !340, file: !343, line: 8, baseType: !43, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !340, file: !343, line: 9, baseType: !348, size: 64, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !349, line: 75, baseType: !350)
!349 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !351, line: 139, baseType: !133)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !340, file: !343, line: 10, baseType: !348, size: 64, align: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !340, file: !343, line: 12, baseType: !55, size: 64, align: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !340, file: !343, line: 13, baseType: !55, size: 64, align: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !340, file: !343, line: 15, baseType: !119, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !340, file: !343, line: 16, baseType: !119, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !340, file: !343, line: 17, baseType: !119, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !340, file: !343, line: 18, baseType: !119, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !340, file: !343, line: 19, baseType: !119, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !340, file: !343, line: 21, baseType: !361, size: 64, align: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !70, line: 102, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !364, line: 7, size: 384, align: 64, elements: !365)
!364 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!365 = !{!366, !367, !371, !372, !373, !374, !375, !376}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !363, file: !364, line: 8, baseType: !86, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !363, file: !364, line: 9, baseType: !368, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !70, line: 101, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !70, line: 101, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !363, file: !364, line: 11, baseType: !51, size: 32, align: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !363, file: !364, line: 12, baseType: !51, size: 32, align: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !363, file: !364, line: 13, baseType: !51, size: 32, align: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !363, file: !364, line: 14, baseType: !55, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !363, file: !364, line: 15, baseType: !51, size: 32, align: 32, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !363, file: !364, line: 16, baseType: !119, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !340, file: !343, line: 22, baseType: !51, size: 32, align: 32, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !340, file: !343, line: 25, baseType: !379, size: 128, align: 64, offset: 640)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 64, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 2)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !340, file: !343, line: 26, baseType: !51, size: 32, align: 32, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !340, file: !343, line: 27, baseType: !51, size: 32, align: 32, offset: 800)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !340, file: !343, line: 29, baseType: !385, size: 64, align: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !70, line: 103, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !388, line: 4, size: 192, align: 64, elements: !389)
!388 = !DIFile(filename: "../../../src/core/rawlog.h", directory: "/home/lichi/Desktop/irssi/task1")
!389 = !{!390, !391, !392, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !387, file: !388, line: 5, baseType: !51, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !387, file: !388, line: 6, baseType: !51, size: 32, align: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !387, file: !388, line: 8, baseType: !51, size: 32, align: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !387, file: !388, line: 9, baseType: !210, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !340, file: !343, line: 30, baseType: !395, size: 64, align: 64, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !397, line: 37, baseType: !398)
!397 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !397, line: 37, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !340, file: !343, line: 32, baseType: !55, size: 64, align: 64, offset: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !340, file: !343, line: 33, baseType: !55, size: 64, align: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !340, file: !343, line: 34, baseType: !55, size: 64, align: 64, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !340, file: !343, line: 35, baseType: !119, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !340, file: !343, line: 36, baseType: !119, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !340, file: !343, line: 37, baseType: !119, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !340, file: !343, line: 38, baseType: !119, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !340, file: !343, line: 40, baseType: !407, size: 128, align: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !92, line: 504, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !92, line: 506, size: 128, align: 64, elements: !409)
!409 = !{!410, !412}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !408, file: !92, line: 508, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !92, line: 48, baseType: !133)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !408, file: !92, line: 509, baseType: !411, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !340, file: !343, line: 41, baseType: !348, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !340, file: !343, line: 42, baseType: !51, size: 32, align: 32, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !340, file: !343, line: 44, baseType: !210, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !340, file: !343, line: 45, baseType: !210, size: 64, align: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !340, file: !343, line: 53, baseType: !418, size: 64, align: 64, offset: 1600)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !421, !336, !51}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !70, line: 107, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !296, line: 30, size: 2240, align: 64, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !466, !470, !474, !479, !558, !585, !589}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !343, line: 3, baseType: !51, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !423, file: !343, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !423, file: !343, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !423, file: !343, line: 8, baseType: !293, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !423, file: !343, line: 9, baseType: !348, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !423, file: !343, line: 10, baseType: !348, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !423, file: !343, line: 12, baseType: !55, size: 64, align: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !423, file: !343, line: 13, baseType: !55, size: 64, align: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !423, file: !343, line: 15, baseType: !119, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !423, file: !343, line: 16, baseType: !119, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !423, file: !343, line: 17, baseType: !119, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !423, file: !343, line: 18, baseType: !119, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !423, file: !343, line: 19, baseType: !119, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !423, file: !343, line: 21, baseType: !361, size: 64, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !423, file: !343, line: 22, baseType: !51, size: 32, align: 32, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !423, file: !343, line: 25, baseType: !379, size: 128, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !423, file: !343, line: 26, baseType: !51, size: 32, align: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !423, file: !343, line: 27, baseType: !51, size: 32, align: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !423, file: !343, line: 29, baseType: !385, size: 64, align: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !423, file: !343, line: 30, baseType: !395, size: 64, align: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !423, file: !343, line: 32, baseType: !55, size: 64, align: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !423, file: !343, line: 33, baseType: !55, size: 64, align: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !423, file: !343, line: 34, baseType: !55, size: 64, align: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !423, file: !343, line: 35, baseType: !119, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !423, file: !343, line: 36, baseType: !119, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !423, file: !343, line: 37, baseType: !119, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !423, file: !343, line: 38, baseType: !119, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !423, file: !343, line: 40, baseType: !407, size: 128, align: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !423, file: !343, line: 41, baseType: !348, size: 64, align: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !423, file: !343, line: 42, baseType: !51, size: 32, align: 32, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !423, file: !343, line: 44, baseType: !210, size: 64, align: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !423, file: !343, line: 45, baseType: !210, size: 64, align: 64, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !423, file: !343, line: 53, baseType: !418, size: 64, align: 64, offset: 1600)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !423, file: !343, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!51, !421, !56}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !423, file: !343, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!51, !421, !336}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !423, file: !343, line: 60, baseType: !467, size: 64, align: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!336, !421}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !423, file: !343, line: 62, baseType: !471, size: 64, align: 64, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !421, !336, !336, !51}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !423, file: !343, line: 65, baseType: !475, size: 64, align: 64, offset: 1920)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !421, !336, !336}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !423, file: !343, line: 69, baseType: !480, size: 64, align: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !421, !336}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !70, line: 109, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !486, line: 15, size: 1408, align: 64, elements: !487)
!486 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!487 = !{!488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !506, !510, !512, !513, !514, !515, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !489, line: 3, baseType: !51, size: 32, align: 32)
!489 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !485, file: !489, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !485, file: !489, line: 5, baseType: !395, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !485, file: !489, line: 7, baseType: !149, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !485, file: !489, line: 8, baseType: !421, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !485, file: !489, line: 9, baseType: !55, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !489, line: 10, baseType: !55, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !485, file: !489, line: 11, baseType: !348, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !485, file: !489, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !485, file: !489, line: 13, baseType: !55, size: 64, align: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !485, file: !489, line: 15, baseType: !500, size: 64, align: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !70, line: 108, baseType: !505)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !70, line: 108, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !485, file: !489, line: 17, baseType: !507, size: 64, align: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!336, !503}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !485, file: !511, line: 5, baseType: !55, size: 64, align: 64, offset: 704)
!511 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!512 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !485, file: !511, line: 6, baseType: !55, size: 64, align: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !485, file: !511, line: 7, baseType: !348, size: 64, align: 64, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !485, file: !511, line: 9, baseType: !395, size: 64, align: 64, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !485, file: !511, line: 10, baseType: !516, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !70, line: 111, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !519, line: 13, size: 576, align: 64, elements: !520)
!519 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = !{!521, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !539, !540}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !522, line: 3, baseType: !51, size: 32, align: 32)
!522 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !518, file: !522, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !518, file: !522, line: 6, baseType: !348, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !518, file: !522, line: 8, baseType: !55, size: 64, align: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !518, file: !522, line: 9, baseType: !55, size: 64, align: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !518, file: !522, line: 10, baseType: !55, size: 64, align: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !518, file: !522, line: 11, baseType: !51, size: 32, align: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !518, file: !522, line: 14, baseType: !119, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !518, file: !522, line: 15, baseType: !119, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !518, file: !522, line: 18, baseType: !119, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !518, file: !522, line: 19, baseType: !119, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !518, file: !522, line: 20, baseType: !119, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !518, file: !522, line: 21, baseType: !119, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !518, file: !522, line: 22, baseType: !536, size: 64, align: 8, offset: 360)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, align: 8, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !518, file: !522, line: 26, baseType: !149, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !522, line: 28, baseType: !516, size: 64, align: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !485, file: !511, line: 12, baseType: !119, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !485, file: !511, line: 13, baseType: !55, size: 64, align: 64, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !485, file: !511, line: 14, baseType: !51, size: 32, align: 32, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !485, file: !511, line: 15, baseType: !55, size: 64, align: 64, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !485, file: !511, line: 17, baseType: !119, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !485, file: !511, line: 18, baseType: !119, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !485, file: !511, line: 19, baseType: !119, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !485, file: !511, line: 20, baseType: !119, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !485, file: !511, line: 22, baseType: !119, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !485, file: !511, line: 23, baseType: !119, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !485, file: !511, line: 24, baseType: !119, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !485, file: !511, line: 25, baseType: !119, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !485, file: !511, line: 26, baseType: !119, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !485, file: !511, line: 31, baseType: !555, size: 64, align: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!55, !483}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !423, file: !343, line: 70, baseType: !559, size: 64, align: 64, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !421, !336}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !70, line: 110, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !565, line: 15, size: 960, align: 64, elements: !566)
!565 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !583, !584}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !489, line: 3, baseType: !51, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !564, file: !489, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !564, file: !489, line: 5, baseType: !395, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !564, file: !489, line: 7, baseType: !149, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !564, file: !489, line: 8, baseType: !421, size: 64, align: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !564, file: !489, line: 9, baseType: !55, size: 64, align: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !489, line: 10, baseType: !55, size: 64, align: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !564, file: !489, line: 11, baseType: !348, size: 64, align: 64, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !564, file: !489, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !564, file: !489, line: 13, baseType: !55, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !564, file: !489, line: 15, baseType: !500, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !564, file: !489, line: 17, baseType: !507, size: 64, align: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !564, file: !580, line: 5, baseType: !55, size: 64, align: 64, offset: 704)
!580 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!581 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !564, file: !580, line: 6, baseType: !55, size: 64, align: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !564, file: !580, line: 7, baseType: !348, size: 64, align: 64, offset: 832)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !564, file: !580, line: 9, baseType: !119, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !564, file: !580, line: 11, baseType: !119, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !423, file: !343, line: 71, baseType: !586, size: 64, align: 64, offset: 2112)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!51, !336, !336}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !423, file: !343, line: 73, baseType: !586, size: 64, align: 64, offset: 2176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !340, file: !343, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !340, file: !343, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !340, file: !343, line: 60, baseType: !467, size: 64, align: 64, offset: 1792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !340, file: !343, line: 62, baseType: !471, size: 64, align: 64, offset: 1856)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !340, file: !343, line: 65, baseType: !475, size: 64, align: 64, offset: 1920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !340, file: !343, line: 69, baseType: !480, size: 64, align: 64, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !340, file: !343, line: 70, baseType: !559, size: 64, align: 64, offset: 2048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !340, file: !343, line: 71, baseType: !586, size: 64, align: 64, offset: 2112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !340, file: !343, line: 73, baseType: !586, size: 64, align: 64, offset: 2176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !340, file: !47, line: 46, baseType: !210, size: 64, align: 64, offset: 2240)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !340, file: !47, line: 47, baseType: !210, size: 64, align: 64, offset: 2304)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !340, file: !47, line: 48, baseType: !602, size: 64, align: 64, offset: 2368)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !45, line: 8, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !45, line: 8, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !340, file: !47, line: 49, baseType: !210, size: 64, align: 64, offset: 2432)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !340, file: !47, line: 51, baseType: !55, size: 64, align: 64, offset: 2496)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !340, file: !47, line: 53, baseType: !55, size: 64, align: 64, offset: 2560)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !340, file: !47, line: 54, baseType: !55, size: 64, align: 64, offset: 2624)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !340, file: !47, line: 55, baseType: !55, size: 64, align: 64, offset: 2688)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !340, file: !47, line: 56, baseType: !55, size: 64, align: 64, offset: 2752)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !340, file: !47, line: 57, baseType: !51, size: 32, align: 32, offset: 2816)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !340, file: !47, line: 59, baseType: !119, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !340, file: !47, line: 60, baseType: !119, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !340, file: !47, line: 62, baseType: !119, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !340, file: !47, line: 63, baseType: !119, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !340, file: !47, line: 64, baseType: !119, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !340, file: !47, line: 65, baseType: !119, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !340, file: !47, line: 66, baseType: !119, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !340, file: !47, line: 67, baseType: !119, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !340, file: !47, line: 68, baseType: !119, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !340, file: !47, line: 69, baseType: !119, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !340, file: !47, line: 70, baseType: !119, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !340, file: !47, line: 71, baseType: !119, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !340, file: !47, line: 72, baseType: !119, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !340, file: !47, line: 74, baseType: !51, size: 32, align: 32, offset: 2880)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !340, file: !47, line: 75, baseType: !51, size: 32, align: 32, offset: 2912)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !340, file: !47, line: 76, baseType: !51, size: 32, align: 32, offset: 2944)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !340, file: !47, line: 77, baseType: !51, size: 32, align: 32, offset: 2976)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !340, file: !47, line: 79, baseType: !395, size: 64, align: 64, offset: 3008)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !340, file: !47, line: 80, baseType: !210, size: 64, align: 64, offset: 3072)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !340, file: !47, line: 81, baseType: !210, size: 64, align: 64, offset: 3136)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !340, file: !47, line: 83, baseType: !249, size: 64, align: 64, offset: 3200)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !340, file: !47, line: 84, baseType: !201, size: 32, align: 32, offset: 3264)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !340, file: !47, line: 87, baseType: !51, size: 32, align: 32, offset: 3296)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !340, file: !47, line: 91, baseType: !210, size: 64, align: 64, offset: 3328)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !340, file: !47, line: 92, baseType: !407, size: 128, align: 64, offset: 3392)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !340, file: !47, line: 93, baseType: !407, size: 128, align: 64, offset: 3520)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !340, file: !47, line: 95, baseType: !51, size: 32, align: 32, offset: 3648)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !340, file: !47, line: 96, baseType: !51, size: 32, align: 32, offset: 3680)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !340, file: !47, line: 97, baseType: !51, size: 32, align: 32, offset: 3712)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !340, file: !47, line: 100, baseType: !210, size: 64, align: 64, offset: 3776)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !340, file: !47, line: 103, baseType: !210, size: 64, align: 64, offset: 3840)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !340, file: !47, line: 106, baseType: !210, size: 64, align: 64, offset: 3904)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !340, file: !47, line: 108, baseType: !395, size: 64, align: 64, offset: 3968)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !340, file: !47, line: 109, baseType: !210, size: 64, align: 64, offset: 4032)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !340, file: !47, line: 111, baseType: !210, size: 64, align: 64, offset: 4096)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !340, file: !47, line: 114, baseType: !149, size: 64, align: 64, offset: 4160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !340, file: !47, line: 116, baseType: !395, size: 64, align: 64, offset: 4224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !340, file: !47, line: 117, baseType: !650, size: 32768, align: 64, offset: 4288)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32768, align: 64, elements: !700)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !652, line: 10, size: 128, align: 64, elements: !653)
!652 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!653 = !{!654, !699}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !651, file: !652, line: 11, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !652, line: 7, baseType: !657)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !659, !336, !56, !56, !55, !249}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !45, line: 7, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !662, line: 15, size: 1600, align: 64, elements: !663)
!662 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !489, line: 3, baseType: !51, size: 32, align: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !661, file: !489, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !661, file: !489, line: 5, baseType: !395, size: 64, align: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !661, file: !489, line: 7, baseType: !149, size: 64, align: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !661, file: !489, line: 8, baseType: !338, size: 64, align: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !661, file: !489, line: 9, baseType: !55, size: 64, align: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !489, line: 10, baseType: !55, size: 64, align: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !661, file: !489, line: 11, baseType: !348, size: 64, align: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !661, file: !489, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !661, file: !489, line: 13, baseType: !55, size: 64, align: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !661, file: !489, line: 15, baseType: !500, size: 64, align: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !661, file: !489, line: 17, baseType: !507, size: 64, align: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !661, file: !511, line: 5, baseType: !55, size: 64, align: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !661, file: !511, line: 6, baseType: !55, size: 64, align: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !661, file: !511, line: 7, baseType: !348, size: 64, align: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !661, file: !511, line: 9, baseType: !395, size: 64, align: 64, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !661, file: !511, line: 10, baseType: !516, size: 64, align: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !661, file: !511, line: 12, baseType: !119, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !661, file: !511, line: 13, baseType: !55, size: 64, align: 64, offset: 1088)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !661, file: !511, line: 14, baseType: !51, size: 32, align: 32, offset: 1152)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !661, file: !511, line: 15, baseType: !55, size: 64, align: 64, offset: 1216)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !661, file: !511, line: 17, baseType: !119, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !661, file: !511, line: 18, baseType: !119, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !661, file: !511, line: 19, baseType: !119, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !661, file: !511, line: 20, baseType: !119, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !661, file: !511, line: 22, baseType: !119, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !661, file: !511, line: 23, baseType: !119, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !661, file: !511, line: 24, baseType: !119, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !661, file: !511, line: 25, baseType: !119, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !661, file: !511, line: 26, baseType: !119, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !661, file: !511, line: 31, baseType: !555, size: 64, align: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !661, file: !662, line: 18, baseType: !210, size: 64, align: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !661, file: !662, line: 20, baseType: !348, size: 64, align: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !661, file: !662, line: 21, baseType: !51, size: 32, align: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !661, file: !662, line: 22, baseType: !51, size: 32, align: 32, offset: 1568)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !651, file: !652, line: 12, baseType: !56, size: 8, align: 8, offset: 64)
!700 = !{!701}
!701 = !DISubrange(count: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !340, file: !47, line: 118, baseType: !703, size: 2048, align: 8, offset: 37056)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2048, align: 8, elements: !700)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !340, file: !47, line: 120, baseType: !586, size: 64, align: 64, offset: 39104)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !706, line: 9, baseType: !707)
!706 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !710, !710, !710, !710, !710, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !92, line: 90, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!201, !718}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !92, line: 78, baseType: !710)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !92, line: 80, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!91, !718, !718}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !92, line: 87, baseType: !156)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !92, line: 91, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !148, !148, !148}
!728 = !{!729}
!729 = distinct !DIGlobalVariable(name: "cmd_tag", scope: !0, file: !730, line: 67, type: !51, isLocal: true, isDefinition: true, variable: i32* @cmd_tag)
!730 = !DIFile(filename: "irc-servers.c", directory: "/home/lichi/Desktop/irssi/task1")
!731 = !{i32 2, !"Dwarf Version", i32 4}
!732 = !{i32 2, !"Debug Info Version", i32 3}
!733 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!734 = distinct !DISubprogram(name: "irc_server_init_connect", scope: !730, file: !730, line: 298, type: !735, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!421, !293}
!737 = !{}
!738 = !DILocalVariable(name: "conn", arg: 1, scope: !734, file: !730, line: 298, type: !293)
!739 = !DIExpression()
!740 = !DILocation(line: 298, column: 57, scope: !734)
!741 = !DILocalVariable(name: "ircconn", scope: !734, file: !730, line: 300, type: !43)
!742 = !DILocation(line: 300, column: 26, scope: !734)
!743 = !DILocalVariable(name: "server", scope: !734, file: !730, line: 301, type: !338)
!744 = !DILocation(line: 301, column: 18, scope: !734)
!745 = !DILocation(line: 303, column: 2, scope: !734)
!746 = distinct !{!746, !745}
!747 = !DILocation(line: 303, column: 106, scope: !748)
!748 = !DILexicalBlockFile(scope: !749, file: !730, discriminator: 1)
!749 = distinct !DILexicalBlock(scope: !750, file: !730, line: 303, column: 10)
!750 = distinct !DILexicalBlock(scope: !734, file: !730, line: 303, column: 4)
!751 = !DILocation(line: 303, column: 88, scope: !748)
!752 = !DILocation(line: 303, column: 65, scope: !748)
!753 = !DILocation(line: 303, column: 64, scope: !748)
!754 = !DILocation(line: 303, column: 39, scope: !755)
!755 = !DILexicalBlockFile(scope: !748, file: !730, discriminator: 7)
!756 = !DILocation(line: 303, column: 12, scope: !748)
!757 = !DILocation(line: 303, column: 10, scope: !748)
!758 = !DILocation(line: 303, column: 11, scope: !759)
!759 = !DILexicalBlockFile(scope: !749, file: !730, discriminator: 2)
!760 = !DILocation(line: 303, column: 10, scope: !761)
!761 = !DILexicalBlockFile(scope: !750, file: !730, discriminator: 3)
!762 = !DILocation(line: 303, column: 30, scope: !763)
!763 = !DILexicalBlockFile(scope: !764, file: !730, discriminator: 4)
!764 = distinct !DILexicalBlock(scope: !749, file: !730, line: 303, column: 28)
!765 = !DILocation(line: 303, column: 39, scope: !766)
!766 = !DILexicalBlockFile(scope: !767, file: !730, discriminator: 5)
!767 = distinct !DILexicalBlock(scope: !749, file: !730, line: 303, column: 37)
!768 = !DILocation(line: 303, column: 139, scope: !766)
!769 = !DILocation(line: 303, column: 7, scope: !770)
!770 = !DILexicalBlockFile(scope: !750, file: !730, discriminator: 6)
!771 = !DILocation(line: 304, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !734, file: !730, line: 304, column: 6)
!773 = !DILocation(line: 304, column: 12, scope: !772)
!774 = !DILocation(line: 304, column: 20, scope: !772)
!775 = !DILocation(line: 304, column: 27, scope: !772)
!776 = !DILocation(line: 304, column: 31, scope: !777)
!777 = !DILexicalBlockFile(scope: !772, file: !730, discriminator: 1)
!778 = !DILocation(line: 304, column: 37, scope: !777)
!779 = !DILocation(line: 304, column: 30, scope: !777)
!780 = !DILocation(line: 304, column: 45, scope: !777)
!781 = !DILocation(line: 304, column: 6, scope: !777)
!782 = !DILocation(line: 304, column: 54, scope: !783)
!783 = !DILexicalBlockFile(scope: !772, file: !730, discriminator: 2)
!784 = !DILocation(line: 305, column: 6, scope: !785)
!785 = distinct !DILexicalBlock(scope: !734, file: !730, line: 305, column: 6)
!786 = !DILocation(line: 305, column: 12, scope: !785)
!787 = !DILocation(line: 305, column: 17, scope: !785)
!788 = !DILocation(line: 305, column: 24, scope: !785)
!789 = !DILocation(line: 305, column: 28, scope: !790)
!790 = !DILexicalBlockFile(scope: !785, file: !730, discriminator: 1)
!791 = !DILocation(line: 305, column: 34, scope: !790)
!792 = !DILocation(line: 305, column: 27, scope: !790)
!793 = !DILocation(line: 305, column: 39, scope: !790)
!794 = !DILocation(line: 305, column: 6, scope: !790)
!795 = !DILocation(line: 305, column: 48, scope: !796)
!796 = !DILexicalBlockFile(scope: !785, file: !730, discriminator: 2)
!797 = !DILocation(line: 307, column: 31, scope: !734)
!798 = !DILocation(line: 307, column: 12, scope: !734)
!799 = !DILocation(line: 307, column: 9, scope: !734)
!800 = !DILocation(line: 308, column: 23, scope: !734)
!801 = !DILocation(line: 308, column: 2, scope: !734)
!802 = !DILocation(line: 308, column: 10, scope: !734)
!803 = !DILocation(line: 308, column: 20, scope: !734)
!804 = !DILocation(line: 310, column: 39, scope: !734)
!805 = !DILocation(line: 310, column: 12, scope: !734)
!806 = !DILocation(line: 310, column: 10, scope: !734)
!807 = !DILocation(line: 311, column: 20, scope: !734)
!808 = !DILocation(line: 311, column: 2, scope: !734)
!809 = !DILocation(line: 311, column: 10, scope: !734)
!810 = !DILocation(line: 311, column: 18, scope: !734)
!811 = !DILocation(line: 312, column: 28, scope: !734)
!812 = !DILocation(line: 312, column: 9, scope: !734)
!813 = !DILocation(line: 314, column: 6, scope: !814)
!814 = distinct !DILexicalBlock(scope: !734, file: !730, line: 314, column: 6)
!815 = !DILocation(line: 314, column: 14, scope: !814)
!816 = !DILocation(line: 314, column: 23, scope: !814)
!817 = !DILocation(line: 314, column: 28, scope: !814)
!818 = !DILocation(line: 314, column: 6, scope: !734)
!819 = !DILocation(line: 316, column: 4, scope: !820)
!820 = distinct !DILexicalBlock(scope: !814, file: !730, line: 314, column: 34)
!821 = !DILocation(line: 316, column: 12, scope: !820)
!822 = !DILocation(line: 316, column: 21, scope: !820)
!823 = !DILocation(line: 315, column: 3, scope: !820)
!824 = !DILocation(line: 315, column: 11, scope: !820)
!825 = !DILocation(line: 315, column: 20, scope: !820)
!826 = !DILocation(line: 315, column: 25, scope: !820)
!827 = !DILocation(line: 317, column: 2, scope: !820)
!828 = !DILocation(line: 319, column: 28, scope: !734)
!829 = !DILocation(line: 319, column: 37, scope: !734)
!830 = !DILocation(line: 319, column: 53, scope: !734)
!831 = !DILocation(line: 320, column: 3, scope: !734)
!832 = !DILocation(line: 320, column: 12, scope: !734)
!833 = !DILocation(line: 319, column: 28, scope: !834)
!834 = !DILexicalBlockFile(scope: !734, file: !730, discriminator: 1)
!835 = !DILocation(line: 320, column: 30, scope: !834)
!836 = !DILocation(line: 319, column: 28, scope: !837)
!837 = !DILexicalBlockFile(scope: !734, file: !730, discriminator: 2)
!838 = !DILocation(line: 319, column: 28, scope: !839)
!839 = !DILexicalBlockFile(scope: !734, file: !730, discriminator: 3)
!840 = !DILocation(line: 319, column: 2, scope: !839)
!841 = !DILocation(line: 319, column: 10, scope: !839)
!842 = !DILocation(line: 319, column: 26, scope: !839)
!843 = !DILocation(line: 321, column: 29, scope: !734)
!844 = !DILocation(line: 321, column: 38, scope: !734)
!845 = !DILocation(line: 321, column: 55, scope: !734)
!846 = !DILocation(line: 322, column: 3, scope: !734)
!847 = !DILocation(line: 322, column: 12, scope: !734)
!848 = !DILocation(line: 321, column: 29, scope: !834)
!849 = !DILocation(line: 322, column: 31, scope: !834)
!850 = !DILocation(line: 321, column: 29, scope: !837)
!851 = !DILocation(line: 321, column: 29, scope: !839)
!852 = !DILocation(line: 321, column: 2, scope: !839)
!853 = !DILocation(line: 321, column: 10, scope: !839)
!854 = !DILocation(line: 321, column: 27, scope: !839)
!855 = !DILocation(line: 323, column: 28, scope: !734)
!856 = !DILocation(line: 323, column: 37, scope: !734)
!857 = !DILocation(line: 323, column: 53, scope: !734)
!858 = !DILocation(line: 324, column: 3, scope: !734)
!859 = !DILocation(line: 324, column: 12, scope: !734)
!860 = !DILocation(line: 323, column: 28, scope: !834)
!861 = !DILocation(line: 323, column: 28, scope: !837)
!862 = !DILocation(line: 323, column: 28, scope: !839)
!863 = !DILocation(line: 323, column: 2, scope: !839)
!864 = !DILocation(line: 323, column: 10, scope: !839)
!865 = !DILocation(line: 323, column: 26, scope: !839)
!866 = !DILocation(line: 326, column: 29, scope: !734)
!867 = !DILocation(line: 326, column: 38, scope: !734)
!868 = !DILocation(line: 326, column: 48, scope: !734)
!869 = !DILocation(line: 327, column: 3, scope: !734)
!870 = !DILocation(line: 327, column: 12, scope: !734)
!871 = !DILocation(line: 326, column: 29, scope: !834)
!872 = !DILocation(line: 326, column: 29, scope: !837)
!873 = !DILocation(line: 326, column: 29, scope: !839)
!874 = !DILocation(line: 326, column: 2, scope: !839)
!875 = !DILocation(line: 326, column: 10, scope: !839)
!876 = !DILocation(line: 326, column: 27, scope: !839)
!877 = !DILocation(line: 328, column: 29, scope: !734)
!878 = !DILocation(line: 328, column: 38, scope: !734)
!879 = !DILocation(line: 328, column: 48, scope: !734)
!880 = !DILocation(line: 329, column: 3, scope: !734)
!881 = !DILocation(line: 329, column: 12, scope: !734)
!882 = !DILocation(line: 328, column: 29, scope: !834)
!883 = !DILocation(line: 328, column: 29, scope: !837)
!884 = !DILocation(line: 328, column: 29, scope: !839)
!885 = !DILocation(line: 328, column: 2, scope: !839)
!886 = !DILocation(line: 328, column: 10, scope: !839)
!887 = !DILocation(line: 328, column: 27, scope: !839)
!888 = !DILocation(line: 330, column: 29, scope: !734)
!889 = !DILocation(line: 330, column: 38, scope: !734)
!890 = !DILocation(line: 330, column: 48, scope: !734)
!891 = !DILocation(line: 331, column: 3, scope: !734)
!892 = !DILocation(line: 331, column: 12, scope: !734)
!893 = !DILocation(line: 330, column: 29, scope: !834)
!894 = !DILocation(line: 330, column: 29, scope: !837)
!895 = !DILocation(line: 330, column: 29, scope: !839)
!896 = !DILocation(line: 330, column: 2, scope: !839)
!897 = !DILocation(line: 330, column: 10, scope: !839)
!898 = !DILocation(line: 330, column: 27, scope: !839)
!899 = !DILocation(line: 332, column: 28, scope: !734)
!900 = !DILocation(line: 332, column: 37, scope: !734)
!901 = !DILocation(line: 332, column: 46, scope: !734)
!902 = !DILocation(line: 333, column: 3, scope: !734)
!903 = !DILocation(line: 333, column: 12, scope: !734)
!904 = !DILocation(line: 332, column: 28, scope: !834)
!905 = !DILocation(line: 332, column: 28, scope: !837)
!906 = !DILocation(line: 332, column: 28, scope: !839)
!907 = !DILocation(line: 332, column: 2, scope: !839)
!908 = !DILocation(line: 332, column: 10, scope: !839)
!909 = !DILocation(line: 332, column: 26, scope: !839)
!910 = !DILocation(line: 334, column: 29, scope: !734)
!911 = !DILocation(line: 334, column: 35, scope: !734)
!912 = !DILocation(line: 334, column: 2, scope: !734)
!913 = !DILocation(line: 334, column: 10, scope: !734)
!914 = !DILocation(line: 334, column: 19, scope: !734)
!915 = !DILocation(line: 334, column: 27, scope: !734)
!916 = !DILocation(line: 336, column: 20, scope: !734)
!917 = !DILocation(line: 336, column: 2, scope: !734)
!918 = !DILocation(line: 338, column: 44, scope: !734)
!919 = !DILocation(line: 338, column: 29, scope: !734)
!920 = !DILocation(line: 338, column: 9, scope: !734)
!921 = !DILocation(line: 339, column: 24, scope: !734)
!922 = !DILocation(line: 339, column: 9, scope: !734)
!923 = !DILocation(line: 339, column: 2, scope: !734)
!924 = !DILocation(line: 340, column: 1, scope: !734)
