; ModuleID = './line262-window-commands.o.i'
source_filename = "./line262-window-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!299 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!300 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!301 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!302 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!303 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!304 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!305 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!306 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!307 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 51, size: 32, align: 32, elements: !310)
!309 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319}
!311 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!312 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!313 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!314 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!315 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!316 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!317 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!318 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!319 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 14, size: 32, align: 32, elements: !322)
!321 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!322 = !{!323, !324, !325, !326, !327}
!323 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_NONE", value: -1)
!324 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_DEFAULT", value: 0)
!325 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_HIDDEN", value: 1)
!326 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_SPLIT", value: 2)
!327 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_RSPLIT", value: 3)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !329, line: 25, size: 32, align: 32, elements: !330)
!329 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!331 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!332 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!333 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!334 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!335 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!336 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!337 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!338 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!339 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!340 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!341 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!342 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!343 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!344 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!345 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!346 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!347 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!348 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!349 = !{!350, !351, !358, !362, !364, !365, !367}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !352, line: 9, baseType: !353)
!352 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !356, !356, !356, !356, !356, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !360, line: 46, baseType: !361)
!360 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!361 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !360, line: 77, baseType: !350)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !360, line: 48, baseType: !366)
!366 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !369, line: 107, baseType: !370)
!369 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !371, line: 30, size: 2240, align: 64, elements: !372)
!371 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!372 = !{!373, !376, !377, !378, !606, !611, !612, !613, !614, !615, !616, !617, !618, !619, !623, !624, !628, !629, !630, !634, !639, !640, !641, !642, !643, !644, !645, !646, !652, !653, !654, !655, !656, !660, !664, !668, !672, !676, !681, !688, !695, !699}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !370, file: !374, line: 3, baseType: !375, size: 32, align: 32)
!374 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!375 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !370, file: !374, line: 4, baseType: !375, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !370, file: !374, line: 6, baseType: !375, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !370, file: !374, line: 8, baseType: !379, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !369, line: 113, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !371, line: 25, size: 1920, align: 64, elements: !382)
!382 = !{!383, !385, !386, !387, !389, !390, !391, !392, !393, !395, !396, !397, !398, !399, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !384, line: 3, baseType: !375, size: 32, align: 32)
!384 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !381, file: !384, line: 4, baseType: !375, size: 32, align: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !381, file: !384, line: 6, baseType: !375, size: 32, align: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !381, file: !384, line: 9, baseType: !388, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !381, file: !384, line: 10, baseType: !375, size: 32, align: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !381, file: !384, line: 11, baseType: !388, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !381, file: !384, line: 11, baseType: !388, size: 64, align: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !381, file: !384, line: 11, baseType: !388, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !381, file: !384, line: 13, baseType: !394, size: 16, align: 16, offset: 448)
!394 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !381, file: !384, line: 14, baseType: !388, size: 64, align: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !381, file: !384, line: 15, baseType: !388, size: 64, align: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !381, file: !384, line: 16, baseType: !375, size: 32, align: 32, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !381, file: !384, line: 17, baseType: !388, size: 64, align: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !381, file: !384, line: 19, baseType: !400, size: 64, align: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !369, line: 99, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !369, line: 99, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !381, file: !384, line: 19, baseType: !400, size: 64, align: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !381, file: !384, line: 21, baseType: !388, size: 64, align: 64, offset: 896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !381, file: !384, line: 22, baseType: !388, size: 64, align: 64, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !381, file: !384, line: 23, baseType: !388, size: 64, align: 64, offset: 1024)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !381, file: !384, line: 24, baseType: !388, size: 64, align: 64, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !381, file: !384, line: 26, baseType: !388, size: 64, align: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !381, file: !384, line: 27, baseType: !388, size: 64, align: 64, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !381, file: !384, line: 28, baseType: !388, size: 64, align: 64, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !381, file: !384, line: 29, baseType: !388, size: 64, align: 64, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !381, file: !384, line: 30, baseType: !388, size: 64, align: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !381, file: !384, line: 31, baseType: !388, size: 64, align: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !381, file: !384, line: 32, baseType: !388, size: 64, align: 64, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !381, file: !384, line: 33, baseType: !388, size: 64, align: 64, offset: 1600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !381, file: !384, line: 35, baseType: !417, size: 64, align: 64, offset: 1664)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !420)
!420 = !{!421, !423, !563, !564, !569, !570, !571, !572, !573, !582, !583, !584, !588, !589, !590, !591, !592, !593, !594, !595}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !419, file: !4, line: 100, baseType: !422, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !360, line: 49, baseType: !375)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !419, file: !4, line: 101, baseType: !424, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !427)
!427 = !{!428, !450, !456, !462, !466, !550, !554, !559}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !426, file: !4, line: 133, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!432, !417, !358, !433, !436, !437}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !434, line: 66, baseType: !435)
!434 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!435 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !440, line: 42, baseType: !441)
!440 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !440, line: 44, size: 128, align: 64, elements: !442)
!442 = !{!443, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !441, file: !440, line: 46, baseType: !444, size: 32, align: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !445, line: 36, baseType: !446)
!445 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !434, line: 45, baseType: !447)
!447 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !441, file: !440, line: 47, baseType: !422, size: 32, align: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !441, file: !440, line: 48, baseType: !358, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !426, file: !4, line: 138, baseType: !451, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!432, !417, !454, !433, !436, !437}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !426, file: !4, line: 143, baseType: !457, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!432, !417, !460, !461, !437}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !434, line: 51, baseType: !366)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !426, file: !4, line: 147, baseType: !463, size: 64, align: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!432, !417, !437}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !426, file: !4, line: 149, baseType: !467, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !417, !549}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !473)
!473 = !{!474, !475, !496, !525, !527, !531, !532, !533, !534, !542, !543, !544, !545}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !472, file: !16, line: 174, baseType: !364, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !472, file: !16, line: 175, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !479)
!479 = !{!480, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !478, file: !16, line: 198, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !364}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !478, file: !16, line: 199, baseType: !481, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !478, file: !16, line: 200, baseType: !486, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !364, !470, !489, !495}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !364}
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !360, line: 50, baseType: !422)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !472, file: !16, line: 177, baseType: !497, size: 64, align: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !501)
!501 = !{!502, !507, !511, !515, !519, !520}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !500, file: !16, line: 216, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!494, !470, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !500, file: !16, line: 218, baseType: !508, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!494, !470}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !500, file: !16, line: 219, baseType: !512, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!494, !470, !490, !364}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !500, file: !16, line: 222, baseType: !516, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !470}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !500, file: !16, line: 226, baseType: !490, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !500, file: !16, line: 227, baseType: !521, size: 64, align: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !472, file: !16, line: 178, baseType: !526, size: 32, align: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !360, line: 55, baseType: !447)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !472, file: !16, line: 180, baseType: !528, size: 64, align: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !472, file: !16, line: 182, baseType: !422, size: 32, align: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !16, line: 183, baseType: !526, size: 32, align: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !472, file: !16, line: 184, baseType: !526, size: 32, align: 32, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !472, file: !16, line: 186, baseType: !535, size: 64, align: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !537, line: 37, baseType: !538)
!537 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !537, line: 39, size: 128, align: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !537, line: 41, baseType: !364, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !537, line: 42, baseType: !535, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !16, line: 188, baseType: !470, size: 64, align: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !16, line: 189, baseType: !470, size: 64, align: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !16, line: 191, baseType: !388, size: 64, align: 64, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !472, file: !16, line: 193, baseType: !546, size: 64, align: 64, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !426, file: !4, line: 151, baseType: !551, size: 64, align: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !417}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !426, file: !4, line: 152, baseType: !555, size: 64, align: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!432, !417, !558, !437}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !426, file: !4, line: 155, baseType: !560, size: 64, align: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!558, !417}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !419, file: !4, line: 103, baseType: !358, size: 64, align: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !419, file: !4, line: 104, baseType: !565, size: 64, align: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !566, line: 77, baseType: !567)
!566 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !566, line: 77, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !419, file: !4, line: 105, baseType: !565, size: 64, align: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !419, file: !4, line: 106, baseType: !358, size: 64, align: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !419, file: !4, line: 107, baseType: !526, size: 32, align: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !419, file: !4, line: 109, baseType: !433, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !419, file: !4, line: 110, baseType: !574, size: 64, align: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !576, line: 39, baseType: !577)
!576 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !576, line: 41, size: 192, align: 64, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !577, file: !576, line: 43, baseType: !358, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !577, file: !576, line: 44, baseType: !433, size: 64, align: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !577, file: !576, line: 45, baseType: !433, size: 64, align: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !419, file: !4, line: 111, baseType: !574, size: 64, align: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !419, file: !4, line: 112, baseType: !574, size: 64, align: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !419, file: !4, line: 113, baseType: !585, size: 48, align: 8, offset: 704)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 48, align: 8, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 6)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !419, file: !4, line: 117, baseType: !526, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !419, file: !4, line: 118, baseType: !526, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !419, file: !4, line: 119, baseType: !526, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !419, file: !4, line: 120, baseType: !526, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !419, file: !4, line: 121, baseType: !526, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !419, file: !4, line: 122, baseType: !526, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !419, file: !4, line: 124, baseType: !364, size: 64, align: 64, offset: 768)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !419, file: !4, line: 125, baseType: !364, size: 64, align: 64, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !381, file: !384, line: 38, baseType: !447, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !381, file: !384, line: 39, baseType: !447, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !381, file: !384, line: 40, baseType: !447, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !381, file: !384, line: 41, baseType: !447, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !381, file: !384, line: 42, baseType: !447, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !381, file: !384, line: 43, baseType: !447, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !381, file: !384, line: 44, baseType: !447, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !381, file: !384, line: 45, baseType: !447, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !381, file: !384, line: 46, baseType: !388, size: 64, align: 64, offset: 1792)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !381, file: !384, line: 47, baseType: !388, size: 64, align: 64, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !370, file: !374, line: 9, baseType: !607, size: 64, align: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !608, line: 75, baseType: !609)
!608 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !610, line: 139, baseType: !366)
!610 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !370, file: !374, line: 10, baseType: !607, size: 64, align: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !370, file: !374, line: 12, baseType: !388, size: 64, align: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !370, file: !374, line: 13, baseType: !388, size: 64, align: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !370, file: !374, line: 15, baseType: !447, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !370, file: !374, line: 16, baseType: !447, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !370, file: !374, line: 17, baseType: !447, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !370, file: !374, line: 18, baseType: !447, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !370, file: !374, line: 19, baseType: !447, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !370, file: !374, line: 21, baseType: !620, size: 64, align: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !369, line: 102, baseType: !622)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !369, line: 102, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !370, file: !374, line: 22, baseType: !375, size: 32, align: 32, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !370, file: !374, line: 25, baseType: !625, size: 128, align: 64, offset: 640)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 128, align: 64, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 2)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !370, file: !374, line: 26, baseType: !375, size: 32, align: 32, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !370, file: !374, line: 27, baseType: !375, size: 32, align: 32, offset: 800)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !370, file: !374, line: 29, baseType: !631, size: 64, align: 64, offset: 832)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !369, line: 103, baseType: !633)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !369, line: 103, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !370, file: !374, line: 30, baseType: !635, size: 64, align: 64, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !637, line: 37, baseType: !638)
!637 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !637, line: 37, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !370, file: !374, line: 32, baseType: !388, size: 64, align: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !370, file: !374, line: 33, baseType: !388, size: 64, align: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !370, file: !374, line: 34, baseType: !388, size: 64, align: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !370, file: !374, line: 35, baseType: !447, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !370, file: !374, line: 36, baseType: !447, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !370, file: !374, line: 37, baseType: !447, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !370, file: !374, line: 38, baseType: !447, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !370, file: !374, line: 40, baseType: !647, size: 128, align: 64, offset: 1216)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !360, line: 504, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !360, line: 506, size: 128, align: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !648, file: !360, line: 508, baseType: !365, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !648, file: !360, line: 509, baseType: !365, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !370, file: !374, line: 41, baseType: !607, size: 64, align: 64, offset: 1344)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !370, file: !374, line: 42, baseType: !375, size: 32, align: 32, offset: 1408)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !370, file: !374, line: 44, baseType: !535, size: 64, align: 64, offset: 1472)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !370, file: !374, line: 45, baseType: !535, size: 64, align: 64, offset: 1536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !370, file: !374, line: 53, baseType: !657, size: 64, align: 64, offset: 1600)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !367, !362, !375}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !370, file: !374, line: 55, baseType: !661, size: 64, align: 64, offset: 1664)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!375, !367, !361}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !370, file: !374, line: 57, baseType: !665, size: 64, align: 64, offset: 1728)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!375, !367, !362}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !370, file: !374, line: 60, baseType: !669, size: 64, align: 64, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!362, !367}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !370, file: !374, line: 62, baseType: !673, size: 64, align: 64, offset: 1856)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !367, !362, !362, !375}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !370, file: !374, line: 65, baseType: !677, size: 64, align: 64, offset: 1920)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !367, !362, !362}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !370, file: !374, line: 69, baseType: !682, size: 64, align: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !367, !362}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !369, line: 109, baseType: !687)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !369, line: 109, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !370, file: !374, line: 70, baseType: !689, size: 64, align: 64, offset: 2048)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !367, !362}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !369, line: 110, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !369, line: 110, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !370, file: !374, line: 71, baseType: !696, size: 64, align: 64, offset: 2112)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!375, !362, !362}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !370, file: !374, line: 73, baseType: !696, size: 64, align: 64, offset: 2176)
!700 = !{i32 2, !"Dwarf Version", i32 4}
!701 = !{i32 2, !"Debug Info Version", i32 3}
!702 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!703 = distinct !DISubprogram(name: "cmd_window_history", scope: !704, file: !704, line: 621, type: !705, isLocal: false, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!704 = !DIFile(filename: "window-commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!705 = !DISubroutineType(types: !706)
!706 = !{null, !362}
!707 = !{}
!708 = !DILocalVariable(name: "data", arg: 1, scope: !703, file: !704, line: 621, type: !362)
!709 = !DIExpression()
!710 = !DILocation(line: 621, column: 37, scope: !703)
!711 = !DILocalVariable(name: "optlist", scope: !703, file: !704, line: 623, type: !635)
!712 = !DILocation(line: 623, column: 14, scope: !703)
!713 = !DILocalVariable(name: "name", scope: !703, file: !704, line: 624, type: !388)
!714 = !DILocation(line: 624, column: 8, scope: !703)
!715 = !DILocalVariable(name: "free_arg", scope: !703, file: !704, line: 625, type: !350)
!716 = !DILocation(line: 625, column: 8, scope: !703)
!717 = !DILocation(line: 627, column: 22, scope: !718)
!718 = distinct !DILexicalBlock(scope: !703, file: !704, line: 627, column: 6)
!719 = !DILocation(line: 627, column: 7, scope: !718)
!720 = !DILocation(line: 627, column: 6, scope: !703)
!721 = !DILocation(line: 629, column: 3, scope: !718)
!722 = !DILocation(line: 631, column: 26, scope: !723)
!723 = distinct !DILexicalBlock(scope: !703, file: !704, line: 631, column: 6)
!724 = !DILocation(line: 631, column: 6, scope: !723)
!725 = !DILocation(line: 631, column: 44, scope: !723)
!726 = !DILocation(line: 631, column: 6, scope: !703)
!727 = !DILocation(line: 632, column: 22, scope: !728)
!728 = distinct !DILexicalBlock(scope: !723, file: !704, line: 631, column: 52)
!729 = !DILocation(line: 632, column: 3, scope: !728)
!730 = !DILocation(line: 633, column: 24, scope: !728)
!731 = !DILocation(line: 633, column: 36, scope: !728)
!732 = !DILocation(line: 633, column: 3, scope: !728)
!733 = !DILocation(line: 634, column: 2, scope: !728)
!734 = !DILocation(line: 635, column: 22, scope: !735)
!735 = distinct !DILexicalBlock(scope: !723, file: !704, line: 634, column: 9)
!736 = !DILocation(line: 635, column: 34, scope: !735)
!737 = !DILocation(line: 635, column: 3, scope: !735)
!738 = !DILocation(line: 638, column: 18, scope: !703)
!739 = !DILocation(line: 638, column: 2, scope: !703)
!740 = !DILocation(line: 639, column: 1, scope: !703)
!741 = !DILocation(line: 639, column: 1, scope: !742)
!742 = !DILexicalBlockFile(scope: !703, file: !704, discriminator: 1)
!743 = distinct !DISubprogram(name: "window_commands_init", scope: !704, file: !704, line: 870, type: !523, isLocal: false, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!744 = !DILocation(line: 872, column: 2, scope: !743)
!745 = !DILocation(line: 874, column: 2, scope: !743)
!746 = !DILocation(line: 875, column: 2, scope: !743)
!747 = !DILocation(line: 876, column: 2, scope: !743)
!748 = !DILocation(line: 877, column: 2, scope: !743)
!749 = !DILocation(line: 878, column: 2, scope: !743)
!750 = !DILocation(line: 879, column: 2, scope: !743)
!751 = !DILocation(line: 880, column: 2, scope: !743)
!752 = !DILocation(line: 881, column: 2, scope: !743)
!753 = !DILocation(line: 882, column: 2, scope: !743)
!754 = !DILocation(line: 883, column: 2, scope: !743)
!755 = !DILocation(line: 884, column: 2, scope: !743)
!756 = !DILocation(line: 885, column: 2, scope: !743)
!757 = !DILocation(line: 886, column: 2, scope: !743)
!758 = !DILocation(line: 887, column: 2, scope: !743)
!759 = !DILocation(line: 888, column: 2, scope: !743)
!760 = !DILocation(line: 889, column: 2, scope: !743)
!761 = !DILocation(line: 890, column: 2, scope: !743)
!762 = !DILocation(line: 891, column: 2, scope: !743)
!763 = !DILocation(line: 892, column: 2, scope: !743)
!764 = !DILocation(line: 893, column: 2, scope: !743)
!765 = !DILocation(line: 894, column: 2, scope: !743)
!766 = !DILocation(line: 895, column: 2, scope: !743)
!767 = !DILocation(line: 896, column: 2, scope: !743)
!768 = !DILocation(line: 897, column: 2, scope: !743)
!769 = !DILocation(line: 898, column: 2, scope: !743)
!770 = !DILocation(line: 899, column: 2, scope: !743)
!771 = !DILocation(line: 900, column: 2, scope: !743)
!772 = !DILocation(line: 901, column: 2, scope: !743)
!773 = !DILocation(line: 903, column: 2, scope: !743)
!774 = !DILocation(line: 905, column: 2, scope: !743)
!775 = !DILocation(line: 906, column: 2, scope: !743)
!776 = !DILocation(line: 908, column: 2, scope: !743)
!777 = !DILocation(line: 909, column: 2, scope: !743)
!778 = !DILocation(line: 910, column: 2, scope: !743)
!779 = !DILocation(line: 911, column: 2, scope: !743)
!780 = !DILocation(line: 912, column: 1, scope: !743)
!781 = distinct !DISubprogram(name: "cmd_window", scope: !704, file: !704, line: 160, type: !782, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !362, !350, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !369, line: 108, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !787, line: 5, size: 704, align: 64, elements: !788)
!787 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!788 = !{!789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !804}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !790, line: 3, baseType: !375, size: 32, align: 32)
!790 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!791 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !786, file: !790, line: 4, baseType: !375, size: 32, align: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !786, file: !790, line: 5, baseType: !635, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !786, file: !790, line: 7, baseType: !350, size: 64, align: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !786, file: !790, line: 8, baseType: !367, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !786, file: !790, line: 9, baseType: !388, size: 64, align: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !790, line: 10, baseType: !388, size: 64, align: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !786, file: !790, line: 11, baseType: !607, size: 64, align: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !786, file: !790, line: 12, baseType: !375, size: 32, align: 32, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !786, file: !790, line: 13, baseType: !388, size: 64, align: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !786, file: !790, line: 15, baseType: !801, size: 64, align: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !784}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !786, file: !790, line: 17, baseType: !805, size: 64, align: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!362, !784}
!808 = !DILocalVariable(name: "data", arg: 1, scope: !781, file: !704, line: 160, type: !362)
!809 = !DILocation(line: 160, column: 36, scope: !781)
!810 = !DILocalVariable(name: "server", arg: 2, scope: !781, file: !704, line: 160, type: !350)
!811 = !DILocation(line: 160, column: 48, scope: !781)
!812 = !DILocalVariable(name: "item", arg: 3, scope: !781, file: !704, line: 160, type: !784)
!813 = !DILocation(line: 160, column: 69, scope: !781)
!814 = !DILocation(line: 162, column: 9, scope: !781)
!815 = !DILocation(line: 162, column: 17, scope: !816)
!816 = !DILexicalBlockFile(scope: !781, file: !704, discriminator: 1)
!817 = !DILocation(line: 162, column: 16, scope: !816)
!818 = !DILocation(line: 162, column: 22, scope: !816)
!819 = !DILocation(line: 162, column: 9, scope: !816)
!820 = !DILocation(line: 162, column: 34, scope: !821)
!821 = !DILexicalBlockFile(scope: !781, file: !704, discriminator: 2)
!822 = !DILocation(line: 162, column: 9, scope: !821)
!823 = distinct !{!823, !814}
!824 = !DILocation(line: 164, column: 7, scope: !825)
!825 = distinct !DILexicalBlock(scope: !781, file: !704, line: 164, column: 6)
!826 = !DILocation(line: 164, column: 6, scope: !825)
!827 = !DILocation(line: 164, column: 12, scope: !825)
!828 = !DILocation(line: 164, column: 6, scope: !781)
!829 = !DILocation(line: 165, column: 33, scope: !825)
!830 = !DILocation(line: 165, column: 17, scope: !825)
!831 = !DILocation(line: 166, column: 22, scope: !832)
!832 = distinct !DILexicalBlock(scope: !825, file: !704, line: 166, column: 11)
!833 = !DILocation(line: 166, column: 11, scope: !832)
!834 = !DILocation(line: 166, column: 11, scope: !825)
!835 = !DILocation(line: 167, column: 57, scope: !832)
!836 = !DILocation(line: 167, column: 63, scope: !832)
!837 = !DILocation(line: 167, column: 71, scope: !832)
!838 = !DILocation(line: 167, column: 17, scope: !832)
!839 = !DILocation(line: 169, column: 28, scope: !832)
!840 = !DILocation(line: 169, column: 34, scope: !832)
!841 = !DILocation(line: 169, column: 42, scope: !832)
!842 = !DILocation(line: 169, column: 3, scope: !832)
!843 = !DILocation(line: 170, column: 1, scope: !781)
!844 = distinct !DISubprogram(name: "cmd_window_new", scope: !704, file: !704, line: 173, type: !782, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!845 = !DILocalVariable(name: "data", arg: 1, scope: !844, file: !704, line: 173, type: !362)
!846 = !DILocation(line: 173, column: 40, scope: !844)
!847 = !DILocalVariable(name: "server", arg: 2, scope: !844, file: !704, line: 173, type: !350)
!848 = !DILocation(line: 173, column: 52, scope: !844)
!849 = !DILocalVariable(name: "item", arg: 3, scope: !844, file: !704, line: 173, type: !784)
!850 = !DILocation(line: 173, column: 73, scope: !844)
!851 = !DILocalVariable(name: "window", scope: !844, file: !704, line: 175, type: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !369, line: 117, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !321, line: 28, size: 1280, align: 64, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !889, !890, !891, !892, !893, !894, !895, !896}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !854, file: !321, line: 29, baseType: !375, size: 32, align: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !321, line: 30, baseType: !388, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !854, file: !321, line: 32, baseType: !375, size: 32, align: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !854, file: !321, line: 32, baseType: !375, size: 32, align: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !854, file: !321, line: 34, baseType: !535, size: 64, align: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !854, file: !321, line: 35, baseType: !784, size: 64, align: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !854, file: !321, line: 36, baseType: !367, size: 64, align: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !854, file: !321, line: 37, baseType: !367, size: 64, align: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !854, file: !321, line: 38, baseType: !388, size: 64, align: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !854, file: !321, line: 40, baseType: !375, size: 32, align: 32, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !854, file: !321, line: 41, baseType: !535, size: 64, align: 64, offset: 576)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !854, file: !321, line: 43, baseType: !447, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !854, file: !321, line: 44, baseType: !447, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !854, file: !321, line: 45, baseType: !447, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !854, file: !321, line: 48, baseType: !871, size: 64, align: 64, offset: 704)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !873, line: 14, baseType: !874)
!873 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !873, line: 6, size: 256, align: 64, elements: !875)
!875 = !{!876, !877, !886, !887, !888}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !873, line: 7, baseType: !388, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !874, file: !873, line: 9, baseType: !878, size: 64, align: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !880, line: 37, baseType: !881)
!880 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !880, line: 39, size: 192, align: 64, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !881, file: !880, line: 41, baseType: !364, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !880, line: 42, baseType: !878, size: 64, align: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !881, file: !880, line: 43, baseType: !878, size: 64, align: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !874, file: !873, line: 10, baseType: !375, size: 32, align: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !874, file: !873, line: 12, baseType: !375, size: 32, align: 32, offset: 160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !874, file: !873, line: 13, baseType: !375, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !854, file: !321, line: 49, baseType: !388, size: 64, align: 64, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !854, file: !321, line: 51, baseType: !375, size: 32, align: 32, offset: 832)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !854, file: !321, line: 52, baseType: !388, size: 64, align: 64, offset: 896)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !854, file: !321, line: 54, baseType: !607, size: 64, align: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !854, file: !321, line: 55, baseType: !607, size: 64, align: 64, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !854, file: !321, line: 57, baseType: !388, size: 64, align: 64, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !854, file: !321, line: 58, baseType: !350, size: 64, align: 64, offset: 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !854, file: !321, line: 60, baseType: !350, size: 64, align: 64, offset: 1216)
!897 = !DILocation(line: 175, column: 14, scope: !844)
!898 = !DILocalVariable(name: "type", scope: !844, file: !704, line: 176, type: !375)
!899 = !DILocation(line: 176, column: 6, scope: !844)
!900 = !DILocation(line: 178, column: 2, scope: !844)
!901 = distinct !{!901, !900}
!902 = !DILocation(line: 178, column: 10, scope: !903)
!903 = !DILexicalBlockFile(scope: !904, file: !704, discriminator: 1)
!904 = distinct !DILexicalBlock(scope: !905, file: !704, line: 178, column: 10)
!905 = distinct !DILexicalBlock(scope: !844, file: !704, line: 178, column: 4)
!906 = !DILocation(line: 178, column: 15, scope: !903)
!907 = !DILocation(line: 178, column: 5, scope: !908)
!908 = !DILexicalBlockFile(scope: !909, file: !704, discriminator: 2)
!909 = distinct !DILexicalBlock(scope: !904, file: !704, line: 178, column: 3)
!910 = !DILocation(line: 178, column: 14, scope: !911)
!911 = !DILexicalBlockFile(scope: !912, file: !704, discriminator: 3)
!912 = distinct !DILexicalBlock(scope: !904, file: !704, line: 178, column: 12)
!913 = !DILocation(line: 178, column: 99, scope: !911)
!914 = !DILocation(line: 178, column: 110, scope: !915)
!915 = !DILexicalBlockFile(scope: !905, file: !704, discriminator: 4)
!916 = !DILocation(line: 180, column: 30, scope: !844)
!917 = !DILocation(line: 180, column: 10, scope: !844)
!918 = !DILocation(line: 180, column: 46, scope: !844)
!919 = !DILocation(line: 180, column: 51, scope: !844)
!920 = !DILocation(line: 180, column: 73, scope: !921)
!921 = !DILexicalBlockFile(scope: !844, file: !704, discriminator: 1)
!922 = !DILocation(line: 180, column: 54, scope: !921)
!923 = !DILocation(line: 180, column: 86, scope: !921)
!924 = !DILocation(line: 180, column: 9, scope: !921)
!925 = !DILocation(line: 180, column: 9, scope: !926)
!926 = !DILexicalBlockFile(scope: !844, file: !704, discriminator: 2)
!927 = !DILocation(line: 181, column: 22, scope: !844)
!928 = !DILocation(line: 181, column: 3, scope: !844)
!929 = !DILocation(line: 181, column: 37, scope: !844)
!930 = !DILocation(line: 181, column: 3, scope: !921)
!931 = !DILocation(line: 182, column: 23, scope: !844)
!932 = !DILocation(line: 182, column: 3, scope: !844)
!933 = !DILocation(line: 182, column: 38, scope: !844)
!934 = !DILocation(line: 181, column: 3, scope: !926)
!935 = !DILocation(line: 181, column: 3, scope: !936)
!936 = !DILexicalBlockFile(scope: !844, file: !704, discriminator: 3)
!937 = !DILocation(line: 180, column: 9, scope: !936)
!938 = !DILocation(line: 180, column: 9, scope: !939)
!939 = !DILexicalBlockFile(scope: !844, file: !704, discriminator: 4)
!940 = !DILocation(line: 180, column: 7, scope: !939)
!941 = !DILocation(line: 183, column: 68, scope: !844)
!942 = !DILocation(line: 183, column: 59, scope: !844)
!943 = !DILocation(line: 183, column: 48, scope: !844)
!944 = !DILocation(line: 183, column: 2, scope: !844)
!945 = !DILocation(line: 185, column: 11, scope: !844)
!946 = !DILocation(line: 185, column: 9, scope: !844)
!947 = !DILocation(line: 186, column: 23, scope: !844)
!948 = !DILocation(line: 186, column: 31, scope: !844)
!949 = !DILocation(line: 186, column: 2, scope: !844)
!950 = !DILocation(line: 187, column: 1, scope: !844)
!951 = !DILocation(line: 187, column: 1, scope: !921)
!952 = distinct !DISubprogram(name: "cmd_window_close", scope: !704, file: !704, line: 190, type: !705, isLocal: true, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!953 = !DILocalVariable(name: "data", arg: 1, scope: !952, file: !704, line: 190, type: !362)
!954 = !DILocation(line: 190, column: 42, scope: !952)
!955 = !DILocalVariable(name: "tmp", scope: !952, file: !704, line: 192, type: !535)
!956 = !DILocation(line: 192, column: 17, scope: !952)
!957 = !DILocalVariable(name: "destroys", scope: !952, file: !704, line: 192, type: !535)
!958 = !DILocation(line: 192, column: 23, scope: !952)
!959 = !DILocalVariable(name: "first", scope: !952, file: !704, line: 193, type: !388)
!960 = !DILocation(line: 193, column: 8, scope: !952)
!961 = !DILocalVariable(name: "last", scope: !952, file: !704, line: 193, type: !388)
!962 = !DILocation(line: 193, column: 16, scope: !952)
!963 = !DILocalVariable(name: "first_num", scope: !952, file: !704, line: 194, type: !375)
!964 = !DILocation(line: 194, column: 13, scope: !952)
!965 = !DILocalVariable(name: "last_num", scope: !952, file: !704, line: 194, type: !375)
!966 = !DILocation(line: 194, column: 24, scope: !952)
!967 = !DILocalVariable(name: "free_arg", scope: !952, file: !704, line: 195, type: !350)
!968 = !DILocation(line: 195, column: 8, scope: !952)
!969 = !DILocation(line: 197, column: 22, scope: !970)
!970 = distinct !DILexicalBlock(scope: !952, file: !704, line: 197, column: 6)
!971 = !DILocation(line: 197, column: 7, scope: !970)
!972 = !DILocation(line: 197, column: 6, scope: !952)
!973 = !DILocation(line: 198, column: 3, scope: !970)
!974 = !DILocation(line: 200, column: 8, scope: !975)
!975 = distinct !DILexicalBlock(scope: !952, file: !704, line: 200, column: 6)
!976 = !DILocation(line: 200, column: 7, scope: !975)
!977 = !DILocation(line: 200, column: 14, scope: !975)
!978 = !DILocation(line: 200, column: 22, scope: !975)
!979 = !DILocation(line: 200, column: 37, scope: !980)
!980 = !DILexicalBlockFile(scope: !975, file: !704, discriminator: 1)
!981 = !DILocation(line: 200, column: 26, scope: !980)
!982 = !DILocation(line: 200, column: 51, scope: !980)
!983 = !DILocation(line: 201, column: 9, scope: !975)
!984 = !DILocation(line: 201, column: 8, scope: !975)
!985 = !DILocation(line: 201, column: 14, scope: !975)
!986 = !DILocation(line: 201, column: 23, scope: !975)
!987 = !DILocation(line: 201, column: 38, scope: !980)
!988 = !DILocation(line: 201, column: 27, scope: !980)
!989 = !DILocation(line: 200, column: 6, scope: !990)
!990 = !DILexicalBlockFile(scope: !952, file: !704, discriminator: 2)
!991 = !DILocation(line: 202, column: 19, scope: !992)
!992 = distinct !DILexicalBlock(scope: !975, file: !704, line: 201, column: 52)
!993 = !DILocation(line: 202, column: 3, scope: !992)
!994 = !DILocation(line: 203, column: 17, scope: !992)
!995 = !DILocation(line: 206, column: 15, scope: !952)
!996 = !DILocation(line: 206, column: 14, scope: !952)
!997 = !DILocation(line: 206, column: 21, scope: !952)
!998 = !DILocation(line: 206, column: 31, scope: !999)
!999 = !DILexicalBlockFile(scope: !952, file: !704, discriminator: 1)
!1000 = !DILocation(line: 206, column: 43, scope: !999)
!1001 = !DILocation(line: 206, column: 14, scope: !999)
!1002 = !DILocation(line: 206, column: 57, scope: !990)
!1003 = !DILocation(line: 206, column: 52, scope: !990)
!1004 = !DILocation(line: 206, column: 14, scope: !990)
!1005 = !DILocation(line: 206, column: 14, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !952, file: !704, discriminator: 3)
!1007 = !DILocation(line: 206, column: 12, scope: !1006)
!1008 = !DILocation(line: 207, column: 14, scope: !952)
!1009 = !DILocation(line: 207, column: 13, scope: !952)
!1010 = !DILocation(line: 207, column: 19, scope: !952)
!1011 = !DILocation(line: 207, column: 29, scope: !999)
!1012 = !DILocation(line: 207, column: 13, scope: !999)
!1013 = !DILocation(line: 207, column: 46, scope: !990)
!1014 = !DILocation(line: 207, column: 41, scope: !990)
!1015 = !DILocation(line: 207, column: 13, scope: !990)
!1016 = !DILocation(line: 207, column: 13, scope: !1006)
!1017 = !DILocation(line: 207, column: 11, scope: !1006)
!1018 = !DILocation(line: 210, column: 18, scope: !952)
!1019 = !DILocation(line: 211, column: 13, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !952, file: !704, line: 211, column: 2)
!1021 = !DILocation(line: 211, column: 11, scope: !1020)
!1022 = !DILocation(line: 211, column: 7, scope: !1020)
!1023 = !DILocation(line: 211, column: 22, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1025, file: !704, discriminator: 1)
!1025 = distinct !DILexicalBlock(scope: !1020, file: !704, line: 211, column: 2)
!1026 = !DILocation(line: 211, column: 26, scope: !1024)
!1027 = !DILocation(line: 211, column: 2, scope: !1024)
!1028 = !DILocalVariable(name: "rec", scope: !1029, file: !704, line: 212, type: !852)
!1029 = distinct !DILexicalBlock(scope: !1025, file: !704, line: 211, column: 51)
!1030 = !DILocation(line: 212, column: 15, scope: !1029)
!1031 = !DILocation(line: 212, column: 21, scope: !1029)
!1032 = !DILocation(line: 212, column: 26, scope: !1029)
!1033 = !DILocation(line: 214, column: 7, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1029, file: !704, line: 214, column: 7)
!1035 = !DILocation(line: 214, column: 12, scope: !1034)
!1036 = !DILocation(line: 214, column: 22, scope: !1034)
!1037 = !DILocation(line: 214, column: 19, scope: !1034)
!1038 = !DILocation(line: 214, column: 32, scope: !1034)
!1039 = !DILocation(line: 214, column: 35, scope: !1040)
!1040 = !DILexicalBlockFile(scope: !1034, file: !704, discriminator: 1)
!1041 = !DILocation(line: 214, column: 40, scope: !1040)
!1042 = !DILocation(line: 214, column: 50, scope: !1040)
!1043 = !DILocation(line: 214, column: 47, scope: !1040)
!1044 = !DILocation(line: 214, column: 7, scope: !1040)
!1045 = !DILocation(line: 215, column: 30, scope: !1034)
!1046 = !DILocation(line: 215, column: 40, scope: !1034)
!1047 = !DILocation(line: 215, column: 15, scope: !1034)
!1048 = !DILocation(line: 215, column: 13, scope: !1034)
!1049 = !DILocation(line: 215, column: 4, scope: !1034)
!1050 = !DILocation(line: 216, column: 2, scope: !1029)
!1051 = !DILocation(line: 211, column: 40, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1025, file: !704, discriminator: 2)
!1053 = !DILocation(line: 211, column: 45, scope: !1052)
!1054 = !DILocation(line: 211, column: 38, scope: !1052)
!1055 = !DILocation(line: 211, column: 2, scope: !1052)
!1056 = distinct !{!1056, !1057}
!1057 = !DILocation(line: 211, column: 2, scope: !952)
!1058 = !DILocation(line: 219, column: 2, scope: !952)
!1059 = !DILocation(line: 219, column: 9, scope: !999)
!1060 = !DILocation(line: 219, column: 18, scope: !999)
!1061 = !DILocation(line: 219, column: 2, scope: !999)
!1062 = !DILocalVariable(name: "rec", scope: !1063, file: !704, line: 220, type: !852)
!1063 = distinct !DILexicalBlock(scope: !952, file: !704, line: 219, column: 26)
!1064 = !DILocation(line: 220, column: 15, scope: !1063)
!1065 = !DILocation(line: 220, column: 21, scope: !1063)
!1066 = !DILocation(line: 220, column: 31, scope: !1063)
!1067 = !DILocation(line: 222, column: 7, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !704, line: 222, column: 7)
!1069 = !DILocation(line: 222, column: 16, scope: !1068)
!1070 = !DILocation(line: 222, column: 21, scope: !1068)
!1071 = !DILocation(line: 222, column: 7, scope: !1063)
!1072 = !DILocation(line: 223, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !704, line: 223, column: 8)
!1074 = distinct !DILexicalBlock(scope: !1068, file: !704, line: 222, column: 29)
!1075 = !DILocation(line: 223, column: 14, scope: !1073)
!1076 = !DILocation(line: 223, column: 8, scope: !1074)
!1077 = !DILocation(line: 224, column: 20, scope: !1073)
!1078 = !DILocation(line: 224, column: 5, scope: !1073)
!1079 = !DILocation(line: 226, column: 49, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1073, file: !704, line: 225, column: 9)
!1081 = !DILocation(line: 226, column: 5, scope: !1080)
!1082 = !DILocation(line: 229, column: 3, scope: !1074)
!1083 = !DILocation(line: 231, column: 43, scope: !1063)
!1084 = !DILocation(line: 231, column: 53, scope: !1063)
!1085 = !DILocation(line: 231, column: 28, scope: !1063)
!1086 = !DILocation(line: 231, column: 26, scope: !1063)
!1087 = !DILocation(line: 219, column: 2, scope: !990)
!1088 = distinct !{!1088, !1058}
!1089 = !DILocation(line: 234, column: 18, scope: !952)
!1090 = !DILocation(line: 234, column: 2, scope: !952)
!1091 = !DILocation(line: 235, column: 1, scope: !952)
!1092 = !DILocation(line: 235, column: 1, scope: !999)
!1093 = distinct !DISubprogram(name: "cmd_window_server", scope: !704, file: !704, line: 450, type: !705, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1094 = !DILocalVariable(name: "data", arg: 1, scope: !1093, file: !704, line: 450, type: !362)
!1095 = !DILocation(line: 450, column: 43, scope: !1093)
!1096 = !DILocalVariable(name: "optlist", scope: !1093, file: !704, line: 452, type: !635)
!1097 = !DILocation(line: 452, column: 14, scope: !1093)
!1098 = !DILocalVariable(name: "server", scope: !1093, file: !704, line: 453, type: !367)
!1099 = !DILocation(line: 453, column: 14, scope: !1093)
!1100 = !DILocalVariable(name: "tag", scope: !1093, file: !704, line: 454, type: !388)
!1101 = !DILocation(line: 454, column: 15, scope: !1093)
!1102 = !DILocalVariable(name: "free_arg", scope: !1093, file: !704, line: 455, type: !350)
!1103 = !DILocation(line: 455, column: 8, scope: !1093)
!1104 = !DILocation(line: 457, column: 22, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 457, column: 6)
!1106 = !DILocation(line: 457, column: 7, scope: !1105)
!1107 = !DILocation(line: 457, column: 6, scope: !1093)
!1108 = !DILocation(line: 459, column: 3, scope: !1105)
!1109 = !DILocation(line: 461, column: 7, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 461, column: 6)
!1111 = !DILocation(line: 461, column: 6, scope: !1110)
!1112 = !DILocation(line: 461, column: 11, scope: !1110)
!1113 = !DILocation(line: 461, column: 19, scope: !1110)
!1114 = !DILocation(line: 461, column: 22, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1110, file: !704, discriminator: 1)
!1116 = !DILocation(line: 461, column: 34, scope: !1115)
!1117 = !DILocation(line: 461, column: 48, scope: !1115)
!1118 = !DILocation(line: 461, column: 55, scope: !1115)
!1119 = !DILocation(line: 462, column: 27, scope: !1110)
!1120 = !DILocation(line: 462, column: 7, scope: !1110)
!1121 = !DILocation(line: 462, column: 46, scope: !1110)
!1122 = !DILocation(line: 462, column: 53, scope: !1110)
!1123 = !DILocation(line: 463, column: 27, scope: !1110)
!1124 = !DILocation(line: 463, column: 7, scope: !1110)
!1125 = !DILocation(line: 463, column: 48, scope: !1110)
!1126 = !DILocation(line: 461, column: 6, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1093, file: !704, discriminator: 2)
!1128 = !DILocation(line: 464, column: 9, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1110, file: !704, line: 463, column: 57)
!1130 = !DILocation(line: 464, column: 21, scope: !1129)
!1131 = !DILocation(line: 464, column: 36, scope: !1129)
!1132 = !DILocation(line: 464, column: 7, scope: !1129)
!1133 = !DILocation(line: 465, column: 2, scope: !1129)
!1134 = !DILocation(line: 467, column: 7, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 467, column: 6)
!1136 = !DILocation(line: 467, column: 6, scope: !1135)
!1137 = !DILocation(line: 467, column: 11, scope: !1135)
!1138 = !DILocation(line: 467, column: 6, scope: !1093)
!1139 = !DILocation(line: 468, column: 3, scope: !1135)
!1140 = distinct !{!1140, !1139}
!1141 = !DILocation(line: 468, column: 24, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1143, file: !704, discriminator: 1)
!1143 = distinct !DILexicalBlock(scope: !1135, file: !704, line: 468, column: 6)
!1144 = !DILocation(line: 468, column: 8, scope: !1142)
!1145 = !DILocation(line: 468, column: 35, scope: !1142)
!1146 = distinct !{!1146, !1147}
!1147 = !DILocation(line: 468, column: 35, scope: !1143)
!1148 = !DILocation(line: 468, column: 40, scope: !1149)
!1149 = !DILexicalBlockFile(scope: !1150, file: !704, discriminator: 2)
!1150 = distinct !DILexicalBlock(scope: !1143, file: !704, line: 468, column: 38)
!1151 = !DILocation(line: 468, column: 122, scope: !1152)
!1152 = !DILexicalBlockFile(scope: !1149, file: !704, discriminator: 5)
!1153 = !DILocation(line: 468, column: 137, scope: !1149)
!1154 = !DILocation(line: 468, column: 158, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1143, file: !704, discriminator: 3)
!1156 = !DILocation(line: 468, column: 158, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1143, file: !704, discriminator: 4)
!1158 = !DILocation(line: 469, column: 27, scope: !1093)
!1159 = !DILocation(line: 469, column: 11, scope: !1093)
!1160 = !DILocation(line: 469, column: 9, scope: !1093)
!1161 = !DILocation(line: 470, column: 6, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 470, column: 6)
!1163 = !DILocation(line: 470, column: 13, scope: !1162)
!1164 = !DILocation(line: 470, column: 6, scope: !1093)
!1165 = !DILocation(line: 471, column: 35, scope: !1162)
!1166 = !DILocation(line: 471, column: 12, scope: !1162)
!1167 = !DILocation(line: 471, column: 10, scope: !1162)
!1168 = !DILocation(line: 471, column: 3, scope: !1162)
!1169 = !DILocation(line: 473, column: 26, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 473, column: 6)
!1171 = !DILocation(line: 473, column: 6, scope: !1170)
!1172 = !DILocation(line: 473, column: 47, scope: !1170)
!1173 = !DILocation(line: 473, column: 54, scope: !1170)
!1174 = !DILocation(line: 474, column: 6, scope: !1170)
!1175 = !DILocation(line: 474, column: 18, scope: !1170)
!1176 = !DILocation(line: 474, column: 28, scope: !1170)
!1177 = !DILocation(line: 473, column: 6, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1093, file: !704, discriminator: 1)
!1179 = !DILocation(line: 475, column: 3, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1170, file: !704, line: 474, column: 36)
!1181 = distinct !{!1181, !1179}
!1182 = !DILocation(line: 475, column: 12, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1184, file: !704, discriminator: 1)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !704, line: 475, column: 12)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !704, line: 475, column: 6)
!1186 = !DILocation(line: 475, column: 24, scope: !1183)
!1187 = !DILocation(line: 475, column: 44, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1189, file: !704, discriminator: 2)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !704, line: 475, column: 35)
!1190 = !DILocation(line: 475, column: 56, scope: !1188)
!1191 = !DILocation(line: 475, column: 37, scope: !1188)
!1192 = !DILocation(line: 475, column: 69, scope: !1188)
!1193 = !DILocation(line: 475, column: 81, scope: !1188)
!1194 = !DILocation(line: 475, column: 92, scope: !1188)
!1195 = !DILocation(line: 475, column: 4, scope: !1188)
!1196 = !DILocation(line: 475, column: 6, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1185, file: !704, discriminator: 3)
!1198 = !DILocation(line: 476, column: 47, scope: !1180)
!1199 = !DILocation(line: 476, column: 3, scope: !1180)
!1200 = !DILocation(line: 478, column: 2, scope: !1180)
!1201 = !DILocation(line: 480, column: 6, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1093, file: !704, line: 480, column: 6)
!1203 = !DILocation(line: 480, column: 18, scope: !1202)
!1204 = !DILocation(line: 480, column: 28, scope: !1202)
!1205 = !DILocation(line: 480, column: 35, scope: !1202)
!1206 = !DILocation(line: 481, column: 26, scope: !1202)
!1207 = !DILocation(line: 481, column: 6, scope: !1202)
!1208 = !DILocation(line: 481, column: 45, scope: !1202)
!1209 = !DILocation(line: 480, column: 6, scope: !1178)
!1210 = !DILocation(line: 482, column: 47, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1202, file: !704, line: 481, column: 53)
!1212 = !DILocation(line: 482, column: 3, scope: !1211)
!1213 = !DILocation(line: 484, column: 2, scope: !1211)
!1214 = !DILocation(line: 484, column: 13, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1216, file: !704, discriminator: 1)
!1216 = distinct !DILexicalBlock(scope: !1202, file: !704, line: 484, column: 13)
!1217 = !DILocation(line: 484, column: 20, scope: !1215)
!1218 = !DILocation(line: 485, column: 47, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1216, file: !704, line: 484, column: 28)
!1220 = !DILocation(line: 485, column: 106, scope: !1219)
!1221 = !DILocation(line: 485, column: 3, scope: !1219)
!1222 = !DILocation(line: 487, column: 2, scope: !1219)
!1223 = !DILocation(line: 487, column: 13, scope: !1224)
!1224 = !DILexicalBlockFile(scope: !1225, file: !704, discriminator: 1)
!1225 = distinct !DILexicalBlock(scope: !1216, file: !704, line: 487, column: 13)
!1226 = !DILocation(line: 487, column: 25, scope: !1224)
!1227 = !DILocation(line: 487, column: 32, scope: !1224)
!1228 = !DILocation(line: 488, column: 24, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1225, file: !704, line: 487, column: 40)
!1230 = !DILocation(line: 488, column: 36, scope: !1229)
!1231 = !DILocation(line: 488, column: 3, scope: !1229)
!1232 = !DILocation(line: 489, column: 27, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1229, file: !704, line: 489, column: 7)
!1234 = !DILocation(line: 489, column: 7, scope: !1233)
!1235 = !DILocation(line: 489, column: 46, scope: !1233)
!1236 = !DILocation(line: 489, column: 7, scope: !1229)
!1237 = !DILocation(line: 490, column: 32, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1233, file: !704, line: 489, column: 54)
!1239 = !DILocation(line: 490, column: 44, scope: !1238)
!1240 = !DILocation(line: 490, column: 25, scope: !1238)
!1241 = !DILocation(line: 491, column: 37, scope: !1238)
!1242 = !DILocation(line: 491, column: 45, scope: !1238)
!1243 = !DILocation(line: 491, column: 28, scope: !1238)
!1244 = !DILocation(line: 491, column: 4, scope: !1238)
!1245 = !DILocation(line: 491, column: 16, scope: !1238)
!1246 = !DILocation(line: 491, column: 26, scope: !1238)
!1247 = !DILocation(line: 492, column: 48, scope: !1238)
!1248 = !DILocation(line: 492, column: 106, scope: !1238)
!1249 = !DILocation(line: 492, column: 114, scope: !1238)
!1250 = !DILocation(line: 492, column: 4, scope: !1238)
!1251 = !DILocation(line: 494, column: 3, scope: !1238)
!1252 = !DILocation(line: 495, column: 47, scope: !1229)
!1253 = !DILocation(line: 495, column: 102, scope: !1229)
!1254 = !DILocation(line: 495, column: 110, scope: !1229)
!1255 = !DILocation(line: 495, column: 115, scope: !1229)
!1256 = !DILocation(line: 495, column: 123, scope: !1229)
!1257 = !DILocation(line: 495, column: 132, scope: !1229)
!1258 = !DILocation(line: 495, column: 141, scope: !1229)
!1259 = !DILocation(line: 495, column: 149, scope: !1229)
!1260 = !DILocation(line: 495, column: 158, scope: !1229)
!1261 = !DILocation(line: 495, column: 166, scope: !1229)
!1262 = !DILocation(line: 495, column: 141, scope: !1263)
!1263 = !DILexicalBlockFile(scope: !1229, file: !704, discriminator: 1)
!1264 = !DILocation(line: 495, column: 9, scope: !1265)
!1265 = !DILexicalBlockFile(scope: !1229, file: !704, discriminator: 2)
!1266 = !DILocation(line: 495, column: 17, scope: !1265)
!1267 = !DILocation(line: 495, column: 26, scope: !1265)
!1268 = !DILocation(line: 495, column: 141, scope: !1265)
!1269 = !DILocation(line: 495, column: 141, scope: !1270)
!1270 = !DILexicalBlockFile(scope: !1229, file: !704, discriminator: 3)
!1271 = !DILocation(line: 495, column: 3, scope: !1270)
!1272 = !DILocation(line: 500, column: 2, scope: !1229)
!1273 = !DILocation(line: 502, column: 18, scope: !1093)
!1274 = !DILocation(line: 502, column: 2, scope: !1093)
!1275 = !DILocation(line: 503, column: 1, scope: !1093)
!1276 = !DILocation(line: 503, column: 1, scope: !1178)
!1277 = distinct !DISubprogram(name: "cmd_window_refnum", scope: !704, file: !704, line: 238, type: !705, isLocal: true, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1278 = !DILocalVariable(name: "data", arg: 1, scope: !1277, file: !704, line: 238, type: !362)
!1279 = !DILocation(line: 238, column: 43, scope: !1277)
!1280 = !DILocalVariable(name: "window", scope: !1277, file: !704, line: 240, type: !852)
!1281 = !DILocation(line: 240, column: 14, scope: !1277)
!1282 = !DILocation(line: 242, column: 18, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1277, file: !704, line: 242, column: 6)
!1284 = !DILocation(line: 242, column: 7, scope: !1283)
!1285 = !DILocation(line: 242, column: 6, scope: !1277)
!1286 = !DILocation(line: 243, column: 3, scope: !1283)
!1287 = !DILocation(line: 245, column: 35, scope: !1277)
!1288 = !DILocation(line: 245, column: 30, scope: !1277)
!1289 = !DILocation(line: 245, column: 11, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !1277, file: !704, discriminator: 1)
!1291 = !DILocation(line: 245, column: 9, scope: !1277)
!1292 = !DILocation(line: 246, column: 6, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1277, file: !704, line: 246, column: 6)
!1294 = !DILocation(line: 246, column: 13, scope: !1293)
!1295 = !DILocation(line: 246, column: 6, scope: !1277)
!1296 = !DILocation(line: 247, column: 21, scope: !1293)
!1297 = !DILocation(line: 247, column: 3, scope: !1293)
!1298 = !DILocation(line: 248, column: 1, scope: !1277)
!1299 = distinct !DISubprogram(name: "cmd_window_goto", scope: !704, file: !704, line: 341, type: !705, isLocal: true, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1300 = !DILocalVariable(name: "data", arg: 1, scope: !1299, file: !704, line: 341, type: !362)
!1301 = !DILocation(line: 341, column: 41, scope: !1299)
!1302 = !DILocalVariable(name: "window", scope: !1299, file: !704, line: 343, type: !852)
!1303 = !DILocation(line: 343, column: 14, scope: !1299)
!1304 = !DILocalVariable(name: "target", scope: !1299, file: !704, line: 344, type: !388)
!1305 = !DILocation(line: 344, column: 8, scope: !1299)
!1306 = !DILocalVariable(name: "free_arg", scope: !1299, file: !704, line: 345, type: !350)
!1307 = !DILocation(line: 345, column: 8, scope: !1299)
!1308 = !DILocation(line: 347, column: 2, scope: !1299)
!1309 = distinct !{!1309, !1308}
!1310 = !DILocation(line: 347, column: 10, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1312, file: !704, discriminator: 1)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !704, line: 347, column: 10)
!1313 = distinct !DILexicalBlock(scope: !1299, file: !704, line: 347, column: 4)
!1314 = !DILocation(line: 347, column: 15, scope: !1311)
!1315 = !DILocation(line: 347, column: 5, scope: !1316)
!1316 = !DILexicalBlockFile(scope: !1317, file: !704, discriminator: 2)
!1317 = distinct !DILexicalBlock(scope: !1312, file: !704, line: 347, column: 3)
!1318 = !DILocation(line: 347, column: 14, scope: !1319)
!1319 = !DILexicalBlockFile(scope: !1320, file: !704, discriminator: 3)
!1320 = distinct !DILexicalBlock(scope: !1312, file: !704, line: 347, column: 12)
!1321 = !DILocation(line: 347, column: 99, scope: !1319)
!1322 = !DILocation(line: 347, column: 110, scope: !1323)
!1323 = !DILexicalBlockFile(scope: !1313, file: !704, discriminator: 4)
!1324 = !DILocation(line: 349, column: 17, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1299, file: !704, line: 349, column: 6)
!1326 = !DILocation(line: 349, column: 6, scope: !1325)
!1327 = !DILocation(line: 349, column: 6, scope: !1299)
!1328 = !DILocation(line: 350, column: 21, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1325, file: !704, line: 349, column: 27)
!1330 = !DILocation(line: 350, column: 3, scope: !1329)
!1331 = !DILocation(line: 351, column: 3, scope: !1329)
!1332 = !DILocation(line: 354, column: 22, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1299, file: !704, line: 354, column: 6)
!1334 = !DILocation(line: 354, column: 7, scope: !1333)
!1335 = !DILocation(line: 354, column: 6, scope: !1299)
!1336 = !DILocation(line: 355, column: 3, scope: !1333)
!1337 = !DILocation(line: 357, column: 25, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1299, file: !704, line: 357, column: 6)
!1339 = !DILocation(line: 357, column: 6, scope: !1338)
!1340 = !DILocation(line: 357, column: 43, scope: !1338)
!1341 = !DILocation(line: 357, column: 6, scope: !1299)
!1342 = !DILocation(line: 358, column: 36, scope: !1338)
!1343 = !DILocation(line: 359, column: 4, scope: !1338)
!1344 = !DILocation(line: 358, column: 12, scope: !1338)
!1345 = !DILocation(line: 358, column: 10, scope: !1338)
!1346 = !DILocation(line: 358, column: 3, scope: !1338)
!1347 = !DILocation(line: 361, column: 29, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1338, file: !704, line: 360, column: 7)
!1349 = !DILocation(line: 361, column: 12, scope: !1348)
!1350 = !DILocation(line: 361, column: 10, scope: !1348)
!1351 = !DILocation(line: 362, column: 7, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1348, file: !704, line: 362, column: 7)
!1353 = !DILocation(line: 362, column: 14, scope: !1352)
!1354 = !DILocation(line: 362, column: 21, scope: !1352)
!1355 = !DILocation(line: 362, column: 24, scope: !1356)
!1356 = !DILexicalBlockFile(scope: !1352, file: !704, discriminator: 1)
!1357 = !DILocation(line: 362, column: 36, scope: !1356)
!1358 = !DILocation(line: 362, column: 50, scope: !1356)
!1359 = !DILocation(line: 362, column: 7, scope: !1356)
!1360 = !DILocation(line: 363, column: 36, scope: !1352)
!1361 = !DILocation(line: 363, column: 48, scope: !1352)
!1362 = !DILocation(line: 363, column: 63, scope: !1352)
!1363 = !DILocation(line: 363, column: 13, scope: !1352)
!1364 = !DILocation(line: 363, column: 11, scope: !1352)
!1365 = !DILocation(line: 363, column: 4, scope: !1352)
!1366 = !DILocation(line: 364, column: 7, scope: !1367)
!1367 = distinct !DILexicalBlock(scope: !1348, file: !704, line: 364, column: 7)
!1368 = !DILocation(line: 364, column: 14, scope: !1367)
!1369 = !DILocation(line: 364, column: 7, scope: !1348)
!1370 = !DILocation(line: 365, column: 41, scope: !1367)
!1371 = !DILocation(line: 365, column: 13, scope: !1367)
!1372 = !DILocation(line: 365, column: 11, scope: !1367)
!1373 = !DILocation(line: 365, column: 4, scope: !1367)
!1374 = !DILocation(line: 368, column: 6, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1299, file: !704, line: 368, column: 6)
!1376 = !DILocation(line: 368, column: 13, scope: !1375)
!1377 = !DILocation(line: 368, column: 6, scope: !1299)
!1378 = !DILocation(line: 369, column: 21, scope: !1375)
!1379 = !DILocation(line: 369, column: 3, scope: !1375)
!1380 = !DILocation(line: 371, column: 18, scope: !1299)
!1381 = !DILocation(line: 371, column: 2, scope: !1299)
!1382 = !DILocation(line: 372, column: 1, scope: !1299)
!1383 = !DILocation(line: 372, column: 1, scope: !1384)
!1384 = !DILexicalBlockFile(scope: !1299, file: !704, discriminator: 1)
!1385 = distinct !DISubprogram(name: "cmd_window_previous", scope: !704, file: !704, line: 393, type: !523, isLocal: true, isDefinition: true, scopeLine: 394, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1386 = !DILocalVariable(name: "num", scope: !1385, file: !704, line: 395, type: !375)
!1387 = !DILocation(line: 395, column: 6, scope: !1385)
!1388 = !DILocation(line: 397, column: 27, scope: !1385)
!1389 = !DILocation(line: 397, column: 39, scope: !1385)
!1390 = !DILocation(line: 397, column: 8, scope: !1385)
!1391 = !DILocation(line: 397, column: 6, scope: !1385)
!1392 = !DILocation(line: 398, column: 6, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1385, file: !704, line: 398, column: 6)
!1394 = !DILocation(line: 398, column: 10, scope: !1393)
!1395 = !DILocation(line: 398, column: 6, scope: !1385)
!1396 = !DILocation(line: 398, column: 21, scope: !1397)
!1397 = !DILexicalBlockFile(scope: !1393, file: !704, discriminator: 1)
!1398 = !DILocation(line: 398, column: 19, scope: !1397)
!1399 = !DILocation(line: 398, column: 15, scope: !1397)
!1400 = !DILocation(line: 400, column: 39, scope: !1385)
!1401 = !DILocation(line: 400, column: 20, scope: !1385)
!1402 = !DILocation(line: 400, column: 2, scope: !1403)
!1403 = !DILexicalBlockFile(scope: !1385, file: !704, discriminator: 1)
!1404 = !DILocation(line: 401, column: 1, scope: !1385)
!1405 = distinct !DISubprogram(name: "cmd_window_next", scope: !704, file: !704, line: 375, type: !523, isLocal: true, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1406 = !DILocalVariable(name: "num", scope: !1405, file: !704, line: 377, type: !375)
!1407 = !DILocation(line: 377, column: 6, scope: !1405)
!1408 = !DILocation(line: 379, column: 27, scope: !1405)
!1409 = !DILocation(line: 379, column: 39, scope: !1405)
!1410 = !DILocation(line: 379, column: 8, scope: !1405)
!1411 = !DILocation(line: 379, column: 6, scope: !1405)
!1412 = !DILocation(line: 380, column: 6, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1405, file: !704, line: 380, column: 6)
!1414 = !DILocation(line: 380, column: 10, scope: !1413)
!1415 = !DILocation(line: 380, column: 6, scope: !1405)
!1416 = !DILocation(line: 380, column: 21, scope: !1417)
!1417 = !DILexicalBlockFile(scope: !1413, file: !704, discriminator: 1)
!1418 = !DILocation(line: 380, column: 19, scope: !1417)
!1419 = !DILocation(line: 380, column: 15, scope: !1417)
!1420 = !DILocation(line: 382, column: 39, scope: !1405)
!1421 = !DILocation(line: 382, column: 20, scope: !1405)
!1422 = !DILocation(line: 382, column: 2, scope: !1423)
!1423 = !DILexicalBlockFile(scope: !1405, file: !704, discriminator: 1)
!1424 = !DILocation(line: 383, column: 1, scope: !1405)
!1425 = distinct !DISubprogram(name: "cmd_window_last", scope: !704, file: !704, line: 386, type: !523, isLocal: true, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1426 = !DILocation(line: 388, column: 6, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1425, file: !704, line: 388, column: 6)
!1428 = !DILocation(line: 388, column: 15, scope: !1427)
!1429 = !DILocation(line: 388, column: 20, scope: !1427)
!1430 = !DILocation(line: 388, column: 6, scope: !1425)
!1431 = !DILocation(line: 389, column: 21, scope: !1427)
!1432 = !DILocation(line: 389, column: 30, scope: !1427)
!1433 = !DILocation(line: 389, column: 36, scope: !1427)
!1434 = !DILocation(line: 389, column: 3, scope: !1427)
!1435 = !DILocation(line: 390, column: 1, scope: !1425)
!1436 = distinct !DISubprogram(name: "cmd_window_level", scope: !704, file: !704, line: 404, type: !705, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1437 = !DILocalVariable(name: "data", arg: 1, scope: !1436, file: !704, line: 404, type: !362)
!1438 = !DILocation(line: 404, column: 42, scope: !1436)
!1439 = !DILocalVariable(name: "level", scope: !1436, file: !704, line: 406, type: !388)
!1440 = !DILocation(line: 406, column: 8, scope: !1436)
!1441 = !DILocation(line: 408, column: 2, scope: !1436)
!1442 = distinct !{!1442, !1441}
!1443 = !DILocation(line: 408, column: 10, scope: !1444)
!1444 = !DILexicalBlockFile(scope: !1445, file: !704, discriminator: 1)
!1445 = distinct !DILexicalBlock(scope: !1446, file: !704, line: 408, column: 10)
!1446 = distinct !DILexicalBlock(scope: !1436, file: !704, line: 408, column: 4)
!1447 = !DILocation(line: 408, column: 15, scope: !1444)
!1448 = !DILocation(line: 408, column: 5, scope: !1449)
!1449 = !DILexicalBlockFile(scope: !1450, file: !704, discriminator: 2)
!1450 = distinct !DILexicalBlock(scope: !1445, file: !704, line: 408, column: 3)
!1451 = !DILocation(line: 408, column: 14, scope: !1452)
!1452 = !DILexicalBlockFile(scope: !1453, file: !704, discriminator: 3)
!1453 = distinct !DILexicalBlock(scope: !1445, file: !704, line: 408, column: 12)
!1454 = !DILocation(line: 408, column: 99, scope: !1452)
!1455 = !DILocation(line: 408, column: 110, scope: !1456)
!1456 = !DILexicalBlockFile(scope: !1446, file: !704, discriminator: 4)
!1457 = !DILocation(line: 410, column: 19, scope: !1436)
!1458 = !DILocation(line: 410, column: 45, scope: !1436)
!1459 = !DILocation(line: 410, column: 57, scope: !1436)
!1460 = !DILocation(line: 410, column: 64, scope: !1436)
!1461 = !DILocation(line: 410, column: 31, scope: !1436)
!1462 = !DILocation(line: 410, column: 2, scope: !1463)
!1463 = !DILexicalBlockFile(scope: !1436, file: !704, discriminator: 1)
!1464 = !DILocation(line: 412, column: 10, scope: !1436)
!1465 = !DILocation(line: 412, column: 22, scope: !1436)
!1466 = !DILocation(line: 412, column: 28, scope: !1436)
!1467 = !DILocation(line: 412, column: 35, scope: !1463)
!1468 = !DILocation(line: 412, column: 10, scope: !1463)
!1469 = !DILocation(line: 413, column: 14, scope: !1436)
!1470 = !DILocation(line: 413, column: 26, scope: !1436)
!1471 = !DILocation(line: 413, column: 3, scope: !1436)
!1472 = !DILocation(line: 412, column: 10, scope: !1473)
!1473 = !DILexicalBlockFile(scope: !1436, file: !704, discriminator: 2)
!1474 = !DILocation(line: 412, column: 10, scope: !1475)
!1475 = !DILexicalBlockFile(scope: !1436, file: !704, discriminator: 3)
!1476 = !DILocation(line: 412, column: 8, scope: !1475)
!1477 = !DILocation(line: 414, column: 46, scope: !1436)
!1478 = !DILocation(line: 414, column: 99, scope: !1436)
!1479 = !DILocation(line: 414, column: 2, scope: !1436)
!1480 = !DILocation(line: 416, column: 9, scope: !1436)
!1481 = !DILocation(line: 416, column: 2, scope: !1436)
!1482 = !DILocation(line: 417, column: 1, scope: !1436)
!1483 = !DILocation(line: 417, column: 1, scope: !1463)
!1484 = distinct !DISubprogram(name: "cmd_window_immortal", scope: !704, file: !704, line: 420, type: !705, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !707)
!1485 = !DILocalVariable(name: "data", arg: 1, scope: !1484, file: !704, line: 420, type: !362)
!1486 = !DILocation(line: 420, column: 45, scope: !1484)
!1487 = !DILocalVariable(name: "set", scope: !1484, file: !704, line: 422, type: !375)
!1488 = !DILocation(line: 422, column: 6, scope: !1484)
!1489 = !DILocation(line: 424, column: 7, scope: !1490)
!1490 = distinct !DILexicalBlock(scope: !1484, file: !704, line: 424, column: 6)
!1491 = !DILocation(line: 424, column: 6, scope: !1490)
!1492 = !DILocation(line: 424, column: 12, scope: !1490)
!1493 = !DILocation(line: 424, column: 6, scope: !1484)
!1494 = !DILocation(line: 425, column: 9, scope: !1490)
!1495 = !DILocation(line: 425, column: 21, scope: !1490)
!1496 = !DILocation(line: 425, column: 7, scope: !1490)
!1497 = !DILocation(line: 425, column: 3, scope: !1490)
!1498 = !DILocation(line: 426, column: 30, scope: !1499)
!1499 = distinct !DILexicalBlock(scope: !1490, file: !704, line: 426, column: 11)
!1500 = !DILocation(line: 426, column: 11, scope: !1499)
!1501 = !DILocation(line: 426, column: 42, scope: !1499)
!1502 = !DILocation(line: 426, column: 11, scope: !1490)
!1503 = !DILocation(line: 427, column: 21, scope: !1499)
!1504 = !DILocation(line: 427, column: 17, scope: !1499)
!1505 = !DILocation(line: 428, column: 30, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1499, file: !704, line: 428, column: 11)
!1507 = !DILocation(line: 428, column: 11, scope: !1506)
!1508 = !DILocation(line: 428, column: 43, scope: !1506)
!1509 = !DILocation(line: 428, column: 11, scope: !1499)
!1510 = !DILocation(line: 429, column: 21, scope: !1506)
!1511 = !DILocation(line: 429, column: 17, scope: !1506)
!1512 = !DILocation(line: 430, column: 30, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1506, file: !704, line: 430, column: 11)
!1514 = !DILocation(line: 430, column: 11, scope: !1513)
!1515 = !DILocation(line: 430, column: 46, scope: !1513)
!1516 = !DILocation(line: 430, column: 11, scope: !1506)
!1517 = !DILocation(line: 431, column: 24, scope: !1513)
!1518 = !DILocation(line: 431, column: 36, scope: !1513)
!1519 = !DILocation(line: 431, column: 23, scope: !1513)
!1520 = !DILocation(line: 431, column: 21, scope: !1513)
!1521 = !DILocation(line: 431, column: 17, scope: !1513)
!1522 = !DILocation(line: 433, column: 47, scope: !1523)
!1523 = distinct !DILexicalBlock(scope: !1513, file: !704, line: 432, column: 7)
!1524 = !DILocation(line: 433, column: 3, scope: !1523)
!1525 = !DILocation(line: 435, column: 3, scope: !1523)
!1526 = !DILocation(line: 438, column: 6, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1484, file: !704, line: 438, column: 6)
!1528 = !DILocation(line: 438, column: 6, scope: !1484)
!1529 = !DILocation(line: 439, column: 37, scope: !1530)
!1530 = distinct !DILexicalBlock(scope: !1527, file: !704, line: 438, column: 11)
!1531 = !DILocation(line: 439, column: 17, scope: !1530)
