; ModuleID = './line254-printtext.o.i'
source_filename = "./line254-printtext.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!53 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!54 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !{!67, !68, !70, !72, !75, !77, !84, !85, !86, !87, !71}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !69, line: 77, baseType: !67)
!69 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !69, line: 48, baseType: !71)
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !69, line: 46, baseType: !74)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !78, line: 9, baseType: !79)
!78 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !82, !82, !82, !82, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!87 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!88 = !{!89, !91, !92, !93, !94, !95, !96, !97}
!89 = distinct !DIGlobalVariable(name: "signal_gui_print_text_finished", scope: !0, file: !90, line: 37, type: !85, isLocal: true, isDefinition: true, variable: i32* @signal_gui_print_text_finished)
!90 = !DIFile(filename: "printtext.c", directory: "/home/lichi/Desktop/irssi/task1")
!91 = distinct !DIGlobalVariable(name: "signal_print_starting", scope: !0, file: !90, line: 38, type: !85, isLocal: true, isDefinition: true, variable: i32* @signal_print_starting)
!92 = distinct !DIGlobalVariable(name: "signal_print_text", scope: !0, file: !90, line: 39, type: !85, isLocal: true, isDefinition: true, variable: i32* @signal_print_text)
!93 = distinct !DIGlobalVariable(name: "signal_print_format", scope: !0, file: !90, line: 40, type: !85, isLocal: true, isDefinition: true, variable: i32* @signal_print_format)
!94 = distinct !DIGlobalVariable(name: "sending_print_starting", scope: !0, file: !90, line: 42, type: !85, isLocal: true, isDefinition: true, variable: i32* @sending_print_starting)
!95 = distinct !DIGlobalVariable(name: "beep_msg_level", scope: !0, file: !90, line: 35, type: !85, isLocal: true, isDefinition: true, variable: i32* @beep_msg_level)
!96 = distinct !DIGlobalVariable(name: "beep_when_away", scope: !0, file: !90, line: 35, type: !85, isLocal: true, isDefinition: true, variable: i32* @beep_when_away)
!97 = distinct !DIGlobalVariable(name: "beep_when_window_active", scope: !0, file: !90, line: 35, type: !85, isLocal: true, isDefinition: true, variable: i32* @beep_when_window_active)
!98 = !{i32 2, !"Dwarf Version", i32 4}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!101 = distinct !DISubprogram(name: "printformat_module_dest_args", scope: !90, file: !90, line: 46, type: !102, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !75, !104, !85, !519}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !106, line: 50, size: 576, align: 64, elements: !108)
!108 = !{!109, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !107, file: !106, line: 51, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !112, line: 117, baseType: !113)
!112 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !114, line: 28, size: 1280, align: 64, elements: !115)
!114 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = !{!116, !117, !118, !119, !120, !128, !475, !476, !477, !478, !479, !480, !481, !482, !483, !502, !503, !504, !505, !506, !507, !508, !509}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !113, file: !114, line: 29, baseType: !85, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 30, baseType: !84, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !113, file: !114, line: 32, baseType: !85, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !113, file: !114, line: 32, baseType: !85, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !113, file: !114, line: 34, baseType: !121, size: 64, align: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !123, line: 37, baseType: !124)
!123 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !123, line: 39, size: 128, align: 64, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !123, line: 41, baseType: !68, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !123, line: 42, baseType: !121, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !113, file: !114, line: 35, baseType: !129, size: 64, align: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !112, line: 108, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !132, line: 5, size: 704, align: 64, elements: !133)
!132 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!133 = !{!134, !136, !137, !142, !143, !462, !463, !464, !465, !466, !467, !471}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !135, line: 3, baseType: !85, size: 32, align: 32)
!135 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !131, file: !135, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !131, file: !135, line: 5, baseType: !138, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !140, line: 37, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !140, line: 37, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !131, file: !135, line: 7, baseType: !67, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !131, file: !135, line: 8, baseType: !144, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !112, line: 107, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !147, line: 30, size: 2240, align: 64, elements: !148)
!147 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = !{!149, !151, !152, !153, !372, !377, !378, !379, !380, !381, !382, !383, !384, !385, !389, !390, !394, !395, !396, !400, !401, !402, !403, !404, !405, !406, !407, !408, !414, !415, !416, !417, !418, !422, !426, !430, !434, !438, !443, !450, !457, !461}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !150, line: 3, baseType: !85, size: 32, align: 32)
!150 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !146, file: !150, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !146, file: !150, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !146, file: !150, line: 8, baseType: !154, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !112, line: 113, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !147, line: 25, size: 1920, align: 64, elements: !157)
!157 = !{!158, !160, !161, !162, !163, !164, !165, !166, !167, !169, !170, !171, !172, !173, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !159, line: 3, baseType: !85, size: 32, align: 32)
!159 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !156, file: !159, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !156, file: !159, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !156, file: !159, line: 9, baseType: !84, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !156, file: !159, line: 10, baseType: !85, size: 32, align: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !156, file: !159, line: 11, baseType: !84, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !156, file: !159, line: 11, baseType: !84, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !156, file: !159, line: 11, baseType: !84, size: 64, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !156, file: !159, line: 13, baseType: !168, size: 16, align: 16, offset: 448)
!168 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !156, file: !159, line: 14, baseType: !84, size: 64, align: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !156, file: !159, line: 15, baseType: !84, size: 64, align: 64, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !156, file: !159, line: 16, baseType: !85, size: 32, align: 32, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !156, file: !159, line: 17, baseType: !84, size: 64, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !156, file: !159, line: 19, baseType: !174, size: 64, align: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !112, line: 99, baseType: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !112, line: 99, flags: DIFlagFwdDecl)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !156, file: !159, line: 19, baseType: !174, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !156, file: !159, line: 21, baseType: !84, size: 64, align: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !156, file: !159, line: 22, baseType: !84, size: 64, align: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !156, file: !159, line: 23, baseType: !84, size: 64, align: 64, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !156, file: !159, line: 24, baseType: !84, size: 64, align: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !156, file: !159, line: 26, baseType: !84, size: 64, align: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !156, file: !159, line: 27, baseType: !84, size: 64, align: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !156, file: !159, line: 28, baseType: !84, size: 64, align: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !156, file: !159, line: 29, baseType: !84, size: 64, align: 64, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !156, file: !159, line: 30, baseType: !84, size: 64, align: 64, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !156, file: !159, line: 31, baseType: !84, size: 64, align: 64, offset: 1472)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !156, file: !159, line: 32, baseType: !84, size: 64, align: 64, offset: 1536)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !156, file: !159, line: 33, baseType: !84, size: 64, align: 64, offset: 1600)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !156, file: !159, line: 35, baseType: !191, size: 64, align: 64, offset: 1664)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !194)
!194 = !{!195, !197, !329, !330, !335, !336, !337, !338, !339, !348, !349, !350, !354, !355, !356, !357, !358, !359, !360, !361}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !193, file: !4, line: 100, baseType: !196, size: 32, align: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !69, line: 49, baseType: !85)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !193, file: !4, line: 101, baseType: !198, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !201)
!201 = !{!202, !223, !229, !235, !239, !316, !320, !325}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !200, file: !4, line: 133, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !191, !72, !207, !210, !211}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !208, line: 66, baseType: !209)
!208 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!209 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !214, line: 42, baseType: !215)
!214 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !214, line: 44, size: 128, align: 64, elements: !216)
!216 = !{!217, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !215, file: !214, line: 46, baseType: !218, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !219, line: 36, baseType: !220)
!219 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !208, line: 45, baseType: !87)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !215, file: !214, line: 47, baseType: !196, size: 32, align: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !215, file: !214, line: 48, baseType: !72, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !200, file: !4, line: 138, baseType: !224, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!206, !191, !227, !207, !210, !211}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !200, file: !4, line: 143, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!206, !191, !233, !234, !211}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !208, line: 51, baseType: !71)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !200, file: !4, line: 147, baseType: !236, size: 64, align: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!206, !191, !211}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !200, file: !4, line: 149, baseType: !240, size: 64, align: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !191, !315}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !246)
!246 = !{!247, !248, !269, !298, !300, !304, !305, !306, !307, !308, !309, !310, !311}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !245, file: !16, line: 174, baseType: !68, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !245, file: !16, line: 175, baseType: !249, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !252)
!252 = !{!253, !257, !258}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !251, file: !16, line: 198, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !68}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !251, file: !16, line: 199, baseType: !254, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !251, file: !16, line: 200, baseType: !259, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !68, !243, !262, !268}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !68}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !69, line: 50, baseType: !196)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !245, file: !16, line: 177, baseType: !270, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !274)
!274 = !{!275, !280, !284, !288, !292, !293}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !273, file: !16, line: 216, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!267, !243, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !273, file: !16, line: 218, baseType: !281, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!267, !243}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !273, file: !16, line: 219, baseType: !285, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!267, !243, !263, !68}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !273, file: !16, line: 222, baseType: !289, size: 64, align: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !243}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !273, file: !16, line: 226, baseType: !263, size: 64, align: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !273, file: !16, line: 227, baseType: !294, size: 64, align: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !245, file: !16, line: 178, baseType: !299, size: 32, align: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !69, line: 55, baseType: !87)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !245, file: !16, line: 180, baseType: !301, size: 64, align: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !245, file: !16, line: 182, baseType: !196, size: 32, align: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !245, file: !16, line: 183, baseType: !299, size: 32, align: 32, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !245, file: !16, line: 184, baseType: !299, size: 32, align: 32, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !245, file: !16, line: 186, baseType: !121, size: 64, align: 64, offset: 448)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !16, line: 188, baseType: !243, size: 64, align: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !16, line: 189, baseType: !243, size: 64, align: 64, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !245, file: !16, line: 191, baseType: !84, size: 64, align: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !245, file: !16, line: 193, baseType: !312, size: 64, align: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !200, file: !4, line: 151, baseType: !317, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !191}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !200, file: !4, line: 152, baseType: !321, size: 64, align: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!206, !191, !324, !211}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !200, file: !4, line: 155, baseType: !326, size: 64, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!324, !191}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !193, file: !4, line: 103, baseType: !72, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !193, file: !4, line: 104, baseType: !331, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !332, line: 77, baseType: !333)
!332 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !332, line: 77, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !193, file: !4, line: 105, baseType: !331, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !193, file: !4, line: 106, baseType: !72, size: 64, align: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !193, file: !4, line: 107, baseType: !299, size: 32, align: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !193, file: !4, line: 109, baseType: !207, size: 64, align: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !193, file: !4, line: 110, baseType: !340, size: 64, align: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !342, line: 39, baseType: !343)
!342 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !342, line: 41, size: 192, align: 64, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !343, file: !342, line: 43, baseType: !72, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !343, file: !342, line: 44, baseType: !207, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !343, file: !342, line: 45, baseType: !207, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !193, file: !4, line: 111, baseType: !340, size: 64, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !193, file: !4, line: 112, baseType: !340, size: 64, align: 64, offset: 640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !193, file: !4, line: 113, baseType: !351, size: 48, align: 8, offset: 704)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 48, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 6)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !193, file: !4, line: 117, baseType: !299, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !193, file: !4, line: 118, baseType: !299, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !193, file: !4, line: 119, baseType: !299, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !193, file: !4, line: 120, baseType: !299, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !193, file: !4, line: 121, baseType: !299, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !193, file: !4, line: 122, baseType: !299, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !193, file: !4, line: 124, baseType: !68, size: 64, align: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !193, file: !4, line: 125, baseType: !68, size: 64, align: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !156, file: !159, line: 38, baseType: !87, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !156, file: !159, line: 39, baseType: !87, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !156, file: !159, line: 40, baseType: !87, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !156, file: !159, line: 41, baseType: !87, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !156, file: !159, line: 42, baseType: !87, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !156, file: !159, line: 43, baseType: !87, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !156, file: !159, line: 44, baseType: !87, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !156, file: !159, line: 45, baseType: !87, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !156, file: !159, line: 46, baseType: !84, size: 64, align: 64, offset: 1792)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !156, file: !159, line: 47, baseType: !84, size: 64, align: 64, offset: 1856)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !146, file: !150, line: 9, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !374, line: 75, baseType: !375)
!374 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !376, line: 139, baseType: !71)
!376 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !146, file: !150, line: 10, baseType: !373, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !146, file: !150, line: 12, baseType: !84, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !146, file: !150, line: 13, baseType: !84, size: 64, align: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !146, file: !150, line: 15, baseType: !87, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !146, file: !150, line: 16, baseType: !87, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !146, file: !150, line: 17, baseType: !87, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !146, file: !150, line: 18, baseType: !87, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !146, file: !150, line: 19, baseType: !87, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !146, file: !150, line: 21, baseType: !386, size: 64, align: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !112, line: 102, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !112, line: 102, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !146, file: !150, line: 22, baseType: !85, size: 32, align: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !146, file: !150, line: 25, baseType: !391, size: 128, align: 64, offset: 640)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 128, align: 64, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 2)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !146, file: !150, line: 26, baseType: !85, size: 32, align: 32, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !146, file: !150, line: 27, baseType: !85, size: 32, align: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !146, file: !150, line: 29, baseType: !397, size: 64, align: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !112, line: 103, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !112, line: 103, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !146, file: !150, line: 30, baseType: !138, size: 64, align: 64, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !146, file: !150, line: 32, baseType: !84, size: 64, align: 64, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !146, file: !150, line: 33, baseType: !84, size: 64, align: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !146, file: !150, line: 34, baseType: !84, size: 64, align: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !146, file: !150, line: 35, baseType: !87, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !146, file: !150, line: 36, baseType: !87, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !146, file: !150, line: 37, baseType: !87, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !146, file: !150, line: 38, baseType: !87, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !146, file: !150, line: 40, baseType: !409, size: 128, align: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !69, line: 504, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !69, line: 506, size: 128, align: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !410, file: !69, line: 508, baseType: !70, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !410, file: !69, line: 509, baseType: !70, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !146, file: !150, line: 41, baseType: !373, size: 64, align: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !146, file: !150, line: 42, baseType: !85, size: 32, align: 32, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !146, file: !150, line: 44, baseType: !121, size: 64, align: 64, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !146, file: !150, line: 45, baseType: !121, size: 64, align: 64, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !146, file: !150, line: 53, baseType: !419, size: 64, align: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !144, !75, !85}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !146, file: !150, line: 55, baseType: !423, size: 64, align: 64, offset: 1664)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!85, !144, !74}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !146, file: !150, line: 57, baseType: !427, size: 64, align: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!85, !144, !75}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !146, file: !150, line: 60, baseType: !431, size: 64, align: 64, offset: 1792)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!75, !144}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !146, file: !150, line: 62, baseType: !435, size: 64, align: 64, offset: 1856)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !144, !75, !75, !85}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !146, file: !150, line: 65, baseType: !439, size: 64, align: 64, offset: 1920)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !144, !75, !75}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !146, file: !150, line: 69, baseType: !444, size: 64, align: 64, offset: 1984)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !144, !75}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !112, line: 109, baseType: !449)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !112, line: 109, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !146, file: !150, line: 70, baseType: !451, size: 64, align: 64, offset: 2048)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !144, !75}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !112, line: 110, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !112, line: 110, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !146, file: !150, line: 71, baseType: !458, size: 64, align: 64, offset: 2112)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!85, !75, !75}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !146, file: !150, line: 73, baseType: !458, size: 64, align: 64, offset: 2176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !131, file: !135, line: 9, baseType: !84, size: 64, align: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !135, line: 10, baseType: !84, size: 64, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !131, file: !135, line: 11, baseType: !373, size: 64, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !131, file: !135, line: 12, baseType: !85, size: 32, align: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !131, file: !135, line: 13, baseType: !84, size: 64, align: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !131, file: !135, line: 15, baseType: !468, size: 64, align: 64, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !129}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !131, file: !135, line: 17, baseType: !472, size: 64, align: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!75, !129}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !113, file: !114, line: 36, baseType: !144, size: 64, align: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !113, file: !114, line: 37, baseType: !144, size: 64, align: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !113, file: !114, line: 38, baseType: !84, size: 64, align: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !113, file: !114, line: 40, baseType: !85, size: 32, align: 32, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !113, file: !114, line: 41, baseType: !121, size: 64, align: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !113, file: !114, line: 43, baseType: !87, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !113, file: !114, line: 44, baseType: !87, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !113, file: !114, line: 45, baseType: !87, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !113, file: !114, line: 48, baseType: !484, size: 64, align: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !486, line: 14, baseType: !487)
!486 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 6, size: 256, align: 64, elements: !488)
!488 = !{!489, !490, !499, !500, !501}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !486, line: 7, baseType: !84, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !487, file: !486, line: 9, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !493, line: 37, baseType: !494)
!493 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !493, line: 39, size: 192, align: 64, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !494, file: !493, line: 41, baseType: !68, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !493, line: 42, baseType: !491, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !494, file: !493, line: 43, baseType: !491, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !487, file: !486, line: 10, baseType: !85, size: 32, align: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !487, file: !486, line: 12, baseType: !85, size: 32, align: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !487, file: !486, line: 13, baseType: !85, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !113, file: !114, line: 49, baseType: !84, size: 64, align: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !113, file: !114, line: 51, baseType: !85, size: 32, align: 32, offset: 832)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !113, file: !114, line: 52, baseType: !84, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !113, file: !114, line: 54, baseType: !373, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !113, file: !114, line: 55, baseType: !373, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !113, file: !114, line: 57, baseType: !84, size: 64, align: 64, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !113, file: !114, line: 58, baseType: !67, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !113, file: !114, line: 60, baseType: !67, size: 64, align: 64, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !107, file: !106, line: 52, baseType: !144, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !107, file: !106, line: 53, baseType: !75, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !107, file: !106, line: 54, baseType: !75, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !107, file: !106, line: 55, baseType: !75, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !107, file: !106, line: 56, baseType: !75, size: 64, align: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !107, file: !106, line: 57, baseType: !85, size: 32, align: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_priority", scope: !107, file: !106, line: 59, baseType: !85, size: 32, align: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !107, file: !106, line: 60, baseType: !84, size: 64, align: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !106, line: 61, baseType: !85, size: 32, align: 32, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !520, file: !1, baseType: !87, size: 32, align: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !520, file: !1, baseType: !87, size: 32, align: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !520, file: !1, baseType: !67, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !520, file: !1, baseType: !67, size: 64, align: 64, offset: 128)
!526 = !{}
!527 = !DILocalVariable(name: "module", arg: 1, scope: !101, file: !90, line: 46, type: !75)
!528 = !DIExpression()
!529 = !DILocation(line: 46, column: 47, scope: !101)
!530 = !DILocalVariable(name: "dest", arg: 2, scope: !101, file: !90, line: 46, type: !104)
!531 = !DILocation(line: 46, column: 70, scope: !101)
!532 = !DILocalVariable(name: "formatnum", arg: 3, scope: !101, file: !90, line: 47, type: !85)
!533 = !DILocation(line: 47, column: 11, scope: !101)
!534 = !DILocalVariable(name: "va", arg: 4, scope: !101, file: !90, line: 47, type: !519)
!535 = !DILocation(line: 47, column: 30, scope: !101)
!536 = !DILocalVariable(name: "arglist", scope: !101, file: !90, line: 49, type: !537)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 640, align: 64, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 10)
!540 = !DILocation(line: 49, column: 8, scope: !101)
!541 = !DILocalVariable(name: "buffer", scope: !101, file: !90, line: 50, type: !542)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1600, align: 8, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 200)
!545 = !DILocation(line: 50, column: 7, scope: !101)
!546 = !DILocalVariable(name: "formats", scope: !101, file: !90, line: 51, type: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "FORMAT_REC", file: !549, line: 35, baseType: !550)
!549 = !DIFile(filename: "themes.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FORMAT_REC", file: !106, line: 30, size: 512, align: 64, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !550, file: !106, line: 31, baseType: !84, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !550, file: !106, line: 32, baseType: !84, size: 64, align: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !550, file: !106, line: 34, baseType: !85, size: 32, align: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "paramtypes", scope: !550, file: !106, line: 35, baseType: !556, size: 320, align: 32, offset: 160)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 320, align: 32, elements: !538)
!557 = !DILocation(line: 51, column: 14, scope: !101)
!558 = !DILocation(line: 53, column: 32, scope: !101)
!559 = !DILocation(line: 53, column: 49, scope: !101)
!560 = !DILocation(line: 53, column: 12, scope: !101)
!561 = !DILocation(line: 53, column: 10, scope: !101)
!562 = !DILocation(line: 54, column: 22, scope: !101)
!563 = !DILocation(line: 54, column: 35, scope: !101)
!564 = !DILocation(line: 54, column: 27, scope: !101)
!565 = !DILocation(line: 55, column: 8, scope: !101)
!566 = !DILocation(line: 56, column: 8, scope: !101)
!567 = !DILocation(line: 54, column: 2, scope: !101)
!568 = !DILocation(line: 58, column: 35, scope: !101)
!569 = !DILocation(line: 58, column: 43, scope: !101)
!570 = !DILocation(line: 58, column: 49, scope: !101)
!571 = !DILocation(line: 58, column: 60, scope: !101)
!572 = !DILocation(line: 58, column: 2, scope: !101)
!573 = !DILocation(line: 59, column: 1, scope: !101)
!574 = distinct !DISubprogram(name: "printformat_module_dest_charargs", scope: !90, file: !90, line: 61, type: !575, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !526)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !75, !104, !85, !442}
!577 = !DILocalVariable(name: "module", arg: 1, scope: !574, file: !90, line: 61, type: !75)
!578 = !DILocation(line: 61, column: 51, scope: !574)
!579 = !DILocalVariable(name: "dest", arg: 2, scope: !574, file: !90, line: 61, type: !104)
!580 = !DILocation(line: 61, column: 74, scope: !574)
!581 = !DILocalVariable(name: "formatnum", arg: 3, scope: !574, file: !90, line: 62, type: !85)
!582 = !DILocation(line: 62, column: 15, scope: !574)
!583 = !DILocalVariable(name: "arglist", arg: 4, scope: !574, file: !90, line: 62, type: !442)
!584 = !DILocation(line: 62, column: 33, scope: !574)
!585 = !DILocalVariable(name: "theme", scope: !574, file: !90, line: 64, type: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "THEME_REC", file: !549, line: 33, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 13, size: 8768, align: 64, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !601, !602, !603}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !588, file: !549, line: 14, baseType: !85, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !588, file: !549, line: 16, baseType: !84, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !588, file: !549, line: 17, baseType: !84, size: 64, align: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "last_modify", scope: !588, file: !549, line: 18, baseType: !373, size: 64, align: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "default_color", scope: !588, file: !549, line: 20, baseType: !85, size: 32, align: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "info_eol", scope: !588, file: !549, line: 23, baseType: !87, size: 1, align: 32, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !588, file: !549, line: 26, baseType: !138, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "replace_keys", scope: !588, file: !549, line: 28, baseType: !598, size: 8192, align: 32, offset: 384)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, align: 32, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "replace_values", scope: !588, file: !549, line: 29, baseType: !121, size: 64, align: 64, offset: 8576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "abstracts", scope: !588, file: !549, line: 30, baseType: !138, size: 64, align: 64, offset: 8640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !588, file: !549, line: 32, baseType: !67, size: 64, align: 64, offset: 8704)
!604 = !DILocation(line: 64, column: 13, scope: !574)
!605 = !DILocalVariable(name: "str", scope: !574, file: !90, line: 65, type: !84)
!606 = !DILocation(line: 65, column: 8, scope: !574)
!607 = !DILocation(line: 67, column: 11, scope: !574)
!608 = !DILocation(line: 67, column: 17, scope: !574)
!609 = !DILocation(line: 67, column: 24, scope: !574)
!610 = !DILocation(line: 67, column: 9, scope: !574)
!611 = !DILocation(line: 67, column: 13, scope: !612)
!612 = !DILexicalBlockFile(scope: !574, file: !90, discriminator: 1)
!613 = !DILocation(line: 67, column: 19, scope: !612)
!614 = !DILocation(line: 67, column: 28, scope: !612)
!615 = !DILocation(line: 67, column: 34, scope: !612)
!616 = !DILocation(line: 67, column: 11, scope: !612)
!617 = !DILocation(line: 67, column: 12, scope: !618)
!618 = !DILexicalBlockFile(scope: !574, file: !90, discriminator: 2)
!619 = !DILocation(line: 67, column: 18, scope: !618)
!620 = !DILocation(line: 67, column: 27, scope: !618)
!621 = !DILocation(line: 67, column: 11, scope: !618)
!622 = !DILocation(line: 67, column: 35, scope: !623)
!623 = !DILexicalBlockFile(scope: !574, file: !90, discriminator: 3)
!624 = !DILocation(line: 67, column: 11, scope: !623)
!625 = !DILocation(line: 67, column: 11, scope: !626)
!626 = !DILexicalBlockFile(scope: !574, file: !90, discriminator: 4)
!627 = !DILocation(line: 67, column: 10, scope: !626)
!628 = !DILocation(line: 67, column: 8, scope: !626)
!629 = !DILocation(line: 69, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !574, file: !90, line: 69, column: 6)
!631 = !DILocation(line: 69, column: 6, scope: !574)
!632 = !DILocation(line: 70, column: 26, scope: !633)
!633 = distinct !DILexicalBlock(scope: !630, file: !90, line: 69, column: 31)
!634 = !DILocation(line: 71, column: 18, scope: !633)
!635 = !DILocation(line: 71, column: 44, scope: !633)
!636 = !DILocation(line: 71, column: 3, scope: !633)
!637 = !DILocation(line: 72, column: 40, scope: !633)
!638 = !DILocation(line: 73, column: 2, scope: !633)
!639 = !DILocation(line: 75, column: 17, scope: !574)
!640 = !DILocation(line: 75, column: 41, scope: !574)
!641 = !DILocation(line: 75, column: 48, scope: !574)
!642 = !DILocation(line: 76, column: 10, scope: !574)
!643 = !DILocation(line: 76, column: 37, scope: !574)
!644 = !DILocation(line: 76, column: 28, scope: !574)
!645 = !DILocation(line: 76, column: 17, scope: !574)
!646 = !DILocation(line: 76, column: 50, scope: !574)
!647 = !DILocation(line: 75, column: 2, scope: !574)
!648 = !DILocation(line: 78, column: 39, scope: !574)
!649 = !DILocation(line: 78, column: 46, scope: !574)
!650 = !DILocation(line: 78, column: 54, scope: !574)
!651 = !DILocation(line: 79, column: 11, scope: !574)
!652 = !DILocation(line: 79, column: 22, scope: !574)
!653 = !DILocation(line: 78, column: 8, scope: !574)
!654 = !DILocation(line: 78, column: 6, scope: !574)
!655 = !DILocation(line: 80, column: 6, scope: !656)
!656 = distinct !DILexicalBlock(scope: !574, file: !90, line: 80, column: 6)
!657 = !DILocation(line: 80, column: 10, scope: !656)
!658 = !DILocation(line: 80, column: 17, scope: !656)
!659 = !DILocation(line: 80, column: 21, scope: !660)
!660 = !DILexicalBlockFile(scope: !656, file: !90, discriminator: 1)
!661 = !DILocation(line: 80, column: 20, scope: !660)
!662 = !DILocation(line: 80, column: 25, scope: !660)
!663 = !DILocation(line: 80, column: 6, scope: !660)
!664 = !DILocation(line: 80, column: 45, scope: !665)
!665 = !DILexicalBlockFile(scope: !656, file: !90, discriminator: 2)
!666 = !DILocation(line: 80, column: 51, scope: !665)
!667 = !DILocation(line: 80, column: 34, scope: !665)
!668 = !DILocation(line: 81, column: 9, scope: !574)
!669 = !DILocation(line: 81, column: 2, scope: !574)
!670 = !DILocation(line: 82, column: 1, scope: !574)
