; ModuleID = './line61-network-openssl.o.i'
source_filename = "./line61-network-openssl.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.x509_store_st = type { i32, %struct.stack_st_X509_OBJECT*, %struct.stack_st_X509_LOOKUP*, %struct.X509_VERIFY_PARAM_st*, i32 (%struct.x509_store_ctx_st*)*, i32 (i32, %struct.x509_store_ctx_st*)*, i32 (%struct.x509_st**, %struct.x509_store_ctx_st*, %struct.x509_st*)*, i32 (%struct.x509_store_ctx_st*, %struct.x509_st*, %struct.x509_st*)*, i32 (%struct.x509_store_ctx_st*)*, i32 (%struct.x509_store_ctx_st*, %struct.X509_crl_st**, %struct.x509_st*)*, i32 (%struct.x509_store_ctx_st*, %struct.X509_crl_st*)*, i32 (%struct.x509_store_ctx_st*, %struct.X509_crl_st*, %struct.x509_st*)*, %struct.stack_st_X509* (%struct.x509_store_ctx_st*, %struct.X509_name_st*)*, %struct.stack_st_X509_CRL* (%struct.x509_store_ctx_st*, %struct.X509_name_st*)*, i32 (%struct.x509_store_ctx_st*)*, %struct.crypto_ex_data_st, i32 }
%struct.stack_st_X509_OBJECT = type { %struct.stack_st }
%struct.stack_st = type { i32, i8**, i32, i32, i32 (i8*, i8*)* }
%struct.stack_st_X509_LOOKUP = type { %struct.stack_st }
%struct.X509_VERIFY_PARAM_st = type { i8*, i64, i64, i64, i32, i32, i32, %struct.stack_st_ASN1_OBJECT*, %struct.X509_VERIFY_PARAM_ID_st* }
%struct.stack_st_ASN1_OBJECT = type { %struct.stack_st }
%struct.X509_VERIFY_PARAM_ID_st = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !58, globals: !2172)
!1 = !DIFile(filename: "line61-network-openssl.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !15, !22, !27, !36, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!7 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!8 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!9 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!10 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!11 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!12 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!13 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!14 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 69, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!19 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!20 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!21 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 77, size: 32, align: 32, elements: !23)
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!25 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!26 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 31, size: 32, align: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "G_IO_IN", value: 1)
!31 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!32 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!33 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!34 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!35 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 84, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!39 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!40 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!41 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!42 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!43 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!44 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!45 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!46 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 54, size: 32, align: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57}
!49 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_FBIG", value: 0)
!50 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_INVAL", value: 1)
!51 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_IO", value: 2)
!52 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_ISDIR", value: 3)
!53 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_NOSPC", value: 4)
!54 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_NXIO", value: 5)
!55 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_OVERFLOW", value: 6)
!56 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_PIPE", value: 7)
!57 = !DIEnumerator(name: "G_IO_CHANNEL_ERROR_FAILED", value: 8)
!58 = !{!59, !60, !64, !66, !307, !203, !88, !2133, !401, !2134, !2169}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOSSLChannel", file: !68, line: 76, baseType: !69)
!68 = !DIFile(filename: "network-openssl.c", directory: "/home/lichi/Desktop/irssi/task1")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 66, size: 1344, align: 64, elements: !70)
!70 = !{!71, !255, !256, !257, !1951, !1952, !1953, !2132}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !69, file: !68, line: 68, baseType: !72, size: 896, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !16, line: 41, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !16, line: 97, size: 896, align: 64, elements: !74)
!74 = !{!75, !78, !222, !223, !228, !229, !230, !231, !232, !241, !242, !243, !247, !248, !249, !250, !251, !252, !253, !254}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !73, file: !16, line: 100, baseType: !76, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !62, line: 49, baseType: !77)
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !73, file: !16, line: 101, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !16, line: 42, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !16, line: 131, size: 512, align: 64, elements: !82)
!82 = !{!83, !106, !112, !119, !123, !209, !213, !218}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !81, file: !16, line: 133, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !88, !60, !89, !92, !93}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !16, line: 75, baseType: !15)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !90, line: 66, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !96, line: 42, baseType: !97)
!96 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !96, line: 44, size: 128, align: 64, elements: !98)
!98 = !{!99, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !97, file: !96, line: 46, baseType: !100, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !101, line: 36, baseType: !102)
!101 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !90, line: 45, baseType: !103)
!103 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !97, file: !96, line: 47, baseType: !76, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !97, file: !96, line: 48, baseType: !60, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !81, file: !16, line: 138, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!87, !88, !110, !89, !92, !93}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !81, file: !16, line: 143, baseType: !113, size: 64, align: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!87, !88, !116, !118, !93}
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !90, line: 51, baseType: !117)
!117 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !16, line: 82, baseType: !22)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !81, file: !16, line: 147, baseType: !120, size: 64, align: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!87, !88, !93}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !81, file: !16, line: 149, baseType: !124, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !88, !208}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !28, line: 64, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !28, line: 171, size: 768, align: 64, elements: !130)
!130 = !{!131, !133, !154, !183, !185, !189, !190, !191, !192, !200, !201, !202, !204}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !129, file: !28, line: 174, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !62, line: 77, baseType: !59)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !129, file: !28, line: 175, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !28, line: 77, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !28, line: 196, size: 192, align: 64, elements: !137)
!137 = !{!138, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !136, file: !28, line: 198, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !132}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !136, file: !28, line: 199, baseType: !139, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !136, file: !28, line: 200, baseType: !144, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !132, !127, !147, !153}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !28, line: 155, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !132}
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !62, line: 50, baseType: !76)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !129, file: !28, line: 177, baseType: !155, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !28, line: 130, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !28, line: 214, size: 384, align: 64, elements: !159)
!159 = !{!160, !165, !169, !173, !177, !178}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !158, file: !28, line: 216, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!152, !127, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !158, file: !28, line: 218, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!152, !127}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !158, file: !28, line: 219, baseType: !170, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!152, !127, !148, !132}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !158, file: !28, line: 222, baseType: !174, size: 64, align: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !127}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !158, file: !28, line: 226, baseType: !148, size: 64, align: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !158, file: !28, line: 227, baseType: !179, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !28, line: 212, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !129, file: !28, line: 178, baseType: !184, size: 32, align: 32, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !62, line: 55, baseType: !103)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !129, file: !28, line: 180, baseType: !186, size: 64, align: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !28, line: 48, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !28, line: 48, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !129, file: !28, line: 182, baseType: !76, size: 32, align: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !28, line: 183, baseType: !184, size: 32, align: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !129, file: !28, line: 184, baseType: !184, size: 32, align: 32, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !129, file: !28, line: 186, baseType: !193, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !195, line: 37, baseType: !196)
!195 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !195, line: 39, size: 128, align: 64, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !195, line: 41, baseType: !132, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !195, line: 42, baseType: !193, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !28, line: 188, baseType: !127, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !28, line: 189, baseType: !127, size: 64, align: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !28, line: 191, baseType: !203, size: 64, align: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !129, file: !28, line: 193, baseType: !205, size: 64, align: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !28, line: 65, baseType: !207)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !28, line: 65, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !28, line: 39, baseType: !27)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !81, file: !16, line: 151, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !88}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !81, file: !16, line: 152, baseType: !214, size: 64, align: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!87, !88, !217, !93}
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !16, line: 95, baseType: !36)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !81, file: !16, line: 155, baseType: !219, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!217, !88}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !73, file: !16, line: 103, baseType: !60, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !73, file: !16, line: 104, baseType: !224, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !225, line: 77, baseType: !226)
!225 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !225, line: 77, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !73, file: !16, line: 105, baseType: !224, size: 64, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !73, file: !16, line: 106, baseType: !60, size: 64, align: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !73, file: !16, line: 107, baseType: !184, size: 32, align: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !73, file: !16, line: 109, baseType: !89, size: 64, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !73, file: !16, line: 110, baseType: !233, size: 64, align: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !235, line: 39, baseType: !236)
!235 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !235, line: 41, size: 192, align: 64, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !236, file: !235, line: 43, baseType: !60, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !235, line: 44, baseType: !89, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !236, file: !235, line: 45, baseType: !89, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !73, file: !16, line: 111, baseType: !233, size: 64, align: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !73, file: !16, line: 112, baseType: !233, size: 64, align: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !73, file: !16, line: 113, baseType: !244, size: 48, align: 8, offset: 704)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 48, align: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 6)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !73, file: !16, line: 117, baseType: !184, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !73, file: !16, line: 118, baseType: !184, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !73, file: !16, line: 119, baseType: !184, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !73, file: !16, line: 120, baseType: !184, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !73, file: !16, line: 121, baseType: !184, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !73, file: !16, line: 122, baseType: !184, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !73, file: !16, line: 124, baseType: !132, size: 64, align: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !73, file: !16, line: 125, baseType: !132, size: 64, align: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !69, file: !68, line: 69, baseType: !76, size: 32, align: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "giochan", scope: !69, file: !68, line: 70, baseType: !88, size: 64, align: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !69, file: !68, line: 71, baseType: !258, size: 64, align: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !260, line: 178, baseType: !261)
!260 = !DIFile(filename: "/usr/include/openssl/ossl_typ.h", directory: "/home/lichi/Desktop/irssi/task1")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !262, line: 1422, size: 6592, align: 64, elements: !263)
!262 = !DIFile(filename: "/usr/include/openssl/ssl.h", directory: "/home/lichi/Desktop/irssi/task1")
!263 = !{!264, !265, !266, !1480, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1610, !1765, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1891, !1892, !1893, !1894, !1895, !1896, !1899, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1919, !1924, !1925, !1932, !1933, !1934, !1935, !1936, !1937, !1944, !1945, !1946, !1947, !1948, !1949, !1950}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !261, file: !262, line: 1427, baseType: !77, size: 32, align: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !262, line: 1429, baseType: !77, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !261, file: !262, line: 1431, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_METHOD", file: !262, line: 374, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_method_st", file: !262, line: 438, size: 1856, align: 64, elements: !271)
!271 = !{!272, !273, !277, !281, !282, !283, !284, !288, !289, !295, !296, !297, !298, !303, !309, !313, !314, !318, !1438, !1442, !1446, !1450, !1454, !1458, !1464, !1468, !1471, !1472, !1476}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !270, file: !262, line: 439, baseType: !77, size: 32, align: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_new", scope: !270, file: !262, line: 440, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!77, !258}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_clear", scope: !270, file: !262, line: 441, baseType: !278, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !258}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_free", scope: !270, file: !262, line: 442, baseType: !278, size: 64, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_accept", scope: !270, file: !262, line: 443, baseType: !274, size: 64, align: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_connect", scope: !270, file: !262, line: 444, baseType: !274, size: 64, align: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read", scope: !270, file: !262, line: 445, baseType: !285, size: 64, align: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!77, !258, !59, !77}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_peek", scope: !270, file: !262, line: 446, baseType: !285, size: 64, align: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write", scope: !270, file: !262, line: 447, baseType: !290, size: 64, align: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!77, !258, !293, !77}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_shutdown", scope: !270, file: !262, line: 448, baseType: !274, size: 64, align: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate", scope: !270, file: !262, line: 449, baseType: !274, size: 64, align: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_renegotiate_check", scope: !270, file: !262, line: 450, baseType: !274, size: 64, align: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_get_message", scope: !270, file: !262, line: 451, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!117, !258, !77, !77, !77, !117, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_read_bytes", scope: !270, file: !262, line: 453, baseType: !304, size: 64, align: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!77, !258, !77, !307, !77, !77}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_write_bytes", scope: !270, file: !262, line: 455, baseType: !310, size: 64, align: 64, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!77, !258, !77, !293, !77}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_dispatch_alert", scope: !270, file: !262, line: 456, baseType: !274, size: 64, align: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctrl", scope: !270, file: !262, line: 457, baseType: !315, size: 64, align: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!117, !258, !77, !117, !59}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ssl_ctx_ctrl", scope: !270, file: !262, line: 458, baseType: !319, size: 64, align: 64, offset: 1088)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!117, !322, !77, !117, !59}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL_CTX", file: !260, line: 179, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_ctx_st", file: !262, line: 925, size: 6400, align: 64, elements: !325)
!325 = !{!326, !327, !345, !346, !1046, !1051, !1052, !1118, !1119, !1120, !1121, !1128, !1133, !1137, !1151, !1152, !1156, !1157, !1163, !1164, !1169, !1173, !1177, !1178, !1238, !1239, !1240, !1241, !1246, !1252, !1257, !1258, !1259, !1260, !1263, !1264, !1268, !1269, !1270, !1271, !1272, !1273, !1278, !1279, !1280, !1281, !1282, !1286, !1287, !1291, !1292, !1293, !1363, !1367, !1368, !1372, !1373, !1374, !1378, !1382, !1383, !1386, !1387, !1410, !1415, !1416, !1421, !1422, !1427, !1431, !1432, !1433, !1434, !1435, !1436, !1437}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !324, file: !262, line: 926, baseType: !267, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list", scope: !324, file: !262, line: 927, baseType: !328, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_SSL_CIPHER", file: !262, line: 380, size: 256, align: 64, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !329, file: !262, line: 380, baseType: !332, size: 256, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "_STACK", file: !333, line: 72, baseType: !334)
!333 = !DIFile(filename: "/usr/include/openssl/stack.h", directory: "/home/lichi/Desktop/irssi/task1")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st", file: !333, line: 66, size: 256, align: 64, elements: !335)
!335 = !{!336, !337, !339, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !334, file: !333, line: 67, baseType: !77, size: 32, align: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !333, line: 68, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sorted", scope: !334, file: !333, line: 69, baseType: !77, size: 32, align: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "num_alloc", scope: !334, file: !333, line: 70, baseType: !77, size: 32, align: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !334, file: !333, line: 71, baseType: !342, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!77, !293, !293}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_list_by_id", scope: !324, file: !262, line: 929, baseType: !328, size: 64, align: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cert_store", scope: !324, file: !262, line: 930, baseType: !347, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_st", file: !349, line: 186, size: 1152, align: 64, elements: !350)
!349 = !DIFile(filename: "/usr/include/openssl/x509_vfy.h", directory: "/home/lichi/Desktop/irssi/task1")
!350 = !{!351, !352, !357, !362, !388, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !348, file: !349, line: 188, baseType: !77, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "objs", scope: !348, file: !349, line: 189, baseType: !353, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_OBJECT", file: !349, line: 137, size: 256, align: 64, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !354, file: !349, line: 137, baseType: !332, size: 256, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "get_cert_methods", scope: !348, file: !349, line: 191, baseType: !358, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_LOOKUP", file: !349, line: 136, size: 256, align: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !359, file: !349, line: 136, baseType: !332, size: 256, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !348, file: !349, line: 192, baseType: !363, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM", file: !349, line: 177, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_st", file: !349, line: 167, size: 512, align: 64, elements: !366)
!366 = !{!367, !368, !373, !374, !375, !376, !377, !378, !384}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !349, line: 168, baseType: !203, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "check_time", scope: !365, file: !349, line: 169, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !370, line: 75, baseType: !371)
!370 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !372, line: 139, baseType: !117)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "inh_flags", scope: !365, file: !349, line: 170, baseType: !91, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !365, file: !349, line: 171, baseType: !91, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !365, file: !349, line: 172, baseType: !77, size: 32, align: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !365, file: !349, line: 173, baseType: !77, size: 32, align: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !365, file: !349, line: 174, baseType: !77, size: 32, align: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "policies", scope: !365, file: !349, line: 175, baseType: !379, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_ASN1_OBJECT", file: !381, line: 801, size: 256, align: 64, elements: !382)
!381 = !DIFile(filename: "/usr/include/openssl/asn1.h", directory: "/home/lichi/Desktop/irssi/task1")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !380, file: !381, line: 801, baseType: !332, size: 256, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !349, line: 176, baseType: !385, size: 64, align: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VERIFY_PARAM_ID", file: !349, line: 159, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_VERIFY_PARAM_ID_st", file: !349, line: 159, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !348, file: !349, line: 195, baseType: !389, size: 64, align: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!77, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE_CTX", file: !260, line: 162, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_store_ctx_st", file: !349, line: 236, size: 1984, align: 64, elements: !395)
!395 = !{!396, !399, !400, !905, !910, !915, !916, !917, !918, !922, !927, !931, !932, !999, !1003, !1007, !1008, !1012, !1016, !1017, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !394, file: !349, line: 237, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_STORE", file: !260, line: 161, baseType: !348)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "current_method", scope: !394, file: !349, line: 239, baseType: !77, size: 32, align: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cert", scope: !394, file: !349, line: 242, baseType: !401, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509", file: !260, line: 154, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_st", file: !404, line: 270, size: 1472, align: 64, elements: !405)
!404 = !DIFile(filename: "/usr/include/openssl/x509.h", directory: "/home/lichi/Desktop/irssi/task1")
!405 = !{!406, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !865, !869, !874, !876, !887, !891}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "cert_info", scope: !403, file: !404, line: 271, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CINF", file: !404, line: 254, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cinf_st", file: !404, line: 242, size: 832, align: 64, elements: !410)
!410 = !{!411, !420, !421, !501, !525, !534, !535, !824, !825, !826, !831}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !409, file: !404, line: 243, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_INTEGER", file: !260, line: 83, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_string_st", file: !381, line: 247, size: 192, align: 64, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !414, file: !381, line: 248, baseType: !77, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !381, line: 249, baseType: !77, size: 32, align: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !381, line: 250, baseType: !307, size: 64, align: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !381, line: 256, baseType: !117, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "serialNumber", scope: !409, file: !404, line: 244, baseType: !412, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !409, file: !404, line: 245, baseType: !422, size: 64, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_ALGOR", file: !260, line: 155, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_algor_st", file: !404, line: 143, size: 128, align: 64, elements: !425)
!425 = !{!426, !439}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm", scope: !424, file: !404, line: 144, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OBJECT", file: !260, line: 103, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_object_st", file: !381, line: 218, size: 320, align: 64, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !438}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sn", scope: !429, file: !381, line: 219, baseType: !64, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !429, file: !381, line: 219, baseType: !64, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nid", scope: !429, file: !381, line: 220, baseType: !77, size: 32, align: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !429, file: !381, line: 221, baseType: !77, size: 32, align: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !381, line: 222, baseType: !436, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !429, file: !381, line: 223, baseType: !77, size: 32, align: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !424, file: !404, line: 145, baseType: !440, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TYPE", file: !381, line: 561, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "asn1_type_st", file: !381, line: 532, size: 128, align: 64, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !442, file: !381, line: 533, baseType: !77, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !442, file: !381, line: 560, baseType: !446, size: 64, align: 64, offset: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !442, file: !381, line: 534, size: 64, align: 64, elements: !447)
!447 = !{!448, !449, !451, !454, !455, !456, !459, !462, !465, !468, !471, !474, !477, !480, !483, !486, !489, !492, !495, !496, !497}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !446, file: !381, line: 535, baseType: !203, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "boolean", scope: !446, file: !381, line: 536, baseType: !450, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BOOLEAN", file: !260, line: 99, baseType: !77)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_string", scope: !446, file: !381, line: 537, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_STRING", file: !260, line: 98, baseType: !414)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !446, file: !381, line: 538, baseType: !427, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !446, file: !381, line: 539, baseType: !412, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "enumerated", scope: !446, file: !381, line: 540, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENUMERATED", file: !260, line: 84, baseType: !414)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bit_string", scope: !446, file: !381, line: 541, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BIT_STRING", file: !260, line: 85, baseType: !414)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "octet_string", scope: !446, file: !381, line: 542, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_OCTET_STRING", file: !260, line: 86, baseType: !414)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "printablestring", scope: !446, file: !381, line: 543, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_PRINTABLESTRING", file: !260, line: 87, baseType: !414)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "t61string", scope: !446, file: !381, line: 544, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_T61STRING", file: !260, line: 88, baseType: !414)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ia5string", scope: !446, file: !381, line: 545, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_IA5STRING", file: !260, line: 89, baseType: !414)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "generalstring", scope: !446, file: !381, line: 546, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALSTRING", file: !260, line: 90, baseType: !414)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bmpstring", scope: !446, file: !381, line: 547, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_BMPSTRING", file: !260, line: 92, baseType: !414)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "universalstring", scope: !446, file: !381, line: 548, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UNIVERSALSTRING", file: !260, line: 91, baseType: !414)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "utctime", scope: !446, file: !381, line: 549, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTCTIME", file: !260, line: 93, baseType: !414)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "generalizedtime", scope: !446, file: !381, line: 550, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_GENERALIZEDTIME", file: !260, line: 95, baseType: !414)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "visiblestring", scope: !446, file: !381, line: 551, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VISIBLESTRING", file: !260, line: 96, baseType: !414)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "utf8string", scope: !446, file: !381, line: 552, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_UTF8STRING", file: !260, line: 97, baseType: !414)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !446, file: !381, line: 557, baseType: !452, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !446, file: !381, line: 558, baseType: !452, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "asn1_value", scope: !446, file: !381, line: 559, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_VALUE", file: !381, line: 307, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_VALUE_st", file: !381, line: 307, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !409, file: !404, line: 246, baseType: !502, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_NAME", file: !260, line: 159, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_name_st", file: !404, line: 179, size: 320, align: 64, elements: !505)
!505 = !{!506, !511, !512, !523, !524}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !504, file: !404, line: 180, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_NAME_ENTRY", file: !404, line: 175, size: 256, align: 64, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !508, file: !404, line: 175, baseType: !332, size: 256, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !504, file: !404, line: 181, baseType: !77, size: 32, align: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !504, file: !404, line: 183, baseType: !513, size: 64, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "BUF_MEM", file: !260, line: 127, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buf_mem_st", file: !516, line: 77, size: 192, align: 64, elements: !517)
!516 = !DIFile(filename: "/usr/include/openssl/buffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!517 = !{!518, !521, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !515, file: !516, line: 78, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !520, line: 216, baseType: !91)
!520 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!521 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !516, line: 79, baseType: !203, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !515, file: !516, line: 80, baseType: !519, size: 64, align: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enc", scope: !504, file: !404, line: 188, baseType: !307, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "canon_enclen", scope: !504, file: !404, line: 189, baseType: !77, size: 32, align: 32, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "validity", scope: !409, file: !404, line: 247, baseType: !526, size: 64, align: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_VAL", file: !404, line: 155, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_val_st", file: !404, line: 152, size: 128, align: 64, elements: !529)
!529 = !{!530, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "notBefore", scope: !528, file: !404, line: 153, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_TIME", file: !260, line: 94, baseType: !414)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "notAfter", scope: !528, file: !404, line: 154, baseType: !531, size: 64, align: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !409, file: !404, line: 248, baseType: !502, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !409, file: !404, line: 249, baseType: !536, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_PUBKEY", file: !260, line: 160, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_pubkey_st", file: !404, line: 157, size: 192, align: 64, elements: !539)
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "algor", scope: !538, file: !404, line: 158, baseType: !422, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "public_key", scope: !538, file: !404, line: 159, baseType: !460, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !538, file: !404, line: 160, baseType: !543, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY", file: !260, line: 133, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_st", file: !546, line: 129, size: 448, align: 64, elements: !547)
!546 = !DIFile(filename: "/usr/include/openssl/evp.h", directory: "/home/lichi/Desktop/irssi/task1")
!547 = !{!548, !549, !550, !551, !556, !560, !818, !819}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !546, line: 130, baseType: !77, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "save_type", scope: !545, file: !546, line: 131, baseType: !77, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !545, file: !546, line: 132, baseType: !77, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ameth", scope: !545, file: !546, line: 133, baseType: !552, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_PKEY_ASN1_METHOD", file: !260, line: 135, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "evp_pkey_asn1_method_st", file: !260, line: 135, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !545, file: !546, line: 134, baseType: !557, size: 64, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENGINE", file: !260, line: 177, baseType: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "engine_st", file: !260, line: 177, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pkey", scope: !545, file: !546, line: 149, baseType: !561, size: 64, align: 64, offset: 256)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !546, line: 135, size: 64, align: 64, elements: !562)
!562 = !{!563, !564, !694, !762, !815}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !561, file: !546, line: 136, baseType: !203, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rsa", scope: !561, file: !546, line: 138, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_st", file: !567, line: 132, size: 1344, align: 64, elements: !568)
!567 = !DIFile(filename: "/usr/include/openssl/rsa.h", directory: "/home/lichi/Desktop/irssi/task1")
!568 = !{!569, !570, !571, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !683, !684, !685, !686, !687, !688, !689, !693}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !566, file: !567, line: 137, baseType: !77, size: 32, align: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !566, file: !567, line: 138, baseType: !117, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !566, file: !567, line: 139, baseType: !572, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA_METHOD", file: !260, line: 147, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rsa_meth_st", file: !567, line: 85, size: 896, align: 64, elements: !576)
!576 = !{!577, !578, !584, !585, !586, !587, !607, !624, !628, !629, !630, !631, !638, !642}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !575, file: !567, line: 86, baseType: !64, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_enc", scope: !575, file: !567, line: 87, baseType: !579, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!77, !77, !436, !307, !582, !77}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "RSA", file: !260, line: 146, baseType: !566)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_pub_dec", scope: !575, file: !567, line: 89, baseType: !579, size: 64, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_enc", scope: !575, file: !567, line: 91, baseType: !579, size: 64, align: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_priv_dec", scope: !575, file: !567, line: 93, baseType: !579, size: 64, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_mod_exp", scope: !575, file: !567, line: 96, baseType: !588, size: 64, align: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!77, !591, !602, !582, !604}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !260, line: 120, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !594, line: 313, size: 192, align: 64, elements: !595)
!594 = !DIFile(filename: "/usr/include/openssl/bn.h", directory: "/home/lichi/Desktop/irssi/task1")
!595 = !{!596, !598, !599, !600, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !593, file: !594, line: 314, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !593, file: !594, line: 316, baseType: !77, size: 32, align: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dmax", scope: !593, file: !594, line: 318, baseType: !77, size: 32, align: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "neg", scope: !593, file: !594, line: 319, baseType: !77, size: 32, align: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !593, file: !594, line: 320, baseType: !77, size: 32, align: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !260, line: 121, baseType: !606)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !260, line: 121, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !575, file: !567, line: 98, baseType: !608, size: 64, align: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!77, !591, !602, !602, !602, !604, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !260, line: 123, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !594, line: 324, size: 832, align: 64, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !623}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ri", scope: !613, file: !594, line: 325, baseType: !77, size: 32, align: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !613, file: !594, line: 326, baseType: !592, size: 192, align: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !613, file: !594, line: 327, baseType: !592, size: 192, align: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Ni", scope: !613, file: !594, line: 328, baseType: !592, size: 192, align: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "n0", scope: !613, file: !594, line: 330, baseType: !620, size: 128, align: 64, offset: 640)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, align: 64, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 2)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !613, file: !594, line: 333, baseType: !77, size: 32, align: 32, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !575, file: !567, line: 101, baseType: !625, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!77, !582}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !575, file: !567, line: 103, baseType: !625, size: 64, align: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !575, file: !567, line: 105, baseType: !77, size: 32, align: 32, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !575, file: !567, line: 107, baseType: !203, size: 64, align: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_sign", scope: !575, file: !567, line: 116, baseType: !632, size: 64, align: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!77, !77, !436, !103, !307, !635, !636}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_verify", scope: !575, file: !567, line: 120, baseType: !639, size: 64, align: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!77, !77, !436, !103, !436, !103, !636}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rsa_keygen", scope: !575, file: !567, line: 129, baseType: !643, size: 64, align: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!77, !582, !77, !591, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_GENCB", file: !260, line: 125, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bn_gencb_st", file: !594, line: 349, size: 192, align: 64, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ver", scope: !648, file: !594, line: 350, baseType: !103, size: 32, align: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !648, file: !594, line: 351, baseType: !59, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !648, file: !594, line: 357, baseType: !653, size: 64, align: 64, offset: 128)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !648, file: !594, line: 352, size: 64, align: 64, elements: !654)
!654 = !{!655, !659}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cb_1", scope: !653, file: !594, line: 354, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !77, !77, !59}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "cb_2", scope: !653, file: !594, line: 356, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!77, !77, !77, !646}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !566, file: !567, line: 141, baseType: !557, size: 64, align: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !566, file: !567, line: 142, baseType: !591, size: 64, align: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !566, file: !567, line: 143, baseType: !591, size: 64, align: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !566, file: !567, line: 144, baseType: !591, size: 64, align: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !566, file: !567, line: 145, baseType: !591, size: 64, align: 64, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !566, file: !567, line: 146, baseType: !591, size: 64, align: 64, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dmp1", scope: !566, file: !567, line: 147, baseType: !591, size: 64, align: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dmq1", scope: !566, file: !567, line: 148, baseType: !591, size: 64, align: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "iqmp", scope: !566, file: !567, line: 149, baseType: !591, size: 64, align: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !566, file: !567, line: 151, baseType: !673, size: 128, align: 64, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "CRYPTO_EX_DATA", file: !260, line: 195, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_ex_data_st", file: !675, line: 292, size: 128, align: 64, elements: !676)
!675 = !DIFile(filename: "/usr/include/openssl/crypto.h", directory: "/home/lichi/Desktop/irssi/task1")
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !674, file: !675, line: 293, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_void", file: !675, line: 297, size: 256, align: 64, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !679, file: !675, line: 297, baseType: !332, size: 256, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !674, file: !675, line: 295, baseType: !77, size: 32, align: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !566, file: !567, line: 152, baseType: !77, size: 32, align: 32, offset: 896)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !567, line: 153, baseType: !77, size: 32, align: 32, offset: 928)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_n", scope: !566, file: !567, line: 155, baseType: !611, size: 64, align: 64, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_p", scope: !566, file: !567, line: 156, baseType: !611, size: 64, align: 64, offset: 1024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_method_mod_q", scope: !566, file: !567, line: 157, baseType: !611, size: 64, align: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bignum_data", scope: !566, file: !567, line: 162, baseType: !203, size: 64, align: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "blinding", scope: !566, file: !567, line: 163, baseType: !690, size: 64, align: 64, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "BN_BLINDING", file: !260, line: 122, baseType: !692)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "bn_blinding_st", file: !260, line: 122, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mt_blinding", scope: !566, file: !567, line: 164, baseType: !690, size: 64, align: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dsa", scope: !561, file: !546, line: 141, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_st", file: !697, line: 155, size: 1088, align: 64, elements: !698)
!697 = !DIFile(filename: "/usr/include/openssl/dsa.h", directory: "/home/lichi/Desktop/irssi/task1")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !761}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !696, file: !697, line: 160, baseType: !77, size: 32, align: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !696, file: !697, line: 161, baseType: !117, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "write_params", scope: !696, file: !697, line: 162, baseType: !77, size: 32, align: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !696, file: !697, line: 163, baseType: !591, size: 64, align: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !696, file: !697, line: 164, baseType: !591, size: 64, align: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !696, file: !697, line: 165, baseType: !591, size: 64, align: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !696, file: !697, line: 166, baseType: !591, size: 64, align: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !696, file: !697, line: 167, baseType: !591, size: 64, align: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "kinv", scope: !696, file: !697, line: 168, baseType: !591, size: 64, align: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !696, file: !697, line: 169, baseType: !591, size: 64, align: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !697, line: 170, baseType: !77, size: 32, align: 32, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !696, file: !697, line: 172, baseType: !611, size: 64, align: 64, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !696, file: !697, line: 173, baseType: !77, size: 32, align: 32, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !696, file: !697, line: 174, baseType: !673, size: 128, align: 64, offset: 832)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !696, file: !697, line: 175, baseType: !714, size: 64, align: 64, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_METHOD", file: !260, line: 144, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dsa_method", file: !697, line: 129, size: 768, align: 64, elements: !718)
!718 = !{!719, !720, !732, !737, !741, !745, !749, !753, !754, !755, !756, !760}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !697, line: 130, baseType: !64, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_sign", scope: !717, file: !697, line: 131, baseType: !721, size: 64, align: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !436, !77, !730}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA_SIG", file: !697, line: 127, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DSA_SIG_st", file: !697, line: 124, size: 128, align: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !726, file: !697, line: 125, baseType: !591, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !726, file: !697, line: 126, baseType: !591, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "DSA", file: !260, line: 143, baseType: !696)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_sign_setup", scope: !717, file: !697, line: 132, baseType: !733, size: 64, align: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!77, !730, !604, !736, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_do_verify", scope: !717, file: !697, line: 134, baseType: !738, size: 64, align: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!77, !436, !77, !724, !730}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_mod_exp", scope: !717, file: !697, line: 136, baseType: !742, size: 64, align: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!77, !730, !591, !591, !591, !591, !591, !591, !604, !611}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !717, file: !697, line: 140, baseType: !746, size: 64, align: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!77, !730, !591, !591, !602, !602, !604, !611}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !717, file: !697, line: 142, baseType: !750, size: 64, align: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!77, !730}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !717, file: !697, line: 143, baseType: !750, size: 64, align: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !717, file: !697, line: 144, baseType: !77, size: 32, align: 32, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !717, file: !697, line: 145, baseType: !203, size: 64, align: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_paramgen", scope: !717, file: !697, line: 147, baseType: !757, size: 64, align: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!77, !730, !77, !436, !77, !302, !597, !646}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dsa_keygen", scope: !717, file: !697, line: 152, baseType: !750, size: 64, align: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !696, file: !697, line: 177, baseType: !557, size: 64, align: 64, offset: 1024)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dh", scope: !561, file: !546, line: 144, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_st", file: !765, line: 135, size: 1152, align: 64, elements: !766)
!765 = !DIFile(filename: "/usr/include/openssl/dh.h", directory: "/home/lichi/Desktop/irssi/task1")
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !814}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !764, file: !765, line: 140, baseType: !77, size: 32, align: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !764, file: !765, line: 141, baseType: !77, size: 32, align: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !764, file: !765, line: 142, baseType: !591, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !764, file: !765, line: 143, baseType: !591, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !764, file: !765, line: 144, baseType: !117, size: 64, align: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pub_key", scope: !764, file: !765, line: 145, baseType: !591, size: 64, align: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "priv_key", scope: !764, file: !765, line: 146, baseType: !591, size: 64, align: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !765, line: 147, baseType: !77, size: 32, align: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "method_mont_p", scope: !764, file: !765, line: 148, baseType: !611, size: 64, align: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !764, file: !765, line: 150, baseType: !591, size: 64, align: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !764, file: !765, line: 151, baseType: !591, size: 64, align: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !764, file: !765, line: 152, baseType: !307, size: 64, align: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "seedlen", scope: !764, file: !765, line: 153, baseType: !77, size: 32, align: 32, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !764, file: !765, line: 154, baseType: !591, size: 64, align: 64, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !764, file: !765, line: 155, baseType: !77, size: 32, align: 32, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !764, file: !765, line: 156, baseType: !673, size: 128, align: 64, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "meth", scope: !764, file: !765, line: 157, baseType: !784, size: 64, align: 64, offset: 1024)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH_METHOD", file: !260, line: 141, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dh_method", file: !765, line: 117, size: 576, align: 64, elements: !788)
!788 = !{!789, !790, !796, !800, !806, !807, !808, !809, !810}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !765, line: 118, baseType: !64, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "generate_key", scope: !787, file: !765, line: 120, baseType: !791, size: 64, align: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!77, !794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "DH", file: !260, line: 140, baseType: !764)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "compute_key", scope: !787, file: !765, line: 121, baseType: !797, size: 64, align: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64, align: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!77, !307, !602, !794}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bn_mod_exp", scope: !787, file: !765, line: 123, baseType: !801, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!77, !804, !591, !602, !602, !602, !604, !611}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !787, file: !765, line: 126, baseType: !791, size: 64, align: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !787, file: !765, line: 127, baseType: !791, size: 64, align: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !787, file: !765, line: 128, baseType: !77, size: 32, align: 32, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "app_data", scope: !787, file: !765, line: 129, baseType: !203, size: 64, align: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "generate_params", scope: !787, file: !765, line: 131, baseType: !811, size: 64, align: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!77, !794, !77, !77, !646}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !764, file: !765, line: 158, baseType: !557, size: 64, align: 64, offset: 1088)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !561, file: !546, line: 147, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "ec_key_st", file: !546, line: 147, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "save_parameters", scope: !545, file: !546, line: 150, baseType: !77, size: 32, align: 32, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !545, file: !546, line: 151, baseType: !820, size: 64, align: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ATTRIBUTE", file: !404, line: 223, size: 256, align: 64, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !821, file: !404, line: 223, baseType: !332, size: 256, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "issuerUID", scope: !409, file: !404, line: 250, baseType: !460, size: 64, align: 64, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "subjectUID", scope: !409, file: !404, line: 251, baseType: !460, size: 64, align: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !409, file: !404, line: 252, baseType: !827, size: 64, align: 64, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_EXTENSION", file: !404, line: 204, size: 256, align: 64, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !828, file: !404, line: 204, baseType: !332, size: 256, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !409, file: !404, line: 253, baseType: !832, size: 192, align: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ASN1_ENCODING", file: !381, line: 269, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ASN1_ENCODING_st", file: !381, line: 265, size: 192, align: 64, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !833, file: !381, line: 266, baseType: !307, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !833, file: !381, line: 267, baseType: !117, size: 64, align: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !833, file: !381, line: 268, baseType: !77, size: 32, align: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sig_alg", scope: !403, file: !404, line: 272, baseType: !422, size: 64, align: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !403, file: !404, line: 273, baseType: !460, size: 64, align: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !403, file: !404, line: 274, baseType: !77, size: 32, align: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "references", scope: !403, file: !404, line: 275, baseType: !77, size: 32, align: 32, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !404, line: 276, baseType: !203, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ex_data", scope: !403, file: !404, line: 277, baseType: !673, size: 128, align: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pathlen", scope: !403, file: !404, line: 279, baseType: !117, size: 64, align: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ex_pcpathlen", scope: !403, file: !404, line: 280, baseType: !117, size: 64, align: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ex_flags", scope: !403, file: !404, line: 281, baseType: !91, size: 64, align: 64, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ex_kusage", scope: !403, file: !404, line: 282, baseType: !91, size: 64, align: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "ex_xkusage", scope: !403, file: !404, line: 283, baseType: !91, size: 64, align: 64, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ex_nscert", scope: !403, file: !404, line: 284, baseType: !91, size: 64, align: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "skid", scope: !403, file: !404, line: 285, baseType: !463, size: 64, align: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "akid", scope: !403, file: !404, line: 286, baseType: !852, size: 64, align: 64, offset: 896)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "AUTHORITY_KEYID", file: !260, line: 186, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AUTHORITY_KEYID_st", file: !855, line: 262, size: 192, align: 64, elements: !856)
!855 = !DIFile(filename: "/usr/include/openssl/x509v3.h", directory: "/home/lichi/Desktop/irssi/task1")
!856 = !{!857, !858, !864}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !854, file: !855, line: 263, baseType: !463, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !854, file: !855, line: 264, baseType: !859, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "GENERAL_NAMES", file: !855, line: 209, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_NAME", file: !855, line: 220, size: 256, align: 64, elements: !862)
!862 = !{!863}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !861, file: !855, line: 220, baseType: !332, size: 256, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "serial", scope: !854, file: !855, line: 265, baseType: !412, size: 64, align: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "policy_cache", scope: !403, file: !404, line: 287, baseType: !866, size: 64, align: 64, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_POLICY_CACHE", file: !260, line: 184, baseType: !868)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "X509_POLICY_CACHE_st", file: !260, line: 184, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "crldp", scope: !403, file: !404, line: 288, baseType: !870, size: 64, align: 64, offset: 1024)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_DIST_POINT", file: !855, line: 259, size: 256, align: 64, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !871, file: !855, line: 259, baseType: !332, size: 256, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "altname", scope: !403, file: !404, line: 289, baseType: !875, size: 64, align: 64, offset: 1088)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !403, file: !404, line: 290, baseType: !877, size: 64, align: 64, offset: 1152)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "NAME_CONSTRAINTS", file: !260, line: 189, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NAME_CONSTRAINTS_st", file: !855, line: 332, size: 128, align: 64, elements: !880)
!880 = !{!881, !886}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "permittedSubtrees", scope: !879, file: !855, line: 333, baseType: !882, size: 64, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64, align: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_GENERAL_SUBTREE", file: !855, line: 330, size: 256, align: 64, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !883, file: !855, line: 330, baseType: !332, size: 256, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "excludedSubtrees", scope: !879, file: !855, line: 334, baseType: !882, size: 64, align: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sha1_hash", scope: !403, file: !404, line: 296, baseType: !888, size: 160, align: 8, offset: 1216)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 160, align: 8, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 20)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !403, file: !404, line: 298, baseType: !892, size: 64, align: 64, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CERT_AUX", file: !404, line: 268, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x509_cert_aux_st", file: !404, line: 262, size: 320, align: 64, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "trust", scope: !894, file: !404, line: 263, baseType: !379, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "reject", scope: !894, file: !404, line: 264, baseType: !379, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !894, file: !404, line: 265, baseType: !493, size: 64, align: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "keyid", scope: !894, file: !404, line: 266, baseType: !463, size: 64, align: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !894, file: !404, line: 267, baseType: !901, size: 64, align: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_ALGOR", file: !381, line: 170, size: 256, align: 64, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !902, file: !381, line: 170, baseType: !332, size: 256, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "untrusted", scope: !394, file: !349, line: 244, baseType: !906, size: 64, align: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509", file: !404, line: 301, size: 256, align: 64, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !907, file: !404, line: 301, baseType: !332, size: 256, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "crls", scope: !394, file: !349, line: 246, baseType: !911, size: 64, align: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_st_X509_CRL", file: !404, line: 476, size: 256, align: 64, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !912, file: !404, line: 476, baseType: !332, size: 256, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !394, file: !349, line: 247, baseType: !363, size: 64, align: 64, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "other_ctx", scope: !394, file: !349, line: 249, baseType: !59, size: 64, align: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "verify", scope: !394, file: !349, line: 252, baseType: !389, size: 64, align: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "verify_cb", scope: !394, file: !349, line: 254, baseType: !919, size: 64, align: 64, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!77, !77, !392}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "get_issuer", scope: !394, file: !349, line: 256, baseType: !923, size: 64, align: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!77, !926, !392, !401}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "check_issued", scope: !394, file: !349, line: 258, baseType: !928, size: 64, align: 64, offset: 640)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!77, !392, !401, !401}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "check_revocation", scope: !394, file: !349, line: 260, baseType: !389, size: 64, align: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "get_crl", scope: !394, file: !349, line: 262, baseType: !933, size: 64, align: 64, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!77, !392, !936, !401}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL", file: !260, line: 156, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "X509_crl_st", file: !404, line: 452, size: 960, align: 64, elements: !940)
!940 = !{!941, !958, !959, !960, !961, !962, !963, !985, !986, !987, !988, !989, !990, !993, !998}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "crl", scope: !939, file: !404, line: 454, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "X509_CRL_INFO", file: !404, line: 450, baseType: !944)
