; ModuleID = './line123-irc-chatnets.o.i'
source_filename = "./line123-irc-chatnets.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "line123-irc-chatnets.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !5, !9, !11, !33, !40}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !13, line: 106, baseType: !14)
!13 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !15, line: 13, size: 576, align: 64, elements: !16)
!15 = !DIFile(filename: "../../../src/core/chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!16 = !{!17, !20, !21, !23, !24, !25, !26, !27, !28, !32}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !14, file: !18, line: 1, baseType: !19, size: 32, align: 32)
!18 = !DIFile(filename: "../../../src/core/chatnet-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !14, file: !18, line: 2, baseType: !19, size: 32, align: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !18, line: 4, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !14, file: !18, line: 6, baseType: !22, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !14, file: !18, line: 7, baseType: !22, size: 64, align: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !14, file: !18, line: 8, baseType: !22, size: 64, align: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !14, file: !18, line: 10, baseType: !22, size: 64, align: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !14, file: !18, line: 11, baseType: !22, size: 64, align: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !14, file: !18, line: 12, baseType: !29, size: 64, align: 64, offset: 448)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !13, line: 99, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !13, line: 99, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !14, file: !18, line: 12, baseType: !29, size: 64, align: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !34, line: 9, baseType: !35)
!34 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !38, !38, !38, !38, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHATNET_REC", file: !42, line: 4, baseType: !43)
!42 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHATNET_REC", file: !44, line: 17, size: 1152, align: 64, elements: !45)
!44 = !DIFile(filename: "irc-chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !18, line: 1, baseType: !19, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !43, file: !18, line: 2, baseType: !19, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !18, line: 4, baseType: !22, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !43, file: !18, line: 6, baseType: !22, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !43, file: !18, line: 7, baseType: !22, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !43, file: !18, line: 8, baseType: !22, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !43, file: !18, line: 10, baseType: !22, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !43, file: !18, line: 11, baseType: !22, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !43, file: !18, line: 12, baseType: !29, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !43, file: !18, line: 12, baseType: !29, size: 64, align: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !43, file: !44, line: 20, baseType: !22, size: 64, align: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !43, file: !44, line: 21, baseType: !22, size: 64, align: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !43, file: !44, line: 23, baseType: !22, size: 64, align: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !43, file: !44, line: 24, baseType: !22, size: 64, align: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !43, file: !44, line: 25, baseType: !22, size: 64, align: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !43, file: !44, line: 27, baseType: !19, size: 32, align: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !43, file: !44, line: 28, baseType: !19, size: 32, align: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !43, file: !44, line: 29, baseType: !19, size: 32, align: 32, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !43, file: !44, line: 32, baseType: !19, size: 32, align: 32, offset: 992)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !43, file: !44, line: 32, baseType: !19, size: 32, align: 32, offset: 1024)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !43, file: !44, line: 32, baseType: !19, size: 32, align: 32, offset: 1056)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !43, file: !44, line: 32, baseType: !19, size: 32, align: 32, offset: 1088)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!71 = distinct !DISubprogram(name: "ircnet_create", scope: !72, file: !72, line: 28, type: !73, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!72 = !DIFile(filename: "irc-chatnets.c", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !DISubroutineType(types: !74)
!74 = !{null, !40}
!75 = !DILocalVariable(name: "rec", arg: 1, scope: !71, file: !72, line: 28, type: !40)
!76 = !DIExpression()
!77 = !DILocation(line: 28, column: 37, scope: !71)
!78 = !DILocation(line: 30, column: 2, scope: !71)
!79 = distinct !{!79, !78}
!80 = !DILocation(line: 30, column: 10, scope: !81)
!81 = !DILexicalBlockFile(scope: !82, file: !72, discriminator: 1)
!82 = distinct !DILexicalBlock(scope: !83, file: !72, line: 30, column: 10)
!83 = distinct !DILexicalBlock(scope: !71, file: !72, line: 30, column: 4)
!84 = !DILocation(line: 30, column: 14, scope: !81)
!85 = !DILocation(line: 30, column: 5, scope: !86)
!86 = !DILexicalBlockFile(scope: !87, file: !72, discriminator: 2)
!87 = distinct !DILexicalBlock(scope: !82, file: !72, line: 30, column: 3)
!88 = !DILocation(line: 30, column: 14, scope: !89)
!89 = !DILexicalBlockFile(scope: !90, file: !72, discriminator: 3)
!90 = distinct !DILexicalBlock(scope: !82, file: !72, line: 30, column: 12)
!91 = !DILocation(line: 30, column: 98, scope: !89)
!92 = !DILocation(line: 30, column: 109, scope: !93)
!93 = !DILexicalBlockFile(scope: !83, file: !72, discriminator: 4)
!94 = !DILocation(line: 32, column: 20, scope: !71)
!95 = !DILocation(line: 32, column: 2, scope: !71)
!96 = !DILocation(line: 32, column: 7, scope: !71)
!97 = !DILocation(line: 32, column: 17, scope: !71)
!98 = !DILocation(line: 33, column: 40, scope: !71)
!99 = !DILocation(line: 33, column: 24, scope: !71)
!100 = !DILocation(line: 33, column: 9, scope: !71)
!101 = !DILocation(line: 34, column: 1, scope: !71)
!102 = !DILocation(line: 34, column: 1, scope: !103)
!103 = !DILexicalBlockFile(scope: !71, file: !72, discriminator: 1)
!104 = distinct !DISubprogram(name: "irc_chatnets_init", scope: !72, file: !72, line: 110, type: !105, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!105 = !DISubroutineType(types: !106)
!106 = !{null}
!107 = !DILocation(line: 112, column: 2, scope: !104)
!108 = !DILocation(line: 113, column: 2, scope: !104)
!109 = !DILocation(line: 114, column: 2, scope: !104)
!110 = !DILocation(line: 115, column: 1, scope: !104)
!111 = distinct !DISubprogram(name: "sig_chatnet_read", scope: !72, file: !72, line: 36, type: !112, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !40, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !116, line: 17, baseType: !117)
!116 = !DIFile(filename: "../../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !116, line: 20, size: 192, align: 64, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !116, line: 21, baseType: !19, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !117, file: !116, line: 22, baseType: !22, size: 64, align: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !117, file: !116, line: 23, baseType: !4, size: 64, align: 64, offset: 128)
!122 = !DILocalVariable(name: "rec", arg: 1, scope: !111, file: !72, line: 36, type: !40)
!123 = !DILocation(line: 36, column: 47, scope: !111)
!124 = !DILocalVariable(name: "node", arg: 2, scope: !111, file: !72, line: 36, type: !114)
!125 = !DILocation(line: 36, column: 65, scope: !111)
!126 = !DILocalVariable(name: "value", scope: !111, file: !72, line: 38, type: !22)
!127 = !DILocation(line: 38, column: 8, scope: !111)
!128 = !DILocation(line: 40, column: 89, scope: !129)
!129 = distinct !DILexicalBlock(scope: !111, file: !72, line: 40, column: 6)
!130 = !DILocation(line: 40, column: 71, scope: !129)
!131 = !DILocation(line: 40, column: 55, scope: !129)
!132 = !DILocation(line: 40, column: 54, scope: !129)
!133 = !DILocation(line: 40, column: 29, scope: !134)
!134 = !DILexicalBlockFile(scope: !129, file: !72, discriminator: 3)
!135 = !DILocation(line: 40, column: 9, scope: !129)
!136 = !DILocation(line: 40, column: 6, scope: !111)
!137 = !DILocation(line: 40, column: 8, scope: !138)
!138 = !DILexicalBlockFile(scope: !129, file: !72, discriminator: 1)
!139 = !DILocation(line: 40, column: 6, scope: !140)
!140 = !DILexicalBlockFile(scope: !111, file: !72, discriminator: 2)
!141 = !DILocation(line: 41, column: 3, scope: !129)
!142 = !DILocation(line: 43, column: 30, scope: !111)
!143 = !DILocation(line: 43, column: 10, scope: !111)
!144 = !DILocation(line: 43, column: 8, scope: !111)
!145 = !DILocation(line: 44, column: 19, scope: !111)
!146 = !DILocation(line: 44, column: 25, scope: !111)
!147 = !DILocation(line: 44, column: 32, scope: !111)
!148 = !DILocation(line: 44, column: 36, scope: !149)
!149 = !DILexicalBlockFile(scope: !111, file: !72, discriminator: 1)
!150 = !DILocation(line: 44, column: 35, scope: !149)
!151 = !DILocation(line: 44, column: 42, scope: !149)
!152 = !DILocation(line: 44, column: 18, scope: !149)
!153 = !DILocation(line: 44, column: 62, scope: !140)
!154 = !DILocation(line: 44, column: 53, scope: !140)
!155 = !DILocation(line: 44, column: 18, scope: !140)
!156 = !DILocation(line: 44, column: 18, scope: !157)
!157 = !DILexicalBlockFile(scope: !111, file: !72, discriminator: 3)
!158 = !DILocation(line: 44, column: 18, scope: !159)
!159 = !DILexicalBlockFile(scope: !111, file: !72, discriminator: 4)
!160 = !DILocation(line: 44, column: 2, scope: !159)
!161 = !DILocation(line: 44, column: 7, scope: !159)
!162 = !DILocation(line: 44, column: 16, scope: !159)
!163 = !DILocation(line: 46, column: 30, scope: !111)
!164 = !DILocation(line: 46, column: 10, scope: !111)
!165 = !DILocation(line: 46, column: 8, scope: !111)
!166 = !DILocation(line: 47, column: 25, scope: !111)
!167 = !DILocation(line: 47, column: 31, scope: !111)
!168 = !DILocation(line: 47, column: 38, scope: !111)
!169 = !DILocation(line: 47, column: 42, scope: !149)
!170 = !DILocation(line: 47, column: 41, scope: !149)
!171 = !DILocation(line: 47, column: 48, scope: !149)
!172 = !DILocation(line: 47, column: 24, scope: !149)
!173 = !DILocation(line: 47, column: 68, scope: !140)
!174 = !DILocation(line: 47, column: 59, scope: !140)
!175 = !DILocation(line: 47, column: 24, scope: !140)
!176 = !DILocation(line: 47, column: 24, scope: !157)
!177 = !DILocation(line: 47, column: 24, scope: !159)
!178 = !DILocation(line: 47, column: 2, scope: !159)
!179 = !DILocation(line: 47, column: 7, scope: !159)
!180 = !DILocation(line: 47, column: 22, scope: !159)
!181 = !DILocation(line: 49, column: 46, scope: !111)
!182 = !DILocation(line: 49, column: 26, scope: !111)
!183 = !DILocation(line: 49, column: 2, scope: !111)
!184 = !DILocation(line: 49, column: 7, scope: !111)
!185 = !DILocation(line: 49, column: 24, scope: !111)
!186 = !DILocation(line: 50, column: 45, scope: !111)
!187 = !DILocation(line: 50, column: 25, scope: !111)
!188 = !DILocation(line: 50, column: 2, scope: !111)
!189 = !DILocation(line: 50, column: 7, scope: !111)
!190 = !DILocation(line: 50, column: 23, scope: !111)
!191 = !DILocation(line: 51, column: 45, scope: !111)
!192 = !DILocation(line: 51, column: 25, scope: !111)
!193 = !DILocation(line: 51, column: 2, scope: !111)
!194 = !DILocation(line: 51, column: 7, scope: !111)
!195 = !DILocation(line: 51, column: 23, scope: !111)
!196 = !DILocation(line: 53, column: 39, scope: !111)
!197 = !DILocation(line: 53, column: 19, scope: !111)
!198 = !DILocation(line: 53, column: 2, scope: !111)
!199 = !DILocation(line: 53, column: 7, scope: !111)
!200 = !DILocation(line: 53, column: 17, scope: !111)
!201 = !DILocation(line: 54, column: 38, scope: !111)
!202 = !DILocation(line: 54, column: 18, scope: !111)
!203 = !DILocation(line: 54, column: 2, scope: !111)
!204 = !DILocation(line: 54, column: 7, scope: !111)
!205 = !DILocation(line: 54, column: 16, scope: !111)
!206 = !DILocation(line: 55, column: 39, scope: !111)
!207 = !DILocation(line: 55, column: 19, scope: !111)
!208 = !DILocation(line: 55, column: 2, scope: !111)
!209 = !DILocation(line: 55, column: 7, scope: !111)
!210 = !DILocation(line: 55, column: 17, scope: !111)
!211 = !DILocation(line: 56, column: 39, scope: !111)
!212 = !DILocation(line: 56, column: 19, scope: !111)
!213 = !DILocation(line: 56, column: 2, scope: !111)
!214 = !DILocation(line: 56, column: 7, scope: !111)
!215 = !DILocation(line: 56, column: 17, scope: !111)
!216 = !DILocation(line: 58, column: 53, scope: !111)
!217 = !DILocation(line: 58, column: 33, scope: !111)
!218 = !DILocation(line: 58, column: 24, scope: !149)
!219 = !DILocation(line: 58, column: 2, scope: !111)
!220 = !DILocation(line: 58, column: 7, scope: !111)
!221 = !DILocation(line: 58, column: 22, scope: !111)
!222 = !DILocation(line: 59, column: 52, scope: !111)
!223 = !DILocation(line: 59, column: 32, scope: !111)
!224 = !DILocation(line: 59, column: 23, scope: !149)
!225 = !DILocation(line: 59, column: 2, scope: !111)
!226 = !DILocation(line: 59, column: 7, scope: !111)
!227 = !DILocation(line: 59, column: 21, scope: !111)
!228 = !DILocation(line: 60, column: 52, scope: !111)
!229 = !DILocation(line: 60, column: 32, scope: !111)
!230 = !DILocation(line: 60, column: 23, scope: !149)
!231 = !DILocation(line: 60, column: 2, scope: !111)
!232 = !DILocation(line: 60, column: 7, scope: !111)
!233 = !DILocation(line: 60, column: 21, scope: !111)
!234 = !DILocation(line: 61, column: 1, scope: !111)
!235 = !DILocation(line: 61, column: 1, scope: !149)
!236 = distinct !DISubprogram(name: "sig_chatnet_saved", scope: !72, file: !72, line: 63, type: !112, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!237 = !DILocalVariable(name: "rec", arg: 1, scope: !236, file: !72, line: 63, type: !40)
!238 = !DILocation(line: 63, column: 48, scope: !236)
!239 = !DILocalVariable(name: "node", arg: 2, scope: !236, file: !72, line: 63, type: !114)
!240 = !DILocation(line: 63, column: 66, scope: !236)
!241 = !DILocation(line: 65, column: 89, scope: !242)
!242 = distinct !DILexicalBlock(scope: !236, file: !72, line: 65, column: 6)
!243 = !DILocation(line: 65, column: 71, scope: !242)
!244 = !DILocation(line: 65, column: 55, scope: !242)
!245 = !DILocation(line: 65, column: 54, scope: !242)
!246 = !DILocation(line: 65, column: 29, scope: !247)
!247 = !DILexicalBlockFile(scope: !242, file: !72, discriminator: 3)
!248 = !DILocation(line: 65, column: 9, scope: !242)
!249 = !DILocation(line: 65, column: 6, scope: !236)
!250 = !DILocation(line: 65, column: 8, scope: !251)
!251 = !DILexicalBlockFile(scope: !242, file: !72, discriminator: 1)
!252 = !DILocation(line: 65, column: 6, scope: !253)
!253 = !DILexicalBlockFile(scope: !236, file: !72, discriminator: 2)
!254 = !DILocation(line: 66, column: 3, scope: !242)
!255 = !DILocation(line: 68, column: 6, scope: !256)
!256 = distinct !DILexicalBlock(scope: !236, file: !72, line: 68, column: 6)
!257 = !DILocation(line: 68, column: 11, scope: !256)
!258 = !DILocation(line: 68, column: 20, scope: !256)
!259 = !DILocation(line: 68, column: 6, scope: !236)
!260 = !DILocation(line: 69, column: 23, scope: !256)
!261 = !DILocation(line: 69, column: 35, scope: !256)
!262 = !DILocation(line: 69, column: 53, scope: !256)
!263 = !DILocation(line: 69, column: 58, scope: !256)
!264 = !DILocation(line: 69, column: 3, scope: !256)
!265 = !DILocation(line: 71, column: 6, scope: !266)
!266 = distinct !DILexicalBlock(scope: !236, file: !72, line: 71, column: 6)
!267 = !DILocation(line: 71, column: 11, scope: !266)
!268 = !DILocation(line: 71, column: 26, scope: !266)
!269 = !DILocation(line: 71, column: 6, scope: !236)
!270 = !DILocation(line: 72, column: 23, scope: !266)
!271 = !DILocation(line: 72, column: 35, scope: !266)
!272 = !DILocation(line: 72, column: 59, scope: !266)
!273 = !DILocation(line: 72, column: 64, scope: !266)
!274 = !DILocation(line: 72, column: 3, scope: !266)
!275 = !DILocation(line: 74, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !236, file: !72, line: 74, column: 6)
!277 = !DILocation(line: 74, column: 11, scope: !276)
!278 = !DILocation(line: 74, column: 28, scope: !276)
!279 = !DILocation(line: 74, column: 6, scope: !236)
!280 = !DILocation(line: 75, column: 23, scope: !276)
!281 = !DILocation(line: 75, column: 35, scope: !276)
!282 = !DILocation(line: 75, column: 51, scope: !276)
!283 = !DILocation(line: 75, column: 56, scope: !276)
!284 = !DILocation(line: 75, column: 3, scope: !276)
!285 = !DILocation(line: 76, column: 6, scope: !286)
!286 = distinct !DILexicalBlock(scope: !236, file: !72, line: 76, column: 6)
!287 = !DILocation(line: 76, column: 11, scope: !286)
!288 = !DILocation(line: 76, column: 27, scope: !286)
!289 = !DILocation(line: 76, column: 6, scope: !236)
!290 = !DILocation(line: 77, column: 23, scope: !286)
!291 = !DILocation(line: 77, column: 35, scope: !286)
!292 = !DILocation(line: 77, column: 53, scope: !286)
!293 = !DILocation(line: 77, column: 58, scope: !286)
!294 = !DILocation(line: 77, column: 3, scope: !286)
!295 = !DILocation(line: 78, column: 6, scope: !296)
!296 = distinct !DILexicalBlock(scope: !236, file: !72, line: 78, column: 6)
!297 = !DILocation(line: 78, column: 11, scope: !296)
!298 = !DILocation(line: 78, column: 27, scope: !296)
!299 = !DILocation(line: 78, column: 6, scope: !236)
!300 = !DILocation(line: 79, column: 23, scope: !296)
!301 = !DILocation(line: 79, column: 35, scope: !296)
!302 = !DILocation(line: 79, column: 60, scope: !296)
!303 = !DILocation(line: 79, column: 65, scope: !296)
!304 = !DILocation(line: 79, column: 3, scope: !296)
!305 = !DILocation(line: 81, column: 6, scope: !306)
!306 = distinct !DILexicalBlock(scope: !236, file: !72, line: 81, column: 6)
!307 = !DILocation(line: 81, column: 11, scope: !306)
!308 = !DILocation(line: 81, column: 21, scope: !306)
!309 = !DILocation(line: 81, column: 6, scope: !236)
!310 = !DILocation(line: 82, column: 23, scope: !306)
!311 = !DILocation(line: 82, column: 35, scope: !306)
!312 = !DILocation(line: 82, column: 54, scope: !306)
!313 = !DILocation(line: 82, column: 59, scope: !306)
!314 = !DILocation(line: 82, column: 3, scope: !306)
!315 = !DILocation(line: 83, column: 6, scope: !316)
!316 = distinct !DILexicalBlock(scope: !236, file: !72, line: 83, column: 6)
!317 = !DILocation(line: 83, column: 11, scope: !316)
!318 = !DILocation(line: 83, column: 20, scope: !316)
!319 = !DILocation(line: 83, column: 6, scope: !236)
!320 = !DILocation(line: 84, column: 23, scope: !316)
!321 = !DILocation(line: 84, column: 35, scope: !316)
!322 = !DILocation(line: 84, column: 53, scope: !316)
!323 = !DILocation(line: 84, column: 58, scope: !316)
!324 = !DILocation(line: 84, column: 3, scope: !316)
!325 = !DILocation(line: 85, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !236, file: !72, line: 85, column: 6)
!327 = !DILocation(line: 85, column: 11, scope: !326)
!328 = !DILocation(line: 85, column: 21, scope: !326)
!329 = !DILocation(line: 85, column: 6, scope: !236)
!330 = !DILocation(line: 86, column: 23, scope: !326)
!331 = !DILocation(line: 86, column: 35, scope: !326)
!332 = !DILocation(line: 86, column: 54, scope: !326)
!333 = !DILocation(line: 86, column: 59, scope: !326)
!334 = !DILocation(line: 86, column: 3, scope: !326)
!335 = !DILocation(line: 87, column: 6, scope: !336)
!336 = distinct !DILexicalBlock(scope: !236, file: !72, line: 87, column: 6)
!337 = !DILocation(line: 87, column: 11, scope: !336)
!338 = !DILocation(line: 87, column: 21, scope: !336)
!339 = !DILocation(line: 87, column: 6, scope: !236)
!340 = !DILocation(line: 88, column: 23, scope: !336)
!341 = !DILocation(line: 88, column: 35, scope: !336)
!342 = !DILocation(line: 88, column: 54, scope: !336)
!343 = !DILocation(line: 88, column: 59, scope: !336)
!344 = !DILocation(line: 88, column: 3, scope: !336)
!345 = !DILocation(line: 90, column: 6, scope: !346)
!346 = distinct !DILexicalBlock(scope: !236, file: !72, line: 90, column: 6)
!347 = !DILocation(line: 90, column: 11, scope: !346)
!348 = !DILocation(line: 90, column: 26, scope: !346)
!349 = !DILocation(line: 90, column: 6, scope: !236)
!350 = !DILocation(line: 91, column: 23, scope: !346)
!351 = !DILocation(line: 91, column: 35, scope: !346)
!352 = !DILocation(line: 91, column: 59, scope: !346)
!353 = !DILocation(line: 91, column: 64, scope: !346)
!354 = !DILocation(line: 91, column: 3, scope: !346)
!355 = !DILocation(line: 92, column: 6, scope: !356)
!356 = distinct !DILexicalBlock(scope: !236, file: !72, line: 92, column: 6)
!357 = !DILocation(line: 92, column: 11, scope: !356)
!358 = !DILocation(line: 92, column: 25, scope: !356)
!359 = !DILocation(line: 92, column: 6, scope: !236)
!360 = !DILocation(line: 93, column: 23, scope: !356)
!361 = !DILocation(line: 93, column: 35, scope: !356)
!362 = !DILocation(line: 93, column: 58, scope: !356)
!363 = !DILocation(line: 93, column: 63, scope: !356)
!364 = !DILocation(line: 93, column: 3, scope: !356)
!365 = !DILocation(line: 94, column: 6, scope: !366)
!366 = distinct !DILexicalBlock(scope: !236, file: !72, line: 94, column: 6)
!367 = !DILocation(line: 94, column: 11, scope: !366)
!368 = !DILocation(line: 94, column: 25, scope: !366)
!369 = !DILocation(line: 94, column: 6, scope: !236)
!370 = !DILocation(line: 95, column: 23, scope: !366)
!371 = !DILocation(line: 95, column: 35, scope: !366)
!372 = !DILocation(line: 95, column: 58, scope: !366)
!373 = !DILocation(line: 95, column: 63, scope: !366)
!374 = !DILocation(line: 95, column: 3, scope: !366)
!375 = !DILocation(line: 96, column: 1, scope: !236)
!376 = distinct !DISubprogram(name: "sig_chatnet_destroyed", scope: !72, file: !72, line: 98, type: !73, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!377 = !DILocalVariable(name: "rec", arg: 1, scope: !376, file: !72, line: 98, type: !40)
!378 = !DILocation(line: 98, column: 52, scope: !376)
!379 = !DILocation(line: 100, column: 88, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !72, line: 100, column: 6)
!381 = !DILocation(line: 100, column: 70, scope: !380)
!382 = !DILocation(line: 100, column: 54, scope: !380)
!383 = !DILocation(line: 100, column: 53, scope: !380)
!384 = !DILocation(line: 100, column: 28, scope: !385)
!385 = !DILexicalBlockFile(scope: !380, file: !72, discriminator: 3)
!386 = !DILocation(line: 100, column: 8, scope: !380)
!387 = !DILocation(line: 100, column: 6, scope: !376)
!388 = !DILocation(line: 100, column: 7, scope: !389)
!389 = !DILexicalBlockFile(scope: !380, file: !72, discriminator: 1)
!390 = !DILocation(line: 100, column: 6, scope: !391)
!391 = !DILexicalBlockFile(scope: !376, file: !72, discriminator: 2)
!392 = !DILocation(line: 101, column: 10, scope: !393)
!393 = distinct !DILexicalBlock(scope: !380, file: !72, line: 100, column: 32)
!394 = !DILocation(line: 101, column: 15, scope: !393)
!395 = !DILocation(line: 101, column: 3, scope: !393)
!396 = !DILocation(line: 102, column: 10, scope: !393)
!397 = !DILocation(line: 102, column: 15, scope: !393)
!398 = !DILocation(line: 102, column: 3, scope: !393)
!399 = !DILocation(line: 103, column: 10, scope: !393)
!400 = !DILocation(line: 103, column: 15, scope: !393)
!401 = !DILocation(line: 103, column: 3, scope: !393)
!402 = !DILocation(line: 104, column: 10, scope: !393)
!403 = !DILocation(line: 104, column: 15, scope: !393)
!404 = !DILocation(line: 104, column: 3, scope: !393)
!405 = !DILocation(line: 105, column: 10, scope: !393)
!406 = !DILocation(line: 105, column: 15, scope: !393)
!407 = !DILocation(line: 105, column: 3, scope: !393)
!408 = !DILocation(line: 106, column: 2, scope: !393)
!409 = !DILocation(line: 107, column: 1, scope: !376)
!410 = distinct !DISubprogram(name: "irc_chatnets_deinit", scope: !72, file: !72, line: 117, type: !105, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!411 = !DILocalVariable(name: "tmp", scope: !410, file: !72, line: 119, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !414, line: 37, baseType: !415)
!414 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !414, line: 39, size: 128, align: 64, elements: !416)
!416 = !{!417, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !414, line: 41, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !7, line: 77, baseType: !4)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !414, line: 42, baseType: !412, size: 64, align: 64, offset: 64)
!420 = !DILocation(line: 119, column: 10, scope: !410)
!421 = !DILocalVariable(name: "next", scope: !410, file: !72, line: 119, type: !412)
!422 = !DILocation(line: 119, column: 16, scope: !410)
!423 = !DILocation(line: 121, column: 13, scope: !424)
!424 = distinct !DILexicalBlock(scope: !410, file: !72, line: 121, column: 2)
!425 = !DILocation(line: 121, column: 11, scope: !424)
!426 = !DILocation(line: 121, column: 7, scope: !424)
!427 = !DILocation(line: 121, column: 23, scope: !428)
!428 = !DILexicalBlockFile(scope: !429, file: !72, discriminator: 1)
!429 = distinct !DILexicalBlock(scope: !424, file: !72, line: 121, column: 2)
!430 = !DILocation(line: 121, column: 27, scope: !428)
!431 = !DILocation(line: 121, column: 2, scope: !428)
!432 = !DILocalVariable(name: "rec", scope: !433, file: !72, line: 122, type: !11)
!433 = distinct !DILexicalBlock(scope: !429, file: !72, line: 121, column: 47)
!434 = !DILocation(line: 122, column: 16, scope: !433)
!435 = !DILocation(line: 122, column: 22, scope: !433)
!436 = !DILocation(line: 122, column: 27, scope: !433)
!437 = !DILocation(line: 124, column: 10, scope: !433)
!438 = !DILocation(line: 124, column: 15, scope: !433)
!439 = !DILocation(line: 124, column: 8, scope: !433)
!440 = !DILocation(line: 125, column: 89, scope: !441)
!441 = distinct !DILexicalBlock(scope: !433, file: !72, line: 125, column: 7)
!442 = !DILocation(line: 125, column: 71, scope: !441)
!443 = !DILocation(line: 125, column: 55, scope: !441)
!444 = !DILocation(line: 125, column: 54, scope: !441)
!445 = !DILocation(line: 125, column: 29, scope: !446)
!446 = !DILexicalBlockFile(scope: !441, file: !72, discriminator: 3)
!447 = !DILocation(line: 125, column: 9, scope: !441)
!448 = !DILocation(line: 125, column: 7, scope: !433)
!449 = !DILocation(line: 125, column: 8, scope: !450)
!450 = !DILexicalBlockFile(scope: !441, file: !72, discriminator: 1)
!451 = !DILocation(line: 125, column: 7, scope: !452)
!452 = !DILexicalBlockFile(scope: !433, file: !72, discriminator: 2)
!453 = !DILocation(line: 126, column: 41, scope: !441)
!454 = !DILocation(line: 126, column: 25, scope: !441)
!455 = !DILocation(line: 127, column: 2, scope: !433)
!456 = !DILocation(line: 121, column: 41, scope: !457)
!457 = !DILexicalBlockFile(scope: !429, file: !72, discriminator: 2)
!458 = !DILocation(line: 121, column: 39, scope: !457)
!459 = !DILocation(line: 121, column: 2, scope: !457)
!460 = distinct !{!460, !461}
!461 = !DILocation(line: 121, column: 2, scope: !410)
!462 = !DILocation(line: 129, column: 2, scope: !410)
!463 = !DILocation(line: 130, column: 2, scope: !410)
!464 = !DILocation(line: 131, column: 2, scope: !410)
!465 = !DILocation(line: 132, column: 1, scope: !410)
