; ModuleID = './line69-queries.o.i'
source_filename = "./line69-queries.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._QUERY_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, i8 }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !409)
!1 = !DIFile(filename: "line69-queries.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !41, !43, !50, !51, !53, !69}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !48, line: 108, baseType: !49)
!48 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !48, line: 108, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !39, line: 77, baseType: !36)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !39, line: 48, baseType: !52)
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !48, line: 110, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !56, line: 15, size: 960, align: 64, elements: !57)
!56 = !DIFile(filename: "queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!57 = !{!58, !61, !62, !67, !68, !393, !394, !395, !396, !397, !398, !399, !403, !405, !406, !407, !408}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !59, line: 3, baseType: !60, size: 32, align: 32)
!59 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !55, file: !59, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !55, file: !59, line: 5, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !65, line: 37, baseType: !66)
!65 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !65, line: 37, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !55, file: !59, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !55, file: !59, line: 8, baseType: !69, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !48, line: 107, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !72, line: 30, size: 2240, align: 64, elements: !73)
!72 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !{!74, !76, !77, !78, !306, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !324, !328, !329, !330, !334, !335, !336, !337, !338, !339, !340, !341, !342, !348, !349, !350, !351, !352, !356, !360, !364, !368, !372, !377, !384, !388, !392}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !75, line: 3, baseType: !60, size: 32, align: 32)
!75 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !71, file: !75, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !71, file: !75, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !71, file: !75, line: 8, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !48, line: 113, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !72, line: 25, size: 1920, align: 64, elements: !82)
!82 = !{!83, !85, !86, !87, !89, !90, !91, !92, !93, !95, !96, !97, !98, !99, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !84, line: 3, baseType: !60, size: 32, align: 32)
!84 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !81, file: !84, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !81, file: !84, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !81, file: !84, line: 9, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !81, file: !84, line: 10, baseType: !60, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !81, file: !84, line: 13, baseType: !94, size: 16, align: 16, offset: 448)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !84, line: 14, baseType: !88, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !81, file: !84, line: 15, baseType: !88, size: 64, align: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !81, file: !84, line: 16, baseType: !60, size: 32, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !81, file: !84, line: 17, baseType: !88, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !81, file: !84, line: 19, baseType: !100, size: 64, align: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !48, line: 99, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !48, line: 99, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !81, file: !84, line: 19, baseType: !100, size: 64, align: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !81, file: !84, line: 21, baseType: !88, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !81, file: !84, line: 22, baseType: !88, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !81, file: !84, line: 23, baseType: !88, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !81, file: !84, line: 24, baseType: !88, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !81, file: !84, line: 26, baseType: !88, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !81, file: !84, line: 27, baseType: !88, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !81, file: !84, line: 28, baseType: !88, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !81, file: !84, line: 29, baseType: !88, size: 64, align: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !81, file: !84, line: 30, baseType: !88, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !81, file: !84, line: 31, baseType: !88, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !81, file: !84, line: 32, baseType: !88, size: 64, align: 64, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !81, file: !84, line: 33, baseType: !88, size: 64, align: 64, offset: 1600)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !81, file: !84, line: 35, baseType: !117, size: 64, align: 64, offset: 1664)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !120)
!120 = !{!121, !123, !263, !264, !269, !270, !271, !272, !273, !282, !283, !284, !288, !289, !290, !291, !292, !293, !294, !295}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !119, file: !4, line: 100, baseType: !122, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !39, line: 49, baseType: !60)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !119, file: !4, line: 101, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !127)
!127 = !{!128, !150, !156, !162, !166, !250, !254, !259}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !126, file: !4, line: 133, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !117, !37, !133, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !134, line: 66, baseType: !135)
!134 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !140, line: 42, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !140, line: 44, size: 128, align: 64, elements: !142)
!142 = !{!143, !148, !149}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !141, file: !140, line: 46, baseType: !144, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !134, line: 45, baseType: !147)
!147 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !141, file: !140, line: 47, baseType: !122, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !140, line: 48, baseType: !37, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !126, file: !4, line: 138, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!132, !117, !154, !133, !136, !137}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !126, file: !4, line: 143, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!132, !117, !160, !161, !137}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !134, line: 51, baseType: !52)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !126, file: !4, line: 147, baseType: !163, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!132, !117, !137}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !126, file: !4, line: 149, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !117, !249}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !173)
!173 = !{!174, !175, !196, !225, !227, !231, !232, !233, !234, !242, !243, !244, !245}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !172, file: !16, line: 174, baseType: !50, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !172, file: !16, line: 175, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !179)
!179 = !{!180, !184, !185}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !178, file: !16, line: 198, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !50}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !178, file: !16, line: 199, baseType: !181, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !178, file: !16, line: 200, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !50, !170, !189, !195}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !50}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !39, line: 50, baseType: !122)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !172, file: !16, line: 177, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !201)
!201 = !{!202, !207, !211, !215, !219, !220}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !200, file: !16, line: 216, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!194, !170, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !200, file: !16, line: 218, baseType: !208, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!194, !170}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !200, file: !16, line: 219, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!194, !170, !190, !50}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !200, file: !16, line: 222, baseType: !216, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !170}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !200, file: !16, line: 226, baseType: !190, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !200, file: !16, line: 227, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !172, file: !16, line: 178, baseType: !226, size: 32, align: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !39, line: 55, baseType: !147)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !172, file: !16, line: 180, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !172, file: !16, line: 182, baseType: !122, size: 32, align: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !16, line: 183, baseType: !226, size: 32, align: 32, offset: 352)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !172, file: !16, line: 184, baseType: !226, size: 32, align: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !172, file: !16, line: 186, baseType: !235, size: 64, align: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !237, line: 37, baseType: !238)
!237 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !237, line: 39, size: 128, align: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !237, line: 41, baseType: !50, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !237, line: 42, baseType: !235, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !16, line: 188, baseType: !170, size: 64, align: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !16, line: 189, baseType: !170, size: 64, align: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !16, line: 191, baseType: !88, size: 64, align: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !172, file: !16, line: 193, baseType: !246, size: 64, align: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !126, file: !4, line: 151, baseType: !251, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !117}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !126, file: !4, line: 152, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!132, !117, !258, !137}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !126, file: !4, line: 155, baseType: !260, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!258, !117}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !119, file: !4, line: 103, baseType: !37, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !119, file: !4, line: 104, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !266, line: 77, baseType: !267)
!266 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !266, line: 77, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !119, file: !4, line: 105, baseType: !265, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !119, file: !4, line: 106, baseType: !37, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !119, file: !4, line: 107, baseType: !226, size: 32, align: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !119, file: !4, line: 109, baseType: !133, size: 64, align: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !119, file: !4, line: 110, baseType: !274, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !276, line: 39, baseType: !277)
!276 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !276, line: 41, size: 192, align: 64, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !277, file: !276, line: 43, baseType: !37, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !276, line: 44, baseType: !133, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !277, file: !276, line: 45, baseType: !133, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !119, file: !4, line: 111, baseType: !274, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !119, file: !4, line: 112, baseType: !274, size: 64, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !119, file: !4, line: 113, baseType: !285, size: 48, align: 8, offset: 704)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, align: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 6)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !119, file: !4, line: 117, baseType: !226, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !119, file: !4, line: 118, baseType: !226, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !119, file: !4, line: 119, baseType: !226, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !119, file: !4, line: 120, baseType: !226, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !119, file: !4, line: 121, baseType: !226, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !119, file: !4, line: 122, baseType: !226, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !119, file: !4, line: 124, baseType: !50, size: 64, align: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !119, file: !4, line: 125, baseType: !50, size: 64, align: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !81, file: !84, line: 38, baseType: !147, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !81, file: !84, line: 39, baseType: !147, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !81, file: !84, line: 40, baseType: !147, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !81, file: !84, line: 41, baseType: !147, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !81, file: !84, line: 42, baseType: !147, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !81, file: !84, line: 43, baseType: !147, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !81, file: !84, line: 44, baseType: !147, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !81, file: !84, line: 45, baseType: !147, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !81, file: !84, line: 46, baseType: !88, size: 64, align: 64, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !81, file: !84, line: 47, baseType: !88, size: 64, align: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !71, file: !75, line: 9, baseType: !307, size: 64, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !308, line: 75, baseType: !309)
!308 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !310, line: 139, baseType: !52)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !71, file: !75, line: 10, baseType: !307, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !71, file: !75, line: 12, baseType: !88, size: 64, align: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !71, file: !75, line: 13, baseType: !88, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !71, file: !75, line: 15, baseType: !147, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !71, file: !75, line: 16, baseType: !147, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !71, file: !75, line: 17, baseType: !147, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !71, file: !75, line: 18, baseType: !147, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !71, file: !75, line: 19, baseType: !147, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !71, file: !75, line: 21, baseType: !320, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !48, line: 102, baseType: !322)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !48, line: 102, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !71, file: !75, line: 22, baseType: !60, size: 32, align: 32, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !71, file: !75, line: 25, baseType: !325, size: 128, align: 64, offset: 640)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, align: 64, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !71, file: !75, line: 26, baseType: !60, size: 32, align: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !71, file: !75, line: 27, baseType: !60, size: 32, align: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !71, file: !75, line: 29, baseType: !331, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !48, line: 103, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !48, line: 103, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !71, file: !75, line: 30, baseType: !63, size: 64, align: 64, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !71, file: !75, line: 32, baseType: !88, size: 64, align: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !71, file: !75, line: 33, baseType: !88, size: 64, align: 64, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !71, file: !75, line: 34, baseType: !88, size: 64, align: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !71, file: !75, line: 35, baseType: !147, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !71, file: !75, line: 36, baseType: !147, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !71, file: !75, line: 37, baseType: !147, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !71, file: !75, line: 38, baseType: !147, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !71, file: !75, line: 40, baseType: !343, size: 128, align: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !39, line: 504, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !39, line: 506, size: 128, align: 64, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !344, file: !39, line: 508, baseType: !51, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !344, file: !39, line: 509, baseType: !51, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !71, file: !75, line: 41, baseType: !307, size: 64, align: 64, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !71, file: !75, line: 42, baseType: !60, size: 32, align: 32, offset: 1408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !71, file: !75, line: 44, baseType: !235, size: 64, align: 64, offset: 1472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !71, file: !75, line: 45, baseType: !235, size: 64, align: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !71, file: !75, line: 53, baseType: !353, size: 64, align: 64, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !69, !41, !60}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !71, file: !75, line: 55, baseType: !357, size: 64, align: 64, offset: 1664)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!60, !69, !40}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !71, file: !75, line: 57, baseType: !361, size: 64, align: 64, offset: 1728)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!60, !69, !41}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !71, file: !75, line: 60, baseType: !365, size: 64, align: 64, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!41, !69}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !71, file: !75, line: 62, baseType: !369, size: 64, align: 64, offset: 1856)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !69, !41, !41, !60}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !71, file: !75, line: 65, baseType: !373, size: 64, align: 64, offset: 1920)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !69, !41, !41}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !71, file: !75, line: 69, baseType: !378, size: 64, align: 64, offset: 1984)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !69, !41}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !48, line: 109, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !48, line: 109, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !71, file: !75, line: 70, baseType: !385, size: 64, align: 64, offset: 2048)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!53, !69, !41}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !71, file: !75, line: 71, baseType: !389, size: 64, align: 64, offset: 2112)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!60, !41, !41}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !71, file: !75, line: 73, baseType: !389, size: 64, align: 64, offset: 2176)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !55, file: !59, line: 9, baseType: !88, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !59, line: 10, baseType: !88, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !55, file: !59, line: 11, baseType: !307, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !55, file: !59, line: 12, baseType: !60, size: 32, align: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !55, file: !59, line: 13, baseType: !88, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !55, file: !59, line: 15, baseType: !43, size: 64, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !55, file: !59, line: 17, baseType: !400, size: 64, align: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!41, !46}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !55, file: !404, line: 5, baseType: !88, size: 64, align: 64, offset: 704)
!404 = !DIFile(filename: "query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !55, file: !404, line: 6, baseType: !88, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !55, file: !404, line: 7, baseType: !307, size: 64, align: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !55, file: !404, line: 9, baseType: !147, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !55, file: !404, line: 11, baseType: !147, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!409 = !{!410}
!410 = distinct !DIGlobalVariable(name: "queries", scope: !0, file: !411, line: 28, type: !235, isLocal: false, isDefinition: true, variable: %struct._GSList** @queries)
!411 = !DIFile(filename: "queries.c", directory: "/home/lichi/Desktop/irssi/task1")
!412 = !{i32 2, !"Dwarf Version", i32 4}
!413 = !{i32 2, !"Debug Info Version", i32 3}
!414 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!415 = distinct !DISubprogram(name: "query_init", scope: !411, file: !411, line: 35, type: !416, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !53, !60}
!418 = !{}
!419 = !DILocalVariable(name: "query", arg: 1, scope: !415, file: !411, line: 35, type: !53)
!420 = !DIExpression()
!421 = !DILocation(line: 35, column: 28, scope: !415)
!422 = !DILocalVariable(name: "automatic", arg: 2, scope: !415, file: !411, line: 35, type: !60)
!423 = !DILocation(line: 35, column: 39, scope: !415)
!424 = !DILocation(line: 37, column: 2, scope: !415)
!425 = distinct !{!425, !424}
!426 = !DILocation(line: 37, column: 10, scope: !427)
!427 = !DILexicalBlockFile(scope: !428, file: !411, discriminator: 1)
!428 = distinct !DILexicalBlock(scope: !429, file: !411, line: 37, column: 10)
!429 = distinct !DILexicalBlock(scope: !415, file: !411, line: 37, column: 4)
!430 = !DILocation(line: 37, column: 16, scope: !427)
!431 = !DILocation(line: 37, column: 5, scope: !432)
!432 = !DILexicalBlockFile(scope: !433, file: !411, discriminator: 2)
!433 = distinct !DILexicalBlock(scope: !428, file: !411, line: 37, column: 3)
!434 = !DILocation(line: 37, column: 14, scope: !435)
!435 = !DILexicalBlockFile(scope: !436, file: !411, discriminator: 3)
!436 = distinct !DILexicalBlock(scope: !428, file: !411, line: 37, column: 12)
!437 = !DILocation(line: 37, column: 100, scope: !435)
!438 = !DILocation(line: 37, column: 111, scope: !439)
!439 = !DILexicalBlockFile(scope: !429, file: !411, discriminator: 4)
!440 = !DILocation(line: 38, column: 2, scope: !415)
!441 = distinct !{!441, !440}
!442 = !DILocation(line: 38, column: 10, scope: !443)
!443 = !DILexicalBlockFile(scope: !444, file: !411, discriminator: 1)
!444 = distinct !DILexicalBlock(scope: !445, file: !411, line: 38, column: 10)
!445 = distinct !DILexicalBlock(scope: !415, file: !411, line: 38, column: 4)
!446 = !DILocation(line: 38, column: 17, scope: !443)
!447 = !DILocation(line: 38, column: 22, scope: !443)
!448 = !DILocation(line: 38, column: 5, scope: !449)
!449 = !DILexicalBlockFile(scope: !450, file: !411, discriminator: 2)
!450 = distinct !DILexicalBlock(scope: !444, file: !411, line: 38, column: 3)
!451 = !DILocation(line: 38, column: 14, scope: !452)
!452 = !DILexicalBlockFile(scope: !453, file: !411, discriminator: 3)
!453 = distinct !DILexicalBlock(scope: !444, file: !411, line: 38, column: 12)
!454 = !DILocation(line: 38, column: 106, scope: !452)
!455 = !DILocation(line: 38, column: 117, scope: !456)
!456 = !DILexicalBlockFile(scope: !445, file: !411, discriminator: 4)
!457 = !DILocation(line: 40, column: 27, scope: !415)
!458 = !DILocation(line: 40, column: 36, scope: !415)
!459 = !DILocation(line: 40, column: 12, scope: !415)
!460 = !DILocation(line: 40, column: 10, scope: !415)
!461 = !DILocation(line: 42, column: 32, scope: !415)
!462 = !DILocation(line: 42, column: 10, scope: !415)
!463 = !DILocation(line: 42, column: 18, scope: !415)
!464 = !DILocation(line: 42, column: 30, scope: !415)
!465 = !DILocation(line: 43, column: 16, scope: !415)
!466 = !DILocation(line: 43, column: 2, scope: !415)
!467 = !DILocation(line: 43, column: 9, scope: !415)
!468 = !DILocation(line: 43, column: 14, scope: !415)
!469 = !DILocation(line: 44, column: 9, scope: !415)
