; ModuleID = './line234-fe-messages.o.i'
source_filename = "./line234-fe-messages.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!256 = !DIEnumerator(name: "TXT_NO_SERVER_DEFINED", value: 172)
!257 = !DIEnumerator(name: "TXT_FILL_11", value: 173)
!258 = !DIEnumerator(name: "TXT_THEME_SAVED", value: 174)
!259 = !DIEnumerator(name: "TXT_THEME_SAVE_FAILED", value: 175)
!260 = !DIEnumerator(name: "TXT_THEME_NOT_FOUND", value: 176)
!261 = !DIEnumerator(name: "TXT_THEME_CHANGED", value: 177)
!262 = !DIEnumerator(name: "TXT_WINDOW_THEME", value: 178)
!263 = !DIEnumerator(name: "TXT_WINDOW_THEME_DEFAULT", value: 179)
!264 = !DIEnumerator(name: "TXT_WINDOW_THEME_CHANGED", value: 180)
!265 = !DIEnumerator(name: "TXT_WINDOW_THEME_REMOVED", value: 181)
!266 = !DIEnumerator(name: "TXT_FORMAT_TITLE", value: 182)
!267 = !DIEnumerator(name: "TXT_FORMAT_SUBTITLE", value: 183)
!268 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!269 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!270 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!271 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!272 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!273 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!274 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!275 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!276 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!277 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!278 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!279 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!280 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!281 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!282 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!283 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!284 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!285 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!286 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!287 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!288 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!289 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!290 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!291 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!292 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!293 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!294 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!295 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!296 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!297 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!298 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!299 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!300 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!301 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!302 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!303 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!304 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!305 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!306 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!307 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!308 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!309 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!310 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!311 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!312 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!313 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!314 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!315 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!316 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!317 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!318 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!319 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!320 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!321 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!322 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!323 = !{!324, !325, !329, !331, !332, !333, !334, !774, !781, !785, !790, !687, !794}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !327, line: 46, baseType: !328)
!327 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!328 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!331 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!332 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!333 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !336, line: 109, baseType: !337)
!336 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !338, line: 15, size: 1408, align: 64, elements: !339)
!338 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!339 = !{!340, !342, !343, !348, !349, !719, !720, !721, !722, !723, !724, !725, !726, !728, !729, !730, !731, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !341, line: 3, baseType: !332, size: 32, align: 32)
!341 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !337, file: !341, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !337, file: !341, line: 5, baseType: !344, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !346, line: 37, baseType: !347)
!346 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !346, line: 37, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !337, file: !341, line: 7, baseType: !324, size: 64, align: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !337, file: !341, line: 8, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !336, line: 107, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !353, line: 30, size: 2240, align: 64, elements: !354)
!353 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!354 = !{!355, !357, !358, !359, !588, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !610, !611, !612, !616, !617, !618, !619, !620, !621, !622, !623, !624, !631, !632, !633, !634, !635, !639, !643, !647, !651, !655, !660, !664, !714, !718}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !356, line: 3, baseType: !332, size: 32, align: 32)
!356 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !352, file: !356, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !352, file: !356, line: 6, baseType: !332, size: 32, align: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !352, file: !356, line: 8, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !336, line: 113, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !353, line: 25, size: 1920, align: 64, elements: !363)
!363 = !{!364, !366, !367, !368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !365, line: 3, baseType: !332, size: 32, align: 32)
!365 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !362, file: !365, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !362, file: !365, line: 6, baseType: !332, size: 32, align: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !362, file: !365, line: 9, baseType: !369, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !362, file: !365, line: 10, baseType: !332, size: 32, align: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !362, file: !365, line: 11, baseType: !369, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !362, file: !365, line: 11, baseType: !369, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !362, file: !365, line: 11, baseType: !369, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !362, file: !365, line: 13, baseType: !333, size: 16, align: 16, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !362, file: !365, line: 14, baseType: !369, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !362, file: !365, line: 15, baseType: !369, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !362, file: !365, line: 16, baseType: !332, size: 32, align: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !362, file: !365, line: 17, baseType: !369, size: 64, align: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !362, file: !365, line: 19, baseType: !380, size: 64, align: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !336, line: 99, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !336, line: 99, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !362, file: !365, line: 19, baseType: !380, size: 64, align: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !362, file: !365, line: 21, baseType: !369, size: 64, align: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !362, file: !365, line: 22, baseType: !369, size: 64, align: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !362, file: !365, line: 23, baseType: !369, size: 64, align: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !362, file: !365, line: 24, baseType: !369, size: 64, align: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !362, file: !365, line: 26, baseType: !369, size: 64, align: 64, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !362, file: !365, line: 27, baseType: !369, size: 64, align: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !362, file: !365, line: 28, baseType: !369, size: 64, align: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !362, file: !365, line: 29, baseType: !369, size: 64, align: 64, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !362, file: !365, line: 30, baseType: !369, size: 64, align: 64, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !362, file: !365, line: 31, baseType: !369, size: 64, align: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !362, file: !365, line: 32, baseType: !369, size: 64, align: 64, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !362, file: !365, line: 33, baseType: !369, size: 64, align: 64, offset: 1600)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !362, file: !365, line: 35, baseType: !397, size: 64, align: 64, offset: 1664)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !400)
!400 = !{!401, !403, !545, !546, !551, !552, !553, !554, !555, !564, !565, !566, !570, !571, !572, !573, !574, !575, !576, !577}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !399, file: !4, line: 100, baseType: !402, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !327, line: 49, baseType: !332)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !399, file: !4, line: 101, baseType: !404, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !407)
!407 = !{!408, !430, !436, !443, !447, !532, !536, !541}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !406, file: !4, line: 133, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !397, !325, !413, !416, !417}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !414, line: 66, baseType: !415)
!414 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !420, line: 42, baseType: !421)
!420 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !420, line: 44, size: 128, align: 64, elements: !422)
!422 = !{!423, !428, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !421, file: !420, line: 46, baseType: !424, size: 32, align: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !425, line: 36, baseType: !426)
!425 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !414, line: 45, baseType: !427)
!427 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !421, file: !420, line: 47, baseType: !402, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !421, file: !420, line: 48, baseType: !325, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !406, file: !4, line: 138, baseType: !431, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!412, !397, !434, !413, !416, !417}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !406, file: !4, line: 143, baseType: !437, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!412, !397, !440, !442, !417}
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !414, line: 51, baseType: !441)
!441 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !406, file: !4, line: 147, baseType: !444, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!412, !397, !417}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !406, file: !4, line: 149, baseType: !448, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !397, !531}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !454)
!454 = !{!455, !457, !478, !507, !509, !513, !514, !515, !516, !524, !525, !526, !527}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !453, file: !16, line: 174, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !327, line: 77, baseType: !324)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !453, file: !16, line: 175, baseType: !458, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !461)
!461 = !{!462, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !460, file: !16, line: 198, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !456}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !460, file: !16, line: 199, baseType: !463, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !460, file: !16, line: 200, baseType: !468, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !456, !451, !471, !477}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !456}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !327, line: 50, baseType: !402)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !453, file: !16, line: 177, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !483)
!483 = !{!484, !489, !493, !497, !501, !502}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !482, file: !16, line: 216, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!476, !451, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !482, file: !16, line: 218, baseType: !490, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!476, !451}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !482, file: !16, line: 219, baseType: !494, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!476, !451, !472, !456}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !482, file: !16, line: 222, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !451}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !482, file: !16, line: 226, baseType: !472, size: 64, align: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !482, file: !16, line: 227, baseType: !503, size: 64, align: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !453, file: !16, line: 178, baseType: !508, size: 32, align: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !327, line: 55, baseType: !427)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !453, file: !16, line: 180, baseType: !510, size: 64, align: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !453, file: !16, line: 182, baseType: !402, size: 32, align: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !16, line: 183, baseType: !508, size: 32, align: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !453, file: !16, line: 184, baseType: !508, size: 32, align: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !453, file: !16, line: 186, baseType: !517, size: 64, align: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !519, line: 37, baseType: !520)
!519 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !519, line: 39, size: 128, align: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !520, file: !519, line: 41, baseType: !456, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !519, line: 42, baseType: !517, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !453, file: !16, line: 188, baseType: !451, size: 64, align: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !16, line: 189, baseType: !451, size: 64, align: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !453, file: !16, line: 191, baseType: !369, size: 64, align: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !453, file: !16, line: 193, baseType: !528, size: 64, align: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !406, file: !4, line: 151, baseType: !533, size: 64, align: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !397}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !406, file: !4, line: 152, baseType: !537, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!412, !397, !540, !417}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !406, file: !4, line: 155, baseType: !542, size: 64, align: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!540, !397}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !399, file: !4, line: 103, baseType: !325, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !399, file: !4, line: 104, baseType: !547, size: 64, align: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !548, line: 77, baseType: !549)
!548 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !548, line: 77, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !399, file: !4, line: 105, baseType: !547, size: 64, align: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !399, file: !4, line: 106, baseType: !325, size: 64, align: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !399, file: !4, line: 107, baseType: !508, size: 32, align: 32, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !399, file: !4, line: 109, baseType: !413, size: 64, align: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !399, file: !4, line: 110, baseType: !556, size: 64, align: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !558, line: 39, baseType: !559)
!558 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !558, line: 41, size: 192, align: 64, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !559, file: !558, line: 43, baseType: !325, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !559, file: !558, line: 44, baseType: !413, size: 64, align: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !559, file: !558, line: 45, baseType: !413, size: 64, align: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !399, file: !4, line: 111, baseType: !556, size: 64, align: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !399, file: !4, line: 112, baseType: !556, size: 64, align: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !399, file: !4, line: 113, baseType: !567, size: 48, align: 8, offset: 704)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 48, align: 8, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 6)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !399, file: !4, line: 117, baseType: !508, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !399, file: !4, line: 118, baseType: !508, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !399, file: !4, line: 119, baseType: !508, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !399, file: !4, line: 120, baseType: !508, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !399, file: !4, line: 121, baseType: !508, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !399, file: !4, line: 122, baseType: !508, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !399, file: !4, line: 124, baseType: !456, size: 64, align: 64, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !399, file: !4, line: 125, baseType: !456, size: 64, align: 64, offset: 832)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !362, file: !365, line: 38, baseType: !427, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !362, file: !365, line: 39, baseType: !427, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !362, file: !365, line: 40, baseType: !427, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !362, file: !365, line: 41, baseType: !427, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !362, file: !365, line: 42, baseType: !427, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !362, file: !365, line: 43, baseType: !427, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !362, file: !365, line: 44, baseType: !427, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !362, file: !365, line: 45, baseType: !427, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !362, file: !365, line: 46, baseType: !369, size: 64, align: 64, offset: 1792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !362, file: !365, line: 47, baseType: !369, size: 64, align: 64, offset: 1856)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !352, file: !356, line: 9, baseType: !589, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !590, line: 75, baseType: !591)
!590 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !592, line: 139, baseType: !441)
!592 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!593 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !352, file: !356, line: 10, baseType: !589, size: 64, align: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !352, file: !356, line: 12, baseType: !369, size: 64, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !352, file: !356, line: 13, baseType: !369, size: 64, align: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !352, file: !356, line: 15, baseType: !427, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !352, file: !356, line: 16, baseType: !427, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !352, file: !356, line: 17, baseType: !427, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !352, file: !356, line: 18, baseType: !427, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !352, file: !356, line: 19, baseType: !427, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !352, file: !356, line: 21, baseType: !602, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !336, line: 102, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !336, line: 102, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !352, file: !356, line: 22, baseType: !332, size: 32, align: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !352, file: !356, line: 25, baseType: !607, size: 128, align: 64, offset: 640)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, align: 64, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 2)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !352, file: !356, line: 26, baseType: !332, size: 32, align: 32, offset: 768)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !352, file: !356, line: 27, baseType: !332, size: 32, align: 32, offset: 800)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !352, file: !356, line: 29, baseType: !613, size: 64, align: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !336, line: 103, baseType: !615)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !336, line: 103, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !352, file: !356, line: 30, baseType: !344, size: 64, align: 64, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !352, file: !356, line: 32, baseType: !369, size: 64, align: 64, offset: 960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !352, file: !356, line: 33, baseType: !369, size: 64, align: 64, offset: 1024)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !352, file: !356, line: 34, baseType: !369, size: 64, align: 64, offset: 1088)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !352, file: !356, line: 35, baseType: !427, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !352, file: !356, line: 36, baseType: !427, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !352, file: !356, line: 37, baseType: !427, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !352, file: !356, line: 38, baseType: !427, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !352, file: !356, line: 40, baseType: !625, size: 128, align: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !327, line: 504, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !327, line: 506, size: 128, align: 64, elements: !627)
!627 = !{!628, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !626, file: !327, line: 508, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !327, line: 48, baseType: !441)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !626, file: !327, line: 509, baseType: !629, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !352, file: !356, line: 41, baseType: !589, size: 64, align: 64, offset: 1344)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !352, file: !356, line: 42, baseType: !332, size: 32, align: 32, offset: 1408)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !352, file: !356, line: 44, baseType: !517, size: 64, align: 64, offset: 1472)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !352, file: !356, line: 45, baseType: !517, size: 64, align: 64, offset: 1536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !352, file: !356, line: 53, baseType: !636, size: 64, align: 64, offset: 1600)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !350, !329, !332}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !352, file: !356, line: 55, baseType: !640, size: 64, align: 64, offset: 1664)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!332, !350, !328}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !352, file: !356, line: 57, baseType: !644, size: 64, align: 64, offset: 1728)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!332, !350, !329}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !352, file: !356, line: 60, baseType: !648, size: 64, align: 64, offset: 1792)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{!329, !350}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !352, file: !356, line: 62, baseType: !652, size: 64, align: 64, offset: 1856)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !350, !329, !329, !332}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !352, file: !356, line: 65, baseType: !656, size: 64, align: 64, offset: 1920)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !350, !329, !329}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !352, file: !356, line: 69, baseType: !661, size: 64, align: 64, offset: 1984)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!334, !350, !329}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !352, file: !356, line: 70, baseType: !665, size: 64, align: 64, offset: 2048)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !350, !329}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !336, line: 110, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !671, line: 15, size: 960, align: 64, elements: !672)
!671 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !707, !708, !710, !711, !712, !713}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !341, line: 3, baseType: !332, size: 32, align: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !670, file: !341, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !670, file: !341, line: 5, baseType: !344, size: 64, align: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !670, file: !341, line: 7, baseType: !324, size: 64, align: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !670, file: !341, line: 8, baseType: !350, size: 64, align: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !670, file: !341, line: 9, baseType: !369, size: 64, align: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !341, line: 10, baseType: !369, size: 64, align: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !670, file: !341, line: 11, baseType: !589, size: 64, align: 64, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !670, file: !341, line: 12, baseType: !332, size: 32, align: 32, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !670, file: !341, line: 13, baseType: !369, size: 64, align: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !670, file: !341, line: 15, baseType: !684, size: 64, align: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !336, line: 108, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !690, line: 5, size: 704, align: 64, elements: !691)
!690 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !341, line: 3, baseType: !332, size: 32, align: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !689, file: !341, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !689, file: !341, line: 5, baseType: !344, size: 64, align: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !689, file: !341, line: 7, baseType: !324, size: 64, align: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !689, file: !341, line: 8, baseType: !350, size: 64, align: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !689, file: !341, line: 9, baseType: !369, size: 64, align: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !341, line: 10, baseType: !369, size: 64, align: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !689, file: !341, line: 11, baseType: !589, size: 64, align: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !689, file: !341, line: 12, baseType: !332, size: 32, align: 32, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !689, file: !341, line: 13, baseType: !369, size: 64, align: 64, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !689, file: !341, line: 15, baseType: !684, size: 64, align: 64, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !689, file: !341, line: 17, baseType: !704, size: 64, align: 64, offset: 640)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!329, !687}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !670, file: !341, line: 17, baseType: !704, size: 64, align: 64, offset: 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !670, file: !709, line: 5, baseType: !369, size: 64, align: 64, offset: 704)
!709 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!710 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !670, file: !709, line: 6, baseType: !369, size: 64, align: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !670, file: !709, line: 7, baseType: !589, size: 64, align: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !670, file: !709, line: 9, baseType: !427, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !670, file: !709, line: 11, baseType: !427, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !352, file: !356, line: 71, baseType: !715, size: 64, align: 64, offset: 2112)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!332, !329, !329}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !352, file: !356, line: 73, baseType: !715, size: 64, align: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !337, file: !341, line: 9, baseType: !369, size: 64, align: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !341, line: 10, baseType: !369, size: 64, align: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !337, file: !341, line: 11, baseType: !589, size: 64, align: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !337, file: !341, line: 12, baseType: !332, size: 32, align: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !337, file: !341, line: 13, baseType: !369, size: 64, align: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !337, file: !341, line: 15, baseType: !684, size: 64, align: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !337, file: !341, line: 17, baseType: !704, size: 64, align: 64, offset: 640)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !337, file: !727, line: 5, baseType: !369, size: 64, align: 64, offset: 704)
!727 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!728 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !337, file: !727, line: 6, baseType: !369, size: 64, align: 64, offset: 768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !337, file: !727, line: 7, baseType: !589, size: 64, align: 64, offset: 832)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !337, file: !727, line: 9, baseType: !344, size: 64, align: 64, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !337, file: !727, line: 10, baseType: !732, size: 64, align: 64, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !336, line: 111, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !735, line: 13, size: 576, align: 64, elements: !736)
!735 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!736 = !{!737, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !755, !756}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !738, line: 3, baseType: !332, size: 32, align: 32)
!738 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !734, file: !738, line: 4, baseType: !332, size: 32, align: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !734, file: !738, line: 6, baseType: !589, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !734, file: !738, line: 8, baseType: !369, size: 64, align: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !734, file: !738, line: 9, baseType: !369, size: 64, align: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !734, file: !738, line: 10, baseType: !369, size: 64, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !734, file: !738, line: 11, baseType: !332, size: 32, align: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !734, file: !738, line: 14, baseType: !427, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !734, file: !738, line: 15, baseType: !427, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !734, file: !738, line: 18, baseType: !427, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !734, file: !738, line: 19, baseType: !427, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !734, file: !738, line: 20, baseType: !427, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !734, file: !738, line: 21, baseType: !427, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !734, file: !738, line: 22, baseType: !752, size: 64, align: 8, offset: 360)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, align: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !734, file: !738, line: 26, baseType: !324, size: 64, align: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !738, line: 28, baseType: !732, size: 64, align: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !337, file: !727, line: 12, baseType: !427, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !337, file: !727, line: 13, baseType: !369, size: 64, align: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !337, file: !727, line: 14, baseType: !332, size: 32, align: 32, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !337, file: !727, line: 15, baseType: !369, size: 64, align: 64, offset: 1216)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !337, file: !727, line: 17, baseType: !427, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !337, file: !727, line: 18, baseType: !427, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !337, file: !727, line: 19, baseType: !427, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !337, file: !727, line: 20, baseType: !427, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !337, file: !727, line: 22, baseType: !427, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !337, file: !727, line: 23, baseType: !427, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !337, file: !727, line: 24, baseType: !427, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !337, file: !727, line: 25, baseType: !427, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !337, file: !727, line: 26, baseType: !427, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !337, file: !727, line: 31, baseType: !771, size: 64, align: 64, offset: 1344)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!369, !334}
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !327, line: 90, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!508, !778}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !327, line: 78, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !327, line: 80, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!402, !778, !778}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !786, line: 9, baseType: !787)
!786 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !779, !779, !779, !779, !779, !779}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !327, line: 91, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !456, !456, !456}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !336, line: 117, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !797, line: 28, size: 1280, align: 64, elements: !798)
!797 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !832, !833, !834, !835, !836, !837, !838, !839}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !796, file: !797, line: 29, baseType: !332, size: 32, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !797, line: 30, baseType: !369, size: 64, align: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !796, file: !797, line: 32, baseType: !332, size: 32, align: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !796, file: !797, line: 32, baseType: !332, size: 32, align: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !796, file: !797, line: 34, baseType: !517, size: 64, align: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !796, file: !797, line: 35, baseType: !687, size: 64, align: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !796, file: !797, line: 36, baseType: !350, size: 64, align: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !796, file: !797, line: 37, baseType: !350, size: 64, align: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !796, file: !797, line: 38, baseType: !369, size: 64, align: 64, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !796, file: !797, line: 40, baseType: !332, size: 32, align: 32, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !796, file: !797, line: 41, baseType: !517, size: 64, align: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !796, file: !797, line: 43, baseType: !427, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !796, file: !797, line: 44, baseType: !427, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !796, file: !797, line: 45, baseType: !427, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !796, file: !797, line: 48, baseType: !814, size: 64, align: 64, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !816, line: 14, baseType: !817)
!816 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !816, line: 6, size: 256, align: 64, elements: !818)
!818 = !{!819, !820, !829, !830, !831}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !817, file: !816, line: 7, baseType: !369, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !817, file: !816, line: 9, baseType: !821, size: 64, align: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !823, line: 37, baseType: !824)
!823 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !823, line: 39, size: 192, align: 64, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !823, line: 41, baseType: !456, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !823, line: 42, baseType: !821, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !824, file: !823, line: 43, baseType: !821, size: 64, align: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !817, file: !816, line: 10, baseType: !332, size: 32, align: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !817, file: !816, line: 12, baseType: !332, size: 32, align: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !817, file: !816, line: 13, baseType: !332, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !796, file: !797, line: 49, baseType: !369, size: 64, align: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !796, file: !797, line: 51, baseType: !332, size: 32, align: 32, offset: 832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !796, file: !797, line: 52, baseType: !369, size: 64, align: 64, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !796, file: !797, line: 54, baseType: !589, size: 64, align: 64, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !796, file: !797, line: 55, baseType: !589, size: 64, align: 64, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !796, file: !797, line: 57, baseType: !369, size: 64, align: 64, offset: 1088)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !796, file: !797, line: 58, baseType: !324, size: 64, align: 64, offset: 1152)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !796, file: !797, line: 60, baseType: !324, size: 64, align: 64, offset: 1216)
!840 = !{!841}
!841 = distinct !DIGlobalVariable(name: "printnicks", scope: !0, file: !842, line: 46, type: !344, isLocal: false, isDefinition: true, variable: %struct._GHashTable** @printnicks)
!842 = !DIFile(filename: "fe-messages.c", directory: "/home/lichi/Desktop/irssi/task1")
!843 = !{i32 2, !"Dwarf Version", i32 4}
!844 = !{i32 2, !"Debug Info Version", i32 3}
!845 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!846 = distinct !DISubprogram(name: "expand_emphasis", scope: !842, file: !842, line: 50, type: !847, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!369, !687, !329}
!849 = !{}
!850 = !DILocalVariable(name: "item", arg: 1, scope: !846, file: !842, line: 50, type: !687)
!851 = !DIExpression()
!852 = !DILocation(line: 50, column: 36, scope: !846)
!853 = !DILocalVariable(name: "text", arg: 2, scope: !846, file: !842, line: 50, type: !329)
!854 = !DILocation(line: 50, column: 54, scope: !846)
!855 = !DILocalVariable(name: "str", scope: !846, file: !842, line: 52, type: !556)
!856 = !DILocation(line: 52, column: 11, scope: !846)
!857 = !DILocalVariable(name: "ret", scope: !846, file: !842, line: 53, type: !369)
!858 = !DILocation(line: 53, column: 8, scope: !846)
!859 = !DILocalVariable(name: "pos", scope: !846, file: !842, line: 54, type: !332)
!860 = !DILocation(line: 54, column: 6, scope: !846)
!861 = !DILocalVariable(name: "emphasis_italics", scope: !846, file: !842, line: 55, type: !332)
!862 = !DILocation(line: 55, column: 6, scope: !846)
!863 = !DILocation(line: 57, column: 9, scope: !846)
!864 = distinct !{!864, !863}
!865 = !DILocation(line: 57, column: 17, scope: !866)
!866 = !DILexicalBlockFile(scope: !867, file: !842, discriminator: 1)
!867 = distinct !DILexicalBlock(scope: !868, file: !842, line: 57, column: 17)
!868 = distinct !DILexicalBlock(scope: !846, file: !842, line: 57, column: 11)
!869 = !DILocation(line: 57, column: 22, scope: !866)
!870 = !DILocation(line: 57, column: 12, scope: !871)
!871 = !DILexicalBlockFile(scope: !872, file: !842, discriminator: 2)
!872 = distinct !DILexicalBlock(scope: !867, file: !842, line: 57, column: 10)
!873 = !DILocation(line: 57, column: 21, scope: !874)
!874 = !DILexicalBlockFile(scope: !875, file: !842, discriminator: 3)
!875 = distinct !DILexicalBlock(scope: !867, file: !842, line: 57, column: 19)
!876 = !DILocation(line: 57, column: 106, scope: !874)
!877 = !DILocation(line: 57, column: 14, scope: !878)
!878 = !DILexicalBlockFile(scope: !868, file: !842, discriminator: 4)
!879 = !DILocation(line: 59, column: 21, scope: !846)
!880 = !DILocation(line: 59, column: 19, scope: !846)
!881 = !DILocation(line: 61, column: 21, scope: !846)
!882 = !DILocation(line: 61, column: 8, scope: !846)
!883 = !DILocation(line: 61, column: 6, scope: !846)
!884 = !DILocation(line: 63, column: 11, scope: !885)
!885 = distinct !DILexicalBlock(scope: !846, file: !842, line: 63, column: 2)
!886 = !DILocation(line: 63, column: 7, scope: !885)
!887 = !DILocation(line: 63, column: 16, scope: !888)
!888 = !DILexicalBlockFile(scope: !889, file: !842, discriminator: 1)
!889 = distinct !DILexicalBlock(scope: !885, file: !842, line: 63, column: 2)
!890 = !DILocation(line: 63, column: 22, scope: !888)
!891 = !DILocation(line: 63, column: 27, scope: !888)
!892 = !DILocation(line: 63, column: 20, scope: !888)
!893 = !DILocation(line: 63, column: 2, scope: !888)
!894 = !DILocalVariable(name: "type", scope: !895, file: !842, line: 64, type: !328)
!895 = distinct !DILexicalBlock(scope: !889, file: !842, line: 63, column: 39)
!896 = !DILocation(line: 64, column: 8, scope: !895)
!897 = !DILocalVariable(name: "bgn", scope: !895, file: !842, line: 64, type: !369)
!898 = !DILocation(line: 64, column: 15, scope: !895)
!899 = !DILocalVariable(name: "end", scope: !895, file: !842, line: 64, type: !369)
!900 = !DILocation(line: 64, column: 21, scope: !895)
!901 = !DILocation(line: 66, column: 9, scope: !895)
!902 = !DILocation(line: 66, column: 14, scope: !895)
!903 = !DILocation(line: 66, column: 20, scope: !895)
!904 = !DILocation(line: 66, column: 18, scope: !895)
!905 = !DILocation(line: 66, column: 7, scope: !895)
!906 = !DILocation(line: 68, column: 8, scope: !907)
!907 = distinct !DILexicalBlock(scope: !895, file: !842, line: 68, column: 7)
!908 = !DILocation(line: 68, column: 7, scope: !907)
!909 = !DILocation(line: 68, column: 12, scope: !907)
!910 = !DILocation(line: 68, column: 7, scope: !895)
!911 = !DILocation(line: 69, column: 9, scope: !907)
!912 = !DILocation(line: 69, column: 4, scope: !907)
!913 = !DILocation(line: 70, column: 13, scope: !914)
!914 = distinct !DILexicalBlock(scope: !907, file: !842, line: 70, column: 12)
!915 = !DILocation(line: 70, column: 12, scope: !914)
!916 = !DILocation(line: 70, column: 17, scope: !914)
!917 = !DILocation(line: 70, column: 24, scope: !914)
!918 = !DILocation(line: 70, column: 27, scope: !919)
!919 = !DILexicalBlockFile(scope: !914, file: !842, discriminator: 1)
!920 = !DILocation(line: 70, column: 12, scope: !919)
!921 = !DILocation(line: 71, column: 9, scope: !914)
!922 = !DILocation(line: 71, column: 4, scope: !914)
!923 = !DILocation(line: 72, column: 13, scope: !924)
!924 = distinct !DILexicalBlock(scope: !914, file: !842, line: 72, column: 12)
!925 = !DILocation(line: 72, column: 12, scope: !924)
!926 = !DILocation(line: 72, column: 17, scope: !924)
!927 = !DILocation(line: 72, column: 12, scope: !914)
!928 = !DILocation(line: 73, column: 9, scope: !924)
!929 = !DILocation(line: 73, column: 4, scope: !924)
!930 = !DILocation(line: 75, column: 4, scope: !924)
!931 = !DILocation(line: 79, column: 8, scope: !932)
!932 = distinct !DILexicalBlock(scope: !895, file: !842, line: 79, column: 7)
!933 = !DILocation(line: 79, column: 12, scope: !932)
!934 = !DILocation(line: 79, column: 16, scope: !932)
!935 = !DILocation(line: 79, column: 19, scope: !936)
!936 = !DILexicalBlockFile(scope: !932, file: !842, discriminator: 1)
!937 = !DILocation(line: 79, column: 27, scope: !936)
!938 = !DILocation(line: 79, column: 35, scope: !936)
!939 = !DILocation(line: 79, column: 57, scope: !940)
!940 = !DILexicalBlockFile(scope: !932, file: !842, discriminator: 2)
!941 = !DILocation(line: 79, column: 40, scope: !940)
!942 = !DILocation(line: 79, column: 65, scope: !940)
!943 = !DILocation(line: 79, column: 72, scope: !940)
!944 = !DILocation(line: 79, column: 61, scope: !945)
!945 = !DILexicalBlockFile(scope: !932, file: !842, discriminator: 3)
!946 = !DILocation(line: 79, column: 38, scope: !945)
!947 = !DILocation(line: 79, column: 39, scope: !945)
!948 = !DILocation(line: 79, column: 41, scope: !945)
!949 = !DILocation(line: 79, column: 40, scope: !945)
!950 = !DILocation(line: 79, column: 42, scope: !945)
!951 = !DILocation(line: 79, column: 7, scope: !945)
!952 = !DILocation(line: 80, column: 4, scope: !932)
!953 = !DILocation(line: 81, column: 21, scope: !954)
!954 = distinct !DILexicalBlock(scope: !895, file: !842, line: 81, column: 7)
!955 = !DILocation(line: 81, column: 24, scope: !954)
!956 = !DILocation(line: 81, column: 29, scope: !954)
!957 = !DILocation(line: 81, column: 28, scope: !954)
!958 = !DILocation(line: 81, column: 14, scope: !954)
!959 = !DILocation(line: 81, column: 12, scope: !954)
!960 = !DILocation(line: 81, column: 35, scope: !954)
!961 = !DILocation(line: 81, column: 7, scope: !895)
!962 = !DILocation(line: 82, column: 4, scope: !954)
!963 = !DILocation(line: 83, column: 26, scope: !964)
!964 = distinct !DILexicalBlock(scope: !895, file: !842, line: 83, column: 7)
!965 = !DILocation(line: 83, column: 9, scope: !964)
!966 = !DILocation(line: 83, column: 35, scope: !964)
!967 = !DILocation(line: 83, column: 42, scope: !964)
!968 = !DILocation(line: 83, column: 30, scope: !969)
!969 = !DILexicalBlockFile(scope: !964, file: !842, discriminator: 1)
!970 = !DILocation(line: 83, column: 7, scope: !969)
!971 = !DILocation(line: 83, column: 8, scope: !969)
!972 = !DILocation(line: 83, column: 10, scope: !969)
!973 = !DILocation(line: 83, column: 9, scope: !969)
!974 = !DILocation(line: 83, column: 11, scope: !969)
!975 = !DILocation(line: 83, column: 30, scope: !976)
!976 = !DILexicalBlockFile(scope: !964, file: !842, discriminator: 2)
!977 = !DILocation(line: 83, column: 13, scope: !976)
!978 = !DILocation(line: 83, column: 38, scope: !976)
!979 = !DILocation(line: 83, column: 45, scope: !976)
!980 = !DILocation(line: 83, column: 54, scope: !981)
!981 = !DILexicalBlockFile(scope: !964, file: !842, discriminator: 3)
!982 = !DILocation(line: 83, column: 31, scope: !981)
!983 = !DILocation(line: 83, column: 32, scope: !981)
!984 = !DILocation(line: 83, column: 34, scope: !981)
!985 = !DILocation(line: 83, column: 33, scope: !981)
!986 = !DILocation(line: 83, column: 35, scope: !981)
!987 = !DILocation(line: 84, column: 7, scope: !964)
!988 = !DILocation(line: 84, column: 17, scope: !964)
!989 = !DILocation(line: 84, column: 14, scope: !964)
!990 = !DILocation(line: 84, column: 22, scope: !964)
!991 = !DILocation(line: 84, column: 25, scope: !969)
!992 = !DILocation(line: 84, column: 32, scope: !969)
!993 = !DILocation(line: 84, column: 39, scope: !969)
!994 = !DILocation(line: 84, column: 42, scope: !976)
!995 = !DILocation(line: 84, column: 49, scope: !976)
!996 = !DILocation(line: 84, column: 56, scope: !976)
!997 = !DILocation(line: 87, column: 8, scope: !964)
!998 = !DILocation(line: 87, column: 13, scope: !964)
!999 = !DILocation(line: 87, column: 19, scope: !964)
!1000 = !DILocation(line: 87, column: 44, scope: !969)
!1001 = !DILocation(line: 87, column: 21, scope: !969)
!1002 = !DILocation(line: 87, column: 22, scope: !969)
!1003 = !DILocation(line: 87, column: 24, scope: !969)
!1004 = !DILocation(line: 87, column: 23, scope: !969)
!1005 = !DILocation(line: 87, column: 25, scope: !969)
!1006 = !DILocation(line: 87, column: 39, scope: !969)
!1007 = !DILocation(line: 87, column: 60, scope: !976)
!1008 = !DILocation(line: 87, column: 43, scope: !976)
!1009 = !DILocation(line: 87, column: 68, scope: !976)
!1010 = !DILocation(line: 87, column: 75, scope: !976)
!1011 = !DILocation(line: 87, column: 65, scope: !981)
!1012 = !DILocation(line: 87, column: 42, scope: !981)
!1013 = !DILocation(line: 87, column: 43, scope: !981)
!1014 = !DILocation(line: 87, column: 45, scope: !981)
!1015 = !DILocation(line: 87, column: 44, scope: !981)
!1016 = !DILocation(line: 87, column: 46, scope: !981)
!1017 = !DILocation(line: 83, column: 7, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !895, file: !842, discriminator: 4)
!1019 = !DILocation(line: 88, column: 4, scope: !964)
!1020 = !DILocation(line: 90, column: 50, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !895, file: !842, line: 90, column: 7)
!1022 = !DILocation(line: 90, column: 25, scope: !1021)
!1023 = !DILocation(line: 90, column: 9, scope: !1021)
!1024 = !DILocation(line: 90, column: 7, scope: !895)
!1025 = !DILocation(line: 90, column: 8, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1021, file: !842, discriminator: 1)
!1027 = !DILocation(line: 90, column: 7, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !895, file: !842, discriminator: 2)
!1029 = !DILocalVariable(name: "found", scope: !1030, file: !842, line: 93, type: !332)
!1030 = distinct !DILexicalBlock(scope: !1021, file: !842, line: 90, column: 57)
!1031 = !DILocation(line: 93, column: 8, scope: !1030)
!1032 = !DILocalVariable(name: "c", scope: !1030, file: !842, line: 94, type: !328)
!1033 = !DILocation(line: 94, column: 30, scope: !1030)
!1034 = !DILocalVariable(name: "end2", scope: !1030, file: !842, line: 95, type: !369)
!1035 = !DILocation(line: 95, column: 10, scope: !1030)
!1036 = !DILocation(line: 98, column: 8, scope: !1030)
!1037 = !DILocation(line: 98, column: 6, scope: !1030)
!1038 = !DILocation(line: 99, column: 25, scope: !1030)
!1039 = !DILocation(line: 99, column: 32, scope: !1030)
!1040 = !DILocation(line: 100, column: 89, scope: !1030)
!1041 = !DILocation(line: 100, column: 64, scope: !1030)
!1042 = !DILocation(line: 100, column: 48, scope: !1030)
!1043 = !DILocation(line: 100, column: 81, scope: !1030)
!1044 = !DILocation(line: 100, column: 33, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 1)
!1046 = !DILocation(line: 100, column: 86, scope: !1030)
!1047 = !DILocation(line: 100, column: 31, scope: !1030)
!1048 = !DILocation(line: 101, column: 13, scope: !1030)
!1049 = !DILocation(line: 101, column: 4, scope: !1030)
!1050 = !DILocation(line: 101, column: 11, scope: !1030)
!1051 = !DILocation(line: 102, column: 8, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1030, file: !842, line: 102, column: 8)
!1053 = !DILocation(line: 102, column: 8, scope: !1030)
!1054 = !DILocation(line: 102, column: 15, scope: !1055)
!1055 = !DILexicalBlockFile(scope: !1052, file: !842, discriminator: 1)
!1056 = !DILocation(line: 106, column: 11, scope: !1030)
!1057 = !DILocation(line: 106, column: 9, scope: !1030)
!1058 = !DILocation(line: 107, column: 4, scope: !1030)
!1059 = !DILocation(line: 107, column: 33, scope: !1045)
!1060 = !DILocation(line: 107, column: 10, scope: !1045)
!1061 = !DILocation(line: 107, column: 11, scope: !1045)
!1062 = !DILocation(line: 107, column: 13, scope: !1045)
!1063 = !DILocation(line: 107, column: 12, scope: !1045)
!1064 = !DILocation(line: 107, column: 14, scope: !1045)
!1065 = !DILocation(line: 107, column: 14, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 2)
!1067 = !DILocation(line: 107, column: 13, scope: !1066)
!1068 = !DILocation(line: 107, column: 23, scope: !1066)
!1069 = !DILocation(line: 107, column: 30, scope: !1066)
!1070 = !DILocation(line: 107, column: 34, scope: !1071)
!1071 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 3)
!1072 = !DILocation(line: 107, column: 33, scope: !1071)
!1073 = !DILocation(line: 107, column: 43, scope: !1071)
!1074 = !DILocation(line: 107, column: 50, scope: !1071)
!1075 = !DILocation(line: 107, column: 54, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 4)
!1077 = !DILocation(line: 107, column: 53, scope: !1076)
!1078 = !DILocation(line: 107, column: 63, scope: !1076)
!1079 = !DILocation(line: 107, column: 70, scope: !1076)
!1080 = !DILocation(line: 107, column: 74, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 5)
!1082 = !DILocation(line: 107, column: 73, scope: !1081)
!1083 = !DILocation(line: 107, column: 83, scope: !1081)
!1084 = !DILocation(line: 107, column: 90, scope: !1081)
!1085 = !DILocation(line: 107, column: 94, scope: !1086)
!1086 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 6)
!1087 = !DILocation(line: 107, column: 93, scope: !1086)
!1088 = !DILocation(line: 107, column: 103, scope: !1086)
!1089 = !DILocation(line: 107, column: 110, scope: !1086)
!1090 = !DILocation(line: 107, column: 114, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 7)
!1092 = !DILocation(line: 107, column: 113, scope: !1091)
!1093 = !DILocation(line: 107, column: 123, scope: !1091)
!1094 = !DILocation(line: 107, column: 130, scope: !1091)
!1095 = !DILocation(line: 107, column: 134, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 8)
!1097 = !DILocation(line: 107, column: 133, scope: !1096)
!1098 = !DILocation(line: 107, column: 143, scope: !1096)
!1099 = !DILocation(line: 107, column: 150, scope: !1096)
!1100 = !DILocation(line: 107, column: 154, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 9)
!1102 = !DILocation(line: 107, column: 153, scope: !1101)
!1103 = !DILocation(line: 107, column: 163, scope: !1101)
!1104 = !DILocation(line: 107, column: 170, scope: !1101)
!1105 = !DILocation(line: 107, column: 174, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 10)
!1107 = !DILocation(line: 107, column: 173, scope: !1106)
!1108 = !DILocation(line: 107, column: 183, scope: !1106)
!1109 = !DILocation(line: 107, column: 191, scope: !1106)
!1110 = !DILocation(line: 107, column: 195, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 11)
!1112 = !DILocation(line: 107, column: 194, scope: !1111)
!1113 = !DILocation(line: 107, column: 204, scope: !1111)
!1114 = !DILocation(line: 107, column: 191, scope: !1111)
!1115 = !DILocation(line: 107, column: 4, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 12)
!1117 = !DILocation(line: 108, column: 9, scope: !1030)
!1118 = !DILocation(line: 107, column: 4, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1030, file: !842, discriminator: 13)
!1120 = distinct !{!1120, !1058}
!1121 = !DILocation(line: 109, column: 8, scope: !1030)
!1122 = !DILocation(line: 109, column: 6, scope: !1030)
!1123 = !DILocation(line: 110, column: 4, scope: !1030)
!1124 = !DILocation(line: 110, column: 12, scope: !1030)
!1125 = !DILocation(line: 111, column: 68, scope: !1030)
!1126 = !DILocation(line: 111, column: 43, scope: !1030)
!1127 = !DILocation(line: 111, column: 27, scope: !1030)
!1128 = !DILocation(line: 111, column: 60, scope: !1030)
!1129 = !DILocation(line: 111, column: 12, scope: !1045)
!1130 = !DILocation(line: 111, column: 65, scope: !1030)
!1131 = !DILocation(line: 111, column: 10, scope: !1030)
!1132 = !DILocation(line: 112, column: 14, scope: !1030)
!1133 = !DILocation(line: 112, column: 4, scope: !1030)
!1134 = !DILocation(line: 112, column: 12, scope: !1030)
!1135 = !DILocation(line: 113, column: 8, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1030, file: !842, line: 113, column: 8)
!1137 = !DILocation(line: 113, column: 8, scope: !1030)
!1138 = !DILocation(line: 113, column: 15, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1136, file: !842, discriminator: 1)
!1140 = !DILocation(line: 114, column: 3, scope: !1030)
!1141 = !DILocation(line: 117, column: 8, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !895, file: !842, line: 117, column: 7)
!1143 = !DILocation(line: 117, column: 7, scope: !895)
!1144 = !DILocalVariable(name: "c", scope: !1145, file: !842, line: 118, type: !369)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !842, line: 117, column: 49)
!1146 = !DILocation(line: 118, column: 10, scope: !1145)
!1147 = !DILocation(line: 119, column: 13, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1145, file: !842, line: 119, column: 4)
!1149 = !DILocation(line: 119, column: 16, scope: !1148)
!1150 = !DILocation(line: 119, column: 11, scope: !1148)
!1151 = !DILocation(line: 119, column: 9, scope: !1148)
!1152 = !DILocation(line: 119, column: 20, scope: !1153)
!1153 = !DILexicalBlockFile(scope: !1154, file: !842, discriminator: 1)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !842, line: 119, column: 4)
!1155 = !DILocation(line: 119, column: 25, scope: !1153)
!1156 = !DILocation(line: 119, column: 22, scope: !1153)
!1157 = !DILocation(line: 119, column: 4, scope: !1153)
!1158 = !DILocation(line: 120, column: 29, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !842, line: 120, column: 9)
!1160 = distinct !DILexicalBlock(scope: !1154, file: !842, line: 119, column: 35)
!1161 = !DILocation(line: 120, column: 28, scope: !1159)
!1162 = !DILocation(line: 120, column: 11, scope: !1159)
!1163 = !DILocation(line: 120, column: 32, scope: !1159)
!1164 = !DILocation(line: 120, column: 39, scope: !1159)
!1165 = !DILocation(line: 120, column: 33, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1159, file: !842, discriminator: 1)
!1167 = !DILocation(line: 120, column: 32, scope: !1166)
!1168 = !DILocation(line: 120, column: 9, scope: !1166)
!1169 = !DILocation(line: 120, column: 10, scope: !1166)
!1170 = !DILocation(line: 120, column: 12, scope: !1166)
!1171 = !DILocation(line: 120, column: 11, scope: !1166)
!1172 = !DILocation(line: 120, column: 13, scope: !1166)
!1173 = !DILocation(line: 121, column: 6, scope: !1159)
!1174 = !DILocation(line: 122, column: 4, scope: !1160)
!1175 = !DILocation(line: 119, column: 31, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1154, file: !842, discriminator: 2)
!1177 = !DILocation(line: 119, column: 4, scope: !1176)
!1178 = distinct !{!1178, !1179}
!1179 = !DILocation(line: 119, column: 4, scope: !1145)
!1180 = !DILocation(line: 123, column: 8, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1145, file: !842, line: 123, column: 8)
!1182 = !DILocation(line: 123, column: 13, scope: !1181)
!1183 = !DILocation(line: 123, column: 10, scope: !1181)
!1184 = !DILocation(line: 123, column: 8, scope: !1145)
!1185 = !DILocation(line: 123, column: 18, scope: !1186)
!1186 = !DILexicalBlockFile(scope: !1181, file: !842, discriminator: 1)
!1187 = !DILocation(line: 124, column: 3, scope: !1145)
!1188 = !DILocation(line: 126, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !895, file: !842, line: 126, column: 7)
!1190 = !DILocation(line: 126, column: 7, scope: !895)
!1191 = !DILocation(line: 127, column: 18, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !842, line: 126, column: 46)
!1193 = !DILocation(line: 127, column: 12, scope: !1192)
!1194 = !DILocation(line: 127, column: 16, scope: !1192)
!1195 = !DILocation(line: 127, column: 5, scope: !1192)
!1196 = !DILocation(line: 127, column: 9, scope: !1192)
!1197 = !DILocation(line: 128, column: 33, scope: !1192)
!1198 = !DILocation(line: 128, column: 37, scope: !1192)
!1199 = !DILocation(line: 128, column: 36, scope: !1192)
!1200 = !DILocation(line: 128, column: 29, scope: !1192)
!1201 = !DILocation(line: 129, column: 3, scope: !1192)
!1202 = !DILocation(line: 130, column: 22, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1189, file: !842, line: 129, column: 10)
!1204 = !DILocation(line: 130, column: 27, scope: !1203)
!1205 = !DILocation(line: 130, column: 32, scope: !1203)
!1206 = !DILocation(line: 130, column: 4, scope: !1203)
!1207 = !DILocation(line: 131, column: 33, scope: !1203)
!1208 = !DILocation(line: 131, column: 39, scope: !1203)
!1209 = !DILocation(line: 131, column: 37, scope: !1203)
!1210 = !DILocation(line: 131, column: 44, scope: !1203)
!1211 = !DILocation(line: 131, column: 29, scope: !1203)
!1212 = !DILocation(line: 132, column: 22, scope: !1203)
!1213 = !DILocation(line: 132, column: 30, scope: !1203)
!1214 = !DILocation(line: 132, column: 27, scope: !1203)
!1215 = !DILocation(line: 132, column: 34, scope: !1203)
!1216 = !DILocation(line: 132, column: 4, scope: !1203)
!1217 = !DILocation(line: 134, column: 2, scope: !895)
!1218 = !DILocation(line: 63, column: 35, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !889, file: !842, discriminator: 2)
!1220 = !DILocation(line: 63, column: 2, scope: !1219)
!1221 = distinct !{!1221, !1222}
!1222 = !DILocation(line: 63, column: 2, scope: !846)
!1223 = !DILocation(line: 136, column: 8, scope: !846)
!1224 = !DILocation(line: 136, column: 13, scope: !846)
!1225 = !DILocation(line: 136, column: 6, scope: !846)
!1226 = !DILocation(line: 137, column: 16, scope: !846)
!1227 = !DILocation(line: 137, column: 2, scope: !846)
!1228 = !DILocation(line: 138, column: 9, scope: !846)
!1229 = !DILocation(line: 138, column: 2, scope: !846)
!1230 = !DILocation(line: 139, column: 1, scope: !846)
!1231 = distinct !DISubprogram(name: "channel_get_nickmode", scope: !842, file: !842, line: 161, type: !1232, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !849)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!369, !334, !329}
!1234 = !DILocalVariable(name: "channel", arg: 1, scope: !1231, file: !842, line: 161, type: !334)
!1235 = !DILocation(line: 161, column: 41, scope: !1231)
!1236 = !DILocalVariable(name: "nick", arg: 2, scope: !1231, file: !842, line: 161, type: !329)
!1237 = !DILocation(line: 161, column: 62, scope: !1231)
!1238 = !DILocation(line: 163, column: 2, scope: !1231)
!1239 = distinct !{!1239, !1238}
!1240 = !DILocation(line: 163, column: 10, scope: !1241)
!1241 = !DILexicalBlockFile(scope: !1242, file: !842, discriminator: 1)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !842, line: 163, column: 10)
!1243 = distinct !DILexicalBlock(scope: !1231, file: !842, line: 163, column: 4)
!1244 = !DILocation(line: 163, column: 15, scope: !1241)
!1245 = !DILocation(line: 163, column: 5, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1247, file: !842, discriminator: 2)
!1247 = distinct !DILexicalBlock(scope: !1242, file: !842, line: 163, column: 3)
!1248 = !DILocation(line: 163, column: 14, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1250, file: !842, discriminator: 3)
!1250 = distinct !DILexicalBlock(scope: !1242, file: !842, line: 163, column: 12)
!1251 = !DILocation(line: 163, column: 99, scope: !1249)
!1252 = !DILocation(line: 163, column: 7, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1243, file: !842, discriminator: 4)
!1254 = !DILocation(line: 165, column: 41, scope: !1231)
!1255 = !DILocation(line: 165, column: 49, scope: !1231)
!1256 = !DILocation(line: 165, column: 41, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1231, file: !842, discriminator: 1)
!1258 = !DILocation(line: 166, column: 20, scope: !1231)
!1259 = !DILocation(line: 166, column: 29, scope: !1231)
!1260 = !DILocation(line: 166, column: 6, scope: !1231)
!1261 = !DILocation(line: 165, column: 41, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1231, file: !842, discriminator: 2)
!1263 = !DILocation(line: 165, column: 41, scope: !1264)
!1264 = !DILexicalBlockFile(scope: !1231, file: !842, discriminator: 3)
!1265 = !DILocation(line: 165, column: 16, scope: !1264)
!1266 = !DILocation(line: 165, column: 9, scope: !1264)
!1267 = !DILocation(line: 167, column: 1, scope: !1231)
!1268 = distinct !DISubprogram(name: "channel_get_nickmode_rec", scope: !842, file: !842, line: 141, type: !1269, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !849)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!369, !732}
!1271 = !DILocalVariable(name: "nickrec", arg: 1, scope: !1268, file: !842, line: 141, type: !732)
!1272 = !DILocation(line: 141, column: 49, scope: !1268)
!1273 = !DILocalVariable(name: "emptystr", scope: !1268, file: !842, line: 143, type: !369)
!1274 = !DILocation(line: 143, column: 15, scope: !1268)
!1275 = !DILocalVariable(name: "nickmode", scope: !1268, file: !842, line: 144, type: !369)
!1276 = !DILocation(line: 144, column: 8, scope: !1268)
!1277 = !DILocation(line: 146, column: 7, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1268, file: !842, line: 146, column: 6)
!1279 = !DILocation(line: 146, column: 6, scope: !1268)
!1280 = !DILocation(line: 147, column: 24, scope: !1278)
!1281 = !DILocation(line: 147, column: 17, scope: !1278)
!1282 = !DILocation(line: 149, column: 20, scope: !1268)
!1283 = !DILocation(line: 149, column: 18, scope: !1268)
!1284 = !DILocation(line: 151, column: 6, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1268, file: !842, line: 151, column: 6)
!1286 = !DILocation(line: 151, column: 14, scope: !1285)
!1287 = !DILocation(line: 151, column: 21, scope: !1285)
!1288 = !DILocation(line: 151, column: 24, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1285, file: !842, discriminator: 1)
!1290 = !DILocation(line: 151, column: 33, scope: !1289)
!1291 = !DILocation(line: 151, column: 45, scope: !1289)
!1292 = !DILocation(line: 151, column: 6, scope: !1289)
!1293 = !DILocation(line: 152, column: 23, scope: !1285)
!1294 = !DILocation(line: 152, column: 14, scope: !1285)
!1295 = !DILocation(line: 152, column: 12, scope: !1285)
!1296 = !DILocation(line: 152, column: 3, scope: !1285)
!1297 = !DILocation(line: 154, column: 14, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1285, file: !842, line: 153, column: 7)
!1299 = !DILocation(line: 154, column: 12, scope: !1298)
!1300 = !DILocation(line: 155, column: 17, scope: !1298)
!1301 = !DILocation(line: 155, column: 26, scope: !1298)
!1302 = !DILocation(line: 155, column: 3, scope: !1298)
!1303 = !DILocation(line: 155, column: 15, scope: !1298)
!1304 = !DILocation(line: 156, column: 3, scope: !1298)
!1305 = !DILocation(line: 156, column: 15, scope: !1298)
!1306 = !DILocation(line: 158, column: 9, scope: !1268)
!1307 = !DILocation(line: 158, column: 2, scope: !1268)
!1308 = !DILocation(line: 159, column: 1, scope: !1268)
!1309 = distinct !DISubprogram(name: "fe_messages_init", scope: !842, file: !842, line: 723, type: !505, isLocal: false, isDefinition: true, scopeLine: 724, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !849)
!1310 = !DILocation(line: 725, column: 15, scope: !1309)
!1311 = !DILocation(line: 725, column: 13, scope: !1309)
!1312 = !DILocation(line: 728, column: 2, scope: !1309)
!1313 = !DILocation(line: 729, column: 2, scope: !1309)
!1314 = !DILocation(line: 730, column: 2, scope: !1309)
!1315 = !DILocation(line: 731, column: 2, scope: !1309)
!1316 = !DILocation(line: 732, column: 2, scope: !1309)
!1317 = !DILocation(line: 733, column: 2, scope: !1309)
!1318 = !DILocation(line: 734, column: 2, scope: !1309)
!1319 = !DILocation(line: 735, column: 2, scope: !1309)
!1320 = !DILocation(line: 736, column: 2, scope: !1309)
!1321 = !DILocation(line: 737, column: 2, scope: !1309)
!1322 = !DILocation(line: 738, column: 2, scope: !1309)
!1323 = !DILocation(line: 740, column: 2, scope: !1309)
!1324 = !DILocation(line: 741, column: 2, scope: !1309)
!1325 = !DILocation(line: 742, column: 2, scope: !1309)
!1326 = !DILocation(line: 743, column: 2, scope: !1309)
!1327 = !DILocation(line: 744, column: 2, scope: !1309)
!1328 = !DILocation(line: 745, column: 2, scope: !1309)
!1329 = !DILocation(line: 746, column: 2, scope: !1309)
!1330 = !DILocation(line: 747, column: 2, scope: !1309)
!1331 = !DILocation(line: 748, column: 2, scope: !1309)
!1332 = !DILocation(line: 749, column: 2, scope: !1309)
!1333 = !DILocation(line: 750, column: 2, scope: !1309)
!1334 = !DILocation(line: 751, column: 2, scope: !1309)
!1335 = !DILocation(line: 753, column: 2, scope: !1309)
!1336 = !DILocation(line: 754, column: 2, scope: !1309)
!1337 = !DILocation(line: 755, column: 2, scope: !1309)
!1338 = !DILocation(line: 756, column: 2, scope: !1309)
!1339 = !DILocation(line: 757, column: 2, scope: !1309)
!1340 = !DILocation(line: 758, column: 1, scope: !1309)
!1341 = distinct !DISubprogram(name: "sig_message_public", scope: !842, file: !842, line: 169, type: !1342, isLocal: true, isDefinition: true, scopeLine: 172, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !849)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{null, !350, !329, !329, !329, !329, !732}
!1344 = !DILocalVariable(name: "server", arg: 1, scope: !1341, file: !842, line: 169, type: !350)
!1345 = !DILocation(line: 169, column: 44, scope: !1341)
!1346 = !DILocalVariable(name: "msg", arg: 2, scope: !1341, file: !842, line: 169, type: !329)
!1347 = !DILocation(line: 169, column: 64, scope: !1341)
!1348 = !DILocalVariable(name: "nick", arg: 3, scope: !1341, file: !842, line: 170, type: !329)
!1349 = !DILocation(line: 170, column: 23, scope: !1341)
!1350 = !DILocalVariable(name: "address", arg: 4, scope: !1341, file: !842, line: 170, type: !329)
!1351 = !DILocation(line: 170, column: 41, scope: !1341)
!1352 = !DILocalVariable(name: "target", arg: 5, scope: !1341, file: !842, line: 171, type: !329)
!1353 = !DILocation(line: 171, column: 23, scope: !1341)
!1354 = !DILocalVariable(name: "nickrec", arg: 6, scope: !1341, file: !842, line: 171, type: !732)
!1355 = !DILocation(line: 171, column: 41, scope: !1341)
!1356 = !DILocalVariable(name: "chanrec", scope: !1341, file: !842, line: 173, type: !334)
!1357 = !DILocation(line: 173, column: 15, scope: !1341)
!1358 = !DILocalVariable(name: "printnick", scope: !1341, file: !842, line: 174, type: !329)
!1359 = !DILocation(line: 174, column: 14, scope: !1341)
!1360 = !DILocalVariable(name: "for_me", scope: !1341, file: !842, line: 175, type: !332)
!1361 = !DILocation(line: 175, column: 6, scope: !1341)
!1362 = !DILocalVariable(name: "print_channel", scope: !1341, file: !842, line: 175, type: !332)
!1363 = !DILocation(line: 175, column: 14, scope: !1341)
!1364 = !DILocalVariable(name: "level", scope: !1341, file: !842, line: 175, type: !332)
!1365 = !DILocation(line: 175, column: 29, scope: !1341)
!1366 = !DILocalVariable(name: "nickmode", scope: !1341, file: !842, line: 176, type: !369)
!1367 = !DILocation(line: 176, column: 8, scope: !1341)
!1368 = !DILocalVariable(name: "color", scope: !1341, file: !842, line: 176, type: !369)
!1369 = !DILocation(line: 176, column: 19, scope: !1341)
!1370 = !DILocalVariable(name: "freemsg", scope: !1341, file: !842, line: 176, type: !369)
!1371 = !DILocation(line: 176, column: 27, scope: !1341)
!1372 = !DILocalVariable(name: "hilight", scope: !1341, file: !842, line: 177, type: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "HILIGHT_REC", file: !1375, line: 48, baseType: !1376)
!1375 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HILIGHT_REC", file: !1377, line: 7, size: 512, align: 64, elements: !1378)
!1377 = !DIFile(filename: "hilight-text.h", directory: "/home/lichi/Desktop/irssi/task1")
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1398}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1376, file: !1377, line: 8, baseType: !369, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !1377, line: 10, baseType: !659, size: 64, align: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1376, file: !1377, line: 11, baseType: !332, size: 32, align: 32, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1376, file: !1377, line: 12, baseType: !369, size: 64, align: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "act_color", scope: !1376, file: !1377, line: 14, baseType: !369, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1376, file: !1377, line: 15, baseType: !332, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !1376, file: !1377, line: 17, baseType: !427, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !1376, file: !1377, line: 18, baseType: !427, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "nickmask", scope: !1376, file: !1377, line: 20, baseType: !427, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
