; ModuleID = './line216-fe-channels.o.i'
source_filename = "./line216-fe-channels.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GHashTable = type opaque
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, {}*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!271 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!272 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!273 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!274 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!275 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!276 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!277 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!278 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!279 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!280 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!281 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!282 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!283 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!284 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!285 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!286 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!287 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!288 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!289 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!290 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!291 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!292 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!293 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!294 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!295 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!296 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!297 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!298 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!299 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!300 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!301 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!302 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!303 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!304 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!305 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!306 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!307 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 25, size: 32, align: 32, elements: !310)
!309 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!311 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!312 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!313 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!314 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!315 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!316 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!317 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!318 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!319 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!320 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!321 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!322 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!323 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!324 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!325 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!326 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!327 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!328 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!329 = !{!330, !331, !342, !347, !381, !399, !336, !680, !476, !690, !717, !414, !341}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareDataFunc", file: !332, line: 82, baseType: !333)
!332 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !338, !338, !341}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !332, line: 49, baseType: !337)
!337 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !332, line: 78, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !332, line: 77, baseType: !330)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !343, line: 9, baseType: !344)
!343 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !339, !339, !339, !339, !339, !339}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !349, line: 111, baseType: !350)
!349 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !351, line: 13, size: 576, align: 64, elements: !352)
!351 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !{!353, !355, !356, !362, !365, !366, !367, !368, !370, !371, !372, !373, !374, !375, !379, !380}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !354, line: 3, baseType: !337, size: 32, align: 32)
!354 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !350, file: !354, line: 4, baseType: !337, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !350, file: !354, line: 6, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !358, line: 75, baseType: !359)
!358 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !360, line: 139, baseType: !361)
!360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!361 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !350, file: !354, line: 8, baseType: !363, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !350, file: !354, line: 9, baseType: !363, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !350, file: !354, line: 10, baseType: !363, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !350, file: !354, line: 11, baseType: !337, size: 32, align: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !350, file: !354, line: 14, baseType: !369, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!369 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !350, file: !354, line: 15, baseType: !369, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !350, file: !354, line: 18, baseType: !369, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !350, file: !354, line: 19, baseType: !369, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !350, file: !354, line: 20, baseType: !369, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !350, file: !354, line: 21, baseType: !369, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !350, file: !354, line: 22, baseType: !376, size: 64, align: 8, offset: 360)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, align: 8, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !350, file: !354, line: 26, baseType: !330, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !354, line: 28, baseType: !347, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !349, line: 117, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !384, line: 28, size: 1280, align: 64, elements: !385)
!384 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!385 = !{!386, !387, !388, !389, !390, !398, !782, !783, !784, !785, !786, !787, !788, !789, !790, !809, !810, !811, !812, !813, !814, !815, !816}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !383, file: !384, line: 29, baseType: !337, size: 32, align: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !384, line: 30, baseType: !363, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !383, file: !384, line: 32, baseType: !337, size: 32, align: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !383, file: !384, line: 32, baseType: !337, size: 32, align: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !383, file: !384, line: 34, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !393, line: 37, baseType: !394)
!393 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !393, line: 39, size: 128, align: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !394, file: !393, line: 41, baseType: !341, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !393, line: 42, baseType: !391, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !383, file: !384, line: 35, baseType: !399, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !349, line: 108, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !402, line: 5, size: 704, align: 64, elements: !403)
!402 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!403 = !{!404, !406, !407, !412, !413, !775, !776, !777, !778, !779, !780, !781}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !401, file: !405, line: 3, baseType: !337, size: 32, align: 32)
!405 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!406 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !401, file: !405, line: 4, baseType: !337, size: 32, align: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !401, file: !405, line: 5, baseType: !408, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !410, line: 37, baseType: !411)
!410 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !410, line: 37, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !401, file: !405, line: 7, baseType: !330, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !401, file: !405, line: 8, baseType: !414, size: 64, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !349, line: 107, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !417, line: 30, size: 2240, align: 64, elements: !418)
!417 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!418 = !{!419, !421, !422, !423, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !656, !657, !661, !662, !663, !667, !668, !669, !670, !671, !672, !673, !674, !675, !682, !683, !684, !685, !686, !692, !696, !700, !704, !708, !713, !763, !770, !774}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !420, line: 3, baseType: !337, size: 32, align: 32)
!420 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !416, file: !420, line: 4, baseType: !337, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !416, file: !420, line: 6, baseType: !337, size: 32, align: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !416, file: !420, line: 8, baseType: !424, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !349, line: 113, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !417, line: 25, size: 1920, align: 64, elements: !427)
!427 = !{!428, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440, !441, !442, !443, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !429, line: 3, baseType: !337, size: 32, align: 32)
!429 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!430 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !426, file: !429, line: 4, baseType: !337, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !426, file: !429, line: 6, baseType: !337, size: 32, align: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !426, file: !429, line: 9, baseType: !363, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !426, file: !429, line: 10, baseType: !337, size: 32, align: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !426, file: !429, line: 11, baseType: !363, size: 64, align: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !426, file: !429, line: 11, baseType: !363, size: 64, align: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !426, file: !429, line: 11, baseType: !363, size: 64, align: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !426, file: !429, line: 13, baseType: !438, size: 16, align: 16, offset: 448)
!438 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !426, file: !429, line: 14, baseType: !363, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !426, file: !429, line: 15, baseType: !363, size: 64, align: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !426, file: !429, line: 16, baseType: !337, size: 32, align: 32, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !426, file: !429, line: 17, baseType: !363, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !426, file: !429, line: 19, baseType: !444, size: 64, align: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !349, line: 99, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !349, line: 99, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !426, file: !429, line: 19, baseType: !444, size: 64, align: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !426, file: !429, line: 21, baseType: !363, size: 64, align: 64, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !426, file: !429, line: 22, baseType: !363, size: 64, align: 64, offset: 960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !426, file: !429, line: 23, baseType: !363, size: 64, align: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !426, file: !429, line: 24, baseType: !363, size: 64, align: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !426, file: !429, line: 26, baseType: !363, size: 64, align: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !426, file: !429, line: 27, baseType: !363, size: 64, align: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !426, file: !429, line: 28, baseType: !363, size: 64, align: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !426, file: !429, line: 29, baseType: !363, size: 64, align: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !426, file: !429, line: 30, baseType: !363, size: 64, align: 64, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !426, file: !429, line: 31, baseType: !363, size: 64, align: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !426, file: !429, line: 32, baseType: !363, size: 64, align: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !426, file: !429, line: 33, baseType: !363, size: 64, align: 64, offset: 1600)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !426, file: !429, line: 35, baseType: !461, size: 64, align: 64, offset: 1664)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !464)
!464 = !{!465, !466, !600, !601, !606, !607, !608, !609, !610, !619, !620, !621, !625, !626, !627, !628, !629, !630, !631, !632}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !463, file: !4, line: 100, baseType: !336, size: 32, align: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !463, file: !4, line: 101, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !470)
!470 = !{!471, !494, !500, !506, !510, !587, !591, !596}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !469, file: !4, line: 133, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!475, !461, !476, !478, !481, !482}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !332, line: 46, baseType: !364)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !479, line: 66, baseType: !480)
!479 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!480 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !485, line: 42, baseType: !486)
!485 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !485, line: 44, size: 128, align: 64, elements: !487)
!487 = !{!488, !492, !493}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !486, file: !485, line: 46, baseType: !489, size: 32, align: 32)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !490, line: 36, baseType: !491)
!490 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !479, line: 45, baseType: !369)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !486, file: !485, line: 47, baseType: !336, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !486, file: !485, line: 48, baseType: !476, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !469, file: !4, line: 138, baseType: !495, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!475, !461, !498, !478, !481, !482}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !469, file: !4, line: 143, baseType: !501, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!475, !461, !504, !505, !482}
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !479, line: 51, baseType: !361)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !469, file: !4, line: 147, baseType: !507, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!475, !461, !482}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !469, file: !4, line: 149, baseType: !511, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !461, !586}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !517)
!517 = !{!518, !519, !540, !569, !571, !575, !576, !577, !578, !579, !580, !581, !582}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !516, file: !16, line: 174, baseType: !341, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !516, file: !16, line: 175, baseType: !520, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !523)
!523 = !{!524, !528, !529}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !522, file: !16, line: 198, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !341}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !522, file: !16, line: 199, baseType: !525, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !522, file: !16, line: 200, baseType: !530, size: 64, align: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !341, !514, !533, !539}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !341}
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !332, line: 50, baseType: !336)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !516, file: !16, line: 177, baseType: !541, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !545)
!545 = !{!546, !551, !555, !559, !563, !564}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !544, file: !16, line: 216, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!538, !514, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !544, file: !16, line: 218, baseType: !552, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!538, !514}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !544, file: !16, line: 219, baseType: !556, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!538, !514, !534, !341}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !544, file: !16, line: 222, baseType: !560, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !514}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !544, file: !16, line: 226, baseType: !534, size: 64, align: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !544, file: !16, line: 227, baseType: !565, size: 64, align: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !516, file: !16, line: 178, baseType: !570, size: 32, align: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !332, line: 55, baseType: !369)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !516, file: !16, line: 180, baseType: !572, size: 64, align: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !574)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !516, file: !16, line: 182, baseType: !336, size: 32, align: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !516, file: !16, line: 183, baseType: !570, size: 32, align: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !516, file: !16, line: 184, baseType: !570, size: 32, align: 32, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !516, file: !16, line: 186, baseType: !391, size: 64, align: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !516, file: !16, line: 188, baseType: !514, size: 64, align: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !16, line: 189, baseType: !514, size: 64, align: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !516, file: !16, line: 191, baseType: !363, size: 64, align: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !516, file: !16, line: 193, baseType: !583, size: 64, align: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !469, file: !4, line: 151, baseType: !588, size: 64, align: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !461}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !469, file: !4, line: 152, baseType: !592, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!475, !461, !595, !482}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !469, file: !4, line: 155, baseType: !597, size: 64, align: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!595, !461}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !463, file: !4, line: 103, baseType: !476, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !463, file: !4, line: 104, baseType: !602, size: 64, align: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !603, line: 77, baseType: !604)
!603 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !603, line: 77, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !463, file: !4, line: 105, baseType: !602, size: 64, align: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !463, file: !4, line: 106, baseType: !476, size: 64, align: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !463, file: !4, line: 107, baseType: !570, size: 32, align: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !463, file: !4, line: 109, baseType: !478, size: 64, align: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !463, file: !4, line: 110, baseType: !611, size: 64, align: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !613, line: 39, baseType: !614)
!613 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !613, line: 41, size: 192, align: 64, elements: !615)
!615 = !{!616, !617, !618}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !614, file: !613, line: 43, baseType: !476, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !614, file: !613, line: 44, baseType: !478, size: 64, align: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !614, file: !613, line: 45, baseType: !478, size: 64, align: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !463, file: !4, line: 111, baseType: !611, size: 64, align: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !463, file: !4, line: 112, baseType: !611, size: 64, align: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !463, file: !4, line: 113, baseType: !622, size: 48, align: 8, offset: 704)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 48, align: 8, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 6)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !463, file: !4, line: 117, baseType: !570, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !463, file: !4, line: 118, baseType: !570, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !463, file: !4, line: 119, baseType: !570, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !463, file: !4, line: 120, baseType: !570, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !463, file: !4, line: 121, baseType: !570, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !463, file: !4, line: 122, baseType: !570, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !463, file: !4, line: 124, baseType: !341, size: 64, align: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !463, file: !4, line: 125, baseType: !341, size: 64, align: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !426, file: !429, line: 38, baseType: !369, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !426, file: !429, line: 39, baseType: !369, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !426, file: !429, line: 40, baseType: !369, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !426, file: !429, line: 41, baseType: !369, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !426, file: !429, line: 42, baseType: !369, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !426, file: !429, line: 43, baseType: !369, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !426, file: !429, line: 44, baseType: !369, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !426, file: !429, line: 45, baseType: !369, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !426, file: !429, line: 46, baseType: !363, size: 64, align: 64, offset: 1792)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !426, file: !429, line: 47, baseType: !363, size: 64, align: 64, offset: 1856)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !416, file: !420, line: 9, baseType: !357, size: 64, align: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !416, file: !420, line: 10, baseType: !357, size: 64, align: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !416, file: !420, line: 12, baseType: !363, size: 64, align: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !416, file: !420, line: 13, baseType: !363, size: 64, align: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !416, file: !420, line: 15, baseType: !369, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !416, file: !420, line: 16, baseType: !369, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !416, file: !420, line: 17, baseType: !369, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !416, file: !420, line: 18, baseType: !369, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !416, file: !420, line: 19, baseType: !369, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !416, file: !420, line: 21, baseType: !653, size: 64, align: 64, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !349, line: 102, baseType: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !349, line: 102, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !416, file: !420, line: 22, baseType: !337, size: 32, align: 32, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !416, file: !420, line: 25, baseType: !658, size: 128, align: 64, offset: 640)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 128, align: 64, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 2)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !416, file: !420, line: 26, baseType: !337, size: 32, align: 32, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !416, file: !420, line: 27, baseType: !337, size: 32, align: 32, offset: 800)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !416, file: !420, line: 29, baseType: !664, size: 64, align: 64, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !349, line: 103, baseType: !666)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !349, line: 103, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !416, file: !420, line: 30, baseType: !408, size: 64, align: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !416, file: !420, line: 32, baseType: !363, size: 64, align: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !416, file: !420, line: 33, baseType: !363, size: 64, align: 64, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !416, file: !420, line: 34, baseType: !363, size: 64, align: 64, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !416, file: !420, line: 35, baseType: !369, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !416, file: !420, line: 36, baseType: !369, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !416, file: !420, line: 37, baseType: !369, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !416, file: !420, line: 38, baseType: !369, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !416, file: !420, line: 40, baseType: !676, size: 128, align: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !332, line: 504, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !332, line: 506, size: 128, align: 64, elements: !678)
!678 = !{!679, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !677, file: !332, line: 508, baseType: !680, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !332, line: 48, baseType: !361)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !677, file: !332, line: 509, baseType: !680, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !416, file: !420, line: 41, baseType: !357, size: 64, align: 64, offset: 1344)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !416, file: !420, line: 42, baseType: !337, size: 32, align: 32, offset: 1408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !416, file: !420, line: 44, baseType: !391, size: 64, align: 64, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !416, file: !420, line: 45, baseType: !391, size: 64, align: 64, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !416, file: !420, line: 53, baseType: !687, size: 64, align: 64, offset: 1600)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !414, !690, !337}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !416, file: !420, line: 55, baseType: !693, size: 64, align: 64, offset: 1664)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!337, !414, !364}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !416, file: !420, line: 57, baseType: !697, size: 64, align: 64, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!337, !414, !690}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !416, file: !420, line: 60, baseType: !701, size: 64, align: 64, offset: 1792)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!690, !414}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !416, file: !420, line: 62, baseType: !705, size: 64, align: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !414, !690, !690, !337}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !416, file: !420, line: 65, baseType: !709, size: 64, align: 64, offset: 1920)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !414, !690, !690}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !416, file: !420, line: 69, baseType: !714, size: 64, align: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !414, !690}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !349, line: 109, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !720, line: 15, size: 1408, align: 64, elements: !721)
!720 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !736, !740, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !405, line: 3, baseType: !337, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !719, file: !405, line: 4, baseType: !337, size: 32, align: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !719, file: !405, line: 5, baseType: !408, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !719, file: !405, line: 7, baseType: !330, size: 64, align: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !719, file: !405, line: 8, baseType: !414, size: 64, align: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !719, file: !405, line: 9, baseType: !363, size: 64, align: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !719, file: !405, line: 10, baseType: !363, size: 64, align: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !719, file: !405, line: 11, baseType: !357, size: 64, align: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !719, file: !405, line: 12, baseType: !337, size: 32, align: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !719, file: !405, line: 13, baseType: !363, size: 64, align: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !719, file: !405, line: 15, baseType: !733, size: 64, align: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !399}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !719, file: !405, line: 17, baseType: !737, size: 64, align: 64, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!690, !399}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !719, file: !741, line: 5, baseType: !363, size: 64, align: 64, offset: 704)
!741 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!742 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !719, file: !741, line: 6, baseType: !363, size: 64, align: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !719, file: !741, line: 7, baseType: !357, size: 64, align: 64, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !719, file: !741, line: 9, baseType: !408, size: 64, align: 64, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !719, file: !741, line: 10, baseType: !347, size: 64, align: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !719, file: !741, line: 12, baseType: !369, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !719, file: !741, line: 13, baseType: !363, size: 64, align: 64, offset: 1088)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !719, file: !741, line: 14, baseType: !337, size: 32, align: 32, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !719, file: !741, line: 15, baseType: !363, size: 64, align: 64, offset: 1216)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !719, file: !741, line: 17, baseType: !369, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !719, file: !741, line: 18, baseType: !369, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !719, file: !741, line: 19, baseType: !369, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !719, file: !741, line: 20, baseType: !369, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !719, file: !741, line: 22, baseType: !369, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !719, file: !741, line: 23, baseType: !369, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !719, file: !741, line: 24, baseType: !369, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !719, file: !741, line: 25, baseType: !369, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !719, file: !741, line: 26, baseType: !369, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !719, file: !741, line: 31, baseType: !760, size: 64, align: 64, offset: 1344)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64, align: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!363, !717}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !416, file: !420, line: 70, baseType: !764, size: 64, align: 64, offset: 2048)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64, align: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!767, !414, !690}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !349, line: 110, baseType: !769)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !349, line: 110, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !416, file: !420, line: 71, baseType: !771, size: 64, align: 64, offset: 2112)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!337, !690, !690}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !416, file: !420, line: 73, baseType: !771, size: 64, align: 64, offset: 2176)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !401, file: !405, line: 9, baseType: !363, size: 64, align: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !405, line: 10, baseType: !363, size: 64, align: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !401, file: !405, line: 11, baseType: !357, size: 64, align: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !401, file: !405, line: 12, baseType: !337, size: 32, align: 32, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !401, file: !405, line: 13, baseType: !363, size: 64, align: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !401, file: !405, line: 15, baseType: !733, size: 64, align: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !401, file: !405, line: 17, baseType: !737, size: 64, align: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !383, file: !384, line: 36, baseType: !414, size: 64, align: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !383, file: !384, line: 37, baseType: !414, size: 64, align: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !383, file: !384, line: 38, baseType: !363, size: 64, align: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !383, file: !384, line: 40, baseType: !337, size: 32, align: 32, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !383, file: !384, line: 41, baseType: !391, size: 64, align: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !383, file: !384, line: 43, baseType: !369, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !383, file: !384, line: 44, baseType: !369, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !383, file: !384, line: 45, baseType: !369, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !383, file: !384, line: 48, baseType: !791, size: 64, align: 64, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !793, line: 14, baseType: !794)
!793 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 6, size: 256, align: 64, elements: !795)
!795 = !{!796, !797, !806, !807, !808}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !793, line: 7, baseType: !363, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !794, file: !793, line: 9, baseType: !798, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !800, line: 37, baseType: !801)
!800 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !800, line: 39, size: 192, align: 64, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !800, line: 41, baseType: !341, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !800, line: 42, baseType: !798, size: 64, align: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !801, file: !800, line: 43, baseType: !798, size: 64, align: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !794, file: !793, line: 10, baseType: !337, size: 32, align: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !794, file: !793, line: 12, baseType: !337, size: 32, align: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !794, file: !793, line: 13, baseType: !337, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !383, file: !384, line: 49, baseType: !363, size: 64, align: 64, offset: 768)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !383, file: !384, line: 51, baseType: !337, size: 32, align: 32, offset: 832)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !383, file: !384, line: 52, baseType: !363, size: 64, align: 64, offset: 896)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !383, file: !384, line: 54, baseType: !357, size: 64, align: 64, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !383, file: !384, line: 55, baseType: !357, size: 64, align: 64, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !383, file: !384, line: 57, baseType: !363, size: 64, align: 64, offset: 1088)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !383, file: !384, line: 58, baseType: !330, size: 64, align: 64, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !383, file: !384, line: 60, baseType: !330, size: 64, align: 64, offset: 1216)
!817 = !{i32 2, !"Dwarf Version", i32 4}
!818 = !{i32 2, !"Debug Info Version", i32 3}
!819 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!820 = distinct !DISubprogram(name: "fe_channels_nicklist", scope: !821, file: !821, line: 467, type: !822, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!821 = !DIFile(filename: "fe-channels.c", directory: "/home/lichi/Desktop/irssi/task1")
!822 = !DISubroutineType(types: !823)
!823 = !{null, !717, !337}
!824 = !{}
!825 = !DILocalVariable(name: "channel", arg: 1, scope: !820, file: !821, line: 467, type: !717)
!826 = !DIExpression()
!827 = !DILocation(line: 467, column: 40, scope: !820)
!828 = !DILocalVariable(name: "flags", arg: 2, scope: !820, file: !821, line: 467, type: !337)
!829 = !DILocation(line: 467, column: 53, scope: !820)
!830 = !DILocalVariable(name: "nick", scope: !820, file: !821, line: 469, type: !347)
!831 = !DILocation(line: 469, column: 12, scope: !820)
!832 = !DILocalVariable(name: "tmp", scope: !820, file: !821, line: 470, type: !391)
!833 = !DILocation(line: 470, column: 10, scope: !820)
!834 = !DILocalVariable(name: "nicklist", scope: !820, file: !821, line: 470, type: !391)
!835 = !DILocation(line: 470, column: 16, scope: !820)
!836 = !DILocalVariable(name: "sorted", scope: !820, file: !821, line: 470, type: !391)
!837 = !DILocation(line: 470, column: 27, scope: !820)
!838 = !DILocalVariable(name: "nicks", scope: !820, file: !821, line: 471, type: !337)
!839 = !DILocation(line: 471, column: 6, scope: !820)
!840 = !DILocalVariable(name: "normal", scope: !820, file: !821, line: 471, type: !337)
!841 = !DILocation(line: 471, column: 13, scope: !820)
!842 = !DILocalVariable(name: "voices", scope: !820, file: !821, line: 471, type: !337)
!843 = !DILocation(line: 471, column: 21, scope: !820)
!844 = !DILocalVariable(name: "halfops", scope: !820, file: !821, line: 471, type: !337)
!845 = !DILocation(line: 471, column: 29, scope: !820)
!846 = !DILocalVariable(name: "ops", scope: !820, file: !821, line: 471, type: !337)
!847 = !DILocation(line: 471, column: 38, scope: !820)
!848 = !DILocalVariable(name: "nick_flags", scope: !820, file: !821, line: 472, type: !690)
!849 = !DILocation(line: 472, column: 14, scope: !820)
!850 = !DILocation(line: 474, column: 42, scope: !820)
!851 = !DILocation(line: 474, column: 36, scope: !820)
!852 = !DILocation(line: 474, column: 26, scope: !820)
!853 = !DILocation(line: 474, column: 17, scope: !820)
!854 = !DILocation(line: 474, column: 8, scope: !820)
!855 = !DILocation(line: 475, column: 31, scope: !820)
!856 = !DILocation(line: 475, column: 13, scope: !820)
!857 = !DILocation(line: 475, column: 11, scope: !820)
!858 = !DILocation(line: 476, column: 9, scope: !820)
!859 = !DILocation(line: 477, column: 15, scope: !820)
!860 = !DILocation(line: 477, column: 24, scope: !820)
!861 = !DILocation(line: 477, column: 32, scope: !820)
!862 = !DILocation(line: 477, column: 47, scope: !820)
!863 = !DILocation(line: 477, column: 56, scope: !820)
!864 = !DILocation(line: 477, column: 13, scope: !820)
!865 = !DILocation(line: 480, column: 13, scope: !866)
!866 = distinct !DILexicalBlock(scope: !820, file: !821, line: 480, column: 2)
!867 = !DILocation(line: 480, column: 11, scope: !866)
!868 = !DILocation(line: 480, column: 7, scope: !866)
!869 = !DILocation(line: 480, column: 23, scope: !870)
!870 = !DILexicalBlockFile(scope: !871, file: !821, discriminator: 1)
!871 = distinct !DILexicalBlock(scope: !866, file: !821, line: 480, column: 2)
!872 = !DILocation(line: 480, column: 27, scope: !870)
!873 = !DILocation(line: 480, column: 2, scope: !870)
!874 = !DILocation(line: 481, column: 10, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !821, line: 480, column: 52)
!876 = !DILocation(line: 481, column: 15, scope: !875)
!877 = !DILocation(line: 481, column: 8, scope: !875)
!878 = !DILocation(line: 483, column: 8, scope: !875)
!879 = !DILocation(line: 484, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !875, file: !821, line: 484, column: 7)
!881 = !DILocation(line: 484, column: 13, scope: !880)
!882 = !DILocation(line: 484, column: 7, scope: !875)
!883 = !DILocation(line: 485, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !880, file: !821, line: 484, column: 17)
!885 = !DILocation(line: 486, column: 9, scope: !886)
!886 = distinct !DILexicalBlock(scope: !884, file: !821, line: 486, column: 8)
!887 = !DILocation(line: 486, column: 15, scope: !886)
!888 = !DILocation(line: 486, column: 23, scope: !886)
!889 = !DILocation(line: 486, column: 8, scope: !884)
!890 = !DILocation(line: 487, column: 33, scope: !886)
!891 = !DILocation(line: 488, column: 3, scope: !884)
!892 = !DILocation(line: 488, column: 14, scope: !893)
!893 = !DILexicalBlockFile(scope: !894, file: !821, discriminator: 1)
!894 = distinct !DILexicalBlock(scope: !880, file: !821, line: 488, column: 14)
!895 = !DILocation(line: 488, column: 20, scope: !893)
!896 = !DILocation(line: 489, column: 11, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !821, line: 488, column: 28)
!898 = !DILocation(line: 490, column: 9, scope: !899)
!899 = distinct !DILexicalBlock(scope: !897, file: !821, line: 490, column: 8)
!900 = !DILocation(line: 490, column: 15, scope: !899)
!901 = !DILocation(line: 490, column: 23, scope: !899)
!902 = !DILocation(line: 490, column: 8, scope: !897)
!903 = !DILocation(line: 491, column: 5, scope: !899)
!904 = !DILocation(line: 492, column: 3, scope: !897)
!905 = !DILocation(line: 492, column: 14, scope: !906)
!906 = !DILexicalBlockFile(scope: !907, file: !821, discriminator: 1)
!907 = distinct !DILexicalBlock(scope: !894, file: !821, line: 492, column: 14)
!908 = !DILocation(line: 492, column: 20, scope: !906)
!909 = !DILocation(line: 493, column: 10, scope: !910)
!910 = distinct !DILexicalBlock(scope: !907, file: !821, line: 492, column: 27)
!911 = !DILocation(line: 494, column: 9, scope: !912)
!912 = distinct !DILexicalBlock(scope: !910, file: !821, line: 494, column: 8)
!913 = !DILocation(line: 494, column: 15, scope: !912)
!914 = !DILocation(line: 494, column: 23, scope: !912)
!915 = !DILocation(line: 494, column: 8, scope: !910)
!916 = !DILocation(line: 495, column: 5, scope: !912)
!917 = !DILocation(line: 496, column: 3, scope: !910)
!918 = !DILocation(line: 497, column: 10, scope: !919)
!919 = distinct !DILexicalBlock(scope: !907, file: !821, line: 496, column: 10)
!920 = !DILocation(line: 498, column: 9, scope: !921)
!921 = distinct !DILexicalBlock(scope: !919, file: !821, line: 498, column: 8)
!922 = !DILocation(line: 498, column: 15, scope: !921)
!923 = !DILocation(line: 498, column: 23, scope: !921)
!924 = !DILocation(line: 498, column: 8, scope: !919)
!925 = !DILocation(line: 499, column: 5, scope: !921)
!926 = !DILocation(line: 502, column: 28, scope: !875)
!927 = !DILocation(line: 502, column: 36, scope: !875)
!928 = !DILocation(line: 502, column: 12, scope: !875)
!929 = !DILocation(line: 502, column: 10, scope: !875)
!930 = !DILocation(line: 503, column: 2, scope: !875)
!931 = !DILocation(line: 480, column: 41, scope: !932)
!932 = !DILexicalBlockFile(scope: !871, file: !821, discriminator: 2)
!933 = !DILocation(line: 480, column: 46, scope: !932)
!934 = !DILocation(line: 480, column: 39, scope: !932)
!935 = !DILocation(line: 480, column: 2, scope: !932)
!936 = distinct !{!936, !937}
!937 = !DILocation(line: 480, column: 2, scope: !820)
!938 = !DILocation(line: 504, column: 15, scope: !820)
!939 = !DILocation(line: 504, column: 2, scope: !820)
!940 = !DILocation(line: 507, column: 34, scope: !820)
!941 = !DILocation(line: 507, column: 87, scope: !820)
!942 = !DILocation(line: 507, column: 11, scope: !820)
!943 = !DILocation(line: 507, column: 9, scope: !820)
!944 = !DILocation(line: 510, column: 14, scope: !945)
!945 = distinct !DILexicalBlock(scope: !820, file: !821, line: 510, column: 13)
!946 = !DILocation(line: 510, column: 20, scope: !945)
!947 = !DILocation(line: 510, column: 28, scope: !945)
!948 = !DILocation(line: 510, column: 13, scope: !820)
!949 = !DILocation(line: 511, column: 40, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !821, line: 510, column: 34)
!951 = !DILocation(line: 511, column: 49, scope: !950)
!952 = !DILocation(line: 511, column: 57, scope: !950)
!953 = !DILocation(line: 511, column: 66, scope: !950)
!954 = !DILocation(line: 511, column: 112, scope: !950)
!955 = !DILocation(line: 511, column: 121, scope: !950)
!956 = !DILocation(line: 511, column: 135, scope: !950)
!957 = !DILocation(line: 511, column: 142, scope: !950)
!958 = !DILocation(line: 511, column: 147, scope: !950)
!959 = !DILocation(line: 511, column: 156, scope: !950)
!960 = !DILocation(line: 511, column: 164, scope: !950)
!961 = !DILocation(line: 511, column: 3, scope: !950)
!962 = !DILocation(line: 515, column: 24, scope: !950)
!963 = !DILocation(line: 515, column: 33, scope: !950)
!964 = !DILocation(line: 515, column: 3, scope: !950)
!965 = !DILocation(line: 516, column: 2, scope: !950)
!966 = !DILocation(line: 517, column: 15, scope: !820)
!967 = !DILocation(line: 517, column: 2, scope: !820)
!968 = !DILocation(line: 519, column: 39, scope: !820)
!969 = !DILocation(line: 519, column: 48, scope: !820)
!970 = !DILocation(line: 519, column: 56, scope: !820)
!971 = !DILocation(line: 519, column: 65, scope: !820)
!972 = !DILocation(line: 519, column: 118, scope: !820)
!973 = !DILocation(line: 519, column: 127, scope: !820)
!974 = !DILocation(line: 519, column: 141, scope: !820)
!975 = !DILocation(line: 519, column: 148, scope: !820)
!976 = !DILocation(line: 519, column: 153, scope: !820)
!977 = !DILocation(line: 519, column: 162, scope: !820)
!978 = !DILocation(line: 519, column: 170, scope: !820)
!979 = !DILocation(line: 519, column: 2, scope: !820)
!980 = !DILocation(line: 522, column: 1, scope: !820)
!981 = distinct !DISubprogram(name: "display_sorted_nicks", scope: !821, file: !821, line: 349, type: !982, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !717, !391}
!984 = !DILocalVariable(name: "channel", arg: 1, scope: !981, file: !821, line: 349, type: !717)
!985 = !DILocation(line: 349, column: 47, scope: !981)
!986 = !DILocalVariable(name: "nicklist", arg: 2, scope: !981, file: !821, line: 349, type: !391)
!987 = !DILocation(line: 349, column: 64, scope: !981)
!988 = !DILocalVariable(name: "window", scope: !981, file: !821, line: 351, type: !381)
!989 = !DILocation(line: 351, column: 14, scope: !981)
!990 = !DILocalVariable(name: "dest", scope: !981, file: !821, line: 352, type: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !992, line: 62, baseType: !993)
!992 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !992, line: 50, size: 576, align: 64, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !993, file: !992, line: 51, baseType: !381, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !993, file: !992, line: 52, baseType: !414, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !993, file: !992, line: 53, baseType: !690, size: 64, align: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !993, file: !992, line: 54, baseType: !690, size: 64, align: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !993, file: !992, line: 55, baseType: !690, size: 64, align: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !993, file: !992, line: 56, baseType: !690, size: 64, align: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !993, file: !992, line: 57, baseType: !337, size: 32, align: 32, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_priority", scope: !993, file: !992, line: 59, baseType: !337, size: 32, align: 32, offset: 416)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !993, file: !992, line: 60, baseType: !363, size: 64, align: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !992, line: 61, baseType: !337, size: 32, align: 32, offset: 512)
!1005 = !DILocation(line: 352, column: 16, scope: !981)
!1006 = !DILocalVariable(name: "str", scope: !981, file: !821, line: 353, type: !611)
!1007 = !DILocation(line: 353, column: 11, scope: !981)
!1008 = !DILocalVariable(name: "tmp", scope: !981, file: !821, line: 354, type: !391)
!1009 = !DILocation(line: 354, column: 10, scope: !981)
!1010 = !DILocalVariable(name: "format", scope: !981, file: !821, line: 355, type: !363)
!1011 = !DILocation(line: 355, column: 8, scope: !981)
!1012 = !DILocalVariable(name: "stripped", scope: !981, file: !821, line: 355, type: !363)
!1013 = !DILocation(line: 355, column: 17, scope: !981)
!1014 = !DILocalVariable(name: "prefix_format", scope: !981, file: !821, line: 355, type: !363)
!1015 = !DILocation(line: 355, column: 28, scope: !981)
!1016 = !DILocalVariable(name: "aligned_nick", scope: !981, file: !821, line: 356, type: !363)
!1017 = !DILocation(line: 356, column: 8, scope: !981)
!1018 = !DILocalVariable(name: "nickmode", scope: !981, file: !821, line: 356, type: !1019)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 16, align: 8, elements: !659)
!1020 = !DILocation(line: 356, column: 22, scope: !981)
!1021 = !DILocalVariable(name: "columns", scope: !981, file: !821, line: 357, type: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!1023 = !DILocation(line: 357, column: 7, scope: !981)
!1024 = !DILocalVariable(name: "cols", scope: !981, file: !821, line: 357, type: !337)
!1025 = !DILocation(line: 357, column: 16, scope: !981)
!1026 = !DILocalVariable(name: "rows", scope: !981, file: !821, line: 357, type: !337)
!1027 = !DILocation(line: 357, column: 22, scope: !981)
!1028 = !DILocalVariable(name: "last_col_rows", scope: !981, file: !821, line: 357, type: !337)
!1029 = !DILocation(line: 357, column: 28, scope: !981)
!1030 = !DILocalVariable(name: "col", scope: !981, file: !821, line: 357, type: !337)
!1031 = !DILocation(line: 357, column: 43, scope: !981)
!1032 = !DILocalVariable(name: "row", scope: !981, file: !821, line: 357, type: !337)
!1033 = !DILocation(line: 357, column: 48, scope: !981)
!1034 = !DILocalVariable(name: "max_width", scope: !981, file: !821, line: 357, type: !337)
!1035 = !DILocation(line: 357, column: 53, scope: !981)
!1036 = !DILocalVariable(name: "item_extra", scope: !981, file: !821, line: 358, type: !337)
!1037 = !DILocation(line: 358, column: 6, scope: !981)
!1038 = !DILocalVariable(name: "formatnum", scope: !981, file: !821, line: 358, type: !337)
!1039 = !DILocation(line: 358, column: 18, scope: !981)
!1040 = !DILocation(line: 360, column: 31, scope: !981)
!1041 = !DILocation(line: 360, column: 40, scope: !981)
!1042 = !DILocation(line: 360, column: 48, scope: !981)
!1043 = !DILocation(line: 360, column: 57, scope: !981)
!1044 = !DILocation(line: 360, column: 11, scope: !981)
!1045 = !DILocation(line: 360, column: 9, scope: !981)
!1046 = !DILocation(line: 362, column: 14, scope: !981)
!1047 = !DILocation(line: 362, column: 22, scope: !981)
!1048 = !DILocation(line: 362, column: 12, scope: !981)
!1049 = !DILocation(line: 366, column: 27, scope: !981)
!1050 = !DILocation(line: 366, column: 36, scope: !981)
!1051 = !DILocation(line: 366, column: 44, scope: !981)
!1052 = !DILocation(line: 366, column: 53, scope: !981)
!1053 = !DILocation(line: 365, column: 11, scope: !981)
!1054 = !DILocation(line: 365, column: 9, scope: !981)
!1055 = !DILocation(line: 368, column: 25, scope: !981)
!1056 = !DILocation(line: 368, column: 13, scope: !981)
!1057 = !DILocation(line: 368, column: 11, scope: !981)
!1058 = !DILocation(line: 369, column: 22, scope: !981)
!1059 = !DILocation(line: 369, column: 15, scope: !981)
!1060 = !DILocation(line: 369, column: 13, scope: !981)
!1061 = !DILocation(line: 370, column: 9, scope: !981)
!1062 = !DILocation(line: 370, column: 2, scope: !981)
!1063 = !DILocation(line: 371, column: 9, scope: !981)
!1064 = !DILocation(line: 371, column: 2, scope: !981)
!1065 = !DILocation(line: 373, column: 6, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !981, file: !821, line: 373, column: 6)
!1067 = !DILocation(line: 373, column: 42, scope: !1066)
!1068 = !DILocation(line: 373, column: 46, scope: !1066)
!1069 = !DILocation(line: 374, column: 6, scope: !1066)
!1070 = !DILocation(line: 374, column: 44, scope: !1066)
!1071 = !DILocation(line: 374, column: 42, scope: !1066)
!1072 = !DILocation(line: 373, column: 6, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !981, file: !821, discriminator: 1)
!1074 = !DILocation(line: 375, column: 15, scope: !1066)
!1075 = !DILocation(line: 375, column: 13, scope: !1066)
!1076 = !DILocation(line: 375, column: 3, scope: !1066)
!1077 = !DILocation(line: 378, column: 28, scope: !981)
!1078 = !DILocation(line: 378, column: 37, scope: !981)
!1079 = !DILocation(line: 378, column: 45, scope: !981)
!1080 = !DILocation(line: 378, column: 54, scope: !981)
!1081 = !DILocation(line: 378, column: 2, scope: !981)
!1082 = !DILocation(line: 380, column: 33, scope: !981)
!1083 = !DILocation(line: 380, column: 55, scope: !981)
!1084 = !DILocation(line: 380, column: 11, scope: !1073)
!1085 = !DILocation(line: 380, column: 9, scope: !981)
!1086 = !DILocation(line: 381, column: 6, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !981, file: !821, line: 381, column: 6)
!1088 = !DILocation(line: 381, column: 13, scope: !1087)
!1089 = !DILocation(line: 381, column: 6, scope: !981)
!1090 = !DILocation(line: 382, column: 26, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1087, file: !821, line: 381, column: 21)
!1092 = !DILocation(line: 382, column: 14, scope: !1091)
!1093 = !DILocation(line: 382, column: 12, scope: !1091)
!1094 = !DILocation(line: 383, column: 23, scope: !1091)
!1095 = !DILocation(line: 383, column: 16, scope: !1091)
!1096 = !DILocation(line: 383, column: 13, scope: !1091)
!1097 = !DILocation(line: 384, column: 10, scope: !1091)
!1098 = !DILocation(line: 384, column: 3, scope: !1091)
!1099 = !DILocation(line: 385, column: 10, scope: !1091)
!1100 = !DILocation(line: 385, column: 3, scope: !1091)
!1101 = !DILocation(line: 386, column: 2, scope: !1091)
!1102 = !DILocation(line: 390, column: 34, scope: !981)
!1103 = !DILocation(line: 390, column: 43, scope: !981)
!1104 = !DILocation(line: 390, column: 51, scope: !981)
!1105 = !DILocation(line: 390, column: 60, scope: !981)
!1106 = !DILocation(line: 392, column: 34, scope: !981)
!1107 = !DILocation(line: 392, column: 43, scope: !981)
!1108 = !DILocation(line: 389, column: 18, scope: !981)
!1109 = !DILocation(line: 389, column: 16, scope: !981)
!1110 = !DILocation(line: 393, column: 6, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !981, file: !821, line: 393, column: 6)
!1112 = !DILocation(line: 393, column: 20, scope: !1111)
!1113 = !DILocation(line: 393, column: 6, scope: !981)
!1114 = !DILocation(line: 394, column: 26, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !821, line: 393, column: 28)
!1116 = !DILocation(line: 394, column: 14, scope: !1115)
!1117 = !DILocation(line: 394, column: 12, scope: !1115)
!1118 = !DILocation(line: 395, column: 23, scope: !1115)
!1119 = !DILocation(line: 395, column: 16, scope: !1115)
!1120 = !DILocation(line: 395, column: 13, scope: !1115)
!1121 = !DILocation(line: 396, column: 10, scope: !1115)
!1122 = !DILocation(line: 396, column: 3, scope: !1115)
!1123 = !DILocation(line: 397, column: 2, scope: !1115)
!1124 = !DILocation(line: 399, column: 6, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !981, file: !821, line: 399, column: 6)
!1126 = !DILocation(line: 399, column: 16, scope: !1125)
!1127 = !DILocation(line: 399, column: 6, scope: !981)
!1128 = !DILocation(line: 402, column: 13, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !821, line: 399, column: 22)
!1130 = !DILocation(line: 403, column: 2, scope: !1129)
!1131 = !DILocation(line: 406, column: 30, scope: !981)
!1132 = !DILocation(line: 406, column: 57, scope: !981)
!1133 = !DILocation(line: 407, column: 30, scope: !981)
!1134 = !DILocation(line: 408, column: 30, scope: !981)
!1135 = !DILocation(line: 406, column: 9, scope: !981)
!1136 = !DILocation(line: 406, column: 7, scope: !981)
!1137 = !DILocation(line: 409, column: 31, scope: !981)
!1138 = !DILocation(line: 409, column: 41, scope: !981)
!1139 = !DILocation(line: 409, column: 13, scope: !981)
!1140 = !DILocation(line: 409, column: 11, scope: !981)
!1141 = !DILocation(line: 412, column: 18, scope: !981)
!1142 = !DILocation(line: 412, column: 24, scope: !981)
!1143 = !DILocation(line: 412, column: 29, scope: !981)
!1144 = !DILocation(line: 412, column: 28, scope: !981)
!1145 = !DILocation(line: 412, column: 49, scope: !981)
!1146 = !DILocation(line: 412, column: 34, scope: !981)
!1147 = !DILocation(line: 412, column: 33, scope: !981)
!1148 = !DILocation(line: 412, column: 22, scope: !981)
!1149 = !DILocation(line: 412, column: 16, scope: !981)
!1150 = !DILocation(line: 413, column: 6, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !981, file: !821, line: 413, column: 6)
!1152 = !DILocation(line: 413, column: 20, scope: !1151)
!1153 = !DILocation(line: 413, column: 6, scope: !981)
!1154 = !DILocation(line: 414, column: 19, scope: !1151)
!1155 = !DILocation(line: 414, column: 17, scope: !1151)
!1156 = !DILocation(line: 414, column: 3, scope: !1151)
!1157 = !DILocation(line: 416, column: 21, scope: !981)
!1158 = !DILocation(line: 416, column: 8, scope: !981)
!1159 = !DILocation(line: 416, column: 6, scope: !981)
!1160 = !DILocation(line: 418, column: 6, scope: !981)
!1161 = !DILocation(line: 418, column: 15, scope: !981)
!1162 = !DILocation(line: 419, column: 13, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !981, file: !821, line: 419, column: 2)
!1164 = !DILocation(line: 419, column: 11, scope: !1163)
!1165 = !DILocation(line: 419, column: 7, scope: !1163)
!1166 = !DILocation(line: 419, column: 23, scope: !1167)
!1167 = !DILexicalBlockFile(scope: !1168, file: !821, discriminator: 1)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !821, line: 419, column: 2)
!1169 = !DILocation(line: 419, column: 27, scope: !1167)
!1170 = !DILocation(line: 419, column: 2, scope: !1167)
!1171 = !DILocalVariable(name: "rec", scope: !1172, file: !821, line: 420, type: !347)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !821, line: 419, column: 52)
!1173 = !DILocation(line: 420, column: 13, scope: !1172)
!1174 = !DILocation(line: 420, column: 19, scope: !1172)
!1175 = !DILocation(line: 420, column: 24, scope: !1172)
!1176 = !DILocation(line: 422, column: 7, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !821, line: 422, column: 7)
!1178 = !DILocation(line: 422, column: 12, scope: !1177)
!1179 = !DILocation(line: 422, column: 7, scope: !1172)
!1180 = !DILocation(line: 423, column: 18, scope: !1177)
!1181 = !DILocation(line: 423, column: 23, scope: !1177)
!1182 = !DILocation(line: 423, column: 4, scope: !1177)
!1183 = !DILocation(line: 423, column: 16, scope: !1177)
!1184 = !DILocation(line: 425, column: 4, scope: !1177)
!1185 = !DILocation(line: 425, column: 16, scope: !1177)
!1186 = !DILocation(line: 427, column: 32, scope: !1172)
!1187 = !DILocation(line: 427, column: 37, scope: !1172)
!1188 = !DILocation(line: 428, column: 40, scope: !1172)
!1189 = !DILocation(line: 428, column: 32, scope: !1172)
!1190 = !DILocation(line: 428, column: 45, scope: !1172)
!1191 = !DILocation(line: 428, column: 44, scope: !1172)
!1192 = !DILocation(line: 427, column: 18, scope: !1172)
!1193 = !DILocation(line: 427, column: 16, scope: !1172)
!1194 = !DILocation(line: 431, column: 15, scope: !1172)
!1195 = !DILocation(line: 431, column: 20, scope: !1172)
!1196 = !DILocation(line: 431, column: 15, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1172, file: !821, discriminator: 1)
!1198 = !DILocation(line: 432, column: 15, scope: !1172)
!1199 = !DILocation(line: 432, column: 20, scope: !1172)
!1200 = !DILocation(line: 432, column: 15, scope: !1197)
!1201 = !DILocation(line: 433, column: 15, scope: !1172)
!1202 = !DILocation(line: 433, column: 20, scope: !1172)
!1203 = !DILocation(line: 432, column: 15, scope: !1204)
!1204 = !DILexicalBlockFile(scope: !1172, file: !821, discriminator: 2)
!1205 = !DILocation(line: 432, column: 15, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1172, file: !821, discriminator: 3)
!1207 = !DILocation(line: 431, column: 15, scope: !1204)
!1208 = !DILocation(line: 431, column: 15, scope: !1206)
!1209 = !DILocation(line: 431, column: 13, scope: !1206)
!1210 = !DILocation(line: 436, column: 28, scope: !1172)
!1211 = !DILocation(line: 436, column: 37, scope: !1172)
!1212 = !DILocation(line: 437, column: 28, scope: !1172)
!1213 = !DILocation(line: 437, column: 37, scope: !1172)
!1214 = !DILocation(line: 438, column: 28, scope: !1172)
!1215 = !DILocation(line: 438, column: 39, scope: !1172)
!1216 = !DILocation(line: 438, column: 49, scope: !1172)
!1217 = !DILocation(line: 435, column: 12, scope: !1172)
!1218 = !DILocation(line: 435, column: 10, scope: !1172)
!1219 = !DILocation(line: 439, column: 19, scope: !1172)
!1220 = !DILocation(line: 439, column: 24, scope: !1172)
!1221 = !DILocation(line: 439, column: 3, scope: !1172)
!1222 = !DILocation(line: 440, column: 10, scope: !1172)
!1223 = !DILocation(line: 440, column: 3, scope: !1172)
!1224 = !DILocation(line: 441, column: 10, scope: !1172)
!1225 = !DILocation(line: 441, column: 3, scope: !1172)
!1226 = !DILocation(line: 443, column: 7, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1172, file: !821, line: 443, column: 7)
!1228 = !DILocation(line: 443, column: 16, scope: !1227)
!1229 = !DILocation(line: 443, column: 13, scope: !1227)
!1230 = !DILocation(line: 443, column: 7, scope: !1172)
!1231 = !DILocation(line: 444, column: 14, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1227, file: !821, line: 443, column: 22)
!1233 = !DILocation(line: 444, column: 23, scope: !1232)
!1234 = !DILocation(line: 444, column: 31, scope: !1232)
!1235 = !DILocation(line: 444, column: 40, scope: !1232)
!1236 = !DILocation(line: 445, column: 41, scope: !1232)
!1237 = !DILocation(line: 445, column: 46, scope: !1232)
!1238 = !DILocation(line: 444, column: 4, scope: !1232)
!1239 = !DILocation(line: 446, column: 22, scope: !1232)
!1240 = !DILocation(line: 446, column: 4, scope: !1232)
!1241 = !DILocation(line: 447, column: 8, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1232, file: !821, line: 447, column: 8)
!1243 = !DILocation(line: 447, column: 22, scope: !1242)
!1244 = !DILocation(line: 447, column: 8, scope: !1232)
!1245 = !DILocation(line: 448, column: 21, scope: !1242)
!1246 = !DILocation(line: 448, column: 26, scope: !1242)
!1247 = !DILocation(line: 448, column: 5, scope: !1242)
!1248 = !DILocation(line: 449, column: 8, scope: !1232)
!1249 = !DILocation(line: 449, column: 16, scope: !1232)
!1250 = !DILocation(line: 451, column: 8, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1232, file: !821, line: 451, column: 8)
!1252 = !DILocation(line: 451, column: 15, scope: !1251)
!1253 = !DILocation(line: 451, column: 12, scope: !1251)
!1254 = !DILocation(line: 451, column: 8, scope: !1232)
!1255 = !DILocation(line: 452, column: 9, scope: !1251)
!1256 = !DILocation(line: 452, column: 5, scope: !1251)
!1257 = !DILocation(line: 453, column: 3, scope: !1232)
!1258 = !DILocation(line: 454, column: 2, scope: !1172)
!1259 = !DILocation(line: 419, column: 41, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1168, file: !821, discriminator: 2)
!1261 = !DILocation(line: 419, column: 46, scope: !1260)
!1262 = !DILocation(line: 419, column: 39, scope: !1260)
!1263 = !DILocation(line: 419, column: 2, scope: !1260)
!1264 = distinct !{!1264, !1265}
!1265 = !DILocation(line: 419, column: 2, scope: !981)
!1266 = !DILocation(line: 456, column: 6, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !981, file: !821, line: 456, column: 6)
!1268 = !DILocation(line: 456, column: 20, scope: !1267)
!1269 = !DILocation(line: 456, column: 27, scope: !1267)
!1270 = !DILocation(line: 456, column: 30, scope: !1271)
!1271 = !DILexicalBlockFile(scope: !1267, file: !821, discriminator: 1)
!1272 = !DILocation(line: 456, column: 35, scope: !1271)
!1273 = !DILocation(line: 456, column: 48, scope: !1271)
!1274 = !DILocation(line: 456, column: 41, scope: !1271)
!1275 = !DILocation(line: 456, column: 39, scope: !1271)
!1276 = !DILocation(line: 456, column: 6, scope: !1271)
!1277 = !DILocation(line: 457, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1267, file: !821, line: 456, column: 64)
!1279 = !DILocation(line: 457, column: 22, scope: !1278)
!1280 = !DILocation(line: 457, column: 30, scope: !1278)
!1281 = !DILocation(line: 457, column: 39, scope: !1278)
!1282 = !DILocation(line: 458, column: 40, scope: !1278)
!1283 = !DILocation(line: 458, column: 45, scope: !1278)
!1284 = !DILocation(line: 457, column: 3, scope: !1278)
!1285 = !DILocation(line: 459, column: 2, scope: !1278)
!1286 = !DILocation(line: 461, column: 15, scope: !981)
!1287 = !DILocation(line: 461, column: 2, scope: !981)
!1288 = !DILocation(line: 462, column: 16, scope: !981)
!1289 = !DILocation(line: 462, column: 2, scope: !981)
!1290 = !DILocation(line: 463, column: 9, scope: !981)
!1291 = !DILocation(line: 463, column: 2, scope: !981)
!1292 = !DILocation(line: 464, column: 9, scope: !981)
!1293 = !DILocation(line: 464, column: 2, scope: !981)
!1294 = !DILocation(line: 465, column: 1, scope: !981)
!1295 = distinct !DISubprogram(name: "fe_channels_init", scope: !821, file: !821, line: 624, type: !567, isLocal: false, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1296 = !DILocation(line: 626, column: 2, scope: !1295)
!1297 = !DILocation(line: 627, column: 2, scope: !1295)
!1298 = !DILocation(line: 628, column: 2, scope: !1295)
!1299 = !DILocation(line: 629, column: 2, scope: !1295)
!1300 = !DILocation(line: 631, column: 2, scope: !1295)
!1301 = !DILocation(line: 632, column: 2, scope: !1295)
!1302 = !DILocation(line: 633, column: 2, scope: !1295)
!1303 = !DILocation(line: 634, column: 2, scope: !1295)
!1304 = !DILocation(line: 635, column: 2, scope: !1295)
!1305 = !DILocation(line: 637, column: 2, scope: !1295)
!1306 = !DILocation(line: 638, column: 2, scope: !1295)
!1307 = !DILocation(line: 639, column: 2, scope: !1295)
!1308 = !DILocation(line: 640, column: 2, scope: !1295)
!1309 = !DILocation(line: 641, column: 2, scope: !1295)
!1310 = !DILocation(line: 642, column: 2, scope: !1295)
!1311 = !DILocation(line: 643, column: 2, scope: !1295)
!1312 = !DILocation(line: 644, column: 2, scope: !1295)
!1313 = !DILocation(line: 646, column: 2, scope: !1295)
!1314 = !DILocation(line: 647, column: 2, scope: !1295)
!1315 = !DILocation(line: 648, column: 2, scope: !1295)
!1316 = !DILocation(line: 649, column: 2, scope: !1295)
!1317 = !DILocation(line: 650, column: 1, scope: !1295)
!1318 = distinct !DISubprogram(name: "signal_channel_created", scope: !821, file: !821, line: 44, type: !1319, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{null, !717, !330}
!1321 = !DILocalVariable(name: "channel", arg: 1, scope: !1318, file: !821, line: 44, type: !717)
!1322 = !DILocation(line: 44, column: 49, scope: !1318)
!1323 = !DILocalVariable(name: "automatic", arg: 2, scope: !1318, file: !821, line: 44, type: !330)
!1324 = !DILocation(line: 44, column: 64, scope: !1318)
!1325 = !DILocation(line: 46, column: 40, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1318, file: !821, line: 46, column: 6)
!1327 = !DILocation(line: 46, column: 51, scope: !1326)
!1328 = !DILocation(line: 46, column: 7, scope: !1326)
!1329 = !DILocation(line: 46, column: 59, scope: !1326)
!1330 = !DILocation(line: 46, column: 6, scope: !1318)
!1331 = !DILocation(line: 47, column: 38, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1326, file: !821, line: 46, column: 42)
!1333 = !DILocation(line: 47, column: 22, scope: !1332)
!1334 = !DILocation(line: 48, column: 25, scope: !1332)
!1335 = !DILocation(line: 48, column: 16, scope: !1332)
!1336 = !DILocation(line: 48, column: 9, scope: !1332)
!1337 = !DILocation(line: 47, column: 3, scope: !1332)
!1338 = !DILocation(line: 49, column: 2, scope: !1332)
!1339 = !DILocation(line: 50, column: 1, scope: !1318)
!1340 = distinct !DISubprogram(name: "signal_channel_destroyed", scope: !821, file: !821, line: 59, type: !1341, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{null, !717}
!1343 = !DILocalVariable(name: "channel", arg: 1, scope: !1340, file: !821, line: 59, type: !717)
!1344 = !DILocation(line: 59, column: 51, scope: !1340)
!1345 = !DILocalVariable(name: "window", scope: !1340, file: !821, line: 61, type: !381)
!1346 = !DILocation(line: 61, column: 14, scope: !1340)
!1347 = !DILocation(line: 63, column: 2, scope: !1340)
!1348 = distinct !{!1348, !1347}
!1349 = !DILocation(line: 63, column: 10, scope: !1350)
!1350 = !DILexicalBlockFile(scope: !1351, file: !821, discriminator: 1)
!1351 = distinct !DILexicalBlock(scope: !1352, file: !821, line: 63, column: 10)
!1352 = distinct !DILexicalBlock(scope: !1340, file: !821, line: 63, column: 4)
!1353 = !DILocation(line: 63, column: 18, scope: !1350)
!1354 = !DILocation(line: 63, column: 5, scope: !1355)
!1355 = !DILexicalBlockFile(scope: !1356, file: !821, discriminator: 2)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !821, line: 63, column: 3)
!1357 = !DILocation(line: 63, column: 14, scope: !1358)
!1358 = !DILexicalBlockFile(scope: !1359, file: !821, discriminator: 3)
!1359 = distinct !DILexicalBlock(scope: !1351, file: !821, line: 63, column: 12)
!1360 = !DILocation(line: 63, column: 102, scope: !1358)
!1361 = !DILocation(line: 63, column: 113, scope: !1362)
!1362 = !DILexicalBlockFile(scope: !1352, file: !821, discriminator: 4)
!1363 = !DILocation(line: 65, column: 61, scope: !1340)
!1364 = !DILocation(line: 65, column: 72, scope: !1340)
!1365 = !DILocation(line: 65, column: 12, scope: !1340)
!1366 = !DILocation(line: 65, column: 9, scope: !1340)
!1367 = !DILocation(line: 66, column: 6, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1340, file: !821, line: 66, column: 6)
!1369 = !DILocation(line: 66, column: 13, scope: !1368)
!1370 = !DILocation(line: 66, column: 6, scope: !1340)
!1371 = !DILocation(line: 67, column: 3, scope: !1368)
!1372 = !DILocation(line: 69, column: 38, scope: !1340)
!1373 = !DILocation(line: 69, column: 22, scope: !1340)
!1374 = !DILocation(line: 69, column: 2, scope: !1340)
!1375 = !DILocation(line: 71, column: 6, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1340, file: !821, line: 71, column: 6)
!1377 = !DILocation(line: 71, column: 15, scope: !1376)
!1378 = !DILocation(line: 71, column: 22, scope: !1376)
!1379 = !DILocation(line: 71, column: 26, scope: !1380)
!1380 = !DILexicalBlockFile(scope: !1376, file: !821, discriminator: 1)
!1381 = !DILocation(line: 71, column: 35, scope: !1380)
!1382 = !DILocation(line: 71, column: 40, scope: !1380)
!1383 = !DILocation(line: 72, column: 7, scope: !1376)
!1384 = !DILocation(line: 72, column: 16, scope: !1376)
!1385 = !DILocation(line: 72, column: 24, scope: !1376)
!1386 = !DILocation(line: 71, column: 6, scope: !1387)
!1387 = !DILexicalBlockFile(scope: !1340, file: !821, discriminator: 2)
!1388 = !DILocation(line: 74, column: 19, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1376, file: !821, line: 72, column: 38)
!1390 = !DILocation(line: 74, column: 27, scope: !1389)
!1391 = !DILocation(line: 74, column: 36, scope: !1389)
!1392 = !DILocation(line: 74, column: 44, scope: !1389)
!1393 = !DILocation(line: 75, column: 5, scope: !1389)
!1394 = !DILocation(line: 75, column: 14, scope: !1389)
!1395 = !DILocation(line: 74, column: 3, scope: !1389)
!1396 = !DILocation(line: 76, column: 2, scope: !1389)
!1397 = !DILocation(line: 76, column: 14, scope: !1398)
!1398 = !DILexicalBlockFile(scope: !1399, file: !821, discriminator: 1)
!1399 = distinct !DILexicalBlock(scope: !1376, file: !821, line: 76, column: 13)
!1400 = !DILocation(line: 76, column: 23, scope: !1398)
!1401 = !DILocation(line: 76, column: 30, scope: !1398)
!1402 = !DILocation(line: 76, column: 33, scope: !1403)
!1403 = !DILexicalBlockFile(scope: !1399, file: !821, discriminator: 2)
!1404 = !DILocation(line: 76, column: 42, scope: !1403)
!1405 = !DILocation(line: 76, column: 13, scope: !1403)
!1406 = !DILocation(line: 77, column: 23, scope: !1399)
!1407 = !DILocation(line: 77, column: 3, scope: !1399)
!1408 = !DILocation(line: 78, column: 1, scope: !1340)
!1409 = distinct !DISubprogram(name: "signal_window_item_changed", scope: !821, file: !821, line: 95, type: !1410, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !824)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{null, !381, !399}
!1412 = !DILocalVariable(name: "window", arg: 1, scope: !1409, file: !821, line: 95, type: !381)
!1413 = !DILocation(line: 95, column: 52, scope: !1409)
!1414 = !DILocalVariable(name: "item", arg: 2, scope: !1409, file: !821, line: 95, type: !399)
!1415 = !DILocation(line: 95, column: 73, scope: !1409)
!1416 = !DILocation(line: 97, column: 2, scope: !1409)
!1417 = distinct !{!1417, !1416}
!1418 = !DILocation(line: 97, column: 10, scope: !1419)
!1419 = !DILexicalBlockFile(scope: !1420, file: !821, discriminator: 1)
!1420 = distinct !DILexicalBlock(scope: !1421, file: !821, line: 97, column: 10)
!1421 = distinct !DILexicalBlock(scope: !1409, file: !821, line: 97, column: 4)
!1422 = !DILocation(line: 97, column: 17, scope: !1419)
!1423 = !DILocation(line: 97, column: 5, scope: !1424)
!1424 = !DILexicalBlockFile(scope: !1425, file: !821, discriminator: 2)
!1425 = distinct !DILexicalBlock(scope: !1420, file: !821, line: 97, column: 3)
!1426 = !DILocation(line: 97, column: 14, scope: !1427)
!1427 = !DILexicalBlockFile(scope: !1428, file: !821, discriminator: 3)
