; ModuleID = './line65-nickmatch-cache.o.i'
source_filename = "./line65-nickmatch-cache.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.NICKMATCH_REC = type { %struct._GHashTable*, void (%struct._GHashTable*, %struct._CHANNEL_REC*, %struct._NICK_REC*)* }
%struct._GHashTable = type opaque
%struct._CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)* }
%struct._SERVER_REC = type opaque
%struct._WI_ITEM_REC = type opaque
%struct._NICK_REC = type { i32, i32, i64, i8*, i8*, i8*, i32, i8, [8 x i8], i8*, %struct._NICK_REC* }

@lists = internal global %struct._GSList* null, align 8
@channels = external global %struct._GSList*, align 8
@.str = private unnamed_addr constant [5 x i8] c"core\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"nicklist new\00", align 1
@.str.2 = private unnamed_addr constant [17 x i8] c"nicklist changed\00", align 1
@.str.3 = private unnamed_addr constant [22 x i8] c"nicklist host changed\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"nicklist remove\00", align 1
@__func__.sig_nick_new = private unnamed_addr constant [13 x i8] c"sig_nick_new\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !136)
!1 = !DIFile(filename: "line65-nickmatch-cache.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !31, !110, !119, !124, !129, !134, !59}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REC", file: !6, line: 10, baseType: !7)
!6 = !DIFile(filename: "nickmatch-cache.h", directory: "/home/lichi/Desktop/irssi/task1")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 7, size: 128, align: 64, elements: !8)
!8 = !{!9, !14}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !7, file: !6, line: 8, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !12, line: 37, baseType: !13)
!12 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !12, line: 37, flags: DIFlagFwdDecl)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !7, file: !6, line: 9, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REBUILD_FUNC", file: !6, line: 4, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !10, !19, !67}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !23, line: 15, size: 1408, align: 64, elements: !24)
!23 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!24 = !{!25, !28, !29, !30, !32, !36, !39, !40, !46, !47, !48, !55, !61, !63, !64, !65, !66, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !22, file: !26, line: 3, baseType: !27, size: 32, align: 32)
!26 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !22, file: !26, line: 4, baseType: !27, size: 32, align: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !22, file: !26, line: 5, baseType: !10, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !22, file: !26, line: 7, baseType: !31, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !22, file: !26, line: 8, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !21, line: 107, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !21, line: 107, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !22, file: !26, line: 9, baseType: !37, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !22, file: !26, line: 10, baseType: !37, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !22, file: !26, line: 11, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !42, line: 75, baseType: !43)
!42 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !44, line: 139, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !22, file: !26, line: 12, baseType: !27, size: 32, align: 32, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !22, file: !26, line: 13, baseType: !37, size: 64, align: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !22, file: !26, line: 15, baseType: !49, size: 64, align: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !21, line: 108, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !21, line: 108, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !22, file: !26, line: 17, baseType: !56, size: 64, align: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !52}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !22, file: !62, line: 5, baseType: !37, size: 64, align: 64, offset: 704)
!62 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !22, file: !62, line: 6, baseType: !37, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !22, file: !62, line: 7, baseType: !41, size: 64, align: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !22, file: !62, line: 9, baseType: !10, size: 64, align: 64, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !22, file: !62, line: 10, baseType: !67, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !21, line: 111, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !70, line: 13, size: 576, align: 64, elements: !71)
!70 = !DIFile(filename: "nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!71 = !{!72, !74, !75, !76, !77, !78, !79, !80, !82, !83, !84, !85, !86, !87, !91, !92}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !73, line: 3, baseType: !27, size: 32, align: 32)
!73 = !DIFile(filename: "nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !69, file: !73, line: 4, baseType: !27, size: 32, align: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !69, file: !73, line: 6, baseType: !41, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !69, file: !73, line: 8, baseType: !37, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !69, file: !73, line: 9, baseType: !37, size: 64, align: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !69, file: !73, line: 10, baseType: !37, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !69, file: !73, line: 11, baseType: !27, size: 32, align: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !69, file: !73, line: 14, baseType: !81, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!81 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !69, file: !73, line: 15, baseType: !81, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !69, file: !73, line: 18, baseType: !81, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !69, file: !73, line: 19, baseType: !81, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !69, file: !73, line: 20, baseType: !81, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !69, file: !73, line: 21, baseType: !81, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !69, file: !73, line: 22, baseType: !88, size: 64, align: 8, offset: 360)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !69, file: !73, line: 26, baseType: !31, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !73, line: 28, baseType: !67, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !22, file: !62, line: 12, baseType: !81, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !22, file: !62, line: 13, baseType: !37, size: 64, align: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !22, file: !62, line: 14, baseType: !27, size: 32, align: 32, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !22, file: !62, line: 15, baseType: !37, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !22, file: !62, line: 17, baseType: !81, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !22, file: !62, line: 18, baseType: !81, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !22, file: !62, line: 19, baseType: !81, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !22, file: !62, line: 20, baseType: !81, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !22, file: !62, line: 22, baseType: !81, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !22, file: !62, line: 23, baseType: !81, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !22, file: !62, line: 24, baseType: !81, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !22, file: !62, line: 25, baseType: !81, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !22, file: !62, line: 26, baseType: !81, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !22, file: !62, line: 31, baseType: !107, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!37, !19}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !111, line: 90, baseType: !112)
!111 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !111, line: 55, baseType: !81)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !111, line: 78, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !111, line: 80, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !116, !116}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !111, line: 49, baseType: !27)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !111, line: 88, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !128, !128}
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !111, line: 77, baseType: !31)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !130, line: 9, baseType: !131)
!130 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !117, !117, !117, !117, !117, !117}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !111, line: 46, baseType: !38)
!136 = !{!137}
!137 = distinct !DIGlobalVariable(name: "lists", scope: !0, file: !138, line: 29, type: !139, isLocal: true, isDefinition: true, variable: %struct._GSList** @lists)
!138 = !DIFile(filename: "nickmatch-cache.c", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !141, line: 37, baseType: !142)
!141 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !141, line: 39, size: 128, align: 64, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !142, file: !141, line: 41, baseType: !128, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !141, line: 42, baseType: !139, size: 64, align: 64, offset: 64)
!146 = !{i32 2, !"Dwarf Version", i32 4}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!149 = distinct !DISubprogram(name: "nickmatch_init", scope: !138, file: !138, line: 31, type: !150, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!150 = !DISubroutineType(types: !151)
!151 = !{!4, !15}
!152 = !DILocalVariable(name: "func", arg: 1, scope: !149, file: !138, line: 31, type: !15)
!153 = !DIExpression()
!154 = !DILocation(line: 31, column: 54, scope: !149)
!155 = !DILocalVariable(name: "rec", scope: !149, file: !138, line: 33, type: !4)
!156 = !DILocation(line: 33, column: 17, scope: !149)
!157 = !DILocation(line: 35, column: 27, scope: !149)
!158 = !DILocation(line: 35, column: 9, scope: !149)
!159 = !DILocation(line: 35, column: 6, scope: !149)
!160 = !DILocation(line: 36, column: 14, scope: !149)
!161 = !DILocation(line: 36, column: 2, scope: !149)
!162 = !DILocation(line: 36, column: 7, scope: !149)
!163 = !DILocation(line: 36, column: 12, scope: !149)
!164 = !DILocation(line: 38, column: 25, scope: !149)
!165 = !DILocation(line: 38, column: 32, scope: !149)
!166 = !DILocation(line: 38, column: 10, scope: !149)
!167 = !DILocation(line: 38, column: 8, scope: !149)
!168 = !DILocation(line: 39, column: 16, scope: !149)
!169 = !DILocation(line: 39, column: 9, scope: !149)
!170 = distinct !DISubprogram(name: "nickmatch_deinit", scope: !138, file: !138, line: 42, type: !171, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !4}
!173 = !DILocalVariable(name: "rec", arg: 1, scope: !170, file: !138, line: 42, type: !4)
!174 = !DILocation(line: 42, column: 38, scope: !170)
!175 = !DILocation(line: 44, column: 25, scope: !170)
!176 = !DILocation(line: 44, column: 32, scope: !170)
!177 = !DILocation(line: 44, column: 10, scope: !170)
!178 = !DILocation(line: 44, column: 8, scope: !170)
!179 = !DILocation(line: 46, column: 30, scope: !170)
!180 = !DILocation(line: 46, column: 35, scope: !170)
!181 = !DILocation(line: 46, column: 9, scope: !170)
!182 = !DILocation(line: 47, column: 16, scope: !170)
!183 = !DILocation(line: 47, column: 9, scope: !170)
!184 = !DILocation(line: 48, column: 1, scope: !170)
!185 = distinct !DISubprogram(name: "nickmatch_rebuild", scope: !138, file: !138, line: 63, type: !171, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!186 = !DILocalVariable(name: "rec", arg: 1, scope: !185, file: !138, line: 63, type: !4)
!187 = !DILocation(line: 63, column: 39, scope: !185)
!188 = !DILocation(line: 65, column: 6, scope: !189)
!189 = distinct !DILexicalBlock(scope: !185, file: !138, line: 65, column: 6)
!190 = !DILocation(line: 65, column: 11, scope: !189)
!191 = !DILocation(line: 65, column: 17, scope: !189)
!192 = !DILocation(line: 65, column: 6, scope: !185)
!193 = !DILocation(line: 66, column: 24, scope: !189)
!194 = !DILocation(line: 66, column: 29, scope: !189)
!195 = !DILocation(line: 66, column: 3, scope: !189)
!196 = !DILocation(line: 68, column: 15, scope: !185)
!197 = !DILocation(line: 68, column: 2, scope: !185)
!198 = !DILocation(line: 68, column: 7, scope: !185)
!199 = !DILocation(line: 68, column: 13, scope: !185)
!200 = !DILocation(line: 71, column: 18, scope: !185)
!201 = !DILocation(line: 71, column: 61, scope: !185)
!202 = !DILocation(line: 71, column: 2, scope: !185)
!203 = !DILocation(line: 72, column: 1, scope: !185)
!204 = distinct !DISubprogram(name: "nickmatch_check_channel", scope: !138, file: !138, line: 50, type: !205, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
