; ModuleID = './line190-notifylist.o.i'
source_filename = "./line190-notifylist.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.NOTIFYLIST_REC = type { i8*, i8**, i8 }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !686)
!1 = !DIFile(filename: "line190-notifylist.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !41, !43, !54, !59, !365, !671, !678, !469}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOTIFYLIST_REC", file: !45, line: 10, baseType: !46)
!45 = !DIFile(filename: "notifylist.h", directory: "/home/lichi/Desktop/irssi/task1")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 4, size: 192, align: 64, elements: !47)
!47 = !{!48, !50, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !46, file: !45, line: 5, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ircnets", scope: !46, file: !45, line: 6, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "away_check", scope: !46, file: !45, line: 9, baseType: !53, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!53 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !39, line: 88, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !58}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !39, line: 77, baseType: !36)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !61, line: 6, baseType: !62)
!61 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !63, line: 42, size: 39168, align: 64, elements: !64)
!63 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !68, !69, !70, !310, !315, !316, !317, !318, !319, !320, !321, !322, !323, !327, !328, !332, !333, !334, !338, !343, !344, !345, !346, !347, !348, !349, !350, !357, !358, !359, !360, !361, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !668, !670}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !66, line: 3, baseType: !67, size: 32, align: 32)
!66 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !62, file: !66, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !62, file: !66, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !62, file: !66, line: 8, baseType: !71, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !61, line: 5, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !63, line: 24, size: 2496, align: 64, elements: !74)
!74 = !{!75, !77, !78, !79, !80, !81, !82, !83, !84, !86, !87, !88, !89, !90, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !76, line: 3, baseType: !67, size: 32, align: 32)
!76 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !73, file: !76, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !73, file: !76, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !73, file: !76, line: 9, baseType: !49, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !73, file: !76, line: 10, baseType: !67, size: 32, align: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !73, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !73, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !73, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !73, file: !76, line: 13, baseType: !85, size: 16, align: 16, offset: 448)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !73, file: !76, line: 14, baseType: !49, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !73, file: !76, line: 15, baseType: !49, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !73, file: !76, line: 16, baseType: !67, size: 32, align: 32, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !73, file: !76, line: 17, baseType: !49, size: 64, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !73, file: !76, line: 19, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !93, line: 99, baseType: !94)
!93 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !93, line: 99, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !73, file: !76, line: 19, baseType: !91, size: 64, align: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !73, file: !76, line: 21, baseType: !49, size: 64, align: 64, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !73, file: !76, line: 22, baseType: !49, size: 64, align: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !73, file: !76, line: 23, baseType: !49, size: 64, align: 64, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !73, file: !76, line: 24, baseType: !49, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !73, file: !76, line: 26, baseType: !49, size: 64, align: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !73, file: !76, line: 27, baseType: !49, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !73, file: !76, line: 28, baseType: !49, size: 64, align: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !73, file: !76, line: 29, baseType: !49, size: 64, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !73, file: !76, line: 30, baseType: !49, size: 64, align: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !73, file: !76, line: 31, baseType: !49, size: 64, align: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !73, file: !76, line: 32, baseType: !49, size: 64, align: 64, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !73, file: !76, line: 33, baseType: !49, size: 64, align: 64, offset: 1600)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !73, file: !76, line: 35, baseType: !109, size: 64, align: 64, offset: 1664)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !112)
!112 = !{!113, !115, !255, !256, !261, !262, !263, !264, !265, !274, !275, !276, !280, !281, !282, !283, !284, !285, !286, !287}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !111, file: !4, line: 100, baseType: !114, size: 32, align: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !39, line: 49, baseType: !67)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !111, file: !4, line: 101, baseType: !116, size: 64, align: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !119)
!119 = !{!120, !141, !147, !154, !158, !242, !246, !251}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !118, file: !4, line: 133, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !109, !37, !125, !128, !129}
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !126, line: 66, baseType: !127)
!126 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !132, line: 42, baseType: !133)
!132 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !132, line: 44, size: 128, align: 64, elements: !134)
!134 = !{!135, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !133, file: !132, line: 46, baseType: !136, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !137, line: 36, baseType: !138)
!137 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !126, line: 45, baseType: !53)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !133, file: !132, line: 47, baseType: !114, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !133, file: !132, line: 48, baseType: !37, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !118, file: !4, line: 138, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!124, !109, !145, !125, !128, !129}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !118, file: !4, line: 143, baseType: !148, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!124, !109, !151, !153, !129}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !126, line: 51, baseType: !152)
!152 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !118, file: !4, line: 147, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!124, !109, !129}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !118, file: !4, line: 149, baseType: !159, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !109, !241}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !165)
!165 = !{!166, !167, !188, !217, !219, !223, !224, !225, !226, !234, !235, !236, !237}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !164, file: !16, line: 174, baseType: !58, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !164, file: !16, line: 175, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !171)
!171 = !{!172, !176, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !170, file: !16, line: 198, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !58}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !170, file: !16, line: 199, baseType: !173, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !170, file: !16, line: 200, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !58, !162, !181, !187}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !58}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !39, line: 50, baseType: !114)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !164, file: !16, line: 177, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !193)
!193 = !{!194, !199, !203, !207, !211, !212}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !192, file: !16, line: 216, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!186, !162, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !192, file: !16, line: 218, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!186, !162}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !192, file: !16, line: 219, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!186, !162, !182, !58}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !192, file: !16, line: 222, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !162}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !192, file: !16, line: 226, baseType: !182, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !192, file: !16, line: 227, baseType: !213, size: 64, align: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !164, file: !16, line: 178, baseType: !218, size: 32, align: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !39, line: 55, baseType: !53)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !164, file: !16, line: 180, baseType: !220, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !164, file: !16, line: 182, baseType: !114, size: 32, align: 32, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !164, file: !16, line: 183, baseType: !218, size: 32, align: 32, offset: 352)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !164, file: !16, line: 184, baseType: !218, size: 32, align: 32, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !164, file: !16, line: 186, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !229, line: 37, baseType: !230)
!229 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !229, line: 39, size: 128, align: 64, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !229, line: 41, baseType: !58, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !229, line: 42, baseType: !227, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !16, line: 188, baseType: !162, size: 64, align: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !16, line: 189, baseType: !162, size: 64, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !16, line: 191, baseType: !49, size: 64, align: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !164, file: !16, line: 193, baseType: !238, size: 64, align: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !118, file: !4, line: 151, baseType: !243, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !109}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !118, file: !4, line: 152, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!124, !109, !250, !129}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !118, file: !4, line: 155, baseType: !252, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!250, !109}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !111, file: !4, line: 103, baseType: !37, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !111, file: !4, line: 104, baseType: !257, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !258, line: 77, baseType: !259)
!258 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !258, line: 77, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !111, file: !4, line: 105, baseType: !257, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !111, file: !4, line: 106, baseType: !37, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !111, file: !4, line: 107, baseType: !218, size: 32, align: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !111, file: !4, line: 109, baseType: !125, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !111, file: !4, line: 110, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !268, line: 39, baseType: !269)
!268 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !268, line: 41, size: 192, align: 64, elements: !270)
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !269, file: !268, line: 43, baseType: !37, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !268, line: 44, baseType: !125, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !269, file: !268, line: 45, baseType: !125, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !111, file: !4, line: 111, baseType: !266, size: 64, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !111, file: !4, line: 112, baseType: !266, size: 64, align: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !111, file: !4, line: 113, baseType: !277, size: 48, align: 8, offset: 704)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, align: 8, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 6)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !111, file: !4, line: 117, baseType: !218, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !111, file: !4, line: 118, baseType: !218, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !111, file: !4, line: 119, baseType: !218, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !111, file: !4, line: 120, baseType: !218, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !111, file: !4, line: 121, baseType: !218, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !111, file: !4, line: 122, baseType: !218, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !111, file: !4, line: 124, baseType: !58, size: 64, align: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !111, file: !4, line: 125, baseType: !58, size: 64, align: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !73, file: !76, line: 38, baseType: !53, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !73, file: !76, line: 39, baseType: !53, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !73, file: !76, line: 40, baseType: !53, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !73, file: !76, line: 41, baseType: !53, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !73, file: !76, line: 42, baseType: !53, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !73, file: !76, line: 43, baseType: !53, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !73, file: !76, line: 44, baseType: !53, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !73, file: !76, line: 45, baseType: !53, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !73, file: !76, line: 46, baseType: !49, size: 64, align: 64, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !73, file: !76, line: 47, baseType: !49, size: 64, align: 64, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !73, file: !63, line: 27, baseType: !49, size: 64, align: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !73, file: !63, line: 28, baseType: !49, size: 64, align: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !73, file: !63, line: 30, baseType: !67, size: 32, align: 32, offset: 2048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !73, file: !63, line: 31, baseType: !49, size: 64, align: 64, offset: 2112)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !73, file: !63, line: 32, baseType: !49, size: 64, align: 64, offset: 2176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !73, file: !63, line: 34, baseType: !67, size: 32, align: 32, offset: 2240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !73, file: !63, line: 35, baseType: !67, size: 32, align: 32, offset: 2272)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !73, file: !63, line: 36, baseType: !67, size: 32, align: 32, offset: 2304)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !73, file: !63, line: 38, baseType: !67, size: 32, align: 32, offset: 2336)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !73, file: !63, line: 38, baseType: !67, size: 32, align: 32, offset: 2368)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !73, file: !63, line: 38, baseType: !67, size: 32, align: 32, offset: 2400)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !73, file: !63, line: 38, baseType: !67, size: 32, align: 32, offset: 2432)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !62, file: !66, line: 9, baseType: !311, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !312, line: 75, baseType: !313)
!312 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !314, line: 139, baseType: !152)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !62, file: !66, line: 10, baseType: !311, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !62, file: !66, line: 12, baseType: !49, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !62, file: !66, line: 13, baseType: !49, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !62, file: !66, line: 15, baseType: !53, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !62, file: !66, line: 16, baseType: !53, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !62, file: !66, line: 17, baseType: !53, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !62, file: !66, line: 18, baseType: !53, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !62, file: !66, line: 19, baseType: !53, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !62, file: !66, line: 21, baseType: !324, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !93, line: 102, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !93, line: 102, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !62, file: !66, line: 22, baseType: !67, size: 32, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !62, file: !66, line: 25, baseType: !329, size: 128, align: 64, offset: 640)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 128, align: 64, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !62, file: !66, line: 26, baseType: !67, size: 32, align: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !62, file: !66, line: 27, baseType: !67, size: 32, align: 32, offset: 800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !62, file: !66, line: 29, baseType: !335, size: 64, align: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !93, line: 103, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !93, line: 103, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !62, file: !66, line: 30, baseType: !339, size: 64, align: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !341, line: 37, baseType: !342)
!341 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !341, line: 37, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !62, file: !66, line: 32, baseType: !49, size: 64, align: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !62, file: !66, line: 33, baseType: !49, size: 64, align: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !62, file: !66, line: 34, baseType: !49, size: 64, align: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !62, file: !66, line: 35, baseType: !53, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !62, file: !66, line: 36, baseType: !53, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !62, file: !66, line: 37, baseType: !53, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !62, file: !66, line: 38, baseType: !53, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !62, file: !66, line: 40, baseType: !351, size: 128, align: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !39, line: 504, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !39, line: 506, size: 128, align: 64, elements: !353)
!353 = !{!354, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !352, file: !39, line: 508, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !39, line: 48, baseType: !152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !352, file: !39, line: 509, baseType: !355, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !62, file: !66, line: 41, baseType: !311, size: 64, align: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !62, file: !66, line: 42, baseType: !67, size: 32, align: 32, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !62, file: !66, line: 44, baseType: !227, size: 64, align: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !62, file: !66, line: 45, baseType: !227, size: 64, align: 64, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !62, file: !66, line: 53, baseType: !362, size: 64, align: 64, offset: 1600)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365, !41, !67}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !93, line: 107, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !368, line: 30, size: 2240, align: 64, elements: !369)
!368 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!369 = !{!370, !371, !372, !373, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !453, !457, !461, !465, !544, !551, !555}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !66, line: 3, baseType: !67, size: 32, align: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !367, file: !66, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !367, file: !66, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !367, file: !66, line: 8, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !93, line: 113, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !368, line: 25, size: 1920, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !76, line: 3, baseType: !67, size: 32, align: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !376, file: !76, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !376, file: !76, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !376, file: !76, line: 9, baseType: !49, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !376, file: !76, line: 10, baseType: !67, size: 32, align: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !376, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !376, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !376, file: !76, line: 11, baseType: !49, size: 64, align: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !376, file: !76, line: 13, baseType: !85, size: 16, align: 16, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !376, file: !76, line: 14, baseType: !49, size: 64, align: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !376, file: !76, line: 15, baseType: !49, size: 64, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !376, file: !76, line: 16, baseType: !67, size: 32, align: 32, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !376, file: !76, line: 17, baseType: !49, size: 64, align: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !376, file: !76, line: 19, baseType: !91, size: 64, align: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !376, file: !76, line: 19, baseType: !91, size: 64, align: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !376, file: !76, line: 21, baseType: !49, size: 64, align: 64, offset: 896)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !376, file: !76, line: 22, baseType: !49, size: 64, align: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !376, file: !76, line: 23, baseType: !49, size: 64, align: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !376, file: !76, line: 24, baseType: !49, size: 64, align: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !376, file: !76, line: 26, baseType: !49, size: 64, align: 64, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !376, file: !76, line: 27, baseType: !49, size: 64, align: 64, offset: 1216)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !376, file: !76, line: 28, baseType: !49, size: 64, align: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !376, file: !76, line: 29, baseType: !49, size: 64, align: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !376, file: !76, line: 30, baseType: !49, size: 64, align: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !376, file: !76, line: 31, baseType: !49, size: 64, align: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !376, file: !76, line: 32, baseType: !49, size: 64, align: 64, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !376, file: !76, line: 33, baseType: !49, size: 64, align: 64, offset: 1600)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !376, file: !76, line: 35, baseType: !109, size: 64, align: 64, offset: 1664)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !376, file: !76, line: 38, baseType: !53, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !376, file: !76, line: 39, baseType: !53, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !376, file: !76, line: 40, baseType: !53, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !376, file: !76, line: 41, baseType: !53, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !376, file: !76, line: 42, baseType: !53, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !376, file: !76, line: 43, baseType: !53, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !376, file: !76, line: 44, baseType: !53, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !376, file: !76, line: 45, baseType: !53, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !376, file: !76, line: 46, baseType: !49, size: 64, align: 64, offset: 1792)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !376, file: !76, line: 47, baseType: !49, size: 64, align: 64, offset: 1856)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !367, file: !66, line: 9, baseType: !311, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !367, file: !66, line: 10, baseType: !311, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !367, file: !66, line: 12, baseType: !49, size: 64, align: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !367, file: !66, line: 13, baseType: !49, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !367, file: !66, line: 15, baseType: !53, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !367, file: !66, line: 16, baseType: !53, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !367, file: !66, line: 17, baseType: !53, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !367, file: !66, line: 18, baseType: !53, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !367, file: !66, line: 19, baseType: !53, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !367, file: !66, line: 21, baseType: !324, size: 64, align: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !367, file: !66, line: 22, baseType: !67, size: 32, align: 32, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !367, file: !66, line: 25, baseType: !329, size: 128, align: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !367, file: !66, line: 26, baseType: !67, size: 32, align: 32, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !367, file: !66, line: 27, baseType: !67, size: 32, align: 32, offset: 800)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !367, file: !66, line: 29, baseType: !335, size: 64, align: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !367, file: !66, line: 30, baseType: !339, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !367, file: !66, line: 32, baseType: !49, size: 64, align: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !367, file: !66, line: 33, baseType: !49, size: 64, align: 64, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !367, file: !66, line: 34, baseType: !49, size: 64, align: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !367, file: !66, line: 35, baseType: !53, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !367, file: !66, line: 36, baseType: !53, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !367, file: !66, line: 37, baseType: !53, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !367, file: !66, line: 38, baseType: !53, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !367, file: !66, line: 40, baseType: !351, size: 128, align: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !367, file: !66, line: 41, baseType: !311, size: 64, align: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !367, file: !66, line: 42, baseType: !67, size: 32, align: 32, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !367, file: !66, line: 44, baseType: !227, size: 64, align: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !367, file: !66, line: 45, baseType: !227, size: 64, align: 64, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !367, file: !66, line: 53, baseType: !362, size: 64, align: 64, offset: 1600)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !367, file: !66, line: 55, baseType: !446, size: 64, align: 64, offset: 1664)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!67, !365, !40}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !367, file: !66, line: 57, baseType: !450, size: 64, align: 64, offset: 1728)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!67, !365, !41}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !367, file: !66, line: 60, baseType: !454, size: 64, align: 64, offset: 1792)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!41, !365}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !367, file: !66, line: 62, baseType: !458, size: 64, align: 64, offset: 1856)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !365, !41, !41, !67}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !367, file: !66, line: 65, baseType: !462, size: 64, align: 64, offset: 1920)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!51, !365, !41, !41}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !367, file: !66, line: 69, baseType: !466, size: 64, align: 64, offset: 1984)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !365, !41}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !93, line: 109, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !472, line: 15, size: 1408, align: 64, elements: !473)
!472 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!473 = !{!474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !492, !496, !498, !499, !500, !501, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !475, line: 3, baseType: !67, size: 32, align: 32)
!475 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !471, file: !475, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !471, file: !475, line: 5, baseType: !339, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !471, file: !475, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !471, file: !475, line: 8, baseType: !365, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !471, file: !475, line: 9, baseType: !49, size: 64, align: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !471, file: !475, line: 10, baseType: !49, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !471, file: !475, line: 11, baseType: !311, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !471, file: !475, line: 12, baseType: !67, size: 32, align: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !471, file: !475, line: 13, baseType: !49, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !471, file: !475, line: 15, baseType: !486, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !93, line: 108, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !93, line: 108, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !471, file: !475, line: 17, baseType: !493, size: 64, align: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!41, !489}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !471, file: !497, line: 5, baseType: !49, size: 64, align: 64, offset: 704)
!497 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !471, file: !497, line: 6, baseType: !49, size: 64, align: 64, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !471, file: !497, line: 7, baseType: !311, size: 64, align: 64, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !471, file: !497, line: 9, baseType: !339, size: 64, align: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !471, file: !497, line: 10, baseType: !502, size: 64, align: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !93, line: 111, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !505, line: 13, size: 576, align: 64, elements: !506)
!505 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!506 = !{!507, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !525, !526}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !508, line: 3, baseType: !67, size: 32, align: 32)
!508 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !504, file: !508, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !504, file: !508, line: 6, baseType: !311, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !504, file: !508, line: 8, baseType: !49, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !504, file: !508, line: 9, baseType: !49, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !504, file: !508, line: 10, baseType: !49, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !504, file: !508, line: 11, baseType: !67, size: 32, align: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !504, file: !508, line: 14, baseType: !53, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !504, file: !508, line: 15, baseType: !53, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !504, file: !508, line: 18, baseType: !53, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !504, file: !508, line: 19, baseType: !53, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !504, file: !508, line: 20, baseType: !53, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !504, file: !508, line: 21, baseType: !53, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !504, file: !508, line: 22, baseType: !522, size: 64, align: 8, offset: 360)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, align: 8, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !504, file: !508, line: 26, baseType: !36, size: 64, align: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !508, line: 28, baseType: !502, size: 64, align: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !471, file: !497, line: 12, baseType: !53, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !471, file: !497, line: 13, baseType: !49, size: 64, align: 64, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !471, file: !497, line: 14, baseType: !67, size: 32, align: 32, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !471, file: !497, line: 15, baseType: !49, size: 64, align: 64, offset: 1216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !471, file: !497, line: 17, baseType: !53, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !471, file: !497, line: 18, baseType: !53, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !471, file: !497, line: 19, baseType: !53, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !471, file: !497, line: 20, baseType: !53, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !471, file: !497, line: 22, baseType: !53, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !471, file: !497, line: 23, baseType: !53, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !471, file: !497, line: 24, baseType: !53, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !471, file: !497, line: 25, baseType: !53, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !471, file: !497, line: 26, baseType: !53, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !471, file: !497, line: 31, baseType: !541, size: 64, align: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!49, !469}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !367, file: !66, line: 70, baseType: !545, size: 64, align: 64, offset: 2048)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !365, !41}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !93, line: 110, baseType: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !93, line: 110, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !367, file: !66, line: 71, baseType: !552, size: 64, align: 64, offset: 2112)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!67, !41, !41}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !367, file: !66, line: 73, baseType: !552, size: 64, align: 64, offset: 2176)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !62, file: !66, line: 55, baseType: !446, size: 64, align: 64, offset: 1664)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !62, file: !66, line: 57, baseType: !450, size: 64, align: 64, offset: 1728)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !62, file: !66, line: 60, baseType: !454, size: 64, align: 64, offset: 1792)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !62, file: !66, line: 62, baseType: !458, size: 64, align: 64, offset: 1856)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !62, file: !66, line: 65, baseType: !462, size: 64, align: 64, offset: 1920)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !62, file: !66, line: 69, baseType: !466, size: 64, align: 64, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !62, file: !66, line: 70, baseType: !545, size: 64, align: 64, offset: 2048)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !62, file: !66, line: 71, baseType: !552, size: 64, align: 64, offset: 2112)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !62, file: !66, line: 73, baseType: !552, size: 64, align: 64, offset: 2176)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !62, file: !63, line: 46, baseType: !227, size: 64, align: 64, offset: 2240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !62, file: !63, line: 47, baseType: !227, size: 64, align: 64, offset: 2304)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !62, file: !63, line: 48, baseType: !568, size: 64, align: 64, offset: 2368)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !61, line: 8, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !61, line: 8, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !62, file: !63, line: 49, baseType: !227, size: 64, align: 64, offset: 2432)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !62, file: !63, line: 51, baseType: !49, size: 64, align: 64, offset: 2496)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !62, file: !63, line: 53, baseType: !49, size: 64, align: 64, offset: 2560)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !62, file: !63, line: 54, baseType: !49, size: 64, align: 64, offset: 2624)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !62, file: !63, line: 55, baseType: !49, size: 64, align: 64, offset: 2688)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !62, file: !63, line: 56, baseType: !49, size: 64, align: 64, offset: 2752)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !62, file: !63, line: 57, baseType: !67, size: 32, align: 32, offset: 2816)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !62, file: !63, line: 59, baseType: !53, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !62, file: !63, line: 60, baseType: !53, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !62, file: !63, line: 62, baseType: !53, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !62, file: !63, line: 63, baseType: !53, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !62, file: !63, line: 64, baseType: !53, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !62, file: !63, line: 65, baseType: !53, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !62, file: !63, line: 66, baseType: !53, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !62, file: !63, line: 67, baseType: !53, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !62, file: !63, line: 68, baseType: !53, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !62, file: !63, line: 69, baseType: !53, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !62, file: !63, line: 70, baseType: !53, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !62, file: !63, line: 71, baseType: !53, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !62, file: !63, line: 72, baseType: !53, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !62, file: !63, line: 74, baseType: !67, size: 32, align: 32, offset: 2880)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !62, file: !63, line: 75, baseType: !67, size: 32, align: 32, offset: 2912)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !62, file: !63, line: 76, baseType: !67, size: 32, align: 32, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !62, file: !63, line: 77, baseType: !67, size: 32, align: 32, offset: 2976)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !62, file: !63, line: 79, baseType: !339, size: 64, align: 64, offset: 3008)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !62, file: !63, line: 80, baseType: !227, size: 64, align: 64, offset: 3072)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !62, file: !63, line: 81, baseType: !227, size: 64, align: 64, offset: 3136)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !62, file: !63, line: 83, baseType: !266, size: 64, align: 64, offset: 3200)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !62, file: !63, line: 84, baseType: !218, size: 32, align: 32, offset: 3264)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !62, file: !63, line: 87, baseType: !67, size: 32, align: 32, offset: 3296)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !62, file: !63, line: 91, baseType: !227, size: 64, align: 64, offset: 3328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !62, file: !63, line: 92, baseType: !351, size: 128, align: 64, offset: 3392)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !62, file: !63, line: 93, baseType: !351, size: 128, align: 64, offset: 3520)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !62, file: !63, line: 95, baseType: !67, size: 32, align: 32, offset: 3648)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !62, file: !63, line: 96, baseType: !67, size: 32, align: 32, offset: 3680)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !62, file: !63, line: 97, baseType: !67, size: 32, align: 32, offset: 3712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !62, file: !63, line: 100, baseType: !227, size: 64, align: 64, offset: 3776)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !62, file: !63, line: 103, baseType: !227, size: 64, align: 64, offset: 3840)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !62, file: !63, line: 106, baseType: !227, size: 64, align: 64, offset: 3904)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !62, file: !63, line: 108, baseType: !339, size: 64, align: 64, offset: 3968)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !62, file: !63, line: 109, baseType: !227, size: 64, align: 64, offset: 4032)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !62, file: !63, line: 111, baseType: !227, size: 64, align: 64, offset: 4096)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !62, file: !63, line: 114, baseType: !36, size: 64, align: 64, offset: 4160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !62, file: !63, line: 116, baseType: !339, size: 64, align: 64, offset: 4224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !62, file: !63, line: 117, baseType: !616, size: 32768, align: 64, offset: 4288)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 32768, align: 64, elements: !666)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !618, line: 10, size: 128, align: 64, elements: !619)
!618 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!619 = !{!620, !665}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !617, file: !618, line: 11, baseType: !621, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !618, line: 7, baseType: !623)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !625, !41, !40, !40, !49, !266}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !61, line: 7, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !628, line: 15, size: 1600, align: 64, elements: !629)
!628 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !475, line: 3, baseType: !67, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !627, file: !475, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !627, file: !475, line: 5, baseType: !339, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !627, file: !475, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !627, file: !475, line: 8, baseType: !59, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !627, file: !475, line: 9, baseType: !49, size: 64, align: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !475, line: 10, baseType: !49, size: 64, align: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !627, file: !475, line: 11, baseType: !311, size: 64, align: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !627, file: !475, line: 12, baseType: !67, size: 32, align: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !627, file: !475, line: 13, baseType: !49, size: 64, align: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !627, file: !475, line: 15, baseType: !486, size: 64, align: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !627, file: !475, line: 17, baseType: !493, size: 64, align: 64, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !627, file: !497, line: 5, baseType: !49, size: 64, align: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !627, file: !497, line: 6, baseType: !49, size: 64, align: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !627, file: !497, line: 7, baseType: !311, size: 64, align: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !627, file: !497, line: 9, baseType: !339, size: 64, align: 64, offset: 896)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !627, file: !497, line: 10, baseType: !502, size: 64, align: 64, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !627, file: !497, line: 12, baseType: !53, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !627, file: !497, line: 13, baseType: !49, size: 64, align: 64, offset: 1088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !627, file: !497, line: 14, baseType: !67, size: 32, align: 32, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !627, file: !497, line: 15, baseType: !49, size: 64, align: 64, offset: 1216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !627, file: !497, line: 17, baseType: !53, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !627, file: !497, line: 18, baseType: !53, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !627, file: !497, line: 19, baseType: !53, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !627, file: !497, line: 20, baseType: !53, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !627, file: !497, line: 22, baseType: !53, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !627, file: !497, line: 23, baseType: !53, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !627, file: !497, line: 24, baseType: !53, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !627, file: !497, line: 25, baseType: !53, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !627, file: !497, line: 26, baseType: !53, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !627, file: !497, line: 31, baseType: !541, size: 64, align: 64, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !627, file: !628, line: 18, baseType: !227, size: 64, align: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !627, file: !628, line: 20, baseType: !311, size: 64, align: 64, offset: 1472)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !627, file: !628, line: 21, baseType: !67, size: 32, align: 32, offset: 1536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !627, file: !628, line: 22, baseType: !67, size: 32, align: 32, offset: 1568)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !617, file: !618, line: 12, baseType: !40, size: 8, align: 8, offset: 64)
!666 = !{!667}
!667 = !DISubrange(count: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !62, file: !63, line: 118, baseType: !669, size: 2048, align: 8, offset: 37056)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, align: 8, elements: !666)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !62, file: !63, line: 120, baseType: !552, size: 64, align: 64, offset: 39104)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !672, line: 9, baseType: !673)
!672 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !676, !676, !676, !676, !676, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_SERVER_REC", file: !680, line: 24, baseType: !681)
!680 = !DIFile(filename: "module.h", directory: "/home/lichi/Desktop/irssi/task1")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 19, size: 192, align: 64, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ison_count", scope: !681, file: !680, line: 20, baseType: !67, size: 32, align: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "notify_users", scope: !681, file: !680, line: 22, baseType: !227, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ison_tempusers", scope: !681, file: !680, line: 23, baseType: !227, size: 64, align: 64, offset: 128)
!686 = !{!687}
!687 = distinct !DIGlobalVariable(name: "notifies", scope: !0, file: !688, line: 35, type: !227, isLocal: false, isDefinition: true, variable: %struct._GSList** @notifies)
!688 = !DIFile(filename: "notifylist.c", directory: "/home/lichi/Desktop/irssi/task1")
!689 = !{i32 2, !"Dwarf Version", i32 4}
!690 = !{i32 2, !"Debug Info Version", i32 3}
!691 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!692 = distinct !DISubprogram(name: "notifylist_add", scope: !688, file: !688, line: 37, type: !693, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{!43, !41, !41, !67}
!695 = !{}
!696 = !DILocalVariable(name: "mask", arg: 1, scope: !692, file: !688, line: 37, type: !41)
!697 = !DIExpression()
!698 = !DILocation(line: 37, column: 44, scope: !692)
!699 = !DILocalVariable(name: "ircnets", arg: 2, scope: !692, file: !688, line: 37, type: !41)
!700 = !DILocation(line: 37, column: 62, scope: !692)
!701 = !DILocalVariable(name: "away_check", arg: 3, scope: !692, file: !688, line: 38, type: !67)
!702 = !DILocation(line: 38, column: 15, scope: !692)
!703 = !DILocalVariable(name: "rec", scope: !692, file: !688, line: 40, type: !43)
!704 = !DILocation(line: 40, column: 18, scope: !692)
!705 = !DILocation(line: 42, column: 2, scope: !692)
!706 = distinct !{!706, !705}
!707 = !DILocation(line: 42, column: 10, scope: !708)
!708 = !DILexicalBlockFile(scope: !709, file: !688, discriminator: 1)
!709 = distinct !DILexicalBlock(scope: !710, file: !688, line: 42, column: 10)
!710 = distinct !DILexicalBlock(scope: !692, file: !688, line: 42, column: 4)
!711 = !DILocation(line: 42, column: 15, scope: !708)
!712 = !DILocation(line: 42, column: 5, scope: !713)
!713 = !DILexicalBlockFile(scope: !714, file: !688, discriminator: 2)
!714 = distinct !DILexicalBlock(scope: !709, file: !688, line: 42, column: 3)
!715 = !DILocation(line: 42, column: 14, scope: !716)
!716 = !DILexicalBlockFile(scope: !717, file: !688, discriminator: 3)
!717 = distinct !DILexicalBlock(scope: !709, file: !688, line: 42, column: 12)
!718 = !DILocation(line: 42, column: 99, scope: !716)
!719 = !DILocation(line: 42, column: 7, scope: !720)
!720 = !DILexicalBlockFile(scope: !710, file: !688, discriminator: 4)
!721 = !DILocation(line: 44, column: 28, scope: !692)
!722 = !DILocation(line: 44, column: 9, scope: !692)
!723 = !DILocation(line: 44, column: 6, scope: !692)
!724 = !DILocation(line: 45, column: 30, scope: !692)
!725 = !DILocation(line: 45, column: 21, scope: !692)
!726 = !DILocation(line: 45, column: 9, scope: !692)
!727 = !DILocation(line: 45, column: 14, scope: !692)
!728 = !DILocation(line: 45, column: 19, scope: !692)
!729 = !DILocation(line: 46, column: 17, scope: !692)
!730 = !DILocation(line: 46, column: 25, scope: !692)
!731 = !DILocation(line: 46, column: 32, scope: !692)
!732 = !DILocation(line: 46, column: 36, scope: !733)
!733 = !DILexicalBlockFile(scope: !692, file: !688, discriminator: 1)
!734 = !DILocation(line: 46, column: 35, scope: !733)
!735 = !DILocation(line: 46, column: 44, scope: !733)
!736 = !DILocation(line: 46, column: 17, scope: !733)
!737 = !DILocation(line: 46, column: 17, scope: !738)
!738 = !DILexicalBlockFile(scope: !692, file: !688, discriminator: 2)
!739 = !DILocation(line: 47, column: 14, scope: !692)
!740 = !DILocation(line: 47, column: 3, scope: !692)
!741 = !DILocation(line: 46, column: 17, scope: !742)
!742 = !DILexicalBlockFile(scope: !692, file: !688, discriminator: 3)
!743 = !DILocation(line: 46, column: 17, scope: !744)
!744 = !DILexicalBlockFile(scope: !692, file: !688, discriminator: 4)
!745 = !DILocation(line: 46, column: 2, scope: !744)
!746 = !DILocation(line: 46, column: 7, scope: !744)
!747 = !DILocation(line: 46, column: 15, scope: !744)
!748 = !DILocation(line: 48, column: 20, scope: !692)
!749 = !DILocation(line: 48, column: 2, scope: !692)
!750 = !DILocation(line: 48, column: 7, scope: !692)
!751 = !DILocation(line: 48, column: 18, scope: !692)
!752 = !DILocation(line: 50, column: 31, scope: !692)
!753 = !DILocation(line: 50, column: 9, scope: !692)
!754 = !DILocation(line: 52, column: 35, scope: !692)
!755 = !DILocation(line: 52, column: 45, scope: !692)
!756 = !DILocation(line: 52, column: 20, scope: !692)
!757 = !DILocation(line: 52, column: 18, scope: !692)
!758 = !DILocation(line: 53, column: 35, scope: !692)
!759 = !DILocation(line: 53, column: 2, scope: !692)
!760 = !DILocation(line: 54, column: 9, scope: !692)
!761 = !DILocation(line: 54, column: 2, scope: !692)
!762 = !DILocation(line: 55, column: 1, scope: !692)
!763 = distinct !DISubprogram(name: "notifylist_destroy_all", scope: !688, file: !688, line: 64, type: !215, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!764 = !DILocation(line: 66, column: 18, scope: !763)
!765 = !DILocation(line: 66, column: 2, scope: !763)
!766 = !DILocation(line: 67, column: 15, scope: !763)
!767 = !DILocation(line: 67, column: 2, scope: !763)
!768 = !DILocation(line: 69, column: 11, scope: !763)
!769 = !DILocation(line: 70, column: 1, scope: !763)
!770 = distinct !DISubprogram(name: "notify_destroy", scope: !688, file: !688, line: 57, type: !771, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !43}
!773 = !DILocalVariable(name: "rec", arg: 1, scope: !770, file: !688, line: 57, type: !43)
!774 = !DILocation(line: 57, column: 44, scope: !770)
!775 = !DILocation(line: 59, column: 6, scope: !776)
!776 = distinct !DILexicalBlock(scope: !770, file: !688, line: 59, column: 6)
!777 = !DILocation(line: 59, column: 11, scope: !776)
!778 = !DILocation(line: 59, column: 19, scope: !776)
!779 = !DILocation(line: 59, column: 6, scope: !770)
!780 = !DILocation(line: 59, column: 38, scope: !781)
!781 = !DILexicalBlockFile(scope: !776, file: !688, discriminator: 1)
!782 = !DILocation(line: 59, column: 43, scope: !781)
!783 = !DILocation(line: 59, column: 27, scope: !781)
!784 = !DILocation(line: 60, column: 9, scope: !770)
!785 = !DILocation(line: 60, column: 14, scope: !770)
!786 = !DILocation(line: 60, column: 2, scope: !770)
!787 = !DILocation(line: 61, column: 16, scope: !770)
!788 = !DILocation(line: 61, column: 9, scope: !770)
!789 = !DILocation(line: 62, column: 1, scope: !770)
!790 = distinct !DISubprogram(name: "notifylist_remove", scope: !688, file: !688, line: 72, type: !791, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !41}
!793 = !DILocalVariable(name: "mask", arg: 1, scope: !790, file: !688, line: 72, type: !41)
!794 = !DILocation(line: 72, column: 36, scope: !790)
!795 = !DILocalVariable(name: "rec", scope: !790, file: !688, line: 74, type: !43)
!796 = !DILocation(line: 74, column: 18, scope: !790)
!797 = !DILocation(line: 76, column: 2, scope: !790)
!798 = distinct !{!798, !797}
!799 = !DILocation(line: 76, column: 10, scope: !800)
!800 = !DILexicalBlockFile(scope: !801, file: !688, discriminator: 1)
!801 = distinct !DILexicalBlock(scope: !802, file: !688, line: 76, column: 10)
!802 = distinct !DILexicalBlock(scope: !790, file: !688, line: 76, column: 4)
!803 = !DILocation(line: 76, column: 15, scope: !800)
!804 = !DILocation(line: 76, column: 5, scope: !805)
!805 = !DILexicalBlockFile(scope: !806, file: !688, discriminator: 2)
!806 = distinct !DILexicalBlock(scope: !801, file: !688, line: 76, column: 3)
!807 = !DILocation(line: 76, column: 14, scope: !808)
!808 = !DILexicalBlockFile(scope: !809, file: !688, discriminator: 3)
!809 = distinct !DILexicalBlock(scope: !801, file: !688, line: 76, column: 12)
!810 = !DILocation(line: 76, column: 99, scope: !808)
!811 = !DILocation(line: 76, column: 110, scope: !812)
!812 = !DILexicalBlockFile(scope: !802, file: !688, discriminator: 4)
!813 = !DILocation(line: 78, column: 24, scope: !790)
!814 = !DILocation(line: 78, column: 8, scope: !790)
!815 = !DILocation(line: 78, column: 6, scope: !790)
!816 = !DILocation(line: 79, column: 6, scope: !817)
!817 = distinct !DILexicalBlock(scope: !790, file: !688, line: 79, column: 6)
!818 = !DILocation(line: 79, column: 10, scope: !817)
!819 = !DILocation(line: 79, column: 6, scope: !790)
!820 = !DILocation(line: 79, column: 18, scope: !821)
!821 = !DILexicalBlockFile(scope: !817, file: !688, discriminator: 1)
!822 = !DILocation(line: 81, column: 27, scope: !790)
!823 = !DILocation(line: 81, column: 2, scope: !790)
!824 = !DILocation(line: 82, column: 28, scope: !790)
!825 = !DILocation(line: 82, column: 38, scope: !790)
!826 = !DILocation(line: 82, column: 13, scope: !790)
!827 = !DILocation(line: 82, column: 11, scope: !790)
!828 = !DILocation(line: 83, column: 38, scope: !790)
!829 = !DILocation(line: 83, column: 2, scope: !790)
!830 = !DILocation(line: 85, column: 24, scope: !790)
!831 = !DILocation(line: 85, column: 9, scope: !790)
!832 = !DILocation(line: 86, column: 1, scope: !790)
!833 = !DILocation(line: 86, column: 1, scope: !834)
!834 = !DILexicalBlockFile(scope: !790, file: !688, discriminator: 1)
!835 = distinct !DISubprogram(name: "notifylist_find", scope: !688, file: !688, line: 104, type: !836, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!836 = !DISubroutineType(types: !837)
!837 = !{!43, !41, !41}
!838 = !DILocalVariable(name: "mask", arg: 1, scope: !835, file: !688, line: 104, type: !41)
!839 = !DILocation(line: 104, column: 45, scope: !835)
!840 = !DILocalVariable(name: "ircnet", arg: 2, scope: !835, file: !688, line: 104, type: !41)
!841 = !DILocation(line: 104, column: 63, scope: !835)
!842 = !DILocalVariable(name: "best", scope: !835, file: !688, line: 106, type: !43)
!843 = !DILocation(line: 106, column: 18, scope: !835)
!844 = !DILocalVariable(name: "tmp", scope: !835, file: !688, line: 107, type: !227)
!845 = !DILocation(line: 107, column: 10, scope: !835)
!846 = !DILocalVariable(name: "len", scope: !835, file: !688, line: 108, type: !67)
!847 = !DILocation(line: 108, column: 6, scope: !835)
!848 = !DILocation(line: 110, column: 7, scope: !835)
!849 = !DILocation(line: 111, column: 15, scope: !835)
!850 = !DILocation(line: 111, column: 8, scope: !835)
!851 = !DILocation(line: 111, column: 6, scope: !835)
!852 = !DILocation(line: 112, column: 13, scope: !853)
!853 = distinct !DILexicalBlock(scope: !835, file: !688, line: 112, column: 2)
!854 = !DILocation(line: 112, column: 11, scope: !853)
!855 = !DILocation(line: 112, column: 7, scope: !853)
!856 = !DILocation(line: 112, column: 23, scope: !857)
!857 = !DILexicalBlockFile(scope: !858, file: !688, discriminator: 1)
!858 = distinct !DILexicalBlock(scope: !853, file: !688, line: 112, column: 2)
!859 = !DILocation(line: 112, column: 27, scope: !857)
!860 = !DILocation(line: 112, column: 2, scope: !857)
!861 = !DILocalVariable(name: "rec", scope: !862, file: !688, line: 113, type: !43)
!862 = distinct !DILexicalBlock(scope: !858, file: !688, line: 112, column: 52)
!863 = !DILocation(line: 113, column: 19, scope: !862)
!864 = !DILocation(line: 113, column: 25, scope: !862)
!865 = !DILocation(line: 113, column: 30, scope: !862)
!866 = !DILocation(line: 116, column: 27, scope: !867)
!867 = distinct !DILexicalBlock(scope: !862, file: !688, line: 116, column: 7)
!868 = !DILocation(line: 116, column: 32, scope: !867)
!869 = !DILocation(line: 116, column: 38, scope: !867)
!870 = !DILocation(line: 116, column: 44, scope: !867)
!871 = !DILocation(line: 116, column: 7, scope: !867)
!872 = !DILocation(line: 116, column: 49, scope: !867)
!873 = !DILocation(line: 116, column: 54, scope: !867)
!874 = !DILocation(line: 117, column: 18, scope: !867)
!875 = !DILocation(line: 117, column: 8, scope: !867)
!876 = !DILocation(line: 117, column: 13, scope: !867)
!877 = !DILocation(line: 117, column: 23, scope: !867)
!878 = !DILocation(line: 117, column: 31, scope: !867)
!879 = !DILocation(line: 117, column: 44, scope: !880)
!880 = !DILexicalBlockFile(scope: !867, file: !688, discriminator: 1)
!881 = !DILocation(line: 117, column: 34, scope: !880)
!882 = !DILocation(line: 117, column: 39, scope: !880)
!883 = !DILocation(line: 117, column: 49, scope: !880)
!884 = !DILocation(line: 116, column: 7, scope: !885)
!885 = !DILexicalBlockFile(scope: !862, file: !688, discriminator: 1)
!886 = !DILocation(line: 117, column: 58, scope: !887)
!887 = !DILexicalBlockFile(scope: !867, file: !688, discriminator: 2)
!888 = !DILocation(line: 120, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !862, file: !688, line: 120, column: 7)
!890 = !DILocation(line: 120, column: 12, scope: !889)
!891 = !DILocation(line: 120, column: 20, scope: !889)
!892 = !DILocation(line: 120, column: 7, scope: !862)
!893 = !DILocation(line: 121, column: 11, scope: !894)
!894 = distinct !DILexicalBlock(scope: !889, file: !688, line: 120, column: 28)
!895 = !DILocation(line: 121, column: 9, scope: !894)
!896 = !DILocation(line: 122, column: 4, scope: !894)
!897 = !DILocation(line: 125, column: 32, scope: !898)
!898 = distinct !DILexicalBlock(scope: !862, file: !688, line: 125, column: 7)
!899 = !DILocation(line: 125, column: 37, scope: !898)
!900 = !DILocation(line: 125, column: 7, scope: !898)
!901 = !DILocation(line: 125, column: 7, scope: !862)
!902 = !DILocation(line: 126, column: 11, scope: !898)
!903 = !DILocation(line: 126, column: 4, scope: !898)
!904 = !DILocation(line: 127, column: 2, scope: !862)
!905 = !DILocation(line: 112, column: 41, scope: !906)
!906 = !DILexicalBlockFile(scope: !858, file: !688, discriminator: 2)
!907 = !DILocation(line: 112, column: 46, scope: !906)
!908 = !DILocation(line: 112, column: 39, scope: !906)
!909 = !DILocation(line: 112, column: 2, scope: !906)
!910 = distinct !{!910, !911}
!911 = !DILocation(line: 112, column: 2, scope: !835)
!912 = !DILocation(line: 129, column: 9, scope: !835)
!913 = !DILocation(line: 129, column: 2, scope: !835)
!914 = !DILocation(line: 130, column: 1, scope: !835)
!915 = distinct !DISubprogram(name: "notifylist_ircnets_match", scope: !688, file: !688, line: 88, type: !916, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!916 = !DISubroutineType(types: !917)
!917 = !{!67, !43, !41}
!918 = !DILocalVariable(name: "rec", arg: 1, scope: !915, file: !688, line: 88, type: !43)
!919 = !DILocation(line: 88, column: 46, scope: !915)
!920 = !DILocalVariable(name: "ircnet", arg: 2, scope: !915, file: !688, line: 88, type: !41)
!921 = !DILocation(line: 88, column: 63, scope: !915)
!922 = !DILocalVariable(name: "tmp", scope: !915, file: !688, line: 90, type: !51)
!923 = !DILocation(line: 90, column: 9, scope: !915)
!924 = !DILocation(line: 92, column: 6, scope: !925)
!925 = distinct !DILexicalBlock(scope: !915, file: !688, line: 92, column: 6)
!926 = !DILocation(line: 92, column: 11, scope: !925)
!927 = !DILocation(line: 92, column: 19, scope: !925)
!928 = !DILocation(line: 92, column: 6, scope: !915)
!929 = !DILocation(line: 92, column: 27, scope: !930)
!930 = !DILexicalBlockFile(scope: !925, file: !688, discriminator: 1)
!931 = !DILocation(line: 93, column: 6, scope: !932)
!932 = distinct !DILexicalBlock(scope: !915, file: !688, line: 93, column: 6)
!933 = !DILocation(line: 93, column: 13, scope: !932)
!934 = !DILocation(line: 93, column: 6, scope: !915)
!935 = !DILocation(line: 93, column: 21, scope: !936)
!936 = !DILexicalBlockFile(scope: !932, file: !688, discriminator: 1)
