; ModuleID = './line79-servers-setup.o.i'
source_filename = "./line79-servers-setup.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !43, globals: !381)
!1 = !DIFile(filename: "line79-servers-setup.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 4, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!39 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!40 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!41 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!42 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!43 = !{!44, !131, !308, !310, !176, !353, !69, !360, !376}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !46, line: 113, baseType: !47)
!46 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !48, line: 25, size: 1920, align: 64, elements: !49)
!48 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !53, !54, !55, !58, !59, !60, !61, !62, !64, !65, !66, !67, !68, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !51, line: 3, baseType: !52, size: 32, align: 32)
!51 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !47, file: !51, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !47, file: !51, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !47, file: !51, line: 9, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !47, file: !51, line: 10, baseType: !52, size: 32, align: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !47, file: !51, line: 11, baseType: !56, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !47, file: !51, line: 11, baseType: !56, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !47, file: !51, line: 11, baseType: !56, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !47, file: !51, line: 13, baseType: !63, size: 16, align: 16, offset: 448)
!63 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !47, file: !51, line: 14, baseType: !56, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !47, file: !51, line: 15, baseType: !56, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !47, file: !51, line: 16, baseType: !52, size: 32, align: 32, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !47, file: !51, line: 17, baseType: !56, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !47, file: !51, line: 19, baseType: !69, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !46, line: 99, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !72, line: 22, size: 160, align: 32, elements: !73)
!72 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !71, file: !72, line: 23, baseType: !63, size: 16, align: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !71, file: !72, line: 24, baseType: !76, size: 128, align: 32, offset: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !77, line: 211, size: 128, align: 32, elements: !78)
!77 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !76, file: !77, line: 220, baseType: !80, size: 128, align: 32)
!80 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !76, file: !77, line: 213, size: 128, align: 32, elements: !81)
!81 = !{!82, !89, !94}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !80, file: !77, line: 215, baseType: !83, size: 128, align: 8)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, align: 8, elements: !87)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !85, line: 48, baseType: !86)
!85 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!86 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!87 = !{!88}
!88 = !DISubrange(count: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !80, file: !77, line: 217, baseType: !90, size: 128, align: 16)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, align: 16, elements: !92)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !85, line: 49, baseType: !63)
!92 = !{!93}
!93 = !DISubrange(count: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !80, file: !77, line: 218, baseType: !95, size: 128, align: 32)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, align: 32, elements: !98)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !85, line: 51, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !47, file: !51, line: 19, baseType: !69, size: 64, align: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !47, file: !51, line: 21, baseType: !56, size: 64, align: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !47, file: !51, line: 22, baseType: !56, size: 64, align: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !47, file: !51, line: 23, baseType: !56, size: 64, align: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !47, file: !51, line: 24, baseType: !56, size: 64, align: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !47, file: !51, line: 26, baseType: !56, size: 64, align: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !47, file: !51, line: 27, baseType: !56, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !47, file: !51, line: 28, baseType: !56, size: 64, align: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !47, file: !51, line: 29, baseType: !56, size: 64, align: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !47, file: !51, line: 30, baseType: !56, size: 64, align: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !47, file: !51, line: 31, baseType: !56, size: 64, align: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !47, file: !51, line: 32, baseType: !56, size: 64, align: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !47, file: !51, line: 33, baseType: !56, size: 64, align: 64, offset: 1600)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !47, file: !51, line: 35, baseType: !114, size: 64, align: 64, offset: 1664)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !117)
!117 = !{!118, !121, !265, !266, !271, !272, !273, !274, !275, !284, !285, !286, !290, !291, !292, !293, !294, !295, !296, !297}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !116, file: !4, line: 100, baseType: !119, size: 32, align: 32)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !120, line: 49, baseType: !52)
!120 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !116, file: !4, line: 101, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !125)
!125 = !{!126, !149, !155, !162, !166, !252, !256, !261}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !124, file: !4, line: 133, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !114, !131, !133, !136, !137}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !120, line: 46, baseType: !57)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !134, line: 66, baseType: !135)
!134 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !140, line: 42, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !140, line: 44, size: 128, align: 64, elements: !142)
!142 = !{!143, !147, !148}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !141, file: !140, line: 46, baseType: !144, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !134, line: 45, baseType: !97)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !141, file: !140, line: 47, baseType: !119, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !140, line: 48, baseType: !131, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !124, file: !4, line: 138, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!130, !114, !153, !133, !136, !137}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !124, file: !4, line: 143, baseType: !156, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!130, !114, !159, !161, !137}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !134, line: 51, baseType: !160)
!160 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !124, file: !4, line: 147, baseType: !163, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!130, !114, !137}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !124, file: !4, line: 149, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !114, !251}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !173)
!173 = !{!174, !177, !198, !227, !229, !233, !234, !235, !236, !244, !245, !246, !247}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !172, file: !16, line: 174, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !120, line: 77, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !172, file: !16, line: 175, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !181)
!181 = !{!182, !186, !187}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !180, file: !16, line: 198, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !175}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !180, file: !16, line: 199, baseType: !183, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !180, file: !16, line: 200, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !175, !170, !191, !197}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !175}
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !120, line: 50, baseType: !119)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !172, file: !16, line: 177, baseType: !199, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !203)
!203 = !{!204, !209, !213, !217, !221, !222}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !202, file: !16, line: 216, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!196, !170, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !202, file: !16, line: 218, baseType: !210, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!196, !170}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !202, file: !16, line: 219, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!196, !170, !192, !175}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !202, file: !16, line: 222, baseType: !218, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !170}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !202, file: !16, line: 226, baseType: !192, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !202, file: !16, line: 227, baseType: !223, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !172, file: !16, line: 178, baseType: !228, size: 32, align: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !120, line: 55, baseType: !97)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !172, file: !16, line: 180, baseType: !230, size: 64, align: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !232)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !172, file: !16, line: 182, baseType: !119, size: 32, align: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !16, line: 183, baseType: !228, size: 32, align: 32, offset: 352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !172, file: !16, line: 184, baseType: !228, size: 32, align: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !172, file: !16, line: 186, baseType: !237, size: 64, align: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !239, line: 37, baseType: !240)
!239 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !239, line: 39, size: 128, align: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !239, line: 41, baseType: !175, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !239, line: 42, baseType: !237, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !16, line: 188, baseType: !170, size: 64, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !16, line: 189, baseType: !170, size: 64, align: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !16, line: 191, baseType: !56, size: 64, align: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !172, file: !16, line: 193, baseType: !248, size: 64, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !124, file: !4, line: 151, baseType: !253, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !114}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !124, file: !4, line: 152, baseType: !257, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!130, !114, !260, !137}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !124, file: !4, line: 155, baseType: !262, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!260, !114}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !116, file: !4, line: 103, baseType: !131, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !116, file: !4, line: 104, baseType: !267, size: 64, align: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !268, line: 77, baseType: !269)
!268 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !268, line: 77, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !116, file: !4, line: 105, baseType: !267, size: 64, align: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !116, file: !4, line: 106, baseType: !131, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !116, file: !4, line: 107, baseType: !228, size: 32, align: 32, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !116, file: !4, line: 109, baseType: !133, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !116, file: !4, line: 110, baseType: !276, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !278, line: 39, baseType: !279)
!278 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !278, line: 41, size: 192, align: 64, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !279, file: !278, line: 43, baseType: !131, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !279, file: !278, line: 44, baseType: !133, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !279, file: !278, line: 45, baseType: !133, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !116, file: !4, line: 111, baseType: !276, size: 64, align: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !116, file: !4, line: 112, baseType: !276, size: 64, align: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !116, file: !4, line: 113, baseType: !287, size: 48, align: 8, offset: 704)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, align: 8, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !116, file: !4, line: 117, baseType: !228, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !116, file: !4, line: 118, baseType: !228, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !116, file: !4, line: 119, baseType: !228, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !116, file: !4, line: 120, baseType: !228, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !116, file: !4, line: 121, baseType: !228, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !116, file: !4, line: 122, baseType: !228, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !116, file: !4, line: 124, baseType: !175, size: 64, align: 64, offset: 768)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !116, file: !4, line: 125, baseType: !175, size: 64, align: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !47, file: !51, line: 38, baseType: !97, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !47, file: !51, line: 39, baseType: !97, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !47, file: !51, line: 40, baseType: !97, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !47, file: !51, line: 41, baseType: !97, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !47, file: !51, line: 42, baseType: !97, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !47, file: !51, line: 43, baseType: !97, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !47, file: !51, line: 44, baseType: !97, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !47, file: !51, line: 45, baseType: !97, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !47, file: !51, line: 46, baseType: !56, size: 64, align: 64, offset: 1792)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !47, file: !51, line: 47, baseType: !56, size: 64, align: 64, offset: 1856)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !46, line: 114, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !313, line: 13, size: 1408, align: 64, elements: !314)
!313 = !DIFile(filename: "servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !341, !342, !343, !344, !345, !346, !347, !348}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !316, line: 1, baseType: !52, size: 32, align: 32)
!316 = !DIFile(filename: "server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !312, file: !316, line: 2, baseType: !52, size: 32, align: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !312, file: !316, line: 4, baseType: !56, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !312, file: !316, line: 6, baseType: !63, size: 16, align: 16, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !312, file: !316, line: 7, baseType: !56, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !312, file: !316, line: 8, baseType: !52, size: 32, align: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !312, file: !316, line: 9, baseType: !56, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !312, file: !316, line: 11, baseType: !52, size: 32, align: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !312, file: !316, line: 12, baseType: !56, size: 64, align: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !312, file: !316, line: 14, baseType: !56, size: 64, align: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !312, file: !316, line: 15, baseType: !56, size: 64, align: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !312, file: !316, line: 16, baseType: !56, size: 64, align: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !312, file: !316, line: 17, baseType: !56, size: 64, align: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !312, file: !316, line: 18, baseType: !56, size: 64, align: 64, offset: 768)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !312, file: !316, line: 19, baseType: !56, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !312, file: !316, line: 20, baseType: !56, size: 64, align: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !312, file: !316, line: 21, baseType: !56, size: 64, align: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !312, file: !316, line: 23, baseType: !56, size: 64, align: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !312, file: !316, line: 24, baseType: !69, size: 64, align: 64, offset: 1088)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !312, file: !316, line: 24, baseType: !69, size: 64, align: 64, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !312, file: !316, line: 26, baseType: !337, size: 64, align: 64, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !338, line: 75, baseType: !339)
!338 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !340, line: 139, baseType: !160)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !312, file: !316, line: 28, baseType: !97, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !312, file: !316, line: 29, baseType: !97, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !312, file: !316, line: 30, baseType: !97, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !312, file: !316, line: 31, baseType: !97, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !312, file: !316, line: 32, baseType: !97, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !312, file: !316, line: 33, baseType: !97, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !312, file: !316, line: 34, baseType: !97, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !312, file: !316, line: 36, baseType: !349, size: 64, align: 64, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !351, line: 37, baseType: !352)
!351 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !351, line: 37, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !354, line: 9, baseType: !355)
!354 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358, !358, !358, !358, !358, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !46, line: 106, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !363, line: 13, size: 576, align: 64, elements: !364)
!363 = !DIFile(filename: "chatnets.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = !{!365, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !366, line: 1, baseType: !52, size: 32, align: 32)
!366 = !DIFile(filename: "chatnet-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !362, file: !366, line: 2, baseType: !52, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !366, line: 4, baseType: !56, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !362, file: !366, line: 6, baseType: !56, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !362, file: !366, line: 7, baseType: !56, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !362, file: !366, line: 8, baseType: !56, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !362, file: !366, line: 10, baseType: !56, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !362, file: !366, line: 11, baseType: !56, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !362, file: !366, line: 12, baseType: !69, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !362, file: !366, line: 12, baseType: !69, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !120, line: 80, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!119, !380, !380}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !120, line: 78, baseType: !358)
!381 = !{!382, !384, !385, !386, !387}
!382 = distinct !DIGlobalVariable(name: "setupservers", scope: !0, file: !383, line: 32, type: !237, isLocal: false, isDefinition: true, variable: %struct._GSList** @setupservers)
!383 = !DIFile(filename: "servers-setup.c", directory: "/home/lichi/Desktop/irssi/task1")
!384 = distinct !DIGlobalVariable(name: "old_source_host", scope: !0, file: !383, line: 34, type: !56, isLocal: true, isDefinition: true, variable: i8** @old_source_host)
!385 = distinct !DIGlobalVariable(name: "source_host_ok", scope: !0, file: !383, line: 35, type: !52, isLocal: false, isDefinition: true, variable: i32* @source_host_ok)
!386 = distinct !DIGlobalVariable(name: "source_host_ip4", scope: !0, file: !383, line: 36, type: !69, isLocal: false, isDefinition: true, variable: %struct._IPADDR** @source_host_ip4)
!387 = distinct !DIGlobalVariable(name: "source_host_ip6", scope: !0, file: !383, line: 36, type: !69, isLocal: false, isDefinition: true, variable: %struct._IPADDR** @source_host_ip6)
!388 = !{i32 2, !"Dwarf Version", i32 4}
!389 = !{i32 2, !"Debug Info Version", i32 3}
!390 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!391 = distinct !DISubprogram(name: "server_setup_fill_reconn", scope: !383, file: !383, line: 94, type: !392, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !44, !310}
!394 = !{}
!395 = !DILocalVariable(name: "conn", arg: 1, scope: !391, file: !383, line: 94, type: !44)
!396 = !DIExpression()
!397 = !DILocation(line: 94, column: 51, scope: !391)
!398 = !DILocalVariable(name: "sserver", arg: 2, scope: !391, file: !383, line: 95, type: !310)
!399 = !DILocation(line: 95, column: 28, scope: !391)
!400 = !DILocation(line: 97, column: 2, scope: !391)
!401 = distinct !{!401, !400}
!402 = !DILocation(line: 97, column: 53, scope: !403)
!403 = !DILexicalBlockFile(scope: !404, file: !383, discriminator: 1)
!404 = distinct !DILexicalBlock(scope: !405, file: !383, line: 97, column: 10)
!405 = distinct !DILexicalBlock(scope: !391, file: !383, line: 97, column: 4)
!406 = !DILocation(line: 97, column: 35, scope: !403)
!407 = !DILocation(line: 97, column: 12, scope: !403)
!408 = !DILocation(line: 97, column: 10, scope: !403)
!409 = !DILocation(line: 97, column: 11, scope: !410)
!410 = !DILexicalBlockFile(scope: !404, file: !383, discriminator: 2)
!411 = !DILocation(line: 97, column: 10, scope: !412)
!412 = !DILexicalBlockFile(scope: !405, file: !383, discriminator: 3)
!413 = !DILocation(line: 97, column: 41, scope: !414)
!414 = !DILexicalBlockFile(scope: !415, file: !383, discriminator: 4)
!415 = distinct !DILexicalBlock(scope: !404, file: !383, line: 97, column: 39)
!416 = !DILocation(line: 97, column: 50, scope: !417)
!417 = !DILexicalBlockFile(scope: !418, file: !383, discriminator: 5)
!418 = distinct !DILexicalBlock(scope: !404, file: !383, line: 97, column: 48)
!419 = !DILocation(line: 97, column: 146, scope: !417)
!420 = !DILocation(line: 97, column: 157, scope: !421)
!421 = !DILexicalBlockFile(scope: !405, file: !383, discriminator: 6)
!422 = !DILocation(line: 98, column: 2, scope: !391)
!423 = distinct !{!423, !422}
!424 = !DILocation(line: 98, column: 51, scope: !425)
!425 = !DILexicalBlockFile(scope: !426, file: !383, discriminator: 1)
!426 = distinct !DILexicalBlock(scope: !427, file: !383, line: 98, column: 10)
!427 = distinct !DILexicalBlock(scope: !391, file: !383, line: 98, column: 4)
!428 = !DILocation(line: 98, column: 33, scope: !425)
!429 = !DILocation(line: 98, column: 12, scope: !425)
!430 = !DILocation(line: 98, column: 10, scope: !425)
!431 = !DILocation(line: 98, column: 11, scope: !432)
!432 = !DILexicalBlockFile(scope: !426, file: !383, discriminator: 2)
!433 = !DILocation(line: 98, column: 10, scope: !434)
!434 = !DILexicalBlockFile(scope: !427, file: !383, discriminator: 3)
!435 = !DILocation(line: 98, column: 39, scope: !436)
!436 = !DILexicalBlockFile(scope: !437, file: !383, discriminator: 4)
!437 = distinct !DILexicalBlock(scope: !426, file: !383, line: 98, column: 37)
!438 = !DILocation(line: 98, column: 48, scope: !439)
!439 = !DILexicalBlockFile(scope: !440, file: !383, discriminator: 5)
!440 = distinct !DILexicalBlock(scope: !426, file: !383, line: 98, column: 46)
!441 = !DILocation(line: 98, column: 145, scope: !439)
!442 = !DILocation(line: 98, column: 156, scope: !443)
!443 = !DILexicalBlockFile(scope: !427, file: !383, discriminator: 6)
!444 = !DILocation(line: 100, column: 6, scope: !445)
!445 = distinct !DILexicalBlock(scope: !391, file: !383, line: 100, column: 6)
!446 = !DILocation(line: 100, column: 15, scope: !445)
!447 = !DILocation(line: 100, column: 24, scope: !445)
!448 = !DILocation(line: 100, column: 6, scope: !391)
!449 = !DILocation(line: 101, column: 15, scope: !450)
!450 = distinct !DILexicalBlock(scope: !445, file: !383, line: 100, column: 32)
!451 = !DILocation(line: 101, column: 21, scope: !450)
!452 = !DILocation(line: 101, column: 30, scope: !450)
!453 = !DILocation(line: 102, column: 9, scope: !450)
!454 = !DILocation(line: 102, column: 18, scope: !450)
!455 = !DILocation(line: 102, column: 28, scope: !450)
!456 = !DILocation(line: 102, column: 37, scope: !450)
!457 = !DILocation(line: 101, column: 3, scope: !450)
!458 = !DILocation(line: 103, column: 2, scope: !450)
!459 = !DILocation(line: 105, column: 6, scope: !460)
!460 = distinct !DILexicalBlock(scope: !391, file: !383, line: 105, column: 6)
!461 = !DILocation(line: 105, column: 15, scope: !460)
!462 = !DILocation(line: 105, column: 23, scope: !460)
!463 = !DILocation(line: 105, column: 30, scope: !460)
!464 = !DILocation(line: 105, column: 33, scope: !465)
!465 = !DILexicalBlockFile(scope: !460, file: !383, discriminator: 1)
!466 = !DILocation(line: 105, column: 39, scope: !465)
!467 = !DILocation(line: 105, column: 47, scope: !465)
!468 = !DILocation(line: 105, column: 6, scope: !465)
!469 = !DILocation(line: 106, column: 28, scope: !460)
!470 = !DILocation(line: 106, column: 37, scope: !460)
!471 = !DILocation(line: 106, column: 19, scope: !460)
!472 = !DILocation(line: 106, column: 3, scope: !460)
!473 = !DILocation(line: 106, column: 9, scope: !460)
!474 = !DILocation(line: 106, column: 17, scope: !460)
!475 = !DILocation(line: 108, column: 6, scope: !476)
!476 = distinct !DILexicalBlock(scope: !391, file: !383, line: 108, column: 6)
!477 = !DILocation(line: 108, column: 15, scope: !476)
!478 = !DILocation(line: 108, column: 24, scope: !476)
!479 = !DILocation(line: 108, column: 31, scope: !476)
!480 = !DILocation(line: 108, column: 34, scope: !481)
!481 = !DILexicalBlockFile(scope: !476, file: !383, discriminator: 1)
!482 = !DILocation(line: 108, column: 40, scope: !481)
!483 = !DILocation(line: 108, column: 49, scope: !481)
!484 = !DILocation(line: 108, column: 6, scope: !481)
!485 = !DILocation(line: 109, column: 29, scope: !476)
!486 = !DILocation(line: 109, column: 38, scope: !476)
!487 = !DILocation(line: 109, column: 20, scope: !476)
!488 = !DILocation(line: 109, column: 3, scope: !476)
!489 = !DILocation(line: 109, column: 9, scope: !476)
!490 = !DILocation(line: 109, column: 18, scope: !476)
!491 = !DILocation(line: 111, column: 45, scope: !391)
!492 = !DILocation(line: 111, column: 51, scope: !391)
!493 = !DILocation(line: 111, column: 2, scope: !391)
!494 = !DILocation(line: 112, column: 1, scope: !391)
!495 = !DILocation(line: 112, column: 1, scope: !496)
!496 = !DILexicalBlockFile(scope: !391, file: !383, discriminator: 1)
!497 = distinct !DISubprogram(name: "conn_set_ip", scope: !383, file: !383, line: 79, type: !498, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !44, !308, !500, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!501 = !DILocalVariable(name: "conn", arg: 1, scope: !497, file: !383, line: 79, type: !44)
!502 = !DILocation(line: 79, column: 45, scope: !497)
!503 = !DILocalVariable(name: "own_host", arg: 2, scope: !497, file: !383, line: 79, type: !308)
!504 = !DILocation(line: 79, column: 63, scope: !497)
!505 = !DILocalVariable(name: "own_ip4", arg: 3, scope: !497, file: !383, line: 80, type: !500)
!506 = !DILocation(line: 80, column: 13, scope: !497)
!507 = !DILocalVariable(name: "own_ip6", arg: 4, scope: !497, file: !383, line: 80, type: !500)
!508 = !DILocation(line: 80, column: 31, scope: !497)
!509 = !DILocalVariable(name: "ip4", scope: !497, file: !383, line: 82, type: !70)
!510 = !DILocation(line: 82, column: 9, scope: !497)
!511 = !DILocalVariable(name: "ip6", scope: !497, file: !383, line: 82, type: !70)
!512 = !DILocation(line: 82, column: 14, scope: !497)
!513 = !DILocation(line: 84, column: 7, scope: !514)
!514 = distinct !DILexicalBlock(scope: !497, file: !383, line: 84, column: 6)
!515 = !DILocation(line: 84, column: 6, scope: !514)
!516 = !DILocation(line: 84, column: 15, scope: !514)
!517 = !DILocation(line: 84, column: 22, scope: !514)
!518 = !DILocation(line: 84, column: 26, scope: !519)
!519 = !DILexicalBlockFile(scope: !514, file: !383, discriminator: 1)
!520 = !DILocation(line: 84, column: 25, scope: !519)
!521 = !DILocation(line: 84, column: 34, scope: !519)
!522 = !DILocation(line: 84, column: 6, scope: !519)
!523 = !DILocation(line: 86, column: 25, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !383, line: 86, column: 7)
!525 = distinct !DILexicalBlock(scope: !514, file: !383, line: 84, column: 43)
!526 = !DILocation(line: 86, column: 7, scope: !524)
!527 = !DILocation(line: 86, column: 47, scope: !524)
!528 = !DILocation(line: 86, column: 7, scope: !525)
!529 = !DILocation(line: 87, column: 46, scope: !524)
!530 = !DILocation(line: 87, column: 55, scope: !524)
!531 = !DILocation(line: 87, column: 25, scope: !524)
!532 = !DILocation(line: 88, column: 2, scope: !525)
!533 = !DILocation(line: 90, column: 29, scope: !497)
!534 = !DILocation(line: 90, column: 36, scope: !497)
!535 = !DILocation(line: 90, column: 35, scope: !497)
!536 = !DILocation(line: 90, column: 46, scope: !497)
!537 = !DILocation(line: 90, column: 45, scope: !497)
!538 = !DILocation(line: 90, column: 2, scope: !497)
!539 = !DILocation(line: 91, column: 1, scope: !497)
!540 = distinct !DISubprogram(name: "server_create_conn", scope: !383, file: !383, line: 316, type: !541, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!541 = !DISubroutineType(types: !542)
!542 = !{!44, !52, !308, !52, !308, !308, !308}
!543 = !DILocalVariable(name: "chat_type", arg: 1, scope: !540, file: !383, line: 316, type: !52)
!544 = !DILocation(line: 316, column: 24, scope: !540)
!545 = !DILocalVariable(name: "dest", arg: 2, scope: !540, file: !383, line: 316, type: !308)
!546 = !DILocation(line: 316, column: 47, scope: !540)
!547 = !DILocalVariable(name: "port", arg: 3, scope: !540, file: !383, line: 316, type: !52)
!548 = !DILocation(line: 316, column: 57, scope: !540)
!549 = !DILocalVariable(name: "chatnet", arg: 4, scope: !540, file: !383, line: 317, type: !308)
!550 = !DILocation(line: 317, column: 18, scope: !540)
!551 = !DILocalVariable(name: "password", arg: 5, scope: !540, file: !383, line: 317, type: !308)
!552 = !DILocation(line: 317, column: 39, scope: !540)
!553 = !DILocalVariable(name: "nick", arg: 6, scope: !540, file: !383, line: 318, type: !308)
!554 = !DILocation(line: 318, column: 18, scope: !540)
!555 = !DILocalVariable(name: "rec", scope: !540, file: !383, line: 320, type: !44)
!556 = !DILocation(line: 320, column: 22, scope: !540)
!557 = !DILocalVariable(name: "chatrec", scope: !540, file: !383, line: 321, type: !360)
!558 = !DILocation(line: 321, column: 22, scope: !540)
!559 = !DILocation(line: 323, column: 2, scope: !540)
!560 = distinct !{!560, !559}
!561 = !DILocation(line: 323, column: 10, scope: !562)
!562 = !DILexicalBlockFile(scope: !563, file: !383, discriminator: 1)
!563 = distinct !DILexicalBlock(scope: !564, file: !383, line: 323, column: 10)
!564 = distinct !DILexicalBlock(scope: !540, file: !383, line: 323, column: 4)
!565 = !DILocation(line: 323, column: 15, scope: !562)
!566 = !DILocation(line: 323, column: 5, scope: !567)
!567 = !DILexicalBlockFile(scope: !568, file: !383, discriminator: 2)
!568 = distinct !DILexicalBlock(scope: !563, file: !383, line: 323, column: 3)
!569 = !DILocation(line: 323, column: 14, scope: !570)
!570 = !DILexicalBlockFile(scope: !571, file: !383, discriminator: 3)
!571 = distinct !DILexicalBlock(scope: !563, file: !383, line: 323, column: 12)
!572 = !DILocation(line: 323, column: 99, scope: !570)
!573 = !DILocation(line: 323, column: 7, scope: !574)
!574 = !DILexicalBlockFile(scope: !564, file: !383, discriminator: 4)
!575 = !DILocation(line: 325, column: 32, scope: !540)
!576 = !DILocation(line: 325, column: 19, scope: !540)
!577 = !DILocation(line: 325, column: 17, scope: !540)
!578 = !DILocation(line: 326, column: 6, scope: !579)
!579 = distinct !DILexicalBlock(scope: !540, file: !383, line: 326, column: 6)
!580 = !DILocation(line: 326, column: 14, scope: !579)
!581 = !DILocation(line: 326, column: 6, scope: !540)
!582 = !DILocation(line: 327, column: 29, scope: !583)
!583 = distinct !DILexicalBlock(scope: !579, file: !383, line: 326, column: 22)
!584 = !DILocation(line: 327, column: 38, scope: !583)
!585 = !DILocation(line: 327, column: 44, scope: !583)
!586 = !DILocation(line: 327, column: 50, scope: !583)
!587 = !DILocation(line: 327, column: 60, scope: !583)
!588 = !DILocation(line: 327, column: 9, scope: !583)
!589 = !DILocation(line: 327, column: 7, scope: !583)
!590 = !DILocation(line: 329, column: 10, scope: !583)
!591 = !DILocation(line: 329, column: 3, scope: !583)
!592 = !DILocation(line: 332, column: 12, scope: !540)
!593 = !DILocation(line: 332, column: 20, scope: !540)
!594 = !DILocation(line: 332, column: 12, scope: !595)
!595 = !DILexicalBlockFile(scope: !540, file: !383, discriminator: 1)
!596 = !DILocation(line: 332, column: 49, scope: !597)
!597 = !DILexicalBlockFile(scope: !540, file: !383, discriminator: 2)
!598 = !DILocation(line: 332, column: 36, scope: !597)
!599 = !DILocation(line: 332, column: 12, scope: !597)
!600 = !DILocation(line: 332, column: 12, scope: !601)
!601 = !DILexicalBlockFile(scope: !540, file: !383, discriminator: 3)
!602 = !DILocation(line: 332, column: 10, scope: !601)
!603 = !DILocation(line: 333, column: 6, scope: !604)
!604 = distinct !DILexicalBlock(scope: !540, file: !383, line: 333, column: 6)
!605 = !DILocation(line: 333, column: 14, scope: !604)
!606 = !DILocation(line: 333, column: 6, scope: !540)
!607 = !DILocation(line: 334, column: 13, scope: !604)
!608 = !DILocation(line: 334, column: 22, scope: !604)
!609 = !DILocation(line: 334, column: 11, scope: !604)
!610 = !DILocation(line: 334, column: 3, scope: !604)
!611 = !DILocation(line: 336, column: 26, scope: !540)
!612 = !DILocation(line: 336, column: 37, scope: !540)
!613 = !DILocation(line: 336, column: 43, scope: !540)
!614 = !DILocation(line: 337, column: 5, scope: !540)
!615 = !DILocation(line: 337, column: 14, scope: !540)
!616 = !DILocation(line: 337, column: 24, scope: !540)
!617 = !DILocation(line: 336, column: 9, scope: !540)
!618 = !DILocation(line: 336, column: 2, scope: !540)
!619 = !DILocation(line: 338, column: 1, scope: !540)
!620 = distinct !DISubprogram(name: "create_chatnet_conn", scope: !383, file: !383, line: 281, type: !621, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!621 = !DISubroutineType(types: !622)
!622 = !{!44, !308, !52, !308, !308}
!623 = !DILocalVariable(name: "dest", arg: 1, scope: !620, file: !383, line: 281, type: !308)
!624 = !DILocation(line: 281, column: 33, scope: !620)
!625 = !DILocalVariable(name: "port", arg: 2, scope: !620, file: !383, line: 281, type: !52)
!626 = !DILocation(line: 281, column: 43, scope: !620)
!627 = !DILocalVariable(name: "password", arg: 3, scope: !620, file: !383, line: 282, type: !308)
!628 = !DILocation(line: 282, column: 19, scope: !620)
!629 = !DILocalVariable(name: "nick", arg: 4, scope: !620, file: !383, line: 282, type: !308)
!630 = !DILocation(line: 282, column: 41, scope: !620)
!631 = !DILocalVariable(name: "bestrec", scope: !620, file: !383, line: 284, type: !310)
!632 = !DILocation(line: 284, column: 20, scope: !620)
!633 = !DILocalVariable(name: "tmp", scope: !620, file: !383, line: 285, type: !237)
!634 = !DILocation(line: 285, column: 10, scope: !620)
!635 = !DILocalVariable(name: "now", scope: !620, file: !383, line: 286, type: !337)
!636 = !DILocation(line: 286, column: 9, scope: !620)
!637 = !DILocalVariable(name: "besttime", scope: !620, file: !383, line: 286, type: !337)
!638 = !DILocation(line: 286, column: 14, scope: !620)
!639 = !DILocation(line: 288, column: 8, scope: !620)
!640 = !DILocation(line: 288, column: 6, scope: !620)
!641 = !DILocation(line: 289, column: 10, scope: !620)
!642 = !DILocation(line: 289, column: 28, scope: !620)
!643 = !DILocation(line: 289, column: 26, scope: !620)
!644 = !DILocation(line: 290, column: 13, scope: !645)
!645 = distinct !DILexicalBlock(scope: !620, file: !383, line: 290, column: 2)
!646 = !DILocation(line: 290, column: 11, scope: !645)
!647 = !DILocation(line: 290, column: 7, scope: !645)
!648 = !DILocation(line: 290, column: 27, scope: !649)
!649 = !DILexicalBlockFile(scope: !650, file: !383, discriminator: 1)
!650 = distinct !DILexicalBlock(scope: !645, file: !383, line: 290, column: 2)
!651 = !DILocation(line: 290, column: 31, scope: !649)
!652 = !DILocation(line: 290, column: 2, scope: !649)
!653 = !DILocalVariable(name: "rec", scope: !654, file: !383, line: 291, type: !310)
!654 = distinct !DILexicalBlock(scope: !650, file: !383, line: 290, column: 56)
!655 = !DILocation(line: 291, column: 21, scope: !654)
!656 = !DILocation(line: 291, column: 27, scope: !654)
!657 = !DILocation(line: 291, column: 32, scope: !654)
!658 = !DILocation(line: 293, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !654, file: !383, line: 293, column: 7)
!660 = !DILocation(line: 293, column: 12, scope: !659)
!661 = !DILocation(line: 293, column: 20, scope: !659)
!662 = !DILocation(line: 293, column: 27, scope: !659)
!663 = !DILocation(line: 294, column: 26, scope: !659)
!664 = !DILocation(line: 294, column: 31, scope: !659)
!665 = !DILocation(line: 294, column: 40, scope: !659)
!666 = !DILocation(line: 294, column: 7, scope: !659)
!667 = !DILocation(line: 294, column: 46, scope: !659)
!668 = !DILocation(line: 293, column: 7, scope: !669)
!669 = !DILexicalBlockFile(scope: !654, file: !383, discriminator: 1)
!670 = !DILocation(line: 295, column: 4, scope: !659)
!671 = !DILocation(line: 297, column: 8, scope: !672)
!672 = distinct !DILexicalBlock(scope: !654, file: !383, line: 297, column: 7)
!673 = !DILocation(line: 297, column: 13, scope: !672)
!674 = !DILocation(line: 297, column: 7, scope: !654)
!675 = !DILocation(line: 298, column: 14, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !383, line: 297, column: 26)
!677 = !DILocation(line: 298, column: 12, scope: !676)
!678 = !DILocation(line: 299, column: 4, scope: !676)
!679 = !DILocation(line: 302, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !654, file: !383, line: 302, column: 7)
!681 = !DILocation(line: 302, column: 15, scope: !680)
!682 = !DILocation(line: 302, column: 22, scope: !680)
!683 = !DILocation(line: 302, column: 25, scope: !684)
!684 = !DILexicalBlockFile(scope: !680, file: !383, discriminator: 1)
!685 = !DILocation(line: 302, column: 36, scope: !684)
!686 = !DILocation(line: 302, column: 41, scope: !684)
!687 = !DILocation(line: 302, column: 34, scope: !684)
!688 = !DILocation(line: 302, column: 7, scope: !684)
!689 = !DILocation(line: 303, column: 14, scope: !690)
!690 = distinct !DILexicalBlock(scope: !680, file: !383, line: 302, column: 55)
!691 = !DILocation(line: 303, column: 12, scope: !690)
!692 = !DILocation(line: 304, column: 15, scope: !690)
!693 = !DILocation(line: 304, column: 20, scope: !690)
!694 = !DILocation(line: 304, column: 13, scope: !690)
!695 = !DILocation(line: 305, column: 3, scope: !690)
!696 = !DILocation(line: 306, column: 2, scope: !654)
!697 = !DILocation(line: 290, column: 45, scope: !698)
!698 = !DILexicalBlockFile(scope: !650, file: !383, discriminator: 2)
!699 = !DILocation(line: 290, column: 50, scope: !698)
!700 = !DILocation(line: 290, column: 43, scope: !698)
!701 = !DILocation(line: 290, column: 2, scope: !698)
!702 = distinct !{!702, !703}
!703 = !DILocation(line: 290, column: 2, scope: !620)
!704 = !DILocation(line: 308, column: 9, scope: !620)
!705 = !DILocation(line: 308, column: 17, scope: !620)
!706 = !DILocation(line: 308, column: 9, scope: !707)
!707 = !DILexicalBlockFile(scope: !620, file: !383, discriminator: 1)
!708 = !DILocation(line: 309, column: 20, scope: !620)
!709 = !DILocation(line: 309, column: 29, scope: !620)
!710 = !DILocation(line: 309, column: 40, scope: !620)
!711 = !DILocation(line: 309, column: 49, scope: !620)
!712 = !DILocation(line: 310, column: 6, scope: !620)
!713 = !DILocation(line: 310, column: 17, scope: !620)
!714 = !DILocation(line: 309, column: 3, scope: !620)
!715 = !DILocation(line: 308, column: 9, scope: !716)
!716 = !DILexicalBlockFile(scope: !620, file: !383, discriminator: 2)
!717 = !DILocation(line: 308, column: 9, scope: !718)
!718 = !DILexicalBlockFile(scope: !620, file: !383, discriminator: 3)
!719 = !DILocation(line: 308, column: 2, scope: !718)
!720 = distinct !DISubprogram(name: "create_addr_conn", scope: !383, file: !383, line: 221, type: !541, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!721 = !DILocalVariable(name: "chat_type", arg: 1, scope: !720, file: !383, line: 221, type: !52)
!722 = !DILocation(line: 221, column: 22, scope: !720)
!723 = !DILocalVariable(name: "address", arg: 2, scope: !720, file: !383, line: 221, type: !308)
!724 = !DILocation(line: 221, column: 45, scope: !720)
!725 = !DILocalVariable(name: "port", arg: 3, scope: !720, file: !383, line: 221, type: !52)
!726 = !DILocation(line: 221, column: 58, scope: !720)
!727 = !DILocalVariable(name: "chatnet", arg: 4, scope: !720, file: !383, line: 222, type: !308)
!728 = !DILocation(line: 222, column: 16, scope: !720)
!729 = !DILocalVariable(name: "password", arg: 5, scope: !720, file: !383, line: 222, type: !308)
!730 = !DILocation(line: 222, column: 37, scope: !720)
!731 = !DILocalVariable(name: "nick", arg: 6, scope: !720, file: !383, line: 223, type: !308)
!732 = !DILocation(line: 223, column: 16, scope: !720)
!733 = !DILocalVariable(name: "proto", scope: !720, file: !383, line: 225, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !46, line: 105, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !737, line: 4, size: 832, align: 64, elements: !738)
!737 = !DIFile(filename: "chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!738 = !{!739, !740, !741, !742, !743, !744, !745, !749, !753, !760, !764, !768, !868, !872, !876}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !736, file: !737, line: 5, baseType: !52, size: 32, align: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !736, file: !737, line: 7, baseType: !97, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !736, file: !737, line: 8, baseType: !97, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !736, file: !737, line: 10, baseType: !56, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !736, file: !737, line: 11, baseType: !56, size: 64, align: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !736, file: !737, line: 12, baseType: !56, size: 64, align: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !736, file: !737, line: 14, baseType: !746, size: 64, align: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!360}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !736, file: !737, line: 15, baseType: !750, size: 64, align: 64, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!310}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !736, file: !737, line: 16, baseType: !754, size: 64, align: 64, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !46, line: 115, baseType: !759)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !46, line: 115, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !736, file: !737, line: 17, baseType: !761, size: 64, align: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!44}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !736, file: !737, line: 18, baseType: !765, size: 64, align: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !44}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !736, file: !737, line: 20, baseType: !769, size: 64, align: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !44}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !46, line: 107, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !48, line: 30, size: 2240, align: 64, elements: !775)
!775 = !{!776, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !794, !795, !799, !800, !801, !805, !806, !807, !808, !809, !810, !811, !812, !813, !820, !821, !822, !823, !824, !828, !832, !836, !840, !844, !849, !856, !863, !867}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !777, line: 3, baseType: !52, size: 32, align: 32)
!777 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !774, file: !777, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !774, file: !777, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !774, file: !777, line: 8, baseType: !44, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !774, file: !777, line: 9, baseType: !337, size: 64, align: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !774, file: !777, line: 10, baseType: !337, size: 64, align: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !774, file: !777, line: 12, baseType: !56, size: 64, align: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !774, file: !777, line: 13, baseType: !56, size: 64, align: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !774, file: !777, line: 15, baseType: !97, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !774, file: !777, line: 16, baseType: !97, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !774, file: !777, line: 17, baseType: !97, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !774, file: !777, line: 18, baseType: !97, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !774, file: !777, line: 19, baseType: !97, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !774, file: !777, line: 21, baseType: !791, size: 64, align: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !46, line: 102, baseType: !793)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !46, line: 102, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !774, file: !777, line: 22, baseType: !52, size: 32, align: 32, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !774, file: !777, line: 25, baseType: !796, size: 128, align: 64, offset: 640)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, align: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 2)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !774, file: !777, line: 26, baseType: !52, size: 32, align: 32, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !774, file: !777, line: 27, baseType: !52, size: 32, align: 32, offset: 800)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !774, file: !777, line: 29, baseType: !802, size: 64, align: 64, offset: 832)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !46, line: 103, baseType: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !46, line: 103, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !774, file: !777, line: 30, baseType: !349, size: 64, align: 64, offset: 896)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !774, file: !777, line: 32, baseType: !56, size: 64, align: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !774, file: !777, line: 33, baseType: !56, size: 64, align: 64, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !774, file: !777, line: 34, baseType: !56, size: 64, align: 64, offset: 1088)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !774, file: !777, line: 35, baseType: !97, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !774, file: !777, line: 36, baseType: !97, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !774, file: !777, line: 37, baseType: !97, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !774, file: !777, line: 38, baseType: !97, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !774, file: !777, line: 40, baseType: !814, size: 128, align: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !120, line: 504, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !120, line: 506, size: 128, align: 64, elements: !816)
!816 = !{!817, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !815, file: !120, line: 508, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !120, line: 48, baseType: !160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !815, file: !120, line: 509, baseType: !818, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !774, file: !777, line: 41, baseType: !337, size: 64, align: 64, offset: 1344)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !774, file: !777, line: 42, baseType: !52, size: 32, align: 32, offset: 1408)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !774, file: !777, line: 44, baseType: !237, size: 64, align: 64, offset: 1472)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !774, file: !777, line: 45, baseType: !237, size: 64, align: 64, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !774, file: !777, line: 53, baseType: !825, size: 64, align: 64, offset: 1600)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64, align: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !772, !308, !52}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !774, file: !777, line: 55, baseType: !829, size: 64, align: 64, offset: 1664)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!52, !772, !57}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !774, file: !777, line: 57, baseType: !833, size: 64, align: 64, offset: 1728)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!52, !772, !308}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !774, file: !777, line: 60, baseType: !837, size: 64, align: 64, offset: 1792)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!308, !772}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !774, file: !777, line: 62, baseType: !841, size: 64, align: 64, offset: 1856)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !772, !308, !308, !52}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !774, file: !777, line: 65, baseType: !845, size: 64, align: 64, offset: 1920)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!848, !772, !308, !308}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !774, file: !777, line: 69, baseType: !850, size: 64, align: 64, offset: 1984)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !772, !308}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !46, line: 109, baseType: !855)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !46, line: 109, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !774, file: !777, line: 70, baseType: !857, size: 64, align: 64, offset: 2048)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!860, !772, !308}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !46, line: 110, baseType: !862)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !46, line: 110, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !774, file: !777, line: 71, baseType: !864, size: 64, align: 64, offset: 2112)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!52, !308, !308}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !774, file: !777, line: 73, baseType: !864, size: 64, align: 64, offset: 2176)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "server_connect", scope: !736, file: !737, line: 21, baseType: !869, size: 64, align: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !772}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "channel_create", scope: !736, file: !737, line: 22, baseType: !873, size: 64, align: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!853, !772, !308, !308, !52}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "query_create", scope: !736, file: !737, line: 24, baseType: !877, size: 64, align: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!860, !308, !308, !52}
!880 = !DILocation(line: 225, column: 28, scope: !720)
!881 = !DILocalVariable(name: "conn", scope: !720, file: !383, line: 226, type: !44)
!882 = !DILocation(line: 226, column: 22, scope: !720)
!883 = !DILocalVariable(name: "sserver", scope: !720, file: !383, line: 227, type: !310)
!884 = !DILocation(line: 227, column: 20, scope: !720)
!885 = !DILocalVariable(name: "chatnetrec", scope: !720, file: !383, line: 228, type: !360)
!886 = !DILocation(line: 228, column: 15, scope: !720)
!887 = !DILocation(line: 230, column: 2, scope: !720)
!888 = distinct !{!888, !887}
!889 = !DILocation(line: 230, column: 10, scope: !890)
!890 = !DILexicalBlockFile(scope: !891, file: !383, discriminator: 1)
!891 = distinct !DILexicalBlock(scope: !892, file: !383, line: 230, column: 10)
!892 = distinct !DILexicalBlock(scope: !720, file: !383, line: 230, column: 4)
!893 = !DILocation(line: 230, column: 18, scope: !890)
!894 = !DILocation(line: 230, column: 5, scope: !895)
!895 = !DILexicalBlockFile(scope: !896, file: !383, discriminator: 2)
!896 = distinct !DILexicalBlock(scope: !891, file: !383, line: 230, column: 3)
!897 = !DILocation(line: 230, column: 14, scope: !898)
!898 = !DILexicalBlockFile(scope: !899, file: !383, discriminator: 3)
!899 = distinct !DILexicalBlock(scope: !891, file: !383, line: 230, column: 12)
!900 = !DILocation(line: 230, column: 102, scope: !898)
!901 = !DILocation(line: 230, column: 7, scope: !902)
!902 = !DILexicalBlockFile(scope: !892, file: !383, discriminator: 4)
!903 = !DILocation(line: 232, column: 30, scope: !720)
!904 = !DILocation(line: 232, column: 39, scope: !720)
!905 = !DILocation(line: 232, column: 45, scope: !720)
!906 = !DILocation(line: 232, column: 12, scope: !720)
!907 = !DILocation(line: 232, column: 10, scope: !720)
!908 = !DILocation(line: 233, column: 6, scope: !909)
!909 = distinct !DILexicalBlock(scope: !720, file: !383, line: 233, column: 6)
!910 = !DILocation(line: 233, column: 14, scope: !909)
!911 = !DILocation(line: 233, column: 6, scope: !720)
!912 = !DILocation(line: 234, column: 7, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !383, line: 234, column: 7)
!914 = distinct !DILexicalBlock(scope: !909, file: !383, line: 233, column: 22)
!915 = !DILocation(line: 234, column: 17, scope: !913)
!916 = !DILocation(line: 234, column: 7, scope: !914)
!917 = !DILocation(line: 235, column: 16, scope: !913)
!918 = !DILocation(line: 235, column: 25, scope: !913)
!919 = !DILocation(line: 235, column: 14, scope: !913)
!920 = !DILocation(line: 235, column: 4, scope: !913)
!921 = !DILocation(line: 236, column: 12, scope: !922)
!922 = distinct !DILexicalBlock(scope: !913, file: !383, line: 236, column: 12)
!923 = !DILocation(line: 236, column: 25, scope: !922)
!924 = !DILocation(line: 236, column: 34, scope: !922)
!925 = !DILocation(line: 236, column: 22, scope: !922)
!926 = !DILocation(line: 236, column: 12, scope: !913)
!927 = !DILocation(line: 237, column: 33, scope: !922)
!928 = !DILocation(line: 237, column: 25, scope: !922)
!929 = !DILocation(line: 238, column: 2, scope: !914)
!930 = !DILocation(line: 240, column: 10, scope: !720)
!931 = !DILocation(line: 240, column: 20, scope: !720)
!932 = !DILocation(line: 240, column: 49, scope: !933)
!933 = !DILexicalBlockFile(scope: !720, file: !383, discriminator: 1)
!934 = !DILocation(line: 240, column: 27, scope: !933)
!935 = !DILocation(line: 240, column: 10, scope: !933)
!936 = !DILocation(line: 241, column: 17, scope: !720)
!937 = !DILocation(line: 240, column: 10, scope: !938)
!938 = !DILexicalBlockFile(scope: !720, file: !383, discriminator: 2)
!939 = !DILocation(line: 240, column: 10, scope: !940)
!940 = !DILexicalBlockFile(scope: !720, file: !383, discriminator: 3)
!941 = !DILocation(line: 240, column: 8, scope: !940)
!942 = !DILocation(line: 243, column: 9, scope: !720)
!943 = !DILocation(line: 243, column: 16, scope: !720)
!944 = !DILocation(line: 243, column: 7, scope: !720)
!945 = !DILocation(line: 244, column: 21, scope: !720)
!946 = !DILocation(line: 244, column: 2, scope: !720)
!947 = !DILocation(line: 246, column: 20, scope: !720)
!948 = !DILocation(line: 246, column: 27, scope: !720)
!949 = !DILocation(line: 246, column: 2, scope: !720)
!950 = !DILocation(line: 246, column: 8, scope: !720)
!951 = !DILocation(line: 246, column: 18, scope: !720)
!952 = !DILocation(line: 247, column: 13, scope: !953)
!953 = distinct !DILexicalBlock(scope: !720, file: !383, line: 247, column: 13)
!954 = !DILocation(line: 247, column: 21, scope: !953)
!955 = !DILocation(line: 247, column: 28, scope: !953)
!956 = !DILocation(line: 247, column: 32, scope: !957)
!957 = !DILexicalBlockFile(scope: !953, file: !383, discriminator: 1)
!958 = !DILocation(line: 247, column: 31, scope: !957)
!959 = !DILocation(line: 247, column: 40, scope: !957)
!960 = !DILocation(line: 247, column: 13, scope: !957)
!961 = !DILocation(line: 248, column: 28, scope: !953)
!962 = !DILocation(line: 248, column: 19, scope: !953)
!963 = !DILocation(line: 248, column: 3, scope: !953)
!964 = !DILocation(line: 248, column: 9, scope: !953)
!965 = !DILocation(line: 248, column: 17, scope: !953)
!966 = !DILocation(line: 251, column: 20, scope: !720)
!967 = !DILocation(line: 251, column: 26, scope: !720)
!968 = !DILocation(line: 251, column: 35, scope: !720)
!969 = !DILocation(line: 251, column: 2, scope: !720)
!970 = !DILocation(line: 254, column: 15, scope: !720)
!971 = !DILocation(line: 254, column: 23, scope: !720)
!972 = !DILocation(line: 254, column: 45, scope: !933)
!973 = !DILocation(line: 254, column: 32, scope: !933)
!974 = !DILocation(line: 254, column: 15, scope: !933)
!975 = !DILocation(line: 255, column: 4, scope: !720)
!976 = !DILocation(line: 255, column: 12, scope: !720)
!977 = !DILocation(line: 255, column: 19, scope: !720)
!978 = !DILocation(line: 255, column: 22, scope: !933)
!979 = !DILocation(line: 255, column: 31, scope: !933)
!980 = !DILocation(line: 255, column: 39, scope: !933)
!981 = !DILocation(line: 255, column: 4, scope: !933)
!982 = !DILocation(line: 255, column: 4, scope: !938)
!983 = !DILocation(line: 256, column: 17, scope: !720)
!984 = !DILocation(line: 256, column: 26, scope: !720)
!985 = !DILocation(line: 256, column: 4, scope: !720)
!986 = !DILocation(line: 255, column: 4, scope: !940)
!987 = !DILocation(line: 255, column: 4, scope: !988)
!988 = !DILexicalBlockFile(scope: !720, file: !383, discriminator: 4)
!989 = !DILocation(line: 254, column: 15, scope: !938)
!990 = !DILocation(line: 254, column: 15, scope: !940)
!991 = !DILocation(line: 254, column: 13, scope: !940)
!992 = !DILocation(line: 257, column: 6, scope: !993)
!993 = distinct !DILexicalBlock(scope: !720, file: !383, line: 257, column: 6)
!994 = !DILocation(line: 257, column: 17, scope: !993)
!995 = !DILocation(line: 257, column: 6, scope: !720)
!996 = !DILocation(line: 258, column: 29, scope: !993)
!997 = !DILocation(line: 258, column: 35, scope: !993)
!998 = !DILocation(line: 258, column: 3, scope: !993)
!999 = !DILocation(line: 261, column: 6, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !720, file: !383, line: 261, column: 6)
!1001 = !DILocation(line: 261, column: 14, scope: !1000)
!1002 = !DILocation(line: 261, column: 6, scope: !720)
!1003 = !DILocation(line: 262, column: 28, scope: !1000)
!1004 = !DILocation(line: 262, column: 34, scope: !1000)
!1005 = !DILocation(line: 262, column: 3, scope: !1000)
!1006 = !DILocation(line: 265, column: 6, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !720, file: !383, line: 265, column: 6)
!1008 = !DILocation(line: 265, column: 15, scope: !1007)
!1009 = !DILocation(line: 265, column: 19, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !1007, file: !383, discriminator: 1)
!1011 = !DILocation(line: 265, column: 18, scope: !1010)
!1012 = !DILocation(line: 265, column: 6, scope: !1010)
!1013 = !DILocation(line: 266, column: 10, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1007, file: !383, line: 265, column: 29)
!1015 = !DILocation(line: 266, column: 16, scope: !1014)
!1016 = !DILocation(line: 266, column: 3, scope: !1014)
!1017 = !DILocation(line: 267, column: 29, scope: !1014)
!1018 = !DILocation(line: 267, column: 20, scope: !1014)
!1019 = !DILocation(line: 267, column: 3, scope: !1014)
!1020 = !DILocation(line: 267, column: 9, scope: !1014)
!1021 = !DILocation(line: 267, column: 18, scope: !1014)
!1022 = !DILocation(line: 268, column: 2, scope: !1014)
!1023 = !DILocation(line: 269, column: 6, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !720, file: !383, line: 269, column: 6)
!1025 = !DILocation(line: 269, column: 11, scope: !1024)
!1026 = !DILocation(line: 269, column: 15, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1024, file: !383, discriminator: 1)
!1028 = !DILocation(line: 269, column: 14, scope: !1027)
!1029 = !DILocation(line: 269, column: 6, scope: !1027)
!1030 = !DILocation(line: 270, column: 10, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1024, file: !383, line: 269, column: 21)
!1032 = !DILocation(line: 270, column: 16, scope: !1031)
!1033 = !DILocation(line: 270, column: 3, scope: !1031)
!1034 = !DILocation(line: 271, column: 25, scope: !1031)
!1035 = !DILocation(line: 271, column: 16, scope: !1031)
!1036 = !DILocation(line: 271, column: 3, scope: !1031)
!1037 = !DILocation(line: 271, column: 9, scope: !1031)
!1038 = !DILocation(line: 271, column: 14, scope: !1031)
!1039 = !DILocation(line: 272, column: 2, scope: !1031)
!1040 = !DILocation(line: 274, column: 9, scope: !720)
!1041 = !DILocation(line: 274, column: 2, scope: !720)
!1042 = !DILocation(line: 275, column: 1, scope: !720)
!1043 = distinct !DISubprogram(name: "server_setup_find", scope: !383, file: !383, line: 342, type: !1044, isLocal: false, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!310, !308, !52, !308}
!1046 = !DILocalVariable(name: "address", arg: 1, scope: !1043, file: !383, line: 342, type: !308)
!1047 = !DILocation(line: 342, column: 49, scope: !1043)
!1048 = !DILocalVariable(name: "port", arg: 2, scope: !1043, file: !383, line: 342, type: !52)
!1049 = !DILocation(line: 342, column: 62, scope: !1043)
!1050 = !DILocalVariable(name: "chatnet", arg: 3, scope: !1043, file: !383, line: 343, type: !308)
!1051 = !DILocation(line: 343, column: 21, scope: !1043)
!1052 = !DILocalVariable(name: "server", scope: !1043, file: !383, line: 345, type: !310)
!1053 = !DILocation(line: 345, column: 20, scope: !1043)
!1054 = !DILocalVariable(name: "tmp", scope: !1043, file: !383, line: 346, type: !237)
!1055 = !DILocation(line: 346, column: 10, scope: !1043)
!1056 = !DILocation(line: 348, column: 2, scope: !1043)
!1057 = distinct !{!1057, !1056}
!1058 = !DILocation(line: 348, column: 10, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1060, file: !383, discriminator: 1)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !383, line: 348, column: 10)
!1061 = distinct !DILexicalBlock(scope: !1043, file: !383, line: 348, column: 4)
!1062 = !DILocation(line: 348, column: 18, scope: !1059)
!1063 = !DILocation(line: 348, column: 5, scope: !1064)
!1064 = !DILexicalBlockFile(scope: !1065, file: !383, discriminator: 2)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !383, line: 348, column: 3)
!1066 = !DILocation(line: 348, column: 14, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1068, file: !383, discriminator: 3)
!1068 = distinct !DILexicalBlock(scope: !1060, file: !383, line: 348, column: 12)
!1069 = !DILocation(line: 348, column: 102, scope: !1067)
!1070 = !DILocation(line: 348, column: 7, scope: !1071)
!1071 = !DILexicalBlockFile(scope: !1061, file: !383, discriminator: 4)
!1072 = !DILocation(line: 350, column: 9, scope: !1043)
!1073 = !DILocation(line: 351, column: 13, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1043, file: !383, line: 351, column: 2)
!1075 = !DILocation(line: 351, column: 11, scope: !1074)
!1076 = !DILocation(line: 351, column: 7, scope: !1074)
!1077 = !DILocation(line: 351, column: 27, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1079, file: !383, discriminator: 1)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !383, line: 351, column: 2)
!1080 = !DILocation(line: 351, column: 31, scope: !1078)
!1081 = !DILocation(line: 351, column: 2, scope: !1078)
!1082 = !DILocalVariable(name: "rec", scope: !1083, file: !383, line: 352, type: !310)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !383, line: 351, column: 56)
!1084 = !DILocation(line: 352, column: 21, scope: !1083)
!1085 = !DILocation(line: 352, column: 27, scope: !1083)
!1086 = !DILocation(line: 352, column: 32, scope: !1083)
!1087 = !DILocation(line: 354, column: 26, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1083, file: !383, line: 354, column: 7)
!1089 = !DILocation(line: 354, column: 31, scope: !1088)
!1090 = !DILocation(line: 354, column: 40, scope: !1088)
!1091 = !DILocation(line: 354, column: 7, scope: !1088)
!1092 = !DILocation(line: 354, column: 49, scope: !1088)
!1093 = !DILocation(line: 354, column: 54, scope: !1088)
!1094 = !DILocation(line: 355, column: 8, scope: !1088)
!1095 = !DILocation(line: 355, column: 16, scope: !1088)
!1096 = !DILocation(line: 355, column: 23, scope: !1088)
!1097 = !DILocation(line: 355, column: 26, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1088, file: !383, discriminator: 1)
!1099 = !DILocation(line: 355, column: 31, scope: !1098)
!1100 = !DILocation(line: 355, column: 39, scope: !1098)
!1101 = !DILocation(line: 355, column: 47, scope: !1098)
!1102 = !DILocation(line: 356, column: 27, scope: !1088)
!1103 = !DILocation(line: 356, column: 32, scope: !1088)
!1104 = !DILocation(line: 356, column: 41, scope: !1088)
!1105 = !DILocation(line: 356, column: 8, scope: !1088)
!1106 = !DILocation(line: 356, column: 50, scope: !1088)
!1107 = !DILocation(line: 354, column: 7, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1083, file: !383, discriminator: 1)
!1109 = !DILocation(line: 357, column: 13, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1088, file: !383, line: 356, column: 57)
!1111 = !DILocation(line: 357, column: 11, scope: !1110)
!1112 = !DILocation(line: 358, column: 8, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !383, line: 358, column: 8)
!1114 = !DILocation(line: 358, column: 13, scope: !1113)
!1115 = !DILocation(line: 358, column: 21, scope: !1113)
!1116 = !DILocation(line: 358, column: 18, scope: !1113)
!1117 = !DILocation(line: 358, column: 8, scope: !1110)
!1118 = !DILocation(line: 359, column: 5, scope: !1113)
!1119 = !DILocation(line: 360, column: 3, scope: !1110)
!1120 = !DILocation(line: 361, column: 2, scope: !1083)
!1121 = !DILocation(line: 351, column: 45, scope: !1122)
!1122 = !DILexicalBlockFile(scope: !1079, file: !383, discriminator: 2)
!1123 = !DILocation(line: 351, column: 50, scope: !1122)
!1124 = !DILocation(line: 351, column: 43, scope: !1122)
!1125 = !DILocation(line: 351, column: 2, scope: !1122)
!1126 = distinct !{!1126, !1127}
!1127 = !DILocation(line: 351, column: 2, scope: !1043)
!1128 = !DILocation(line: 363, column: 9, scope: !1043)
!1129 = !DILocation(line: 363, column: 2, scope: !1043)
!1130 = !DILocation(line: 364, column: 1, scope: !1043)
!1131 = distinct !DISubprogram(name: "server_setup_add", scope: !383, file: !383, line: 580, type: !1132, isLocal: false, isDefinition: true, scopeLine: 581, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !310}
!1134 = !DILocalVariable(name: "rec", arg: 1, scope: !1131, file: !383, line: 580, type: !310)
!1135 = !DILocation(line: 580, column: 41, scope: !1131)
!1136 = !DILocation(line: 582, column: 14, scope: !1131)
!1137 = !DILocation(line: 582, column: 2, scope: !1131)
!1138 = !DILocation(line: 582, column: 7, scope: !1131)
!1139 = !DILocation(line: 582, column: 12, scope: !1131)
!1140 = !DILocation(line: 583, column: 19, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1131, file: !383, line: 583, column: 6)
!1142 = !DILocation(line: 583, column: 33, scope: !1141)
!1143 = !DILocation(line: 583, column: 6, scope: !1141)
!1144 = !DILocation(line: 583, column: 38, scope: !1141)
!1145 = !DILocation(line: 583, column: 6, scope: !1131)
!1146 = !DILocation(line: 584, column: 33, scope: !1141)
!1147 = !DILocation(line: 584, column: 47, scope: !1141)
!1148 = !DILocation(line: 584, column: 18, scope: !1141)
!1149 = !DILocation(line: 584, column: 16, scope: !1141)
!1150 = !DILocation(line: 584, column: 3, scope: !1141)
!1151 = !DILocation(line: 585, column: 20, scope: !1131)
!1152 = !DILocation(line: 585, column: 2, scope: !1131)
!1153 = !DILocation(line: 587, column: 41, scope: !1131)
!1154 = !DILocation(line: 587, column: 2, scope: !1131)
!1155 = !DILocation(line: 588, column: 1, scope: !1131)
!1156 = distinct !DISubprogram(name: "server_setup_save", scope: !383, file: !383, line: 490, type: !1132, isLocal: true, isDefinition: true, scopeLine: 491, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !394)
!1157 = !DILocalVariable(name: "rec", arg: 1, scope: !1156, file: !383, line: 490, type: !310)
!1158 = !DILocation(line: 490, column: 49, scope: !1156)
!1159 = !DILocalVariable(name: "parent_node", scope: !1156, file: !383, line: 492, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !36, line: 17, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !36, line: 20, size: 192, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !36, line: 21, baseType: !52, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1162, file: !36, line: 22, baseType: !56, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1162, file: !36, line: 23, baseType: !176, size: 64, align: 64, offset: 128)
!1167 = !DILocation(line: 492, column: 15, scope: !1156)
!1168 = !DILocalVariable(name: "node", scope: !1156, file: !383, line: 492, type: !1160)
!1169 = !DILocation(line: 492, column: 29, scope: !1156)
!1170 = !DILocalVariable(name: "config_node", scope: !1156, file: !383, line: 493, type: !237)
!1171 = !DILocation(line: 493, column: 10, scope: !1156)
!1172 = !DILocation(line: 495, column: 37, scope: !1156)
!1173 = !DILocation(line: 495, column: 16, scope: !1156)
!1174 = !DILocation(line: 495, column: 14, scope: !1156)
!1175 = !DILocation(line: 498, column: 36, scope: !1156)
!1176 = !DILocation(line: 498, column: 49, scope: !1156)
!1177 = !DILocation(line: 498, column: 56, scope: !1156)
!1178 = !DILocation(line: 498, column: 16, scope: !1156)
!1179 = !DILocation(line: 498, column: 14, scope: !1156)
!1180 = !DILocation(line: 500, column: 6, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1156, file: !383, line: 500, column: 6)
!1182 = !DILocation(line: 500, column: 18, scope: !1181)
!1183 = !DILocation(line: 500, column: 6, scope: !1156)
!1184 = !DILocation(line: 502, column: 10, scope: !1181)
!1185 = !DILocation(line: 502, column: 23, scope: !1181)
!1186 = !DILocation(line: 502, column: 8, scope: !1181)
!1187 = !DILocation(line: 502, column: 3, scope: !1181)
!1188 = !DILocation(line: 505, column: 30, scope: !1181)
!1189 = !DILocation(line: 505, column: 42, scope: !1181)
!1190 = !DILocation(line: 505, column: 10, scope: !1181)
!1191 = !DILocation(line: 505, column: 8, scope: !1181)
!1192 = !DILocation(line: 507, column: 27, scope: !1156)
!1193 = !DILocation(line: 507, column: 39, scope: !1156)
!1194 = !DILocation(line: 507, column: 9, scope: !1156)
!1195 = !DILocation(line: 508, column: 22, scope: !1156)
!1196 = !DILocation(line: 508, column: 34, scope: !1156)
!1197 = !DILocation(line: 508, column: 51, scope: !1156)
!1198 = !DILocation(line: 508, column: 56, scope: !1156)
!1199 = !DILocation(line: 508, column: 2, scope: !1156)
!1200 = !DILocation(line: 509, column: 22, scope: !1156)
!1201 = !DILocation(line: 509, column: 34, scope: !1156)
!1202 = !DILocation(line: 509, column: 51, scope: !1156)
!1203 = !DILocation(line: 509, column: 56, scope: !1156)
!1204 = !DILocation(line: 509, column: 2, scope: !1156)
!1205 = !DILocation(line: 511, column: 22, scope: !1156)
!1206 = !DILocation(line: 511, column: 34, scope: !1156)
!1207 = !DILocation(line: 511, column: 48, scope: !1156)
!1208 = !DILocation(line: 511, column: 53, scope: !1156)
!1209 = !DILocation(line: 511, column: 2, scope: !1156)
!1210 = !DILocation(line: 512, column: 22, scope: !1156)
!1211 = !DILocation(line: 512, column: 34, scope: !1156)
!1212 = !DILocation(line: 512, column: 52, scope: !1156)
!1213 = !DILocation(line: 512, column: 57, scope: !1156)
!1214 = !DILocation(line: 512, column: 2, scope: !1156)
!1215 = !DILocation(line: 514, column: 23, scope: !1156)
