; ModuleID = './line185-flood.o.i'
source_filename = "./line185-flood.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.MODULE_FILE_REC = type { %struct._MODULE_REC*, i8*, i8*, void ()*, %struct._GModule*, i8 }
%struct._MODULE_REC = type { i8*, %struct._GSList* }
%struct._GModule = type opaque

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 10, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!38 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!39 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!40 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!41 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!42 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!43 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!44 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!45 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!46 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!47 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!48 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!49 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!50 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!51 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!52 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!53 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!54 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !{!67, !74, !75, !84, !388, !697, !150, !476, !701, !702, !710, !715, !719, !723, !83, !378, !727, !734}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !68, line: 9, baseType: !69)
!68 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !72, !72, !72, !72, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!79, !83}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !80, line: 50, baseType: !81)
!80 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !80, line: 49, baseType: !82)
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !80, line: 77, baseType: !74)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !86, line: 6, baseType: !87)
!86 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !88, line: 42, size: 39168, align: 64, elements: !89)
!88 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !{!90, !92, !93, !94, !333, !338, !339, !340, !341, !342, !343, !344, !345, !346, !350, !351, !355, !356, !357, !361, !366, !367, !368, !369, !370, !371, !372, !373, !380, !381, !382, !383, !384, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !694, !696}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !91, line: 3, baseType: !82, size: 32, align: 32)
!91 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !87, file: !91, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !87, file: !91, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !87, file: !91, line: 8, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !86, line: 5, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !88, line: 24, size: 2496, align: 64, elements: !98)
!98 = !{!99, !101, !102, !103, !106, !107, !108, !109, !110, !112, !113, !114, !115, !116, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !100, line: 3, baseType: !82, size: 32, align: 32)
!100 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !97, file: !100, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !97, file: !100, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !97, file: !100, line: 9, baseType: !104, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !97, file: !100, line: 10, baseType: !82, size: 32, align: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !97, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !97, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !97, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !97, file: !100, line: 13, baseType: !111, size: 16, align: 16, offset: 448)
!111 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !97, file: !100, line: 14, baseType: !104, size: 64, align: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !97, file: !100, line: 15, baseType: !104, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !97, file: !100, line: 16, baseType: !82, size: 32, align: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !97, file: !100, line: 17, baseType: !104, size: 64, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !97, file: !100, line: 19, baseType: !117, size: 64, align: 64, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !119, line: 99, baseType: !120)
!119 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !119, line: 99, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !97, file: !100, line: 19, baseType: !117, size: 64, align: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !97, file: !100, line: 21, baseType: !104, size: 64, align: 64, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !97, file: !100, line: 22, baseType: !104, size: 64, align: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !97, file: !100, line: 23, baseType: !104, size: 64, align: 64, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !97, file: !100, line: 24, baseType: !104, size: 64, align: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !97, file: !100, line: 26, baseType: !104, size: 64, align: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !97, file: !100, line: 27, baseType: !104, size: 64, align: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !97, file: !100, line: 28, baseType: !104, size: 64, align: 64, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !97, file: !100, line: 29, baseType: !104, size: 64, align: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !97, file: !100, line: 30, baseType: !104, size: 64, align: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !97, file: !100, line: 31, baseType: !104, size: 64, align: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !97, file: !100, line: 32, baseType: !104, size: 64, align: 64, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !97, file: !100, line: 33, baseType: !104, size: 64, align: 64, offset: 1600)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !97, file: !100, line: 35, baseType: !135, size: 64, align: 64, offset: 1664)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !138)
!138 = !{!139, !140, !278, !279, !284, !285, !286, !287, !288, !297, !298, !299, !303, !304, !305, !306, !307, !308, !309, !310}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !137, file: !4, line: 100, baseType: !81, size: 32, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !137, file: !4, line: 101, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !144)
!144 = !{!145, !169, !175, !182, !186, !265, !269, !274}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !143, file: !4, line: 133, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!149, !135, !150, !152, !155, !156}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !80, line: 46, baseType: !105)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !153, line: 66, baseType: !154)
!153 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!154 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !159, line: 42, baseType: !160)
!159 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !159, line: 44, size: 128, align: 64, elements: !161)
!161 = !{!162, !167, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !160, file: !159, line: 46, baseType: !163, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !164, line: 36, baseType: !165)
!164 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !153, line: 45, baseType: !166)
!166 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !160, file: !159, line: 47, baseType: !81, size: 32, align: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !160, file: !159, line: 48, baseType: !150, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !143, file: !4, line: 138, baseType: !170, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!149, !135, !173, !152, !155, !156}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !143, file: !4, line: 143, baseType: !176, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!149, !135, !179, !181, !156}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !153, line: 51, baseType: !180)
!180 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !143, file: !4, line: 147, baseType: !183, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!149, !135, !156}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !143, file: !4, line: 149, baseType: !187, size: 64, align: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !135, !264}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !193)
!193 = !{!194, !195, !211, !240, !242, !246, !247, !248, !249, !257, !258, !259, !260}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !192, file: !16, line: 174, baseType: !83, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !192, file: !16, line: 175, baseType: !196, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !199)
!199 = !{!200, !204, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !198, file: !16, line: 198, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !83}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !198, file: !16, line: 199, baseType: !201, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !198, file: !16, line: 200, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !83, !190, !209, !210}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !192, file: !16, line: 177, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !216)
!216 = !{!217, !222, !226, !230, !234, !235}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !215, file: !16, line: 216, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!79, !190, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !215, file: !16, line: 218, baseType: !223, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!79, !190}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !215, file: !16, line: 219, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!79, !190, !75, !83}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !215, file: !16, line: 222, baseType: !231, size: 64, align: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !190}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !215, file: !16, line: 226, baseType: !75, size: 64, align: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !215, file: !16, line: 227, baseType: !236, size: 64, align: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !192, file: !16, line: 178, baseType: !241, size: 32, align: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !80, line: 55, baseType: !166)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !192, file: !16, line: 180, baseType: !243, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !192, file: !16, line: 182, baseType: !81, size: 32, align: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !16, line: 183, baseType: !241, size: 32, align: 32, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !192, file: !16, line: 184, baseType: !241, size: 32, align: 32, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !192, file: !16, line: 186, baseType: !250, size: 64, align: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !252, line: 37, baseType: !253)
!252 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !252, line: 39, size: 128, align: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !253, file: !252, line: 41, baseType: !83, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !252, line: 42, baseType: !250, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !192, file: !16, line: 188, baseType: !190, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !16, line: 189, baseType: !190, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !16, line: 191, baseType: !104, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !192, file: !16, line: 193, baseType: !261, size: 64, align: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !143, file: !4, line: 151, baseType: !266, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !135}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !143, file: !4, line: 152, baseType: !270, size: 64, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!149, !135, !273, !156}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !143, file: !4, line: 155, baseType: !275, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!273, !135}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !137, file: !4, line: 103, baseType: !150, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !137, file: !4, line: 104, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !281, line: 77, baseType: !282)
!281 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !281, line: 77, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !137, file: !4, line: 105, baseType: !280, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !137, file: !4, line: 106, baseType: !150, size: 64, align: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !137, file: !4, line: 107, baseType: !241, size: 32, align: 32, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !137, file: !4, line: 109, baseType: !152, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !137, file: !4, line: 110, baseType: !289, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !291, line: 39, baseType: !292)
!291 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !291, line: 41, size: 192, align: 64, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !292, file: !291, line: 43, baseType: !150, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !292, file: !291, line: 44, baseType: !152, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !292, file: !291, line: 45, baseType: !152, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !137, file: !4, line: 111, baseType: !289, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !137, file: !4, line: 112, baseType: !289, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !137, file: !4, line: 113, baseType: !300, size: 48, align: 8, offset: 704)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 48, align: 8, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 6)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !137, file: !4, line: 117, baseType: !241, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !137, file: !4, line: 118, baseType: !241, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !137, file: !4, line: 119, baseType: !241, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !137, file: !4, line: 120, baseType: !241, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !137, file: !4, line: 121, baseType: !241, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !137, file: !4, line: 122, baseType: !241, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !137, file: !4, line: 124, baseType: !83, size: 64, align: 64, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !137, file: !4, line: 125, baseType: !83, size: 64, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !97, file: !100, line: 38, baseType: !166, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !97, file: !100, line: 39, baseType: !166, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !97, file: !100, line: 40, baseType: !166, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !97, file: !100, line: 41, baseType: !166, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !97, file: !100, line: 42, baseType: !166, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !97, file: !100, line: 43, baseType: !166, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !97, file: !100, line: 44, baseType: !166, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !97, file: !100, line: 45, baseType: !166, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !97, file: !100, line: 46, baseType: !104, size: 64, align: 64, offset: 1792)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !97, file: !100, line: 47, baseType: !104, size: 64, align: 64, offset: 1856)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !97, file: !88, line: 27, baseType: !104, size: 64, align: 64, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !97, file: !88, line: 28, baseType: !104, size: 64, align: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !97, file: !88, line: 30, baseType: !82, size: 32, align: 32, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !97, file: !88, line: 31, baseType: !104, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !97, file: !88, line: 32, baseType: !104, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !97, file: !88, line: 34, baseType: !82, size: 32, align: 32, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !97, file: !88, line: 35, baseType: !82, size: 32, align: 32, offset: 2272)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !97, file: !88, line: 36, baseType: !82, size: 32, align: 32, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !97, file: !88, line: 38, baseType: !82, size: 32, align: 32, offset: 2336)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !97, file: !88, line: 38, baseType: !82, size: 32, align: 32, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !97, file: !88, line: 38, baseType: !82, size: 32, align: 32, offset: 2400)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !97, file: !88, line: 38, baseType: !82, size: 32, align: 32, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !87, file: !91, line: 9, baseType: !334, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !335, line: 75, baseType: !336)
!335 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !337, line: 139, baseType: !180)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !87, file: !91, line: 10, baseType: !334, size: 64, align: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !91, line: 12, baseType: !104, size: 64, align: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !87, file: !91, line: 13, baseType: !104, size: 64, align: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !87, file: !91, line: 15, baseType: !166, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !87, file: !91, line: 16, baseType: !166, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !87, file: !91, line: 17, baseType: !166, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !87, file: !91, line: 18, baseType: !166, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !87, file: !91, line: 19, baseType: !166, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !87, file: !91, line: 21, baseType: !347, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !119, line: 102, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !119, line: 102, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !87, file: !91, line: 22, baseType: !82, size: 32, align: 32, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !87, file: !91, line: 25, baseType: !352, size: 128, align: 64, offset: 640)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, align: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 2)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !87, file: !91, line: 26, baseType: !82, size: 32, align: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !87, file: !91, line: 27, baseType: !82, size: 32, align: 32, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !87, file: !91, line: 29, baseType: !358, size: 64, align: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !119, line: 103, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !119, line: 103, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !87, file: !91, line: 30, baseType: !362, size: 64, align: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !364, line: 37, baseType: !365)
!364 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !364, line: 37, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !87, file: !91, line: 32, baseType: !104, size: 64, align: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !87, file: !91, line: 33, baseType: !104, size: 64, align: 64, offset: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !87, file: !91, line: 34, baseType: !104, size: 64, align: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !87, file: !91, line: 35, baseType: !166, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !87, file: !91, line: 36, baseType: !166, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !87, file: !91, line: 37, baseType: !166, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !87, file: !91, line: 38, baseType: !166, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !87, file: !91, line: 40, baseType: !374, size: 128, align: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !80, line: 504, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !80, line: 506, size: 128, align: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !375, file: !80, line: 508, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !80, line: 48, baseType: !180)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !375, file: !80, line: 509, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !87, file: !91, line: 41, baseType: !334, size: 64, align: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !87, file: !91, line: 42, baseType: !82, size: 32, align: 32, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !87, file: !91, line: 44, baseType: !250, size: 64, align: 64, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !87, file: !91, line: 45, baseType: !250, size: 64, align: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !87, file: !91, line: 53, baseType: !385, size: 64, align: 64, offset: 1600)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388, !476, !82}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !119, line: 107, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !391, line: 30, size: 2240, align: 64, elements: !392)
!391 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!392 = !{!393, !394, !395, !396, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !478, !482, !486, !491, !570, !577, !581}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !91, line: 3, baseType: !82, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !390, file: !91, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !390, file: !91, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !390, file: !91, line: 8, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !119, line: 113, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !391, line: 25, size: 1920, align: 64, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !100, line: 3, baseType: !82, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !399, file: !100, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !399, file: !100, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !399, file: !100, line: 9, baseType: !104, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !399, file: !100, line: 10, baseType: !82, size: 32, align: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !399, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !399, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !399, file: !100, line: 11, baseType: !104, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !399, file: !100, line: 13, baseType: !111, size: 16, align: 16, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !399, file: !100, line: 14, baseType: !104, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !399, file: !100, line: 15, baseType: !104, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !399, file: !100, line: 16, baseType: !82, size: 32, align: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !399, file: !100, line: 17, baseType: !104, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !399, file: !100, line: 19, baseType: !117, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !399, file: !100, line: 19, baseType: !117, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !399, file: !100, line: 21, baseType: !104, size: 64, align: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !399, file: !100, line: 22, baseType: !104, size: 64, align: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !399, file: !100, line: 23, baseType: !104, size: 64, align: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !399, file: !100, line: 24, baseType: !104, size: 64, align: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !399, file: !100, line: 26, baseType: !104, size: 64, align: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !399, file: !100, line: 27, baseType: !104, size: 64, align: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !399, file: !100, line: 28, baseType: !104, size: 64, align: 64, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !399, file: !100, line: 29, baseType: !104, size: 64, align: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !399, file: !100, line: 30, baseType: !104, size: 64, align: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !399, file: !100, line: 31, baseType: !104, size: 64, align: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !399, file: !100, line: 32, baseType: !104, size: 64, align: 64, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !399, file: !100, line: 33, baseType: !104, size: 64, align: 64, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !399, file: !100, line: 35, baseType: !135, size: 64, align: 64, offset: 1664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !399, file: !100, line: 38, baseType: !166, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !399, file: !100, line: 39, baseType: !166, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !399, file: !100, line: 40, baseType: !166, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !399, file: !100, line: 41, baseType: !166, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !399, file: !100, line: 42, baseType: !166, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !399, file: !100, line: 43, baseType: !166, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !399, file: !100, line: 44, baseType: !166, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !399, file: !100, line: 45, baseType: !166, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !399, file: !100, line: 46, baseType: !104, size: 64, align: 64, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !399, file: !100, line: 47, baseType: !104, size: 64, align: 64, offset: 1856)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !390, file: !91, line: 9, baseType: !334, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !390, file: !91, line: 10, baseType: !334, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !91, line: 12, baseType: !104, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !390, file: !91, line: 13, baseType: !104, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !390, file: !91, line: 15, baseType: !166, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !390, file: !91, line: 16, baseType: !166, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !390, file: !91, line: 17, baseType: !166, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !390, file: !91, line: 18, baseType: !166, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !390, file: !91, line: 19, baseType: !166, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !390, file: !91, line: 21, baseType: !347, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !390, file: !91, line: 22, baseType: !82, size: 32, align: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !390, file: !91, line: 25, baseType: !352, size: 128, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !390, file: !91, line: 26, baseType: !82, size: 32, align: 32, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !390, file: !91, line: 27, baseType: !82, size: 32, align: 32, offset: 800)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !390, file: !91, line: 29, baseType: !358, size: 64, align: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !390, file: !91, line: 30, baseType: !362, size: 64, align: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !390, file: !91, line: 32, baseType: !104, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !390, file: !91, line: 33, baseType: !104, size: 64, align: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !390, file: !91, line: 34, baseType: !104, size: 64, align: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !390, file: !91, line: 35, baseType: !166, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !390, file: !91, line: 36, baseType: !166, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !390, file: !91, line: 37, baseType: !166, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !390, file: !91, line: 38, baseType: !166, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !390, file: !91, line: 40, baseType: !374, size: 128, align: 64, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !390, file: !91, line: 41, baseType: !334, size: 64, align: 64, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !390, file: !91, line: 42, baseType: !82, size: 32, align: 32, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !390, file: !91, line: 44, baseType: !250, size: 64, align: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !390, file: !91, line: 45, baseType: !250, size: 64, align: 64, offset: 1536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !390, file: !91, line: 53, baseType: !385, size: 64, align: 64, offset: 1600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !390, file: !91, line: 55, baseType: !469, size: 64, align: 64, offset: 1664)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!82, !388, !105}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !390, file: !91, line: 57, baseType: !473, size: 64, align: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!82, !388, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !390, file: !91, line: 60, baseType: !479, size: 64, align: 64, offset: 1792)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!476, !388}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !390, file: !91, line: 62, baseType: !483, size: 64, align: 64, offset: 1856)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !388, !476, !476, !82}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !390, file: !91, line: 65, baseType: !487, size: 64, align: 64, offset: 1920)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !388, !476, !476}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !390, file: !91, line: 69, baseType: !492, size: 64, align: 64, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !388, !476}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !119, line: 109, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !498, line: 15, size: 1408, align: 64, elements: !499)
!498 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!499 = !{!500, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !518, !522, !524, !525, !526, !527, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !501, line: 3, baseType: !82, size: 32, align: 32)
!501 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !497, file: !501, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !497, file: !501, line: 5, baseType: !362, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !497, file: !501, line: 7, baseType: !74, size: 64, align: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !497, file: !501, line: 8, baseType: !388, size: 64, align: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !497, file: !501, line: 9, baseType: !104, size: 64, align: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !497, file: !501, line: 10, baseType: !104, size: 64, align: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !497, file: !501, line: 11, baseType: !334, size: 64, align: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !497, file: !501, line: 12, baseType: !82, size: 32, align: 32, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !497, file: !501, line: 13, baseType: !104, size: 64, align: 64, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !497, file: !501, line: 15, baseType: !512, size: 64, align: 64, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !119, line: 108, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !119, line: 108, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !497, file: !501, line: 17, baseType: !519, size: 64, align: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!476, !515}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !497, file: !523, line: 5, baseType: !104, size: 64, align: 64, offset: 704)
!523 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !497, file: !523, line: 6, baseType: !104, size: 64, align: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !497, file: !523, line: 7, baseType: !334, size: 64, align: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !497, file: !523, line: 9, baseType: !362, size: 64, align: 64, offset: 896)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !497, file: !523, line: 10, baseType: !528, size: 64, align: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !119, line: 111, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !531, line: 13, size: 576, align: 64, elements: !532)
!531 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!532 = !{!533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !551, !552}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !534, line: 3, baseType: !82, size: 32, align: 32)
!534 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !530, file: !534, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !530, file: !534, line: 6, baseType: !334, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !530, file: !534, line: 8, baseType: !104, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !530, file: !534, line: 9, baseType: !104, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !530, file: !534, line: 10, baseType: !104, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !530, file: !534, line: 11, baseType: !82, size: 32, align: 32, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !530, file: !534, line: 14, baseType: !166, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !530, file: !534, line: 15, baseType: !166, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !530, file: !534, line: 18, baseType: !166, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !530, file: !534, line: 19, baseType: !166, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !530, file: !534, line: 20, baseType: !166, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !530, file: !534, line: 21, baseType: !166, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !530, file: !534, line: 22, baseType: !548, size: 64, align: 8, offset: 360)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 64, align: 8, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 8)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !530, file: !534, line: 26, baseType: !74, size: 64, align: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !530, file: !534, line: 28, baseType: !528, size: 64, align: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !497, file: !523, line: 12, baseType: !166, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !497, file: !523, line: 13, baseType: !104, size: 64, align: 64, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !497, file: !523, line: 14, baseType: !82, size: 32, align: 32, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !497, file: !523, line: 15, baseType: !104, size: 64, align: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !497, file: !523, line: 17, baseType: !166, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !497, file: !523, line: 18, baseType: !166, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !497, file: !523, line: 19, baseType: !166, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !497, file: !523, line: 20, baseType: !166, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !497, file: !523, line: 22, baseType: !166, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !497, file: !523, line: 23, baseType: !166, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !497, file: !523, line: 24, baseType: !166, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !497, file: !523, line: 25, baseType: !166, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !497, file: !523, line: 26, baseType: !166, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !497, file: !523, line: 31, baseType: !567, size: 64, align: 64, offset: 1344)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!104, !495}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !390, file: !91, line: 70, baseType: !571, size: 64, align: 64, offset: 2048)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!574, !388, !476}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !119, line: 110, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !119, line: 110, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !390, file: !91, line: 71, baseType: !578, size: 64, align: 64, offset: 2112)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!82, !476, !476}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !390, file: !91, line: 73, baseType: !578, size: 64, align: 64, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !87, file: !91, line: 55, baseType: !469, size: 64, align: 64, offset: 1664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !87, file: !91, line: 57, baseType: !473, size: 64, align: 64, offset: 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !87, file: !91, line: 60, baseType: !479, size: 64, align: 64, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !87, file: !91, line: 62, baseType: !483, size: 64, align: 64, offset: 1856)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !87, file: !91, line: 65, baseType: !487, size: 64, align: 64, offset: 1920)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !87, file: !91, line: 69, baseType: !492, size: 64, align: 64, offset: 1984)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !87, file: !91, line: 70, baseType: !571, size: 64, align: 64, offset: 2048)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !87, file: !91, line: 71, baseType: !578, size: 64, align: 64, offset: 2112)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !87, file: !91, line: 73, baseType: !578, size: 64, align: 64, offset: 2176)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !87, file: !88, line: 46, baseType: !250, size: 64, align: 64, offset: 2240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !87, file: !88, line: 47, baseType: !250, size: 64, align: 64, offset: 2304)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !87, file: !88, line: 48, baseType: !594, size: 64, align: 64, offset: 2368)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !86, line: 8, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !86, line: 8, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !87, file: !88, line: 49, baseType: !250, size: 64, align: 64, offset: 2432)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !87, file: !88, line: 51, baseType: !104, size: 64, align: 64, offset: 2496)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !87, file: !88, line: 53, baseType: !104, size: 64, align: 64, offset: 2560)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !87, file: !88, line: 54, baseType: !104, size: 64, align: 64, offset: 2624)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !87, file: !88, line: 55, baseType: !104, size: 64, align: 64, offset: 2688)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !87, file: !88, line: 56, baseType: !104, size: 64, align: 64, offset: 2752)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !87, file: !88, line: 57, baseType: !82, size: 32, align: 32, offset: 2816)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !87, file: !88, line: 59, baseType: !166, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !87, file: !88, line: 60, baseType: !166, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !87, file: !88, line: 62, baseType: !166, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !87, file: !88, line: 63, baseType: !166, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !87, file: !88, line: 64, baseType: !166, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !87, file: !88, line: 65, baseType: !166, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !87, file: !88, line: 66, baseType: !166, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !87, file: !88, line: 67, baseType: !166, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !87, file: !88, line: 68, baseType: !166, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !87, file: !88, line: 69, baseType: !166, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !87, file: !88, line: 70, baseType: !166, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !87, file: !88, line: 71, baseType: !166, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !87, file: !88, line: 72, baseType: !166, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !87, file: !88, line: 74, baseType: !82, size: 32, align: 32, offset: 2880)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !87, file: !88, line: 75, baseType: !82, size: 32, align: 32, offset: 2912)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !87, file: !88, line: 76, baseType: !82, size: 32, align: 32, offset: 2944)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !87, file: !88, line: 77, baseType: !82, size: 32, align: 32, offset: 2976)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !87, file: !88, line: 79, baseType: !362, size: 64, align: 64, offset: 3008)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !87, file: !88, line: 80, baseType: !250, size: 64, align: 64, offset: 3072)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !87, file: !88, line: 81, baseType: !250, size: 64, align: 64, offset: 3136)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !87, file: !88, line: 83, baseType: !289, size: 64, align: 64, offset: 3200)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !87, file: !88, line: 84, baseType: !241, size: 32, align: 32, offset: 3264)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !87, file: !88, line: 87, baseType: !82, size: 32, align: 32, offset: 3296)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !87, file: !88, line: 91, baseType: !250, size: 64, align: 64, offset: 3328)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !87, file: !88, line: 92, baseType: !374, size: 128, align: 64, offset: 3392)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !87, file: !88, line: 93, baseType: !374, size: 128, align: 64, offset: 3520)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !87, file: !88, line: 95, baseType: !82, size: 32, align: 32, offset: 3648)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !87, file: !88, line: 96, baseType: !82, size: 32, align: 32, offset: 3680)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !87, file: !88, line: 97, baseType: !82, size: 32, align: 32, offset: 3712)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !87, file: !88, line: 100, baseType: !250, size: 64, align: 64, offset: 3776)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !87, file: !88, line: 103, baseType: !250, size: 64, align: 64, offset: 3840)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !87, file: !88, line: 106, baseType: !250, size: 64, align: 64, offset: 3904)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !87, file: !88, line: 108, baseType: !362, size: 64, align: 64, offset: 3968)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !87, file: !88, line: 109, baseType: !250, size: 64, align: 64, offset: 4032)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !87, file: !88, line: 111, baseType: !250, size: 64, align: 64, offset: 4096)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !87, file: !88, line: 114, baseType: !74, size: 64, align: 64, offset: 4160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !87, file: !88, line: 116, baseType: !362, size: 64, align: 64, offset: 4224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !87, file: !88, line: 117, baseType: !642, size: 32768, align: 64, offset: 4288)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 32768, align: 64, elements: !692)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !644, line: 10, size: 128, align: 64, elements: !645)
!644 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!645 = !{!646, !691}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !643, file: !644, line: 11, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !644, line: 7, baseType: !649)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !651, !476, !105, !105, !104, !289}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !86, line: 7, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !654, line: 15, size: 1600, align: 64, elements: !655)
!654 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !501, line: 3, baseType: !82, size: 32, align: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !653, file: !501, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !653, file: !501, line: 5, baseType: !362, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !653, file: !501, line: 7, baseType: !74, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !653, file: !501, line: 8, baseType: !84, size: 64, align: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !653, file: !501, line: 9, baseType: !104, size: 64, align: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !501, line: 10, baseType: !104, size: 64, align: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !653, file: !501, line: 11, baseType: !334, size: 64, align: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !653, file: !501, line: 12, baseType: !82, size: 32, align: 32, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !653, file: !501, line: 13, baseType: !104, size: 64, align: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !653, file: !501, line: 15, baseType: !512, size: 64, align: 64, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !653, file: !501, line: 17, baseType: !519, size: 64, align: 64, offset: 640)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !653, file: !523, line: 5, baseType: !104, size: 64, align: 64, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !653, file: !523, line: 6, baseType: !104, size: 64, align: 64, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !653, file: !523, line: 7, baseType: !334, size: 64, align: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !653, file: !523, line: 9, baseType: !362, size: 64, align: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !653, file: !523, line: 10, baseType: !528, size: 64, align: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !653, file: !523, line: 12, baseType: !166, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !653, file: !523, line: 13, baseType: !104, size: 64, align: 64, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !653, file: !523, line: 14, baseType: !82, size: 32, align: 32, offset: 1152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !653, file: !523, line: 15, baseType: !104, size: 64, align: 64, offset: 1216)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !653, file: !523, line: 17, baseType: !166, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !653, file: !523, line: 18, baseType: !166, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !653, file: !523, line: 19, baseType: !166, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !653, file: !523, line: 20, baseType: !166, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !653, file: !523, line: 22, baseType: !166, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !653, file: !523, line: 23, baseType: !166, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !653, file: !523, line: 24, baseType: !166, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !653, file: !523, line: 25, baseType: !166, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !653, file: !523, line: 26, baseType: !166, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !653, file: !523, line: 31, baseType: !567, size: 64, align: 64, offset: 1344)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !653, file: !654, line: 18, baseType: !250, size: 64, align: 64, offset: 1408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !653, file: !654, line: 20, baseType: !334, size: 64, align: 64, offset: 1472)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !653, file: !654, line: 21, baseType: !82, size: 32, align: 32, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !653, file: !654, line: 22, baseType: !82, size: 32, align: 32, offset: 1568)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !643, file: !644, line: 12, baseType: !105, size: 8, align: 8, offset: 64)
!692 = !{!693}
!693 = !DISubrange(count: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 118, baseType: !695, size: 2048, align: 8, offset: 37056)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 2048, align: 8, elements: !692)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !87, file: !88, line: 120, baseType: !578, size: 64, align: 64, offset: 39104)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHRFunc", file: !364, line: 39, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!79, !83, !83, !83}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_SERVER_REC", file: !704, line: 11, baseType: !705)
!704 = !DIFile(filename: "module.h", directory: "/home/lichi/Desktop/irssi/task1")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 4, size: 192, align: 64, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "floodlist", scope: !705, file: !704, line: 6, baseType: !362, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ignorelist", scope: !705, file: !704, line: 9, baseType: !250, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_lastcheck", scope: !705, file: !704, line: 10, baseType: !334, size: 64, align: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !80, line: 90, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!241, !714}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !80, line: 78, baseType: !72)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !80, line: 80, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!81, !714, !714}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !80, line: 91, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !83, !83, !83}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !80, line: 88, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !83, !83}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLOOD_REC", file: !729, line: 45, baseType: !730)
!729 = !DIFile(filename: "flood.c", directory: "/home/lichi/Desktop/irssi/task1")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !729, line: 42, size: 128, align: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !730, file: !729, line: 43, baseType: !104, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !730, file: !729, line: 44, baseType: !250, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLOOD_ITEM_REC", file: !729, line: 40, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !729, line: 35, size: 192, align: 64, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !736, file: !729, line: 36, baseType: !104, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !736, file: !729, line: 37, baseType: !82, size: 32, align: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "msgtimes", scope: !736, file: !729, line: 39, baseType: !250, size: 64, align: 64, offset: 128)
!741 = !{!742, !743, !744}
!742 = distinct !DIGlobalVariable(name: "flood_tag", scope: !0, file: !729, line: 47, type: !82, isLocal: true, isDefinition: true, variable: i32* @flood_tag)
!743 = distinct !DIGlobalVariable(name: "flood_timecheck", scope: !0, file: !729, line: 48, type: !82, isLocal: true, isDefinition: true, variable: i32* @flood_timecheck)
!744 = distinct !DIGlobalVariable(name: "flood_max_msgs", scope: !0, file: !729, line: 48, type: !82, isLocal: true, isDefinition: true, variable: i32* @flood_max_msgs)
!745 = !{i32 2, !"Dwarf Version", i32 4}
!746 = !{i32 2, !"Debug Info Version", i32 3}
!747 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!748 = distinct !DISubprogram(name: "irc_flood_init", scope: !729, file: !729, line: 318, type: !238, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !749)
!749 = !{}
!750 = !DILocation(line: 320, column: 2, scope: !748)
!751 = !DILocation(line: 321, column: 2, scope: !748)
!752 = !DILocation(line: 323, column: 12, scope: !748)
!753 = !DILocation(line: 324, column: 2, scope: !748)
!754 = !DILocation(line: 325, column: 2, scope: !748)
!755 = !DILocation(line: 326, column: 2, scope: !748)
!756 = !DILocation(line: 327, column: 2, scope: !748)
!757 = !DILocation(line: 329, column: 2, scope: !748)
!758 = !DILocation(line: 330, column: 2, scope: !748)
!759 = !DILocation(line: 331, column: 2, scope: !748)
!760 = !DILocation(line: 332, column: 1, scope: !748)
!761 = distinct !DISubprogram(name: "read_settings", scope: !729, file: !729, line: 295, type: !238, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !749)
!762 = !DILocation(line: 297, column: 20, scope: !761)
!763 = !DILocation(line: 297, column: 18, scope: !761)
!764 = !DILocation(line: 298, column: 19, scope: !761)
!765 = !DILocation(line: 298, column: 17, scope: !761)
!766 = !DILocation(line: 300, column: 6, scope: !767)
!767 = distinct !DILexicalBlock(scope: !761, file: !729, line: 300, column: 6)
!768 = !DILocation(line: 300, column: 22, scope: !767)
!769 = !DILocation(line: 300, column: 26, scope: !767)
!770 = !DILocation(line: 300, column: 29, scope: !771)
!771 = !DILexicalBlockFile(scope: !767, file: !729, discriminator: 1)
!772 = !DILocation(line: 300, column: 44, scope: !771)
!773 = !DILocation(line: 300, column: 6, scope: !771)
!774 = !DILocation(line: 301, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !729, line: 301, column: 7)
!776 = distinct !DILexicalBlock(scope: !767, file: !729, line: 300, column: 49)
!777 = !DILocation(line: 301, column: 17, scope: !775)
!778 = !DILocation(line: 301, column: 7, scope: !776)
!779 = !DILocation(line: 302, column: 16, scope: !780)
!780 = distinct !DILexicalBlock(scope: !775, file: !729, line: 301, column: 24)
!781 = !DILocation(line: 302, column: 14, scope: !780)
!782 = !DILocation(line: 304, column: 4, scope: !780)
!783 = !DILocation(line: 305, column: 4, scope: !780)
!784 = !DILocation(line: 306, column: 4, scope: !780)
!785 = !DILocation(line: 307, column: 3, scope: !780)
!786 = !DILocation(line: 308, column: 2, scope: !776)
!787 = !DILocation(line: 308, column: 13, scope: !788)
!788 = !DILexicalBlockFile(scope: !789, file: !729, discriminator: 1)
!789 = distinct !DILexicalBlock(scope: !767, file: !729, line: 308, column: 13)
!790 = !DILocation(line: 308, column: 23, scope: !788)
!791 = !DILocation(line: 309, column: 19, scope: !792)
!792 = distinct !DILexicalBlock(scope: !789, file: !729, line: 308, column: 30)
!793 = !DILocation(line: 309, column: 3, scope: !792)
!794 = !DILocation(line: 310, column: 13, scope: !792)
!795 = !DILocation(line: 312, column: 3, scope: !792)
!796 = !DILocation(line: 313, column: 3, scope: !792)
