; ModuleID = './line350-gui-readline.o.i'
source_filename = "./line350-gui-readline.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GTimeVal = type { i64, i64 }
%struct.ENTRY_REDIRECT_REC = type { void (i8*, i8*, i8*, i8*, i8*, i8*)*, i32, i8* }
%struct._GArray = type { i8*, i32 }
%struct._KEYBOARD_REC = type opaque
%struct.GUI_ENTRY_REC = type { i32, i32, i32*, i8**, %struct._GSList*, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i32, i8 }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque

!72 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!73 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!74 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!75 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!76 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!77 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!78 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!79 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!80 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 3, size: 32, align: 32, elements: !83)
!82 = !DIFile(filename: "module-formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!84 = !DIEnumerator(name: "TXT_MODULE_NAME", value: 0)
!85 = !DIEnumerator(name: "TXT_FILL_1", value: 1)
!86 = !DIEnumerator(name: "TXT_LASTLOG_TOO_LONG", value: 2)
!87 = !DIEnumerator(name: "TXT_LASTLOG_COUNT", value: 3)
!88 = !DIEnumerator(name: "TXT_LASTLOG_START", value: 4)
!89 = !DIEnumerator(name: "TXT_LASTLOG_END", value: 5)
!90 = !DIEnumerator(name: "TXT_LASTLOG_SEPARATOR", value: 6)
!91 = !DIEnumerator(name: "TXT_LASTLOG_DATE", value: 7)
!92 = !DIEnumerator(name: "TXT_FILL_2", value: 8)
!93 = !DIEnumerator(name: "TXT_REFNUM_NOT_FOUND", value: 9)
!94 = !DIEnumerator(name: "TXT_WINDOW_TOO_SMALL", value: 10)
!95 = !DIEnumerator(name: "TXT_CANT_HIDE_LAST", value: 11)
!96 = !DIEnumerator(name: "TXT_CANT_HIDE_STICKY_WINDOWS", value: 12)
!97 = !DIEnumerator(name: "TXT_CANT_SHOW_STICKY_WINDOWS", value: 13)
!98 = !DIEnumerator(name: "TXT_WINDOW_NOT_STICKY", value: 14)
!99 = !DIEnumerator(name: "TXT_WINDOW_SET_STICKY", value: 15)
!100 = !DIEnumerator(name: "TXT_WINDOW_UNSET_STICKY", value: 16)
!101 = !DIEnumerator(name: "TXT_WINDOW_INFO_STICKY", value: 17)
!102 = !DIEnumerator(name: "TXT_WINDOW_INFO_SCROLL", value: 18)
!103 = !DIEnumerator(name: "TXT_WINDOW_SCROLL", value: 19)
!104 = !DIEnumerator(name: "TXT_WINDOW_SCROLL_UNKNOWN", value: 20)
!105 = !DIEnumerator(name: "TXT_WINDOW_HIDELEVEL", value: 21)
!106 = !DIEnumerator(name: "TXT_FILL_3", value: 22)
!107 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_HEADER", value: 23)
!108 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_FOOTER", value: 24)
!109 = !DIEnumerator(name: "TXT_STATUSBAR_LIST", value: 25)
!110 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_NAME", value: 26)
!111 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_TYPE", value: 27)
!112 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_PLACEMENT", value: 28)
!113 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_POSITION", value: 29)
!114 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_VISIBLE", value: 30)
!115 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_HEADER", value: 31)
!116 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_FOOTER", value: 32)
!117 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_NAME", value: 33)
!118 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_FOUND", value: 34)
!119 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_ENABLED", value: 35)
!120 = !DIEnumerator(name: "TXT_STATUSBAR_ITEM_NOT_FOUND", value: 36)
!121 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_COMMAND", value: 37)
!122 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_TYPE", value: 38)
!123 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_PLACEMENT", value: 39)
!124 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_VISIBILITY", value: 40)
!125 = !DIEnumerator(name: "TXT_FILL_4", value: 41)
!126 = !DIEnumerator(name: "TXT_PASTE_WARNING", value: 42)
!127 = !DIEnumerator(name: "TXT_PASTE_PROMPT", value: 43)
!128 = !DIEnumerator(name: "TXT_FILL_5", value: 44)
!129 = !DIEnumerator(name: "TXT_IRSSI_BANNER", value: 45)
!130 = !DIEnumerator(name: "TXT_WELCOME_FIRSTTIME", value: 46)
!131 = !DIEnumerator(name: "TXT_WELCOME_INIT_SETTINGS", value: 47)
!132 = !DIEnumerator(name: "TXT_COUNT", value: 48)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 33, size: 32, align: 32, elements: !135)
!134 = !DIFile(filename: "gui-entry.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = !{!136, !137, !138, !139}
!136 = !DIEnumerator(name: "CUTBUFFER_UPDATE_NOOP", value: 0)
!137 = !DIEnumerator(name: "CUTBUFFER_UPDATE_REPLACE", value: 1)
!138 = !DIEnumerator(name: "CUTBUFFER_UPDATE_APPEND", value: 2)
!139 = !DIEnumerator(name: "CUTBUFFER_UPDATE_PREPEND", value: 3)
!140 = !{!141, !146, !334, !341, !211, !344, !154, !345, !346, !165, !351, !527, !152, !167, !534}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !142, line: 60, baseType: !143)
!142 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !146, !147, !154}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !150)
!150 = !{!151, !155, !301, !302, !307, !308, !309, !310, !311, !320, !321, !322, !326, !327, !328, !329, !330, !331, !332, !333}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !149, file: !4, line: 100, baseType: !152, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !153, line: 49, baseType: !154)
!153 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!154 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !149, file: !4, line: 101, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !159)
!159 = !{!160, !185, !191, !198, !202, !288, !292, !297}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !158, file: !4, line: 133, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !147, !165, !168, !171, !172}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !153, line: 46, baseType: !167)
!167 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !169, line: 66, baseType: !170)
!169 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!170 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !175, line: 42, baseType: !176)
!175 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !175, line: 44, size: 128, align: 64, elements: !177)
!177 = !{!178, !183, !184}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !176, file: !175, line: 46, baseType: !179, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !180, line: 36, baseType: !181)
!180 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !169, line: 45, baseType: !182)
!182 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !176, file: !175, line: 47, baseType: !152, size: 32, align: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !176, file: !175, line: 48, baseType: !165, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !158, file: !4, line: 138, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!164, !147, !189, !168, !171, !172}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !158, file: !4, line: 143, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!164, !147, !195, !197, !172}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !169, line: 51, baseType: !196)
!196 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !158, file: !4, line: 147, baseType: !199, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!164, !147, !172}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !158, file: !4, line: 149, baseType: !203, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !147, !287}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !209)
!209 = !{!210, !212, !233, !262, !264, !268, !269, !270, !271, !279, !280, !281, !283}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !208, file: !16, line: 174, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !153, line: 77, baseType: !146)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !208, file: !16, line: 175, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !216)
!216 = !{!217, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !215, file: !16, line: 198, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !211}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !215, file: !16, line: 199, baseType: !218, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !215, file: !16, line: 200, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !211, !206, !226, !232}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !211}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !153, line: 50, baseType: !152)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !208, file: !16, line: 177, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !238)
!238 = !{!239, !244, !248, !252, !256, !257}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !237, file: !16, line: 216, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!231, !206, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !237, file: !16, line: 218, baseType: !245, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!231, !206}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !237, file: !16, line: 219, baseType: !249, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!231, !206, !227, !211}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !237, file: !16, line: 222, baseType: !253, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !206}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !237, file: !16, line: 226, baseType: !227, size: 64, align: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !237, file: !16, line: 227, baseType: !258, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !208, file: !16, line: 178, baseType: !263, size: 32, align: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !153, line: 55, baseType: !182)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !208, file: !16, line: 180, baseType: !265, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !208, file: !16, line: 182, baseType: !152, size: 32, align: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !16, line: 183, baseType: !263, size: 32, align: 32, offset: 352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !208, file: !16, line: 184, baseType: !263, size: 32, align: 32, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !208, file: !16, line: 186, baseType: !272, size: 64, align: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !274, line: 37, baseType: !275)
!274 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !274, line: 39, size: 128, align: 64, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !274, line: 41, baseType: !211, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !274, line: 42, baseType: !272, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !208, file: !16, line: 188, baseType: !206, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !16, line: 189, baseType: !206, size: 64, align: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !16, line: 191, baseType: !282, size: 64, align: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !208, file: !16, line: 193, baseType: !284, size: 64, align: 64, offset: 704)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !158, file: !4, line: 151, baseType: !289, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !147}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !158, file: !4, line: 152, baseType: !293, size: 64, align: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!164, !147, !296, !172}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !158, file: !4, line: 155, baseType: !298, size: 64, align: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!296, !147}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !149, file: !4, line: 103, baseType: !165, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !149, file: !4, line: 104, baseType: !303, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !304, line: 77, baseType: !305)
!304 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !304, line: 77, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !149, file: !4, line: 105, baseType: !303, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !149, file: !4, line: 106, baseType: !165, size: 64, align: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !149, file: !4, line: 107, baseType: !263, size: 32, align: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !149, file: !4, line: 109, baseType: !168, size: 64, align: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !149, file: !4, line: 110, baseType: !312, size: 64, align: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !314, line: 39, baseType: !315)
!314 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !314, line: 41, size: 192, align: 64, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !315, file: !314, line: 43, baseType: !165, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !315, file: !314, line: 44, baseType: !168, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !315, file: !314, line: 45, baseType: !168, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !149, file: !4, line: 111, baseType: !312, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !149, file: !4, line: 112, baseType: !312, size: 64, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !149, file: !4, line: 113, baseType: !323, size: 48, align: 8, offset: 704)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 48, align: 8, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 6)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !149, file: !4, line: 117, baseType: !263, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !149, file: !4, line: 118, baseType: !263, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !149, file: !4, line: 119, baseType: !263, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !149, file: !4, line: 120, baseType: !263, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !149, file: !4, line: 121, baseType: !263, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !149, file: !4, line: 122, baseType: !263, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !149, file: !4, line: 124, baseType: !211, size: 64, align: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !149, file: !4, line: 125, baseType: !211, size: 64, align: 64, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !335, line: 9, baseType: !336)
!335 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !339, !339, !339, !339, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !343, line: 12, baseType: !181)
!343 = !DIFile(filename: "../../src/core/utf8.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !153, line: 48, baseType: !196)
!345 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRY_REDIRECT_ENTRY_FUNC", file: !347, line: 47, baseType: !348)
!347 = !DIFile(filename: "gui-readline.c", directory: "/home/lichi/Desktop/irssi/task1")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351, !146, !353, !503}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !142, line: 107, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !356, line: 30, size: 2240, align: 64, elements: !357)
!356 = !DIFile(filename: "../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!357 = !{!358, !360, !361, !362, !409, !414, !415, !416, !417, !418, !419, !420, !421, !422, !426, !427, !431, !432, !433, !437, !442, !443, !444, !445, !446, !447, !448, !449, !455, !456, !457, !458, !459, !463, !467, !471, !475, !479, !484, !491, !498, !502}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !359, line: 3, baseType: !154, size: 32, align: 32)
!359 = !DIFile(filename: "../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !355, file: !359, line: 4, baseType: !154, size: 32, align: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !355, file: !359, line: 6, baseType: !154, size: 32, align: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !355, file: !359, line: 8, baseType: !363, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !142, line: 113, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !356, line: 25, size: 1920, align: 64, elements: !366)
!366 = !{!367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !368, line: 3, baseType: !154, size: 32, align: 32)
!368 = !DIFile(filename: "../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !365, file: !368, line: 4, baseType: !154, size: 32, align: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !365, file: !368, line: 6, baseType: !154, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !365, file: !368, line: 9, baseType: !282, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !365, file: !368, line: 10, baseType: !154, size: 32, align: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !365, file: !368, line: 11, baseType: !282, size: 64, align: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !365, file: !368, line: 11, baseType: !282, size: 64, align: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !365, file: !368, line: 11, baseType: !282, size: 64, align: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !365, file: !368, line: 13, baseType: !345, size: 16, align: 16, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !365, file: !368, line: 14, baseType: !282, size: 64, align: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !365, file: !368, line: 15, baseType: !282, size: 64, align: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !365, file: !368, line: 16, baseType: !154, size: 32, align: 32, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !365, file: !368, line: 17, baseType: !282, size: 64, align: 64, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !365, file: !368, line: 19, baseType: !382, size: 64, align: 64, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !142, line: 99, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !142, line: 99, flags: DIFlagFwdDecl)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !365, file: !368, line: 19, baseType: !382, size: 64, align: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !365, file: !368, line: 21, baseType: !282, size: 64, align: 64, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !365, file: !368, line: 22, baseType: !282, size: 64, align: 64, offset: 960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !365, file: !368, line: 23, baseType: !282, size: 64, align: 64, offset: 1024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !365, file: !368, line: 24, baseType: !282, size: 64, align: 64, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !365, file: !368, line: 26, baseType: !282, size: 64, align: 64, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !365, file: !368, line: 27, baseType: !282, size: 64, align: 64, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !365, file: !368, line: 28, baseType: !282, size: 64, align: 64, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !365, file: !368, line: 29, baseType: !282, size: 64, align: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !365, file: !368, line: 30, baseType: !282, size: 64, align: 64, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !365, file: !368, line: 31, baseType: !282, size: 64, align: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !365, file: !368, line: 32, baseType: !282, size: 64, align: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !365, file: !368, line: 33, baseType: !282, size: 64, align: 64, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !365, file: !368, line: 35, baseType: !147, size: 64, align: 64, offset: 1664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !365, file: !368, line: 38, baseType: !182, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !365, file: !368, line: 39, baseType: !182, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !365, file: !368, line: 40, baseType: !182, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !365, file: !368, line: 41, baseType: !182, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !365, file: !368, line: 42, baseType: !182, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !365, file: !368, line: 43, baseType: !182, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !365, file: !368, line: 44, baseType: !182, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !365, file: !368, line: 45, baseType: !182, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !365, file: !368, line: 46, baseType: !282, size: 64, align: 64, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !365, file: !368, line: 47, baseType: !282, size: 64, align: 64, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !355, file: !359, line: 9, baseType: !410, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !411, line: 75, baseType: !412)
!411 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !413, line: 139, baseType: !196)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !355, file: !359, line: 10, baseType: !410, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !355, file: !359, line: 12, baseType: !282, size: 64, align: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !355, file: !359, line: 13, baseType: !282, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !355, file: !359, line: 15, baseType: !182, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !355, file: !359, line: 16, baseType: !182, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !355, file: !359, line: 17, baseType: !182, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !355, file: !359, line: 18, baseType: !182, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !355, file: !359, line: 19, baseType: !182, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !355, file: !359, line: 21, baseType: !423, size: 64, align: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !142, line: 102, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !142, line: 102, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !355, file: !359, line: 22, baseType: !154, size: 32, align: 32, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !355, file: !359, line: 25, baseType: !428, size: 128, align: 64, offset: 640)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, align: 64, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 2)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !355, file: !359, line: 26, baseType: !154, size: 32, align: 32, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !355, file: !359, line: 27, baseType: !154, size: 32, align: 32, offset: 800)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !355, file: !359, line: 29, baseType: !434, size: 64, align: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !142, line: 103, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !142, line: 103, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !355, file: !359, line: 30, baseType: !438, size: 64, align: 64, offset: 896)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !440, line: 37, baseType: !441)
!440 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !440, line: 37, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !355, file: !359, line: 32, baseType: !282, size: 64, align: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !355, file: !359, line: 33, baseType: !282, size: 64, align: 64, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !355, file: !359, line: 34, baseType: !282, size: 64, align: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !355, file: !359, line: 35, baseType: !182, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !355, file: !359, line: 36, baseType: !182, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !355, file: !359, line: 37, baseType: !182, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !355, file: !359, line: 38, baseType: !182, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !355, file: !359, line: 40, baseType: !450, size: 128, align: 64, offset: 1216)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !153, line: 504, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !153, line: 506, size: 128, align: 64, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !451, file: !153, line: 508, baseType: !344, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !451, file: !153, line: 509, baseType: !344, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !355, file: !359, line: 41, baseType: !410, size: 64, align: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !355, file: !359, line: 42, baseType: !154, size: 32, align: 32, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !355, file: !359, line: 44, baseType: !272, size: 64, align: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !355, file: !359, line: 45, baseType: !272, size: 64, align: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !355, file: !359, line: 53, baseType: !460, size: 64, align: 64, offset: 1600)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !353, !351, !154}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !355, file: !359, line: 55, baseType: !464, size: 64, align: 64, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!154, !353, !167}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !355, file: !359, line: 57, baseType: !468, size: 64, align: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!154, !353, !351}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !355, file: !359, line: 60, baseType: !472, size: 64, align: 64, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!351, !353}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !355, file: !359, line: 62, baseType: !476, size: 64, align: 64, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !353, !351, !351, !154}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !355, file: !359, line: 65, baseType: !480, size: 64, align: 64, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !353, !351, !351}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !355, file: !359, line: 69, baseType: !485, size: 64, align: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !353, !351}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !142, line: 109, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !142, line: 109, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !355, file: !359, line: 70, baseType: !492, size: 64, align: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !353, !351}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !142, line: 110, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !142, line: 110, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !355, file: !359, line: 71, baseType: !499, size: 64, align: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!154, !351, !351}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !355, file: !359, line: 73, baseType: !499, size: 64, align: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !142, line: 108, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !506, line: 5, size: 704, align: 64, elements: !507)
!506 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!507 = !{!508, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !523}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !505, file: !509, line: 3, baseType: !154, size: 32, align: 32)
!509 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !505, file: !509, line: 4, baseType: !154, size: 32, align: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !505, file: !509, line: 5, baseType: !438, size: 64, align: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !505, file: !509, line: 7, baseType: !146, size: 64, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !505, file: !509, line: 8, baseType: !353, size: 64, align: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !505, file: !509, line: 9, baseType: !282, size: 64, align: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !509, line: 10, baseType: !282, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !505, file: !509, line: 11, baseType: !410, size: 64, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !505, file: !509, line: 12, baseType: !154, size: 32, align: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !505, file: !509, line: 13, baseType: !282, size: 64, align: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !505, file: !509, line: 15, baseType: !520, size: 64, align: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !503}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !505, file: !509, line: 17, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!351, !503}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRY_REDIRECT_REC", file: !347, line: 53, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 49, size: 192, align: 64, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !529, file: !347, line: 50, baseType: !334, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !347, line: 51, baseType: !154, size: 32, align: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !347, line: 52, baseType: !146, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENTRY_REDIRECT_KEY_FUNC", file: !347, line: 46, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !154, !146, !353, !503}
!538 = !{!539, !545, !550, !551, !552, !553, !554, !555, !556, !564, !565, !566, !567, !568, !569, !570, !571, !572, !575, !576, !577, !578, !579, !580}
!539 = distinct !DIGlobalVariable(name: "changekeys", scope: !540, file: !347, line: 1142, type: !542, isLocal: true, isDefinition: true, variable: [20 x i8]* @gui_readline_init.changekeys)
!540 = distinct !DISubprogram(name: "gui_readline_init", scope: !347, file: !347, line: 1140, type: !260, isLocal: false, isDefinition: true, scopeLine: 1141, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!541 = !{}
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 160, align: 8, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 20)
!545 = distinct !DIGlobalVariable(name: "keyboard", scope: !0, file: !347, line: 55, type: !546, isLocal: true, isDefinition: true, variable: %struct._KEYBOARD_REC** @keyboard)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "KEYBOARD_REC", file: !548, line: 6, baseType: !549)
!548 = !DIFile(filename: "../../src/fe-common/core/keyboard.h", directory: "/home/lichi/Desktop/irssi/task1")
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "_KEYBOARD_REC", file: !548, line: 6, flags: DIFlagFwdDecl)
!550 = distinct !DIGlobalVariable(name: "redir", scope: !0, file: !347, line: 56, type: !527, isLocal: true, isDefinition: true, variable: %struct.ENTRY_REDIRECT_REC** @redir)
!551 = distinct !DIGlobalVariable(name: "escape_next_key", scope: !0, file: !347, line: 57, type: !154, isLocal: true, isDefinition: true, variable: i32* @escape_next_key)
!552 = distinct !DIGlobalVariable(name: "readtag", scope: !0, file: !347, line: 59, type: !154, isLocal: true, isDefinition: true, variable: i32* @readtag)
!553 = distinct !DIGlobalVariable(name: "last_keypress", scope: !0, file: !347, line: 61, type: !450, isLocal: true, isDefinition: true, variable: %struct._GTimeVal* @last_keypress)
!554 = distinct !DIGlobalVariable(name: "paste_entry", scope: !0, file: !347, line: 64, type: !282, isLocal: true, isDefinition: true, variable: i8** @paste_entry)
!555 = distinct !DIGlobalVariable(name: "paste_entry_pos", scope: !0, file: !347, line: 65, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_entry_pos)
!556 = distinct !DIGlobalVariable(name: "paste_buffer", scope: !0, file: !347, line: 66, type: !557, isLocal: true, isDefinition: true, variable: %struct._GArray** @paste_buffer)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GArray", file: !559, line: 37, baseType: !560)
!559 = !DIFile(filename: "/usr/include/glib-2.0/glib/garray.h", directory: "/home/lichi/Desktop/irssi/task1")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GArray", file: !559, line: 41, size: 128, align: 64, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !559, line: 43, baseType: !165, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !560, file: !559, line: 44, baseType: !263, size: 32, align: 32, offset: 64)
!564 = distinct !DIGlobalVariable(name: "paste_buffer_rest", scope: !0, file: !347, line: 67, type: !557, isLocal: true, isDefinition: true, variable: %struct._GArray** @paste_buffer_rest)
!565 = distinct !DIGlobalVariable(name: "paste_old_prompt", scope: !0, file: !347, line: 69, type: !282, isLocal: true, isDefinition: true, variable: i8** @paste_old_prompt)
!566 = distinct !DIGlobalVariable(name: "paste_timeout_id", scope: !0, file: !347, line: 72, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_timeout_id)
!567 = distinct !DIGlobalVariable(name: "paste_bracketed_mode", scope: !0, file: !347, line: 74, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_bracketed_mode)
!568 = distinct !DIGlobalVariable(name: "paste_prompt", scope: !0, file: !347, line: 70, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_prompt)
!569 = distinct !DIGlobalVariable(name: "paste_join_multiline", scope: !0, file: !347, line: 71, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_join_multiline)
!570 = distinct !DIGlobalVariable(name: "paste_was_bracketed_mode", scope: !0, file: !347, line: 75, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_was_bracketed_mode)
!571 = distinct !DIGlobalVariable(name: "paste_line_count", scope: !0, file: !347, line: 70, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_line_count)
!572 = distinct !DIGlobalVariable(name: "bp_end", scope: !0, file: !347, line: 82, type: !573, isLocal: true, isDefinition: true, variable: [6 x i32]* @bp_end)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 192, align: 32, elements: !324)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!575 = distinct !DIGlobalVariable(name: "bp_start", scope: !0, file: !347, line: 81, type: !573, isLocal: true, isDefinition: true, variable: [6 x i32]* @bp_start)
!576 = distinct !DIGlobalVariable(name: "paste_use_bracketed_mode", scope: !0, file: !347, line: 73, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_use_bracketed_mode)
!577 = distinct !DIGlobalVariable(name: "paste_detect_time", scope: !0, file: !347, line: 63, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_detect_time)
!578 = distinct !DIGlobalVariable(name: "paste_verify_line_count", scope: !0, file: !347, line: 63, type: !154, isLocal: true, isDefinition: true, variable: i32* @paste_verify_line_count)
!579 = distinct !DIGlobalVariable(name: "previous_yank_preceded", scope: !0, file: !347, line: 76, type: !154, isLocal: true, isDefinition: true, variable: i32* @previous_yank_preceded)
!580 = distinct !DIGlobalVariable(name: "prev_key", scope: !0, file: !347, line: 60, type: !342, isLocal: true, isDefinition: true, variable: i32* @prev_key)
!581 = !{i32 2, !"Dwarf Version", i32 4}
!582 = !{i32 2, !"Debug Info Version", i32 3}
!583 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!584 = distinct !DISubprogram(name: "input_listen_init", scope: !347, file: !347, line: 86, type: !585, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !154}
!587 = !DILocalVariable(name: "handle", arg: 1, scope: !584, file: !347, line: 86, type: !154)
!588 = !DIExpression()
!589 = !DILocation(line: 86, column: 28, scope: !584)
!590 = !DILocation(line: 88, column: 29, scope: !584)
!591 = !DILocation(line: 88, column: 12, scope: !584)
!592 = !DILocation(line: 88, column: 10, scope: !584)
!593 = !DILocation(line: 91, column: 1, scope: !584)
!594 = distinct !DISubprogram(name: "sig_input", scope: !347, file: !347, line: 818, type: !260, isLocal: true, isDefinition: true, scopeLine: 819, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!595 = !DILocation(line: 820, column: 7, scope: !596)
!596 = distinct !DILexicalBlock(scope: !594, file: !347, line: 820, column: 6)
!597 = !DILocation(line: 820, column: 6, scope: !594)
!598 = !DILocation(line: 822, column: 3, scope: !599)
!599 = distinct !DILexicalBlock(scope: !596, file: !347, line: 820, column: 21)
!600 = !DILocation(line: 825, column: 6, scope: !601)
!601 = distinct !DILexicalBlock(scope: !594, file: !347, line: 825, column: 6)
!602 = !DILocation(line: 825, column: 6, scope: !594)
!603 = !DILocalVariable(name: "buffer", scope: !604, file: !347, line: 826, type: !557)
!604 = distinct !DILexicalBlock(scope: !601, file: !347, line: 825, column: 20)
!605 = !DILocation(line: 826, column: 11, scope: !604)
!606 = !DILocation(line: 826, column: 20, scope: !604)
!607 = !DILocalVariable(name: "line_count", scope: !604, file: !347, line: 827, type: !154)
!608 = !DILocation(line: 827, column: 7, scope: !604)
!609 = !DILocalVariable(name: "key", scope: !604, file: !347, line: 828, type: !342)
!610 = !DILocation(line: 828, column: 11, scope: !604)
!611 = !DILocation(line: 829, column: 13, scope: !604)
!612 = !DILocation(line: 829, column: 3, scope: !604)
!613 = !DILocation(line: 830, column: 32, scope: !604)
!614 = !DILocation(line: 830, column: 41, scope: !604)
!615 = !DILocation(line: 830, column: 11, scope: !604)
!616 = !DILocation(line: 830, column: 10, scope: !604)
!617 = !DILocation(line: 830, column: 7, scope: !604)
!618 = !DILocation(line: 832, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !604, file: !347, line: 832, column: 7)
!620 = !DILocation(line: 832, column: 11, scope: !619)
!621 = !DILocation(line: 832, column: 17, scope: !619)
!622 = !DILocation(line: 832, column: 20, scope: !623)
!623 = !DILexicalBlockFile(scope: !619, file: !347, discriminator: 1)
!624 = !DILocation(line: 832, column: 24, scope: !623)
!625 = !DILocation(line: 832, column: 7, scope: !623)
!626 = !DILocation(line: 833, column: 16, scope: !619)
!627 = !DILocation(line: 833, column: 20, scope: !619)
!628 = !DILocation(line: 833, column: 4, scope: !619)
!629 = !DILocation(line: 834, column: 16, scope: !604)
!630 = !DILocation(line: 834, column: 3, scope: !604)
!631 = !DILocation(line: 835, column: 2, scope: !604)
!632 = !DILocation(line: 836, column: 13, scope: !633)
!633 = distinct !DILexicalBlock(scope: !601, file: !347, line: 835, column: 9)
!634 = !DILocation(line: 836, column: 3, scope: !633)
!635 = !DILocation(line: 840, column: 7, scope: !636)
!636 = distinct !DILexicalBlock(scope: !633, file: !347, line: 840, column: 7)
!637 = !DILocation(line: 840, column: 7, scope: !633)
!638 = !DILocation(line: 841, column: 4, scope: !639)
!639 = distinct !DILexicalBlock(scope: !636, file: !347, line: 840, column: 29)
!640 = !DILocation(line: 843, column: 3, scope: !639)
!641 = !DILocation(line: 843, column: 15, scope: !642)
!642 = !DILexicalBlockFile(scope: !643, file: !347, discriminator: 1)
!643 = distinct !DILexicalBlock(scope: !636, file: !347, line: 843, column: 14)
!644 = !DILocation(line: 843, column: 40, scope: !642)
!645 = !DILocation(line: 843, column: 43, scope: !646)
!646 = !DILexicalBlockFile(scope: !643, file: !347, discriminator: 2)
!647 = !DILocation(line: 843, column: 61, scope: !646)
!648 = !DILocation(line: 843, column: 65, scope: !646)
!649 = !DILocation(line: 843, column: 68, scope: !650)
!650 = !DILexicalBlockFile(scope: !643, file: !347, discriminator: 3)
!651 = !DILocation(line: 843, column: 82, scope: !650)
!652 = !DILocation(line: 843, column: 86, scope: !650)
!653 = !DILocation(line: 843, column: 14, scope: !650)
!654 = !DILocation(line: 844, column: 8, scope: !655)
!655 = distinct !DILexicalBlock(scope: !656, file: !347, line: 844, column: 8)
!656 = distinct !DILexicalBlock(scope: !643, file: !347, line: 843, column: 92)
!657 = !DILocation(line: 844, column: 25, scope: !655)
!658 = !DILocation(line: 844, column: 8, scope: !656)
!659 = !DILocation(line: 845, column: 21, scope: !655)
!660 = !DILocation(line: 845, column: 5, scope: !655)
!661 = !DILocation(line: 846, column: 37, scope: !656)
!662 = !DILocation(line: 846, column: 23, scope: !656)
!663 = !DILocation(line: 846, column: 21, scope: !656)
!664 = !DILocation(line: 847, column: 3, scope: !656)
!665 = !DILocation(line: 847, column: 15, scope: !666)
!666 = !DILexicalBlockFile(scope: !667, file: !347, discriminator: 1)
!667 = distinct !DILexicalBlock(scope: !643, file: !347, line: 847, column: 14)
!668 = !DILocation(line: 847, column: 14, scope: !666)
!669 = !DILocalVariable(name: "i", scope: !670, file: !347, line: 848, type: !154)
!670 = distinct !DILexicalBlock(scope: !667, file: !347, line: 847, column: 37)
!671 = !DILocation(line: 848, column: 8, scope: !670)
!672 = !DILocation(line: 850, column: 11, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !347, line: 850, column: 4)
!674 = !DILocation(line: 850, column: 9, scope: !673)
!675 = !DILocation(line: 850, column: 16, scope: !676)
!676 = !DILexicalBlockFile(scope: !677, file: !347, discriminator: 1)
!677 = distinct !DILexicalBlock(scope: !673, file: !347, line: 850, column: 4)
!678 = !DILocation(line: 850, column: 20, scope: !676)
!679 = !DILocation(line: 850, column: 34, scope: !676)
!680 = !DILocation(line: 850, column: 18, scope: !676)
!681 = !DILocation(line: 850, column: 4, scope: !676)
!682 = !DILocalVariable(name: "key", scope: !683, file: !347, line: 851, type: !342)
!683 = distinct !DILexicalBlock(scope: !677, file: !347, line: 850, column: 44)
!684 = !DILocation(line: 851, column: 13, scope: !683)
!685 = !DILocation(line: 851, column: 65, scope: !683)
!686 = !DILocation(line: 851, column: 20, scope: !683)
!687 = !DILocation(line: 851, column: 42, scope: !683)
!688 = !DILocation(line: 851, column: 57, scope: !683)
!689 = !DILocation(line: 851, column: 21, scope: !683)
!690 = !DILocation(line: 852, column: 60, scope: !683)
!691 = !DILocation(line: 852, column: 51, scope: !683)
!692 = !DILocation(line: 852, column: 40, scope: !683)
!693 = !DILocation(line: 852, column: 5, scope: !683)
!694 = !DILocation(line: 854, column: 9, scope: !695)
!695 = distinct !DILexicalBlock(scope: !683, file: !347, line: 854, column: 9)
!696 = !DILocation(line: 854, column: 9, scope: !683)
!697 = !DILocation(line: 856, column: 27, scope: !698)
!698 = distinct !DILexicalBlock(scope: !695, file: !347, line: 854, column: 31)
!699 = !DILocation(line: 856, column: 44, scope: !698)
!700 = !DILocation(line: 856, column: 46, scope: !698)
!701 = !DILocation(line: 856, column: 6, scope: !698)
!702 = !DILocation(line: 859, column: 6, scope: !698)
!703 = !DILocation(line: 860, column: 6, scope: !698)
!704 = !DILocation(line: 862, column: 4, scope: !683)
!705 = !DILocation(line: 850, column: 40, scope: !706)
!706 = !DILexicalBlockFile(scope: !677, file: !347, discriminator: 2)
!707 = !DILocation(line: 850, column: 4, scope: !706)
!708 = distinct !{!708, !709}
!709 = !DILocation(line: 850, column: 4, scope: !670)
!710 = !DILocation(line: 863, column: 21, scope: !670)
!711 = !DILocation(line: 863, column: 4, scope: !670)
!712 = !DILocation(line: 864, column: 21, scope: !670)
!713 = !DILocation(line: 865, column: 3, scope: !670)
!714 = !DILocation(line: 867, column: 1, scope: !594)
!715 = distinct !DISubprogram(name: "input_listen_deinit", scope: !347, file: !347, line: 93, type: !260, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!716 = !DILocation(line: 95, column: 18, scope: !715)
!717 = !DILocation(line: 95, column: 2, scope: !715)
!718 = !DILocation(line: 96, column: 17, scope: !715)
!719 = !DILocation(line: 97, column: 1, scope: !715)
!720 = distinct !DISubprogram(name: "get_idle_time", scope: !347, file: !347, line: 874, type: !721, isLocal: false, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!721 = !DISubroutineType(types: !722)
!722 = !{!410}
!723 = !DILocation(line: 876, column: 23, scope: !720)
!724 = !DILocation(line: 876, column: 2, scope: !720)
!725 = !DILocalVariable(name: "key", scope: !540, file: !347, line: 1143, type: !282)
!726 = !DILocation(line: 1143, column: 8, scope: !540)
!727 = !DILocalVariable(name: "data", scope: !540, file: !347, line: 1143, type: !728)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 96, align: 8, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 12)
!731 = !DILocation(line: 1143, column: 13, scope: !540)
!732 = !DILocalVariable(name: "n", scope: !540, file: !347, line: 1144, type: !154)
!733 = !DILocation(line: 1144, column: 6, scope: !540)
!734 = !DILocation(line: 1146, column: 25, scope: !540)
!735 = !DILocation(line: 1147, column: 8, scope: !540)
!736 = !DILocation(line: 1148, column: 14, scope: !540)
!737 = !DILocation(line: 1149, column: 18, scope: !540)
!738 = !DILocation(line: 1150, column: 17, scope: !540)
!739 = !DILocation(line: 1150, column: 15, scope: !540)
!740 = !DILocation(line: 1151, column: 22, scope: !540)
!741 = !DILocation(line: 1151, column: 20, scope: !540)
!742 = !DILocation(line: 1152, column: 26, scope: !540)
!743 = !DILocation(line: 1153, column: 19, scope: !540)
!744 = !DILocation(line: 1154, column: 23, scope: !540)
!745 = !DILocation(line: 1155, column: 2, scope: !540)
!746 = !DILocation(line: 1156, column: 9, scope: !540)
!747 = !DILocation(line: 1158, column: 2, scope: !540)
!748 = !DILocation(line: 1159, column: 2, scope: !540)
!749 = !DILocation(line: 1160, column: 2, scope: !540)
!750 = !DILocation(line: 1161, column: 2, scope: !540)
!751 = !DILocation(line: 1164, column: 2, scope: !540)
!752 = !DILocation(line: 1165, column: 2, scope: !540)
!753 = !DILocation(line: 1166, column: 9, scope: !540)
!754 = !DILocation(line: 1168, column: 13, scope: !540)
!755 = !DILocation(line: 1168, column: 11, scope: !540)
!756 = !DILocation(line: 1169, column: 9, scope: !540)
!757 = !DILocation(line: 1171, column: 2, scope: !540)
!758 = !DILocation(line: 1172, column: 2, scope: !540)
!759 = !DILocation(line: 1173, column: 2, scope: !540)
!760 = !DILocation(line: 1174, column: 2, scope: !540)
!761 = !DILocation(line: 1175, column: 2, scope: !540)
!762 = !DILocation(line: 1176, column: 2, scope: !540)
!763 = !DILocation(line: 1177, column: 2, scope: !540)
!764 = !DILocation(line: 1180, column: 2, scope: !540)
!765 = !DILocation(line: 1181, column: 2, scope: !540)
!766 = !DILocation(line: 1182, column: 2, scope: !540)
!767 = !DILocation(line: 1183, column: 2, scope: !540)
!768 = !DILocation(line: 1186, column: 2, scope: !540)
!769 = !DILocation(line: 1187, column: 2, scope: !540)
!770 = !DILocation(line: 1188, column: 2, scope: !540)
!771 = !DILocation(line: 1189, column: 2, scope: !540)
!772 = !DILocation(line: 1191, column: 2, scope: !540)
!773 = !DILocation(line: 1192, column: 2, scope: !540)
!774 = !DILocation(line: 1193, column: 2, scope: !540)
!775 = !DILocation(line: 1195, column: 2, scope: !540)
!776 = !DILocation(line: 1196, column: 2, scope: !540)
!777 = !DILocation(line: 1197, column: 2, scope: !540)
!778 = !DILocation(line: 1199, column: 2, scope: !540)
!779 = !DILocation(line: 1200, column: 2, scope: !540)
!780 = !DILocation(line: 1201, column: 2, scope: !540)
!781 = !DILocation(line: 1202, column: 2, scope: !540)
!782 = !DILocation(line: 1204, column: 2, scope: !540)
!783 = !DILocation(line: 1205, column: 2, scope: !540)
!784 = !DILocation(line: 1207, column: 2, scope: !540)
!785 = !DILocation(line: 1208, column: 2, scope: !540)
!786 = !DILocation(line: 1209, column: 2, scope: !540)
!787 = !DILocation(line: 1210, column: 2, scope: !540)
!788 = !DILocation(line: 1211, column: 2, scope: !540)
!789 = !DILocation(line: 1212, column: 2, scope: !540)
!790 = !DILocation(line: 1213, column: 2, scope: !540)
!791 = !DILocation(line: 1214, column: 2, scope: !540)
!792 = !DILocation(line: 1216, column: 2, scope: !540)
!793 = !DILocation(line: 1217, column: 2, scope: !540)
!794 = !DILocation(line: 1218, column: 2, scope: !540)
!795 = !DILocation(line: 1219, column: 2, scope: !540)
!796 = !DILocation(line: 1220, column: 2, scope: !540)
!797 = !DILocation(line: 1221, column: 2, scope: !540)
!798 = !DILocation(line: 1222, column: 2, scope: !540)
!799 = !DILocation(line: 1223, column: 2, scope: !540)
!800 = !DILocation(line: 1225, column: 2, scope: !540)
!801 = !DILocation(line: 1226, column: 2, scope: !540)
!802 = !DILocation(line: 1227, column: 2, scope: !540)
!803 = !DILocation(line: 1228, column: 2, scope: !540)
!804 = !DILocation(line: 1230, column: 2, scope: !540)
!805 = !DILocation(line: 1231, column: 2, scope: !540)
!806 = !DILocation(line: 1232, column: 2, scope: !540)
!807 = !DILocation(line: 1233, column: 2, scope: !540)
!808 = !DILocation(line: 1235, column: 2, scope: !540)
!809 = !DILocation(line: 1237, column: 2, scope: !540)
!810 = !DILocation(line: 1240, column: 2, scope: !540)
!811 = !DILocation(line: 1241, column: 2, scope: !540)
!812 = !DILocation(line: 1242, column: 3, scope: !540)
!813 = !DILocation(line: 1243, column: 3, scope: !540)
!814 = !DILocation(line: 1244, column: 2, scope: !540)
!815 = !DILocation(line: 1245, column: 2, scope: !540)
!816 = !DILocation(line: 1246, column: 3, scope: !540)
!817 = !DILocation(line: 1247, column: 2, scope: !540)
!818 = !DILocation(line: 1248, column: 2, scope: !540)
!819 = !DILocation(line: 1249, column: 2, scope: !540)
!820 = !DILocation(line: 1250, column: 2, scope: !540)
!821 = !DILocation(line: 1251, column: 2, scope: !540)
!822 = !DILocation(line: 1254, column: 2, scope: !540)
!823 = !DILocation(line: 1255, column: 2, scope: !540)
!824 = !DILocation(line: 1256, column: 2, scope: !540)
!825 = !DILocation(line: 1257, column: 2, scope: !540)
!826 = !DILocation(line: 1258, column: 2, scope: !540)
!827 = !DILocation(line: 1261, column: 2, scope: !540)
!828 = !DILocation(line: 1262, column: 2, scope: !540)
!829 = !DILocation(line: 1263, column: 2, scope: !540)
!830 = !DILocation(line: 1264, column: 2, scope: !540)
!831 = !DILocation(line: 1265, column: 2, scope: !540)
!832 = !DILocation(line: 1266, column: 2, scope: !540)
!833 = !DILocation(line: 1267, column: 2, scope: !540)
!834 = !DILocation(line: 1268, column: 2, scope: !540)
!835 = !DILocation(line: 1269, column: 2, scope: !540)
!836 = !DILocation(line: 1270, column: 2, scope: !540)
!837 = !DILocation(line: 1271, column: 2, scope: !540)
!838 = !DILocation(line: 1272, column: 2, scope: !540)
!839 = !DILocation(line: 1273, column: 2, scope: !540)
!840 = !DILocation(line: 1274, column: 2, scope: !540)
!841 = !DILocation(line: 1275, column: 2, scope: !540)
!842 = !DILocation(line: 1276, column: 2, scope: !540)
!843 = !DILocation(line: 1277, column: 2, scope: !540)
!844 = !DILocation(line: 1278, column: 2, scope: !540)
!845 = !DILocation(line: 1281, column: 2, scope: !540)
!846 = !DILocation(line: 1282, column: 2, scope: !540)
!847 = !DILocation(line: 1283, column: 2, scope: !540)
!848 = !DILocation(line: 1284, column: 2, scope: !540)
!849 = !DILocation(line: 1285, column: 2, scope: !540)
!850 = !DILocation(line: 1288, column: 2, scope: !540)
!851 = !DILocation(line: 1289, column: 2, scope: !540)
!852 = !DILocation(line: 1290, column: 2, scope: !540)
!853 = !DILocation(line: 1291, column: 2, scope: !540)
!854 = !DILocation(line: 1292, column: 2, scope: !540)
!855 = !DILocation(line: 1293, column: 2, scope: !540)
!856 = !DILocation(line: 1294, column: 2, scope: !540)
!857 = !DILocation(line: 1295, column: 2, scope: !540)
!858 = !DILocation(line: 1296, column: 2, scope: !540)
!859 = !DILocation(line: 1298, column: 2, scope: !540)
!860 = !DILocation(line: 1299, column: 2, scope: !540)
!861 = !DILocation(line: 1300, column: 2, scope: !540)
!862 = !DILocation(line: 1301, column: 2, scope: !540)
!863 = !DILocation(line: 1302, column: 2, scope: !540)
!864 = !DILocation(line: 1303, column: 2, scope: !540)
!865 = !DILocation(line: 1304, column: 2, scope: !540)
!866 = !DILocation(line: 1307, column: 2, scope: !540)
!867 = !DILocation(line: 1308, column: 2, scope: !540)
!868 = !DILocation(line: 1311, column: 2, scope: !540)
!869 = !DILocation(line: 1312, column: 2, scope: !540)
!870 = !DILocation(line: 1315, column: 9, scope: !871)
!871 = distinct !DILexicalBlock(scope: !540, file: !347, line: 1315, column: 2)
!872 = !DILocation(line: 1315, column: 7, scope: !871)
!873 = !DILocation(line: 1315, column: 25, scope: !874)
!874 = !DILexicalBlockFile(scope: !875, file: !347, discriminator: 1)
!875 = distinct !DILexicalBlock(scope: !871, file: !347, line: 1315, column: 2)
!876 = !DILocation(line: 1315, column: 14, scope: !874)
!877 = !DILocation(line: 1315, column: 28, scope: !874)
!878 = !DILocation(line: 1315, column: 2, scope: !874)
!879 = !DILocation(line: 1316, column: 47, scope: !880)
!880 = distinct !DILexicalBlock(scope: !875, file: !347, line: 1315, column: 42)
!881 = !DILocation(line: 1316, column: 36, scope: !880)
!882 = !DILocation(line: 1316, column: 9, scope: !880)
!883 = !DILocation(line: 1316, column: 7, scope: !880)
!884 = !DILocation(line: 1317, column: 14, scope: !880)
!885 = !DILocation(line: 1317, column: 40, scope: !880)
!886 = !DILocation(line: 1317, column: 41, scope: !880)
!887 = !DILocation(line: 1317, column: 3, scope: !880)
!888 = !DILocation(line: 1318, column: 46, scope: !880)
!889 = !DILocation(line: 1318, column: 51, scope: !880)
!890 = !DILocation(line: 1318, column: 3, scope: !880)
!891 = !DILocation(line: 1319, column: 10, scope: !880)
!892 = !DILocation(line: 1319, column: 3, scope: !880)
!893 = !DILocation(line: 1320, column: 2, scope: !880)
!894 = !DILocation(line: 1315, column: 38, scope: !895)
!895 = !DILexicalBlockFile(scope: !875, file: !347, discriminator: 2)
!896 = !DILocation(line: 1315, column: 2, scope: !895)
!897 = distinct !{!897, !898}
!898 = !DILocation(line: 1315, column: 2, scope: !540)
!899 = !DILocation(line: 1323, column: 2, scope: !540)
!900 = !DILocation(line: 1325, column: 9, scope: !540)
!901 = !DILocation(line: 1327, column: 2, scope: !540)
!902 = !DILocation(line: 1328, column: 2, scope: !540)
!903 = !DILocation(line: 1329, column: 2, scope: !540)
!904 = !DILocation(line: 1330, column: 2, scope: !540)
!905 = !DILocation(line: 1331, column: 1, scope: !540)
!906 = distinct !DISubprogram(name: "setup_changed", scope: !347, file: !347, line: 1127, type: !260, isLocal: true, isDefinition: true, scopeLine: 1128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!907 = !DILocation(line: 1129, column: 22, scope: !906)
!908 = !DILocation(line: 1129, column: 20, scope: !906)
!909 = !DILocation(line: 1131, column: 28, scope: !906)
!910 = !DILocation(line: 1131, column: 26, scope: !906)
!911 = !DILocation(line: 1132, column: 25, scope: !906)
!912 = !DILocation(line: 1132, column: 23, scope: !906)
!913 = !DILocation(line: 1133, column: 29, scope: !906)
!914 = !DILocation(line: 1133, column: 27, scope: !906)
!915 = !DILocation(line: 1135, column: 23, scope: !906)
!916 = !DILocation(line: 1135, column: 2, scope: !917)
!917 = !DILexicalBlockFile(scope: !906, file: !347, discriminator: 1)
!918 = !DILocation(line: 1137, column: 32, scope: !906)
!919 = !DILocation(line: 1137, column: 2, scope: !906)
!920 = !DILocation(line: 1138, column: 1, scope: !906)
!921 = distinct !DISubprogram(name: "key_combo", scope: !347, file: !347, line: 507, type: !260, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!922 = !DILocation(line: 509, column: 1, scope: !921)
!923 = distinct !DISubprogram(name: "key_paste_start", scope: !347, file: !347, line: 869, type: !260, isLocal: true, isDefinition: true, scopeLine: 870, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!924 = !DILocation(line: 871, column: 23, scope: !923)
!925 = !DILocation(line: 872, column: 1, scope: !923)
!926 = distinct !DISubprogram(name: "key_backward_character", scope: !347, file: !347, line: 576, type: !260, isLocal: true, isDefinition: true, scopeLine: 577, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!927 = !DILocation(line: 578, column: 21, scope: !926)
!928 = !DILocation(line: 578, column: 2, scope: !926)
!929 = !DILocation(line: 579, column: 1, scope: !926)
!930 = distinct !DISubprogram(name: "key_forward_character", scope: !347, file: !347, line: 581, type: !260, isLocal: true, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!931 = !DILocation(line: 583, column: 21, scope: !930)
!932 = !DILocation(line: 583, column: 2, scope: !930)
!933 = !DILocation(line: 584, column: 1, scope: !930)
!934 = distinct !DISubprogram(name: "key_backward_word", scope: !347, file: !347, line: 586, type: !260, isLocal: true, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!935 = !DILocation(line: 588, column: 23, scope: !934)
!936 = !DILocation(line: 588, column: 2, scope: !934)
!937 = !DILocation(line: 589, column: 1, scope: !934)
!938 = distinct !DISubprogram(name: "key_forward_word", scope: !347, file: !347, line: 591, type: !260, isLocal: true, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!939 = !DILocation(line: 593, column: 23, scope: !938)
!940 = !DILocation(line: 593, column: 2, scope: !938)
!941 = !DILocation(line: 594, column: 1, scope: !938)
!942 = distinct !DISubprogram(name: "key_backward_to_space", scope: !347, file: !347, line: 596, type: !260, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!943 = !DILocation(line: 598, column: 23, scope: !942)
!944 = !DILocation(line: 598, column: 2, scope: !942)
!945 = !DILocation(line: 599, column: 1, scope: !942)
!946 = distinct !DISubprogram(name: "key_forward_to_space", scope: !347, file: !347, line: 601, type: !260, isLocal: true, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!947 = !DILocation(line: 603, column: 23, scope: !946)
!948 = !DILocation(line: 603, column: 2, scope: !946)
!949 = !DILocation(line: 604, column: 1, scope: !946)
!950 = distinct !DISubprogram(name: "key_beginning_of_line", scope: !347, file: !347, line: 566, type: !260, isLocal: true, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!951 = !DILocation(line: 568, column: 27, scope: !950)
!952 = !DILocation(line: 568, column: 9, scope: !950)
!953 = !DILocation(line: 569, column: 1, scope: !950)
!954 = distinct !DISubprogram(name: "key_end_of_line", scope: !347, file: !347, line: 571, type: !260, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!955 = !DILocation(line: 573, column: 20, scope: !954)
!956 = !DILocation(line: 573, column: 34, scope: !954)
!957 = !DILocation(line: 573, column: 48, scope: !954)
!958 = !DILocation(line: 573, column: 2, scope: !954)
!959 = !DILocation(line: 574, column: 1, scope: !954)
!960 = distinct !DISubprogram(name: "key_backward_history", scope: !347, file: !347, line: 511, type: !260, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!961 = !DILocalVariable(name: "text", scope: !960, file: !347, line: 513, type: !351)
!962 = !DILocation(line: 513, column: 14, scope: !960)
!963 = !DILocalVariable(name: "line", scope: !960, file: !347, line: 514, type: !282)
!964 = !DILocation(line: 514, column: 15, scope: !960)
!965 = !DILocation(line: 516, column: 28, scope: !960)
!966 = !DILocation(line: 516, column: 9, scope: !960)
!967 = !DILocation(line: 516, column: 7, scope: !960)
!968 = !DILocation(line: 517, column: 30, scope: !960)
!969 = !DILocation(line: 517, column: 42, scope: !960)
!970 = !DILocation(line: 517, column: 9, scope: !960)
!971 = !DILocation(line: 517, column: 7, scope: !960)
!972 = !DILocation(line: 518, column: 21, scope: !960)
!973 = !DILocation(line: 518, column: 35, scope: !960)
!974 = !DILocation(line: 518, column: 2, scope: !960)
!975 = !DILocation(line: 519, column: 16, scope: !960)
!976 = !DILocation(line: 519, column: 9, scope: !960)
!977 = !DILocation(line: 520, column: 1, scope: !960)
!978 = distinct !DISubprogram(name: "key_forward_history", scope: !347, file: !347, line: 522, type: !260, isLocal: true, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!979 = !DILocalVariable(name: "text", scope: !978, file: !347, line: 524, type: !351)
!980 = !DILocation(line: 524, column: 14, scope: !978)
!981 = !DILocalVariable(name: "line", scope: !978, file: !347, line: 525, type: !282)
!982 = !DILocation(line: 525, column: 8, scope: !978)
!983 = !DILocation(line: 527, column: 28, scope: !978)
!984 = !DILocation(line: 527, column: 9, scope: !978)
!985 = !DILocation(line: 527, column: 7, scope: !978)
!986 = !DILocation(line: 528, column: 30, scope: !978)
!987 = !DILocation(line: 528, column: 42, scope: !978)
!988 = !DILocation(line: 528, column: 9, scope: !978)
!989 = !DILocation(line: 528, column: 7, scope: !978)
!990 = !DILocation(line: 529, column: 21, scope: !978)
!991 = !DILocation(line: 529, column: 35, scope: !978)
!992 = !DILocation(line: 529, column: 2, scope: !978)
!993 = !DILocation(line: 530, column: 16, scope: !978)
!994 = !DILocation(line: 530, column: 9, scope: !978)
!995 = !DILocation(line: 531, column: 1, scope: !978)
!996 = distinct !DISubprogram(name: "key_backward_global_history", scope: !347, file: !347, line: 533, type: !260, isLocal: true, isDefinition: true, scopeLine: 534, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!997 = !DILocalVariable(name: "text", scope: !996, file: !347, line: 535, type: !351)
!998 = !DILocation(line: 535, column: 14, scope: !996)
!999 = !DILocalVariable(name: "line", scope: !996, file: !347, line: 536, type: !282)
!1000 = !DILocation(line: 536, column: 8, scope: !996)
!1001 = !DILocation(line: 538, column: 28, scope: !996)
!1002 = !DILocation(line: 538, column: 9, scope: !996)
!1003 = !DILocation(line: 538, column: 7, scope: !996)
!1004 = !DILocation(line: 539, column: 37, scope: !996)
!1005 = !DILocation(line: 539, column: 49, scope: !996)
!1006 = !DILocation(line: 539, column: 9, scope: !996)
!1007 = !DILocation(line: 539, column: 7, scope: !996)
!1008 = !DILocation(line: 540, column: 21, scope: !996)
!1009 = !DILocation(line: 540, column: 35, scope: !996)
!1010 = !DILocation(line: 540, column: 2, scope: !996)
!1011 = !DILocation(line: 541, column: 9, scope: !996)
!1012 = !DILocation(line: 541, column: 2, scope: !996)
!1013 = !DILocation(line: 542, column: 1, scope: !996)
!1014 = distinct !DISubprogram(name: "key_forward_global_history", scope: !347, file: !347, line: 544, type: !260, isLocal: true, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1015 = !DILocalVariable(name: "text", scope: !1014, file: !347, line: 546, type: !351)
!1016 = !DILocation(line: 546, column: 14, scope: !1014)
!1017 = !DILocalVariable(name: "line", scope: !1014, file: !347, line: 547, type: !282)
!1018 = !DILocation(line: 547, column: 8, scope: !1014)
!1019 = !DILocation(line: 549, column: 28, scope: !1014)
!1020 = !DILocation(line: 549, column: 9, scope: !1014)
!1021 = !DILocation(line: 549, column: 7, scope: !1014)
!1022 = !DILocation(line: 550, column: 37, scope: !1014)
!1023 = !DILocation(line: 550, column: 49, scope: !1014)
!1024 = !DILocation(line: 550, column: 9, scope: !1014)
!1025 = !DILocation(line: 550, column: 7, scope: !1014)
!1026 = !DILocation(line: 551, column: 21, scope: !1014)
!1027 = !DILocation(line: 551, column: 35, scope: !1014)
!1028 = !DILocation(line: 551, column: 2, scope: !1014)
!1029 = !DILocation(line: 552, column: 9, scope: !1014)
!1030 = !DILocation(line: 552, column: 2, scope: !1014)
!1031 = !DILocation(line: 553, column: 1, scope: !1014)
!1032 = distinct !DISubprogram(name: "key_erase_history_entry", scope: !347, file: !347, line: 555, type: !260, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1033 = !DILocalVariable(name: "text", scope: !1032, file: !347, line: 557, type: !351)
!1034 = !DILocation(line: 557, column: 14, scope: !1032)
!1035 = !DILocalVariable(name: "line", scope: !1032, file: !347, line: 558, type: !282)
!1036 = !DILocation(line: 558, column: 8, scope: !1032)
!1037 = !DILocation(line: 560, column: 28, scope: !1032)
!1038 = !DILocation(line: 560, column: 9, scope: !1032)
!1039 = !DILocation(line: 560, column: 7, scope: !1032)
!1040 = !DILocation(line: 561, column: 40, scope: !1032)
!1041 = !DILocation(line: 561, column: 52, scope: !1032)
!1042 = !DILocation(line: 561, column: 9, scope: !1032)
!1043 = !DILocation(line: 561, column: 7, scope: !1032)
!1044 = !DILocation(line: 562, column: 21, scope: !1032)
!1045 = !DILocation(line: 562, column: 35, scope: !1032)
!1046 = !DILocation(line: 562, column: 2, scope: !1032)
!1047 = !DILocation(line: 563, column: 9, scope: !1032)
!1048 = !DILocation(line: 563, column: 2, scope: !1032)
!1049 = !DILocation(line: 564, column: 1, scope: !1032)
!1050 = distinct !DISubprogram(name: "key_backspace", scope: !347, file: !347, line: 696, type: !260, isLocal: true, isDefinition: true, scopeLine: 697, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1051 = !DILocation(line: 698, column: 18, scope: !1050)
!1052 = !DILocation(line: 698, column: 2, scope: !1050)
!1053 = !DILocation(line: 699, column: 1, scope: !1050)
!1054 = distinct !DISubprogram(name: "key_delete_character", scope: !347, file: !347, line: 689, type: !260, isLocal: true, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1055 = !DILocation(line: 691, column: 24, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1054, file: !347, line: 691, column: 6)
!1057 = !DILocation(line: 691, column: 6, scope: !1056)
!1058 = !DILocation(line: 691, column: 40, scope: !1056)
!1059 = !DILocation(line: 691, column: 54, scope: !1056)
!1060 = !DILocation(line: 691, column: 38, scope: !1056)
!1061 = !DILocation(line: 691, column: 6, scope: !1054)
!1062 = !DILocation(line: 692, column: 24, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1056, file: !347, line: 691, column: 64)
!1064 = !DILocation(line: 692, column: 3, scope: !1063)
!1065 = !DILocation(line: 693, column: 2, scope: !1063)
!1066 = !DILocation(line: 694, column: 1, scope: !1054)
!1067 = distinct !DISubprogram(name: "key_delete_next_word", scope: !347, file: !347, line: 706, type: !260, isLocal: true, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1068 = !DILocation(line: 708, column: 28, scope: !1067)
!1069 = !DILocation(line: 708, column: 2, scope: !1067)
!1070 = !DILocation(line: 709, column: 1, scope: !1067)
!1071 = distinct !DISubprogram(name: "key_delete_previous_word", scope: !347, file: !347, line: 701, type: !260, isLocal: true, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1072 = !DILocation(line: 703, column: 23, scope: !1071)
!1073 = !DILocation(line: 703, column: 2, scope: !1071)
!1074 = !DILocation(line: 704, column: 1, scope: !1071)
!1075 = distinct !DISubprogram(name: "key_delete_to_previous_space", scope: !347, file: !347, line: 711, type: !260, isLocal: true, isDefinition: true, scopeLine: 712, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1076 = !DILocation(line: 713, column: 23, scope: !1075)
!1077 = !DILocation(line: 713, column: 2, scope: !1075)
!1078 = !DILocation(line: 714, column: 1, scope: !1075)
!1079 = distinct !DISubprogram(name: "key_delete_to_next_space", scope: !347, file: !347, line: 716, type: !260, isLocal: true, isDefinition: true, scopeLine: 717, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1080 = !DILocation(line: 718, column: 28, scope: !1079)
!1081 = !DILocation(line: 718, column: 2, scope: !1079)
!1082 = !DILocation(line: 719, column: 1, scope: !1079)
!1083 = distinct !DISubprogram(name: "key_erase_line", scope: !347, file: !347, line: 606, type: !260, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1084 = !DILocation(line: 608, column: 20, scope: !1083)
!1085 = !DILocation(line: 608, column: 34, scope: !1083)
!1086 = !DILocation(line: 608, column: 48, scope: !1083)
!1087 = !DILocation(line: 608, column: 2, scope: !1083)
!1088 = !DILocation(line: 609, column: 18, scope: !1083)
!1089 = !DILocation(line: 609, column: 32, scope: !1083)
!1090 = !DILocation(line: 609, column: 46, scope: !1083)
!1091 = !DILocation(line: 609, column: 2, scope: !1083)
!1092 = !DILocation(line: 610, column: 1, scope: !1083)
!1093 = distinct !DISubprogram(name: "key_erase_to_beg_of_line", scope: !347, file: !347, line: 612, type: !260, isLocal: true, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1094 = !DILocalVariable(name: "pos", scope: !1093, file: !347, line: 614, type: !154)
!1095 = !DILocation(line: 614, column: 6, scope: !1093)
!1096 = !DILocation(line: 616, column: 26, scope: !1093)
!1097 = !DILocation(line: 616, column: 8, scope: !1093)
!1098 = !DILocation(line: 616, column: 6, scope: !1093)
!1099 = !DILocation(line: 617, column: 18, scope: !1093)
!1100 = !DILocation(line: 617, column: 32, scope: !1093)
!1101 = !DILocation(line: 617, column: 2, scope: !1093)
!1102 = !DILocation(line: 618, column: 1, scope: !1093)
!1103 = distinct !DISubprogram(name: "key_erase_to_end_of_line", scope: !347, file: !347, line: 620, type: !260, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1104 = !DILocalVariable(name: "pos", scope: !1103, file: !347, line: 622, type: !154)
!1105 = !DILocation(line: 622, column: 6, scope: !1103)
!1106 = !DILocation(line: 624, column: 26, scope: !1103)
!1107 = !DILocation(line: 624, column: 8, scope: !1103)
!1108 = !DILocation(line: 624, column: 6, scope: !1103)
!1109 = !DILocation(line: 625, column: 20, scope: !1103)
!1110 = !DILocation(line: 625, column: 34, scope: !1103)
!1111 = !DILocation(line: 625, column: 48, scope: !1103)
!1112 = !DILocation(line: 625, column: 2, scope: !1103)
!1113 = !DILocation(line: 626, column: 18, scope: !1103)
!1114 = !DILocation(line: 626, column: 32, scope: !1103)
!1115 = !DILocation(line: 626, column: 46, scope: !1103)
!1116 = !DILocation(line: 626, column: 57, scope: !1103)
!1117 = !DILocation(line: 626, column: 55, scope: !1103)
!1118 = !DILocation(line: 626, column: 2, scope: !1103)
!1119 = !DILocation(line: 627, column: 1, scope: !1103)
!1120 = distinct !DISubprogram(name: "key_yank_from_cutbuffer", scope: !347, file: !347, line: 629, type: !260, isLocal: true, isDefinition: true, scopeLine: 630, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1121 = !DILocalVariable(name: "cutbuffer", scope: !1120, file: !347, line: 631, type: !282)
!1122 = !DILocation(line: 631, column: 8, scope: !1120)
!1123 = !DILocation(line: 633, column: 45, scope: !1120)
!1124 = !DILocation(line: 633, column: 21, scope: !1120)
!1125 = !DILocation(line: 633, column: 19, scope: !1120)
!1126 = !DILocation(line: 634, column: 6, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1120, file: !347, line: 634, column: 6)
!1128 = !DILocation(line: 634, column: 16, scope: !1127)
!1129 = !DILocation(line: 634, column: 6, scope: !1120)
!1130 = !DILocation(line: 635, column: 25, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !347, line: 634, column: 24)
!1132 = !DILocation(line: 635, column: 39, scope: !1131)
!1133 = !DILocation(line: 635, column: 3, scope: !1131)
!1134 = !DILocation(line: 636, column: 3, scope: !1131)
!1135 = !DILocation(line: 636, column: 17, scope: !1131)
!1136 = !DILocation(line: 636, column: 31, scope: !1131)
!1137 = !DILocation(line: 637, column: 10, scope: !1131)
!1138 = !DILocation(line: 637, column: 3, scope: !1131)
!1139 = !DILocation(line: 638, column: 2, scope: !1131)
!1140 = !DILocation(line: 639, column: 1, scope: !1120)
!1141 = distinct !DISubprogram(name: "key_yank_next_cutbuffer", scope: !347, file: !347, line: 641, type: !260, isLocal: true, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1142 = !DILocalVariable(name: "rec", scope: !1141, file: !347, line: 643, type: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_ENTRY_CUTBUFFER_REC", file: !134, line: 7, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 4, size: 128, align: 64, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "cutbuffer_len", scope: !1145, file: !134, line: 5, baseType: !154, size: 32, align: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cutbuffer", scope: !1145, file: !134, line: 6, baseType: !341, size: 64, align: 64, offset: 64)
!1149 = !DILocation(line: 643, column: 27, scope: !1141)
!1150 = !DILocalVariable(name: "length", scope: !1141, file: !347, line: 644, type: !263)
!1151 = !DILocation(line: 644, column: 8, scope: !1141)
!1152 = !DILocalVariable(name: "cutbuffer", scope: !1141, file: !347, line: 645, type: !282)
!1153 = !DILocation(line: 645, column: 8, scope: !1141)
!1154 = !DILocation(line: 647, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1141, file: !347, line: 647, column: 6)
!1156 = !DILocation(line: 647, column: 6, scope: !1141)
!1157 = !DILocation(line: 648, column: 3, scope: !1155)
!1158 = !DILocation(line: 650, column: 6, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1141, file: !347, line: 650, column: 6)
!1160 = !DILocation(line: 650, column: 20, scope: !1159)
!1161 = !DILocation(line: 650, column: 30, scope: !1159)
!1162 = !DILocation(line: 650, column: 6, scope: !1141)
!1163 = !DILocation(line: 651, column: 3, scope: !1159)
!1164 = !DILocation(line: 653, column: 8, scope: !1141)
!1165 = !DILocation(line: 653, column: 22, scope: !1141)
!1166 = !DILocation(line: 653, column: 33, scope: !1141)
!1167 = !DILocation(line: 653, column: 6, scope: !1141)
!1168 = !DILocation(line: 654, column: 6, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1141, file: !347, line: 654, column: 6)
!1170 = !DILocation(line: 654, column: 10, scope: !1169)
!1171 = !DILocation(line: 654, column: 6, scope: !1141)
!1172 = !DILocation(line: 654, column: 27, scope: !1173)
!1173 = !DILexicalBlockFile(scope: !1169, file: !347, discriminator: 1)
!1174 = !DILocation(line: 654, column: 32, scope: !1173)
!1175 = !DILocation(line: 654, column: 25, scope: !1173)
!1176 = !DILocation(line: 654, column: 18, scope: !1173)
!1177 = !DILocation(line: 656, column: 43, scope: !1141)
!1178 = !DILocation(line: 656, column: 14, scope: !1141)
!1179 = !DILocation(line: 656, column: 12, scope: !1141)
!1180 = !DILocation(line: 657, column: 6, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1141, file: !347, line: 657, column: 6)
!1182 = !DILocation(line: 657, column: 16, scope: !1181)
!1183 = !DILocation(line: 657, column: 6, scope: !1141)
!1184 = !DILocation(line: 658, column: 19, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !347, line: 657, column: 24)
!1186 = !DILocation(line: 658, column: 33, scope: !1185)
!1187 = !DILocation(line: 658, column: 3, scope: !1185)
!1188 = !DILocation(line: 659, column: 25, scope: !1185)
!1189 = !DILocation(line: 659, column: 39, scope: !1185)
!1190 = !DILocation(line: 659, column: 3, scope: !1185)
!1191 = !DILocation(line: 660, column: 3, scope: !1185)
!1192 = !DILocation(line: 660, column: 17, scope: !1185)
!1193 = !DILocation(line: 660, column: 31, scope: !1185)
!1194 = !DILocation(line: 661, column: 10, scope: !1185)
!1195 = !DILocation(line: 661, column: 3, scope: !1185)
!1196 = !DILocation(line: 662, column: 2, scope: !1185)
!1197 = !DILocation(line: 663, column: 1, scope: !1141)
!1198 = distinct !DISubprogram(name: "key_append_next_kill", scope: !347, file: !347, line: 721, type: !260, isLocal: true, isDefinition: true, scopeLine: 722, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1199 = !DILocation(line: 723, column: 2, scope: !1198)
!1200 = !DILocation(line: 723, column: 16, scope: !1198)
!1201 = !DILocation(line: 723, column: 33, scope: !1198)
!1202 = !DILocation(line: 724, column: 1, scope: !1198)
!1203 = distinct !DISubprogram(name: "key_transpose_characters", scope: !347, file: !347, line: 665, type: !260, isLocal: true, isDefinition: true, scopeLine: 666, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1204 = !DILocation(line: 667, column: 28, scope: !1203)
!1205 = !DILocation(line: 667, column: 2, scope: !1203)
!1206 = !DILocation(line: 668, column: 1, scope: !1203)
!1207 = distinct !DISubprogram(name: "key_transpose_words", scope: !347, file: !347, line: 670, type: !260, isLocal: true, isDefinition: true, scopeLine: 671, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1208 = !DILocation(line: 672, column: 28, scope: !1207)
!1209 = !DILocation(line: 672, column: 2, scope: !1207)
!1210 = !DILocation(line: 673, column: 1, scope: !1207)
!1211 = distinct !DISubprogram(name: "key_capitalize_word", scope: !347, file: !347, line: 675, type: !260, isLocal: true, isDefinition: true, scopeLine: 676, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1212 = !DILocation(line: 677, column: 28, scope: !1211)
!1213 = !DILocation(line: 677, column: 2, scope: !1211)
!1214 = !DILocation(line: 678, column: 1, scope: !1211)
!1215 = distinct !DISubprogram(name: "key_downcase_word", scope: !347, file: !347, line: 680, type: !260, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1216 = !DILocation(line: 682, column: 26, scope: !1215)
!1217 = !DILocation(line: 682, column: 2, scope: !1215)
!1218 = !DILocation(line: 683, column: 1, scope: !1215)
!1219 = distinct !DISubprogram(name: "key_upcase_word", scope: !347, file: !347, line: 684, type: !260, isLocal: true, isDefinition: true, scopeLine: 685, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1220 = !DILocation(line: 686, column: 24, scope: !1219)
!1221 = !DILocation(line: 686, column: 2, scope: !1219)
!1222 = !DILocation(line: 687, column: 1, scope: !1219)
!1223 = distinct !DISubprogram(name: "key_send_line", scope: !347, file: !347, line: 472, type: !260, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !541)
!1224 = !DILocalVariable(name: "history", scope: !1223, file: !347, line: 474, type: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !1227, line: 14, baseType: !1228)
!1227 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1227, line: 6, size: 256, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1240, !1241, !1242}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1228, file: !1227, line: 7, baseType: !282, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1228, file: !1227, line: 9, baseType: !1232, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1234, line: 37, baseType: !1235)
!1234 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1234, line: 39, size: 192, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !1234, line: 41, baseType: !211, size: 64, align: 64)
