; ModuleID = './line274-fe-dcc.o.i'
source_filename = "./line274-fe-dcc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._FORMAT_REC = type { i8*, i8*, i32, [10 x i32] }
%struct._GSList = type { i8*, %struct._GSList* }
%struct.FILE_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i64, i64, i32, i32, [4 x i8], i32 }
%struct._IRC_SERVER_REC = type opaque
%struct.CHAT_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i8*, %struct._NET_SENDBUF_REC*, i8 }
%struct._NET_SENDBUF_REC = type opaque
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!98 = !DIEnumerator(name: "IRCTXT_DCC_GET_ABORTED", value: 29)
!99 = !DIEnumerator(name: "IRCTXT_DCC_GET_WRITE_ERROR", value: 30)
!100 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_CTCP", value: 31)
!101 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_REPLY", value: 32)
!102 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_TYPE", value: 33)
!103 = !DIEnumerator(name: "IRCTXT_DCC_INVALID_CTCP", value: 34)
!104 = !DIEnumerator(name: "IRCTXT_DCC_CONNECT_ERROR", value: 35)
!105 = !DIEnumerator(name: "IRCTXT_DCC_CANT_CREATE", value: 36)
!106 = !DIEnumerator(name: "IRCTXT_DCC_REJECTED", value: 37)
!107 = !DIEnumerator(name: "IRCTXT_DCC_REQUEST_SEND", value: 38)
!108 = !DIEnumerator(name: "IRCTXT_DCC_CLOSE", value: 39)
!109 = !DIEnumerator(name: "IRCTXT_DCC_LOWPORT", value: 40)
!110 = !DIEnumerator(name: "IRCTXT_DCC_LIST_HEADER", value: 41)
!111 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_CHAT", value: 42)
!112 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_FILE", value: 43)
!113 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_QUEUED_SEND", value: 44)
!114 = !DIEnumerator(name: "IRCTXT_DCC_LIST_FOOTER", value: 45)
!115 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_SERVER", value: 46)
!116 = !DIEnumerator(name: "IRCTXT_DCC_SERVER_STARTED", value: 47)
!117 = !DIEnumerator(name: "IRCTXT_DCC_SERVER_CLOSED", value: 48)
!118 = !{!119, !120, !121, !122, !129, !133}
!119 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!121 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !123, line: 9, baseType: !124)
!123 = !DIFile(filename: "../../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !127, !127, !127, !127, !127, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !131, line: 46, baseType: !132)
!131 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!132 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!135 = !{i32 2, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!138 = distinct !DISubprogram(name: "dcc_get_size_str", scope: !139, file: !139, line: 49, type: !140, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!139 = !DIFile(filename: "fe-dcc.c", directory: "/home/lichi/Desktop/irssi/task1")
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !144, line: 49, baseType: !145)
!144 = !DIFile(filename: "../../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!145 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!146 = !{}
!147 = !DILocalVariable(name: "size", arg: 1, scope: !138, file: !139, line: 49, type: !143)
!148 = !DIExpression()
!149 = !DILocation(line: 49, column: 31, scope: !138)
!150 = !DILocation(line: 51, column: 6, scope: !151)
!151 = distinct !DILexicalBlock(scope: !138, file: !139, line: 51, column: 6)
!152 = !DILocation(line: 51, column: 11, scope: !151)
!153 = !DILocation(line: 51, column: 6, scope: !138)
!154 = !DILocation(line: 52, column: 38, scope: !151)
!155 = !DILocation(line: 52, column: 10, scope: !151)
!156 = !DILocation(line: 52, column: 3, scope: !151)
!157 = !DILocation(line: 53, column: 6, scope: !158)
!158 = distinct !DILexicalBlock(scope: !138, file: !139, line: 53, column: 6)
!159 = !DILocation(line: 53, column: 11, scope: !158)
!160 = !DILocation(line: 53, column: 6, scope: !138)
!161 = !DILocation(line: 54, column: 40, scope: !158)
!162 = !DILocation(line: 54, column: 44, scope: !158)
!163 = !DILocation(line: 54, column: 51, scope: !158)
!164 = !DILocation(line: 54, column: 10, scope: !158)
!165 = !DILocation(line: 54, column: 3, scope: !158)
!166 = !DILocation(line: 55, column: 38, scope: !138)
!167 = !DILocation(line: 55, column: 43, scope: !138)
!168 = !DILocation(line: 55, column: 9, scope: !138)
!169 = !DILocation(line: 55, column: 2, scope: !138)
!170 = !DILocation(line: 56, column: 1, scope: !138)
!171 = distinct !DISubprogram(name: "dcc_list_print_file", scope: !139, file: !139, line: 105, type: !172, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_DCC_REC", file: !176, line: 8, baseType: !177)
!176 = !DIFile(filename: "../../../../src/irc/dcc/dcc-file.h", directory: "/home/lichi/Desktop/irssi/task1")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 6, size: 1856, align: 64, elements: !178)
!178 = !{!179, !181, !182, !188, !193, !194, !195, !196, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !469}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !180, line: 1, baseType: !119, size: 32, align: 32)
!180 = !DIFile(filename: "../../../../src/irc/dcc/dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!181 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !177, file: !180, line: 2, baseType: !119, size: 32, align: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !177, file: !180, line: 3, baseType: !183, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !184, line: 75, baseType: !185)
!184 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !186, line: 139, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!187 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !177, file: !180, line: 5, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !191, line: 6, baseType: !192)
!191 = !DIFile(filename: "../../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !191, line: 6, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !177, file: !180, line: 6, baseType: !142, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !177, file: !180, line: 7, baseType: !142, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !177, file: !180, line: 8, baseType: !142, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !177, file: !180, line: 10, baseType: !197, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !199, line: 9, baseType: !200)
!199 = !DIFile(filename: "../../../../src/irc/dcc/dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !201, line: 12, size: 1792, align: 64, elements: !202)
!201 = !DIFile(filename: "../../../../src/irc/dcc/dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !245, !249, !250, !429, !430, !431, !432, !433, !434, !435, !436, !441, !442, !446, !447}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !180, line: 1, baseType: !119, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !200, file: !180, line: 2, baseType: !119, size: 32, align: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !200, file: !180, line: 3, baseType: !183, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !200, file: !180, line: 5, baseType: !189, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !200, file: !180, line: 6, baseType: !142, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !200, file: !180, line: 7, baseType: !142, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !200, file: !180, line: 8, baseType: !142, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !200, file: !180, line: 10, baseType: !197, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !200, file: !180, line: 11, baseType: !142, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !200, file: !180, line: 12, baseType: !142, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !200, file: !180, line: 14, baseType: !214, size: 160, align: 32, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !144, line: 99, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !216, line: 22, size: 160, align: 32, elements: !217)
!216 = !DIFile(filename: "../../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!217 = !{!218, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !215, file: !216, line: 23, baseType: !219, size: 16, align: 16)
!219 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !215, file: !216, line: 24, baseType: !221, size: 128, align: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !222, line: 211, size: 128, align: 32, elements: !223)
!222 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !221, file: !222, line: 220, baseType: !225, size: 128, align: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !221, file: !222, line: 213, size: 128, align: 32, elements: !226)
!226 = !{!227, !234, !239}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !225, file: !222, line: 215, baseType: !228, size: 128, align: 8)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, align: 8, elements: !232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !230, line: 48, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!231 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!232 = !{!233}
!233 = !DISubrange(count: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !225, file: !222, line: 217, baseType: !235, size: 128, align: 16)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 128, align: 16, elements: !237)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !230, line: 49, baseType: !219)
!237 = !{!238}
!238 = !DISubrange(count: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !225, file: !222, line: 218, baseType: !240, size: 128, align: 32)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, align: 32, elements: !243)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !230, line: 51, baseType: !242)
!242 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !200, file: !180, line: 15, baseType: !246, size: 368, align: 8, offset: 736)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 368, align: 8, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 46)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !200, file: !180, line: 16, baseType: !119, size: 32, align: 32, offset: 1120)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !200, file: !180, line: 18, baseType: !251, size: 64, align: 64, offset: 1152)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !254)
!254 = !{!255, !257, !396, !397, !402, !403, !404, !405, !406, !415, !416, !417, !421, !422, !423, !424, !425, !426, !427, !428}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !253, file: !4, line: 100, baseType: !256, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !131, line: 49, baseType: !119)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !253, file: !4, line: 101, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !261)
!261 = !{!262, !282, !288, !294, !298, !383, !387, !392}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !260, file: !4, line: 133, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, !251, !129, !267, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !268, line: 66, baseType: !145)
!268 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !273, line: 42, baseType: !274)
!273 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !273, line: 44, size: 128, align: 64, elements: !275)
!275 = !{!276, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !274, file: !273, line: 46, baseType: !277, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !278, line: 36, baseType: !279)
!278 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !268, line: 45, baseType: !242)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !274, file: !273, line: 47, baseType: !256, size: 32, align: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !274, file: !273, line: 48, baseType: !129, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !260, file: !4, line: 138, baseType: !283, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!266, !251, !286, !267, !269, !270}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !260, file: !4, line: 143, baseType: !289, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!266, !251, !292, !293, !270}
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !268, line: 51, baseType: !187)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !260, file: !4, line: 147, baseType: !295, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!266, !251, !270}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !260, file: !4, line: 149, baseType: !299, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !251, !382}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !305)
!305 = !{!306, !308, !329, !358, !360, !364, !365, !366, !367, !375, !376, !377, !378}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !304, file: !16, line: 174, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !131, line: 77, baseType: !120)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !304, file: !16, line: 175, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !312)
!312 = !{!313, !317, !318}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !311, file: !16, line: 198, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !307}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !311, file: !16, line: 199, baseType: !314, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !311, file: !16, line: 200, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !307, !302, !322, !328}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !307}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !131, line: 50, baseType: !256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !304, file: !16, line: 177, baseType: !330, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !334)
!334 = !{!335, !340, !344, !348, !352, !353}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !333, file: !16, line: 216, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!327, !302, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !333, file: !16, line: 218, baseType: !341, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!327, !302}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !333, file: !16, line: 219, baseType: !345, size: 64, align: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!327, !302, !323, !307}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !333, file: !16, line: 222, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !302}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !333, file: !16, line: 226, baseType: !323, size: 64, align: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !333, file: !16, line: 227, baseType: !354, size: 64, align: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !304, file: !16, line: 178, baseType: !359, size: 32, align: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !131, line: 55, baseType: !242)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !304, file: !16, line: 180, baseType: !361, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !363)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !304, file: !16, line: 182, baseType: !256, size: 32, align: 32, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !16, line: 183, baseType: !359, size: 32, align: 32, offset: 352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !304, file: !16, line: 184, baseType: !359, size: 32, align: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !304, file: !16, line: 186, baseType: !368, size: 64, align: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !370, line: 37, baseType: !371)
!370 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !370, line: 39, size: 128, align: 64, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !371, file: !370, line: 41, baseType: !307, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !370, line: 42, baseType: !368, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !16, line: 188, baseType: !302, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !16, line: 189, baseType: !302, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !16, line: 191, baseType: !142, size: 64, align: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !304, file: !16, line: 193, baseType: !379, size: 64, align: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !260, file: !4, line: 151, baseType: !384, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !251}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !260, file: !4, line: 152, baseType: !388, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!266, !251, !391, !270}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !260, file: !4, line: 155, baseType: !393, size: 64, align: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!391, !251}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !253, file: !4, line: 103, baseType: !129, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !253, file: !4, line: 104, baseType: !398, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !399, line: 77, baseType: !400)
!399 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !399, line: 77, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !253, file: !4, line: 105, baseType: !398, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !253, file: !4, line: 106, baseType: !129, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !253, file: !4, line: 107, baseType: !359, size: 32, align: 32, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !253, file: !4, line: 109, baseType: !267, size: 64, align: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !253, file: !4, line: 110, baseType: !407, size: 64, align: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !409, line: 39, baseType: !410)
!409 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !409, line: 41, size: 192, align: 64, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !410, file: !409, line: 43, baseType: !129, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !410, file: !409, line: 44, baseType: !267, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !410, file: !409, line: 45, baseType: !267, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !253, file: !4, line: 111, baseType: !407, size: 64, align: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !253, file: !4, line: 112, baseType: !407, size: 64, align: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !253, file: !4, line: 113, baseType: !418, size: 48, align: 8, offset: 704)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, align: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 6)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !253, file: !4, line: 117, baseType: !359, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !253, file: !4, line: 118, baseType: !359, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !253, file: !4, line: 119, baseType: !359, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !253, file: !4, line: 120, baseType: !359, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !253, file: !4, line: 121, baseType: !359, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !253, file: !4, line: 122, baseType: !359, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !253, file: !4, line: 124, baseType: !307, size: 64, align: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !253, file: !4, line: 125, baseType: !307, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !200, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1216)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !200, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1248)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !200, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !200, file: !180, line: 20, baseType: !183, size: 64, align: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !200, file: !180, line: 21, baseType: !143, size: 64, align: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !200, file: !180, line: 23, baseType: !119, size: 32, align: 32, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !200, file: !180, line: 25, baseType: !242, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !200, file: !180, line: 27, baseType: !437, size: 64, align: 64, offset: 1536)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !439, line: 37, baseType: !440)
!439 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !439, line: 37, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !201, line: 15, baseType: !142, size: 64, align: 64, offset: 1600)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !200, file: !201, line: 16, baseType: !443, size: 64, align: 64, offset: 1664)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !144, line: 102, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !144, line: 102, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !200, file: !201, line: 18, baseType: !242, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !200, file: !201, line: 19, baseType: !242, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !177, file: !180, line: 11, baseType: !142, size: 64, align: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !177, file: !180, line: 12, baseType: !142, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !177, file: !180, line: 14, baseType: !214, size: 160, align: 32, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !177, file: !180, line: 15, baseType: !246, size: 368, align: 8, offset: 736)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !177, file: !180, line: 16, baseType: !119, size: 32, align: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !177, file: !180, line: 18, baseType: !251, size: 64, align: 64, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !177, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1216)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !177, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1248)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !177, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !177, file: !180, line: 20, baseType: !183, size: 64, align: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !177, file: !180, line: 21, baseType: !143, size: 64, align: 64, offset: 1408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !177, file: !180, line: 23, baseType: !119, size: 32, align: 32, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !177, file: !180, line: 25, baseType: !242, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !177, file: !180, line: 27, baseType: !437, size: 64, align: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !463, line: 3, baseType: !143, size: 64, align: 64, offset: 1600)
!463 = !DIFile(filename: "../../../../src/irc/dcc/dcc-file-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !177, file: !463, line: 3, baseType: !143, size: 64, align: 64, offset: 1664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !177, file: !463, line: 4, baseType: !119, size: 32, align: 32, offset: 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !177, file: !463, line: 5, baseType: !119, size: 32, align: 32, offset: 1760)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !177, file: !463, line: 8, baseType: !468, size: 32, align: 8, offset: 1792)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, align: 8, elements: !243)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !177, file: !463, line: 9, baseType: !119, size: 32, align: 32, offset: 1824)
!470 = !DILocalVariable(name: "dcc", arg: 1, scope: !171, file: !139, line: 105, type: !174)
!471 = !DILocation(line: 105, column: 40, scope: !171)
!472 = !DILocalVariable(name: "going", scope: !171, file: !139, line: 107, type: !183)
!473 = !DILocation(line: 107, column: 9, scope: !171)
!474 = !DILocalVariable(name: "eta", scope: !171, file: !139, line: 107, type: !183)
!475 = !DILocation(line: 107, column: 16, scope: !171)
!476 = !DILocalVariable(name: "transfd_str", scope: !171, file: !139, line: 108, type: !142)
!477 = !DILocation(line: 108, column: 8, scope: !171)
!478 = !DILocalVariable(name: "size_str", scope: !171, file: !139, line: 108, type: !142)
!479 = !DILocation(line: 108, column: 22, scope: !171)
!480 = !DILocalVariable(name: "etastr", scope: !171, file: !139, line: 108, type: !481)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 160, align: 8, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 20)
!484 = !DILocation(line: 108, column: 32, scope: !171)
!485 = !DILocalVariable(name: "bps", scope: !171, file: !139, line: 109, type: !143)
!486 = !DILocation(line: 109, column: 9, scope: !171)
!487 = !DILocation(line: 111, column: 10, scope: !171)
!488 = !DILocation(line: 111, column: 22, scope: !171)
!489 = !DILocation(line: 111, column: 27, scope: !171)
!490 = !DILocation(line: 111, column: 20, scope: !171)
!491 = !DILocation(line: 111, column: 8, scope: !171)
!492 = !DILocation(line: 112, column: 6, scope: !493)
!493 = distinct !DILexicalBlock(scope: !171, file: !139, line: 112, column: 6)
!494 = !DILocation(line: 112, column: 12, scope: !493)
!495 = !DILocation(line: 112, column: 6, scope: !171)
!496 = !DILocation(line: 112, column: 24, scope: !497)
!497 = !DILexicalBlockFile(scope: !493, file: !139, discriminator: 1)
!498 = !DILocation(line: 112, column: 18, scope: !497)
!499 = !DILocation(line: 114, column: 33, scope: !171)
!500 = !DILocation(line: 114, column: 38, scope: !171)
!501 = !DILocation(line: 114, column: 16, scope: !171)
!502 = !DILocation(line: 114, column: 14, scope: !171)
!503 = !DILocation(line: 115, column: 30, scope: !171)
!504 = !DILocation(line: 115, column: 35, scope: !171)
!505 = !DILocation(line: 115, column: 13, scope: !171)
!506 = !DILocation(line: 115, column: 11, scope: !171)
!507 = !DILocation(line: 117, column: 9, scope: !171)
!508 = !DILocation(line: 117, column: 14, scope: !171)
!509 = !DILocation(line: 117, column: 22, scope: !171)
!510 = !DILocation(line: 117, column: 27, scope: !171)
!511 = !DILocation(line: 117, column: 21, scope: !171)
!512 = !DILocation(line: 117, column: 38, scope: !171)
!513 = !DILocation(line: 117, column: 36, scope: !171)
!514 = !DILocation(line: 117, column: 6, scope: !171)
!515 = !DILocation(line: 118, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !171, file: !139, line: 118, column: 6)
!517 = !DILocation(line: 118, column: 10, scope: !516)
!518 = !DILocation(line: 118, column: 6, scope: !171)
!519 = !DILocation(line: 119, column: 10, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !139, line: 118, column: 16)
!521 = !DILocation(line: 119, column: 3, scope: !520)
!522 = !DILocation(line: 120, column: 2, scope: !520)
!523 = !DILocation(line: 121, column: 10, scope: !524)
!524 = distinct !DILexicalBlock(scope: !516, file: !139, line: 120, column: 9)
!525 = !DILocation(line: 121, column: 15, scope: !524)
!526 = !DILocation(line: 121, column: 22, scope: !524)
!527 = !DILocation(line: 121, column: 27, scope: !524)
!528 = !DILocation(line: 121, column: 20, scope: !524)
!529 = !DILocation(line: 121, column: 38, scope: !524)
!530 = !DILocation(line: 121, column: 36, scope: !524)
!531 = !DILocation(line: 121, column: 7, scope: !524)
!532 = !DILocation(line: 122, column: 14, scope: !524)
!533 = !DILocation(line: 123, column: 13, scope: !524)
!534 = !DILocation(line: 123, column: 16, scope: !524)
!535 = !DILocation(line: 123, column: 7, scope: !524)
!536 = !DILocation(line: 123, column: 31, scope: !524)
!537 = !DILocation(line: 123, column: 34, scope: !524)
!538 = !DILocation(line: 123, column: 38, scope: !524)
!539 = !DILocation(line: 123, column: 24, scope: !524)
!540 = !DILocation(line: 123, column: 50, scope: !524)
!541 = !DILocation(line: 123, column: 53, scope: !524)
!542 = !DILocation(line: 123, column: 44, scope: !524)
!543 = !DILocation(line: 122, column: 3, scope: !524)
!544 = !DILocation(line: 126, column: 44, scope: !171)
!545 = !DILocation(line: 126, column: 49, scope: !171)
!546 = !DILocation(line: 126, column: 82, scope: !171)
!547 = !DILocation(line: 126, column: 87, scope: !171)
!548 = !DILocation(line: 126, column: 56, scope: !171)
!549 = !DILocation(line: 126, column: 95, scope: !171)
!550 = !DILocation(line: 126, column: 108, scope: !171)
!551 = !DILocation(line: 126, column: 118, scope: !171)
!552 = !DILocation(line: 126, column: 123, scope: !171)
!553 = !DILocation(line: 126, column: 128, scope: !171)
!554 = !DILocation(line: 126, column: 118, scope: !555)
!555 = !DILexicalBlockFile(scope: !171, file: !139, discriminator: 1)
!556 = !DILocation(line: 126, column: 153, scope: !557)
!557 = !DILexicalBlockFile(scope: !171, file: !139, discriminator: 2)
!558 = !DILocation(line: 126, column: 158, scope: !557)
!559 = !DILocation(line: 126, column: 145, scope: !557)
!560 = !DILocation(line: 126, column: 174, scope: !557)
!561 = !DILocation(line: 126, column: 179, scope: !557)
!562 = !DILocation(line: 126, column: 166, scope: !557)
!563 = !DILocation(line: 126, column: 165, scope: !557)
!564 = !DILocation(line: 126, column: 183, scope: !557)
!565 = !DILocation(line: 126, column: 139, scope: !557)
!566 = !DILocation(line: 126, column: 118, scope: !557)
!567 = !DILocation(line: 126, column: 118, scope: !568)
!568 = !DILexicalBlockFile(scope: !171, file: !139, discriminator: 3)
!569 = !DILocation(line: 126, column: 200, scope: !568)
!570 = !DILocation(line: 126, column: 192, scope: !568)
!571 = !DILocation(line: 126, column: 203, scope: !568)
!572 = !DILocation(line: 126, column: 212, scope: !568)
!573 = !DILocation(line: 126, column: 217, scope: !568)
!574 = !DILocation(line: 126, column: 222, scope: !568)
!575 = !DILocation(line: 126, column: 2, scope: !568)
!576 = !DILocation(line: 133, column: 9, scope: !171)
!577 = !DILocation(line: 133, column: 2, scope: !171)
!578 = !DILocation(line: 134, column: 9, scope: !171)
!579 = !DILocation(line: 134, column: 2, scope: !171)
!580 = !DILocation(line: 135, column: 1, scope: !171)
!581 = distinct !DISubprogram(name: "fe_irc_dcc_init", scope: !139, file: !139, line: 157, type: !356, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!582 = !DILocation(line: 159, column: 2, scope: !581)
!583 = !DILocation(line: 160, column: 2, scope: !581)
!584 = !DILocation(line: 161, column: 2, scope: !581)
!585 = !DILocation(line: 162, column: 2, scope: !581)
!586 = !DILocation(line: 164, column: 2, scope: !581)
!587 = !DILocation(line: 165, column: 2, scope: !581)
!588 = !DILocation(line: 166, column: 2, scope: !581)
!589 = !DILocation(line: 167, column: 2, scope: !581)
!590 = !DILocation(line: 168, column: 2, scope: !581)
!591 = !DILocation(line: 169, column: 2, scope: !581)
!592 = !DILocation(line: 170, column: 2, scope: !581)
!593 = !DILocation(line: 172, column: 2, scope: !581)
!594 = !DILocation(line: 173, column: 2, scope: !581)
!595 = !DILocation(line: 174, column: 2, scope: !581)
!596 = !DILocation(line: 175, column: 1, scope: !581)
!597 = distinct !DISubprogram(name: "dcc_request", scope: !139, file: !139, line: 58, type: !598, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !199, line: 13, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 11, size: 1600, align: 64, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !180, line: 1, baseType: !119, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !602, file: !180, line: 2, baseType: !119, size: 32, align: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !602, file: !180, line: 3, baseType: !183, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !602, file: !180, line: 5, baseType: !189, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !602, file: !180, line: 6, baseType: !142, size: 64, align: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !602, file: !180, line: 7, baseType: !142, size: 64, align: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !602, file: !180, line: 8, baseType: !142, size: 64, align: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !602, file: !180, line: 10, baseType: !197, size: 64, align: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !602, file: !180, line: 11, baseType: !142, size: 64, align: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !602, file: !180, line: 12, baseType: !142, size: 64, align: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !602, file: !180, line: 14, baseType: !214, size: 160, align: 32, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !602, file: !180, line: 15, baseType: !246, size: 368, align: 8, offset: 736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !602, file: !180, line: 16, baseType: !119, size: 32, align: 32, offset: 1120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !602, file: !180, line: 18, baseType: !251, size: 64, align: 64, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !602, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !602, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1248)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !602, file: !180, line: 19, baseType: !119, size: 32, align: 32, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !602, file: !180, line: 20, baseType: !183, size: 64, align: 64, offset: 1344)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !602, file: !180, line: 21, baseType: !143, size: 64, align: 64, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !602, file: !180, line: 23, baseType: !119, size: 32, align: 32, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !602, file: !180, line: 25, baseType: !242, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !602, file: !180, line: 27, baseType: !437, size: 64, align: 64, offset: 1536)
!626 = !DILocalVariable(name: "dcc", arg: 1, scope: !597, file: !139, line: 58, type: !600)
!627 = !DILocation(line: 58, column: 34, scope: !597)
!628 = !DILocalVariable(name: "service", scope: !597, file: !139, line: 60, type: !142)
!629 = !DILocation(line: 60, column: 8, scope: !597)
!630 = !DILocation(line: 62, column: 2, scope: !597)
!631 = distinct !{!631, !630}
!632 = !DILocation(line: 62, column: 10, scope: !633)
!633 = !DILexicalBlockFile(scope: !634, file: !139, discriminator: 1)
!634 = distinct !DILexicalBlock(scope: !635, file: !139, line: 62, column: 10)
!635 = distinct !DILexicalBlock(scope: !597, file: !139, line: 62, column: 4)
!636 = !DILocation(line: 62, column: 14, scope: !633)
!637 = !DILocation(line: 62, column: 5, scope: !638)
!638 = !DILexicalBlockFile(scope: !639, file: !139, discriminator: 2)
!639 = distinct !DILexicalBlock(scope: !634, file: !139, line: 62, column: 3)
!640 = !DILocation(line: 62, column: 14, scope: !641)
!641 = !DILexicalBlockFile(scope: !642, file: !139, discriminator: 3)
!642 = distinct !DILexicalBlock(scope: !634, file: !139, line: 62, column: 12)
!643 = !DILocation(line: 62, column: 98, scope: !641)
!644 = !DILocation(line: 62, column: 109, scope: !645)
!645 = !DILexicalBlockFile(scope: !635, file: !139, discriminator: 4)
!646 = !DILocation(line: 64, column: 6, scope: !647)
!647 = distinct !DILexicalBlock(scope: !597, file: !139, line: 64, column: 6)
!648 = !DILocation(line: 64, column: 11, scope: !647)
!649 = !DILocation(line: 64, column: 16, scope: !647)
!650 = !DILocation(line: 64, column: 6, scope: !597)
!651 = !DILocation(line: 66, column: 31, scope: !652)
!652 = distinct !DILexicalBlock(scope: !647, file: !139, line: 64, column: 24)
!653 = !DILocation(line: 66, column: 36, scope: !652)
!654 = !DILocation(line: 66, column: 13, scope: !652)
!655 = !DILocation(line: 66, column: 11, scope: !652)
!656 = !DILocation(line: 68, column: 43, scope: !652)
!657 = !DILocation(line: 68, column: 48, scope: !652)
!658 = !DILocation(line: 68, column: 38, scope: !652)
!659 = !DILocation(line: 68, column: 49, scope: !652)
!660 = !DILocation(line: 68, column: 57, scope: !652)
!661 = !DILocation(line: 68, column: 4, scope: !662)
!662 = !DILexicalBlockFile(scope: !652, file: !139, discriminator: 1)
!663 = !DILocation(line: 68, column: 49, scope: !662)
!664 = !DILocation(line: 68, column: 49, scope: !665)
!665 = !DILexicalBlockFile(scope: !652, file: !139, discriminator: 2)
!666 = !DILocation(line: 68, column: 49, scope: !667)
!667 = !DILexicalBlockFile(scope: !652, file: !139, discriminator: 3)
!668 = !DILocation(line: 68, column: 3, scope: !667)
!669 = !DILocation(line: 71, column: 2, scope: !652)
!670 = !DILocation(line: 72, column: 1, scope: !597)
!671 = distinct !DISubprogram(name: "dcc_rejected", scope: !139, file: !139, line: 74, type: !598, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !146)
!672 = !DILocalVariable(name: "dcc", arg: 1, scope: !671, file: !139, line: 74, type: !600)
!673 = !DILocation(line: 74, column: 35, scope: !671)
!674 = !DILocation(line: 76, column: 2, scope: !671)
!675 = distinct !{!675, !674}
!676 = !DILocation(line: 76, column: 10, scope: !677)
!677 = !DILexicalBlockFile(scope: !678, file: !139, discriminator: 1)
!678 = distinct !DILexicalBlock(scope: !679, file: !139, line: 76, column: 10)
!679 = distinct !DILexicalBlock(scope: !671, file: !139, line: 76, column: 4)
!680 = !DILocation(line: 76, column: 14, scope: !677)
!681 = !DILocation(line: 76, column: 5, scope: !682)
!682 = !DILexicalBlockFile(scope: !683, file: !139, discriminator: 2)
!683 = distinct !DILexicalBlock(scope: !678, file: !139, line: 76, column: 3)
!684 = !DILocation(line: 76, column: 14, scope: !685)
!685 = !DILexicalBlockFile(scope: !686, file: !139, discriminator: 3)
