; ModuleID = './line111-channel-events.o.i'
source_filename = "./line111-channel-events.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35)
!1 = !DIFile(filename: "line111-channel-events.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !43, !44, !112, !344, !371, !458, !290}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !37, line: 9, baseType: !38)
!37 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !41, !41, !41, !41, !41, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !46, line: 107, baseType: !47)
!46 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !48, line: 30, size: 2240, align: 64, elements: !49)
!48 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !53, !54, !55, !289, !294, !295, !296, !297, !298, !299, !300, !301, !302, !306, !307, !311, !312, !313, !317, !322, !323, !324, !325, !326, !327, !328, !329, !336, !337, !338, !339, !340, !346, !350, !354, !358, !362, !367, !446, !453, !457}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !51, line: 3, baseType: !52, size: 32, align: 32)
!51 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !47, file: !51, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !47, file: !51, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !47, file: !51, line: 8, baseType: !56, size: 64, align: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !46, line: 113, baseType: !58)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !48, line: 25, size: 1920, align: 64, elements: !59)
!59 = !{!60, !62, !63, !64, !67, !68, !69, !70, !71, !73, !74, !75, !76, !77, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !61, line: 3, baseType: !52, size: 32, align: 32)
!61 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !58, file: !61, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !58, file: !61, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !58, file: !61, line: 9, baseType: !65, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !58, file: !61, line: 10, baseType: !52, size: 32, align: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !58, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !58, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !58, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !58, file: !61, line: 13, baseType: !72, size: 16, align: 16, offset: 448)
!72 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !58, file: !61, line: 14, baseType: !65, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !58, file: !61, line: 15, baseType: !65, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !58, file: !61, line: 16, baseType: !52, size: 32, align: 32, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !58, file: !61, line: 17, baseType: !65, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !58, file: !61, line: 19, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !46, line: 99, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !46, line: 99, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !58, file: !61, line: 19, baseType: !78, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !58, file: !61, line: 21, baseType: !65, size: 64, align: 64, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !58, file: !61, line: 22, baseType: !65, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !58, file: !61, line: 23, baseType: !65, size: 64, align: 64, offset: 1024)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !58, file: !61, line: 24, baseType: !65, size: 64, align: 64, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !58, file: !61, line: 26, baseType: !65, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !58, file: !61, line: 27, baseType: !65, size: 64, align: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !58, file: !61, line: 28, baseType: !65, size: 64, align: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !58, file: !61, line: 29, baseType: !65, size: 64, align: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !58, file: !61, line: 30, baseType: !65, size: 64, align: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !58, file: !61, line: 31, baseType: !65, size: 64, align: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !58, file: !61, line: 32, baseType: !65, size: 64, align: 64, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !58, file: !61, line: 33, baseType: !65, size: 64, align: 64, offset: 1600)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !58, file: !61, line: 35, baseType: !95, size: 64, align: 64, offset: 1664)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !98)
!98 = !{!99, !102, !246, !247, !252, !253, !254, !255, !256, !265, !266, !267, !271, !272, !273, !274, !275, !276, !277, !278}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !97, file: !4, line: 100, baseType: !100, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !101, line: 49, baseType: !52)
!101 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !97, file: !4, line: 101, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !106)
!106 = !{!107, !131, !137, !144, !148, !233, !237, !242}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !105, file: !4, line: 133, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !95, !112, !114, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !101, line: 46, baseType: !66)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !115, line: 66, baseType: !116)
!115 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!116 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !121, line: 42, baseType: !122)
!121 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !121, line: 44, size: 128, align: 64, elements: !123)
!123 = !{!124, !129, !130}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !122, file: !121, line: 46, baseType: !125, size: 32, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !126, line: 36, baseType: !127)
!126 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !115, line: 45, baseType: !128)
!128 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !122, file: !121, line: 47, baseType: !100, size: 32, align: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !122, file: !121, line: 48, baseType: !112, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !105, file: !4, line: 138, baseType: !132, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!111, !95, !135, !114, !117, !118}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !105, file: !4, line: 143, baseType: !138, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!111, !95, !141, !143, !118}
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !115, line: 51, baseType: !142)
!142 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !105, file: !4, line: 147, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!111, !95, !118}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !105, file: !4, line: 149, baseType: !149, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !95, !232}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !155)
!155 = !{!156, !158, !179, !208, !210, !214, !215, !216, !217, !225, !226, !227, !228}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !154, file: !16, line: 174, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !101, line: 77, baseType: !43)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !154, file: !16, line: 175, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !162)
!162 = !{!163, !167, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !161, file: !16, line: 198, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !157}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !161, file: !16, line: 199, baseType: !164, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !161, file: !16, line: 200, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !157, !152, !172, !178}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !157}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !101, line: 50, baseType: !100)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !154, file: !16, line: 177, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !184)
!184 = !{!185, !190, !194, !198, !202, !203}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !183, file: !16, line: 216, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!177, !152, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !183, file: !16, line: 218, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!177, !152}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !183, file: !16, line: 219, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!177, !152, !173, !157}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !183, file: !16, line: 222, baseType: !199, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !152}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !183, file: !16, line: 226, baseType: !173, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !183, file: !16, line: 227, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !154, file: !16, line: 178, baseType: !209, size: 32, align: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !101, line: 55, baseType: !128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !154, file: !16, line: 180, baseType: !211, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !154, file: !16, line: 182, baseType: !100, size: 32, align: 32, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !16, line: 183, baseType: !209, size: 32, align: 32, offset: 352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !154, file: !16, line: 184, baseType: !209, size: 32, align: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !154, file: !16, line: 186, baseType: !218, size: 64, align: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !220, line: 37, baseType: !221)
!220 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !220, line: 39, size: 128, align: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !221, file: !220, line: 41, baseType: !157, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !220, line: 42, baseType: !218, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !16, line: 188, baseType: !152, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !16, line: 189, baseType: !152, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !16, line: 191, baseType: !65, size: 64, align: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !154, file: !16, line: 193, baseType: !229, size: 64, align: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !105, file: !4, line: 151, baseType: !234, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !95}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !105, file: !4, line: 152, baseType: !238, size: 64, align: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!111, !95, !241, !118}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !105, file: !4, line: 155, baseType: !243, size: 64, align: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!241, !95}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !97, file: !4, line: 103, baseType: !112, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !97, file: !4, line: 104, baseType: !248, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !249, line: 77, baseType: !250)
!249 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !249, line: 77, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !97, file: !4, line: 105, baseType: !248, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !97, file: !4, line: 106, baseType: !112, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !97, file: !4, line: 107, baseType: !209, size: 32, align: 32, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !97, file: !4, line: 109, baseType: !114, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !97, file: !4, line: 110, baseType: !257, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !259, line: 39, baseType: !260)
!259 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !259, line: 41, size: 192, align: 64, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !260, file: !259, line: 43, baseType: !112, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !260, file: !259, line: 44, baseType: !114, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !260, file: !259, line: 45, baseType: !114, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !97, file: !4, line: 111, baseType: !257, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !97, file: !4, line: 112, baseType: !257, size: 64, align: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !97, file: !4, line: 113, baseType: !268, size: 48, align: 8, offset: 704)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 48, align: 8, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 6)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !97, file: !4, line: 117, baseType: !209, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !97, file: !4, line: 118, baseType: !209, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !97, file: !4, line: 119, baseType: !209, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !97, file: !4, line: 120, baseType: !209, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !97, file: !4, line: 121, baseType: !209, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !97, file: !4, line: 122, baseType: !209, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !97, file: !4, line: 124, baseType: !157, size: 64, align: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !97, file: !4, line: 125, baseType: !157, size: 64, align: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !58, file: !61, line: 38, baseType: !128, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !58, file: !61, line: 39, baseType: !128, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !58, file: !61, line: 40, baseType: !128, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !58, file: !61, line: 41, baseType: !128, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !58, file: !61, line: 42, baseType: !128, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !58, file: !61, line: 43, baseType: !128, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !58, file: !61, line: 44, baseType: !128, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !58, file: !61, line: 45, baseType: !128, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !58, file: !61, line: 46, baseType: !65, size: 64, align: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !58, file: !61, line: 47, baseType: !65, size: 64, align: 64, offset: 1856)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !47, file: !51, line: 9, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !291, line: 75, baseType: !292)
!291 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !293, line: 139, baseType: !142)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!294 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !47, file: !51, line: 10, baseType: !290, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !47, file: !51, line: 12, baseType: !65, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !47, file: !51, line: 13, baseType: !65, size: 64, align: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !47, file: !51, line: 15, baseType: !128, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !47, file: !51, line: 16, baseType: !128, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !47, file: !51, line: 17, baseType: !128, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !47, file: !51, line: 18, baseType: !128, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !47, file: !51, line: 19, baseType: !128, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !47, file: !51, line: 21, baseType: !303, size: 64, align: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !46, line: 102, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !46, line: 102, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !47, file: !51, line: 22, baseType: !52, size: 32, align: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !47, file: !51, line: 25, baseType: !308, size: 128, align: 64, offset: 640)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, align: 64, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !47, file: !51, line: 26, baseType: !52, size: 32, align: 32, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !47, file: !51, line: 27, baseType: !52, size: 32, align: 32, offset: 800)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !47, file: !51, line: 29, baseType: !314, size: 64, align: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !46, line: 103, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !46, line: 103, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !47, file: !51, line: 30, baseType: !318, size: 64, align: 64, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !320, line: 37, baseType: !321)
!320 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !320, line: 37, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !47, file: !51, line: 32, baseType: !65, size: 64, align: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !47, file: !51, line: 33, baseType: !65, size: 64, align: 64, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !47, file: !51, line: 34, baseType: !65, size: 64, align: 64, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !47, file: !51, line: 35, baseType: !128, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !47, file: !51, line: 36, baseType: !128, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !47, file: !51, line: 37, baseType: !128, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !47, file: !51, line: 38, baseType: !128, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !47, file: !51, line: 40, baseType: !330, size: 128, align: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !101, line: 504, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !101, line: 506, size: 128, align: 64, elements: !332)
!332 = !{!333, !335}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !331, file: !101, line: 508, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !101, line: 48, baseType: !142)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !331, file: !101, line: 509, baseType: !334, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !47, file: !51, line: 41, baseType: !290, size: 64, align: 64, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !47, file: !51, line: 42, baseType: !52, size: 32, align: 32, offset: 1408)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !47, file: !51, line: 44, baseType: !218, size: 64, align: 64, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !47, file: !51, line: 45, baseType: !218, size: 64, align: 64, offset: 1536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !47, file: !51, line: 53, baseType: !341, size: 64, align: 64, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !44, !344, !52}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !47, file: !51, line: 55, baseType: !347, size: 64, align: 64, offset: 1664)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!52, !44, !66}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !47, file: !51, line: 57, baseType: !351, size: 64, align: 64, offset: 1728)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!52, !44, !344}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !47, file: !51, line: 60, baseType: !355, size: 64, align: 64, offset: 1792)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!344, !44}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !47, file: !51, line: 62, baseType: !359, size: 64, align: 64, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !44, !344, !344, !52}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !47, file: !51, line: 65, baseType: !363, size: 64, align: 64, offset: 1920)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!366, !44, !344, !344}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !47, file: !51, line: 69, baseType: !368, size: 64, align: 64, offset: 1984)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!371, !44, !344}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !46, line: 109, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !374, line: 15, size: 1408, align: 64, elements: !375)
!374 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!375 = !{!376, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !394, !398, !400, !401, !402, !403, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !373, file: !377, line: 3, baseType: !52, size: 32, align: 32)
!377 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !373, file: !377, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !373, file: !377, line: 5, baseType: !318, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !373, file: !377, line: 7, baseType: !43, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !373, file: !377, line: 8, baseType: !44, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !373, file: !377, line: 9, baseType: !65, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !377, line: 10, baseType: !65, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !373, file: !377, line: 11, baseType: !290, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !373, file: !377, line: 12, baseType: !52, size: 32, align: 32, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !373, file: !377, line: 13, baseType: !65, size: 64, align: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !373, file: !377, line: 15, baseType: !388, size: 64, align: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !46, line: 108, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !46, line: 108, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !373, file: !377, line: 17, baseType: !395, size: 64, align: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!344, !391}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !373, file: !399, line: 5, baseType: !65, size: 64, align: 64, offset: 704)
!399 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!400 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !373, file: !399, line: 6, baseType: !65, size: 64, align: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !373, file: !399, line: 7, baseType: !290, size: 64, align: 64, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !373, file: !399, line: 9, baseType: !318, size: 64, align: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !373, file: !399, line: 10, baseType: !404, size: 64, align: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !46, line: 111, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !407, line: 13, size: 576, align: 64, elements: !408)
!407 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!408 = !{!409, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !427, !428}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !410, line: 3, baseType: !52, size: 32, align: 32)
!410 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!411 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !406, file: !410, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !406, file: !410, line: 6, baseType: !290, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !406, file: !410, line: 8, baseType: !65, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !406, file: !410, line: 9, baseType: !65, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !406, file: !410, line: 10, baseType: !65, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !406, file: !410, line: 11, baseType: !52, size: 32, align: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !406, file: !410, line: 14, baseType: !128, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !406, file: !410, line: 15, baseType: !128, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !406, file: !410, line: 18, baseType: !128, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !406, file: !410, line: 19, baseType: !128, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !406, file: !410, line: 20, baseType: !128, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !406, file: !410, line: 21, baseType: !128, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !406, file: !410, line: 22, baseType: !424, size: 64, align: 8, offset: 360)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, align: 8, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !406, file: !410, line: 26, baseType: !43, size: 64, align: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !410, line: 28, baseType: !404, size: 64, align: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !373, file: !399, line: 12, baseType: !128, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !373, file: !399, line: 13, baseType: !65, size: 64, align: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !373, file: !399, line: 14, baseType: !52, size: 32, align: 32, offset: 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !373, file: !399, line: 15, baseType: !65, size: 64, align: 64, offset: 1216)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !373, file: !399, line: 17, baseType: !128, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !373, file: !399, line: 18, baseType: !128, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !373, file: !399, line: 19, baseType: !128, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !373, file: !399, line: 20, baseType: !128, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !373, file: !399, line: 22, baseType: !128, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !373, file: !399, line: 23, baseType: !128, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !373, file: !399, line: 24, baseType: !128, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !373, file: !399, line: 25, baseType: !128, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !373, file: !399, line: 26, baseType: !128, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !373, file: !399, line: 31, baseType: !443, size: 64, align: 64, offset: 1344)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!65, !371}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !47, file: !51, line: 70, baseType: !447, size: 64, align: 64, offset: 2048)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !44, !344}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !46, line: 110, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !46, line: 110, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !47, file: !51, line: 71, baseType: !454, size: 64, align: 64, offset: 2112)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!52, !344, !344}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !47, file: !51, line: 73, baseType: !454, size: 64, align: 64, offset: 2176)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !460, line: 7, baseType: !461)
!460 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !462, line: 15, size: 1600, align: 64, elements: !463)
!462 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!463 = !{!464, !465, !466, !467, !468, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !377, line: 3, baseType: !52, size: 32, align: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !461, file: !377, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !461, file: !377, line: 5, baseType: !318, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !461, file: !377, line: 7, baseType: !43, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !461, file: !377, line: 8, baseType: !469, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !460, line: 6, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !472, line: 42, size: 39168, align: 64, elements: !473)
!472 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!473 = !{!474, !475, !476, !477, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !633, !635}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !51, line: 3, baseType: !52, size: 32, align: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !471, file: !51, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !471, file: !51, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !471, file: !51, line: 8, baseType: !478, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !460, line: 5, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !472, line: 24, size: 2496, align: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !61, line: 3, baseType: !52, size: 32, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !480, file: !61, line: 4, baseType: !52, size: 32, align: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !480, file: !61, line: 6, baseType: !52, size: 32, align: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !480, file: !61, line: 9, baseType: !65, size: 64, align: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !480, file: !61, line: 10, baseType: !52, size: 32, align: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !480, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !480, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !480, file: !61, line: 11, baseType: !65, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !480, file: !61, line: 13, baseType: !72, size: 16, align: 16, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !480, file: !61, line: 14, baseType: !65, size: 64, align: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !480, file: !61, line: 15, baseType: !65, size: 64, align: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !480, file: !61, line: 16, baseType: !52, size: 32, align: 32, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !480, file: !61, line: 17, baseType: !65, size: 64, align: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !480, file: !61, line: 19, baseType: !78, size: 64, align: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !480, file: !61, line: 19, baseType: !78, size: 64, align: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !480, file: !61, line: 21, baseType: !65, size: 64, align: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !480, file: !61, line: 22, baseType: !65, size: 64, align: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !480, file: !61, line: 23, baseType: !65, size: 64, align: 64, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !480, file: !61, line: 24, baseType: !65, size: 64, align: 64, offset: 1088)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !480, file: !61, line: 26, baseType: !65, size: 64, align: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !480, file: !61, line: 27, baseType: !65, size: 64, align: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !480, file: !61, line: 28, baseType: !65, size: 64, align: 64, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !480, file: !61, line: 29, baseType: !65, size: 64, align: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !480, file: !61, line: 30, baseType: !65, size: 64, align: 64, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !480, file: !61, line: 31, baseType: !65, size: 64, align: 64, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !480, file: !61, line: 32, baseType: !65, size: 64, align: 64, offset: 1536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !480, file: !61, line: 33, baseType: !65, size: 64, align: 64, offset: 1600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !480, file: !61, line: 35, baseType: !95, size: 64, align: 64, offset: 1664)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !480, file: !61, line: 38, baseType: !128, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !480, file: !61, line: 39, baseType: !128, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !480, file: !61, line: 40, baseType: !128, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !480, file: !61, line: 41, baseType: !128, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !480, file: !61, line: 42, baseType: !128, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !480, file: !61, line: 43, baseType: !128, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !480, file: !61, line: 44, baseType: !128, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !480, file: !61, line: 45, baseType: !128, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !480, file: !61, line: 46, baseType: !65, size: 64, align: 64, offset: 1792)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !480, file: !61, line: 47, baseType: !65, size: 64, align: 64, offset: 1856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !480, file: !472, line: 27, baseType: !65, size: 64, align: 64, offset: 1920)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !480, file: !472, line: 28, baseType: !65, size: 64, align: 64, offset: 1984)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !480, file: !472, line: 30, baseType: !52, size: 32, align: 32, offset: 2048)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !480, file: !472, line: 31, baseType: !65, size: 64, align: 64, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !480, file: !472, line: 32, baseType: !65, size: 64, align: 64, offset: 2176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !480, file: !472, line: 34, baseType: !52, size: 32, align: 32, offset: 2240)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !480, file: !472, line: 35, baseType: !52, size: 32, align: 32, offset: 2272)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !480, file: !472, line: 36, baseType: !52, size: 32, align: 32, offset: 2304)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !480, file: !472, line: 38, baseType: !52, size: 32, align: 32, offset: 2336)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !480, file: !472, line: 38, baseType: !52, size: 32, align: 32, offset: 2368)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !480, file: !472, line: 38, baseType: !52, size: 32, align: 32, offset: 2400)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !480, file: !472, line: 38, baseType: !52, size: 32, align: 32, offset: 2432)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !471, file: !51, line: 9, baseType: !290, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !471, file: !51, line: 10, baseType: !290, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !471, file: !51, line: 12, baseType: !65, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !471, file: !51, line: 13, baseType: !65, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !471, file: !51, line: 15, baseType: !128, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !471, file: !51, line: 16, baseType: !128, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !471, file: !51, line: 17, baseType: !128, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !471, file: !51, line: 18, baseType: !128, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !471, file: !51, line: 19, baseType: !128, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !471, file: !51, line: 21, baseType: !303, size: 64, align: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !471, file: !51, line: 22, baseType: !52, size: 32, align: 32, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !471, file: !51, line: 25, baseType: !308, size: 128, align: 64, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !471, file: !51, line: 26, baseType: !52, size: 32, align: 32, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !471, file: !51, line: 27, baseType: !52, size: 32, align: 32, offset: 800)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !471, file: !51, line: 29, baseType: !314, size: 64, align: 64, offset: 832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !471, file: !51, line: 30, baseType: !318, size: 64, align: 64, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !471, file: !51, line: 32, baseType: !65, size: 64, align: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !471, file: !51, line: 33, baseType: !65, size: 64, align: 64, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !471, file: !51, line: 34, baseType: !65, size: 64, align: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !471, file: !51, line: 35, baseType: !128, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !471, file: !51, line: 36, baseType: !128, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !471, file: !51, line: 37, baseType: !128, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !471, file: !51, line: 38, baseType: !128, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !471, file: !51, line: 40, baseType: !330, size: 128, align: 64, offset: 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !471, file: !51, line: 41, baseType: !290, size: 64, align: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !471, file: !51, line: 42, baseType: !52, size: 32, align: 32, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !471, file: !51, line: 44, baseType: !218, size: 64, align: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !471, file: !51, line: 45, baseType: !218, size: 64, align: 64, offset: 1536)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !471, file: !51, line: 53, baseType: !341, size: 64, align: 64, offset: 1600)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !471, file: !51, line: 55, baseType: !347, size: 64, align: 64, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !471, file: !51, line: 57, baseType: !351, size: 64, align: 64, offset: 1728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !471, file: !51, line: 60, baseType: !355, size: 64, align: 64, offset: 1792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !471, file: !51, line: 62, baseType: !359, size: 64, align: 64, offset: 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !471, file: !51, line: 65, baseType: !363, size: 64, align: 64, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !471, file: !51, line: 69, baseType: !368, size: 64, align: 64, offset: 1984)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !471, file: !51, line: 70, baseType: !447, size: 64, align: 64, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !471, file: !51, line: 71, baseType: !454, size: 64, align: 64, offset: 2112)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !471, file: !51, line: 73, baseType: !454, size: 64, align: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !471, file: !472, line: 46, baseType: !218, size: 64, align: 64, offset: 2240)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !471, file: !472, line: 47, baseType: !218, size: 64, align: 64, offset: 2304)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !471, file: !472, line: 48, baseType: !573, size: 64, align: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !460, line: 8, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !460, line: 8, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !471, file: !472, line: 49, baseType: !218, size: 64, align: 64, offset: 2432)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !471, file: !472, line: 51, baseType: !65, size: 64, align: 64, offset: 2496)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !471, file: !472, line: 53, baseType: !65, size: 64, align: 64, offset: 2560)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !471, file: !472, line: 54, baseType: !65, size: 64, align: 64, offset: 2624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !471, file: !472, line: 55, baseType: !65, size: 64, align: 64, offset: 2688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !471, file: !472, line: 56, baseType: !65, size: 64, align: 64, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !471, file: !472, line: 57, baseType: !52, size: 32, align: 32, offset: 2816)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !471, file: !472, line: 59, baseType: !128, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !471, file: !472, line: 60, baseType: !128, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !471, file: !472, line: 62, baseType: !128, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !471, file: !472, line: 63, baseType: !128, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !471, file: !472, line: 64, baseType: !128, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !471, file: !472, line: 65, baseType: !128, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !471, file: !472, line: 66, baseType: !128, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !471, file: !472, line: 67, baseType: !128, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !471, file: !472, line: 68, baseType: !128, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !471, file: !472, line: 69, baseType: !128, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !471, file: !472, line: 70, baseType: !128, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !471, file: !472, line: 71, baseType: !128, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !471, file: !472, line: 72, baseType: !128, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !471, file: !472, line: 74, baseType: !52, size: 32, align: 32, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !471, file: !472, line: 75, baseType: !52, size: 32, align: 32, offset: 2912)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !471, file: !472, line: 76, baseType: !52, size: 32, align: 32, offset: 2944)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !471, file: !472, line: 77, baseType: !52, size: 32, align: 32, offset: 2976)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !471, file: !472, line: 79, baseType: !318, size: 64, align: 64, offset: 3008)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !471, file: !472, line: 80, baseType: !218, size: 64, align: 64, offset: 3072)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !471, file: !472, line: 81, baseType: !218, size: 64, align: 64, offset: 3136)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !471, file: !472, line: 83, baseType: !257, size: 64, align: 64, offset: 3200)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !471, file: !472, line: 84, baseType: !209, size: 32, align: 32, offset: 3264)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !471, file: !472, line: 87, baseType: !52, size: 32, align: 32, offset: 3296)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !471, file: !472, line: 91, baseType: !218, size: 64, align: 64, offset: 3328)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !471, file: !472, line: 92, baseType: !330, size: 128, align: 64, offset: 3392)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !471, file: !472, line: 93, baseType: !330, size: 128, align: 64, offset: 3520)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !471, file: !472, line: 95, baseType: !52, size: 32, align: 32, offset: 3648)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !471, file: !472, line: 96, baseType: !52, size: 32, align: 32, offset: 3680)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !471, file: !472, line: 97, baseType: !52, size: 32, align: 32, offset: 3712)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !471, file: !472, line: 100, baseType: !218, size: 64, align: 64, offset: 3776)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !471, file: !472, line: 103, baseType: !218, size: 64, align: 64, offset: 3840)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !471, file: !472, line: 106, baseType: !218, size: 64, align: 64, offset: 3904)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !471, file: !472, line: 108, baseType: !318, size: 64, align: 64, offset: 3968)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !471, file: !472, line: 109, baseType: !218, size: 64, align: 64, offset: 4032)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !471, file: !472, line: 111, baseType: !218, size: 64, align: 64, offset: 4096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !471, file: !472, line: 114, baseType: !43, size: 64, align: 64, offset: 4160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !471, file: !472, line: 116, baseType: !318, size: 64, align: 64, offset: 4224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !471, file: !472, line: 117, baseType: !621, size: 32768, align: 64, offset: 4288)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 32768, align: 64, elements: !631)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !623, line: 10, size: 128, align: 64, elements: !624)
!623 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!624 = !{!625, !630}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !622, file: !623, line: 11, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !623, line: 7, baseType: !628)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !458, !344, !66, !66, !65, !257}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !622, file: !623, line: 12, baseType: !66, size: 8, align: 8, offset: 64)
!631 = !{!632}
!632 = !DISubrange(count: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !471, file: !472, line: 118, baseType: !634, size: 2048, align: 8, offset: 37056)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, align: 8, elements: !631)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !471, file: !472, line: 120, baseType: !454, size: 64, align: 64, offset: 39104)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !461, file: !377, line: 9, baseType: !65, size: 64, align: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !377, line: 10, baseType: !65, size: 64, align: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !461, file: !377, line: 11, baseType: !290, size: 64, align: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !461, file: !377, line: 12, baseType: !52, size: 32, align: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !461, file: !377, line: 13, baseType: !65, size: 64, align: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !461, file: !377, line: 15, baseType: !388, size: 64, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !461, file: !377, line: 17, baseType: !395, size: 64, align: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !461, file: !399, line: 5, baseType: !65, size: 64, align: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !461, file: !399, line: 6, baseType: !65, size: 64, align: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !461, file: !399, line: 7, baseType: !290, size: 64, align: 64, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !461, file: !399, line: 9, baseType: !318, size: 64, align: 64, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !461, file: !399, line: 10, baseType: !404, size: 64, align: 64, offset: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !461, file: !399, line: 12, baseType: !128, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !461, file: !399, line: 13, baseType: !65, size: 64, align: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !461, file: !399, line: 14, baseType: !52, size: 32, align: 32, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !461, file: !399, line: 15, baseType: !65, size: 64, align: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !461, file: !399, line: 17, baseType: !128, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !461, file: !399, line: 18, baseType: !128, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !461, file: !399, line: 19, baseType: !128, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !461, file: !399, line: 20, baseType: !128, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !461, file: !399, line: 22, baseType: !128, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !461, file: !399, line: 23, baseType: !128, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !461, file: !399, line: 24, baseType: !128, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !461, file: !399, line: 25, baseType: !128, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !461, file: !399, line: 26, baseType: !128, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !461, file: !399, line: 31, baseType: !443, size: 64, align: 64, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !461, file: !462, line: 18, baseType: !218, size: 64, align: 64, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !461, file: !462, line: 20, baseType: !290, size: 64, align: 64, offset: 1472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !461, file: !462, line: 21, baseType: !52, size: 32, align: 32, offset: 1536)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !461, file: !462, line: 22, baseType: !52, size: 32, align: 32, offset: 1568)
!666 = !{i32 2, !"Dwarf Version", i32 4}
!667 = !{i32 2, !"Debug Info Version", i32 3}
!668 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!669 = distinct !DISubprogram(name: "channel_events_init", scope: !670, file: !670, line: 365, type: !206, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !671)
!670 = !DIFile(filename: "channel-events.c", directory: "/home/lichi/Desktop/irssi/task1")
!671 = !{}
!672 = !DILocation(line: 367, column: 2, scope: !669)
!673 = !DILocation(line: 369, column: 2, scope: !669)
!674 = !DILocation(line: 370, column: 2, scope: !669)
!675 = !DILocation(line: 371, column: 2, scope: !669)
!676 = !DILocation(line: 373, column: 2, scope: !669)
!677 = !DILocation(line: 374, column: 2, scope: !669)
!678 = !DILocation(line: 375, column: 2, scope: !669)
!679 = !DILocation(line: 376, column: 2, scope: !669)
!680 = !DILocation(line: 377, column: 2, scope: !669)
!681 = !DILocation(line: 378, column: 2, scope: !669)
!682 = !DILocation(line: 379, column: 2, scope: !669)
!683 = !DILocation(line: 380, column: 1, scope: !669)
!684 = distinct !DISubprogram(name: "irc_server_event", scope: !670, file: !670, line: 54, type: !685, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !671)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !469, !344}
!687 = !DILocalVariable(name: "server", arg: 1, scope: !684, file: !670, line: 54, type: !469)
!688 = !DIExpression()
!689 = !DILocation(line: 54, column: 46, scope: !684)
!690 = !DILocalVariable(name: "line", arg: 2, scope: !684, file: !670, line: 54, type: !344)
!691 = !DILocation(line: 54, column: 66, scope: !684)
!692 = !DILocalVariable(name: "params", scope: !684, file: !670, line: 56, type: !65)
!693 = !DILocation(line: 56, column: 8, scope: !684)
!694 = !DILocalVariable(name: "numeric", scope: !684, file: !670, line: 56, type: !65)
!695 = !DILocation(line: 56, column: 17, scope: !684)
!696 = !DILocalVariable(name: "channel", scope: !684, file: !670, line: 56, type: !65)
!697 = !DILocation(line: 56, column: 27, scope: !684)
!698 = !DILocation(line: 61, column: 28, scope: !684)
!699 = !DILocation(line: 61, column: 11, scope: !684)
!700 = !DILocation(line: 61, column: 9, scope: !684)
!701 = !DILocation(line: 63, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !684, file: !670, line: 63, column: 6)
!703 = !DILocation(line: 63, column: 17, scope: !702)
!704 = !DILocation(line: 63, column: 6, scope: !684)
!705 = !DILocation(line: 64, column: 22, scope: !702)
!706 = !DILocation(line: 64, column: 30, scope: !702)
!707 = !DILocation(line: 64, column: 3, scope: !702)
!708 = !DILocation(line: 66, column: 9, scope: !684)
!709 = !DILocation(line: 66, column: 2, scope: !684)
!710 = !DILocation(line: 67, column: 1, scope: !684)
!711 = distinct !DISubprogram(name: "event_no_such_channel", scope: !670, file: !670, line: 69, type: !685, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !671)
!712 = !DILocalVariable(name: "server", arg: 1, scope: !711, file: !670, line: 69, type: !469)
!713 = !DILocation(line: 69, column: 51, scope: !711)
!714 = !DILocalVariable(name: "data", arg: 2, scope: !711, file: !670, line: 69, type: !344)
!715 = !DILocation(line: 69, column: 71, scope: !711)
!716 = !DILocalVariable(name: "chanrec", scope: !711, file: !670, line: 71, type: !371)
!717 = !DILocation(line: 71, column: 15, scope: !711)
!718 = !DILocalVariable(name: "setup", scope: !711, file: !670, line: 72, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !46, line: 115, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !722, line: 12, size: 512, align: 64, elements: !723)
!722 = !DIFile(filename: "../../../src/core/channels-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!723 = !{!724, !726, !727, !728, !729, !730, !731, !732, !733}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !721, file: !725, line: 1, baseType: !52, size: 32, align: 32)
!725 = !DIFile(filename: "../../../src/core/channel-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !721, file: !725, line: 2, baseType: !52, size: 32, align: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !725, line: 4, baseType: !65, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !721, file: !725, line: 5, baseType: !65, size: 64, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !721, file: !725, line: 6, baseType: !65, size: 64, align: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "botmasks", scope: !721, file: !725, line: 8, baseType: !65, size: 64, align: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !721, file: !725, line: 9, baseType: !65, size: 64, align: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "autojoin", scope: !721, file: !725, line: 11, baseType: !128, size: 1, align: 32, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !721, file: !725, line: 12, baseType: !318, size: 64, align: 64, offset: 448)
!734 = !DILocation(line: 72, column: 21, scope: !711)
!735 = !DILocalVariable(name: "params", scope: !711, file: !670, line: 73, type: !65)
!736 = !DILocation(line: 73, column: 8, scope: !711)
!737 = !DILocalVariable(name: "channel", scope: !711, file: !670, line: 73, type: !65)
!738 = !DILocation(line: 73, column: 17, scope: !711)
!739 = !DILocation(line: 75, column: 28, scope: !711)
!740 = !DILocation(line: 75, column: 11, scope: !711)
!741 = !DILocation(line: 75, column: 9, scope: !711)
!742 = !DILocation(line: 76, column: 13, scope: !711)
!743 = !DILocation(line: 76, column: 12, scope: !711)
!744 = !DILocation(line: 76, column: 21, scope: !711)
!745 = !DILocation(line: 76, column: 28, scope: !711)
!746 = !DILocation(line: 76, column: 31, scope: !747)
!747 = !DILexicalBlockFile(scope: !711, file: !670, discriminator: 1)
!748 = !DILocation(line: 76, column: 42, scope: !747)
!749 = !DILocation(line: 76, column: 12, scope: !747)
!750 = !DILocation(line: 77, column: 50, scope: !711)
!751 = !DILocation(line: 77, column: 32, scope: !711)
!752 = !DILocation(line: 77, column: 17, scope: !711)
!753 = !DILocation(line: 77, column: 29, scope: !711)
!754 = !DILocation(line: 77, column: 3, scope: !747)
!755 = !DILocation(line: 76, column: 12, scope: !756)
!756 = !DILexicalBlockFile(scope: !711, file: !670, discriminator: 2)
!757 = !DILocation(line: 76, column: 12, scope: !758)
!758 = !DILexicalBlockFile(scope: !711, file: !670, discriminator: 3)
!759 = !DILocation(line: 76, column: 12, scope: !760)
!760 = !DILexicalBlockFile(scope: !711, file: !670, discriminator: 4)
!761 = !DILocation(line: 76, column: 10, scope: !760)
!762 = !DILocation(line: 79, column: 6, scope: !763)
!763 = distinct !DILexicalBlock(scope: !711, file: !670, line: 79, column: 6)
!764 = !DILocation(line: 79, column: 14, scope: !763)
!765 = !DILocation(line: 79, column: 6, scope: !711)
!766 = !DILocation(line: 81, column: 30, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !670, line: 79, column: 22)
!768 = !DILocation(line: 81, column: 39, scope: !767)
!769 = !DILocation(line: 82, column: 9, scope: !767)
!770 = !DILocation(line: 82, column: 18, scope: !767)
!771 = !DILocation(line: 82, column: 26, scope: !767)
!772 = !DILocation(line: 82, column: 35, scope: !767)
!773 = !DILocation(line: 81, column: 11, scope: !767)
!774 = !DILocation(line: 81, column: 9, scope: !767)
!775 = !DILocation(line: 83, column: 7, scope: !776)
!776 = distinct !DILexicalBlock(scope: !767, file: !670, line: 83, column: 7)
!777 = !DILocation(line: 83, column: 13, scope: !776)
!778 = !DILocation(line: 83, column: 20, scope: !776)
!779 = !DILocation(line: 83, column: 23, scope: !780)
!780 = !DILexicalBlockFile(scope: !776, file: !670, discriminator: 1)
!781 = !DILocation(line: 83, column: 30, scope: !780)
!782 = !DILocation(line: 83, column: 7, scope: !780)
!783 = !DILocation(line: 85, column: 18, scope: !784)
!784 = distinct !DILexicalBlock(scope: !776, file: !670, line: 83, column: 40)
!785 = !DILocation(line: 85, column: 38, scope: !784)
!786 = !DILocation(line: 85, column: 47, scope: !784)
!787 = !DILocation(line: 85, column: 4, scope: !784)
!788 = !DILocation(line: 86, column: 11, scope: !784)
!789 = !DILocation(line: 86, column: 4, scope: !784)
!790 = !DILocation(line: 87, column: 25, scope: !784)
!791 = !DILocation(line: 89, column: 2, scope: !767)
!792 = !DILocation(line: 91, column: 21, scope: !711)
!793 = !DILocation(line: 91, column: 29, scope: !711)
!794 = !DILocation(line: 91, column: 2, scope: !711)
!795 = !DILocation(line: 92, column: 9, scope: !711)
!796 = !DILocation(line: 92, column: 2, scope: !711)
!797 = !DILocation(line: 93, column: 1, scope: !711)
!798 = !DILocation(line: 93, column: 1, scope: !747)
