; ModuleID = './line310-fe-ctcp.o.i'
source_filename = "./line310-fe-ctcp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!122 = !DIEnumerator(name: "IRCTXT_NO_INVITELIST", value: 53)
!123 = !DIEnumerator(name: "IRCTXT_INVITELIST", value: 54)
!124 = !DIEnumerator(name: "IRCTXT_INVITELIST_LONG", value: 55)
!125 = !DIEnumerator(name: "IRCTXT_NO_SUCH_CHANNEL", value: 56)
!126 = !DIEnumerator(name: "IRCTXT_CHANNEL_SYNCED", value: 57)
!127 = !DIEnumerator(name: "IRCTXT_FILL_4", value: 58)
!128 = !DIEnumerator(name: "IRCTXT_USERMODE_CHANGE", value: 59)
!129 = !DIEnumerator(name: "IRCTXT_USER_MODE", value: 60)
!130 = !DIEnumerator(name: "IRCTXT_AWAY", value: 61)
!131 = !DIEnumerator(name: "IRCTXT_UNAWAY", value: 62)
!132 = !DIEnumerator(name: "IRCTXT_NICK_AWAY", value: 63)
!133 = !DIEnumerator(name: "IRCTXT_NO_SUCH_NICK", value: 64)
!134 = !DIEnumerator(name: "IRCTXT_NICK_IN_USE", value: 65)
!135 = !DIEnumerator(name: "IRCTXT_NICK_UNAVAILABLE", value: 66)
!136 = !DIEnumerator(name: "IRCTXT_YOUR_NICK_OWNED", value: 67)
!137 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!138 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!139 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!140 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!141 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!142 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!143 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!144 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !{!193, !200, !201, !202, !269, !501}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !194, line: 9, baseType: !195)
!194 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !198, !198, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !204, line: 107, baseType: !205)
!204 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !206, line: 30, size: 2240, align: 64, elements: !207)
!206 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!207 = !{!208, !210, !211, !212, !446, !451, !452, !453, !454, !455, !456, !457, !458, !459, !463, !464, !468, !469, !470, !474, !479, !480, !481, !482, !483, !484, !485, !486, !493, !494, !495, !496, !497, !503, !507, !511, !515, !519, !524, !595, !622, !626}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !209, line: 3, baseType: !201, size: 32, align: 32)
!209 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !205, file: !209, line: 4, baseType: !201, size: 32, align: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !205, file: !209, line: 6, baseType: !201, size: 32, align: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !205, file: !209, line: 8, baseType: !213, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !204, line: 113, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !206, line: 25, size: 1920, align: 64, elements: !216)
!216 = !{!217, !219, !220, !221, !224, !225, !226, !227, !228, !230, !231, !232, !233, !234, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !218, line: 3, baseType: !201, size: 32, align: 32)
!218 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !215, file: !218, line: 4, baseType: !201, size: 32, align: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !215, file: !218, line: 6, baseType: !201, size: 32, align: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !215, file: !218, line: 9, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !215, file: !218, line: 10, baseType: !201, size: 32, align: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !215, file: !218, line: 11, baseType: !222, size: 64, align: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !215, file: !218, line: 11, baseType: !222, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !215, file: !218, line: 11, baseType: !222, size: 64, align: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !215, file: !218, line: 13, baseType: !229, size: 16, align: 16, offset: 448)
!229 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !215, file: !218, line: 14, baseType: !222, size: 64, align: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !215, file: !218, line: 15, baseType: !222, size: 64, align: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !215, file: !218, line: 16, baseType: !201, size: 32, align: 32, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !215, file: !218, line: 17, baseType: !222, size: 64, align: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !215, file: !218, line: 19, baseType: !235, size: 64, align: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !204, line: 99, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !204, line: 99, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !215, file: !218, line: 19, baseType: !235, size: 64, align: 64, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !215, file: !218, line: 21, baseType: !222, size: 64, align: 64, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !215, file: !218, line: 22, baseType: !222, size: 64, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !215, file: !218, line: 23, baseType: !222, size: 64, align: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !215, file: !218, line: 24, baseType: !222, size: 64, align: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !215, file: !218, line: 26, baseType: !222, size: 64, align: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !215, file: !218, line: 27, baseType: !222, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !215, file: !218, line: 28, baseType: !222, size: 64, align: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !215, file: !218, line: 29, baseType: !222, size: 64, align: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !215, file: !218, line: 30, baseType: !222, size: 64, align: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !215, file: !218, line: 31, baseType: !222, size: 64, align: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !215, file: !218, line: 32, baseType: !222, size: 64, align: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !215, file: !218, line: 33, baseType: !222, size: 64, align: 64, offset: 1600)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !215, file: !218, line: 35, baseType: !252, size: 64, align: 64, offset: 1664)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !255)
!255 = !{!256, !259, !403, !404, !409, !410, !411, !412, !413, !422, !423, !424, !428, !429, !430, !431, !432, !433, !434, !435}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !254, file: !4, line: 100, baseType: !257, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !258, line: 49, baseType: !201)
!258 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !254, file: !4, line: 101, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !263)
!263 = !{!264, !288, !294, !301, !305, !390, !394, !399}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !262, file: !4, line: 133, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !252, !269, !271, !274, !275}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !258, line: 46, baseType: !223)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !272, line: 66, baseType: !273)
!272 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!273 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !278, line: 42, baseType: !279)
!278 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !278, line: 44, size: 128, align: 64, elements: !280)
!280 = !{!281, !286, !287}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !278, line: 46, baseType: !282, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !283, line: 36, baseType: !284)
!283 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !272, line: 45, baseType: !285)
!285 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !279, file: !278, line: 47, baseType: !257, size: 32, align: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !279, file: !278, line: 48, baseType: !269, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !262, file: !4, line: 138, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!268, !252, !292, !271, !274, !275}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !262, file: !4, line: 143, baseType: !295, size: 64, align: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!268, !252, !298, !300, !275}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !272, line: 51, baseType: !299)
!299 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !262, file: !4, line: 147, baseType: !302, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!268, !252, !275}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !262, file: !4, line: 149, baseType: !306, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !252, !389}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !312)
!312 = !{!313, !315, !336, !365, !367, !371, !372, !373, !374, !382, !383, !384, !385}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !311, file: !16, line: 174, baseType: !314, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !258, line: 77, baseType: !200)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !311, file: !16, line: 175, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !319)
!319 = !{!320, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !318, file: !16, line: 198, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !314}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !318, file: !16, line: 199, baseType: !321, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !16, line: 200, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !314, !309, !329, !335}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !314}
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !258, line: 50, baseType: !257)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !311, file: !16, line: 177, baseType: !337, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !341)
!341 = !{!342, !347, !351, !355, !359, !360}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !340, file: !16, line: 216, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!334, !309, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !340, file: !16, line: 218, baseType: !348, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!334, !309}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !340, file: !16, line: 219, baseType: !352, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!334, !309, !330, !314}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !340, file: !16, line: 222, baseType: !356, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !309}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !340, file: !16, line: 226, baseType: !330, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !340, file: !16, line: 227, baseType: !361, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !311, file: !16, line: 178, baseType: !366, size: 32, align: 32, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !258, line: 55, baseType: !285)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !311, file: !16, line: 180, baseType: !368, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !311, file: !16, line: 182, baseType: !257, size: 32, align: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !16, line: 183, baseType: !366, size: 32, align: 32, offset: 352)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !311, file: !16, line: 184, baseType: !366, size: 32, align: 32, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !311, file: !16, line: 186, baseType: !375, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !377, line: 37, baseType: !378)
!377 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !377, line: 39, size: 128, align: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !377, line: 41, baseType: !314, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !377, line: 42, baseType: !375, size: 64, align: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !16, line: 188, baseType: !309, size: 64, align: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !16, line: 189, baseType: !309, size: 64, align: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !16, line: 191, baseType: !222, size: 64, align: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !311, file: !16, line: 193, baseType: !386, size: 64, align: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !262, file: !4, line: 151, baseType: !391, size: 64, align: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !252}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !262, file: !4, line: 152, baseType: !395, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!268, !252, !398, !275}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !262, file: !4, line: 155, baseType: !400, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!398, !252}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !254, file: !4, line: 103, baseType: !269, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !254, file: !4, line: 104, baseType: !405, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !406, line: 77, baseType: !407)
!406 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !406, line: 77, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !254, file: !4, line: 105, baseType: !405, size: 64, align: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !254, file: !4, line: 106, baseType: !269, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !254, file: !4, line: 107, baseType: !366, size: 32, align: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !254, file: !4, line: 109, baseType: !271, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !254, file: !4, line: 110, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !416, line: 39, baseType: !417)
!416 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !416, line: 41, size: 192, align: 64, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !417, file: !416, line: 43, baseType: !269, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !417, file: !416, line: 44, baseType: !271, size: 64, align: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !417, file: !416, line: 45, baseType: !271, size: 64, align: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !254, file: !4, line: 111, baseType: !414, size: 64, align: 64, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !254, file: !4, line: 112, baseType: !414, size: 64, align: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !254, file: !4, line: 113, baseType: !425, size: 48, align: 8, offset: 704)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 48, align: 8, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 6)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !254, file: !4, line: 117, baseType: !366, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !254, file: !4, line: 118, baseType: !366, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !254, file: !4, line: 119, baseType: !366, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !254, file: !4, line: 120, baseType: !366, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !254, file: !4, line: 121, baseType: !366, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !254, file: !4, line: 122, baseType: !366, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !254, file: !4, line: 124, baseType: !314, size: 64, align: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !254, file: !4, line: 125, baseType: !314, size: 64, align: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !215, file: !218, line: 38, baseType: !285, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !215, file: !218, line: 39, baseType: !285, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !215, file: !218, line: 40, baseType: !285, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !215, file: !218, line: 41, baseType: !285, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !215, file: !218, line: 42, baseType: !285, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !215, file: !218, line: 43, baseType: !285, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !215, file: !218, line: 44, baseType: !285, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !215, file: !218, line: 45, baseType: !285, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !215, file: !218, line: 46, baseType: !222, size: 64, align: 64, offset: 1792)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !215, file: !218, line: 47, baseType: !222, size: 64, align: 64, offset: 1856)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !205, file: !209, line: 9, baseType: !447, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !448, line: 75, baseType: !449)
!448 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !450, line: 139, baseType: !299)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !205, file: !209, line: 10, baseType: !447, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !205, file: !209, line: 12, baseType: !222, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !205, file: !209, line: 13, baseType: !222, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !205, file: !209, line: 15, baseType: !285, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !205, file: !209, line: 16, baseType: !285, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !205, file: !209, line: 17, baseType: !285, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !205, file: !209, line: 18, baseType: !285, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !205, file: !209, line: 19, baseType: !285, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !205, file: !209, line: 21, baseType: !460, size: 64, align: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !204, line: 102, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !204, line: 102, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !205, file: !209, line: 22, baseType: !201, size: 32, align: 32, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !205, file: !209, line: 25, baseType: !465, size: 128, align: 64, offset: 640)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 128, align: 64, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 2)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !205, file: !209, line: 26, baseType: !201, size: 32, align: 32, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !205, file: !209, line: 27, baseType: !201, size: 32, align: 32, offset: 800)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !205, file: !209, line: 29, baseType: !471, size: 64, align: 64, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !204, line: 103, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !204, line: 103, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !205, file: !209, line: 30, baseType: !475, size: 64, align: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !477, line: 37, baseType: !478)
!477 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !477, line: 37, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !205, file: !209, line: 32, baseType: !222, size: 64, align: 64, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !205, file: !209, line: 33, baseType: !222, size: 64, align: 64, offset: 1024)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !205, file: !209, line: 34, baseType: !222, size: 64, align: 64, offset: 1088)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !205, file: !209, line: 35, baseType: !285, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !205, file: !209, line: 36, baseType: !285, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !205, file: !209, line: 37, baseType: !285, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !205, file: !209, line: 38, baseType: !285, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !205, file: !209, line: 40, baseType: !487, size: 128, align: 64, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !258, line: 504, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !258, line: 506, size: 128, align: 64, elements: !489)
!489 = !{!490, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !488, file: !258, line: 508, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !258, line: 48, baseType: !299)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !488, file: !258, line: 509, baseType: !491, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !205, file: !209, line: 41, baseType: !447, size: 64, align: 64, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !205, file: !209, line: 42, baseType: !201, size: 32, align: 32, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !205, file: !209, line: 44, baseType: !375, size: 64, align: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !205, file: !209, line: 45, baseType: !375, size: 64, align: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !205, file: !209, line: 53, baseType: !498, size: 64, align: 64, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !202, !501, !201}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !205, file: !209, line: 55, baseType: !504, size: 64, align: 64, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!201, !202, !223}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !205, file: !209, line: 57, baseType: !508, size: 64, align: 64, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!201, !202, !501}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !205, file: !209, line: 60, baseType: !512, size: 64, align: 64, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!501, !202}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !205, file: !209, line: 62, baseType: !516, size: 64, align: 64, offset: 1856)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !202, !501, !501, !201}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !205, file: !209, line: 65, baseType: !520, size: 64, align: 64, offset: 1920)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !202, !501, !501}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !205, file: !209, line: 69, baseType: !525, size: 64, align: 64, offset: 1984)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !202, !501}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !204, line: 109, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !531, line: 15, size: 1408, align: 64, elements: !532)
!531 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!532 = !{!533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !568, !569, !571, !572, !573, !574, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !534, line: 3, baseType: !201, size: 32, align: 32)
!534 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !530, file: !534, line: 4, baseType: !201, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !530, file: !534, line: 5, baseType: !475, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !530, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !530, file: !534, line: 8, baseType: !202, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !530, file: !534, line: 9, baseType: !222, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !534, line: 10, baseType: !222, size: 64, align: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !530, file: !534, line: 11, baseType: !447, size: 64, align: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !530, file: !534, line: 12, baseType: !201, size: 32, align: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !530, file: !534, line: 13, baseType: !222, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !530, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !204, line: 108, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !551, line: 5, size: 704, align: 64, elements: !552)
!551 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !534, line: 3, baseType: !201, size: 32, align: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !550, file: !534, line: 4, baseType: !201, size: 32, align: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !550, file: !534, line: 5, baseType: !475, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !550, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !550, file: !534, line: 8, baseType: !202, size: 64, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !550, file: !534, line: 9, baseType: !222, size: 64, align: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !534, line: 10, baseType: !222, size: 64, align: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !550, file: !534, line: 11, baseType: !447, size: 64, align: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !550, file: !534, line: 12, baseType: !201, size: 32, align: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !550, file: !534, line: 13, baseType: !222, size: 64, align: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !550, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !550, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!501, !548}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !530, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !530, file: !570, line: 5, baseType: !222, size: 64, align: 64, offset: 704)
!570 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !530, file: !570, line: 6, baseType: !222, size: 64, align: 64, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !530, file: !570, line: 7, baseType: !447, size: 64, align: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !530, file: !570, line: 9, baseType: !475, size: 64, align: 64, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !530, file: !570, line: 10, baseType: !575, size: 64, align: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !204, line: 111, baseType: !577)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !204, line: 111, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !530, file: !570, line: 12, baseType: !285, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !530, file: !570, line: 13, baseType: !222, size: 64, align: 64, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !530, file: !570, line: 14, baseType: !201, size: 32, align: 32, offset: 1152)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !530, file: !570, line: 15, baseType: !222, size: 64, align: 64, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !530, file: !570, line: 17, baseType: !285, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !530, file: !570, line: 18, baseType: !285, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !530, file: !570, line: 19, baseType: !285, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !530, file: !570, line: 20, baseType: !285, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !530, file: !570, line: 22, baseType: !285, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !530, file: !570, line: 23, baseType: !285, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !530, file: !570, line: 24, baseType: !285, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !530, file: !570, line: 25, baseType: !285, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !530, file: !570, line: 26, baseType: !285, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !530, file: !570, line: 31, baseType: !592, size: 64, align: 64, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!222, !528}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !205, file: !209, line: 70, baseType: !596, size: 64, align: 64, offset: 2048)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!599, !202, !501}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !204, line: 110, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !602, line: 15, size: 960, align: 64, elements: !603)
!602 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !618, !619, !620, !621}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !534, line: 3, baseType: !201, size: 32, align: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !601, file: !534, line: 4, baseType: !201, size: 32, align: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !601, file: !534, line: 5, baseType: !475, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !601, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !601, file: !534, line: 8, baseType: !202, size: 64, align: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !601, file: !534, line: 9, baseType: !222, size: 64, align: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !534, line: 10, baseType: !222, size: 64, align: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !601, file: !534, line: 11, baseType: !447, size: 64, align: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !601, file: !534, line: 12, baseType: !201, size: 32, align: 32, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !601, file: !534, line: 13, baseType: !222, size: 64, align: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !601, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !601, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !601, file: !617, line: 5, baseType: !222, size: 64, align: 64, offset: 704)
!617 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !601, file: !617, line: 6, baseType: !222, size: 64, align: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !601, file: !617, line: 7, baseType: !447, size: 64, align: 64, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !601, file: !617, line: 9, baseType: !285, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !601, file: !617, line: 11, baseType: !285, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !205, file: !209, line: 71, baseType: !623, size: 64, align: 64, offset: 2112)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!201, !501, !501}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !205, file: !209, line: 73, baseType: !623, size: 64, align: 64, offset: 2176)
!627 = !{i32 2, !"Dwarf Version", i32 4}
!628 = !{i32 2, !"Debug Info Version", i32 3}
!629 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!630 = distinct !DISubprogram(name: "fe_ctcp_init", scope: !631, file: !631, line: 144, type: !363, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !632)
!631 = !DIFile(filename: "fe-ctcp.c", directory: "/home/lichi/Desktop/irssi/task1")
!632 = !{}
!633 = !DILocation(line: 146, column: 2, scope: !630)
!634 = !DILocation(line: 147, column: 2, scope: !630)
!635 = !DILocation(line: 148, column: 2, scope: !630)
!636 = !DILocation(line: 149, column: 2, scope: !630)
!637 = !DILocation(line: 150, column: 2, scope: !630)
!638 = !DILocation(line: 151, column: 2, scope: !630)
!639 = !DILocation(line: 152, column: 2, scope: !630)
!640 = !DILocation(line: 153, column: 2, scope: !630)
!641 = !DILocation(line: 154, column: 1, scope: !630)
!642 = distinct !DISubprogram(name: "ctcp_default_msg", scope: !631, file: !631, line: 36, type: !643, isLocal: true, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !632)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !645, !501, !501, !501, !501}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !647, line: 6, baseType: !648)
!647 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !647, line: 6, flags: DIFlagFwdDecl)
!649 = !DILocalVariable(name: "server", arg: 1, scope: !642, file: !631, line: 36, type: !645)
!650 = !DIExpression()
!651 = !DILocation(line: 36, column: 46, scope: !642)
!652 = !DILocalVariable(name: "data", arg: 2, scope: !642, file: !631, line: 36, type: !501)
!653 = !DILocation(line: 36, column: 66, scope: !642)
!654 = !DILocalVariable(name: "nick", arg: 3, scope: !642, file: !631, line: 37, type: !501)
!655 = !DILocation(line: 37, column: 21, scope: !642)
!656 = !DILocalVariable(name: "addr", arg: 4, scope: !642, file: !631, line: 37, type: !501)
!657 = !DILocation(line: 37, column: 39, scope: !642)
!658 = !DILocalVariable(name: "target", arg: 5, scope: !642, file: !631, line: 38, type: !501)
!659 = !DILocation(line: 38, column: 21, scope: !642)
!660 = !DILocalVariable(name: "p", scope: !642, file: !631, line: 40, type: !501)
!661 = !DILocation(line: 40, column: 21, scope: !642)
!662 = !DILocalVariable(name: "cmd", scope: !642, file: !631, line: 41, type: !222)
!663 = !DILocation(line: 41, column: 8, scope: !642)
!664 = !DILocation(line: 43, column: 13, scope: !642)
!665 = !DILocation(line: 43, column: 6, scope: !642)
!666 = !DILocation(line: 43, column: 4, scope: !642)
!667 = !DILocation(line: 44, column: 6, scope: !668)
!668 = distinct !DILexicalBlock(scope: !642, file: !631, line: 44, column: 6)
!669 = !DILocation(line: 44, column: 8, scope: !668)
!670 = !DILocation(line: 44, column: 6, scope: !642)
!671 = !DILocation(line: 45, column: 18, scope: !672)
!672 = distinct !DILexicalBlock(scope: !668, file: !631, line: 44, column: 16)
!673 = !DILocation(line: 45, column: 9, scope: !672)
!674 = !DILocation(line: 45, column: 7, scope: !672)
!675 = !DILocation(line: 46, column: 22, scope: !672)
!676 = !DILocation(line: 47, column: 2, scope: !672)
!677 = !DILocation(line: 48, column: 19, scope: !678)
!678 = distinct !DILexicalBlock(scope: !668, file: !631, line: 47, column: 9)
!679 = !DILocation(line: 48, column: 32, scope: !678)
!680 = !DILocation(line: 48, column: 34, scope: !678)
!681 = !DILocation(line: 48, column: 33, scope: !678)
!682 = !DILocation(line: 48, column: 25, scope: !678)
!683 = !DILocation(line: 48, column: 9, scope: !678)
