; ModuleID = './line172-dcc-resume.o.i'
source_filename = "./line172-dcc-resume.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type opaque
%struct.DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable* }
%struct.CHAT_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i8*, %struct._NET_SENDBUF_REC*, i8 }
%struct._NET_SENDBUF_REC = type opaque
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42)
!1 = !DIFile(filename: "line172-dcc-resume.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 12, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "dcc-get.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "DCC_GET_DEFAULT", value: 0)
!39 = !DIEnumerator(name: "DCC_GET_RENAME", value: 1)
!40 = !DIEnumerator(name: "DCC_GET_OVERWRITE", value: 2)
!41 = !DIEnumerator(name: "DCC_GET_RESUME", value: 3)
!42 = !{!43, !50, !51, !359, !385, !388, !149, !424, !192, !426, !319}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !44, line: 9, baseType: !45)
!44 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !48, !48, !48, !48, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEND_DCC_REC", file: !53, line: 20, baseType: !54)
!53 = !DIFile(filename: "dcc-send.h", directory: "/home/lichi/Desktop/irssi/task1")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 12, size: 1920, align: 64, elements: !55)
!55 = !{!56, !59, !60, !66, !71, !74, !75, !76, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !350, !351, !352, !353, !355, !356, !357, !358}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !57, line: 1, baseType: !58, size: 32, align: 32)
!57 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !54, file: !57, line: 2, baseType: !58, size: 32, align: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !54, file: !57, line: 3, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !62, line: 75, baseType: !63)
!62 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !64, line: 139, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!65 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !54, file: !57, line: 5, baseType: !67, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !69, line: 6, baseType: !70)
!69 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !69, line: 6, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !54, file: !57, line: 6, baseType: !72, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !54, file: !57, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !54, file: !57, line: 8, baseType: !72, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !54, file: !57, line: 10, baseType: !77, size: 64, align: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !79, line: 9, baseType: !80)
!79 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !81, line: 12, size: 1792, align: 64, elements: !82)
!81 = !DIFile(filename: "dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !126, !130, !131, !314, !315, !316, !317, !318, !320, !321, !322, !327, !328, !332, !333}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !57, line: 1, baseType: !58, size: 32, align: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !80, file: !57, line: 2, baseType: !58, size: 32, align: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !80, file: !57, line: 3, baseType: !61, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !80, file: !57, line: 5, baseType: !67, size: 64, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !80, file: !57, line: 6, baseType: !72, size: 64, align: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !80, file: !57, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !80, file: !57, line: 8, baseType: !72, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !80, file: !57, line: 10, baseType: !77, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !80, file: !57, line: 11, baseType: !72, size: 64, align: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !80, file: !57, line: 12, baseType: !72, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !80, file: !57, line: 14, baseType: !94, size: 160, align: 32, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !95, line: 99, baseType: !96)
!95 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !97, line: 22, size: 160, align: 32, elements: !98)
!97 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !96, file: !97, line: 23, baseType: !100, size: 16, align: 16)
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !96, file: !97, line: 24, baseType: !102, size: 128, align: 32, offset: 32)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !103, line: 211, size: 128, align: 32, elements: !104)
!103 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !102, file: !103, line: 220, baseType: !106, size: 128, align: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !102, file: !103, line: 213, size: 128, align: 32, elements: !107)
!107 = !{!108, !115, !120}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !106, file: !103, line: 215, baseType: !109, size: 128, align: 8)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, align: 8, elements: !113)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !111, line: 48, baseType: !112)
!111 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!113 = !{!114}
!114 = !DISubrange(count: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !106, file: !103, line: 217, baseType: !116, size: 128, align: 16)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, align: 16, elements: !118)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !111, line: 49, baseType: !100)
!118 = !{!119}
!119 = !DISubrange(count: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !106, file: !103, line: 218, baseType: !121, size: 128, align: 32)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 128, align: 32, elements: !124)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !111, line: 51, baseType: !123)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !{!125}
!125 = !DISubrange(count: 4)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !80, file: !57, line: 15, baseType: !127, size: 368, align: 8, offset: 736)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 368, align: 8, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 46)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !80, file: !57, line: 16, baseType: !58, size: 32, align: 32, offset: 1120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !80, file: !57, line: 18, baseType: !132, size: 64, align: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !135)
!135 = !{!136, !139, !281, !282, !287, !288, !289, !290, !291, !300, !301, !302, !306, !307, !308, !309, !310, !311, !312, !313}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !134, file: !4, line: 100, baseType: !137, size: 32, align: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !138, line: 49, baseType: !58)
!138 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !134, file: !4, line: 101, baseType: !140, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !143)
!143 = !{!144, !167, !173, !179, !183, !268, !272, !277}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !142, file: !4, line: 133, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !132, !149, !151, !154, !155}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !138, line: 46, baseType: !73)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !152, line: 66, baseType: !153)
!152 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!153 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !158, line: 42, baseType: !159)
!158 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !158, line: 44, size: 128, align: 64, elements: !160)
!160 = !{!161, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !159, file: !158, line: 46, baseType: !162, size: 32, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !163, line: 36, baseType: !164)
!163 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !152, line: 45, baseType: !123)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !159, file: !158, line: 47, baseType: !137, size: 32, align: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !159, file: !158, line: 48, baseType: !149, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !142, file: !4, line: 138, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!148, !132, !171, !151, !154, !155}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !142, file: !4, line: 143, baseType: !174, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!148, !132, !177, !178, !155}
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !152, line: 51, baseType: !65)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !142, file: !4, line: 147, baseType: !180, size: 64, align: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!148, !132, !155}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !142, file: !4, line: 149, baseType: !184, size: 64, align: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !132, !267}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !190)
!190 = !{!191, !193, !214, !243, !245, !249, !250, !251, !252, !260, !261, !262, !263}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !189, file: !16, line: 174, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !138, line: 77, baseType: !50)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !189, file: !16, line: 175, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !197)
!197 = !{!198, !202, !203}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !196, file: !16, line: 198, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !192}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !196, file: !16, line: 199, baseType: !199, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !196, file: !16, line: 200, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !192, !187, !207, !213}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !192}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !138, line: 50, baseType: !137)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !189, file: !16, line: 177, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !219)
!219 = !{!220, !225, !229, !233, !237, !238}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !218, file: !16, line: 216, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!212, !187, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !218, file: !16, line: 218, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!212, !187}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !218, file: !16, line: 219, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!212, !187, !208, !192}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !218, file: !16, line: 222, baseType: !234, size: 64, align: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !187}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !218, file: !16, line: 226, baseType: !208, size: 64, align: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !218, file: !16, line: 227, baseType: !239, size: 64, align: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !189, file: !16, line: 178, baseType: !244, size: 32, align: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !138, line: 55, baseType: !123)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !189, file: !16, line: 180, baseType: !246, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !189, file: !16, line: 182, baseType: !137, size: 32, align: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !16, line: 183, baseType: !244, size: 32, align: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !189, file: !16, line: 184, baseType: !244, size: 32, align: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !189, file: !16, line: 186, baseType: !253, size: 64, align: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !255, line: 37, baseType: !256)
!255 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !255, line: 39, size: 128, align: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !256, file: !255, line: 41, baseType: !192, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !255, line: 42, baseType: !253, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !189, file: !16, line: 188, baseType: !187, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !16, line: 189, baseType: !187, size: 64, align: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !189, file: !16, line: 191, baseType: !72, size: 64, align: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !189, file: !16, line: 193, baseType: !264, size: 64, align: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !142, file: !4, line: 151, baseType: !269, size: 64, align: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !132}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !142, file: !4, line: 152, baseType: !273, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!148, !132, !276, !155}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !142, file: !4, line: 155, baseType: !278, size: 64, align: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!276, !132}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !134, file: !4, line: 103, baseType: !149, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !134, file: !4, line: 104, baseType: !283, size: 64, align: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !284, line: 77, baseType: !285)
!284 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !284, line: 77, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !134, file: !4, line: 105, baseType: !283, size: 64, align: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !134, file: !4, line: 106, baseType: !149, size: 64, align: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !134, file: !4, line: 107, baseType: !244, size: 32, align: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !134, file: !4, line: 109, baseType: !151, size: 64, align: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !134, file: !4, line: 110, baseType: !292, size: 64, align: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !294, line: 39, baseType: !295)
!294 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !294, line: 41, size: 192, align: 64, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !295, file: !294, line: 43, baseType: !149, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !294, line: 44, baseType: !151, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !295, file: !294, line: 45, baseType: !151, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !134, file: !4, line: 111, baseType: !292, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !134, file: !4, line: 112, baseType: !292, size: 64, align: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !134, file: !4, line: 113, baseType: !303, size: 48, align: 8, offset: 704)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 48, align: 8, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 6)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !134, file: !4, line: 117, baseType: !244, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !134, file: !4, line: 118, baseType: !244, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !134, file: !4, line: 119, baseType: !244, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !134, file: !4, line: 120, baseType: !244, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !134, file: !4, line: 121, baseType: !244, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !134, file: !4, line: 122, baseType: !244, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !134, file: !4, line: 124, baseType: !192, size: 64, align: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !134, file: !4, line: 125, baseType: !192, size: 64, align: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !80, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !80, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1248)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !80, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1280)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !80, file: !57, line: 20, baseType: !61, size: 64, align: 64, offset: 1344)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !80, file: !57, line: 21, baseType: !319, size: 64, align: 64, offset: 1408)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !95, line: 49, baseType: !153)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !80, file: !57, line: 23, baseType: !58, size: 32, align: 32, offset: 1472)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !80, file: !57, line: 25, baseType: !123, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !80, file: !57, line: 27, baseType: !323, size: 64, align: 64, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !325, line: 37, baseType: !326)
!325 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !325, line: 37, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !81, line: 15, baseType: !72, size: 64, align: 64, offset: 1600)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !80, file: !81, line: 16, baseType: !329, size: 64, align: 64, offset: 1664)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !95, line: 102, baseType: !331)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !95, line: 102, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !80, file: !81, line: 18, baseType: !123, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !80, file: !81, line: 19, baseType: !123, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !54, file: !57, line: 11, baseType: !72, size: 64, align: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !54, file: !57, line: 12, baseType: !72, size: 64, align: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !54, file: !57, line: 14, baseType: !94, size: 160, align: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !54, file: !57, line: 15, baseType: !127, size: 368, align: 8, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !54, file: !57, line: 16, baseType: !58, size: 32, align: 32, offset: 1120)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !54, file: !57, line: 18, baseType: !132, size: 64, align: 64, offset: 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !54, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !54, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !54, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !54, file: !57, line: 20, baseType: !61, size: 64, align: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !54, file: !57, line: 21, baseType: !319, size: 64, align: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !54, file: !57, line: 23, baseType: !58, size: 32, align: 32, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !54, file: !57, line: 25, baseType: !123, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !54, file: !57, line: 27, baseType: !323, size: 64, align: 64, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1600)
!349 = !DIFile(filename: "dcc-file-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !54, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1664)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !54, file: !349, line: 4, baseType: !58, size: 32, align: 32, offset: 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !54, file: !349, line: 5, baseType: !58, size: 32, align: 32, offset: 1760)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !54, file: !349, line: 8, baseType: !354, size: 32, align: 8, offset: 1792)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, align: 8, elements: !124)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !54, file: !349, line: 9, baseType: !58, size: 32, align: 32, offset: 1824)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "file_quoted", scope: !54, file: !53, line: 15, baseType: !123, size: 1, align: 32, offset: 1856, flags: DIFlagBitField, extraData: i64 1856)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "waitforend", scope: !54, file: !53, line: 18, baseType: !123, size: 1, align: 32, offset: 1857, flags: DIFlagBitField, extraData: i64 1856)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gotalldata", scope: !54, file: !53, line: 19, baseType: !123, size: 1, align: 32, offset: 1858, flags: DIFlagBitField, extraData: i64 1856)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !79, line: 13, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 11, size: 1600, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !57, line: 1, baseType: !58, size: 32, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !361, file: !57, line: 2, baseType: !58, size: 32, align: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !361, file: !57, line: 3, baseType: !61, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !361, file: !57, line: 5, baseType: !67, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !361, file: !57, line: 6, baseType: !72, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !361, file: !57, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !361, file: !57, line: 8, baseType: !72, size: 64, align: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !361, file: !57, line: 10, baseType: !77, size: 64, align: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !361, file: !57, line: 11, baseType: !72, size: 64, align: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !361, file: !57, line: 12, baseType: !72, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !361, file: !57, line: 14, baseType: !94, size: 160, align: 32, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !361, file: !57, line: 15, baseType: !127, size: 368, align: 8, offset: 736)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !361, file: !57, line: 16, baseType: !58, size: 32, align: 32, offset: 1120)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !361, file: !57, line: 18, baseType: !132, size: 64, align: 64, offset: 1152)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !361, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !361, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1248)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !361, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1280)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !361, file: !57, line: 20, baseType: !61, size: 64, align: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !361, file: !57, line: 21, baseType: !319, size: 64, align: 64, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !361, file: !57, line: 23, baseType: !58, size: 32, align: 32, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !361, file: !57, line: 25, baseType: !123, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !361, file: !57, line: 27, baseType: !323, size: 64, align: 64, offset: 1536)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !386, line: 90, baseType: !387)
!386 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 131, baseType: !65)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GET_DCC_REC", file: !36, line: 28, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 20, size: 2048, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !57, line: 1, baseType: !58, size: 32, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !390, file: !57, line: 2, baseType: !58, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !390, file: !57, line: 3, baseType: !61, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !390, file: !57, line: 5, baseType: !67, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !390, file: !57, line: 6, baseType: !72, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !390, file: !57, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !390, file: !57, line: 8, baseType: !72, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !390, file: !57, line: 10, baseType: !77, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !390, file: !57, line: 11, baseType: !72, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !390, file: !57, line: 12, baseType: !72, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !390, file: !57, line: 14, baseType: !94, size: 160, align: 32, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !390, file: !57, line: 15, baseType: !127, size: 368, align: 8, offset: 736)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !390, file: !57, line: 16, baseType: !58, size: 32, align: 32, offset: 1120)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !390, file: !57, line: 18, baseType: !132, size: 64, align: 64, offset: 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !390, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !390, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1248)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !390, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !390, file: !57, line: 20, baseType: !61, size: 64, align: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !390, file: !57, line: 21, baseType: !319, size: 64, align: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !390, file: !57, line: 23, baseType: !58, size: 32, align: 32, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !390, file: !57, line: 25, baseType: !123, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !390, file: !57, line: 27, baseType: !323, size: 64, align: 64, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1600)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !390, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1664)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !390, file: !349, line: 4, baseType: !58, size: 32, align: 32, offset: 1728)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !390, file: !349, line: 5, baseType: !58, size: 32, align: 32, offset: 1760)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !390, file: !349, line: 8, baseType: !354, size: 32, align: 8, offset: 1792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !390, file: !349, line: 9, baseType: !58, size: 32, align: 32, offset: 1824)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "get_type", scope: !390, file: !36, line: 23, baseType: !58, size: 32, align: 32, offset: 1856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !390, file: !36, line: 24, baseType: !72, size: 64, align: 64, offset: 1920)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "file_quoted", scope: !390, file: !36, line: 26, baseType: !123, size: 1, align: 32, offset: 1984, flags: DIFlagBitField, extraData: i64 1984)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "from_dccserver", scope: !390, file: !36, line: 27, baseType: !123, size: 1, align: 32, offset: 1985, flags: DIFlagBitField, extraData: i64 1984)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !138, line: 48, baseType: !65)
!427 = !{i32 2, !"Dwarf Version", i32 4}
!428 = !{i32 2, !"Debug Info Version", i32 3}
!429 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!430 = distinct !DISubprogram(name: "get_file_params_count_resume", scope: !431, file: !431, line: 58, type: !432, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !435)
!431 = !DIFile(filename: "dcc-resume.c", directory: "/home/lichi/Desktop/irssi/task1")
!432 = !DISubroutineType(types: !433)
!433 = !{!58, !434, !58}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!435 = !{}
!436 = !DILocalVariable(name: "params", arg: 1, scope: !430, file: !431, line: 58, type: !434)
!437 = !DIExpression()
!438 = !DILocation(line: 58, column: 41, scope: !430)
!439 = !DILocalVariable(name: "paramcount", arg: 2, scope: !430, file: !431, line: 58, type: !58)
!440 = !DILocation(line: 58, column: 53, scope: !430)
!441 = !DILocalVariable(name: "pos", scope: !430, file: !431, line: 60, type: !58)
!442 = !DILocation(line: 60, column: 6, scope: !430)
!443 = !DILocalVariable(name: "best", scope: !430, file: !431, line: 60, type: !58)
!444 = !DILocation(line: 60, column: 11, scope: !430)
!445 = !DILocation(line: 62, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !430, file: !431, line: 62, column: 6)
!447 = !DILocation(line: 62, column: 6, scope: !446)
!448 = !DILocation(line: 62, column: 17, scope: !446)
!449 = !DILocation(line: 62, column: 6, scope: !430)
!450 = !DILocation(line: 64, column: 12, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !431, line: 64, column: 3)
!452 = distinct !DILexicalBlock(scope: !446, file: !431, line: 62, column: 25)
!453 = !DILocation(line: 64, column: 8, scope: !451)
!454 = !DILocation(line: 64, column: 17, scope: !455)
!455 = !DILexicalBlockFile(scope: !456, file: !431, discriminator: 1)
!456 = distinct !DILexicalBlock(scope: !451, file: !431, line: 64, column: 3)
!457 = !DILocation(line: 64, column: 23, scope: !455)
!458 = !DILocation(line: 64, column: 33, scope: !455)
!459 = !DILocation(line: 64, column: 21, scope: !455)
!460 = !DILocation(line: 64, column: 3, scope: !455)
!461 = !DILocation(line: 65, column: 22, scope: !462)
!462 = distinct !DILexicalBlock(scope: !463, file: !431, line: 65, column: 8)
!463 = distinct !DILexicalBlock(scope: !456, file: !431, line: 64, column: 44)
!464 = !DILocation(line: 65, column: 15, scope: !462)
!465 = !DILocation(line: 65, column: 8, scope: !462)
!466 = !DILocation(line: 65, column: 28, scope: !462)
!467 = !DILocation(line: 65, column: 8, scope: !463)
!468 = !DILocation(line: 66, column: 5, scope: !462)
!469 = !DILocation(line: 67, column: 34, scope: !470)
!470 = distinct !DILexicalBlock(scope: !463, file: !431, line: 67, column: 8)
!471 = !DILocation(line: 67, column: 27, scope: !470)
!472 = !DILocation(line: 67, column: 20, scope: !470)
!473 = !DILocation(line: 67, column: 39, scope: !470)
!474 = !DILocation(line: 67, column: 15, scope: !470)
!475 = !DILocation(line: 67, column: 8, scope: !470)
!476 = !DILocation(line: 67, column: 43, scope: !470)
!477 = !DILocation(line: 67, column: 50, scope: !470)
!478 = !DILocation(line: 68, column: 27, scope: !470)
!479 = !DILocation(line: 68, column: 30, scope: !470)
!480 = !DILocation(line: 68, column: 20, scope: !470)
!481 = !DILocation(line: 68, column: 9, scope: !470)
!482 = !DILocation(line: 68, column: 41, scope: !470)
!483 = !DILocation(line: 68, column: 56, scope: !484)
!484 = !DILexicalBlockFile(scope: !470, file: !431, discriminator: 1)
!485 = !DILocation(line: 68, column: 59, scope: !484)
!486 = !DILocation(line: 68, column: 49, scope: !484)
!487 = !DILocation(line: 68, column: 44, scope: !484)
!488 = !DILocation(line: 68, column: 64, scope: !484)
!489 = !DILocation(line: 68, column: 72, scope: !484)
!490 = !DILocation(line: 68, column: 94, scope: !491)
!491 = !DILexicalBlockFile(scope: !470, file: !431, discriminator: 2)
!492 = !DILocation(line: 68, column: 97, scope: !491)
!493 = !DILocation(line: 68, column: 100, scope: !491)
!494 = !DILocation(line: 68, column: 86, scope: !491)
!495 = !DILocation(line: 68, column: 75, scope: !491)
!496 = !DILocation(line: 67, column: 8, scope: !497)
!497 = !DILexicalBlockFile(scope: !463, file: !431, discriminator: 1)
!498 = !DILocation(line: 69, column: 12, scope: !470)
!499 = !DILocation(line: 69, column: 15, scope: !470)
!500 = !DILocation(line: 69, column: 5, scope: !470)
!501 = !DILocation(line: 70, column: 3, scope: !463)
!502 = !DILocation(line: 64, column: 40, scope: !503)
!503 = !DILexicalBlockFile(scope: !456, file: !431, discriminator: 2)
!504 = !DILocation(line: 64, column: 3, scope: !503)
!505 = distinct !{!505, !506}
!506 = !DILocation(line: 64, column: 3, scope: !452)
!507 = !DILocation(line: 71, column: 2, scope: !452)
!508 = !DILocation(line: 73, column: 9, scope: !430)
!509 = !DILocation(line: 73, column: 19, scope: !430)
!510 = !DILocation(line: 73, column: 7, scope: !430)
!511 = !DILocation(line: 74, column: 13, scope: !512)
!512 = distinct !DILexicalBlock(scope: !430, file: !431, line: 74, column: 2)
!513 = !DILocation(line: 74, column: 23, scope: !512)
!514 = !DILocation(line: 74, column: 11, scope: !512)
!515 = !DILocation(line: 74, column: 7, scope: !512)
!516 = !DILocation(line: 74, column: 27, scope: !517)
!517 = !DILexicalBlockFile(scope: !518, file: !431, discriminator: 1)
!518 = distinct !DILexicalBlock(scope: !512, file: !431, line: 74, column: 2)
!519 = !DILocation(line: 74, column: 31, scope: !517)
!520 = !DILocation(line: 74, column: 2, scope: !517)
!521 = !DILocation(line: 75, column: 26, scope: !522)
!522 = distinct !DILexicalBlock(scope: !523, file: !431, line: 75, column: 7)
!523 = distinct !DILexicalBlock(scope: !518, file: !431, line: 74, column: 43)
!524 = !DILocation(line: 75, column: 19, scope: !522)
!525 = !DILocation(line: 75, column: 8, scope: !522)
!526 = !DILocation(line: 75, column: 38, scope: !522)
!527 = !DILocation(line: 75, column: 53, scope: !528)
!528 = !DILexicalBlockFile(scope: !522, file: !431, discriminator: 1)
!529 = !DILocation(line: 75, column: 46, scope: !528)
!530 = !DILocation(line: 75, column: 41, scope: !528)
!531 = !DILocation(line: 75, column: 59, scope: !528)
!532 = !DILocation(line: 75, column: 67, scope: !528)
!533 = !DILocation(line: 75, column: 89, scope: !534)
!534 = !DILexicalBlockFile(scope: !522, file: !431, discriminator: 2)
!535 = !DILocation(line: 75, column: 93, scope: !534)
!536 = !DILocation(line: 75, column: 81, scope: !534)
!537 = !DILocation(line: 75, column: 70, scope: !534)
!538 = !DILocation(line: 75, column: 7, scope: !534)
!539 = !DILocation(line: 76, column: 11, scope: !522)
!540 = !DILocation(line: 76, column: 9, scope: !522)
!541 = !DILocation(line: 76, column: 4, scope: !522)
!542 = !DILocation(line: 77, column: 2, scope: !523)
!543 = !DILocation(line: 74, column: 39, scope: !544)
!544 = !DILexicalBlockFile(scope: !518, file: !431, discriminator: 2)
!545 = !DILocation(line: 74, column: 2, scope: !544)
!546 = distinct !{!546, !547}
!547 = !DILocation(line: 74, column: 2, scope: !430)
!548 = !DILocation(line: 79, column: 9, scope: !430)
!549 = !DILocation(line: 79, column: 2, scope: !430)
!550 = !DILocation(line: 80, column: 1, scope: !430)
!551 = distinct !DISubprogram(name: "dcc_resume_init", scope: !431, file: !431, line: 234, type: !241, isLocal: false, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !435)
!552 = !DILocation(line: 236, column: 2, scope: !551)
!553 = !DILocation(line: 237, column: 2, scope: !551)
!554 = !DILocation(line: 238, column: 2, scope: !551)
!555 = !DILocation(line: 239, column: 1, scope: !551)
!556 = distinct !DISubprogram(name: "ctcp_msg_dcc_resume", scope: !431, file: !431, line: 133, type: !557, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !435)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !67, !424, !424, !424, !424, !359}
!559 = !DILocalVariable(name: "server", arg: 1, scope: !556, file: !431, line: 133, type: !67)
!560 = !DILocation(line: 133, column: 49, scope: !556)
!561 = !DILocalVariable(name: "data", arg: 2, scope: !556, file: !431, line: 133, type: !424)
!562 = !DILocation(line: 133, column: 69, scope: !556)
!563 = !DILocalVariable(name: "nick", arg: 3, scope: !556, file: !431, line: 134, type: !424)
!564 = !DILocation(line: 134, column: 17, scope: !556)
!565 = !DILocalVariable(name: "addr", arg: 4, scope: !556, file: !431, line: 134, type: !424)
!566 = !DILocation(line: 134, column: 35, scope: !556)
!567 = !DILocalVariable(name: "target", arg: 5, scope: !556, file: !431, line: 135, type: !424)
!568 = !DILocation(line: 135, column: 17, scope: !556)
!569 = !DILocalVariable(name: "chat", arg: 6, scope: !556, file: !431, line: 135, type: !359)
!570 = !DILocation(line: 135, column: 34, scope: !556)
!571 = !DILocalVariable(name: "dcc", scope: !556, file: !431, line: 137, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE_DCC_REC", file: !574, line: 8, baseType: !575)
!574 = !DIFile(filename: "dcc-file.h", directory: "/home/lichi/Desktop/irssi/task1")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !574, line: 6, size: 1856, align: 64, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !57, line: 1, baseType: !58, size: 32, align: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !575, file: !57, line: 2, baseType: !58, size: 32, align: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !575, file: !57, line: 3, baseType: !61, size: 64, align: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !575, file: !57, line: 5, baseType: !67, size: 64, align: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !575, file: !57, line: 6, baseType: !72, size: 64, align: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !575, file: !57, line: 7, baseType: !72, size: 64, align: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !575, file: !57, line: 8, baseType: !72, size: 64, align: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !575, file: !57, line: 10, baseType: !77, size: 64, align: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !575, file: !57, line: 11, baseType: !72, size: 64, align: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !575, file: !57, line: 12, baseType: !72, size: 64, align: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !575, file: !57, line: 14, baseType: !94, size: 160, align: 32, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !575, file: !57, line: 15, baseType: !127, size: 368, align: 8, offset: 736)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !575, file: !57, line: 16, baseType: !58, size: 32, align: 32, offset: 1120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !575, file: !57, line: 18, baseType: !132, size: 64, align: 64, offset: 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !575, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !575, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1248)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !575, file: !57, line: 19, baseType: !58, size: 32, align: 32, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !575, file: !57, line: 20, baseType: !61, size: 64, align: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !575, file: !57, line: 21, baseType: !319, size: 64, align: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !575, file: !57, line: 23, baseType: !58, size: 32, align: 32, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !575, file: !57, line: 25, baseType: !123, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !575, file: !57, line: 27, baseType: !323, size: 64, align: 64, offset: 1536)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !575, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1600)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !575, file: !349, line: 3, baseType: !319, size: 64, align: 64, offset: 1664)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !575, file: !349, line: 4, baseType: !58, size: 32, align: 32, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !575, file: !349, line: 5, baseType: !58, size: 32, align: 32, offset: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !575, file: !349, line: 8, baseType: !354, size: 32, align: 8, offset: 1792)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !575, file: !349, line: 9, baseType: !58, size: 32, align: 32, offset: 1824)
!605 = !DILocation(line: 137, column: 16, scope: !556)
!606 = !DILocalVariable(name: "str", scope: !556, file: !431, line: 138, type: !72)
!607 = !DILocation(line: 138, column: 15, scope: !556)
!608 = !DILocalVariable(name: "size", scope: !556, file: !431, line: 139, type: !319)
!609 = !DILocation(line: 139, column: 9, scope: !556)
!610 = !DILocalVariable(name: "pasv_id", scope: !556, file: !431, line: 140, type: !58)
!611 = !DILocation(line: 140, column: 6, scope: !556)
!612 = !DILocation(line: 142, column: 29, scope: !613)
!613 = distinct !DILexicalBlock(scope: !556, file: !431, line: 142, column: 6)
!614 = !DILocation(line: 142, column: 68, scope: !613)
!615 = !DILocation(line: 142, column: 74, scope: !613)
!616 = !DILocation(line: 142, column: 7, scope: !617)
!617 = !DILexicalBlockFile(scope: !613, file: !431, discriminator: 1)
!618 = !DILocation(line: 142, column: 7, scope: !613)
!619 = !DILocation(line: 142, column: 6, scope: !556)
!620 = !DILocation(line: 143, column: 46, scope: !621)
!621 = distinct !DILexicalBlock(scope: !613, file: !431, line: 142, column: 104)
!622 = !DILocation(line: 144, column: 8, scope: !621)
!623 = !DILocation(line: 144, column: 14, scope: !621)
!624 = !DILocation(line: 144, column: 20, scope: !621)
!625 = !DILocation(line: 143, column: 3, scope: !621)
!626 = !DILocation(line: 145, column: 2, scope: !621)
!627 = !DILocation(line: 145, column: 13, scope: !628)
!628 = !DILexicalBlockFile(scope: !629, file: !431, discriminator: 1)
!629 = distinct !DILexicalBlock(scope: !613, file: !431, line: 145, column: 13)
!630 = !DILocation(line: 145, column: 17, scope: !628)
!631 = !DILocation(line: 145, column: 24, scope: !628)
!632 = !DILocation(line: 145, column: 49, scope: !633)
!633 = !DILexicalBlockFile(scope: !629, file: !431, discriminator: 2)
!634 = !DILocation(line: 145, column: 54, scope: !633)
!635 = !DILocation(line: 145, column: 62, scope: !633)
!636 = !DILocation(line: 145, column: 27, scope: !633)
!637 = !DILocation(line: 145, column: 13, scope: !633)
!638 = !DILocation(line: 146, column: 10, scope: !639)
!639 = distinct !DILexicalBlock(scope: !640, file: !431, line: 146, column: 7)
!640 = distinct !DILexicalBlock(scope: !629, file: !431, line: 145, column: 69)
!641 = !DILocation(line: 146, column: 16, scope: !639)
!642 = !DILocation(line: 146, column: 24, scope: !639)
!643 = !DILocation(line: 146, column: 7, scope: !640)
!644 = !DILocation(line: 147, column: 69, scope: !645)
!645 = distinct !DILexicalBlock(scope: !639, file: !431, line: 146, column: 31)
!646 = !DILocation(line: 147, column: 44, scope: !645)
!647 = !DILocation(line: 147, column: 27, scope: !645)
!648 = !DILocation(line: 147, column: 26, scope: !645)
!649 = !DILocation(line: 150, column: 12, scope: !645)
!650 = !DILocation(line: 150, column: 17, scope: !645)
!651 = !DILocation(line: 150, column: 22, scope: !645)
!652 = !DILocation(line: 150, column: 27, scope: !645)
!653 = !DILocation(line: 150, column: 33, scope: !645)
!654 = !DILocation(line: 150, column: 38, scope: !645)
!655 = !DILocation(line: 147, column: 10, scope: !656)
!656 = !DILexicalBlockFile(scope: !645, file: !431, discriminator: 1)
!657 = !DILocation(line: 147, column: 8, scope: !645)
!658 = !DILocation(line: 151, column: 3, scope: !645)
!659 = !DILocation(line: 152, column: 69, scope: !660)
!660 = distinct !DILexicalBlock(scope: !639, file: !431, line: 151, column: 10)
!661 = !DILocation(line: 152, column: 44, scope: !660)
!662 = !DILocation(line: 152, column: 27, scope: !660)
!663 = !DILocation(line: 152, column: 26, scope: !660)
!664 = !DILocation(line: 155, column: 12, scope: !660)
!665 = !DILocation(line: 155, column: 17, scope: !660)
!666 = !DILocation(line: 155, column: 22, scope: !660)
!667 = !DILocation(line: 155, column: 27, scope: !660)
!668 = !DILocation(line: 155, column: 36, scope: !660)
