; ModuleID = './line194-notify-ison.o.i'
source_filename = "./line194-notify-ison.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.NOTIFY_NICK_REC = type { i8*, i8*, i8*, i8*, i8*, i8, i64 }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !685)
!1 = !DIFile(filename: "line194-notify-ison.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !59, !60, !67, !76, !80, !82, !84, !378}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "NOTIFY_NICK_REC", file: !38, line: 17, baseType: !39)
!38 = !DIFile(filename: "module.h", directory: "/home/lichi/Desktop/irssi/task1")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 6, size: 448, align: 64, elements: !40)
!40 = !{!41, !44, !45, !46, !47, !48, !50, !51, !52, !53}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !39, file: !38, line: 7, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !39, file: !38, line: 8, baseType: !42, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !39, file: !38, line: 8, baseType: !42, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !39, file: !38, line: 8, baseType: !42, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "awaymsg", scope: !39, file: !38, line: 8, baseType: !42, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "host_ok", scope: !39, file: !38, line: 10, baseType: !49, size: 1, align: 32, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "away_ok", scope: !39, file: !38, line: 11, baseType: !49, size: 1, align: 32, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "away", scope: !39, file: !38, line: 13, baseType: !49, size: 1, align: 32, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "join_announced", scope: !39, file: !38, line: 14, baseType: !49, size: 1, align: 32, offset: 323, flags: DIFlagBitField, extraData: i64 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "last_whois", scope: !39, file: !38, line: 16, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !55, line: 75, baseType: !56)
!55 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !57, line: 139, baseType: !58)
!57 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !61, line: 9, baseType: !62)
!61 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !65, !65, !65, !65, !65}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !75}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !72, line: 50, baseType: !73)
!72 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !72, line: 49, baseType: !74)
!74 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !72, line: 77, baseType: !59)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !72, line: 88, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !75, !75}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !72, line: 46, baseType: !43)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !86, line: 6, baseType: !87)
!86 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !88, line: 42, size: 39168, align: 64, elements: !89)
!88 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !{!90, !92, !93, !94, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !340, !341, !345, !346, !347, !351, !356, !357, !358, !359, !360, !361, !362, !363, !370, !371, !372, !373, !374, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !682, !684}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !91, line: 3, baseType: !74, size: 32, align: 32)
!91 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !87, file: !91, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !87, file: !91, line: 6, baseType: !74, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !87, file: !91, line: 8, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !86, line: 5, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !88, line: 24, size: 2496, align: 64, elements: !98)
!98 = !{!99, !101, !102, !103, !104, !105, !106, !107, !108, !110, !111, !112, !113, !114, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !100, line: 3, baseType: !74, size: 32, align: 32)
!100 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !97, file: !100, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !97, file: !100, line: 6, baseType: !74, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !97, file: !100, line: 9, baseType: !42, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !97, file: !100, line: 10, baseType: !74, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !97, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !97, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !97, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !97, file: !100, line: 13, baseType: !109, size: 16, align: 16, offset: 448)
!109 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !97, file: !100, line: 14, baseType: !42, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !97, file: !100, line: 15, baseType: !42, size: 64, align: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !97, file: !100, line: 16, baseType: !74, size: 32, align: 32, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !97, file: !100, line: 17, baseType: !42, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !97, file: !100, line: 19, baseType: !115, size: 64, align: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !117, line: 99, baseType: !118)
!117 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !117, line: 99, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !97, file: !100, line: 19, baseType: !115, size: 64, align: 64, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !97, file: !100, line: 21, baseType: !42, size: 64, align: 64, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !97, file: !100, line: 22, baseType: !42, size: 64, align: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !97, file: !100, line: 23, baseType: !42, size: 64, align: 64, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !97, file: !100, line: 24, baseType: !42, size: 64, align: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !97, file: !100, line: 26, baseType: !42, size: 64, align: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !97, file: !100, line: 27, baseType: !42, size: 64, align: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !97, file: !100, line: 28, baseType: !42, size: 64, align: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !97, file: !100, line: 29, baseType: !42, size: 64, align: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !97, file: !100, line: 30, baseType: !42, size: 64, align: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !97, file: !100, line: 31, baseType: !42, size: 64, align: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !97, file: !100, line: 32, baseType: !42, size: 64, align: 64, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !97, file: !100, line: 33, baseType: !42, size: 64, align: 64, offset: 1600)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !97, file: !100, line: 35, baseType: !133, size: 64, align: 64, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !136)
!136 = !{!137, !138, !272, !273, !278, !279, !280, !281, !282, !291, !292, !293, !297, !298, !299, !300, !301, !302, !303, !304}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !135, file: !4, line: 100, baseType: !73, size: 32, align: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !135, file: !4, line: 101, baseType: !139, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !142)
!142 = !{!143, !164, !170, !176, !180, !259, !263, !268}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !141, file: !4, line: 133, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !133, !80, !148, !151, !152}
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !149, line: 66, baseType: !150)
!149 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !155, line: 42, baseType: !156)
!155 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !155, line: 44, size: 128, align: 64, elements: !157)
!157 = !{!158, !162, !163}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !156, file: !155, line: 46, baseType: !159, size: 32, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !160, line: 36, baseType: !161)
!160 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !149, line: 45, baseType: !49)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !156, file: !155, line: 47, baseType: !73, size: 32, align: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !156, file: !155, line: 48, baseType: !80, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !141, file: !4, line: 138, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!147, !133, !168, !148, !151, !152}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !141, file: !4, line: 143, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!147, !133, !174, !175, !152}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !149, line: 51, baseType: !58)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !141, file: !4, line: 147, baseType: !177, size: 64, align: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!147, !133, !152}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !141, file: !4, line: 149, baseType: !181, size: 64, align: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !133, !258}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !187)
!187 = !{!188, !189, !205, !234, !236, !240, !241, !242, !243, !251, !252, !253, !254}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !186, file: !16, line: 174, baseType: !75, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !186, file: !16, line: 175, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !193)
!193 = !{!194, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !192, file: !16, line: 198, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !75}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !192, file: !16, line: 199, baseType: !195, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !192, file: !16, line: 200, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !75, !184, !203, !204}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !186, file: !16, line: 177, baseType: !206, size: 64, align: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !210)
!210 = !{!211, !216, !220, !224, !228, !229}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !209, file: !16, line: 216, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!71, !184, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !209, file: !16, line: 218, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!71, !184}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !209, file: !16, line: 219, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!71, !184, !67, !75}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !209, file: !16, line: 222, baseType: !225, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !184}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !209, file: !16, line: 226, baseType: !67, size: 64, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !209, file: !16, line: 227, baseType: !230, size: 64, align: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !186, file: !16, line: 178, baseType: !235, size: 32, align: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !72, line: 55, baseType: !49)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !186, file: !16, line: 180, baseType: !237, size: 64, align: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !186, file: !16, line: 182, baseType: !73, size: 32, align: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !16, line: 183, baseType: !235, size: 32, align: 32, offset: 352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !186, file: !16, line: 184, baseType: !235, size: 32, align: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !186, file: !16, line: 186, baseType: !244, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !246, line: 37, baseType: !247)
!246 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !246, line: 39, size: 128, align: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !246, line: 41, baseType: !75, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !246, line: 42, baseType: !244, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !16, line: 188, baseType: !184, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !16, line: 189, baseType: !184, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !16, line: 191, baseType: !42, size: 64, align: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !186, file: !16, line: 193, baseType: !255, size: 64, align: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !141, file: !4, line: 151, baseType: !260, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !133}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !141, file: !4, line: 152, baseType: !264, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!147, !133, !267, !152}
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !141, file: !4, line: 155, baseType: !269, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!267, !133}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !135, file: !4, line: 103, baseType: !80, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !135, file: !4, line: 104, baseType: !274, size: 64, align: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !275, line: 77, baseType: !276)
!275 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !275, line: 77, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !135, file: !4, line: 105, baseType: !274, size: 64, align: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !135, file: !4, line: 106, baseType: !80, size: 64, align: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !135, file: !4, line: 107, baseType: !235, size: 32, align: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !135, file: !4, line: 109, baseType: !148, size: 64, align: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !135, file: !4, line: 110, baseType: !283, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !285, line: 39, baseType: !286)
!285 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !285, line: 41, size: 192, align: 64, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !286, file: !285, line: 43, baseType: !80, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !286, file: !285, line: 44, baseType: !148, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !286, file: !285, line: 45, baseType: !148, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !135, file: !4, line: 111, baseType: !283, size: 64, align: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !135, file: !4, line: 112, baseType: !283, size: 64, align: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !135, file: !4, line: 113, baseType: !294, size: 48, align: 8, offset: 704)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, align: 8, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 6)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !135, file: !4, line: 117, baseType: !235, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !135, file: !4, line: 118, baseType: !235, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !135, file: !4, line: 119, baseType: !235, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !135, file: !4, line: 120, baseType: !235, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !135, file: !4, line: 121, baseType: !235, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !135, file: !4, line: 122, baseType: !235, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !135, file: !4, line: 124, baseType: !75, size: 64, align: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !135, file: !4, line: 125, baseType: !75, size: 64, align: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !97, file: !100, line: 38, baseType: !49, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !97, file: !100, line: 39, baseType: !49, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !97, file: !100, line: 40, baseType: !49, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !97, file: !100, line: 41, baseType: !49, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !97, file: !100, line: 42, baseType: !49, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !97, file: !100, line: 43, baseType: !49, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !97, file: !100, line: 44, baseType: !49, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !97, file: !100, line: 45, baseType: !49, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !97, file: !100, line: 46, baseType: !42, size: 64, align: 64, offset: 1792)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !97, file: !100, line: 47, baseType: !42, size: 64, align: 64, offset: 1856)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !97, file: !88, line: 27, baseType: !42, size: 64, align: 64, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !97, file: !88, line: 28, baseType: !42, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !97, file: !88, line: 30, baseType: !74, size: 32, align: 32, offset: 2048)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !97, file: !88, line: 31, baseType: !42, size: 64, align: 64, offset: 2112)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !97, file: !88, line: 32, baseType: !42, size: 64, align: 64, offset: 2176)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !97, file: !88, line: 34, baseType: !74, size: 32, align: 32, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !97, file: !88, line: 35, baseType: !74, size: 32, align: 32, offset: 2272)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !97, file: !88, line: 36, baseType: !74, size: 32, align: 32, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !97, file: !88, line: 38, baseType: !74, size: 32, align: 32, offset: 2336)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !97, file: !88, line: 38, baseType: !74, size: 32, align: 32, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !97, file: !88, line: 38, baseType: !74, size: 32, align: 32, offset: 2400)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !97, file: !88, line: 38, baseType: !74, size: 32, align: 32, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !87, file: !91, line: 9, baseType: !54, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !87, file: !91, line: 10, baseType: !54, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !91, line: 12, baseType: !42, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !87, file: !91, line: 13, baseType: !42, size: 64, align: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !87, file: !91, line: 15, baseType: !49, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !87, file: !91, line: 16, baseType: !49, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !87, file: !91, line: 17, baseType: !49, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !87, file: !91, line: 18, baseType: !49, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !87, file: !91, line: 19, baseType: !49, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !87, file: !91, line: 21, baseType: !337, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !117, line: 102, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !117, line: 102, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !87, file: !91, line: 22, baseType: !74, size: 32, align: 32, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !87, file: !91, line: 25, baseType: !342, size: 128, align: 64, offset: 640)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, align: 64, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 2)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !87, file: !91, line: 26, baseType: !74, size: 32, align: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !87, file: !91, line: 27, baseType: !74, size: 32, align: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !87, file: !91, line: 29, baseType: !348, size: 64, align: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !117, line: 103, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !117, line: 103, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !87, file: !91, line: 30, baseType: !352, size: 64, align: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !354, line: 37, baseType: !355)
!354 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !354, line: 37, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !87, file: !91, line: 32, baseType: !42, size: 64, align: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !87, file: !91, line: 33, baseType: !42, size: 64, align: 64, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !87, file: !91, line: 34, baseType: !42, size: 64, align: 64, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !87, file: !91, line: 35, baseType: !49, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !87, file: !91, line: 36, baseType: !49, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !87, file: !91, line: 37, baseType: !49, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !87, file: !91, line: 38, baseType: !49, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !87, file: !91, line: 40, baseType: !364, size: 128, align: 64, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !72, line: 504, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !72, line: 506, size: 128, align: 64, elements: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !365, file: !72, line: 508, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !72, line: 48, baseType: !58)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !365, file: !72, line: 509, baseType: !368, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !87, file: !91, line: 41, baseType: !54, size: 64, align: 64, offset: 1344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !87, file: !91, line: 42, baseType: !74, size: 32, align: 32, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !87, file: !91, line: 44, baseType: !244, size: 64, align: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !87, file: !91, line: 45, baseType: !244, size: 64, align: 64, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !87, file: !91, line: 53, baseType: !375, size: 64, align: 64, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !378, !82, !74}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !117, line: 107, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !381, line: 30, size: 2240, align: 64, elements: !382)
!381 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!382 = !{!383, !384, !385, !386, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !466, !470, !474, !479, !558, !565, !569}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !91, line: 3, baseType: !74, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !380, file: !91, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !380, file: !91, line: 6, baseType: !74, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !380, file: !91, line: 8, baseType: !387, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !117, line: 113, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !381, line: 25, size: 1920, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !100, line: 3, baseType: !74, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !389, file: !100, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !389, file: !100, line: 6, baseType: !74, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !389, file: !100, line: 9, baseType: !42, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !389, file: !100, line: 10, baseType: !74, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !389, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !389, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !389, file: !100, line: 11, baseType: !42, size: 64, align: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !389, file: !100, line: 13, baseType: !109, size: 16, align: 16, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !389, file: !100, line: 14, baseType: !42, size: 64, align: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !389, file: !100, line: 15, baseType: !42, size: 64, align: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !389, file: !100, line: 16, baseType: !74, size: 32, align: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !389, file: !100, line: 17, baseType: !42, size: 64, align: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !389, file: !100, line: 19, baseType: !115, size: 64, align: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !389, file: !100, line: 19, baseType: !115, size: 64, align: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !389, file: !100, line: 21, baseType: !42, size: 64, align: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !389, file: !100, line: 22, baseType: !42, size: 64, align: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !389, file: !100, line: 23, baseType: !42, size: 64, align: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !389, file: !100, line: 24, baseType: !42, size: 64, align: 64, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !389, file: !100, line: 26, baseType: !42, size: 64, align: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !389, file: !100, line: 27, baseType: !42, size: 64, align: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !389, file: !100, line: 28, baseType: !42, size: 64, align: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !389, file: !100, line: 29, baseType: !42, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !389, file: !100, line: 30, baseType: !42, size: 64, align: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !389, file: !100, line: 31, baseType: !42, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !389, file: !100, line: 32, baseType: !42, size: 64, align: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !389, file: !100, line: 33, baseType: !42, size: 64, align: 64, offset: 1600)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !389, file: !100, line: 35, baseType: !133, size: 64, align: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !389, file: !100, line: 38, baseType: !49, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !389, file: !100, line: 39, baseType: !49, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !389, file: !100, line: 40, baseType: !49, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !389, file: !100, line: 41, baseType: !49, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !389, file: !100, line: 42, baseType: !49, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !389, file: !100, line: 43, baseType: !49, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !389, file: !100, line: 44, baseType: !49, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !389, file: !100, line: 45, baseType: !49, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !389, file: !100, line: 46, baseType: !42, size: 64, align: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !389, file: !100, line: 47, baseType: !42, size: 64, align: 64, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !380, file: !91, line: 9, baseType: !54, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !380, file: !91, line: 10, baseType: !54, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !380, file: !91, line: 12, baseType: !42, size: 64, align: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !380, file: !91, line: 13, baseType: !42, size: 64, align: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !380, file: !91, line: 15, baseType: !49, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !380, file: !91, line: 16, baseType: !49, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !380, file: !91, line: 17, baseType: !49, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !380, file: !91, line: 18, baseType: !49, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !380, file: !91, line: 19, baseType: !49, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !380, file: !91, line: 21, baseType: !337, size: 64, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !380, file: !91, line: 22, baseType: !74, size: 32, align: 32, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !380, file: !91, line: 25, baseType: !342, size: 128, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !380, file: !91, line: 26, baseType: !74, size: 32, align: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !380, file: !91, line: 27, baseType: !74, size: 32, align: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !380, file: !91, line: 29, baseType: !348, size: 64, align: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !380, file: !91, line: 30, baseType: !352, size: 64, align: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !380, file: !91, line: 32, baseType: !42, size: 64, align: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !380, file: !91, line: 33, baseType: !42, size: 64, align: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !380, file: !91, line: 34, baseType: !42, size: 64, align: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !380, file: !91, line: 35, baseType: !49, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !380, file: !91, line: 36, baseType: !49, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !380, file: !91, line: 37, baseType: !49, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !380, file: !91, line: 38, baseType: !49, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !380, file: !91, line: 40, baseType: !364, size: 128, align: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !380, file: !91, line: 41, baseType: !54, size: 64, align: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !380, file: !91, line: 42, baseType: !74, size: 32, align: 32, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !380, file: !91, line: 44, baseType: !244, size: 64, align: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !380, file: !91, line: 45, baseType: !244, size: 64, align: 64, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !380, file: !91, line: 53, baseType: !375, size: 64, align: 64, offset: 1600)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !380, file: !91, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!74, !378, !43}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !380, file: !91, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!74, !378, !82}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !380, file: !91, line: 60, baseType: !467, size: 64, align: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!82, !378}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !380, file: !91, line: 62, baseType: !471, size: 64, align: 64, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !378, !82, !82, !74}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !380, file: !91, line: 65, baseType: !475, size: 64, align: 64, offset: 1920)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !378, !82, !82}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !380, file: !91, line: 69, baseType: !480, size: 64, align: 64, offset: 1984)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !378, !82}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !117, line: 109, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !486, line: 15, size: 1408, align: 64, elements: !487)
!486 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!487 = !{!488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !506, !510, !512, !513, !514, !515, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !489, line: 3, baseType: !74, size: 32, align: 32)
!489 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !485, file: !489, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !485, file: !489, line: 5, baseType: !352, size: 64, align: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !485, file: !489, line: 7, baseType: !59, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !485, file: !489, line: 8, baseType: !378, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !485, file: !489, line: 9, baseType: !42, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !489, line: 10, baseType: !42, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !485, file: !489, line: 11, baseType: !54, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !485, file: !489, line: 12, baseType: !74, size: 32, align: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !485, file: !489, line: 13, baseType: !42, size: 64, align: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !485, file: !489, line: 15, baseType: !500, size: 64, align: 64, offset: 576)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !117, line: 108, baseType: !505)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !117, line: 108, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !485, file: !489, line: 17, baseType: !507, size: 64, align: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!82, !503}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !485, file: !511, line: 5, baseType: !42, size: 64, align: 64, offset: 704)
!511 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!512 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !485, file: !511, line: 6, baseType: !42, size: 64, align: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !485, file: !511, line: 7, baseType: !54, size: 64, align: 64, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !485, file: !511, line: 9, baseType: !352, size: 64, align: 64, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !485, file: !511, line: 10, baseType: !516, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !117, line: 111, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !519, line: 13, size: 576, align: 64, elements: !520)
!519 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = !{!521, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !539, !540}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !522, line: 3, baseType: !74, size: 32, align: 32)
!522 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !518, file: !522, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !518, file: !522, line: 6, baseType: !54, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !518, file: !522, line: 8, baseType: !42, size: 64, align: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !518, file: !522, line: 9, baseType: !42, size: 64, align: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !518, file: !522, line: 10, baseType: !42, size: 64, align: 64, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !518, file: !522, line: 11, baseType: !74, size: 32, align: 32, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !518, file: !522, line: 14, baseType: !49, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !518, file: !522, line: 15, baseType: !49, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !518, file: !522, line: 18, baseType: !49, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !518, file: !522, line: 19, baseType: !49, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !518, file: !522, line: 20, baseType: !49, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !518, file: !522, line: 21, baseType: !49, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !518, file: !522, line: 22, baseType: !536, size: 64, align: 8, offset: 360)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 8, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !518, file: !522, line: 26, baseType: !59, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !522, line: 28, baseType: !516, size: 64, align: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !485, file: !511, line: 12, baseType: !49, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !485, file: !511, line: 13, baseType: !42, size: 64, align: 64, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !485, file: !511, line: 14, baseType: !74, size: 32, align: 32, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !485, file: !511, line: 15, baseType: !42, size: 64, align: 64, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !485, file: !511, line: 17, baseType: !49, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !485, file: !511, line: 18, baseType: !49, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !485, file: !511, line: 19, baseType: !49, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !485, file: !511, line: 20, baseType: !49, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !485, file: !511, line: 22, baseType: !49, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !485, file: !511, line: 23, baseType: !49, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !485, file: !511, line: 24, baseType: !49, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !485, file: !511, line: 25, baseType: !49, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !485, file: !511, line: 26, baseType: !49, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !485, file: !511, line: 31, baseType: !555, size: 64, align: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!42, !483}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !380, file: !91, line: 70, baseType: !559, size: 64, align: 64, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !378, !82}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !117, line: 110, baseType: !564)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !117, line: 110, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !380, file: !91, line: 71, baseType: !566, size: 64, align: 64, offset: 2112)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!74, !82, !82}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !380, file: !91, line: 73, baseType: !566, size: 64, align: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !87, file: !91, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !87, file: !91, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !87, file: !91, line: 60, baseType: !467, size: 64, align: 64, offset: 1792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !87, file: !91, line: 62, baseType: !471, size: 64, align: 64, offset: 1856)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !87, file: !91, line: 65, baseType: !475, size: 64, align: 64, offset: 1920)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !87, file: !91, line: 69, baseType: !480, size: 64, align: 64, offset: 1984)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !87, file: !91, line: 70, baseType: !559, size: 64, align: 64, offset: 2048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !87, file: !91, line: 71, baseType: !566, size: 64, align: 64, offset: 2112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !87, file: !91, line: 73, baseType: !566, size: 64, align: 64, offset: 2176)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !87, file: !88, line: 46, baseType: !244, size: 64, align: 64, offset: 2240)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !87, file: !88, line: 47, baseType: !244, size: 64, align: 64, offset: 2304)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !87, file: !88, line: 48, baseType: !582, size: 64, align: 64, offset: 2368)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !86, line: 8, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !86, line: 8, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !87, file: !88, line: 49, baseType: !244, size: 64, align: 64, offset: 2432)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !87, file: !88, line: 51, baseType: !42, size: 64, align: 64, offset: 2496)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !87, file: !88, line: 53, baseType: !42, size: 64, align: 64, offset: 2560)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !87, file: !88, line: 54, baseType: !42, size: 64, align: 64, offset: 2624)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !87, file: !88, line: 55, baseType: !42, size: 64, align: 64, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !87, file: !88, line: 56, baseType: !42, size: 64, align: 64, offset: 2752)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !87, file: !88, line: 57, baseType: !74, size: 32, align: 32, offset: 2816)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !87, file: !88, line: 59, baseType: !49, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !87, file: !88, line: 60, baseType: !49, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !87, file: !88, line: 62, baseType: !49, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !87, file: !88, line: 63, baseType: !49, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !87, file: !88, line: 64, baseType: !49, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !87, file: !88, line: 65, baseType: !49, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !87, file: !88, line: 66, baseType: !49, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !87, file: !88, line: 67, baseType: !49, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !87, file: !88, line: 68, baseType: !49, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !87, file: !88, line: 69, baseType: !49, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !87, file: !88, line: 70, baseType: !49, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !87, file: !88, line: 71, baseType: !49, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !87, file: !88, line: 72, baseType: !49, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !87, file: !88, line: 74, baseType: !74, size: 32, align: 32, offset: 2880)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !87, file: !88, line: 75, baseType: !74, size: 32, align: 32, offset: 2912)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !87, file: !88, line: 76, baseType: !74, size: 32, align: 32, offset: 2944)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !87, file: !88, line: 77, baseType: !74, size: 32, align: 32, offset: 2976)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !87, file: !88, line: 79, baseType: !352, size: 64, align: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !87, file: !88, line: 80, baseType: !244, size: 64, align: 64, offset: 3072)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !87, file: !88, line: 81, baseType: !244, size: 64, align: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !87, file: !88, line: 83, baseType: !283, size: 64, align: 64, offset: 3200)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !87, file: !88, line: 84, baseType: !235, size: 32, align: 32, offset: 3264)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !87, file: !88, line: 87, baseType: !74, size: 32, align: 32, offset: 3296)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !87, file: !88, line: 91, baseType: !244, size: 64, align: 64, offset: 3328)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !87, file: !88, line: 92, baseType: !364, size: 128, align: 64, offset: 3392)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !87, file: !88, line: 93, baseType: !364, size: 128, align: 64, offset: 3520)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !87, file: !88, line: 95, baseType: !74, size: 32, align: 32, offset: 3648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !87, file: !88, line: 96, baseType: !74, size: 32, align: 32, offset: 3680)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !87, file: !88, line: 97, baseType: !74, size: 32, align: 32, offset: 3712)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !87, file: !88, line: 100, baseType: !244, size: 64, align: 64, offset: 3776)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !87, file: !88, line: 103, baseType: !244, size: 64, align: 64, offset: 3840)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !87, file: !88, line: 106, baseType: !244, size: 64, align: 64, offset: 3904)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !87, file: !88, line: 108, baseType: !352, size: 64, align: 64, offset: 3968)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !87, file: !88, line: 109, baseType: !244, size: 64, align: 64, offset: 4032)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !87, file: !88, line: 111, baseType: !244, size: 64, align: 64, offset: 4096)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !87, file: !88, line: 114, baseType: !59, size: 64, align: 64, offset: 4160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !87, file: !88, line: 116, baseType: !352, size: 64, align: 64, offset: 4224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !87, file: !88, line: 117, baseType: !630, size: 32768, align: 64, offset: 4288)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 32768, align: 64, elements: !680)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !632, line: 10, size: 128, align: 64, elements: !633)
!632 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!633 = !{!634, !679}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !631, file: !632, line: 11, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !632, line: 7, baseType: !637)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !639, !82, !43, !43, !42, !283}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !86, line: 7, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !642, line: 15, size: 1600, align: 64, elements: !643)
!642 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !489, line: 3, baseType: !74, size: 32, align: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !641, file: !489, line: 4, baseType: !74, size: 32, align: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !641, file: !489, line: 5, baseType: !352, size: 64, align: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !641, file: !489, line: 7, baseType: !59, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !641, file: !489, line: 8, baseType: !84, size: 64, align: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !641, file: !489, line: 9, baseType: !42, size: 64, align: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !641, file: !489, line: 10, baseType: !42, size: 64, align: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !641, file: !489, line: 11, baseType: !54, size: 64, align: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !641, file: !489, line: 12, baseType: !74, size: 32, align: 32, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !641, file: !489, line: 13, baseType: !42, size: 64, align: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !641, file: !489, line: 15, baseType: !500, size: 64, align: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !641, file: !489, line: 17, baseType: !507, size: 64, align: 64, offset: 640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !641, file: !511, line: 5, baseType: !42, size: 64, align: 64, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !641, file: !511, line: 6, baseType: !42, size: 64, align: 64, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !641, file: !511, line: 7, baseType: !54, size: 64, align: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !641, file: !511, line: 9, baseType: !352, size: 64, align: 64, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !641, file: !511, line: 10, baseType: !516, size: 64, align: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !641, file: !511, line: 12, baseType: !49, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !641, file: !511, line: 13, baseType: !42, size: 64, align: 64, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !641, file: !511, line: 14, baseType: !74, size: 32, align: 32, offset: 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !641, file: !511, line: 15, baseType: !42, size: 64, align: 64, offset: 1216)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !641, file: !511, line: 17, baseType: !49, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !641, file: !511, line: 18, baseType: !49, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !641, file: !511, line: 19, baseType: !49, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !641, file: !511, line: 20, baseType: !49, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !641, file: !511, line: 22, baseType: !49, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !641, file: !511, line: 23, baseType: !49, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !641, file: !511, line: 24, baseType: !49, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !641, file: !511, line: 25, baseType: !49, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !641, file: !511, line: 26, baseType: !49, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !641, file: !511, line: 31, baseType: !555, size: 64, align: 64, offset: 1344)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !641, file: !642, line: 18, baseType: !244, size: 64, align: 64, offset: 1408)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !641, file: !642, line: 20, baseType: !54, size: 64, align: 64, offset: 1472)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !641, file: !642, line: 21, baseType: !74, size: 32, align: 32, offset: 1536)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !641, file: !642, line: 22, baseType: !74, size: 32, align: 32, offset: 1568)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !631, file: !632, line: 12, baseType: !43, size: 8, align: 8, offset: 64)
!680 = !{!681}
!681 = !DISubrange(count: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !87, file: !88, line: 118, baseType: !683, size: 2048, align: 8, offset: 37056)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, align: 8, elements: !680)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !87, file: !88, line: 120, baseType: !566, size: 64, align: 64, offset: 39104)
!685 = !{!686, !688}
!686 = distinct !DIGlobalVariable(name: "notify_tag", scope: !0, file: !687, line: 35, type: !74, isLocal: true, isDefinition: true, variable: i32* @notify_tag)
!687 = !DIFile(filename: "notify-ison.c", directory: "/home/lichi/Desktop/irssi/task1")
!688 = distinct !DIGlobalVariable(name: "notify_whois_time", scope: !0, file: !687, line: 36, type: !74, isLocal: true, isDefinition: true, variable: i32* @notify_whois_time)
!689 = !{i32 2, !"Dwarf Version", i32 4}
!690 = !{i32 2, !"Debug Info Version", i32 3}
!691 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!692 = distinct !DISubprogram(name: "notify_nick_create", scope: !687, file: !687, line: 38, type: !693, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{!36, !84, !82}
!695 = !{}
!696 = !DILocalVariable(name: "server", arg: 1, scope: !692, file: !687, line: 38, type: !84)
!697 = !DIExpression()
!698 = !DILocation(line: 38, column: 53, scope: !692)
!699 = !DILocalVariable(name: "nick", arg: 2, scope: !692, file: !687, line: 38, type: !82)
!700 = !DILocation(line: 38, column: 73, scope: !692)
!701 = !DILocalVariable(name: "mserver", scope: !692, file: !687, line: 40, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_SERVER_REC", file: !38, line: 24, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 19, size: 192, align: 64, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ison_count", scope: !704, file: !38, line: 20, baseType: !74, size: 32, align: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "notify_users", scope: !704, file: !38, line: 22, baseType: !244, size: 64, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ison_tempusers", scope: !704, file: !38, line: 23, baseType: !244, size: 64, align: 64, offset: 128)
!709 = !DILocation(line: 40, column: 21, scope: !692)
!710 = !DILocalVariable(name: "rec", scope: !692, file: !687, line: 41, type: !36)
!711 = !DILocation(line: 41, column: 19, scope: !692)
!712 = !DILocation(line: 43, column: 33, scope: !692)
!713 = !DILocation(line: 43, column: 42, scope: !692)
!714 = !DILocation(line: 43, column: 12, scope: !692)
!715 = !DILocation(line: 43, column: 10, scope: !692)
!716 = !DILocation(line: 45, column: 29, scope: !692)
!717 = !DILocation(line: 45, column: 9, scope: !692)
!718 = !DILocation(line: 45, column: 6, scope: !692)
!719 = !DILocation(line: 46, column: 23, scope: !692)
!720 = !DILocation(line: 46, column: 14, scope: !692)
!721 = !DILocation(line: 46, column: 2, scope: !692)
!722 = !DILocation(line: 46, column: 7, scope: !692)
!723 = !DILocation(line: 46, column: 12, scope: !692)
!724 = !DILocation(line: 48, column: 41, scope: !692)
!725 = !DILocation(line: 48, column: 50, scope: !692)
!726 = !DILocation(line: 48, column: 64, scope: !692)
!727 = !DILocation(line: 48, column: 26, scope: !692)
!728 = !DILocation(line: 48, column: 2, scope: !692)
!729 = !DILocation(line: 48, column: 11, scope: !692)
!730 = !DILocation(line: 48, column: 24, scope: !692)
!731 = !DILocation(line: 49, column: 9, scope: !692)
!732 = !DILocation(line: 49, column: 2, scope: !692)
!733 = distinct !DISubprogram(name: "notify_nick_destroy", scope: !687, file: !687, line: 52, type: !734, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !36}
!736 = !DILocalVariable(name: "rec", arg: 1, scope: !733, file: !687, line: 52, type: !36)
!737 = !DILocation(line: 52, column: 43, scope: !733)
!738 = !DILocation(line: 54, column: 9, scope: !733)
!739 = !DILocation(line: 54, column: 14, scope: !733)
!740 = !DILocation(line: 54, column: 2, scope: !733)
!741 = !DILocation(line: 55, column: 9, scope: !733)
!742 = !DILocation(line: 55, column: 14, scope: !733)
!743 = !DILocation(line: 55, column: 2, scope: !733)
!744 = !DILocation(line: 56, column: 9, scope: !733)
!745 = !DILocation(line: 56, column: 14, scope: !733)
!746 = !DILocation(line: 56, column: 2, scope: !733)
!747 = !DILocation(line: 57, column: 9, scope: !733)
!748 = !DILocation(line: 57, column: 14, scope: !733)
!749 = !DILocation(line: 57, column: 2, scope: !733)
!750 = !DILocation(line: 58, column: 9, scope: !733)
!751 = !DILocation(line: 58, column: 14, scope: !733)
!752 = !DILocation(line: 58, column: 2, scope: !733)
!753 = !DILocation(line: 59, column: 9, scope: !733)
!754 = !DILocation(line: 59, column: 2, scope: !733)
!755 = !DILocation(line: 60, column: 1, scope: !733)
!756 = distinct !DISubprogram(name: "notify_nick_find", scope: !687, file: !687, line: 62, type: !693, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!757 = !DILocalVariable(name: "server", arg: 1, scope: !756, file: !687, line: 62, type: !84)
!758 = !DILocation(line: 62, column: 51, scope: !756)
!759 = !DILocalVariable(name: "nick", arg: 2, scope: !756, file: !687, line: 62, type: !82)
!760 = !DILocation(line: 62, column: 71, scope: !756)
!761 = !DILocalVariable(name: "mserver", scope: !756, file: !687, line: 64, type: !702)
!762 = !DILocation(line: 64, column: 21, scope: !756)
!763 = !DILocalVariable(name: "rec", scope: !756, file: !687, line: 65, type: !36)
!764 = !DILocation(line: 65, column: 19, scope: !756)
!765 = !DILocalVariable(name: "tmp", scope: !756, file: !687, line: 66, type: !244)
!766 = !DILocation(line: 66, column: 10, scope: !756)
!767 = !DILocation(line: 68, column: 33, scope: !756)
!768 = !DILocation(line: 68, column: 42, scope: !756)
!769 = !DILocation(line: 68, column: 12, scope: !756)
!770 = !DILocation(line: 68, column: 10, scope: !756)
!771 = !DILocation(line: 69, column: 13, scope: !772)
!772 = distinct !DILexicalBlock(scope: !756, file: !687, line: 69, column: 2)
!773 = !DILocation(line: 69, column: 22, scope: !772)
!774 = !DILocation(line: 69, column: 11, scope: !772)
!775 = !DILocation(line: 69, column: 7, scope: !772)
!776 = !DILocation(line: 69, column: 36, scope: !777)
!777 = !DILexicalBlockFile(scope: !778, file: !687, discriminator: 1)
!778 = distinct !DILexicalBlock(scope: !772, file: !687, line: 69, column: 2)
!779 = !DILocation(line: 69, column: 40, scope: !777)
!780 = !DILocation(line: 69, column: 2, scope: !777)
!781 = !DILocation(line: 70, column: 9, scope: !782)
!782 = distinct !DILexicalBlock(scope: !778, file: !687, line: 69, column: 65)
!783 = !DILocation(line: 70, column: 14, scope: !782)
!784 = !DILocation(line: 70, column: 7, scope: !782)
!785 = !DILocation(line: 72, column: 26, scope: !786)
!786 = distinct !DILexicalBlock(scope: !782, file: !687, line: 72, column: 7)
!787 = !DILocation(line: 72, column: 31, scope: !786)
!788 = !DILocation(line: 72, column: 37, scope: !786)
!789 = !DILocation(line: 72, column: 7, scope: !786)
!790 = !DILocation(line: 72, column: 43, scope: !786)
!791 = !DILocation(line: 72, column: 7, scope: !782)
!792 = !DILocation(line: 73, column: 11, scope: !786)
!793 = !DILocation(line: 73, column: 4, scope: !786)
!794 = !DILocation(line: 74, column: 2, scope: !782)
!795 = !DILocation(line: 69, column: 54, scope: !796)
!796 = !DILexicalBlockFile(scope: !778, file: !687, discriminator: 2)
!797 = !DILocation(line: 69, column: 59, scope: !796)
!798 = !DILocation(line: 69, column: 52, scope: !796)
!799 = !DILocation(line: 69, column: 2, scope: !796)
!800 = distinct !{!800, !801}
!801 = !DILocation(line: 69, column: 2, scope: !756)
!802 = !DILocation(line: 76, column: 2, scope: !756)
!803 = !DILocation(line: 77, column: 1, scope: !756)
!804 = distinct !DISubprogram(name: "notifylist_ison_init", scope: !687, file: !687, line: 328, type: !232, isLocal: false, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!805 = !DILocation(line: 330, column: 2, scope: !804)
!806 = !DILocation(line: 331, column: 2, scope: !804)
!807 = !DILocation(line: 333, column: 13, scope: !804)
!808 = !DILocation(line: 334, column: 2, scope: !804)
!809 = !DILocation(line: 336, column: 2, scope: !804)
!810 = !DILocation(line: 337, column: 2, scope: !804)
!811 = !DILocation(line: 338, column: 1, scope: !804)
!812 = distinct !DISubprogram(name: "read_settings", scope: !687, file: !687, line: 319, type: !232, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!813 = !DILocation(line: 321, column: 6, scope: !814)
!814 = distinct !DILexicalBlock(scope: !812, file: !687, line: 321, column: 6)
!815 = !DILocation(line: 321, column: 17, scope: !814)
!816 = !DILocation(line: 321, column: 6, scope: !812)
!817 = !DILocation(line: 321, column: 40, scope: !818)
!818 = !DILexicalBlockFile(scope: !814, file: !687, discriminator: 1)
!819 = !DILocation(line: 321, column: 24, scope: !818)
!820 = !DILocation(line: 322, column: 29, scope: !812)
!821 = !DILocation(line: 322, column: 15, scope: !822)
!822 = !DILexicalBlockFile(scope: !812, file: !687, discriminator: 1)
!823 = !DILocation(line: 322, column: 13, scope: !812)
!824 = !DILocation(line: 325, column: 22, scope: !812)
!825 = !DILocation(line: 325, column: 60, scope: !812)
!826 = !DILocation(line: 325, column: 20, scope: !812)
!827 = !DILocation(line: 326, column: 1, scope: !812)
!828 = distinct !DISubprogram(name: "event_ison", scope: !687, file: !687, line: 289, type: !829, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !84, !82}
!831 = !DILocalVariable(name: "server", arg: 1, scope: !828, file: !687, line: 289, type: !84)
!832 = !DILocation(line: 289, column: 40, scope: !828)
!833 = !DILocalVariable(name: "data", arg: 2, scope: !828, file: !687, line: 289, type: !82)
!834 = !DILocation(line: 289, column: 60, scope: !828)
!835 = !DILocalVariable(name: "mserver", scope: !828, file: !687, line: 291, type: !702)
!836 = !DILocation(line: 291, column: 21, scope: !828)
!837 = !DILocalVariable(name: "params", scope: !828, file: !687, line: 292, type: !42)
!838 = !DILocation(line: 292, column: 8, scope: !828)
!839 = !DILocalVariable(name: "online", scope: !828, file: !687, line: 292, type: !42)
!840 = !DILocation(line: 292, column: 17, scope: !828)
!841 = !DILocation(line: 294, column: 2, scope: !828)
!842 = distinct !{!842, !841}
!843 = !DILocation(line: 294, column: 10, scope: !844)
!844 = !DILexicalBlockFile(scope: !845, file: !687, discriminator: 1)
!845 = distinct !DILexicalBlock(scope: !846, file: !687, line: 294, column: 10)
!846 = distinct !DILexicalBlock(scope: !828, file: !687, line: 294, column: 4)
!847 = !DILocation(line: 294, column: 15, scope: !844)
!848 = !DILocation(line: 294, column: 5, scope: !849)
!849 = !DILexicalBlockFile(scope: !850, file: !687, discriminator: 2)
!850 = distinct !DILexicalBlock(scope: !845, file: !687, line: 294, column: 3)
!851 = !DILocation(line: 294, column: 14, scope: !852)
!852 = !DILexicalBlockFile(scope: !853, file: !687, discriminator: 3)
!853 = distinct !DILexicalBlock(scope: !845, file: !687, line: 294, column: 12)
!854 = !DILocation(line: 294, column: 99, scope: !852)
!855 = !DILocation(line: 294, column: 110, scope: !856)
!856 = !DILexicalBlockFile(scope: !846, file: !687, discriminator: 4)
!857 = !DILocation(line: 295, column: 2, scope: !828)
!858 = distinct !{!858, !857}
!859 = !DILocation(line: 295, column: 10, scope: !860)
!860 = !DILexicalBlockFile(scope: !861, file: !687, discriminator: 1)
!861 = distinct !DILexicalBlock(scope: !862, file: !687, line: 295, column: 10)
!862 = distinct !DILexicalBlock(scope: !828, file: !687, line: 295, column: 4)
!863 = !DILocation(line: 295, column: 17, scope: !860)
!864 = !DILocation(line: 295, column: 5, scope: !865)
!865 = !DILexicalBlockFile(scope: !866, file: !687, discriminator: 2)
!866 = distinct !DILexicalBlock(scope: !861, file: !687, line: 295, column: 3)
!867 = !DILocation(line: 295, column: 14, scope: !868)
!868 = !DILexicalBlockFile(scope: !869, file: !687, discriminator: 3)
!869 = distinct !DILexicalBlock(scope: !861, file: !687, line: 295, column: 12)
!870 = !DILocation(line: 295, column: 101, scope: !868)
!871 = !DILocation(line: 295, column: 112, scope: !872)
!872 = !DILexicalBlockFile(scope: !862, file: !687, discriminator: 4)
!873 = !DILocation(line: 297, column: 28, scope: !828)
!874 = !DILocation(line: 297, column: 11, scope: !828)
!875 = !DILocation(line: 297, column: 9, scope: !828)
!876 = !DILocation(line: 299, column: 33, scope: !828)
!877 = !DILocation(line: 299, column: 42, scope: !828)
!878 = !DILocation(line: 299, column: 12, scope: !828)
!879 = !DILocation(line: 299, column: 10, scope: !828)
!880 = !DILocation(line: 300, column: 18, scope: !828)
!881 = !DILocation(line: 300, column: 27, scope: !828)
!882 = !DILocation(line: 300, column: 2, scope: !828)
!883 = !DILocation(line: 302, column: 8, scope: !884)
!884 = distinct !DILexicalBlock(scope: !828, file: !687, line: 302, column: 6)
!885 = !DILocation(line: 302, column: 17, scope: !884)
!886 = !DILocation(line: 302, column: 6, scope: !884)
!887 = !DILocation(line: 302, column: 28, scope: !884)
!888 = !DILocation(line: 302, column: 6, scope: !828)
!889 = !DILocation(line: 304, column: 10, scope: !890)
!890 = distinct !DILexicalBlock(scope: !884, file: !687, line: 302, column: 33)
!891 = !DILocation(line: 304, column: 3, scope: !890)
!892 = !DILocation(line: 305, column: 17, scope: !890)
!893 = !DILocation(line: 308, column: 26, scope: !828)
!894 = !DILocation(line: 308, column: 9, scope: !828)
!895 = !DILocation(line: 309, column: 26, scope: !828)
!896 = !DILocation(line: 309, column: 9, scope: !828)
!897 = !DILocation(line: 312, column: 18, scope: !828)
!898 = !DILocation(line: 312, column: 27, scope: !828)
!899 = !DILocation(line: 312, column: 2, scope: !828)
!900 = !DILocation(line: 313, column: 15, scope: !828)
!901 = !DILocation(line: 313, column: 24, scope: !828)
!902 = !DILocation(line: 313, column: 2, scope: !828)
!903 = !DILocation(line: 314, column: 2, scope: !828)
!904 = !DILocation(line: 314, column: 11, scope: !828)
!905 = !DILocation(line: 314, column: 26, scope: !828)
!906 = !DILocation(line: 316, column: 9, scope: !828)
!907 = !DILocation(line: 316, column: 2, scope: !828)
!908 = !DILocation(line: 317, column: 1, scope: !828)
!909 = !DILocation(line: 317, column: 1, scope: !910)
!910 = !DILexicalBlockFile(scope: !828, file: !687, discriminator: 1)
!911 = distinct !DISubprogram(name: "notifylist_ison_deinit", scope: !687, file: !687, line: 340, type: !232, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!912 = !DILocation(line: 342, column: 18, scope: !911)
!913 = !DILocation(line: 342, column: 2, scope: !911)
!914 = !DILocation(line: 344, column: 2, scope: !911)
!915 = !DILocation(line: 345, column: 2, scope: !911)
!916 = !DILocation(line: 346, column: 1, scope: !911)
