; ModuleID = './line47-misc.o.i'
source_filename = "./line47-misc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque
%struct._GIConv = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, globals: !270)
!1 = !DIFile(filename: "line47-misc.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !{!51, !204, !64, !82, !252, !57, !254, !255, !256, !128, !263, !265, !199, !266, !267, !268, !180, !269}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRSSI_INPUT_REC", file: !53, line: 29, baseType: !54)
!53 = !DIFile(filename: "misc.c", directory: "/home/lichi/Desktop/irssi/task1")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 25, size: 192, align: 64, elements: !55)
!55 = !{!56, !58, !251}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !54, file: !53, line: 26, baseType: !57, size: 32, align: 32)
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !54, file: !53, line: 27, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !60, line: 60, baseType: !61)
!60 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !65, !57}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !68)
!68 = !{!69, !72, !218, !219, !224, !225, !226, !227, !228, !237, !238, !239, !243, !244, !245, !246, !247, !248, !249, !250}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !67, file: !4, line: 100, baseType: !70, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !71, line: 49, baseType: !57)
!71 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !67, file: !4, line: 101, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !76)
!76 = !{!77, !102, !108, !115, !119, !205, !209, !214}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !75, file: !4, line: 133, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !65, !82, !85, !88, !89}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !71, line: 46, baseType: !84)
!84 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !86, line: 66, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !92, line: 42, baseType: !93)
!92 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !92, line: 44, size: 128, align: 64, elements: !94)
!94 = !{!95, !100, !101}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !93, file: !92, line: 46, baseType: !96, size: 32, align: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !97, line: 36, baseType: !98)
!97 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !86, line: 45, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !93, file: !92, line: 47, baseType: !70, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !93, file: !92, line: 48, baseType: !82, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !75, file: !4, line: 138, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!81, !65, !106, !85, !88, !89}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !75, file: !4, line: 143, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!81, !65, !112, !114, !89}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !86, line: 51, baseType: !113)
!113 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !75, file: !4, line: 147, baseType: !116, size: 64, align: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!81, !65, !89}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !75, file: !4, line: 149, baseType: !120, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !65, !204}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !126)
!126 = !{!127, !129, !150, !179, !181, !185, !186, !187, !188, !196, !197, !198, !200}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !125, file: !16, line: 174, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !71, line: 77, baseType: !64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !125, file: !16, line: 175, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !133)
!133 = !{!134, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !132, file: !16, line: 198, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !128}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !132, file: !16, line: 199, baseType: !135, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !132, file: !16, line: 200, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !128, !123, !143, !149}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !128}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !71, line: 50, baseType: !70)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !125, file: !16, line: 177, baseType: !151, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !155)
!155 = !{!156, !161, !165, !169, !173, !174}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !154, file: !16, line: 216, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!148, !123, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !154, file: !16, line: 218, baseType: !162, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!148, !123}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !154, file: !16, line: 219, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!148, !123, !144, !128}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !154, file: !16, line: 222, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !123}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !154, file: !16, line: 226, baseType: !144, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !154, file: !16, line: 227, baseType: !175, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !125, file: !16, line: 178, baseType: !180, size: 32, align: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !71, line: 55, baseType: !99)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !125, file: !16, line: 180, baseType: !182, size: 64, align: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !125, file: !16, line: 182, baseType: !70, size: 32, align: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !16, line: 183, baseType: !180, size: 32, align: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !125, file: !16, line: 184, baseType: !180, size: 32, align: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !125, file: !16, line: 186, baseType: !189, size: 64, align: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !191, line: 37, baseType: !192)
!191 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !191, line: 39, size: 128, align: 64, elements: !193)
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !191, line: 41, baseType: !128, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !191, line: 42, baseType: !189, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !16, line: 188, baseType: !123, size: 64, align: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !16, line: 189, baseType: !123, size: 64, align: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !16, line: 191, baseType: !199, size: 64, align: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !125, file: !16, line: 193, baseType: !201, size: 64, align: 64, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !75, file: !4, line: 151, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !65}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !75, file: !4, line: 152, baseType: !210, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!81, !65, !213, !89}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !75, file: !4, line: 155, baseType: !215, size: 64, align: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!213, !65}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !67, file: !4, line: 103, baseType: !82, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !67, file: !4, line: 104, baseType: !220, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !221, line: 77, baseType: !222)
!221 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !221, line: 77, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !67, file: !4, line: 105, baseType: !220, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !67, file: !4, line: 106, baseType: !82, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !67, file: !4, line: 107, baseType: !180, size: 32, align: 32, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !67, file: !4, line: 109, baseType: !85, size: 64, align: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !67, file: !4, line: 110, baseType: !229, size: 64, align: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !231, line: 39, baseType: !232)
!231 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !231, line: 41, size: 192, align: 64, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !232, file: !231, line: 43, baseType: !82, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !231, line: 44, baseType: !85, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !232, file: !231, line: 45, baseType: !85, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !67, file: !4, line: 111, baseType: !229, size: 64, align: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !67, file: !4, line: 112, baseType: !229, size: 64, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !67, file: !4, line: 113, baseType: !240, size: 48, align: 8, offset: 704)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 48, align: 8, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !67, file: !4, line: 117, baseType: !180, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !67, file: !4, line: 118, baseType: !180, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !67, file: !4, line: 119, baseType: !180, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !67, file: !4, line: 120, baseType: !180, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !67, file: !4, line: 121, baseType: !180, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !67, file: !4, line: 122, baseType: !180, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !67, file: !4, line: 124, baseType: !128, size: 64, align: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !67, file: !4, line: 125, baseType: !128, size: 64, align: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !53, line: 28, baseType: !64, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!254 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!255 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !71, line: 80, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!70, !260, !260}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !71, line: 78, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !86, line: 38, baseType: !254)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !71, line: 48, baseType: !113)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !60, line: 49, baseType: !87)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!270 = !{!271}
!271 = distinct !DIGlobalVariable(name: "hex", scope: !272, file: !53, line: 1052, type: !279, isLocal: true, isDefinition: true, variable: [17 x i8]* @binary_to_hex.hex)
!272 = distinct !DISubprogram(name: "binary_to_hex", scope: !53, file: !53, line: 1050, type: !273, isLocal: false, isDefinition: true, scopeLine: 1051, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!273 = !DISubroutineType(types: !274)
!274 = !{!199, !275, !276}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !277, line: 216, baseType: !87)
!277 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!278 = !{}
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 136, align: 8, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 17)
!282 = !{i32 2, !"Dwarf Version", i32 4}
!283 = !{i32 2, !"Debug Info Version", i32 3}
!284 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!285 = distinct !DISubprogram(name: "g_input_add_full", scope: !53, file: !53, line: 56, type: !286, isLocal: false, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!286 = !DISubroutineType(types: !287)
!287 = !{!57, !65, !57, !57, !59, !64}
!288 = !DILocalVariable(name: "source", arg: 1, scope: !285, file: !53, line: 56, type: !65)
!289 = !DIExpression()
!290 = !DILocation(line: 56, column: 34, scope: !285)
!291 = !DILocalVariable(name: "priority", arg: 2, scope: !285, file: !53, line: 56, type: !57)
!292 = !DILocation(line: 56, column: 46, scope: !285)
!293 = !DILocalVariable(name: "condition", arg: 3, scope: !285, file: !53, line: 56, type: !57)
!294 = !DILocation(line: 56, column: 60, scope: !285)
!295 = !DILocalVariable(name: "function", arg: 4, scope: !285, file: !53, line: 57, type: !59)
!296 = !DILocation(line: 57, column: 23, scope: !285)
!297 = !DILocalVariable(name: "data", arg: 5, scope: !285, file: !53, line: 57, type: !64)
!298 = !DILocation(line: 57, column: 39, scope: !285)
!299 = !DILocalVariable(name: "rec", scope: !285, file: !53, line: 59, type: !51)
!300 = !DILocation(line: 59, column: 26, scope: !285)
!301 = !DILocalVariable(name: "result", scope: !285, file: !53, line: 60, type: !99)
!302 = !DILocation(line: 60, column: 15, scope: !285)
!303 = !DILocalVariable(name: "cond", scope: !285, file: !53, line: 61, type: !204)
!304 = !DILocation(line: 61, column: 15, scope: !285)
!305 = !DILocation(line: 63, column: 29, scope: !285)
!306 = !DILocation(line: 63, column: 9, scope: !285)
!307 = !DILocation(line: 63, column: 6, scope: !285)
!308 = !DILocation(line: 64, column: 19, scope: !285)
!309 = !DILocation(line: 64, column: 2, scope: !285)
!310 = !DILocation(line: 64, column: 7, scope: !285)
!311 = !DILocation(line: 64, column: 17, scope: !285)
!312 = !DILocation(line: 65, column: 18, scope: !285)
!313 = !DILocation(line: 65, column: 2, scope: !285)
!314 = !DILocation(line: 65, column: 7, scope: !285)
!315 = !DILocation(line: 65, column: 16, scope: !285)
!316 = !DILocation(line: 66, column: 14, scope: !285)
!317 = !DILocation(line: 66, column: 2, scope: !285)
!318 = !DILocation(line: 66, column: 7, scope: !285)
!319 = !DILocation(line: 66, column: 12, scope: !285)
!320 = !DILocation(line: 68, column: 7, scope: !285)
!321 = !DILocation(line: 69, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !285, file: !53, line: 69, column: 6)
!323 = !DILocation(line: 69, column: 16, scope: !322)
!324 = !DILocation(line: 69, column: 6, scope: !285)
!325 = !DILocation(line: 70, column: 8, scope: !322)
!326 = !DILocation(line: 70, column: 3, scope: !322)
!327 = !DILocation(line: 71, column: 6, scope: !328)
!328 = distinct !DILexicalBlock(scope: !285, file: !53, line: 71, column: 6)
!329 = !DILocation(line: 71, column: 16, scope: !328)
!330 = !DILocation(line: 71, column: 6, scope: !285)
!331 = !DILocation(line: 72, column: 8, scope: !328)
!332 = !DILocation(line: 72, column: 3, scope: !328)
!333 = !DILocation(line: 74, column: 31, scope: !285)
!334 = !DILocation(line: 74, column: 39, scope: !285)
!335 = !DILocation(line: 74, column: 49, scope: !285)
!336 = !DILocation(line: 75, column: 27, scope: !285)
!337 = !DILocation(line: 74, column: 11, scope: !285)
!338 = !DILocation(line: 74, column: 9, scope: !285)
!339 = !DILocation(line: 77, column: 9, scope: !285)
!340 = !DILocation(line: 77, column: 2, scope: !285)
!341 = distinct !DISubprogram(name: "irssi_io_invoke", scope: !53, file: !53, line: 31, type: !342, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!342 = !DISubroutineType(types: !343)
!343 = !{!57, !65, !204, !64}
!344 = !DILocalVariable(name: "source", arg: 1, scope: !341, file: !53, line: 31, type: !65)
!345 = !DILocation(line: 31, column: 40, scope: !341)
!346 = !DILocalVariable(name: "condition", arg: 2, scope: !341, file: !53, line: 31, type: !204)
!347 = !DILocation(line: 31, column: 61, scope: !341)
!348 = !DILocalVariable(name: "data", arg: 3, scope: !341, file: !53, line: 32, type: !64)
!349 = !DILocation(line: 32, column: 13, scope: !341)
!350 = !DILocalVariable(name: "rec", scope: !341, file: !53, line: 34, type: !51)
!351 = !DILocation(line: 34, column: 19, scope: !341)
!352 = !DILocation(line: 34, column: 25, scope: !341)
!353 = !DILocalVariable(name: "icond", scope: !341, file: !53, line: 35, type: !57)
!354 = !DILocation(line: 35, column: 6, scope: !341)
!355 = !DILocation(line: 37, column: 6, scope: !356)
!356 = distinct !DILexicalBlock(scope: !341, file: !53, line: 37, column: 6)
!357 = !DILocation(line: 37, column: 16, scope: !356)
!358 = !DILocation(line: 37, column: 6, scope: !341)
!359 = !DILocation(line: 39, column: 7, scope: !360)
!360 = distinct !DILexicalBlock(scope: !361, file: !53, line: 39, column: 7)
!361 = distinct !DILexicalBlock(scope: !356, file: !53, line: 37, column: 53)
!362 = !DILocation(line: 39, column: 12, scope: !360)
!363 = !DILocation(line: 39, column: 22, scope: !360)
!364 = !DILocation(line: 39, column: 7, scope: !361)
!365 = !DILocation(line: 40, column: 10, scope: !360)
!366 = !DILocation(line: 40, column: 4, scope: !360)
!367 = !DILocation(line: 42, column: 10, scope: !360)
!368 = !DILocation(line: 43, column: 2, scope: !361)
!369 = !DILocation(line: 45, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !341, file: !53, line: 45, column: 6)
!371 = !DILocation(line: 45, column: 16, scope: !370)
!372 = !DILocation(line: 45, column: 6, scope: !341)
!373 = !DILocation(line: 46, column: 9, scope: !370)
!374 = !DILocation(line: 46, column: 3, scope: !370)
!375 = !DILocation(line: 47, column: 6, scope: !376)
!376 = distinct !DILexicalBlock(scope: !341, file: !53, line: 47, column: 6)
!377 = !DILocation(line: 47, column: 16, scope: !376)
!378 = !DILocation(line: 47, column: 6, scope: !341)
!379 = !DILocation(line: 48, column: 9, scope: !376)
!380 = !DILocation(line: 48, column: 3, scope: !376)
!381 = !DILocation(line: 50, column: 6, scope: !382)
!382 = distinct !DILexicalBlock(scope: !341, file: !53, line: 50, column: 6)
!383 = !DILocation(line: 50, column: 11, scope: !382)
!384 = !DILocation(line: 50, column: 23, scope: !382)
!385 = !DILocation(line: 50, column: 21, scope: !382)
!386 = !DILocation(line: 50, column: 6, scope: !341)
!387 = !DILocation(line: 51, column: 3, scope: !382)
!388 = !DILocation(line: 51, column: 8, scope: !382)
!389 = !DILocation(line: 51, column: 17, scope: !382)
!390 = !DILocation(line: 51, column: 22, scope: !382)
!391 = !DILocation(line: 51, column: 28, scope: !382)
!392 = !DILocation(line: 51, column: 36, scope: !382)
!393 = !DILocation(line: 53, column: 2, scope: !341)
!394 = distinct !DISubprogram(name: "g_input_add", scope: !53, file: !53, line: 80, type: !395, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!395 = !DISubroutineType(types: !396)
!396 = !{!57, !65, !57, !59, !64}
!397 = !DILocalVariable(name: "source", arg: 1, scope: !394, file: !53, line: 80, type: !65)
!398 = !DILocation(line: 80, column: 29, scope: !394)
!399 = !DILocalVariable(name: "condition", arg: 2, scope: !394, file: !53, line: 80, type: !57)
!400 = !DILocation(line: 80, column: 41, scope: !394)
!401 = !DILocalVariable(name: "function", arg: 3, scope: !394, file: !53, line: 81, type: !59)
!402 = !DILocation(line: 81, column: 18, scope: !394)
!403 = !DILocalVariable(name: "data", arg: 4, scope: !394, file: !53, line: 81, type: !64)
!404 = !DILocation(line: 81, column: 34, scope: !394)
!405 = !DILocation(line: 83, column: 26, scope: !394)
!406 = !DILocation(line: 83, column: 37, scope: !394)
!407 = !DILocation(line: 84, column: 5, scope: !394)
!408 = !DILocation(line: 84, column: 15, scope: !394)
!409 = !DILocation(line: 83, column: 9, scope: !394)
!410 = !DILocation(line: 83, column: 2, scope: !394)
!411 = distinct !DISubprogram(name: "g_input_add_poll", scope: !53, file: !53, line: 88, type: !412, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!412 = !DISubroutineType(types: !413)
!413 = !{!57, !57, !57, !57, !59, !64}
!414 = !DILocalVariable(name: "fd", arg: 1, scope: !411, file: !53, line: 88, type: !57)
!415 = !DILocation(line: 88, column: 26, scope: !411)
!416 = !DILocalVariable(name: "priority", arg: 2, scope: !411, file: !53, line: 88, type: !57)
!417 = !DILocation(line: 88, column: 34, scope: !411)
!418 = !DILocalVariable(name: "condition", arg: 3, scope: !411, file: !53, line: 88, type: !57)
!419 = !DILocation(line: 88, column: 48, scope: !411)
!420 = !DILocalVariable(name: "function", arg: 4, scope: !411, file: !53, line: 89, type: !59)
!421 = !DILocation(line: 89, column: 23, scope: !411)
!422 = !DILocalVariable(name: "data", arg: 5, scope: !411, file: !53, line: 89, type: !64)
!423 = !DILocation(line: 89, column: 39, scope: !411)
!424 = !DILocalVariable(name: "source", scope: !411, file: !53, line: 91, type: !65)
!425 = !DILocation(line: 91, column: 14, scope: !411)
!426 = !DILocation(line: 91, column: 45, scope: !411)
!427 = !DILocation(line: 91, column: 23, scope: !411)
!428 = !DILocalVariable(name: "ret", scope: !411, file: !53, line: 92, type: !57)
!429 = !DILocation(line: 92, column: 6, scope: !411)
!430 = !DILocation(line: 92, column: 29, scope: !411)
!431 = !DILocation(line: 92, column: 37, scope: !411)
!432 = !DILocation(line: 92, column: 47, scope: !411)
!433 = !DILocation(line: 92, column: 58, scope: !411)
!434 = !DILocation(line: 92, column: 68, scope: !411)
!435 = !DILocation(line: 92, column: 12, scope: !411)
!436 = !DILocation(line: 93, column: 21, scope: !411)
!437 = !DILocation(line: 93, column: 2, scope: !411)
!438 = !DILocation(line: 94, column: 9, scope: !411)
!439 = !DILocation(line: 94, column: 2, scope: !411)
!440 = distinct !DISubprogram(name: "g_timeval_cmp", scope: !53, file: !53, line: 97, type: !441, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!441 = !DISubroutineType(types: !442)
!442 = !{!57, !443, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !71, line: 504, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !71, line: 506, size: 128, align: 64, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !446, file: !71, line: 508, baseType: !265, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !446, file: !71, line: 509, baseType: !265, size: 64, align: 64, offset: 64)
!450 = !DILocalVariable(name: "tv1", arg: 1, scope: !440, file: !53, line: 97, type: !443)
!451 = !DILocation(line: 97, column: 35, scope: !440)
!452 = !DILocalVariable(name: "tv2", arg: 2, scope: !440, file: !53, line: 97, type: !443)
!453 = !DILocation(line: 97, column: 56, scope: !440)
!454 = !DILocation(line: 99, column: 6, scope: !455)
!455 = distinct !DILexicalBlock(scope: !440, file: !53, line: 99, column: 6)
!456 = !DILocation(line: 99, column: 11, scope: !455)
!457 = !DILocation(line: 99, column: 20, scope: !455)
!458 = !DILocation(line: 99, column: 25, scope: !455)
!459 = !DILocation(line: 99, column: 18, scope: !455)
!460 = !DILocation(line: 99, column: 6, scope: !440)
!461 = !DILocation(line: 100, column: 3, scope: !455)
!462 = !DILocation(line: 101, column: 6, scope: !463)
!463 = distinct !DILexicalBlock(scope: !440, file: !53, line: 101, column: 6)
!464 = !DILocation(line: 101, column: 11, scope: !463)
!465 = !DILocation(line: 101, column: 20, scope: !463)
!466 = !DILocation(line: 101, column: 25, scope: !463)
!467 = !DILocation(line: 101, column: 18, scope: !463)
!468 = !DILocation(line: 101, column: 6, scope: !440)
!469 = !DILocation(line: 102, column: 3, scope: !463)
!470 = !DILocation(line: 104, column: 9, scope: !440)
!471 = !DILocation(line: 104, column: 14, scope: !440)
!472 = !DILocation(line: 104, column: 24, scope: !440)
!473 = !DILocation(line: 104, column: 29, scope: !440)
!474 = !DILocation(line: 104, column: 22, scope: !440)
!475 = !DILocation(line: 104, column: 9, scope: !476)
!476 = !DILexicalBlockFile(scope: !440, file: !53, discriminator: 1)
!477 = !DILocation(line: 105, column: 3, scope: !440)
!478 = !DILocation(line: 105, column: 8, scope: !440)
!479 = !DILocation(line: 105, column: 18, scope: !440)
!480 = !DILocation(line: 105, column: 23, scope: !440)
!481 = !DILocation(line: 105, column: 16, scope: !440)
!482 = !DILocation(line: 104, column: 9, scope: !483)
!483 = !DILexicalBlockFile(scope: !440, file: !53, discriminator: 2)
!484 = !DILocation(line: 104, column: 9, scope: !485)
!485 = !DILexicalBlockFile(scope: !440, file: !53, discriminator: 3)
!486 = !DILocation(line: 104, column: 2, scope: !485)
!487 = !DILocation(line: 106, column: 1, scope: !440)
!488 = distinct !DISubprogram(name: "get_timeval_diff", scope: !53, file: !53, line: 108, type: !489, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!489 = !DISubroutineType(types: !490)
!490 = !{!113, !443, !443}
!491 = !DILocalVariable(name: "tv1", arg: 1, scope: !488, file: !53, line: 108, type: !443)
!492 = !DILocation(line: 108, column: 39, scope: !488)
!493 = !DILocalVariable(name: "tv2", arg: 2, scope: !488, file: !53, line: 108, type: !443)
!494 = !DILocation(line: 108, column: 60, scope: !488)
!495 = !DILocalVariable(name: "secs", scope: !488, file: !53, line: 110, type: !113)
!496 = !DILocation(line: 110, column: 7, scope: !488)
!497 = !DILocalVariable(name: "usecs", scope: !488, file: !53, line: 110, type: !113)
!498 = !DILocation(line: 110, column: 13, scope: !488)
!499 = !DILocation(line: 112, column: 9, scope: !488)
!500 = !DILocation(line: 112, column: 14, scope: !488)
!501 = !DILocation(line: 112, column: 23, scope: !488)
!502 = !DILocation(line: 112, column: 28, scope: !488)
!503 = !DILocation(line: 112, column: 21, scope: !488)
!504 = !DILocation(line: 112, column: 7, scope: !488)
!505 = !DILocation(line: 113, column: 10, scope: !488)
!506 = !DILocation(line: 113, column: 15, scope: !488)
!507 = !DILocation(line: 113, column: 25, scope: !488)
!508 = !DILocation(line: 113, column: 30, scope: !488)
!509 = !DILocation(line: 113, column: 23, scope: !488)
!510 = !DILocation(line: 113, column: 8, scope: !488)
!511 = !DILocation(line: 114, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !488, file: !53, line: 114, column: 6)
!513 = !DILocation(line: 114, column: 12, scope: !512)
!514 = !DILocation(line: 114, column: 6, scope: !488)
!515 = !DILocation(line: 115, column: 9, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !53, line: 114, column: 17)
!517 = !DILocation(line: 116, column: 7, scope: !516)
!518 = !DILocation(line: 117, column: 2, scope: !516)
!519 = !DILocation(line: 118, column: 10, scope: !488)
!520 = !DILocation(line: 118, column: 15, scope: !488)
!521 = !DILocation(line: 118, column: 23, scope: !488)
!522 = !DILocation(line: 118, column: 28, scope: !488)
!523 = !DILocation(line: 118, column: 21, scope: !488)
!524 = !DILocation(line: 118, column: 8, scope: !488)
!525 = !DILocation(line: 120, column: 9, scope: !488)
!526 = !DILocation(line: 120, column: 2, scope: !488)
!527 = distinct !DISubprogram(name: "find_substr", scope: !53, file: !53, line: 123, type: !528, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!528 = !DISubroutineType(types: !529)
!529 = !{!57, !252, !252}
!530 = !DILocalVariable(name: "list", arg: 1, scope: !527, file: !53, line: 123, type: !252)
!531 = !DILocation(line: 123, column: 29, scope: !527)
!532 = !DILocalVariable(name: "item", arg: 2, scope: !527, file: !53, line: 123, type: !252)
!533 = !DILocation(line: 123, column: 47, scope: !527)
!534 = !DILocalVariable(name: "ptr", scope: !527, file: !53, line: 125, type: !252)
!535 = !DILocation(line: 125, column: 14, scope: !527)
!536 = !DILocation(line: 127, column: 2, scope: !527)
!537 = distinct !{!537, !536}
!538 = !DILocation(line: 127, column: 10, scope: !539)
!539 = !DILexicalBlockFile(scope: !540, file: !53, discriminator: 1)
!540 = distinct !DILexicalBlock(scope: !541, file: !53, line: 127, column: 10)
!541 = distinct !DILexicalBlock(scope: !527, file: !53, line: 127, column: 4)
!542 = !DILocation(line: 127, column: 15, scope: !539)
!543 = !DILocation(line: 127, column: 5, scope: !544)
!544 = !DILexicalBlockFile(scope: !545, file: !53, discriminator: 2)
!545 = distinct !DILexicalBlock(scope: !540, file: !53, line: 127, column: 3)
!546 = !DILocation(line: 127, column: 14, scope: !547)
!547 = !DILexicalBlockFile(scope: !548, file: !53, discriminator: 3)
!548 = distinct !DILexicalBlock(scope: !540, file: !53, line: 127, column: 12)
!549 = !DILocation(line: 127, column: 99, scope: !547)
!550 = !DILocation(line: 127, column: 116, scope: !551)
!551 = !DILexicalBlockFile(scope: !541, file: !53, discriminator: 4)
!552 = !DILocation(line: 128, column: 2, scope: !527)
!553 = distinct !{!553, !552}
!554 = !DILocation(line: 128, column: 10, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !53, discriminator: 1)
!556 = distinct !DILexicalBlock(scope: !557, file: !53, line: 128, column: 10)
!557 = distinct !DILexicalBlock(scope: !527, file: !53, line: 128, column: 4)
!558 = !DILocation(line: 128, column: 15, scope: !555)
!559 = !DILocation(line: 128, column: 5, scope: !560)
!560 = !DILexicalBlockFile(scope: !561, file: !53, discriminator: 2)
!561 = distinct !DILexicalBlock(scope: !556, file: !53, line: 128, column: 3)
!562 = !DILocation(line: 128, column: 14, scope: !563)
!563 = !DILexicalBlockFile(scope: !564, file: !53, discriminator: 3)
!564 = distinct !DILexicalBlock(scope: !556, file: !53, line: 128, column: 12)
!565 = !DILocation(line: 128, column: 99, scope: !563)
!566 = !DILocation(line: 128, column: 116, scope: !567)
!567 = !DILexicalBlockFile(scope: !557, file: !53, discriminator: 4)
!568 = !DILocation(line: 130, column: 7, scope: !569)
!569 = distinct !DILexicalBlock(scope: !527, file: !53, line: 130, column: 6)
!570 = !DILocation(line: 130, column: 6, scope: !569)
!571 = !DILocation(line: 130, column: 12, scope: !569)
!572 = !DILocation(line: 130, column: 6, scope: !527)
!573 = !DILocation(line: 131, column: 3, scope: !569)
!574 = !DILocation(line: 133, column: 2, scope: !527)
!575 = !DILocation(line: 134, column: 3, scope: !576)
!576 = distinct !DILexicalBlock(scope: !577, file: !53, line: 133, column: 11)
!577 = distinct !DILexicalBlock(scope: !578, file: !53, line: 133, column: 2)
!578 = distinct !DILexicalBlock(scope: !527, file: !53, line: 133, column: 2)
!579 = !DILocation(line: 134, column: 33, scope: !580)
!580 = !DILexicalBlockFile(scope: !576, file: !53, discriminator: 1)
!581 = !DILocation(line: 134, column: 32, scope: !580)
!582 = !DILocation(line: 134, column: 9, scope: !580)
!583 = !DILocation(line: 134, column: 10, scope: !580)
!584 = !DILocation(line: 134, column: 12, scope: !580)
!585 = !DILocation(line: 134, column: 11, scope: !580)
!586 = !DILocation(line: 134, column: 13, scope: !580)
!587 = !DILocation(line: 134, column: 3, scope: !580)
!588 = !DILocation(line: 134, column: 31, scope: !589)
!589 = !DILexicalBlockFile(scope: !576, file: !53, discriminator: 2)
!590 = !DILocation(line: 134, column: 3, scope: !589)
!591 = distinct !{!591, !575}
!592 = !DILocation(line: 135, column: 8, scope: !593)
!593 = distinct !DILexicalBlock(scope: !576, file: !53, line: 135, column: 7)
!594 = !DILocation(line: 135, column: 7, scope: !593)
!595 = !DILocation(line: 135, column: 13, scope: !593)
!596 = !DILocation(line: 135, column: 7, scope: !576)
!597 = !DILocation(line: 135, column: 22, scope: !598)
!598 = !DILexicalBlockFile(scope: !593, file: !53, discriminator: 1)
!599 = !DILocation(line: 137, column: 16, scope: !576)
!600 = !DILocation(line: 137, column: 9, scope: !576)
!601 = !DILocation(line: 137, column: 7, scope: !576)
!602 = !DILocation(line: 138, column: 7, scope: !603)
!603 = distinct !DILexicalBlock(scope: !576, file: !53, line: 138, column: 7)
!604 = !DILocation(line: 138, column: 11, scope: !603)
!605 = !DILocation(line: 138, column: 7, scope: !576)
!606 = !DILocation(line: 138, column: 25, scope: !607)
!607 = !DILexicalBlockFile(scope: !603, file: !53, discriminator: 1)
!608 = !DILocation(line: 138, column: 37, scope: !607)
!609 = !DILocation(line: 138, column: 30, scope: !607)
!610 = !DILocation(line: 138, column: 29, scope: !607)
!611 = !DILocation(line: 138, column: 23, scope: !607)
!612 = !DILocation(line: 138, column: 19, scope: !607)
!613 = !DILocation(line: 140, column: 27, scope: !614)
!614 = distinct !DILexicalBlock(scope: !576, file: !53, line: 140, column: 7)
!615 = !DILocation(line: 140, column: 33, scope: !614)
!616 = !DILocation(line: 140, column: 39, scope: !614)
!617 = !DILocation(line: 140, column: 43, scope: !614)
!618 = !DILocation(line: 140, column: 42, scope: !614)
!619 = !DILocation(line: 140, column: 7, scope: !614)
!620 = !DILocation(line: 140, column: 49, scope: !614)
!621 = !DILocation(line: 140, column: 54, scope: !614)
!622 = !DILocation(line: 141, column: 12, scope: !614)
!623 = !DILocation(line: 141, column: 16, scope: !614)
!624 = !DILocation(line: 141, column: 15, scope: !614)
!625 = !DILocation(line: 141, column: 7, scope: !614)
!626 = !DILocation(line: 141, column: 22, scope: !614)
!627 = !DILocation(line: 140, column: 7, scope: !580)
!628 = !DILocation(line: 142, column: 4, scope: !614)
!629 = !DILocation(line: 144, column: 10, scope: !576)
!630 = !DILocation(line: 144, column: 8, scope: !576)
!631 = !DILocation(line: 133, column: 2, scope: !632)
!632 = !DILexicalBlockFile(scope: !577, file: !53, discriminator: 1)
!633 = distinct !{!633, !574}
!634 = !DILocation(line: 147, column: 2, scope: !527)
!635 = !DILocation(line: 148, column: 1, scope: !527)
!636 = distinct !DISubprogram(name: "strarray_find", scope: !53, file: !53, line: 150, type: !637, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!637 = !DISubroutineType(types: !638)
!638 = !{!57, !269, !252}
!639 = !DILocalVariable(name: "array", arg: 1, scope: !636, file: !53, line: 150, type: !269)
!640 = !DILocation(line: 150, column: 26, scope: !636)
!641 = !DILocalVariable(name: "item", arg: 2, scope: !636, file: !53, line: 150, type: !252)
!642 = !DILocation(line: 150, column: 45, scope: !636)
!643 = !DILocalVariable(name: "tmp", scope: !636, file: !53, line: 152, type: !269)
!644 = !DILocation(line: 152, column: 9, scope: !636)
!645 = !DILocalVariable(name: "index", scope: !636, file: !53, line: 153, type: !57)
!646 = !DILocation(line: 153, column: 6, scope: !636)
!647 = !DILocation(line: 155, column: 2, scope: !636)
!648 = distinct !{!648, !647}
!649 = !DILocation(line: 155, column: 10, scope: !650)
!650 = !DILexicalBlockFile(scope: !651, file: !53, discriminator: 1)
!651 = distinct !DILexicalBlock(scope: !652, file: !53, line: 155, column: 10)
!652 = distinct !DILexicalBlock(scope: !636, file: !53, line: 155, column: 4)
!653 = !DILocation(line: 155, column: 16, scope: !650)
!654 = !DILocation(line: 155, column: 5, scope: !655)
!655 = !DILexicalBlockFile(scope: !656, file: !53, discriminator: 2)
!656 = distinct !DILexicalBlock(scope: !651, file: !53, line: 155, column: 3)
!657 = !DILocation(line: 155, column: 14, scope: !658)
!658 = !DILexicalBlockFile(scope: !659, file: !53, discriminator: 3)
!659 = distinct !DILexicalBlock(scope: !651, file: !53, line: 155, column: 12)
!660 = !DILocation(line: 155, column: 100, scope: !658)
!661 = !DILocation(line: 155, column: 116, scope: !662)
!662 = !DILexicalBlockFile(scope: !652, file: !53, discriminator: 4)
!663 = !DILocation(line: 156, column: 2, scope: !636)
!664 = distinct !{!664, !663}
!665 = !DILocation(line: 156, column: 10, scope: !666)
!666 = !DILexicalBlockFile(scope: !667, file: !53, discriminator: 1)
!667 = distinct !DILexicalBlock(scope: !668, file: !53, line: 156, column: 10)
!668 = distinct !DILexicalBlock(scope: !636, file: !53, line: 156, column: 4)
!669 = !DILocation(line: 156, column: 15, scope: !666)
!670 = !DILocation(line: 156, column: 5, scope: !671)
!671 = !DILexicalBlockFile(scope: !672, file: !53, discriminator: 2)
!672 = distinct !DILexicalBlock(scope: !667, file: !53, line: 156, column: 3)
!673 = !DILocation(line: 156, column: 14, scope: !674)
!674 = !DILexicalBlockFile(scope: !675, file: !53, discriminator: 3)
!675 = distinct !DILexicalBlock(scope: !667, file: !53, line: 156, column: 12)
!676 = !DILocation(line: 156, column: 99, scope: !674)
!677 = !DILocation(line: 156, column: 115, scope: !678)
!678 = !DILexicalBlockFile(scope: !668, file: !53, discriminator: 4)
!679 = !DILocation(line: 158, column: 8, scope: !636)
!680 = !DILocation(line: 159, column: 13, scope: !681)
!681 = distinct !DILexicalBlock(scope: !636, file: !53, line: 159, column: 2)
!682 = !DILocation(line: 159, column: 11, scope: !681)
!683 = !DILocation(line: 159, column: 7, scope: !681)
!684 = !DILocation(line: 159, column: 21, scope: !685)
!685 = !DILexicalBlockFile(scope: !686, file: !53, discriminator: 1)
!686 = distinct !DILexicalBlock(scope: !681, file: !53, line: 159, column: 2)
!687 = !DILocation(line: 159, column: 20, scope: !685)
!688 = !DILocation(line: 159, column: 25, scope: !685)
!689 = !DILocation(line: 159, column: 2, scope: !685)
!690 = !DILocation(line: 160, column: 27, scope: !691)
!691 = distinct !DILexicalBlock(scope: !692, file: !53, line: 160, column: 7)
!692 = distinct !DILexicalBlock(scope: !686, file: !53, line: 159, column: 49)
!693 = !DILocation(line: 160, column: 26, scope: !691)
!694 = !DILocation(line: 160, column: 32, scope: !691)
!695 = !DILocation(line: 160, column: 7, scope: !691)
!696 = !DILocation(line: 160, column: 38, scope: !691)
!697 = !DILocation(line: 160, column: 7, scope: !692)
!698 = !DILocation(line: 161, column: 11, scope: !691)
!699 = !DILocation(line: 161, column: 4, scope: !691)
!700 = !DILocation(line: 162, column: 2, scope: !692)
!701 = !DILocation(line: 159, column: 36, scope: !702)
!702 = !DILexicalBlockFile(scope: !686, file: !53, discriminator: 2)
!703 = !DILocation(line: 159, column: 45, scope: !702)
!704 = !DILocation(line: 159, column: 2, scope: !702)
!705 = distinct !{!705, !706}
!706 = !DILocation(line: 159, column: 2, scope: !636)
!707 = !DILocation(line: 164, column: 2, scope: !636)
!708 = !DILocation(line: 165, column: 1, scope: !636)
!709 = distinct !DISubprogram(name: "gslist_find_string", scope: !53, file: !53, line: 167, type: !710, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!710 = !DISubroutineType(types: !711)
!711 = !{!189, !189, !252}
!712 = !DILocalVariable(name: "list", arg: 1, scope: !709, file: !53, line: 167, type: !189)
!713 = !DILocation(line: 167, column: 36, scope: !709)
!714 = !DILocalVariable(name: "key", arg: 2, scope: !709, file: !53, line: 167, type: !252)
!715 = !DILocation(line: 167, column: 54, scope: !709)
!716 = !DILocation(line: 169, column: 2, scope: !709)
!717 = !DILocation(line: 169, column: 9, scope: !718)
!718 = !DILexicalBlockFile(scope: !719, file: !53, discriminator: 1)
!719 = distinct !DILexicalBlock(scope: !720, file: !53, line: 169, column: 2)
!720 = distinct !DILexicalBlock(scope: !709, file: !53, line: 169, column: 2)
!721 = !DILocation(line: 169, column: 14, scope: !718)
!722 = !DILocation(line: 169, column: 2, scope: !718)
!723 = !DILocation(line: 170, column: 17, scope: !724)
!724 = distinct !DILexicalBlock(scope: !719, file: !53, line: 170, column: 7)
!725 = !DILocation(line: 170, column: 23, scope: !724)
!726 = !DILocation(line: 170, column: 29, scope: !724)
!727 = !DILocation(line: 170, column: 7, scope: !724)
!728 = !DILocation(line: 170, column: 34, scope: !724)
!729 = !DILocation(line: 170, column: 7, scope: !719)
!730 = !DILocation(line: 170, column: 47, scope: !731)
!731 = !DILexicalBlockFile(scope: !724, file: !53, discriminator: 1)
!732 = !DILocation(line: 170, column: 40, scope: !731)
!733 = !DILocation(line: 170, column: 37, scope: !734)
!734 = !DILexicalBlockFile(scope: !724, file: !53, discriminator: 2)
!735 = !DILocation(line: 169, column: 29, scope: !736)
!736 = !DILexicalBlockFile(scope: !719, file: !53, discriminator: 2)
!737 = !DILocation(line: 169, column: 35, scope: !736)
!738 = !DILocation(line: 169, column: 27, scope: !736)
!739 = !DILocation(line: 169, column: 2, scope: !736)
!740 = distinct !{!740, !716}
!741 = !DILocation(line: 172, column: 2, scope: !709)
!742 = !DILocation(line: 173, column: 1, scope: !709)
!743 = distinct !DISubprogram(name: "gslist_find_icase_string", scope: !53, file: !53, line: 175, type: !710, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!744 = !DILocalVariable(name: "list", arg: 1, scope: !743, file: !53, line: 175, type: !189)
!745 = !DILocation(line: 175, column: 42, scope: !743)
!746 = !DILocalVariable(name: "key", arg: 2, scope: !743, file: !53, line: 175, type: !252)
!747 = !DILocation(line: 175, column: 60, scope: !743)
!748 = !DILocation(line: 177, column: 2, scope: !743)
!749 = !DILocation(line: 177, column: 9, scope: !750)
!750 = !DILexicalBlockFile(scope: !751, file: !53, discriminator: 1)
!751 = distinct !DILexicalBlock(scope: !752, file: !53, line: 177, column: 2)
!752 = distinct !DILexicalBlock(scope: !743, file: !53, line: 177, column: 2)
!753 = !DILocation(line: 177, column: 14, scope: !750)
!754 = !DILocation(line: 177, column: 2, scope: !750)
!755 = !DILocation(line: 178, column: 26, scope: !756)
!756 = distinct !DILexicalBlock(scope: !751, file: !53, line: 178, column: 7)
!757 = !DILocation(line: 178, column: 32, scope: !756)
!758 = !DILocation(line: 178, column: 38, scope: !756)
!759 = !DILocation(line: 178, column: 7, scope: !756)
!760 = !DILocation(line: 178, column: 43, scope: !756)
!761 = !DILocation(line: 178, column: 7, scope: !751)
!762 = !DILocation(line: 178, column: 56, scope: !763)
!763 = !DILexicalBlockFile(scope: !756, file: !53, discriminator: 1)
!764 = !DILocation(line: 178, column: 49, scope: !763)
!765 = !DILocation(line: 178, column: 46, scope: !766)
!766 = !DILexicalBlockFile(scope: !756, file: !53, discriminator: 2)
!767 = !DILocation(line: 177, column: 29, scope: !768)
!768 = !DILexicalBlockFile(scope: !751, file: !53, discriminator: 2)
!769 = !DILocation(line: 177, column: 35, scope: !768)
!770 = !DILocation(line: 177, column: 27, scope: !768)
!771 = !DILocation(line: 177, column: 2, scope: !768)
!772 = distinct !{!772, !748}
!773 = !DILocation(line: 180, column: 2, scope: !743)
!774 = !DILocation(line: 181, column: 1, scope: !743)
!775 = distinct !DISubprogram(name: "gslist_foreach_find", scope: !53, file: !53, line: 183, type: !776, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!776 = !DISubroutineType(types: !777)
!777 = !{!64, !189, !778, !261}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "FOREACH_FIND_FUNC", file: !779, line: 11, baseType: !780)
!779 = !DIFile(filename: "misc.h", directory: "/home/lichi/Desktop/irssi/task1")
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!64, !64, !64}
!783 = !DILocalVariable(name: "list", arg: 1, scope: !775, file: !53, line: 183, type: !189)
!784 = !DILocation(line: 183, column: 35, scope: !775)
!785 = !DILocalVariable(name: "func", arg: 2, scope: !775, file: !53, line: 183, type: !778)
!786 = !DILocation(line: 183, column: 59, scope: !775)
!787 = !DILocalVariable(name: "data", arg: 3, scope: !775, file: !53, line: 183, type: !261)
!788 = !DILocation(line: 183, column: 77, scope: !775)
!789 = !DILocalVariable(name: "ret", scope: !775, file: !53, line: 185, type: !64)
!790 = !DILocation(line: 185, column: 8, scope: !775)
!791 = !DILocation(line: 187, column: 2, scope: !775)
!792 = !DILocation(line: 187, column: 9, scope: !793)
!793 = !DILexicalBlockFile(scope: !775, file: !53, discriminator: 1)
!794 = !DILocation(line: 187, column: 14, scope: !793)
!795 = !DILocation(line: 187, column: 2, scope: !793)
!796 = !DILocation(line: 188, column: 9, scope: !797)
!797 = distinct !DILexicalBlock(scope: !775, file: !53, line: 187, column: 22)
!798 = !DILocation(line: 188, column: 14, scope: !797)
!799 = !DILocation(line: 188, column: 20, scope: !797)
!800 = !DILocation(line: 188, column: 35, scope: !797)
!801 = !DILocation(line: 188, column: 7, scope: !797)
!802 = !DILocation(line: 189, column: 21, scope: !803)
!803 = distinct !DILexicalBlock(scope: !797, file: !53, line: 189, column: 21)
!804 = !DILocation(line: 189, column: 25, scope: !803)
!805 = !DILocation(line: 189, column: 21, scope: !797)
!806 = !DILocation(line: 189, column: 40, scope: !807)
!807 = !DILexicalBlockFile(scope: !803, file: !53, discriminator: 1)
!808 = !DILocation(line: 189, column: 33, scope: !807)
!809 = !DILocation(line: 191, column: 10, scope: !797)
!810 = !DILocation(line: 191, column: 16, scope: !797)
!811 = !DILocation(line: 191, column: 8, scope: !797)
!812 = !DILocation(line: 187, column: 2, scope: !813)
!813 = !DILexicalBlockFile(scope: !775, file: !53, discriminator: 2)
!814 = distinct !{!814, !791}
!815 = !DILocation(line: 194, column: 2, scope: !775)
!816 = !DILocation(line: 195, column: 1, scope: !775)
!817 = distinct !DISubprogram(name: "gslist_free_full", scope: !53, file: !53, line: 197, type: !818, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !189, !820}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !71, line: 87, baseType: !135)
!821 = !DILocalVariable(name: "list", arg: 1, scope: !817, file: !53, line: 197, type: !189)
!822 = !DILocation(line: 197, column: 32, scope: !817)
!823 = !DILocalVariable(name: "free_func", arg: 2, scope: !817, file: !53, line: 197, type: !820)
!824 = !DILocation(line: 197, column: 53, scope: !817)
!825 = !DILocalVariable(name: "tmp", scope: !817, file: !53, line: 199, type: !189)
!826 = !DILocation(line: 199, column: 10, scope: !817)
!827 = !DILocation(line: 201, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !817, file: !53, line: 201, column: 6)
!829 = !DILocation(line: 201, column: 11, scope: !828)
!830 = !DILocation(line: 201, column: 6, scope: !817)
!831 = !DILocation(line: 202, column: 3, scope: !828)
!832 = !DILocation(line: 204, column: 13, scope: !833)
!833 = distinct !DILexicalBlock(scope: !817, file: !53, line: 204, column: 2)
!834 = !DILocation(line: 204, column: 11, scope: !833)
!835 = !DILocation(line: 204, column: 7, scope: !833)
!836 = !DILocation(line: 204, column: 19, scope: !837)
!837 = !DILexicalBlockFile(scope: !838, file: !53, discriminator: 1)
!838 = distinct !DILexicalBlock(scope: !833, file: !53, line: 204, column: 2)
!839 = !DILocation(line: 204, column: 23, scope: !837)
!840 = !DILocation(line: 204, column: 2, scope: !837)
!841 = !DILocation(line: 205, column: 3, scope: !838)
!842 = !DILocation(line: 205, column: 13, scope: !838)
!843 = !DILocation(line: 205, column: 18, scope: !838)
!844 = !DILocation(line: 204, column: 37, scope: !845)
!845 = !DILexicalBlockFile(scope: !838, file: !53, discriminator: 2)
!846 = !DILocation(line: 204, column: 42, scope: !845)
!847 = !DILocation(line: 204, column: 35, scope: !845)
!848 = !DILocation(line: 204, column: 2, scope: !845)
!849 = distinct !{!849, !850}
!850 = !DILocation(line: 204, column: 2, scope: !817)
!851 = !DILocation(line: 207, column: 15, scope: !817)
!852 = !DILocation(line: 207, column: 2, scope: !817)
!853 = !DILocation(line: 208, column: 1, scope: !817)
!854 = !DILocation(line: 208, column: 1, scope: !855)
!855 = !DILexicalBlockFile(scope: !817, file: !53, discriminator: 1)
!856 = distinct !DISubprogram(name: "gslist_remove_string", scope: !53, file: !53, line: 210, type: !710, isLocal: false, isDefinition: true, scopeLine: 211, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!857 = !DILocalVariable(name: "list", arg: 1, scope: !856, file: !53, line: 210, type: !189)
!858 = !DILocation(line: 210, column: 39, scope: !856)
!859 = !DILocalVariable(name: "str", arg: 2, scope: !856, file: !53, line: 210, type: !252)
!860 = !DILocation(line: 210, column: 57, scope: !856)
!861 = !DILocalVariable(name: "l", scope: !856, file: !53, line: 212, type: !189)
!862 = !DILocation(line: 212, column: 10, scope: !856)
!863 = !DILocation(line: 214, column: 26, scope: !856)
!864 = !DILocation(line: 214, column: 32, scope: !856)
!865 = !DILocation(line: 214, column: 6, scope: !856)
!866 = !DILocation(line: 214, column: 4, scope: !856)
!867 = !DILocation(line: 215, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !856, file: !53, line: 215, column: 6)
!869 = !DILocation(line: 215, column: 8, scope: !868)
!870 = !DILocation(line: 215, column: 6, scope: !856)
!871 = !DILocation(line: 216, column: 30, scope: !868)
!872 = !DILocation(line: 216, column: 36, scope: !868)
!873 = !DILocation(line: 216, column: 10, scope: !868)
!874 = !DILocation(line: 216, column: 3, scope: !868)
!875 = !DILocation(line: 218, column: 9, scope: !856)
!876 = !DILocation(line: 218, column: 2, scope: !856)
!877 = !DILocation(line: 219, column: 1, scope: !856)
!878 = distinct !DISubprogram(name: "gslist_delete_string", scope: !53, file: !53, line: 221, type: !879, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!879 = !DISubroutineType(types: !880)
!880 = !{!189, !189, !252, !820}
!881 = !DILocalVariable(name: "list", arg: 1, scope: !878, file: !53, line: 221, type: !189)
!882 = !DILocation(line: 221, column: 39, scope: !878)
!883 = !DILocalVariable(name: "str", arg: 2, scope: !878, file: !53, line: 221, type: !252)
!884 = !DILocation(line: 221, column: 57, scope: !878)
!885 = !DILocalVariable(name: "free_func", arg: 3, scope: !878, file: !53, line: 221, type: !820)
!886 = !DILocation(line: 221, column: 77, scope: !878)
!887 = !DILocalVariable(name: "l", scope: !878, file: !53, line: 223, type: !189)
!888 = !DILocation(line: 223, column: 10, scope: !878)
!889 = !DILocation(line: 225, column: 26, scope: !878)
!890 = !DILocation(line: 225, column: 32, scope: !878)
!891 = !DILocation(line: 225, column: 6, scope: !878)
!892 = !DILocation(line: 225, column: 4, scope: !878)
!893 = !DILocation(line: 226, column: 6, scope: !894)
!894 = distinct !DILexicalBlock(scope: !878, file: !53, line: 226, column: 6)
!895 = !DILocation(line: 226, column: 8, scope: !894)
!896 = !DILocation(line: 226, column: 6, scope: !878)
!897 = !DILocation(line: 227, column: 3, scope: !898)
!898 = distinct !DILexicalBlock(scope: !894, file: !53, line: 226, column: 16)
!899 = !DILocation(line: 227, column: 13, scope: !898)
!900 = !DILocation(line: 227, column: 16, scope: !898)
!901 = !DILocation(line: 228, column: 30, scope: !898)
!902 = !DILocation(line: 228, column: 36, scope: !898)
!903 = !DILocation(line: 228, column: 10, scope: !898)
!904 = !DILocation(line: 228, column: 3, scope: !898)
!905 = !DILocation(line: 231, column: 9, scope: !878)
!906 = !DILocation(line: 231, column: 2, scope: !878)
!907 = !DILocation(line: 232, column: 1, scope: !878)
!908 = distinct !DISubprogram(name: "gslistptr_to_string", scope: !53, file: !53, line: 235, type: !909, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!909 = !DISubroutineType(types: !910)
!910 = !{!199, !189, !57, !252}
!911 = !DILocalVariable(name: "list", arg: 1, scope: !908, file: !53, line: 235, type: !189)
!912 = !DILocation(line: 235, column: 35, scope: !908)
!913 = !DILocalVariable(name: "offset", arg: 2, scope: !908, file: !53, line: 235, type: !57)
!914 = !DILocation(line: 235, column: 45, scope: !908)
!915 = !DILocalVariable(name: "delimiter", arg: 3, scope: !908, file: !53, line: 235, type: !252)
!916 = !DILocation(line: 235, column: 65, scope: !908)
!917 = !DILocalVariable(name: "str", scope: !908, file: !53, line: 237, type: !229)
!918 = !DILocation(line: 237, column: 11, scope: !908)
!919 = !DILocalVariable(name: "data", scope: !908, file: !53, line: 238, type: !269)
!920 = !DILocation(line: 238, column: 9, scope: !908)
!921 = !DILocalVariable(name: "ret", scope: !908, file: !53, line: 238, type: !199)
!922 = !DILocation(line: 238, column: 16, scope: !908)
!923 = !DILocation(line: 240, column: 8, scope: !908)
!924 = !DILocation(line: 240, column: 6, scope: !908)
!925 = !DILocation(line: 241, column: 2, scope: !908)
!926 = !DILocation(line: 241, column: 9, scope: !927)
!927 = !DILexicalBlockFile(scope: !908, file: !53, discriminator: 1)
!928 = !DILocation(line: 241, column: 14, scope: !927)
!929 = !DILocation(line: 241, column: 2, scope: !927)
!930 = !DILocation(line: 242, column: 34, scope: !931)
!931 = distinct !DILexicalBlock(scope: !908, file: !53, line: 241, column: 22)
!932 = !DILocation(line: 242, column: 40, scope: !931)
!933 = !DILocation(line: 242, column: 57, scope: !931)
!934 = !DILocation(line: 242, column: 48, scope: !931)
!935 = !DILocation(line: 242, column: 46, scope: !931)
!936 = !DILocation(line: 242, column: 10, scope: !931)
!937 = !DILocation(line: 242, column: 8, scope: !931)
!938 = !DILocation(line: 244, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !931, file: !53, line: 244, column: 7)
!940 = !DILocation(line: 244, column: 12, scope: !939)
!941 = !DILocation(line: 244, column: 16, scope: !939)
!942 = !DILocation(line: 244, column: 7, scope: !931)
!943 = !DILocation(line: 244, column: 38, scope: !944)
!944 = !DILexicalBlockFile(scope: !939, file: !53, discriminator: 1)
!945 = !DILocation(line: 244, column: 43, scope: !944)
!946 = !DILocation(line: 244, column: 22, scope: !944)
!947 = !DILocation(line: 245, column: 19, scope: !931)
!948 = !DILocation(line: 245, column: 25, scope: !931)
!949 = !DILocation(line: 245, column: 24, scope: !931)
!950 = !DILocation(line: 245, column: 3, scope: !931)
!951 = !DILocation(line: 246, column: 10, scope: !931)
!952 = !DILocation(line: 246, column: 16, scope: !931)
!953 = !DILocation(line: 246, column: 8, scope: !931)
!954 = !DILocation(line: 241, column: 2, scope: !955)
!955 = !DILexicalBlockFile(scope: !908, file: !53, discriminator: 2)
!956 = distinct !{!956, !925}
!957 = !DILocation(line: 249, column: 15, scope: !908)
!958 = !DILocation(line: 249, column: 20, scope: !908)
!959 = !DILocation(line: 249, column: 13, scope: !908)
!960 = !DILocation(line: 250, column: 16, scope: !908)
!961 = !DILocation(line: 250, column: 2, scope: !908)
!962 = !DILocation(line: 251, column: 9, scope: !908)
!963 = !DILocation(line: 251, column: 2, scope: !908)
!964 = distinct !DISubprogram(name: "gslist_to_string", scope: !53, file: !53, line: 255, type: !965, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!965 = !DISubroutineType(types: !966)
!966 = !{!199, !189, !252}
!967 = !DILocalVariable(name: "list", arg: 1, scope: !964, file: !53, line: 255, type: !189)
!968 = !DILocation(line: 255, column: 32, scope: !964)
!969 = !DILocalVariable(name: "delimiter", arg: 2, scope: !964, file: !53, line: 255, type: !252)
!970 = !DILocation(line: 255, column: 50, scope: !964)
!971 = !DILocalVariable(name: "str", scope: !964, file: !53, line: 257, type: !229)
!972 = !DILocation(line: 257, column: 11, scope: !964)
!973 = !DILocalVariable(name: "ret", scope: !964, file: !53, line: 258, type: !199)
!974 = !DILocation(line: 258, column: 8, scope: !964)
!975 = !DILocation(line: 260, column: 8, scope: !964)
!976 = !DILocation(line: 260, column: 6, scope: !964)
!977 = !DILocation(line: 261, column: 2, scope: !964)
!978 = !DILocation(line: 261, column: 9, scope: !979)
!979 = !DILexicalBlockFile(scope: !964, file: !53, discriminator: 1)
!980 = !DILocation(line: 261, column: 14, scope: !979)
!981 = !DILocation(line: 261, column: 2, scope: !979)
!982 = !DILocation(line: 262, column: 7, scope: !983)
!983 = distinct !DILexicalBlock(scope: !984, file: !53, line: 262, column: 7)
!984 = distinct !DILexicalBlock(scope: !964, file: !53, line: 261, column: 22)
!985 = !DILocation(line: 262, column: 12, scope: !983)
!986 = !DILocation(line: 262, column: 16, scope: !983)
!987 = !DILocation(line: 262, column: 7, scope: !984)
!988 = !DILocation(line: 262, column: 38, scope: !989)
!989 = !DILexicalBlockFile(scope: !983, file: !53, discriminator: 1)
!990 = !DILocation(line: 262, column: 43, scope: !989)
!991 = !DILocation(line: 262, column: 22, scope: !989)
!992 = !DILocation(line: 263, column: 19, scope: !984)
!993 = !DILocation(line: 263, column: 24, scope: !984)
!994 = !DILocation(line: 263, column: 30, scope: !984)
!995 = !DILocation(line: 263, column: 3, scope: !984)
!996 = !DILocation(line: 265, column: 10, scope: !984)
!997 = !DILocation(line: 265, column: 16, scope: !984)
!998 = !DILocation(line: 265, column: 8, scope: !984)
!999 = !DILocation(line: 261, column: 2, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !964, file: !53, discriminator: 2)
!1001 = distinct !{!1001, !977}
!1002 = !DILocation(line: 268, column: 15, scope: !964)
!1003 = !DILocation(line: 268, column: 20, scope: !964)
!1004 = !DILocation(line: 268, column: 13, scope: !964)
!1005 = !DILocation(line: 269, column: 16, scope: !964)
!1006 = !DILocation(line: 269, column: 2, scope: !964)
!1007 = !DILocation(line: 270, column: 9, scope: !964)
!1008 = !DILocation(line: 270, column: 2, scope: !964)
!1009 = distinct !DISubprogram(name: "hash_save_key", scope: !53, file: !53, line: 273, type: !1010, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !199, !64, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!1013 = !DILocalVariable(name: "key", arg: 1, scope: !1009, file: !53, line: 273, type: !199)
!1014 = !DILocation(line: 273, column: 26, scope: !1009)
!1015 = !DILocalVariable(name: "value", arg: 2, scope: !1009, file: !53, line: 273, type: !64)
!1016 = !DILocation(line: 273, column: 37, scope: !1009)
!1017 = !DILocalVariable(name: "list", arg: 3, scope: !1009, file: !53, line: 273, type: !1012)
!1018 = !DILocation(line: 273, column: 53, scope: !1009)
!1019 = !DILocation(line: 275, column: 33, scope: !1009)
!1020 = !DILocation(line: 275, column: 32, scope: !1009)
!1021 = !DILocation(line: 275, column: 39, scope: !1009)
!1022 = !DILocation(line: 275, column: 17, scope: !1009)
!1023 = !DILocation(line: 275, column: 10, scope: !1009)
!1024 = !DILocation(line: 275, column: 15, scope: !1009)
!1025 = !DILocation(line: 276, column: 1, scope: !1009)
!1026 = distinct !DISubprogram(name: "optlist_remove_known", scope: !53, file: !53, line: 280, type: !1027, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!1029, !252, !1037}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1031, line: 37, baseType: !1032)
!1031 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1031, line: 39, size: 192, align: 64, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !1031, line: 41, baseType: !128, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1032, file: !1031, line: 42, baseType: !1029, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1032, file: !1031, line: 43, baseType: !1029, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !1039, line: 37, baseType: !1040)
!1039 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !1039, line: 37, flags: DIFlagFwdDecl)
!1041 = !DILocalVariable(name: "cmd", arg: 1, scope: !1026, file: !53, line: 280, type: !252)
!1042 = !DILocation(line: 280, column: 41, scope: !1026)
!1043 = !DILocalVariable(name: "optlist", arg: 2, scope: !1026, file: !53, line: 280, type: !1037)
!1044 = !DILocation(line: 280, column: 58, scope: !1026)
!1045 = !DILocalVariable(name: "list", scope: !1026, file: !53, line: 282, type: !1029)
!1046 = !DILocation(line: 282, column: 9, scope: !1026)
!1047 = !DILocalVariable(name: "tmp", scope: !1026, file: !53, line: 282, type: !1029)
!1048 = !DILocation(line: 282, column: 16, scope: !1026)
!1049 = !DILocalVariable(name: "next", scope: !1026, file: !53, line: 282, type: !1029)
!1050 = !DILocation(line: 282, column: 22, scope: !1026)
!1051 = !DILocation(line: 284, column: 31, scope: !1026)
!1052 = !DILocation(line: 284, column: 9, scope: !1026)
!1053 = !DILocation(line: 284, column: 7, scope: !1026)
!1054 = !DILocation(line: 285, column: 6, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1026, file: !53, line: 285, column: 6)
!1056 = !DILocation(line: 285, column: 10, scope: !1055)
!1057 = !DILocation(line: 285, column: 17, scope: !1055)
!1058 = !DILocation(line: 285, column: 20, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1055, file: !53, discriminator: 1)
!1060 = !DILocation(line: 285, column: 25, scope: !1059)
!1061 = !DILocation(line: 285, column: 6, scope: !1059)
!1062 = !DILocation(line: 286, column: 14, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !53, line: 286, column: 3)
!1064 = distinct !DILexicalBlock(scope: !1055, file: !53, line: 285, column: 34)
!1065 = !DILocation(line: 286, column: 12, scope: !1063)
!1066 = !DILocation(line: 286, column: 8, scope: !1063)
!1067 = !DILocation(line: 286, column: 20, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1069, file: !53, discriminator: 1)
!1069 = distinct !DILexicalBlock(scope: !1063, file: !53, line: 286, column: 3)
!1070 = !DILocation(line: 286, column: 24, scope: !1068)
!1071 = !DILocation(line: 286, column: 3, scope: !1068)
!1072 = !DILocalVariable(name: "option", scope: !1073, file: !53, line: 287, type: !199)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !53, line: 286, column: 44)
!1074 = !DILocation(line: 287, column: 10, scope: !1073)
!1075 = !DILocation(line: 287, column: 19, scope: !1073)
!1076 = !DILocation(line: 287, column: 24, scope: !1073)
!1077 = !DILocation(line: 288, column: 11, scope: !1073)
!1078 = !DILocation(line: 288, column: 16, scope: !1073)
!1079 = !DILocation(line: 288, column: 9, scope: !1073)
!1080 = !DILocation(line: 290, column: 28, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1073, file: !53, line: 290, column: 8)
!1082 = !DILocation(line: 290, column: 33, scope: !1081)
!1083 = !DILocation(line: 290, column: 8, scope: !1081)
!1084 = !DILocation(line: 290, column: 8, scope: !1073)
!1085 = !DILocation(line: 291, column: 26, scope: !1081)
!1086 = !DILocation(line: 291, column: 32, scope: !1081)
!1087 = !DILocation(line: 291, column: 12, scope: !1081)
!1088 = !DILocation(line: 291, column: 10, scope: !1081)
!1089 = !DILocation(line: 291, column: 5, scope: !1081)
!1090 = !DILocation(line: 292, column: 3, scope: !1073)
!1091 = !DILocation(line: 286, column: 38, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1069, file: !53, discriminator: 2)
!1093 = !DILocation(line: 286, column: 36, scope: !1092)
!1094 = !DILocation(line: 286, column: 3, scope: !1092)
!1095 = distinct !{!1095, !1096}
!1096 = !DILocation(line: 286, column: 3, scope: !1064)
!1097 = !DILocation(line: 293, column: 2, scope: !1064)
!1098 = !DILocation(line: 295, column: 9, scope: !1026)
!1099 = !DILocation(line: 295, column: 2, scope: !1026)
!1100 = distinct !DISubprogram(name: "glist_find_string", scope: !53, file: !53, line: 298, type: !1101, isLocal: false, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1029, !1029, !252}
!1103 = !DILocalVariable(name: "list", arg: 1, scope: !1100, file: !53, line: 298, type: !1029)
!1104 = !DILocation(line: 298, column: 33, scope: !1100)
!1105 = !DILocalVariable(name: "key", arg: 2, scope: !1100, file: !53, line: 298, type: !252)
!1106 = !DILocation(line: 298, column: 51, scope: !1100)
!1107 = !DILocation(line: 300, column: 2, scope: !1100)
!1108 = !DILocation(line: 300, column: 9, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1110, file: !53, discriminator: 1)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !53, line: 300, column: 2)
!1111 = distinct !DILexicalBlock(scope: !1100, file: !53, line: 300, column: 2)
!1112 = !DILocation(line: 300, column: 14, scope: !1109)
!1113 = !DILocation(line: 300, column: 2, scope: !1109)
!1114 = !DILocation(line: 301, column: 17, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1110, file: !53, line: 301, column: 7)
!1116 = !DILocation(line: 301, column: 23, scope: !1115)
!1117 = !DILocation(line: 301, column: 29, scope: !1115)
!1118 = !DILocation(line: 301, column: 7, scope: !1115)
!1119 = !DILocation(line: 301, column: 34, scope: !1115)
!1120 = !DILocation(line: 301, column: 7, scope: !1110)
!1121 = !DILocation(line: 301, column: 47, scope: !1122)
!1122 = !DILexicalBlockFile(scope: !1115, file: !53, discriminator: 1)
!1123 = !DILocation(line: 301, column: 40, scope: !1122)
!1124 = !DILocation(line: 301, column: 37, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1115, file: !53, discriminator: 2)
!1126 = !DILocation(line: 300, column: 29, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1110, file: !53, discriminator: 2)
!1128 = !DILocation(line: 300, column: 35, scope: !1127)
!1129 = !DILocation(line: 300, column: 27, scope: !1127)
!1130 = !DILocation(line: 300, column: 2, scope: !1127)
!1131 = distinct !{!1131, !1107}
!1132 = !DILocation(line: 303, column: 2, scope: !1100)
!1133 = !DILocation(line: 304, column: 1, scope: !1100)
!1134 = distinct !DISubprogram(name: "glist_find_icase_string", scope: !53, file: !53, line: 306, type: !1101, isLocal: false, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1135 = !DILocalVariable(name: "list", arg: 1, scope: !1134, file: !53, line: 306, type: !1029)
!1136 = !DILocation(line: 306, column: 39, scope: !1134)
!1137 = !DILocalVariable(name: "key", arg: 2, scope: !1134, file: !53, line: 306, type: !252)
!1138 = !DILocation(line: 306, column: 57, scope: !1134)
!1139 = !DILocation(line: 308, column: 2, scope: !1134)
!1140 = !DILocation(line: 308, column: 9, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1142, file: !53, discriminator: 1)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !53, line: 308, column: 2)
!1143 = distinct !DILexicalBlock(scope: !1134, file: !53, line: 308, column: 2)
!1144 = !DILocation(line: 308, column: 14, scope: !1141)
!1145 = !DILocation(line: 308, column: 2, scope: !1141)
!1146 = !DILocation(line: 309, column: 26, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !53, line: 309, column: 7)
!1148 = !DILocation(line: 309, column: 32, scope: !1147)
!1149 = !DILocation(line: 309, column: 38, scope: !1147)
!1150 = !DILocation(line: 309, column: 7, scope: !1147)
!1151 = !DILocation(line: 309, column: 43, scope: !1147)
!1152 = !DILocation(line: 309, column: 7, scope: !1142)
!1153 = !DILocation(line: 309, column: 56, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1147, file: !53, discriminator: 1)
!1155 = !DILocation(line: 309, column: 49, scope: !1154)
!1156 = !DILocation(line: 309, column: 46, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1147, file: !53, discriminator: 2)
!1158 = !DILocation(line: 308, column: 29, scope: !1159)
!1159 = !DILexicalBlockFile(scope: !1142, file: !53, discriminator: 2)
!1160 = !DILocation(line: 308, column: 35, scope: !1159)
!1161 = !DILocation(line: 308, column: 27, scope: !1159)
!1162 = !DILocation(line: 308, column: 2, scope: !1159)
!1163 = distinct !{!1163, !1139}
!1164 = !DILocation(line: 311, column: 2, scope: !1134)
!1165 = !DILocation(line: 312, column: 1, scope: !1134)
!1166 = distinct !DISubprogram(name: "stristr", scope: !53, file: !53, line: 314, type: !1167, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!199, !252, !252}
!1169 = !DILocalVariable(name: "data", arg: 1, scope: !1166, file: !53, line: 314, type: !252)
!1170 = !DILocation(line: 314, column: 27, scope: !1166)
!1171 = !DILocalVariable(name: "key", arg: 2, scope: !1166, file: !53, line: 314, type: !252)
!1172 = !DILocation(line: 314, column: 45, scope: !1166)
!1173 = !DILocalVariable(name: "max", scope: !1166, file: !53, line: 316, type: !252)
!1174 = !DILocation(line: 316, column: 14, scope: !1166)
!1175 = !DILocalVariable(name: "keylen", scope: !1166, file: !53, line: 317, type: !57)
!1176 = !DILocation(line: 317, column: 6, scope: !1166)
!1177 = !DILocalVariable(name: "datalen", scope: !1166, file: !53, line: 317, type: !57)
!1178 = !DILocation(line: 317, column: 14, scope: !1166)
!1179 = !DILocalVariable(name: "pos", scope: !1166, file: !53, line: 317, type: !57)
!1180 = !DILocation(line: 317, column: 23, scope: !1166)
!1181 = !DILocation(line: 319, column: 18, scope: !1166)
!1182 = !DILocation(line: 319, column: 11, scope: !1166)
!1183 = !DILocation(line: 319, column: 9, scope: !1166)
!1184 = !DILocation(line: 320, column: 19, scope: !1166)
!1185 = !DILocation(line: 320, column: 12, scope: !1166)
!1186 = !DILocation(line: 320, column: 10, scope: !1166)
!1187 = !DILocation(line: 322, column: 6, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1166, file: !53, line: 322, column: 6)
!1189 = !DILocation(line: 322, column: 15, scope: !1188)
!1190 = !DILocation(line: 322, column: 13, scope: !1188)
!1191 = !DILocation(line: 322, column: 6, scope: !1166)
!1192 = !DILocation(line: 323, column: 3, scope: !1188)
!1193 = !DILocation(line: 324, column: 6, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1166, file: !53, line: 324, column: 6)
!1195 = !DILocation(line: 324, column: 13, scope: !1194)
!1196 = !DILocation(line: 324, column: 6, scope: !1166)
!1197 = !DILocation(line: 325, column: 19, scope: !1194)
!1198 = !DILocation(line: 325, column: 3, scope: !1194)
!1199 = !DILocation(line: 327, column: 8, scope: !1166)
!1200 = !DILocation(line: 327, column: 13, scope: !1166)
!1201 = !DILocation(line: 327, column: 12, scope: !1166)
!1202 = !DILocation(line: 327, column: 21, scope: !1166)
!1203 = !DILocation(line: 327, column: 20, scope: !1166)
!1204 = !DILocation(line: 327, column: 6, scope: !1166)
!1205 = !DILocation(line: 328, column: 6, scope: !1166)
!1206 = !DILocation(line: 329, column: 2, scope: !1166)
!1207 = !DILocation(line: 329, column: 9, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1166, file: !53, discriminator: 1)
!1209 = !DILocation(line: 329, column: 17, scope: !1208)
!1210 = !DILocation(line: 329, column: 14, scope: !1208)
!1211 = !DILocation(line: 329, column: 2, scope: !1208)
!1212 = !DILocation(line: 330, column: 11, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1214, file: !53, line: 330, column: 7)
!1214 = distinct !DILexicalBlock(scope: !1166, file: !53, line: 329, column: 22)
!1215 = !DILocation(line: 330, column: 7, scope: !1213)
!1216 = !DILocation(line: 330, column: 16, scope: !1213)
!1217 = !DILocation(line: 330, column: 7, scope: !1214)
!1218 = !DILocation(line: 331, column: 41, scope: !1213)
!1219 = !DILocation(line: 331, column: 25, scope: !1213)
!1220 = !DILocation(line: 333, column: 43, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1214, file: !53, line: 333, column: 7)
!1222 = !DILocation(line: 333, column: 38, scope: !1221)
!1223 = !DILocation(line: 333, column: 15, scope: !1221)
!1224 = !DILocation(line: 333, column: 7, scope: !1221)
!1225 = !DILocation(line: 333, column: 88, scope: !1221)
!1226 = !DILocation(line: 333, column: 84, scope: !1221)
!1227 = !DILocation(line: 333, column: 61, scope: !1221)
!1228 = !DILocation(line: 333, column: 53, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1221, file: !53, discriminator: 1)
!1230 = !DILocation(line: 333, column: 50, scope: !1221)
!1231 = !DILocation(line: 333, column: 7, scope: !1214)
!1232 = !DILocation(line: 334, column: 7, scope: !1221)
!1233 = !DILocation(line: 334, column: 4, scope: !1221)
!1234 = !DILocation(line: 336, column: 8, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1221, file: !53, line: 335, column: 8)
!1236 = !DILocation(line: 337, column: 29, scope: !1235)
!1237 = !DILocation(line: 329, column: 2, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1166, file: !53, discriminator: 2)
!1239 = distinct !{!1239, !1206}
!1240 = !DILocation(line: 341, column: 2, scope: !1166)
!1241 = !DILocation(line: 342, column: 1, scope: !1166)
!1242 = distinct !DISubprogram(name: "strstr_full", scope: !53, file: !53, line: 387, type: !1167, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1243 = !DILocalVariable(name: "data", arg: 1, scope: !1242, file: !53, line: 387, type: !252)
!1244 = !DILocation(line: 387, column: 31, scope: !1242)
!1245 = !DILocalVariable(name: "key", arg: 2, scope: !1242, file: !53, line: 387, type: !252)
!1246 = !DILocation(line: 387, column: 49, scope: !1242)
!1247 = !DILocation(line: 389, column: 33, scope: !1242)
!1248 = !DILocation(line: 389, column: 39, scope: !1242)
!1249 = !DILocation(line: 389, column: 16, scope: !1242)
!1250 = !DILocation(line: 389, column: 9, scope: !1242)
!1251 = distinct !DISubprogram(name: "strstr_full_case", scope: !53, file: !53, line: 348, type: !1252, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!199, !252, !252, !57}
!1254 = !DILocalVariable(name: "data", arg: 1, scope: !1251, file: !53, line: 348, type: !252)
!1255 = !DILocation(line: 348, column: 43, scope: !1251)
!1256 = !DILocalVariable(name: "key", arg: 2, scope: !1251, file: !53, line: 348, type: !252)
!1257 = !DILocation(line: 348, column: 61, scope: !1251)
!1258 = !DILocalVariable(name: "icase", arg: 3, scope: !1251, file: !53, line: 348, type: !57)
!1259 = !DILocation(line: 348, column: 70, scope: !1251)
!1260 = !DILocalVariable(name: "start", scope: !1251, file: !53, line: 350, type: !252)
!1261 = !DILocation(line: 350, column: 14, scope: !1251)
!1262 = !DILocalVariable(name: "max", scope: !1251, file: !53, line: 350, type: !252)
!1263 = !DILocation(line: 350, column: 22, scope: !1251)
!1264 = !DILocalVariable(name: "keylen", scope: !1251, file: !53, line: 351, type: !57)
!1265 = !DILocation(line: 351, column: 6, scope: !1251)
!1266 = !DILocalVariable(name: "datalen", scope: !1251, file: !53, line: 351, type: !57)
!1267 = !DILocation(line: 351, column: 14, scope: !1251)
!1268 = !DILocalVariable(name: "pos", scope: !1251, file: !53, line: 351, type: !57)
!1269 = !DILocation(line: 351, column: 23, scope: !1251)
!1270 = !DILocalVariable(name: "match", scope: !1251, file: !53, line: 351, type: !57)
!1271 = !DILocation(line: 351, column: 28, scope: !1251)
!1272 = !DILocation(line: 353, column: 18, scope: !1251)
!1273 = !DILocation(line: 353, column: 11, scope: !1251)
!1274 = !DILocation(line: 353, column: 9, scope: !1251)
!1275 = !DILocation(line: 354, column: 19, scope: !1251)
!1276 = !DILocation(line: 354, column: 12, scope: !1251)
!1277 = !DILocation(line: 354, column: 10, scope: !1251)
!1278 = !DILocation(line: 356, column: 6, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1251, file: !53, line: 356, column: 6)
!1280 = !DILocation(line: 356, column: 15, scope: !1279)
!1281 = !DILocation(line: 356, column: 13, scope: !1279)
!1282 = !DILocation(line: 356, column: 6, scope: !1251)
!1283 = !DILocation(line: 357, column: 3, scope: !1279)
!1284 = !DILocation(line: 358, column: 6, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1251, file: !53, line: 358, column: 6)
!1286 = !DILocation(line: 358, column: 13, scope: !1285)
!1287 = !DILocation(line: 358, column: 6, scope: !1251)
!1288 = !DILocation(line: 359, column: 19, scope: !1285)
!1289 = !DILocation(line: 359, column: 3, scope: !1285)
!1290 = !DILocation(line: 361, column: 8, scope: !1251)
!1291 = !DILocation(line: 361, column: 13, scope: !1251)
!1292 = !DILocation(line: 361, column: 12, scope: !1251)
!1293 = !DILocation(line: 361, column: 21, scope: !1251)
!1294 = !DILocation(line: 361, column: 20, scope: !1251)
!1295 = !DILocation(line: 361, column: 6, scope: !1251)
!1296 = !DILocation(line: 362, column: 10, scope: !1251)
!1297 = !DILocation(line: 362, column: 8, scope: !1251)
!1298 = !DILocation(line: 362, column: 20, scope: !1251)
!1299 = !DILocation(line: 363, column: 2, scope: !1251)
!1300 = !DILocation(line: 363, column: 9, scope: !1301)
!1301 = !DILexicalBlockFile(scope: !1251, file: !53, discriminator: 1)
!1302 = !DILocation(line: 363, column: 17, scope: !1301)
!1303 = !DILocation(line: 363, column: 14, scope: !1301)
!1304 = !DILocation(line: 363, column: 2, scope: !1301)
!1305 = !DILocation(line: 364, column: 11, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1307, file: !53, line: 364, column: 7)
!1307 = distinct !DILexicalBlock(scope: !1251, file: !53, line: 363, column: 22)
!1308 = !DILocation(line: 364, column: 7, scope: !1306)
!1309 = !DILocation(line: 364, column: 16, scope: !1306)
!1310 = !DILocation(line: 364, column: 7, scope: !1307)
!1311 = !DILocation(line: 365, column: 13, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !53, line: 365, column: 8)
!1313 = distinct !DILexicalBlock(scope: !1306, file: !53, line: 364, column: 25)
!1314 = !DILocation(line: 365, column: 8, scope: !1312)
!1315 = !DILocation(line: 365, column: 18, scope: !1312)
!1316 = !DILocation(line: 365, column: 26, scope: !1312)
!1317 = !DILocation(line: 365, column: 53, scope: !1318)
!1318 = !DILexicalBlockFile(scope: !1312, file: !53, discriminator: 1)
!1319 = !DILocation(line: 365, column: 48, scope: !1318)
!1320 = !DILocation(line: 365, column: 31, scope: !1318)
!1321 = !DILocation(line: 365, column: 59, scope: !1318)
!1322 = !DILocation(line: 365, column: 65, scope: !1318)
!1323 = !DILocation(line: 365, column: 57, scope: !1324)
!1324 = !DILexicalBlockFile(scope: !1312, file: !53, discriminator: 2)
!1325 = !DILocation(line: 365, column: 52, scope: !1324)
!1326 = !DILocation(line: 365, column: 29, scope: !1324)
!1327 = !DILocation(line: 365, column: 30, scope: !1324)
!1328 = !DILocation(line: 365, column: 32, scope: !1324)
!1329 = !DILocation(line: 365, column: 31, scope: !1324)
!1330 = !DILocation(line: 365, column: 33, scope: !1324)
!1331 = !DILocation(line: 365, column: 57, scope: !1332)
!1332 = !DILexicalBlockFile(scope: !1312, file: !53, discriminator: 3)
!1333 = !DILocation(line: 365, column: 52, scope: !1332)
!1334 = !DILocation(line: 365, column: 29, scope: !1332)
!1335 = !DILocation(line: 365, column: 30, scope: !1332)
!1336 = !DILocation(line: 365, column: 32, scope: !1332)
!1337 = !DILocation(line: 365, column: 31, scope: !1332)
!1338 = !DILocation(line: 365, column: 33, scope: !1332)
!1339 = !DILocation(line: 365, column: 8, scope: !1332)
!1340 = !DILocation(line: 366, column: 9, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1312, file: !53, line: 365, column: 33)
!1342 = !DILocation(line: 367, column: 9, scope: !1341)
!1343 = !DILocation(line: 368, column: 33, scope: !1341)
!1344 = distinct !{!1344, !1299}
!1345 = !DILocation(line: 370, column: 20, scope: !1313)
!1346 = !DILocation(line: 370, column: 4, scope: !1313)
!1347 = !DILocation(line: 373, column: 11, scope: !1307)
!1348 = !DILocation(line: 373, column: 56, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1307, file: !53, discriminator: 1)
!1350 = !DILocation(line: 373, column: 51, scope: !1349)
!1351 = !DILocation(line: 373, column: 28, scope: !1349)
!1352 = !DILocation(line: 373, column: 20, scope: !1349)
!1353 = !DILocation(line: 373, column: 101, scope: !1349)
!1354 = !DILocation(line: 373, column: 97, scope: !1349)
!1355 = !DILocation(line: 373, column: 74, scope: !1349)
!1356 = !DILocation(line: 373, column: 66, scope: !1357)
!1357 = !DILexicalBlockFile(scope: !1349, file: !53, discriminator: 4)
!1358 = !DILocation(line: 373, column: 63, scope: !1349)
!1359 = !DILocation(line: 373, column: 11, scope: !1349)
!1360 = !DILocation(line: 374, column: 11, scope: !1307)
!1361 = !DILocation(line: 374, column: 6, scope: !1307)
!1362 = !DILocation(line: 374, column: 23, scope: !1307)
!1363 = !DILocation(line: 374, column: 19, scope: !1307)
!1364 = !DILocation(line: 374, column: 16, scope: !1307)
!1365 = !DILocation(line: 373, column: 11, scope: !1366)
!1366 = !DILexicalBlockFile(scope: !1307, file: !53, discriminator: 2)
!1367 = !DILocation(line: 373, column: 11, scope: !1368)
!1368 = !DILexicalBlockFile(scope: !1307, file: !53, discriminator: 3)
!1369 = !DILocation(line: 373, column: 9, scope: !1368)
!1370 = !DILocation(line: 376, column: 7, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1307, file: !53, line: 376, column: 7)
!1372 = !DILocation(line: 376, column: 13, scope: !1371)
!1373 = !DILocation(line: 376, column: 17, scope: !1374)
!1374 = !DILexicalBlockFile(scope: !1371, file: !53, discriminator: 1)
!1375 = !DILocation(line: 376, column: 21, scope: !1374)
!1376 = !DILocation(line: 376, column: 26, scope: !1374)
!1377 = !DILocation(line: 376, column: 29, scope: !1378)
!1378 = !DILexicalBlockFile(scope: !1371, file: !53, discriminator: 2)
!1379 = !DILocation(line: 376, column: 37, scope: !1378)
!1380 = !DILocation(line: 376, column: 34, scope: !1378)
!1381 = !DILocation(line: 376, column: 43, scope: !1378)
!1382 = !DILocation(line: 376, column: 64, scope: !1383)
!1383 = !DILexicalBlockFile(scope: !1371, file: !53, discriminator: 3)
!1384 = !DILocation(line: 376, column: 47, scope: !1383)
!1385 = !DILocation(line: 376, column: 74, scope: !1383)
!1386 = !DILocation(line: 376, column: 80, scope: !1383)
!1387 = !DILocation(line: 376, column: 68, scope: !1388)
!1388 = !DILexicalBlockFile(scope: !1371, file: !53, discriminator: 4)
!1389 = !DILocation(line: 376, column: 45, scope: !1388)
!1390 = !DILocation(line: 376, column: 46, scope: !1388)
!1391 = !DILocation(line: 376, column: 48, scope: !1388)
!1392 = !DILocation(line: 376, column: 47, scope: !1388)
!1393 = !DILocation(line: 376, column: 49, scope: !1388)
!1394 = !DILocation(line: 376, column: 68, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1371, file: !53, discriminator: 5)
!1396 = !DILocation(line: 376, column: 45, scope: !1395)
!1397 = !DILocation(line: 376, column: 46, scope: !1395)
!1398 = !DILocation(line: 376, column: 48, scope: !1395)
!1399 = !DILocation(line: 376, column: 47, scope: !1395)
!1400 = !DILocation(line: 376, column: 49, scope: !1395)
!1401 = !DILocation(line: 376, column: 7, scope: !1395)
!1402 = !DILocation(line: 377, column: 7, scope: !1371)
!1403 = !DILocation(line: 377, column: 4, scope: !1371)
!1404 = !DILocation(line: 379, column: 8, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1371, file: !53, line: 378, column: 8)
!1406 = !DILocation(line: 380, column: 29, scope: !1405)
!1407 = !DILocation(line: 363, column: 2, scope: !1408)
!1408 = !DILexicalBlockFile(scope: !1251, file: !53, discriminator: 2)
!1409 = !DILocation(line: 384, column: 2, scope: !1251)
!1410 = !DILocation(line: 385, column: 1, scope: !1251)
!1411 = distinct !DISubprogram(name: "stristr_full", scope: !53, file: !53, line: 392, type: !1167, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !278)
!1412 = !DILocalVariable(name: "data", arg: 1, scope: !1411, file: !53, line: 392, type: !252)
!1413 = !DILocation(line: 392, column: 32, scope: !1411)
!1414 = !DILocalVariable(name: "key", arg: 2, scope: !1411, file: !53, line: 392, type: !252)
!1415 = !DILocation(line: 392, column: 50, scope: !1411)
!1416 = !DILocation(line: 394, column: 33, scope: !1411)
