; ModuleID = './line59-network.o.i'
source_filename = "./line59-network.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !74, globals: !146)
!1 = !DIFile(filename: "line59-network.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !47, !59}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !48, line: 24, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58}
!50 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!51 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!52 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!53 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!54 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!55 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!56 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!57 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!58 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 46, size: 32, align: 32, elements: !61)
!60 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!62 = !DIEnumerator(name: "_ISupper", value: 256)
!63 = !DIEnumerator(name: "_ISlower", value: 512)
!64 = !DIEnumerator(name: "_ISalpha", value: 1024)
!65 = !DIEnumerator(name: "_ISdigit", value: 2048)
!66 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!67 = !DIEnumerator(name: "_ISspace", value: 8192)
!68 = !DIEnumerator(name: "_ISprint", value: 16384)
!69 = !DIEnumerator(name: "_ISgraph", value: 32768)
!70 = !DIEnumerator(name: "_ISblank", value: 1)
!71 = !DIEnumerator(name: "_IScntrl", value: 2)
!72 = !DIEnumerator(name: "_ISpunct", value: 4)
!73 = !DIEnumerator(name: "_ISalnum", value: 8)
!74 = !{!75, !77, !78, !81, !93, !95, !100, !88, !145, !118}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !80, line: 46, baseType: !76)
!80 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !83, line: 153, size: 128, align: 16, elements: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/lichi/Desktop/irssi/task1")
!84 = !{!85, !89}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !82, file: !83, line: 155, baseType: !86, size: 16, align: 16)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !87, line: 28, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/lichi/Desktop/irssi/task1")
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !82, file: !83, line: 156, baseType: !90, size: 112, align: 8, offset: 16)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 112, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 14)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !96, line: 30, baseType: !97)
!96 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !98, line: 51, baseType: !99)
!98 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sockaddr_union", file: !102, line: 33, size: 224, align: 32, elements: !103)
!102 = !DIFile(filename: "network.c", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !{!104, !105, !121}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sa", scope: !101, file: !102, line: 34, baseType: !82, size: 128, align: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sin", scope: !101, file: !102, line: 35, baseType: !106, size: 128, align: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !96, line: 239, size: 128, align: 32, elements: !107)
!107 = !{!108, !109, !112, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !106, file: !96, line: 241, baseType: !86, size: 16, align: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !106, file: !96, line: 242, baseType: !110, size: 16, align: 16, offset: 16)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !96, line: 119, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !98, line: 49, baseType: !88)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !106, file: !96, line: 243, baseType: !113, size: 32, align: 32, offset: 32)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !96, line: 31, size: 32, align: 32, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !113, file: !96, line: 33, baseType: !95, size: 32, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !106, file: !96, line: 246, baseType: !117, size: 64, align: 8, offset: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, align: 8, elements: !119)
!118 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!119 = !{!120}
!120 = !DISubrange(count: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sin6", scope: !101, file: !102, line: 36, baseType: !122, size: 224, align: 32)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !96, line: 254, size: 224, align: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !144}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !122, file: !96, line: 256, baseType: !86, size: 16, align: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !122, file: !96, line: 257, baseType: !110, size: 16, align: 16, offset: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !122, file: !96, line: 258, baseType: !97, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !122, file: !96, line: 259, baseType: !128, size: 128, align: 32, offset: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !96, line: 211, size: 128, align: 32, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !128, file: !96, line: 220, baseType: !131, size: 128, align: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !96, line: 213, size: 128, align: 32, elements: !132)
!132 = !{!133, !138, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !131, file: !96, line: 215, baseType: !134, size: 128, align: 8)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, align: 8, elements: !136)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !98, line: 48, baseType: !118)
!136 = !{!137}
!137 = !DISubrange(count: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !131, file: !96, line: 217, baseType: !139, size: 128, align: 16)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, align: 16, elements: !119)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !131, file: !96, line: 218, baseType: !141, size: 128, align: 32)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, align: 32, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !122, file: !96, line: 260, baseType: !97, size: 32, align: 32, offset: 192)
!145 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!146 = !{!147}
!147 = distinct !DIGlobalVariable(name: "ip4_any", scope: !0, file: !102, line: 84, type: !148, isLocal: false, isDefinition: true, variable: { i16, [2 x i8], { { [16 x i8] } } }* @ip4_any)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !149, line: 99, baseType: !150)
!149 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !151, line: 22, size: 160, align: 32, elements: !152)
!151 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !150, file: !151, line: 23, baseType: !88, size: 16, align: 16)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !150, file: !151, line: 24, baseType: !128, size: 128, align: 32, offset: 32)
!155 = !{i32 2, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!158 = distinct !DISubprogram(name: "g_io_channel_new", scope: !102, file: !102, line: 42, type: !159, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !145}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !164)
!164 = !{!165, !167, !308, !309, !314, !315, !316, !317, !318, !327, !328, !329, !333, !334, !335, !336, !337, !338, !339, !340}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !163, file: !4, line: 100, baseType: !166, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !80, line: 49, baseType: !145)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !163, file: !4, line: 101, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !171)
!171 = !{!172, !193, !199, !206, !210, !295, !299, !304}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !170, file: !4, line: 133, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !161, !78, !177, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !178, line: 66, baseType: !179)
!178 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!179 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !184, line: 42, baseType: !185)
!184 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !184, line: 44, size: 128, align: 64, elements: !186)
!186 = !{!187, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !185, file: !184, line: 46, baseType: !188, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !189, line: 36, baseType: !190)
!189 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !178, line: 45, baseType: !99)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !185, file: !184, line: 47, baseType: !166, size: 32, align: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !185, file: !184, line: 48, baseType: !78, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !170, file: !4, line: 138, baseType: !194, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!176, !161, !197, !177, !180, !181}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !170, file: !4, line: 143, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!176, !161, !203, !205, !181}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !178, line: 51, baseType: !204)
!204 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !170, file: !4, line: 147, baseType: !207, size: 64, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!176, !161, !181}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !170, file: !4, line: 149, baseType: !211, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!214, !161, !294}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !217)
!217 = !{!218, !220, !241, !270, !272, !276, !277, !278, !279, !287, !288, !289, !290}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !216, file: !16, line: 174, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !80, line: 77, baseType: !77)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !216, file: !16, line: 175, baseType: !221, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !224)
!224 = !{!225, !229, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !223, file: !16, line: 198, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !219}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !223, file: !16, line: 199, baseType: !226, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !223, file: !16, line: 200, baseType: !231, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !219, !214, !234, !240}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !219}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !80, line: 50, baseType: !166)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !216, file: !16, line: 177, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !246)
!246 = !{!247, !252, !256, !260, !264, !265}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !245, file: !16, line: 216, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!239, !214, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !245, file: !16, line: 218, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!239, !214}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !245, file: !16, line: 219, baseType: !257, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!239, !214, !235, !219}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !245, file: !16, line: 222, baseType: !261, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !214}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !245, file: !16, line: 226, baseType: !235, size: 64, align: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !245, file: !16, line: 227, baseType: !266, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !216, file: !16, line: 178, baseType: !271, size: 32, align: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !80, line: 55, baseType: !99)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !216, file: !16, line: 180, baseType: !273, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !216, file: !16, line: 182, baseType: !166, size: 32, align: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !216, file: !16, line: 183, baseType: !271, size: 32, align: 32, offset: 352)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !216, file: !16, line: 184, baseType: !271, size: 32, align: 32, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !216, file: !16, line: 186, baseType: !280, size: 64, align: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !282, line: 37, baseType: !283)
!282 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !282, line: 39, size: 128, align: 64, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !282, line: 41, baseType: !219, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !282, line: 42, baseType: !280, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !216, file: !16, line: 188, baseType: !214, size: 64, align: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !16, line: 189, baseType: !214, size: 64, align: 64, offset: 576)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !16, line: 191, baseType: !75, size: 64, align: 64, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !216, file: !16, line: 193, baseType: !291, size: 64, align: 64, offset: 704)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !170, file: !4, line: 151, baseType: !296, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !161}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !170, file: !4, line: 152, baseType: !300, size: 64, align: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!176, !161, !303, !181}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !170, file: !4, line: 155, baseType: !305, size: 64, align: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!303, !161}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !163, file: !4, line: 103, baseType: !78, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !163, file: !4, line: 104, baseType: !310, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !311, line: 77, baseType: !312)
!311 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !311, line: 77, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !163, file: !4, line: 105, baseType: !310, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !163, file: !4, line: 106, baseType: !78, size: 64, align: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !163, file: !4, line: 107, baseType: !271, size: 32, align: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !163, file: !4, line: 109, baseType: !177, size: 64, align: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !163, file: !4, line: 110, baseType: !319, size: 64, align: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !321, line: 39, baseType: !322)
!321 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !321, line: 41, size: 192, align: 64, elements: !323)
!323 = !{!324, !325, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !322, file: !321, line: 43, baseType: !78, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !322, file: !321, line: 44, baseType: !177, size: 64, align: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !322, file: !321, line: 45, baseType: !177, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !163, file: !4, line: 111, baseType: !319, size: 64, align: 64, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !163, file: !4, line: 112, baseType: !319, size: 64, align: 64, offset: 640)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !163, file: !4, line: 113, baseType: !330, size: 48, align: 8, offset: 704)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, align: 8, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 6)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !163, file: !4, line: 117, baseType: !271, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !163, file: !4, line: 118, baseType: !271, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !163, file: !4, line: 119, baseType: !271, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !163, file: !4, line: 120, baseType: !271, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !163, file: !4, line: 121, baseType: !271, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !163, file: !4, line: 122, baseType: !271, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !163, file: !4, line: 124, baseType: !219, size: 64, align: 64, offset: 768)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !163, file: !4, line: 125, baseType: !219, size: 64, align: 64, offset: 832)
!341 = !{}
!342 = !DILocalVariable(name: "handle", arg: 1, scope: !158, file: !102, line: 42, type: !145)
!343 = !DIExpression()
!344 = !DILocation(line: 42, column: 34, scope: !158)
!345 = !DILocalVariable(name: "chan", scope: !158, file: !102, line: 44, type: !161)
!346 = !DILocation(line: 44, column: 14, scope: !158)
!347 = !DILocation(line: 45, column: 31, scope: !158)
!348 = !DILocation(line: 45, column: 9, scope: !158)
!349 = !DILocation(line: 45, column: 7, scope: !158)
!350 = !DILocation(line: 46, column: 28, scope: !158)
!351 = !DILocation(line: 46, column: 2, scope: !158)
!352 = !DILocation(line: 47, column: 28, scope: !158)
!353 = !DILocation(line: 47, column: 2, scope: !158)
!354 = !DILocation(line: 48, column: 9, scope: !158)
!355 = !DILocation(line: 48, column: 2, scope: !158)
!356 = distinct !DISubprogram(name: "g_io_channel_write_block", scope: !102, file: !102, line: 51, type: !357, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!357 = !DISubroutineType(types: !358)
!358 = !{!145, !161, !77, !145}
!359 = !DILocalVariable(name: "channel", arg: 1, scope: !356, file: !102, line: 51, type: !161)
!360 = !DILocation(line: 51, column: 42, scope: !356)
!361 = !DILocalVariable(name: "data", arg: 2, scope: !356, file: !102, line: 51, type: !77)
!362 = !DILocation(line: 51, column: 57, scope: !356)
!363 = !DILocalVariable(name: "len", arg: 3, scope: !356, file: !102, line: 51, type: !145)
!364 = !DILocation(line: 51, column: 67, scope: !356)
!365 = !DILocalVariable(name: "ret", scope: !356, file: !102, line: 53, type: !177)
!366 = !DILocation(line: 53, column: 8, scope: !356)
!367 = !DILocalVariable(name: "sent", scope: !356, file: !102, line: 54, type: !145)
!368 = !DILocation(line: 54, column: 6, scope: !356)
!369 = !DILocalVariable(name: "status", scope: !356, file: !102, line: 55, type: !176)
!370 = !DILocation(line: 55, column: 12, scope: !356)
!371 = !DILocation(line: 57, column: 7, scope: !356)
!372 = !DILocation(line: 58, column: 2, scope: !356)
!373 = distinct !{!373, !372}
!374 = !DILocation(line: 59, column: 37, scope: !375)
!375 = distinct !DILexicalBlock(scope: !356, file: !102, line: 58, column: 5)
!376 = !DILocation(line: 59, column: 55, scope: !375)
!377 = !DILocation(line: 59, column: 62, scope: !375)
!378 = !DILocation(line: 59, column: 60, scope: !375)
!379 = !DILocation(line: 59, column: 68, scope: !375)
!380 = !DILocation(line: 59, column: 74, scope: !375)
!381 = !DILocation(line: 59, column: 72, scope: !375)
!382 = !DILocation(line: 59, column: 12, scope: !375)
!383 = !DILocation(line: 59, column: 10, scope: !375)
!384 = !DILocation(line: 60, column: 11, scope: !375)
!385 = !DILocation(line: 60, column: 8, scope: !375)
!386 = !DILocation(line: 61, column: 2, scope: !375)
!387 = !DILocation(line: 61, column: 11, scope: !388)
!388 = !DILexicalBlockFile(scope: !356, file: !102, discriminator: 1)
!389 = !DILocation(line: 61, column: 18, scope: !388)
!390 = !DILocation(line: 61, column: 16, scope: !388)
!391 = !DILocation(line: 61, column: 22, scope: !388)
!392 = !DILocation(line: 61, column: 25, scope: !393)
!393 = !DILexicalBlockFile(scope: !356, file: !102, discriminator: 2)
!394 = !DILocation(line: 61, column: 32, scope: !393)
!395 = !DILocation(line: 61, column: 2, scope: !396)
!396 = !DILexicalBlockFile(scope: !375, file: !102, discriminator: 3)
!397 = !DILocation(line: 63, column: 9, scope: !356)
!398 = !DILocation(line: 63, column: 16, scope: !356)
!399 = !DILocation(line: 63, column: 14, scope: !356)
!400 = !DILocation(line: 63, column: 2, scope: !356)
!401 = distinct !DISubprogram(name: "g_io_channel_read_block", scope: !102, file: !102, line: 66, type: !357, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!402 = !DILocalVariable(name: "channel", arg: 1, scope: !401, file: !102, line: 66, type: !161)
!403 = !DILocation(line: 66, column: 41, scope: !401)
!404 = !DILocalVariable(name: "data", arg: 2, scope: !401, file: !102, line: 66, type: !77)
!405 = !DILocation(line: 66, column: 56, scope: !401)
!406 = !DILocalVariable(name: "len", arg: 3, scope: !401, file: !102, line: 66, type: !145)
!407 = !DILocation(line: 66, column: 66, scope: !401)
!408 = !DILocalVariable(name: "maxwait", scope: !401, file: !102, line: 68, type: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !410, line: 75, baseType: !411)
!410 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !412, line: 139, baseType: !204)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!413 = !DILocation(line: 68, column: 9, scope: !401)
!414 = !DILocalVariable(name: "ret", scope: !401, file: !102, line: 69, type: !177)
!415 = !DILocation(line: 69, column: 8, scope: !401)
!416 = !DILocalVariable(name: "received", scope: !401, file: !102, line: 70, type: !145)
!417 = !DILocation(line: 70, column: 6, scope: !401)
!418 = !DILocalVariable(name: "status", scope: !401, file: !102, line: 71, type: !176)
!419 = !DILocation(line: 71, column: 12, scope: !401)
!420 = !DILocation(line: 73, column: 12, scope: !401)
!421 = !DILocation(line: 73, column: 21, scope: !401)
!422 = !DILocation(line: 73, column: 10, scope: !401)
!423 = !DILocation(line: 74, column: 11, scope: !401)
!424 = !DILocation(line: 75, column: 2, scope: !401)
!425 = distinct !{!425, !424}
!426 = !DILocation(line: 76, column: 36, scope: !427)
!427 = distinct !DILexicalBlock(scope: !401, file: !102, line: 75, column: 5)
!428 = !DILocation(line: 76, column: 54, scope: !427)
!429 = !DILocation(line: 76, column: 61, scope: !427)
!430 = !DILocation(line: 76, column: 59, scope: !427)
!431 = !DILocation(line: 76, column: 71, scope: !427)
!432 = !DILocation(line: 76, column: 77, scope: !427)
!433 = !DILocation(line: 76, column: 75, scope: !427)
!434 = !DILocation(line: 76, column: 12, scope: !427)
!435 = !DILocation(line: 76, column: 10, scope: !427)
!436 = !DILocation(line: 77, column: 15, scope: !427)
!437 = !DILocation(line: 77, column: 12, scope: !427)
!438 = !DILocation(line: 78, column: 2, scope: !427)
!439 = !DILocation(line: 78, column: 11, scope: !440)
!440 = !DILexicalBlockFile(scope: !401, file: !102, discriminator: 1)
!441 = !DILocation(line: 78, column: 22, scope: !440)
!442 = !DILocation(line: 78, column: 20, scope: !440)
!443 = !DILocation(line: 78, column: 26, scope: !440)
!444 = !DILocation(line: 78, column: 29, scope: !445)
!445 = !DILexicalBlockFile(scope: !401, file: !102, discriminator: 2)
!446 = !DILocation(line: 78, column: 41, scope: !445)
!447 = !DILocation(line: 78, column: 39, scope: !445)
!448 = !DILocation(line: 78, column: 49, scope: !445)
!449 = !DILocation(line: 79, column: 3, scope: !401)
!450 = !DILocation(line: 79, column: 10, scope: !401)
!451 = !DILocation(line: 79, column: 31, scope: !401)
!452 = !DILocation(line: 79, column: 34, scope: !440)
!453 = !DILocation(line: 79, column: 41, scope: !440)
!454 = !DILocation(line: 78, column: 2, scope: !455)
!455 = !DILexicalBlockFile(scope: !427, file: !102, discriminator: 3)
!456 = !DILocation(line: 81, column: 9, scope: !401)
!457 = !DILocation(line: 81, column: 20, scope: !401)
!458 = !DILocation(line: 81, column: 18, scope: !401)
!459 = !DILocation(line: 81, column: 2, scope: !401)
!460 = distinct !DISubprogram(name: "net_ip_compare", scope: !102, file: !102, line: 93, type: !461, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!461 = !DISubroutineType(types: !462)
!462 = !{!145, !463, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!464 = !DILocalVariable(name: "ip1", arg: 1, scope: !460, file: !102, line: 93, type: !463)
!465 = !DILocation(line: 93, column: 28, scope: !460)
!466 = !DILocalVariable(name: "ip2", arg: 2, scope: !460, file: !102, line: 93, type: !463)
!467 = !DILocation(line: 93, column: 41, scope: !460)
!468 = !DILocation(line: 95, column: 6, scope: !469)
!469 = distinct !DILexicalBlock(scope: !460, file: !102, line: 95, column: 6)
!470 = !DILocation(line: 95, column: 11, scope: !469)
!471 = !DILocation(line: 95, column: 21, scope: !469)
!472 = !DILocation(line: 95, column: 26, scope: !469)
!473 = !DILocation(line: 95, column: 18, scope: !469)
!474 = !DILocation(line: 95, column: 6, scope: !460)
!475 = !DILocation(line: 96, column: 3, scope: !469)
!476 = !DILocation(line: 98, column: 6, scope: !477)
!477 = distinct !DILexicalBlock(scope: !460, file: !102, line: 98, column: 6)
!478 = !DILocation(line: 98, column: 11, scope: !477)
!479 = !DILocation(line: 98, column: 18, scope: !477)
!480 = !DILocation(line: 98, column: 6, scope: !460)
!481 = !DILocation(line: 99, column: 18, scope: !477)
!482 = !DILocation(line: 99, column: 23, scope: !477)
!483 = !DILocation(line: 99, column: 17, scope: !477)
!484 = !DILocation(line: 99, column: 28, scope: !477)
!485 = !DILocation(line: 99, column: 33, scope: !477)
!486 = !DILocation(line: 99, column: 27, scope: !477)
!487 = !DILocation(line: 99, column: 10, scope: !477)
!488 = !DILocation(line: 99, column: 54, scope: !477)
!489 = !DILocation(line: 99, column: 3, scope: !477)
!490 = !DILocation(line: 101, column: 17, scope: !460)
!491 = !DILocation(line: 101, column: 22, scope: !460)
!492 = !DILocation(line: 101, column: 16, scope: !460)
!493 = !DILocation(line: 101, column: 27, scope: !460)
!494 = !DILocation(line: 101, column: 32, scope: !460)
!495 = !DILocation(line: 101, column: 26, scope: !460)
!496 = !DILocation(line: 101, column: 9, scope: !460)
!497 = !DILocation(line: 101, column: 39, scope: !460)
!498 = !DILocation(line: 101, column: 2, scope: !460)
!499 = !DILocation(line: 102, column: 1, scope: !460)
!500 = distinct !DISubprogram(name: "sin_get_ip", scope: !102, file: !102, line: 121, type: !501, isLocal: false, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503, !463}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!505 = !DILocalVariable(name: "so", arg: 1, scope: !500, file: !102, line: 121, type: !503)
!506 = !DILocation(line: 121, column: 45, scope: !500)
!507 = !DILocalVariable(name: "ip", arg: 2, scope: !500, file: !102, line: 121, type: !463)
!508 = !DILocation(line: 121, column: 57, scope: !500)
!509 = !DILocation(line: 123, column: 15, scope: !500)
!510 = !DILocation(line: 123, column: 19, scope: !500)
!511 = !DILocation(line: 123, column: 23, scope: !500)
!512 = !DILocation(line: 123, column: 2, scope: !500)
!513 = !DILocation(line: 123, column: 6, scope: !500)
!514 = !DILocation(line: 123, column: 13, scope: !500)
!515 = !DILocation(line: 125, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !500, file: !102, line: 125, column: 6)
!517 = !DILocation(line: 125, column: 10, scope: !516)
!518 = !DILocation(line: 125, column: 17, scope: !516)
!519 = !DILocation(line: 125, column: 6, scope: !500)
!520 = !DILocation(line: 126, column: 11, scope: !516)
!521 = !DILocation(line: 126, column: 15, scope: !516)
!522 = !DILocation(line: 126, column: 3, scope: !516)
!523 = !DILocation(line: 126, column: 20, scope: !516)
!524 = !DILocation(line: 126, column: 24, scope: !516)
!525 = !DILocation(line: 126, column: 29, scope: !516)
!526 = !DILocation(line: 128, column: 11, scope: !516)
!527 = !DILocation(line: 128, column: 15, scope: !516)
!528 = !DILocation(line: 128, column: 3, scope: !516)
!529 = !DILocation(line: 128, column: 20, scope: !516)
!530 = !DILocation(line: 128, column: 24, scope: !516)
!531 = !DILocation(line: 128, column: 28, scope: !516)
!532 = !DILocation(line: 129, column: 1, scope: !500)
!533 = distinct !DISubprogram(name: "net_connect_ip_handle", scope: !102, file: !102, line: 146, type: !534, isLocal: false, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!534 = !DISubroutineType(types: !535)
!535 = !{!145, !536, !145, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!538 = !DILocalVariable(name: "ip", arg: 1, scope: !533, file: !102, line: 146, type: !536)
!539 = !DILocation(line: 146, column: 41, scope: !533)
!540 = !DILocalVariable(name: "port", arg: 2, scope: !533, file: !102, line: 146, type: !145)
!541 = !DILocation(line: 146, column: 49, scope: !533)
!542 = !DILocalVariable(name: "my_ip", arg: 3, scope: !533, file: !102, line: 146, type: !536)
!543 = !DILocation(line: 146, column: 69, scope: !533)
!544 = !DILocalVariable(name: "so", scope: !533, file: !102, line: 148, type: !101)
!545 = !DILocation(line: 148, column: 23, scope: !533)
!546 = !DILocalVariable(name: "handle", scope: !533, file: !102, line: 149, type: !145)
!547 = !DILocation(line: 149, column: 6, scope: !533)
!548 = !DILocalVariable(name: "ret", scope: !533, file: !102, line: 149, type: !145)
!549 = !DILocation(line: 149, column: 14, scope: !533)
!550 = !DILocalVariable(name: "opt", scope: !533, file: !102, line: 149, type: !145)
!551 = !DILocation(line: 149, column: 19, scope: !533)
!552 = !DILocation(line: 151, column: 6, scope: !553)
!553 = distinct !DILexicalBlock(scope: !533, file: !102, line: 151, column: 6)
!554 = !DILocation(line: 151, column: 12, scope: !553)
!555 = !DILocation(line: 151, column: 19, scope: !553)
!556 = !DILocation(line: 151, column: 22, scope: !557)
!557 = !DILexicalBlockFile(scope: !553, file: !102, discriminator: 1)
!558 = !DILocation(line: 151, column: 26, scope: !557)
!559 = !DILocation(line: 151, column: 36, scope: !557)
!560 = !DILocation(line: 151, column: 43, scope: !557)
!561 = !DILocation(line: 151, column: 33, scope: !557)
!562 = !DILocation(line: 151, column: 6, scope: !557)
!563 = !DILocation(line: 152, column: 3, scope: !564)
!564 = distinct !DILexicalBlock(scope: !553, file: !102, line: 151, column: 51)
!565 = !DILocation(line: 153, column: 23, scope: !564)
!566 = !DILocation(line: 154, column: 2, scope: !564)
!567 = !DILocation(line: 157, column: 2, scope: !533)
!568 = !DILocation(line: 158, column: 29, scope: !533)
!569 = !DILocation(line: 158, column: 33, scope: !533)
!570 = !DILocation(line: 158, column: 12, scope: !533)
!571 = !DILocation(line: 158, column: 16, scope: !533)
!572 = !DILocation(line: 158, column: 27, scope: !533)
!573 = !DILocation(line: 159, column: 18, scope: !533)
!574 = !DILocation(line: 159, column: 22, scope: !533)
!575 = !DILocation(line: 159, column: 11, scope: !533)
!576 = !DILocation(line: 159, column: 9, scope: !533)
!577 = !DILocation(line: 161, column: 6, scope: !578)
!578 = distinct !DILexicalBlock(scope: !533, file: !102, line: 161, column: 6)
!579 = !DILocation(line: 161, column: 13, scope: !578)
!580 = !DILocation(line: 161, column: 6, scope: !533)
!581 = !DILocation(line: 162, column: 3, scope: !578)
!582 = !DILocation(line: 165, column: 8, scope: !533)
!583 = !DILocation(line: 165, column: 2, scope: !533)
!584 = !DILocation(line: 166, column: 13, scope: !533)
!585 = !DILocation(line: 166, column: 46, scope: !533)
!586 = !DILocation(line: 166, column: 2, scope: !533)
!587 = !DILocation(line: 167, column: 13, scope: !533)
!588 = !DILocation(line: 167, column: 46, scope: !533)
!589 = !DILocation(line: 167, column: 2, scope: !533)
!590 = !DILocation(line: 170, column: 6, scope: !591)
!591 = distinct !DILexicalBlock(scope: !533, file: !102, line: 170, column: 6)
!592 = !DILocation(line: 170, column: 12, scope: !591)
!593 = !DILocation(line: 170, column: 6, scope: !533)
!594 = !DILocation(line: 171, column: 19, scope: !595)
!595 = distinct !DILexicalBlock(scope: !591, file: !102, line: 170, column: 20)
!596 = !DILocation(line: 171, column: 3, scope: !595)
!597 = !DILocation(line: 172, column: 12, scope: !598)
!598 = distinct !DILexicalBlock(scope: !595, file: !102, line: 172, column: 7)
!599 = !DILocation(line: 172, column: 24, scope: !598)
!600 = !DILocation(line: 172, column: 34, scope: !598)
!601 = !DILocation(line: 172, column: 37, scope: !598)
!602 = !DILocation(line: 172, column: 29, scope: !598)
!603 = !DILocation(line: 172, column: 47, scope: !598)
!604 = !DILocation(line: 172, column: 28, scope: !598)
!605 = !DILocation(line: 172, column: 7, scope: !598)
!606 = !DILocation(line: 172, column: 64, scope: !598)
!607 = !DILocation(line: 172, column: 7, scope: !595)
!608 = !DILocalVariable(name: "old_errno", scope: !609, file: !102, line: 173, type: !145)
!609 = distinct !DILexicalBlock(scope: !598, file: !102, line: 172, column: 69)
!610 = !DILocation(line: 173, column: 8, scope: !609)
!611 = !DILocation(line: 173, column: 21, scope: !609)
!612 = !DILocation(line: 173, column: 20, scope: !609)
!613 = !DILocation(line: 175, column: 10, scope: !609)
!614 = !DILocation(line: 175, column: 4, scope: !609)
!615 = !DILocation(line: 176, column: 11, scope: !609)
!616 = !DILocation(line: 176, column: 5, scope: !609)
!617 = !DILocation(line: 176, column: 9, scope: !609)
!618 = !DILocation(line: 177, column: 4, scope: !609)
!619 = !DILocation(line: 179, column: 2, scope: !595)
!620 = !DILocation(line: 182, column: 18, scope: !533)
!621 = !DILocation(line: 182, column: 2, scope: !533)
!622 = !DILocation(line: 183, column: 20, scope: !533)
!623 = !DILocation(line: 183, column: 2, scope: !533)
!624 = !DILocation(line: 184, column: 16, scope: !533)
!625 = !DILocation(line: 184, column: 28, scope: !533)
!626 = !DILocation(line: 184, column: 38, scope: !533)
!627 = !DILocation(line: 184, column: 41, scope: !533)
!628 = !DILocation(line: 184, column: 33, scope: !533)
!629 = !DILocation(line: 184, column: 51, scope: !533)
!630 = !DILocation(line: 184, column: 32, scope: !533)
!631 = !DILocation(line: 184, column: 8, scope: !533)
!632 = !DILocation(line: 184, column: 6, scope: !533)
!633 = !DILocation(line: 186, column: 6, scope: !634)
!634 = distinct !DILexicalBlock(scope: !533, file: !102, line: 186, column: 6)
!635 = !DILocation(line: 186, column: 10, scope: !634)
!636 = !DILocation(line: 186, column: 14, scope: !634)
!637 = !DILocation(line: 186, column: 18, scope: !638)
!638 = !DILexicalBlockFile(scope: !634, file: !102, discriminator: 1)
!639 = !DILocation(line: 186, column: 17, scope: !638)
!640 = !DILocation(line: 186, column: 22, scope: !638)
!641 = !DILocation(line: 186, column: 6, scope: !638)
!642 = !DILocalVariable(name: "old_errno", scope: !643, file: !102, line: 188, type: !145)
!643 = distinct !DILexicalBlock(scope: !634, file: !102, line: 187, column: 2)
!644 = !DILocation(line: 188, column: 7, scope: !643)
!645 = !DILocation(line: 188, column: 20, scope: !643)
!646 = !DILocation(line: 188, column: 19, scope: !643)
!647 = !DILocation(line: 189, column: 9, scope: !643)
!648 = !DILocation(line: 189, column: 3, scope: !643)
!649 = !DILocation(line: 190, column: 10, scope: !643)
!650 = !DILocation(line: 190, column: 4, scope: !643)
!651 = !DILocation(line: 190, column: 8, scope: !643)
!652 = !DILocation(line: 191, column: 3, scope: !643)
!653 = !DILocation(line: 194, column: 9, scope: !533)
!654 = !DILocation(line: 194, column: 2, scope: !533)
!655 = !DILocation(line: 195, column: 1, scope: !533)
!656 = distinct !DISubprogram(name: "sin_set_ip", scope: !102, file: !102, line: 105, type: !657, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !100, !536}
!659 = !DILocalVariable(name: "so", arg: 1, scope: !656, file: !102, line: 105, type: !100)
!660 = !DILocation(line: 105, column: 46, scope: !656)
!661 = !DILocalVariable(name: "ip", arg: 2, scope: !656, file: !102, line: 105, type: !536)
!662 = !DILocation(line: 105, column: 64, scope: !656)
!663 = !DILocation(line: 107, column: 6, scope: !664)
!664 = distinct !DILexicalBlock(scope: !656, file: !102, line: 107, column: 6)
!665 = !DILocation(line: 107, column: 9, scope: !664)
!666 = !DILocation(line: 107, column: 6, scope: !656)
!667 = !DILocation(line: 108, column: 3, scope: !668)
!668 = distinct !DILexicalBlock(scope: !664, file: !102, line: 107, column: 17)
!669 = !DILocation(line: 108, column: 7, scope: !668)
!670 = !DILocation(line: 108, column: 12, scope: !668)
!671 = !DILocation(line: 108, column: 24, scope: !668)
!672 = !DILocation(line: 109, column: 3, scope: !668)
!673 = !DILocation(line: 109, column: 7, scope: !668)
!674 = !DILocation(line: 109, column: 12, scope: !668)
!675 = !DILocation(line: 109, column: 24, scope: !668)
!676 = !DILocation(line: 110, column: 3, scope: !668)
!677 = !DILocation(line: 113, column: 23, scope: !656)
!678 = !DILocation(line: 113, column: 27, scope: !656)
!679 = !DILocation(line: 113, column: 2, scope: !656)
!680 = !DILocation(line: 113, column: 6, scope: !656)
!681 = !DILocation(line: 113, column: 10, scope: !656)
!682 = !DILocation(line: 113, column: 21, scope: !656)
!683 = !DILocation(line: 115, column: 6, scope: !684)
!684 = distinct !DILexicalBlock(scope: !656, file: !102, line: 115, column: 6)
!685 = !DILocation(line: 115, column: 10, scope: !684)
!686 = !DILocation(line: 115, column: 17, scope: !684)
!687 = !DILocation(line: 115, column: 6, scope: !656)
!688 = !DILocation(line: 116, column: 11, scope: !684)
!689 = !DILocation(line: 116, column: 15, scope: !684)
!690 = !DILocation(line: 116, column: 20, scope: !684)
!691 = !DILocation(line: 116, column: 3, scope: !684)
!692 = !DILocation(line: 116, column: 32, scope: !684)
!693 = !DILocation(line: 116, column: 36, scope: !684)
!694 = !DILocation(line: 118, column: 11, scope: !684)
!695 = !DILocation(line: 118, column: 15, scope: !684)
!696 = !DILocation(line: 118, column: 19, scope: !684)
!697 = !DILocation(line: 118, column: 3, scope: !684)
!698 = !DILocation(line: 118, column: 30, scope: !684)
!699 = !DILocation(line: 118, column: 34, scope: !684)
!700 = !DILocation(line: 119, column: 1, scope: !656)
!701 = distinct !DISubprogram(name: "sin_set_port", scope: !102, file: !102, line: 131, type: !702, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !100, !145}
!704 = !DILocalVariable(name: "so", arg: 1, scope: !701, file: !102, line: 131, type: !100)
!705 = !DILocation(line: 131, column: 48, scope: !701)
!706 = !DILocalVariable(name: "port", arg: 2, scope: !701, file: !102, line: 131, type: !145)
!707 = !DILocation(line: 131, column: 56, scope: !701)
!708 = !DILocation(line: 133, column: 6, scope: !709)
!709 = distinct !DILexicalBlock(scope: !701, file: !102, line: 133, column: 6)
!710 = !DILocation(line: 133, column: 10, scope: !709)
!711 = !DILocation(line: 133, column: 14, scope: !709)
!712 = !DILocation(line: 133, column: 25, scope: !709)
!713 = !DILocation(line: 133, column: 6, scope: !701)
!714 = !DILocation(line: 134, column: 60, scope: !709)
!715 = !DILocation(line: 134, column: 44, scope: !709)
!716 = !DILocation(line: 134, column: 38, scope: !709)
!717 = !DILocation(line: 134, column: 17, scope: !709)
!718 = !DILocation(line: 134, column: 21, scope: !709)
!719 = !DILocation(line: 134, column: 26, scope: !709)
!720 = !DILocation(line: 134, column: 36, scope: !709)
!721 = !DILocation(line: 136, column: 44, scope: !709)
!722 = !DILocation(line: 136, column: 28, scope: !709)
!723 = !DILocation(line: 136, column: 22, scope: !709)
!724 = !DILocation(line: 136, column: 3, scope: !709)
!725 = !DILocation(line: 136, column: 7, scope: !709)
!726 = !DILocation(line: 136, column: 11, scope: !709)
!727 = !DILocation(line: 136, column: 20, scope: !709)
!728 = !DILocation(line: 137, column: 1, scope: !701)
!729 = distinct !DISubprogram(name: "net_connect_ip", scope: !102, file: !102, line: 198, type: !730, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!730 = !DISubroutineType(types: !731)
!731 = !{!161, !463, !145, !463}
!732 = !DILocalVariable(name: "ip", arg: 1, scope: !729, file: !102, line: 198, type: !463)
!733 = !DILocation(line: 198, column: 36, scope: !729)
!734 = !DILocalVariable(name: "port", arg: 2, scope: !729, file: !102, line: 198, type: !145)
!735 = !DILocation(line: 198, column: 44, scope: !729)
!736 = !DILocalVariable(name: "my_ip", arg: 3, scope: !729, file: !102, line: 198, type: !463)
!737 = !DILocation(line: 198, column: 58, scope: !729)
!738 = !DILocalVariable(name: "handle", scope: !729, file: !102, line: 200, type: !145)
!739 = !DILocation(line: 200, column: 6, scope: !729)
!740 = !DILocation(line: 208, column: 33, scope: !729)
!741 = !DILocation(line: 208, column: 37, scope: !729)
!742 = !DILocation(line: 208, column: 43, scope: !729)
!743 = !DILocation(line: 208, column: 11, scope: !729)
!744 = !DILocation(line: 208, column: 9, scope: !729)
!745 = !DILocation(line: 211, column: 6, scope: !746)
!746 = distinct !DILexicalBlock(scope: !729, file: !102, line: 211, column: 6)
!747 = !DILocation(line: 211, column: 13, scope: !746)
!748 = !DILocation(line: 211, column: 6, scope: !729)
!749 = !DILocation(line: 212, column: 3, scope: !746)
!750 = !DILocation(line: 214, column: 26, scope: !729)
!751 = !DILocation(line: 214, column: 9, scope: !729)
!752 = !DILocation(line: 214, column: 2, scope: !729)
!753 = !DILocation(line: 215, column: 1, scope: !729)
!754 = distinct !DISubprogram(name: "net_connect_unix", scope: !102, file: !102, line: 218, type: !755, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!755 = !DISubroutineType(types: !756)
!756 = !{!161, !93}
!757 = !DILocalVariable(name: "path", arg: 1, scope: !754, file: !102, line: 218, type: !93)
!758 = !DILocation(line: 218, column: 42, scope: !754)
!759 = !DILocalVariable(name: "sa", scope: !754, file: !102, line: 220, type: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", file: !761, line: 29, size: 880, align: 16, elements: !762)
!761 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/un.h", directory: "/home/lichi/Desktop/irssi/task1")
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !760, file: !761, line: 31, baseType: !86, size: 16, align: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !760, file: !761, line: 32, baseType: !765, size: 864, align: 8, offset: 16)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 864, align: 8, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 108)
!768 = !DILocation(line: 220, column: 21, scope: !754)
!769 = !DILocalVariable(name: "handle", scope: !754, file: !102, line: 221, type: !145)
!770 = !DILocation(line: 221, column: 6, scope: !754)
!771 = !DILocalVariable(name: "ret", scope: !754, file: !102, line: 221, type: !145)
!772 = !DILocation(line: 221, column: 14, scope: !754)
!773 = !DILocation(line: 224, column: 11, scope: !754)
!774 = !DILocation(line: 224, column: 9, scope: !754)
!775 = !DILocation(line: 225, column: 6, scope: !776)
!776 = distinct !DILexicalBlock(scope: !754, file: !102, line: 225, column: 6)
!777 = !DILocation(line: 225, column: 13, scope: !776)
!778 = !DILocation(line: 225, column: 6, scope: !754)
!779 = !DILocation(line: 226, column: 3, scope: !776)
!780 = !DILocation(line: 229, column: 8, scope: !754)
!781 = !DILocation(line: 229, column: 2, scope: !754)
!782 = !DILocation(line: 232, column: 2, scope: !754)
!783 = !DILocation(line: 233, column: 5, scope: !754)
!784 = !DILocation(line: 233, column: 16, scope: !754)
!785 = !DILocation(line: 234, column: 13, scope: !754)
!786 = !DILocation(line: 234, column: 10, scope: !754)
!787 = !DILocation(line: 234, column: 23, scope: !754)
!788 = !DILocation(line: 234, column: 2, scope: !754)
!789 = !DILocation(line: 235, column: 5, scope: !754)
!790 = !DILocation(line: 235, column: 2, scope: !754)
!791 = !DILocation(line: 235, column: 37, scope: !754)
!792 = !DILocation(line: 237, column: 16, scope: !754)
!793 = !DILocation(line: 237, column: 24, scope: !754)
!794 = !DILocation(line: 237, column: 8, scope: !754)
!795 = !DILocation(line: 237, column: 6, scope: !754)
!796 = !DILocation(line: 238, column: 6, scope: !797)
!797 = distinct !DILexicalBlock(scope: !754, file: !102, line: 238, column: 6)
!798 = !DILocation(line: 238, column: 10, scope: !797)
!799 = !DILocation(line: 238, column: 14, scope: !797)
!800 = !DILocation(line: 238, column: 18, scope: !801)
!801 = !DILexicalBlockFile(scope: !797, file: !102, discriminator: 1)
!802 = !DILocation(line: 238, column: 17, scope: !801)
!803 = !DILocation(line: 238, column: 22, scope: !801)
!804 = !DILocation(line: 238, column: 6, scope: !801)
!805 = !DILocalVariable(name: "old_errno", scope: !806, file: !102, line: 239, type: !145)
!806 = distinct !DILexicalBlock(scope: !797, file: !102, line: 238, column: 38)
!807 = !DILocation(line: 239, column: 7, scope: !806)
!808 = !DILocation(line: 239, column: 20, scope: !806)
!809 = !DILocation(line: 239, column: 19, scope: !806)
!810 = !DILocation(line: 240, column: 9, scope: !806)
!811 = !DILocation(line: 240, column: 3, scope: !806)
!812 = !DILocation(line: 241, column: 10, scope: !806)
!813 = !DILocation(line: 241, column: 4, scope: !806)
!814 = !DILocation(line: 241, column: 8, scope: !806)
!815 = !DILocation(line: 242, column: 3, scope: !806)
!816 = !DILocation(line: 245, column: 26, scope: !754)
!817 = !DILocation(line: 245, column: 9, scope: !754)
!818 = !DILocation(line: 245, column: 2, scope: !754)
!819 = !DILocation(line: 246, column: 1, scope: !754)
!820 = distinct !DISubprogram(name: "net_disconnect", scope: !102, file: !102, line: 249, type: !297, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!821 = !DILocalVariable(name: "handle", arg: 1, scope: !820, file: !102, line: 249, type: !161)
!822 = !DILocation(line: 249, column: 33, scope: !820)
!823 = !DILocation(line: 251, column: 2, scope: !820)
!824 = distinct !{!824, !823}
!825 = !DILocation(line: 251, column: 10, scope: !826)
!826 = !DILexicalBlockFile(scope: !827, file: !102, discriminator: 1)
!827 = distinct !DILexicalBlock(scope: !828, file: !102, line: 251, column: 10)
!828 = distinct !DILexicalBlock(scope: !820, file: !102, line: 251, column: 4)
!829 = !DILocation(line: 251, column: 17, scope: !826)
!830 = !DILocation(line: 251, column: 5, scope: !831)
!831 = !DILexicalBlockFile(scope: !832, file: !102, discriminator: 2)
!832 = distinct !DILexicalBlock(scope: !827, file: !102, line: 251, column: 3)
!833 = !DILocation(line: 251, column: 14, scope: !834)
!834 = !DILexicalBlockFile(scope: !835, file: !102, discriminator: 3)
!835 = distinct !DILexicalBlock(scope: !827, file: !102, line: 251, column: 12)
!836 = !DILocation(line: 251, column: 101, scope: !834)
!837 = !DILocation(line: 251, column: 112, scope: !838)
!838 = !DILexicalBlockFile(scope: !828, file: !102, discriminator: 4)
!839 = !DILocation(line: 253, column: 24, scope: !820)
!840 = !DILocation(line: 253, column: 2, scope: !820)
!841 = !DILocation(line: 254, column: 21, scope: !820)
!842 = !DILocation(line: 254, column: 2, scope: !820)
!843 = !DILocation(line: 255, column: 1, scope: !820)
!844 = !DILocation(line: 255, column: 1, scope: !845)
!845 = !DILexicalBlockFile(scope: !820, file: !102, discriminator: 1)
!846 = distinct !DISubprogram(name: "net_listen", scope: !102, file: !102, line: 259, type: !847, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!847 = !DISubroutineType(types: !848)
!848 = !{!161, !463, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!850 = !DILocalVariable(name: "my_ip", arg: 1, scope: !846, file: !102, line: 259, type: !463)
!851 = !DILocation(line: 259, column: 32, scope: !846)
!852 = !DILocalVariable(name: "port", arg: 2, scope: !846, file: !102, line: 259, type: !849)
!853 = !DILocation(line: 259, column: 44, scope: !846)
!854 = !DILocalVariable(name: "so", scope: !846, file: !102, line: 261, type: !101)
!855 = !DILocation(line: 261, column: 23, scope: !846)
!856 = !DILocalVariable(name: "ret", scope: !846, file: !102, line: 262, type: !145)
!857 = !DILocation(line: 262, column: 6, scope: !846)
!858 = !DILocalVariable(name: "handle", scope: !846, file: !102, line: 262, type: !145)
!859 = !DILocation(line: 262, column: 11, scope: !846)
!860 = !DILocalVariable(name: "opt", scope: !846, file: !102, line: 262, type: !145)
!861 = !DILocation(line: 262, column: 19, scope: !846)
!862 = !DILocalVariable(name: "len", scope: !846, file: !102, line: 263, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !864, line: 277, baseType: !865)
!864 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/lichi/Desktop/irssi/task1")
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !412, line: 189, baseType: !99)
!866 = !DILocation(line: 263, column: 12, scope: !846)
!867 = !DILocation(line: 265, column: 2, scope: !846)
!868 = distinct !{!868, !867}
!869 = !DILocation(line: 265, column: 10, scope: !870)
!870 = !DILexicalBlockFile(scope: !871, file: !102, discriminator: 1)
!871 = distinct !DILexicalBlock(scope: !872, file: !102, line: 265, column: 10)
!872 = distinct !DILexicalBlock(scope: !846, file: !102, line: 265, column: 4)
!873 = !DILocation(line: 265, column: 15, scope: !870)
!874 = !DILocation(line: 265, column: 5, scope: !875)
!875 = !DILexicalBlockFile(scope: !876, file: !102, discriminator: 2)
!876 = distinct !DILexicalBlock(scope: !871, file: !102, line: 265, column: 3)
!877 = !DILocation(line: 265, column: 14, scope: !878)
!878 = !DILexicalBlockFile(scope: !879, file: !102, discriminator: 3)
!879 = distinct !DILexicalBlock(scope: !871, file: !102, line: 265, column: 12)
!880 = !DILocation(line: 265, column: 99, scope: !878)
!881 = !DILocation(line: 265, column: 7, scope: !882)
!882 = !DILexicalBlockFile(scope: !872, file: !102, discriminator: 4)
!883 = !DILocation(line: 267, column: 2, scope: !846)
!884 = !DILocation(line: 268, column: 18, scope: !846)
!885 = !DILocation(line: 268, column: 2, scope: !846)
!886 = !DILocation(line: 269, column: 21, scope: !846)
!887 = !DILocation(line: 269, column: 20, scope: !846)
!888 = !DILocation(line: 269, column: 2, scope: !846)
!889 = !DILocation(line: 272, column: 21, scope: !846)
!890 = !DILocation(line: 272, column: 25, scope: !846)
!891 = !DILocation(line: 272, column: 18, scope: !846)
!892 = !DILocation(line: 272, column: 11, scope: !846)
!893 = !DILocation(line: 272, column: 9, scope: !846)
!894 = !DILocation(line: 274, column: 6, scope: !895)
!895 = distinct !DILexicalBlock(scope: !846, file: !102, line: 274, column: 6)
!896 = !DILocation(line: 274, column: 13, scope: !895)
!897 = !DILocation(line: 274, column: 19, scope: !895)
!898 = !DILocation(line: 274, column: 24, scope: !899)
!899 = !DILexicalBlockFile(scope: !895, file: !102, discriminator: 1)
!900 = !DILocation(line: 274, column: 23, scope: !899)
!901 = !DILocation(line: 274, column: 28, scope: !899)
!902 = !DILocation(line: 274, column: 38, scope: !899)
!903 = !DILocation(line: 274, column: 43, scope: !904)
!904 = !DILexicalBlockFile(scope: !895, file: !102, discriminator: 2)
!905 = !DILocation(line: 274, column: 42, scope: !904)
!906 = !DILocation(line: 274, column: 47, scope: !904)
!907 = !DILocation(line: 274, column: 6, scope: !904)
!908 = !DILocation(line: 276, column: 6, scope: !909)
!909 = distinct !DILexicalBlock(scope: !895, file: !102, line: 274, column: 65)
!910 = !DILocation(line: 276, column: 10, scope: !909)
!911 = !DILocation(line: 276, column: 21, scope: !909)
!912 = !DILocation(line: 277, column: 6, scope: !909)
!913 = !DILocation(line: 277, column: 10, scope: !909)
!914 = !DILocation(line: 277, column: 19, scope: !909)
!915 = !DILocation(line: 277, column: 26, scope: !909)
!916 = !DILocation(line: 279, column: 12, scope: !909)
!917 = !DILocation(line: 279, column: 10, scope: !909)
!918 = !DILocation(line: 280, column: 2, scope: !909)
!919 = !DILocation(line: 282, column: 6, scope: !920)
!920 = distinct !DILexicalBlock(scope: !846, file: !102, line: 282, column: 6)
!921 = !DILocation(line: 282, column: 13, scope: !920)
!922 = !DILocation(line: 282, column: 6, scope: !846)
!923 = !DILocation(line: 283, column: 3, scope: !920)
!924 = !DILocation(line: 286, column: 8, scope: !846)
!925 = !DILocation(line: 286, column: 2, scope: !846)
!926 = !DILocation(line: 287, column: 13, scope: !846)
!927 = !DILocation(line: 287, column: 46, scope: !846)
!928 = !DILocation(line: 287, column: 2, scope: !846)
!929 = !DILocation(line: 288, column: 13, scope: !846)
!930 = !DILocation(line: 288, column: 46, scope: !846)
!931 = !DILocation(line: 288, column: 2, scope: !846)
!932 = !DILocation(line: 291, column: 13, scope: !846)
!933 = !DILocation(line: 291, column: 25, scope: !846)
!934 = !DILocation(line: 291, column: 35, scope: !846)
!935 = !DILocation(line: 291, column: 38, scope: !846)
!936 = !DILocation(line: 291, column: 30, scope: !846)
!937 = !DILocation(line: 291, column: 48, scope: !846)
!938 = !DILocation(line: 291, column: 29, scope: !846)
!939 = !DILocation(line: 291, column: 8, scope: !846)
!940 = !DILocation(line: 291, column: 6, scope: !846)
!941 = !DILocation(line: 292, column: 6, scope: !942)
!942 = distinct !DILexicalBlock(scope: !846, file: !102, line: 292, column: 6)
!943 = !DILocation(line: 292, column: 10, scope: !942)
!944 = !DILocation(line: 292, column: 6, scope: !846)
!945 = !DILocation(line: 294, column: 15, scope: !946)
!946 = distinct !DILexicalBlock(scope: !942, file: !102, line: 292, column: 16)
!947 = !DILocation(line: 294, column: 18, scope: !946)
!948 = !DILocation(line: 294, column: 10, scope: !946)
!949 = !DILocation(line: 294, column: 28, scope: !946)
!950 = !DILocation(line: 294, column: 9, scope: !946)
!951 = !DILocation(line: 294, column: 7, scope: !946)
!952 = !DILocation(line: 295, column: 21, scope: !946)
!953 = !DILocation(line: 295, column: 33, scope: !946)
!954 = !DILocation(line: 295, column: 9, scope: !946)
!955 = !DILocation(line: 295, column: 7, scope: !946)
!956 = !DILocation(line: 296, column: 7, scope: !957)
!957 = distinct !DILexicalBlock(scope: !946, file: !102, line: 296, column: 7)
!958 = !DILocation(line: 296, column: 11, scope: !957)
!959 = !DILocation(line: 296, column: 7, scope: !946)
!960 = !DILocation(line: 297, column: 12, scope: !961)
!961 = distinct !DILexicalBlock(scope: !957, file: !102, line: 296, column: 17)
!962 = !DILocation(line: 297, column: 5, scope: !961)
!963 = !DILocation(line: 297, column: 10, scope: !961)
!964 = !DILocation(line: 300, column: 15, scope: !965)
!965 = distinct !DILexicalBlock(scope: !961, file: !102, line: 300, column: 8)
!966 = !DILocation(line: 300, column: 8, scope: !965)
!967 = !DILocation(line: 300, column: 26, scope: !965)
!968 = !DILocation(line: 300, column: 8, scope: !961)
!969 = !DILocation(line: 301, column: 57, scope: !965)
!970 = !DILocation(line: 301, column: 40, scope: !965)
!971 = !DILocation(line: 301, column: 33, scope: !965)
!972 = !DILocation(line: 302, column: 3, scope: !961)
!973 = !DILocation(line: 304, column: 2, scope: !946)
!974 = !DILocation(line: 307, column: 8, scope: !846)
!975 = !DILocation(line: 307, column: 2, scope: !846)
!976 = !DILocation(line: 308, column: 2, scope: !846)
!977 = !DILocation(line: 309, column: 1, scope: !846)
!978 = distinct !DISubprogram(name: "sin_get_port", scope: !102, file: !102, line: 139, type: !979, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!979 = !DISubroutineType(types: !980)
!980 = !{!145, !100}
!981 = !DILocalVariable(name: "so", arg: 1, scope: !978, file: !102, line: 139, type: !100)
!982 = !DILocation(line: 139, column: 47, scope: !978)
!983 = !DILocation(line: 141, column: 16, scope: !978)
!984 = !DILocation(line: 141, column: 20, scope: !978)
!985 = !DILocation(line: 141, column: 24, scope: !978)
!986 = !DILocation(line: 141, column: 35, scope: !978)
!987 = !DILocation(line: 141, column: 15, scope: !978)
!988 = !DILocation(line: 142, column: 8, scope: !978)
!989 = !DILocation(line: 142, column: 12, scope: !978)
!990 = !DILocation(line: 142, column: 17, scope: !978)
!991 = !DILocation(line: 141, column: 15, scope: !992)
!992 = !DILexicalBlockFile(scope: !978, file: !102, discriminator: 1)
!993 = !DILocation(line: 143, column: 8, scope: !978)
!994 = !DILocation(line: 143, column: 12, scope: !978)
!995 = !DILocation(line: 143, column: 16, scope: !978)
!996 = !DILocation(line: 141, column: 15, scope: !997)
!997 = !DILexicalBlockFile(scope: !978, file: !102, discriminator: 2)
!998 = !DILocation(line: 141, column: 15, scope: !999)
!999 = !DILexicalBlockFile(scope: !978, file: !102, discriminator: 3)
!1000 = !DILocation(line: 141, column: 9, scope: !999)
!1001 = !DILocation(line: 141, column: 2, scope: !999)
!1002 = distinct !DISubprogram(name: "net_accept", scope: !102, file: !102, line: 312, type: !1003, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!161, !161, !463, !849}
!1005 = !DILocalVariable(name: "handle", arg: 1, scope: !1002, file: !102, line: 312, type: !161)
!1006 = !DILocation(line: 312, column: 36, scope: !1002)
!1007 = !DILocalVariable(name: "addr", arg: 2, scope: !1002, file: !102, line: 312, type: !463)
!1008 = !DILocation(line: 312, column: 52, scope: !1002)
!1009 = !DILocalVariable(name: "port", arg: 3, scope: !1002, file: !102, line: 312, type: !849)
!1010 = !DILocation(line: 312, column: 63, scope: !1002)
!1011 = !DILocalVariable(name: "so", scope: !1002, file: !102, line: 314, type: !101)
!1012 = !DILocation(line: 314, column: 23, scope: !1002)
!1013 = !DILocalVariable(name: "ret", scope: !1002, file: !102, line: 315, type: !145)
!1014 = !DILocation(line: 315, column: 6, scope: !1002)
!1015 = !DILocalVariable(name: "addrlen", scope: !1002, file: !102, line: 316, type: !863)
!1016 = !DILocation(line: 316, column: 12, scope: !1002)
!1017 = !DILocation(line: 318, column: 2, scope: !1002)
!1018 = distinct !{!1018, !1017}
!1019 = !DILocation(line: 318, column: 10, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1021, file: !102, discriminator: 1)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !102, line: 318, column: 10)
!1022 = distinct !DILexicalBlock(scope: !1002, file: !102, line: 318, column: 4)
!1023 = !DILocation(line: 318, column: 17, scope: !1020)
!1024 = !DILocation(line: 318, column: 5, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1026, file: !102, discriminator: 2)
!1026 = distinct !DILexicalBlock(scope: !1021, file: !102, line: 318, column: 3)
!1027 = !DILocation(line: 318, column: 14, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !1029, file: !102, discriminator: 3)
!1029 = distinct !DILexicalBlock(scope: !1021, file: !102, line: 318, column: 12)
!1030 = !DILocation(line: 318, column: 101, scope: !1028)
!1031 = !DILocation(line: 318, column: 7, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !1022, file: !102, discriminator: 4)
!1033 = !DILocation(line: 320, column: 10, scope: !1002)
!1034 = !DILocation(line: 321, column: 40, scope: !1002)
!1035 = !DILocation(line: 321, column: 15, scope: !1002)
!1036 = !DILocation(line: 321, column: 53, scope: !1002)
!1037 = !DILocation(line: 321, column: 8, scope: !1038)
!1038 = !DILexicalBlockFile(scope: !1002, file: !102, discriminator: 1)
!1039 = !DILocation(line: 321, column: 6, scope: !1002)
!1040 = !DILocation(line: 323, column: 6, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1002, file: !102, line: 323, column: 6)
!1042 = !DILocation(line: 323, column: 10, scope: !1041)
!1043 = !DILocation(line: 323, column: 6, scope: !1002)
!1044 = !DILocation(line: 324, column: 3, scope: !1041)
!1045 = !DILocation(line: 326, column: 6, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1002, file: !102, line: 326, column: 6)
!1047 = !DILocation(line: 326, column: 11, scope: !1046)
!1048 = !DILocation(line: 326, column: 6, scope: !1002)
!1049 = !DILocation(line: 326, column: 35, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1046, file: !102, discriminator: 1)
!1051 = !DILocation(line: 326, column: 19, scope: !1050)
!1052 = !DILocation(line: 327, column: 6, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1002, file: !102, line: 327, column: 6)
!1054 = !DILocation(line: 327, column: 11, scope: !1053)
!1055 = !DILocation(line: 327, column: 6, scope: !1002)
!1056 = !DILocation(line: 327, column: 27, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !1053, file: !102, discriminator: 1)
!1058 = !DILocation(line: 327, column: 20, scope: !1057)
!1059 = !DILocation(line: 327, column: 25, scope: !1057)
!1060 = !DILocation(line: 327, column: 19, scope: !1057)
!1061 = !DILocation(line: 329, column: 8, scope: !1002)
!1062 = !DILocation(line: 329, column: 2, scope: !1002)
!1063 = !DILocation(line: 330, column: 26, scope: !1002)
!1064 = !DILocation(line: 330, column: 9, scope: !1002)
!1065 = !DILocation(line: 330, column: 2, scope: !1002)
!1066 = !DILocation(line: 331, column: 1, scope: !1002)
!1067 = distinct !DISubprogram(name: "net_receive", scope: !102, file: !102, line: 334, type: !1068, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!145, !161, !75, !145}
!1070 = !DILocalVariable(name: "handle", arg: 1, scope: !1067, file: !102, line: 334, type: !161)
!1071 = !DILocation(line: 334, column: 29, scope: !1067)
!1072 = !DILocalVariable(name: "buf", arg: 2, scope: !1067, file: !102, line: 334, type: !75)
!1073 = !DILocation(line: 334, column: 43, scope: !1067)
!1074 = !DILocalVariable(name: "len", arg: 3, scope: !1067, file: !102, line: 334, type: !145)
!1075 = !DILocation(line: 334, column: 52, scope: !1067)
!1076 = !DILocalVariable(name: "ret", scope: !1067, file: !102, line: 336, type: !177)
!1077 = !DILocation(line: 336, column: 15, scope: !1067)
!1078 = !DILocalVariable(name: "status", scope: !1067, file: !102, line: 337, type: !176)
!1079 = !DILocation(line: 337, column: 12, scope: !1067)
!1080 = !DILocalVariable(name: "err", scope: !1067, file: !102, line: 338, type: !182)
!1081 = !DILocation(line: 338, column: 10, scope: !1067)
!1082 = !DILocation(line: 340, column: 2, scope: !1067)
!1083 = distinct !{!1083, !1082}
!1084 = !DILocation(line: 340, column: 10, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !1086, file: !102, discriminator: 1)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !102, line: 340, column: 10)
!1087 = distinct !DILexicalBlock(scope: !1067, file: !102, line: 340, column: 4)
!1088 = !DILocation(line: 340, column: 17, scope: !1085)
!1089 = !DILocation(line: 340, column: 5, scope: !1090)
!1090 = !DILexicalBlockFile(scope: !1091, file: !102, discriminator: 2)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !102, line: 340, column: 3)
!1092 = !DILocation(line: 340, column: 14, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1094, file: !102, discriminator: 3)
!1094 = distinct !DILexicalBlock(scope: !1086, file: !102, line: 340, column: 12)
!1095 = !DILocation(line: 340, column: 101, scope: !1093)
!1096 = !DILocation(line: 340, column: 117, scope: !1097)
!1097 = !DILexicalBlockFile(scope: !1087, file: !102, discriminator: 4)
!1098 = !DILocation(line: 341, column: 2, scope: !1067)
!1099 = distinct !{!1099, !1098}
!1100 = !DILocation(line: 341, column: 10, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1102, file: !102, discriminator: 1)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !102, line: 341, column: 10)
!1103 = distinct !DILexicalBlock(scope: !1067, file: !102, line: 341, column: 4)
!1104 = !DILocation(line: 341, column: 14, scope: !1101)
!1105 = !DILocation(line: 341, column: 5, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1107, file: !102, discriminator: 2)
!1107 = distinct !DILexicalBlock(scope: !1102, file: !102, line: 341, column: 3)
!1108 = !DILocation(line: 341, column: 14, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1110, file: !102, discriminator: 3)
!1110 = distinct !DILexicalBlock(scope: !1102, file: !102, line: 341, column: 12)
!1111 = !DILocation(line: 341, column: 98, scope: !1109)
!1112 = !DILocation(line: 341, column: 114, scope: !1113)
!1113 = !DILexicalBlockFile(scope: !1103, file: !102, discriminator: 4)
!1114 = !DILocation(line: 343, column: 35, scope: !1067)
!1115 = !DILocation(line: 343, column: 43, scope: !1067)
!1116 = !DILocation(line: 343, column: 48, scope: !1067)
!1117 = !DILocation(line: 343, column: 11, scope: !1067)
!1118 = !DILocation(line: 343, column: 9, scope: !1067)
!1119 = !DILocation(line: 344, column: 6, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1067, file: !102, line: 344, column: 6)
!1121 = !DILocation(line: 344, column: 10, scope: !1120)
!1122 = !DILocation(line: 344, column: 6, scope: !1067)
!1123 = !DILocation(line: 345, column: 58, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !102, line: 344, column: 18)
!1125 = !DILocation(line: 345, column: 63, scope: !1124)
!1126 = !DILocation(line: 345, column: 10, scope: !1124)
!1127 = !DILocation(line: 346, column: 23, scope: !1124)
!1128 = !DILocation(line: 346, column: 10, scope: !1124)
!1129 = !DILocation(line: 347, column: 2, scope: !1124)
!1130 = !DILocation(line: 348, column: 6, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1067, file: !102, line: 348, column: 6)
!1132 = !DILocation(line: 348, column: 13, scope: !1131)
!1133 = !DILocation(line: 348, column: 34, scope: !1131)
!1134 = !DILocation(line: 348, column: 37, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1131, file: !102, discriminator: 1)
!1136 = !DILocation(line: 348, column: 44, scope: !1135)
!1137 = !DILocation(line: 348, column: 6, scope: !1135)
!1138 = !DILocation(line: 349, column: 3, scope: !1131)
!1139 = !DILocation(line: 351, column: 9, scope: !1067)
!1140 = !DILocation(line: 351, column: 2, scope: !1067)
!1141 = !DILocation(line: 352, column: 1, scope: !1067)
!1142 = distinct !DISubprogram(name: "net_transmit", scope: !102, file: !102, line: 355, type: !1143, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!145, !161, !93, !145}
!1145 = !DILocalVariable(name: "handle", arg: 1, scope: !1142, file: !102, line: 355, type: !161)
!1146 = !DILocation(line: 355, column: 30, scope: !1142)
!1147 = !DILocalVariable(name: "data", arg: 2, scope: !1142, file: !102, line: 355, type: !93)
!1148 = !DILocation(line: 355, column: 50, scope: !1142)
!1149 = !DILocalVariable(name: "len", arg: 3, scope: !1142, file: !102, line: 355, type: !145)
!1150 = !DILocation(line: 355, column: 60, scope: !1142)
!1151 = !DILocalVariable(name: "ret", scope: !1142, file: !102, line: 357, type: !177)
!1152 = !DILocation(line: 357, column: 15, scope: !1142)
!1153 = !DILocalVariable(name: "status", scope: !1142, file: !102, line: 358, type: !176)
!1154 = !DILocation(line: 358, column: 12, scope: !1142)
!1155 = !DILocalVariable(name: "err", scope: !1142, file: !102, line: 359, type: !182)
!1156 = !DILocation(line: 359, column: 10, scope: !1142)
!1157 = !DILocation(line: 361, column: 2, scope: !1142)
!1158 = distinct !{!1158, !1157}
!1159 = !DILocation(line: 361, column: 10, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1161, file: !102, discriminator: 1)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !102, line: 361, column: 10)
!1162 = distinct !DILexicalBlock(scope: !1142, file: !102, line: 361, column: 4)
!1163 = !DILocation(line: 361, column: 17, scope: !1160)
!1164 = !DILocation(line: 361, column: 5, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1166, file: !102, discriminator: 2)
!1166 = distinct !DILexicalBlock(scope: !1161, file: !102, line: 361, column: 3)
!1167 = !DILocation(line: 361, column: 14, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1169, file: !102, discriminator: 3)
!1169 = distinct !DILexicalBlock(scope: !1161, file: !102, line: 361, column: 12)
!1170 = !DILocation(line: 361, column: 101, scope: !1168)
!1171 = !DILocation(line: 361, column: 117, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1162, file: !102, discriminator: 4)
!1173 = !DILocation(line: 362, column: 2, scope: !1142)
!1174 = distinct !{!1174, !1173}
!1175 = !DILocation(line: 362, column: 10, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1177, file: !102, discriminator: 1)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !102, line: 362, column: 10)
!1178 = distinct !DILexicalBlock(scope: !1142, file: !102, line: 362, column: 4)
!1179 = !DILocation(line: 362, column: 15, scope: !1176)
!1180 = !DILocation(line: 362, column: 5, scope: !1181)
!1181 = !DILexicalBlockFile(scope: !1182, file: !102, discriminator: 2)
!1182 = distinct !DILexicalBlock(scope: !1177, file: !102, line: 362, column: 3)
!1183 = !DILocation(line: 362, column: 14, scope: !1184)
!1184 = !DILexicalBlockFile(scope: !1185, file: !102, discriminator: 3)
!1185 = distinct !DILexicalBlock(scope: !1177, file: !102, line: 362, column: 12)
!1186 = !DILocation(line: 362, column: 99, scope: !1184)
!1187 = !DILocation(line: 362, column: 115, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1178, file: !102, discriminator: 4)
!1189 = !DILocation(line: 364, column: 36, scope: !1142)
!1190 = !DILocation(line: 364, column: 53, scope: !1142)
!1191 = !DILocation(line: 364, column: 59, scope: !1142)
!1192 = !DILocation(line: 364, column: 11, scope: !1142)
!1193 = !DILocation(line: 364, column: 9, scope: !1142)
!1194 = !DILocation(line: 365, column: 6, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1142, file: !102, line: 365, column: 6)
!1196 = !DILocation(line: 365, column: 10, scope: !1195)
!1197 = !DILocation(line: 365, column: 6, scope: !1142)
!1198 = !DILocation(line: 366, column: 58, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1195, file: !102, line: 365, column: 18)
!1200 = !DILocation(line: 366, column: 63, scope: !1199)
!1201 = !DILocation(line: 366, column: 10, scope: !1199)
!1202 = !DILocation(line: 367, column: 23, scope: !1199)
!1203 = !DILocation(line: 367, column: 10, scope: !1199)
!1204 = !DILocation(line: 368, column: 2, scope: !1199)
!1205 = !DILocation(line: 369, column: 6, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1142, file: !102, line: 369, column: 6)
!1207 = !DILocation(line: 369, column: 13, scope: !1206)
!1208 = !DILocation(line: 369, column: 6, scope: !1142)
!1209 = !DILocation(line: 370, column: 3, scope: !1206)
!1210 = !DILocation(line: 372, column: 9, scope: !1142)
!1211 = !DILocation(line: 372, column: 2, scope: !1142)
!1212 = !DILocation(line: 373, column: 1, scope: !1142)
!1213 = distinct !DISubprogram(name: "net_getsockname", scope: !102, file: !102, line: 376, type: !1214, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!145, !161, !463, !849}
!1216 = !DILocalVariable(name: "handle", arg: 1, scope: !1213, file: !102, line: 376, type: !161)
!1217 = !DILocation(line: 376, column: 33, scope: !1213)
!1218 = !DILocalVariable(name: "addr", arg: 2, scope: !1213, file: !102, line: 376, type: !463)
!1219 = !DILocation(line: 376, column: 49, scope: !1213)
!1220 = !DILocalVariable(name: "port", arg: 3, scope: !1213, file: !102, line: 376, type: !849)
!1221 = !DILocation(line: 376, column: 60, scope: !1213)
!1222 = !DILocalVariable(name: "so", scope: !1213, file: !102, line: 378, type: !101)
!1223 = !DILocation(line: 378, column: 23, scope: !1213)
!1224 = !DILocalVariable(name: "addrlen", scope: !1213, file: !102, line: 379, type: !863)
!1225 = !DILocation(line: 379, column: 12, scope: !1213)
!1226 = !DILocation(line: 381, column: 2, scope: !1213)
!1227 = distinct !{!1227, !1226}
!1228 = !DILocation(line: 381, column: 10, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1230, file: !102, discriminator: 1)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !102, line: 381, column: 10)
!1231 = distinct !DILexicalBlock(scope: !1213, file: !102, line: 381, column: 4)
!1232 = !DILocation(line: 381, column: 17, scope: !1229)
!1233 = !DILocation(line: 381, column: 5, scope: !1234)
!1234 = !DILexicalBlockFile(scope: !1235, file: !102, discriminator: 2)
!1235 = distinct !DILexicalBlock(scope: !1230, file: !102, line: 381, column: 3)
!1236 = !DILocation(line: 381, column: 14, scope: !1237)
!1237 = !DILexicalBlockFile(scope: !1238, file: !102, discriminator: 3)
!1238 = distinct !DILexicalBlock(scope: !1230, file: !102, line: 381, column: 12)
!1239 = !DILocation(line: 381, column: 101, scope: !1237)
!1240 = !DILocation(line: 381, column: 117, scope: !1241)
!1241 = !DILexicalBlockFile(scope: !1231, file: !102, discriminator: 4)
!1242 = !DILocation(line: 382, column: 2, scope: !1213)
!1243 = distinct !{!1243, !1242}
!1244 = !DILocation(line: 382, column: 10, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1246, file: !102, discriminator: 1)
!1246 = distinct !DILexicalBlock(scope: !1247, file: !102, line: 382, column: 10)
!1247 = distinct !DILexicalBlock(scope: !1213, file: !102, line: 382, column: 4)
!1248 = !DILocation(line: 382, column: 15, scope: !1245)
!1249 = !DILocation(line: 382, column: 5, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1251, file: !102, discriminator: 2)
!1251 = distinct !DILexicalBlock(scope: !1246, file: !102, line: 382, column: 3)
!1252 = !DILocation(line: 382, column: 14, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1254, file: !102, discriminator: 3)
!1254 = distinct !DILexicalBlock(scope: !1246, file: !102, line: 382, column: 12)
!1255 = !DILocation(line: 382, column: 99, scope: !1253)
!1256 = !DILocation(line: 382, column: 115, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1247, file: !102, discriminator: 4)
!1258 = !DILocation(line: 384, column: 10, scope: !1213)
!1259 = !DILocation(line: 385, column: 43, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1213, file: !102, line: 385, column: 6)
!1261 = !DILocation(line: 385, column: 18, scope: !1260)
!1262 = !DILocation(line: 386, column: 4, scope: !1260)
!1263 = !DILocation(line: 385, column: 6, scope: !1264)
!1264 = !DILexicalBlockFile(scope: !1260, file: !102, discriminator: 1)
!1265 = !DILocation(line: 386, column: 39, scope: !1260)
!1266 = !DILocation(line: 385, column: 6, scope: !1213)
!1267 = !DILocation(line: 387, column: 3, scope: !1260)
!1268 = !DILocation(line: 389, column: 25, scope: !1213)
!1269 = !DILocation(line: 389, column: 9, scope: !1213)
!1270 = !DILocation(line: 390, column: 6, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1213, file: !102, line: 390, column: 6)
!1272 = !DILocation(line: 390, column: 6, scope: !1213)
!1273 = !DILocation(line: 390, column: 20, scope: !1274)
!1274 = !DILexicalBlockFile(scope: !1271, file: !102, discriminator: 1)
!1275 = !DILocation(line: 390, column: 13, scope: !1274)
!1276 = !DILocation(line: 390, column: 18, scope: !1274)
!1277 = !DILocation(line: 390, column: 12, scope: !1274)
!1278 = !DILocation(line: 392, column: 2, scope: !1213)
!1279 = !DILocation(line: 393, column: 1, scope: !1213)
!1280 = distinct !DISubprogram(name: "net_gethostbyname", scope: !102, file: !102, line: 398, type: !1281, isLocal: false, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !341)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!145, !93, !463, !463}
!1283 = !DILocalVariable(name: "addr", arg: 1, scope: !1280, file: !102, line: 398, type: !93)
!1284 = !DILocation(line: 398, column: 35, scope: !1280)
!1285 = !DILocalVariable(name: "ip4", arg: 2, scope: !1280, file: !102, line: 398, type: !463)
!1286 = !DILocation(line: 398, column: 49, scope: !1280)
!1287 = !DILocalVariable(name: "ip6", arg: 3, scope: !1280, file: !102, line: 398, type: !463)
!1288 = !DILocation(line: 398, column: 62, scope: !1280)
!1289 = !DILocalVariable(name: "so", scope: !1280, file: !102, line: 400, type: !100)
!1290 = !DILocation(line: 400, column: 24, scope: !1280)
!1291 = !DILocalVariable(name: "hints", scope: !1280, file: !102, line: 401, type: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !1293, line: 567, size: 384, align: 64, elements: !1294)
!1293 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/lichi/Desktop/irssi/task1")
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !1292, file: !1293, line: 569, baseType: !145, size: 32, align: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !1292, file: !1293, line: 570, baseType: !145, size: 32, align: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !1292, file: !1293, line: 571, baseType: !145, size: 32, align: 32, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !1292, file: !1293, line: 572, baseType: !145, size: 32, align: 32, offset: 96)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !1292, file: !1293, line: 573, baseType: !863, size: 32, align: 32, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !1292, file: !1293, line: 574, baseType: !81, size: 64, align: 64, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !1292, file: !1293, line: 575, baseType: !75, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !1292, file: !1293, line: 576, baseType: !1303, size: 64, align: 64, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1304 = !DILocation(line: 401, column: 18, scope: !1280)
!1305 = !DILocalVariable(name: "ai", scope: !1280, file: !102, line: 401, type: !1303)
!1306 = !DILocation(line: 401, column: 26, scope: !1280)
!1307 = !DILocalVariable(name: "ailist", scope: !1280, file: !102, line: 401, type: !1303)
!1308 = !DILocation(line: 401, column: 31, scope: !1280)
!1309 = !DILocalVariable(name: "ret", scope: !1280, file: !102, line: 402, type: !145)
!1310 = !DILocation(line: 402, column: 6, scope: !1280)
!1311 = !DILocalVariable(name: "count_v4", scope: !1280, file: !102, line: 402, type: !145)
!1312 = !DILocation(line: 402, column: 11, scope: !1280)
!1313 = !DILocalVariable(name: "count_v6", scope: !1280, file: !102, line: 402, type: !145)
!1314 = !DILocation(line: 402, column: 21, scope: !1280)
!1315 = !DILocalVariable(name: "use_v4", scope: !1280, file: !102, line: 402, type: !145)
!1316 = !DILocation(line: 402, column: 31, scope: !1280)
!1317 = !DILocalVariable(name: "use_v6", scope: !1280, file: !102, line: 402, type: !145)
!1318 = !DILocation(line: 402, column: 39, scope: !1280)
!1319 = !DILocation(line: 409, column: 2, scope: !1280)
!1320 = distinct !{!1320, !1319}
!1321 = !DILocation(line: 409, column: 10, scope: !1322)
!1322 = !DILexicalBlockFile(scope: !1323, file: !102, discriminator: 1)
!1323 = distinct !DILexicalBlock(scope: !1324, file: !102, line: 409, column: 10)
!1324 = distinct !DILexicalBlock(scope: !1280, file: !102, line: 409, column: 4)
!1325 = !DILocation(line: 409, column: 15, scope: !1322)
!1326 = !DILocation(line: 409, column: 5, scope: !1327)
!1327 = !DILexicalBlockFile(scope: !1328, file: !102, discriminator: 2)
!1328 = distinct !DILexicalBlock(scope: !1323, file: !102, line: 409, column: 3)
!1329 = !DILocation(line: 409, column: 14, scope: !1330)
!1330 = !DILexicalBlockFile(scope: !1331, file: !102, discriminator: 3)
!1331 = distinct !DILexicalBlock(scope: !1323, file: !102, line: 409, column: 12)
!1332 = !DILocation(line: 409, column: 99, scope: !1330)
!1333 = !DILocation(line: 409, column: 115, scope: !1334)
!1334 = !DILexicalBlockFile(scope: !1324, file: !102, discriminator: 4)
!1335 = !DILocation(line: 411, column: 9, scope: !1280)
!1336 = !DILocation(line: 411, column: 2, scope: !1280)
!1337 = !DILocation(line: 412, column: 9, scope: !1280)
!1338 = !DILocation(line: 412, column: 2, scope: !1280)
!1339 = !DILocation(line: 414, column: 2, scope: !1280)
!1340 = !DILocation(line: 415, column: 8, scope: !1280)
!1341 = !DILocation(line: 415, column: 20, scope: !1280)
!1342 = !DILocation(line: 416, column: 8, scope: !1280)
!1343 = !DILocation(line: 416, column: 17, scope: !1280)
!1344 = !DILocation(line: 419, column: 20, scope: !1280)
!1345 = !DILocation(line: 419, column: 8, scope: !1280)
!1346 = !DILocation(line: 419, column: 6, scope: !1280)
!1347 = !DILocation(line: 420, column: 6, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1280, file: !102, line: 420, column: 6)
!1349 = !DILocation(line: 420, column: 10, scope: !1348)
!1350 = !DILocation(line: 420, column: 6, scope: !1280)
!1351 = !DILocation(line: 421, column: 10, scope: !1348)
!1352 = !DILocation(line: 421, column: 3, scope: !1348)
!1353 = !DILocation(line: 424, column: 29, scope: !1280)
!1354 = !DILocation(line: 424, column: 18, scope: !1280)
!1355 = !DILocation(line: 425, column: 12, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1280, file: !102, line: 425, column: 2)
!1357 = !DILocation(line: 425, column: 10, scope: !1356)
!1358 = !DILocation(line: 425, column: 7, scope: !1356)
!1359 = !DILocation(line: 425, column: 20, scope: !1360)
!1360 = !DILexicalBlockFile(scope: !1361, file: !102, discriminator: 1)
!1361 = distinct !DILexicalBlock(scope: !1356, file: !102, line: 425, column: 2)
!1362 = !DILocation(line: 425, column: 23, scope: !1360)
!1363 = !DILocation(line: 425, column: 2, scope: !1360)
!1364 = !DILocation(line: 426, column: 7, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1366, file: !102, line: 426, column: 7)
!1366 = distinct !DILexicalBlock(scope: !1361, file: !102, line: 425, column: 49)
!1367 = !DILocation(line: 426, column: 11, scope: !1365)
!1368 = !DILocation(line: 426, column: 21, scope: !1365)
!1369 = !DILocation(line: 426, column: 7, scope: !1366)
!1370 = !DILocation(line: 427, column: 12, scope: !1365)
!1371 = !DILocation(line: 427, column: 4, scope: !1365)
!1372 = !DILocation(line: 428, column: 12, scope: !1373)
!1373 = distinct !DILexicalBlock(scope: !1365, file: !102, line: 428, column: 12)
!1374 = !DILocation(line: 428, column: 16, scope: !1373)
!1375 = !DILocation(line: 428, column: 26, scope: !1373)
!1376 = !DILocation(line: 428, column: 12, scope: !1365)
!1377 = !DILocation(line: 429, column: 12, scope: !1373)
!1378 = !DILocation(line: 429, column: 4, scope: !1373)
!1379 = !DILocation(line: 430, column: 2, scope: !1366)
!1380 = !DILocation(line: 425, column: 36, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1361, file: !102, discriminator: 2)
!1382 = !DILocation(line: 425, column: 40, scope: !1381)
!1383 = !DILocation(line: 425, column: 34, scope: !1381)
!1384 = !DILocation(line: 425, column: 2, scope: !1381)
!1385 = distinct !{!1385, !1386}
!1386 = !DILocation(line: 425, column: 2, scope: !1280)
!1387 = !DILocation(line: 432, column: 6, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1280, file: !102, line: 432, column: 6)
!1389 = !DILocation(line: 432, column: 15, scope: !1388)
