; ModuleID = './line318-fe-netjoin.o.i'
source_filename = "./line318-fe-netjoin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!137 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!138 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!139 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!140 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!141 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!142 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!143 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!144 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !{!193, !200, !201, !205, !207, !516, !837, !841, !846, !378, !850, !857, !333, !861, !868, !215, !875}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !194, line: 9, baseType: !195)
!194 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !198, !198, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!204 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !209, line: 6, baseType: !210)
!209 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !211, line: 42, size: 39168, align: 64, elements: !212)
!211 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!212 = !{!213, !216, !217, !218, !461, !466, !467, !468, !469, !470, !471, !472, !473, !474, !478, !479, !483, !484, !485, !489, !494, !495, !496, !497, !498, !499, !500, !501, !508, !509, !510, !511, !512, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !834, !836}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !214, line: 3, baseType: !215, size: 32, align: 32)
!214 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!215 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !210, file: !214, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !210, file: !214, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !210, file: !214, line: 8, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !209, line: 5, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !211, line: 24, size: 2496, align: 64, elements: !222)
!222 = !{!223, !225, !226, !227, !229, !230, !231, !232, !233, !235, !236, !237, !238, !239, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !224, line: 3, baseType: !215, size: 32, align: 32)
!224 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !221, file: !224, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !221, file: !224, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !221, file: !224, line: 9, baseType: !228, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !221, file: !224, line: 10, baseType: !215, size: 32, align: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !221, file: !224, line: 13, baseType: !234, size: 16, align: 16, offset: 448)
!234 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !221, file: !224, line: 14, baseType: !228, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !221, file: !224, line: 15, baseType: !228, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !221, file: !224, line: 16, baseType: !215, size: 32, align: 32, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !221, file: !224, line: 17, baseType: !228, size: 64, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !221, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !242, line: 99, baseType: !243)
!242 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !242, line: 99, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !221, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !221, file: !224, line: 21, baseType: !228, size: 64, align: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !221, file: !224, line: 22, baseType: !228, size: 64, align: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !221, file: !224, line: 23, baseType: !228, size: 64, align: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !221, file: !224, line: 24, baseType: !228, size: 64, align: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !221, file: !224, line: 26, baseType: !228, size: 64, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !221, file: !224, line: 27, baseType: !228, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !221, file: !224, line: 28, baseType: !228, size: 64, align: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !221, file: !224, line: 29, baseType: !228, size: 64, align: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !221, file: !224, line: 30, baseType: !228, size: 64, align: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !221, file: !224, line: 31, baseType: !228, size: 64, align: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !221, file: !224, line: 32, baseType: !228, size: 64, align: 64, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !221, file: !224, line: 33, baseType: !228, size: 64, align: 64, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !221, file: !224, line: 35, baseType: !258, size: 64, align: 64, offset: 1664)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !261)
!261 = !{!262, !264, !406, !407, !412, !413, !414, !415, !416, !425, !426, !427, !431, !432, !433, !434, !435, !436, !437, !438}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !260, file: !4, line: 100, baseType: !263, size: 32, align: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !203, line: 49, baseType: !215)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !260, file: !4, line: 101, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !268)
!268 = !{!269, !291, !297, !304, !308, !393, !397, !402}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !267, file: !4, line: 133, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !258, !201, !274, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !275, line: 66, baseType: !276)
!275 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!276 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !281, line: 42, baseType: !282)
!281 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !281, line: 44, size: 128, align: 64, elements: !283)
!283 = !{!284, !289, !290}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !282, file: !281, line: 46, baseType: !285, size: 32, align: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !286, line: 36, baseType: !287)
!286 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !275, line: 45, baseType: !288)
!288 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !282, file: !281, line: 47, baseType: !263, size: 32, align: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !282, file: !281, line: 48, baseType: !201, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !267, file: !4, line: 138, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!273, !258, !295, !274, !277, !278}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !267, file: !4, line: 143, baseType: !298, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!273, !258, !301, !303, !278}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !275, line: 51, baseType: !302)
!302 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !267, file: !4, line: 147, baseType: !305, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!273, !258, !278}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !267, file: !4, line: 149, baseType: !309, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !258, !392}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !315)
!315 = !{!316, !318, !339, !368, !370, !374, !375, !376, !377, !385, !386, !387, !388}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !314, file: !16, line: 174, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !203, line: 77, baseType: !200)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !314, file: !16, line: 175, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !322)
!322 = !{!323, !327, !328}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !321, file: !16, line: 198, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !317}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !321, file: !16, line: 199, baseType: !324, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !321, file: !16, line: 200, baseType: !329, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !317, !312, !332, !338}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !317}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !203, line: 50, baseType: !263)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !314, file: !16, line: 177, baseType: !340, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !344)
!344 = !{!345, !350, !354, !358, !362, !363}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !343, file: !16, line: 216, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!337, !312, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !343, file: !16, line: 218, baseType: !351, size: 64, align: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!337, !312}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !343, file: !16, line: 219, baseType: !355, size: 64, align: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!337, !312, !333, !317}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !343, file: !16, line: 222, baseType: !359, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !312}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !343, file: !16, line: 226, baseType: !333, size: 64, align: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !343, file: !16, line: 227, baseType: !364, size: 64, align: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !314, file: !16, line: 178, baseType: !369, size: 32, align: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !203, line: 55, baseType: !288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !314, file: !16, line: 180, baseType: !371, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !314, file: !16, line: 182, baseType: !263, size: 32, align: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !16, line: 183, baseType: !369, size: 32, align: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !314, file: !16, line: 184, baseType: !369, size: 32, align: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !314, file: !16, line: 186, baseType: !378, size: 64, align: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !380, line: 37, baseType: !381)
!380 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !380, line: 39, size: 128, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !381, file: !380, line: 41, baseType: !317, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !380, line: 42, baseType: !378, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !314, file: !16, line: 188, baseType: !312, size: 64, align: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !16, line: 189, baseType: !312, size: 64, align: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !16, line: 191, baseType: !228, size: 64, align: 64, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !314, file: !16, line: 193, baseType: !389, size: 64, align: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !267, file: !4, line: 151, baseType: !394, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !258}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !267, file: !4, line: 152, baseType: !398, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!273, !258, !401, !278}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !267, file: !4, line: 155, baseType: !403, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!401, !258}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !260, file: !4, line: 103, baseType: !201, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !260, file: !4, line: 104, baseType: !408, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !409, line: 77, baseType: !410)
!409 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !409, line: 77, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !260, file: !4, line: 105, baseType: !408, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !260, file: !4, line: 106, baseType: !201, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !260, file: !4, line: 107, baseType: !369, size: 32, align: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !260, file: !4, line: 109, baseType: !274, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !260, file: !4, line: 110, baseType: !417, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !419, line: 39, baseType: !420)
!419 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !419, line: 41, size: 192, align: 64, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !420, file: !419, line: 43, baseType: !201, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !420, file: !419, line: 44, baseType: !274, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !420, file: !419, line: 45, baseType: !274, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !260, file: !4, line: 111, baseType: !417, size: 64, align: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !260, file: !4, line: 112, baseType: !417, size: 64, align: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !260, file: !4, line: 113, baseType: !428, size: 48, align: 8, offset: 704)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 48, align: 8, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 6)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !260, file: !4, line: 117, baseType: !369, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !260, file: !4, line: 118, baseType: !369, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !260, file: !4, line: 119, baseType: !369, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !260, file: !4, line: 120, baseType: !369, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !260, file: !4, line: 121, baseType: !369, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !260, file: !4, line: 122, baseType: !369, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !260, file: !4, line: 124, baseType: !317, size: 64, align: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !260, file: !4, line: 125, baseType: !317, size: 64, align: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !221, file: !224, line: 38, baseType: !288, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !221, file: !224, line: 39, baseType: !288, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !221, file: !224, line: 40, baseType: !288, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !221, file: !224, line: 41, baseType: !288, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !221, file: !224, line: 42, baseType: !288, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !221, file: !224, line: 43, baseType: !288, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !221, file: !224, line: 44, baseType: !288, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !221, file: !224, line: 45, baseType: !288, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !221, file: !224, line: 46, baseType: !228, size: 64, align: 64, offset: 1792)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !221, file: !224, line: 47, baseType: !228, size: 64, align: 64, offset: 1856)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !221, file: !211, line: 27, baseType: !228, size: 64, align: 64, offset: 1920)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !221, file: !211, line: 28, baseType: !228, size: 64, align: 64, offset: 1984)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !221, file: !211, line: 30, baseType: !215, size: 32, align: 32, offset: 2048)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !221, file: !211, line: 31, baseType: !228, size: 64, align: 64, offset: 2112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !221, file: !211, line: 32, baseType: !228, size: 64, align: 64, offset: 2176)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !221, file: !211, line: 34, baseType: !215, size: 32, align: 32, offset: 2240)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !221, file: !211, line: 35, baseType: !215, size: 32, align: 32, offset: 2272)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !221, file: !211, line: 36, baseType: !215, size: 32, align: 32, offset: 2304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !221, file: !211, line: 38, baseType: !215, size: 32, align: 32, offset: 2336)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !221, file: !211, line: 38, baseType: !215, size: 32, align: 32, offset: 2368)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !221, file: !211, line: 38, baseType: !215, size: 32, align: 32, offset: 2400)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !221, file: !211, line: 38, baseType: !215, size: 32, align: 32, offset: 2432)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !210, file: !214, line: 9, baseType: !462, size: 64, align: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !463, line: 75, baseType: !464)
!463 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !465, line: 139, baseType: !302)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!466 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !210, file: !214, line: 10, baseType: !462, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !210, file: !214, line: 12, baseType: !228, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !210, file: !214, line: 13, baseType: !228, size: 64, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !210, file: !214, line: 15, baseType: !288, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !210, file: !214, line: 16, baseType: !288, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !210, file: !214, line: 17, baseType: !288, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !210, file: !214, line: 18, baseType: !288, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !210, file: !214, line: 19, baseType: !288, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !210, file: !214, line: 21, baseType: !475, size: 64, align: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !242, line: 102, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !242, line: 102, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !210, file: !214, line: 22, baseType: !215, size: 32, align: 32, offset: 576)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !210, file: !214, line: 25, baseType: !480, size: 128, align: 64, offset: 640)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 128, align: 64, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 2)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !210, file: !214, line: 26, baseType: !215, size: 32, align: 32, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !210, file: !214, line: 27, baseType: !215, size: 32, align: 32, offset: 800)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !210, file: !214, line: 29, baseType: !486, size: 64, align: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !242, line: 103, baseType: !488)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !242, line: 103, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !210, file: !214, line: 30, baseType: !490, size: 64, align: 64, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !492, line: 37, baseType: !493)
!492 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !492, line: 37, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !210, file: !214, line: 32, baseType: !228, size: 64, align: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !210, file: !214, line: 33, baseType: !228, size: 64, align: 64, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !210, file: !214, line: 34, baseType: !228, size: 64, align: 64, offset: 1088)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !210, file: !214, line: 35, baseType: !288, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !210, file: !214, line: 36, baseType: !288, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !210, file: !214, line: 37, baseType: !288, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !210, file: !214, line: 38, baseType: !288, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !210, file: !214, line: 40, baseType: !502, size: 128, align: 64, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !203, line: 504, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !203, line: 506, size: 128, align: 64, elements: !504)
!504 = !{!505, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !503, file: !203, line: 508, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !203, line: 48, baseType: !302)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !503, file: !203, line: 509, baseType: !506, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !210, file: !214, line: 41, baseType: !462, size: 64, align: 64, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !210, file: !214, line: 42, baseType: !215, size: 32, align: 32, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !210, file: !214, line: 44, baseType: !378, size: 64, align: 64, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !210, file: !214, line: 45, baseType: !378, size: 64, align: 64, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !210, file: !214, line: 53, baseType: !513, size: 64, align: 64, offset: 1600)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516, !205, !215}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !242, line: 107, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !519, line: 30, size: 2240, align: 64, elements: !520)
!519 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = !{!521, !522, !523, !524, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !600, !604, !608, !612, !617, !710, !717, !721}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !214, line: 3, baseType: !215, size: 32, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !518, file: !214, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !518, file: !214, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !518, file: !214, line: 8, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !242, line: 113, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !519, line: 25, size: 1920, align: 64, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !224, line: 3, baseType: !215, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !527, file: !224, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !224, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !527, file: !224, line: 9, baseType: !228, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !527, file: !224, line: 10, baseType: !215, size: 32, align: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !527, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !527, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !527, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !527, file: !224, line: 13, baseType: !234, size: 16, align: 16, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !527, file: !224, line: 14, baseType: !228, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !527, file: !224, line: 15, baseType: !228, size: 64, align: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !527, file: !224, line: 16, baseType: !215, size: 32, align: 32, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !527, file: !224, line: 17, baseType: !228, size: 64, align: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !527, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !527, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !527, file: !224, line: 21, baseType: !228, size: 64, align: 64, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !527, file: !224, line: 22, baseType: !228, size: 64, align: 64, offset: 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !527, file: !224, line: 23, baseType: !228, size: 64, align: 64, offset: 1024)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !527, file: !224, line: 24, baseType: !228, size: 64, align: 64, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !527, file: !224, line: 26, baseType: !228, size: 64, align: 64, offset: 1152)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !527, file: !224, line: 27, baseType: !228, size: 64, align: 64, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !527, file: !224, line: 28, baseType: !228, size: 64, align: 64, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !527, file: !224, line: 29, baseType: !228, size: 64, align: 64, offset: 1344)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !527, file: !224, line: 30, baseType: !228, size: 64, align: 64, offset: 1408)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !527, file: !224, line: 31, baseType: !228, size: 64, align: 64, offset: 1472)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !527, file: !224, line: 32, baseType: !228, size: 64, align: 64, offset: 1536)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !527, file: !224, line: 33, baseType: !228, size: 64, align: 64, offset: 1600)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !527, file: !224, line: 35, baseType: !258, size: 64, align: 64, offset: 1664)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !527, file: !224, line: 38, baseType: !288, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !527, file: !224, line: 39, baseType: !288, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !527, file: !224, line: 40, baseType: !288, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !527, file: !224, line: 41, baseType: !288, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !527, file: !224, line: 42, baseType: !288, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !527, file: !224, line: 43, baseType: !288, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !527, file: !224, line: 44, baseType: !288, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !527, file: !224, line: 45, baseType: !288, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !527, file: !224, line: 46, baseType: !228, size: 64, align: 64, offset: 1792)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !527, file: !224, line: 47, baseType: !228, size: 64, align: 64, offset: 1856)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !518, file: !214, line: 9, baseType: !462, size: 64, align: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !518, file: !214, line: 10, baseType: !462, size: 64, align: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !518, file: !214, line: 12, baseType: !228, size: 64, align: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !518, file: !214, line: 13, baseType: !228, size: 64, align: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !518, file: !214, line: 15, baseType: !288, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !518, file: !214, line: 16, baseType: !288, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !518, file: !214, line: 17, baseType: !288, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !518, file: !214, line: 18, baseType: !288, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !518, file: !214, line: 19, baseType: !288, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !518, file: !214, line: 21, baseType: !475, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !518, file: !214, line: 22, baseType: !215, size: 32, align: 32, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !518, file: !214, line: 25, baseType: !480, size: 128, align: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !518, file: !214, line: 26, baseType: !215, size: 32, align: 32, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !518, file: !214, line: 27, baseType: !215, size: 32, align: 32, offset: 800)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !518, file: !214, line: 29, baseType: !486, size: 64, align: 64, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !518, file: !214, line: 30, baseType: !490, size: 64, align: 64, offset: 896)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !518, file: !214, line: 32, baseType: !228, size: 64, align: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !518, file: !214, line: 33, baseType: !228, size: 64, align: 64, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !518, file: !214, line: 34, baseType: !228, size: 64, align: 64, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !518, file: !214, line: 35, baseType: !288, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !518, file: !214, line: 36, baseType: !288, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !518, file: !214, line: 37, baseType: !288, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !518, file: !214, line: 38, baseType: !288, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !518, file: !214, line: 40, baseType: !502, size: 128, align: 64, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !518, file: !214, line: 41, baseType: !462, size: 64, align: 64, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !518, file: !214, line: 42, baseType: !215, size: 32, align: 32, offset: 1408)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !518, file: !214, line: 44, baseType: !378, size: 64, align: 64, offset: 1472)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !518, file: !214, line: 45, baseType: !378, size: 64, align: 64, offset: 1536)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !518, file: !214, line: 53, baseType: !513, size: 64, align: 64, offset: 1600)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !518, file: !214, line: 55, baseType: !597, size: 64, align: 64, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!215, !516, !204}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !518, file: !214, line: 57, baseType: !601, size: 64, align: 64, offset: 1728)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!215, !516, !205}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !518, file: !214, line: 60, baseType: !605, size: 64, align: 64, offset: 1792)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!205, !516}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !518, file: !214, line: 62, baseType: !609, size: 64, align: 64, offset: 1856)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !516, !205, !205, !215}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !518, file: !214, line: 65, baseType: !613, size: 64, align: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!616, !516, !205, !205}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !518, file: !214, line: 69, baseType: !618, size: 64, align: 64, offset: 1984)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !516, !205}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !242, line: 109, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !624, line: 15, size: 1408, align: 64, elements: !625)
!624 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!625 = !{!626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !661, !662, !664, !665, !666, !667, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !627, line: 3, baseType: !215, size: 32, align: 32)
!627 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !623, file: !627, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !623, file: !627, line: 5, baseType: !490, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !623, file: !627, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !623, file: !627, line: 8, baseType: !516, size: 64, align: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !623, file: !627, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !627, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !623, file: !627, line: 11, baseType: !462, size: 64, align: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !623, file: !627, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !623, file: !627, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !623, file: !627, line: 15, baseType: !638, size: 64, align: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !242, line: 108, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !644, line: 5, size: 704, align: 64, elements: !645)
!644 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !627, line: 3, baseType: !215, size: 32, align: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !643, file: !627, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !643, file: !627, line: 5, baseType: !490, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !643, file: !627, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !643, file: !627, line: 8, baseType: !516, size: 64, align: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !643, file: !627, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !627, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !643, file: !627, line: 11, baseType: !462, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !643, file: !627, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !643, file: !627, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !643, file: !627, line: 15, baseType: !638, size: 64, align: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !643, file: !627, line: 17, baseType: !658, size: 64, align: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!205, !641}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !623, file: !627, line: 17, baseType: !658, size: 64, align: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !623, file: !663, line: 5, baseType: !228, size: 64, align: 64, offset: 704)
!663 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!664 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !623, file: !663, line: 6, baseType: !228, size: 64, align: 64, offset: 768)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !623, file: !663, line: 7, baseType: !462, size: 64, align: 64, offset: 832)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !623, file: !663, line: 9, baseType: !490, size: 64, align: 64, offset: 896)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !623, file: !663, line: 10, baseType: !668, size: 64, align: 64, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !242, line: 111, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !671, line: 13, size: 576, align: 64, elements: !672)
!671 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!672 = !{!673, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !691, !692}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !674, line: 3, baseType: !215, size: 32, align: 32)
!674 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !670, file: !674, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !670, file: !674, line: 6, baseType: !462, size: 64, align: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !670, file: !674, line: 8, baseType: !228, size: 64, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !670, file: !674, line: 9, baseType: !228, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !670, file: !674, line: 10, baseType: !228, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !670, file: !674, line: 11, baseType: !215, size: 32, align: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !670, file: !674, line: 14, baseType: !288, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !670, file: !674, line: 15, baseType: !288, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !670, file: !674, line: 18, baseType: !288, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !670, file: !674, line: 19, baseType: !288, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !670, file: !674, line: 20, baseType: !288, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !670, file: !674, line: 21, baseType: !288, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !670, file: !674, line: 22, baseType: !688, size: 64, align: 8, offset: 360)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, align: 8, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !670, file: !674, line: 26, baseType: !200, size: 64, align: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !674, line: 28, baseType: !668, size: 64, align: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !623, file: !663, line: 12, baseType: !288, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !623, file: !663, line: 13, baseType: !228, size: 64, align: 64, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !623, file: !663, line: 14, baseType: !215, size: 32, align: 32, offset: 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !623, file: !663, line: 15, baseType: !228, size: 64, align: 64, offset: 1216)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !623, file: !663, line: 17, baseType: !288, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !623, file: !663, line: 18, baseType: !288, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !623, file: !663, line: 19, baseType: !288, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !623, file: !663, line: 20, baseType: !288, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !623, file: !663, line: 22, baseType: !288, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !623, file: !663, line: 23, baseType: !288, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !623, file: !663, line: 24, baseType: !288, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !623, file: !663, line: 25, baseType: !288, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !623, file: !663, line: 26, baseType: !288, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !623, file: !663, line: 31, baseType: !707, size: 64, align: 64, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!228, !621}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !518, file: !214, line: 70, baseType: !711, size: 64, align: 64, offset: 2048)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!714, !516, !205}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !242, line: 110, baseType: !716)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !242, line: 110, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !518, file: !214, line: 71, baseType: !718, size: 64, align: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!215, !205, !205}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !518, file: !214, line: 73, baseType: !718, size: 64, align: 64, offset: 2176)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !210, file: !214, line: 55, baseType: !597, size: 64, align: 64, offset: 1664)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !210, file: !214, line: 57, baseType: !601, size: 64, align: 64, offset: 1728)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !210, file: !214, line: 60, baseType: !605, size: 64, align: 64, offset: 1792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !210, file: !214, line: 62, baseType: !609, size: 64, align: 64, offset: 1856)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !210, file: !214, line: 65, baseType: !613, size: 64, align: 64, offset: 1920)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !210, file: !214, line: 69, baseType: !618, size: 64, align: 64, offset: 1984)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !210, file: !214, line: 70, baseType: !711, size: 64, align: 64, offset: 2048)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !210, file: !214, line: 71, baseType: !718, size: 64, align: 64, offset: 2112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !210, file: !214, line: 73, baseType: !718, size: 64, align: 64, offset: 2176)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !210, file: !211, line: 46, baseType: !378, size: 64, align: 64, offset: 2240)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !210, file: !211, line: 47, baseType: !378, size: 64, align: 64, offset: 2304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !210, file: !211, line: 48, baseType: !734, size: 64, align: 64, offset: 2368)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !209, line: 8, baseType: !736)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !209, line: 8, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !210, file: !211, line: 49, baseType: !378, size: 64, align: 64, offset: 2432)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !210, file: !211, line: 51, baseType: !228, size: 64, align: 64, offset: 2496)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !210, file: !211, line: 53, baseType: !228, size: 64, align: 64, offset: 2560)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !210, file: !211, line: 54, baseType: !228, size: 64, align: 64, offset: 2624)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !210, file: !211, line: 55, baseType: !228, size: 64, align: 64, offset: 2688)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !210, file: !211, line: 56, baseType: !228, size: 64, align: 64, offset: 2752)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !210, file: !211, line: 57, baseType: !215, size: 32, align: 32, offset: 2816)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !210, file: !211, line: 59, baseType: !288, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !210, file: !211, line: 60, baseType: !288, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !210, file: !211, line: 62, baseType: !288, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !210, file: !211, line: 63, baseType: !288, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !210, file: !211, line: 64, baseType: !288, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !210, file: !211, line: 65, baseType: !288, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !210, file: !211, line: 66, baseType: !288, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !210, file: !211, line: 67, baseType: !288, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !210, file: !211, line: 68, baseType: !288, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !210, file: !211, line: 69, baseType: !288, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !210, file: !211, line: 70, baseType: !288, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !210, file: !211, line: 71, baseType: !288, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !210, file: !211, line: 72, baseType: !288, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !210, file: !211, line: 74, baseType: !215, size: 32, align: 32, offset: 2880)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !210, file: !211, line: 75, baseType: !215, size: 32, align: 32, offset: 2912)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !210, file: !211, line: 76, baseType: !215, size: 32, align: 32, offset: 2944)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !210, file: !211, line: 77, baseType: !215, size: 32, align: 32, offset: 2976)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !210, file: !211, line: 79, baseType: !490, size: 64, align: 64, offset: 3008)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !210, file: !211, line: 80, baseType: !378, size: 64, align: 64, offset: 3072)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !210, file: !211, line: 81, baseType: !378, size: 64, align: 64, offset: 3136)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !210, file: !211, line: 83, baseType: !417, size: 64, align: 64, offset: 3200)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !210, file: !211, line: 84, baseType: !369, size: 32, align: 32, offset: 3264)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !210, file: !211, line: 87, baseType: !215, size: 32, align: 32, offset: 3296)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !210, file: !211, line: 91, baseType: !378, size: 64, align: 64, offset: 3328)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !210, file: !211, line: 92, baseType: !502, size: 128, align: 64, offset: 3392)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !210, file: !211, line: 93, baseType: !502, size: 128, align: 64, offset: 3520)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !210, file: !211, line: 95, baseType: !215, size: 32, align: 32, offset: 3648)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !210, file: !211, line: 96, baseType: !215, size: 32, align: 32, offset: 3680)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !210, file: !211, line: 97, baseType: !215, size: 32, align: 32, offset: 3712)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !210, file: !211, line: 100, baseType: !378, size: 64, align: 64, offset: 3776)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !210, file: !211, line: 103, baseType: !378, size: 64, align: 64, offset: 3840)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !210, file: !211, line: 106, baseType: !378, size: 64, align: 64, offset: 3904)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !210, file: !211, line: 108, baseType: !490, size: 64, align: 64, offset: 3968)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !210, file: !211, line: 109, baseType: !378, size: 64, align: 64, offset: 4032)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !210, file: !211, line: 111, baseType: !378, size: 64, align: 64, offset: 4096)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !210, file: !211, line: 114, baseType: !200, size: 64, align: 64, offset: 4160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !210, file: !211, line: 116, baseType: !490, size: 64, align: 64, offset: 4224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !210, file: !211, line: 117, baseType: !782, size: 32768, align: 64, offset: 4288)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 32768, align: 64, elements: !832)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !784, line: 10, size: 128, align: 64, elements: !785)
!784 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!785 = !{!786, !831}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !783, file: !784, line: 11, baseType: !787, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !784, line: 7, baseType: !789)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !791, !205, !204, !204, !228, !417}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !209, line: 7, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !794, line: 15, size: 1600, align: 64, elements: !795)
!794 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !793, file: !627, line: 3, baseType: !215, size: 32, align: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !793, file: !627, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !793, file: !627, line: 5, baseType: !490, size: 64, align: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !793, file: !627, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !793, file: !627, line: 8, baseType: !207, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !793, file: !627, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !627, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !793, file: !627, line: 11, baseType: !462, size: 64, align: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !793, file: !627, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !793, file: !627, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !793, file: !627, line: 15, baseType: !638, size: 64, align: 64, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !793, file: !627, line: 17, baseType: !658, size: 64, align: 64, offset: 640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !793, file: !663, line: 5, baseType: !228, size: 64, align: 64, offset: 704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !793, file: !663, line: 6, baseType: !228, size: 64, align: 64, offset: 768)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !793, file: !663, line: 7, baseType: !462, size: 64, align: 64, offset: 832)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !793, file: !663, line: 9, baseType: !490, size: 64, align: 64, offset: 896)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !793, file: !663, line: 10, baseType: !668, size: 64, align: 64, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !793, file: !663, line: 12, baseType: !288, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !793, file: !663, line: 13, baseType: !228, size: 64, align: 64, offset: 1088)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !793, file: !663, line: 14, baseType: !215, size: 32, align: 32, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !793, file: !663, line: 15, baseType: !228, size: 64, align: 64, offset: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !793, file: !663, line: 17, baseType: !288, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !793, file: !663, line: 18, baseType: !288, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !793, file: !663, line: 19, baseType: !288, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !793, file: !663, line: 20, baseType: !288, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !793, file: !663, line: 22, baseType: !288, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !793, file: !663, line: 23, baseType: !288, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !793, file: !663, line: 24, baseType: !288, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !793, file: !663, line: 25, baseType: !288, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !793, file: !663, line: 26, baseType: !288, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !793, file: !663, line: 31, baseType: !707, size: 64, align: 64, offset: 1344)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !793, file: !794, line: 18, baseType: !378, size: 64, align: 64, offset: 1408)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !793, file: !794, line: 20, baseType: !462, size: 64, align: 64, offset: 1472)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !793, file: !794, line: 21, baseType: !215, size: 32, align: 32, offset: 1536)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !793, file: !794, line: 22, baseType: !215, size: 32, align: 32, offset: 1568)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !783, file: !784, line: 12, baseType: !204, size: 8, align: 8, offset: 64)
!832 = !{!833}
!833 = !DISubrange(count: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !210, file: !211, line: 118, baseType: !835, size: 2048, align: 8, offset: 37056)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 2048, align: 8, elements: !832)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !210, file: !211, line: 120, baseType: !718, size: 64, align: 64, offset: 39104)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !203, line: 88, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, align: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !317, !317}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !203, line: 90, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!369, !845}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !203, line: 78, baseType: !198)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !203, line: 80, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!263, !845, !845}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEMP_PRINT_REC", file: !852, line: 54, baseType: !853)
!852 = !DIFile(filename: "fe-netjoin.c", directory: "/home/lichi/Desktop/irssi/task1")
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 51, size: 128, align: 64, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !853, file: !852, line: 52, baseType: !215, size: 32, align: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !853, file: !852, line: 53, baseType: !417, size: 64, align: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !203, line: 91, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{null, !317, !317, !317}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETJOIN_REC", file: !852, line: 42, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 38, size: 192, align: 64, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !863, file: !852, line: 39, baseType: !228, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "old_channels", scope: !863, file: !852, line: 40, baseType: !378, size: 64, align: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "now_channels", scope: !863, file: !852, line: 41, baseType: !378, size: 64, align: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETJOIN_SERVER_REC", file: !852, line: 49, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 44, size: 192, align: 64, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !870, file: !852, line: 45, baseType: !207, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "last_netjoin", scope: !870, file: !852, line: 46, baseType: !462, size: 64, align: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "netjoins", scope: !870, file: !852, line: 48, baseType: !378, size: 64, align: 64, offset: 128)
!875 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!876 = !{!877, !878, !879, !880, !881}
!877 = distinct !DIGlobalVariable(name: "join_tag", scope: !0, file: !852, line: 56, type: !215, isLocal: true, isDefinition: true, variable: i32* @join_tag)
!878 = distinct !DIGlobalVariable(name: "printing_joins", scope: !0, file: !852, line: 58, type: !215, isLocal: true, isDefinition: true, variable: i32* @printing_joins)
!879 = distinct !DIGlobalVariable(name: "joinservers", scope: !0, file: !852, line: 59, type: !378, isLocal: true, isDefinition: true, variable: %struct._GSList** @joinservers)
!880 = distinct !DIGlobalVariable(name: "hide_netsplit_quits", scope: !0, file: !852, line: 57, type: !215, isLocal: true, isDefinition: true, variable: i32* @hide_netsplit_quits)
!881 = distinct !DIGlobalVariable(name: "netjoin_max_nicks", scope: !0, file: !852, line: 57, type: !215, isLocal: true, isDefinition: true, variable: i32* @netjoin_max_nicks)
!882 = !{i32 2, !"Dwarf Version", i32 4}
!883 = !{i32 2, !"Debug Info Version", i32 3}
!884 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!885 = distinct !DISubprogram(name: "fe_netjoin_init", scope: !852, file: !852, line: 489, type: !366, isLocal: false, isDefinition: true, scopeLine: 490, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!886 = !{}
!887 = !DILocation(line: 491, column: 2, scope: !885)
!888 = !DILocation(line: 492, column: 2, scope: !885)
!889 = !DILocation(line: 494, column: 11, scope: !885)
!890 = !DILocation(line: 495, column: 17, scope: !885)
!891 = !DILocation(line: 497, column: 2, scope: !885)
!892 = !DILocation(line: 498, column: 2, scope: !885)
!893 = !DILocation(line: 499, column: 2, scope: !885)
!894 = !DILocation(line: 500, column: 1, scope: !885)
!895 = distinct !DISubprogram(name: "read_settings", scope: !852, file: !852, line: 456, type: !366, isLocal: true, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!896 = !DILocalVariable(name: "old_hide", scope: !895, file: !852, line: 458, type: !215)
!897 = !DIExpression()
!898 = !DILocation(line: 458, column: 6, scope: !895)
!899 = !DILocation(line: 460, column: 20, scope: !895)
!900 = !DILocation(line: 460, column: 18, scope: !895)
!901 = !DILocation(line: 461, column: 24, scope: !895)
!902 = !DILocation(line: 461, column: 22, scope: !895)
!903 = !DILocation(line: 462, column: 22, scope: !895)
!904 = !DILocation(line: 462, column: 20, scope: !895)
!905 = !DILocation(line: 464, column: 6, scope: !906)
!906 = distinct !DILexicalBlock(scope: !895, file: !852, line: 464, column: 6)
!907 = !DILocation(line: 464, column: 15, scope: !906)
!908 = !DILocation(line: 464, column: 19, scope: !909)
!909 = !DILexicalBlockFile(scope: !906, file: !852, discriminator: 1)
!910 = !DILocation(line: 464, column: 6, scope: !909)
!911 = !DILocation(line: 465, column: 3, scope: !912)
!912 = distinct !DILexicalBlock(scope: !906, file: !852, line: 464, column: 40)
!913 = !DILocation(line: 466, column: 3, scope: !912)
!914 = !DILocation(line: 467, column: 3, scope: !912)
!915 = !DILocation(line: 468, column: 2, scope: !912)
!916 = !DILocation(line: 468, column: 14, scope: !917)
!917 = !DILexicalBlockFile(scope: !918, file: !852, discriminator: 1)
!918 = distinct !DILexicalBlock(scope: !906, file: !852, line: 468, column: 13)
!919 = !DILocation(line: 468, column: 23, scope: !917)
!920 = !DILocation(line: 468, column: 26, scope: !921)
!921 = !DILexicalBlockFile(scope: !918, file: !852, discriminator: 2)
!922 = !DILocation(line: 468, column: 13, scope: !921)
!923 = !DILocation(line: 469, column: 3, scope: !924)
!924 = distinct !DILexicalBlock(scope: !918, file: !852, line: 468, column: 47)
!925 = !DILocation(line: 470, column: 3, scope: !924)
!926 = !DILocation(line: 471, column: 3, scope: !924)
!927 = !DILocation(line: 472, column: 2, scope: !924)
!928 = !DILocation(line: 473, column: 1, scope: !895)
!929 = distinct !DISubprogram(name: "sig_server_disconnected", scope: !852, file: !852, line: 475, type: !930, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !207}
!932 = !DILocalVariable(name: "server", arg: 1, scope: !929, file: !852, line: 475, type: !207)
!933 = !DILocation(line: 475, column: 53, scope: !929)
!934 = !DILocalVariable(name: "netjoin_server", scope: !929, file: !852, line: 477, type: !868)
!935 = !DILocation(line: 477, column: 22, scope: !929)
!936 = !DILocation(line: 479, column: 2, scope: !929)
!937 = distinct !{!937, !936}
!938 = !DILocation(line: 479, column: 10, scope: !939)
!939 = !DILexicalBlockFile(scope: !940, file: !852, discriminator: 1)
!940 = distinct !DILexicalBlock(scope: !941, file: !852, line: 479, column: 10)
!941 = distinct !DILexicalBlock(scope: !929, file: !852, line: 479, column: 4)
!942 = !DILocation(line: 479, column: 17, scope: !939)
!943 = !DILocation(line: 479, column: 5, scope: !944)
!944 = !DILexicalBlockFile(scope: !945, file: !852, discriminator: 2)
!945 = distinct !DILexicalBlock(scope: !940, file: !852, line: 479, column: 3)
!946 = !DILocation(line: 479, column: 14, scope: !947)
!947 = !DILexicalBlockFile(scope: !948, file: !852, discriminator: 3)
!948 = distinct !DILexicalBlock(scope: !940, file: !852, line: 479, column: 12)
!949 = !DILocation(line: 479, column: 101, scope: !947)
!950 = !DILocation(line: 479, column: 112, scope: !951)
!951 = !DILexicalBlockFile(scope: !941, file: !852, discriminator: 4)
!952 = !DILocation(line: 481, column: 87, scope: !953)
!953 = distinct !DILexicalBlock(scope: !929, file: !852, line: 481, column: 6)
!954 = !DILocation(line: 481, column: 69, scope: !953)
!955 = !DILocation(line: 481, column: 54, scope: !953)
!956 = !DILocation(line: 481, column: 53, scope: !953)
!957 = !DILocation(line: 481, column: 28, scope: !958)
!958 = !DILexicalBlockFile(scope: !953, file: !852, discriminator: 3)
!959 = !DILocation(line: 481, column: 9, scope: !953)
!960 = !DILocation(line: 481, column: 6, scope: !929)
!961 = !DILocation(line: 481, column: 8, scope: !962)
!962 = !DILexicalBlockFile(scope: !953, file: !852, discriminator: 1)
!963 = !DILocation(line: 481, column: 6, scope: !964)
!964 = !DILexicalBlockFile(scope: !929, file: !852, discriminator: 2)
!965 = !DILocation(line: 482, column: 3, scope: !953)
!966 = !DILocation(line: 484, column: 44, scope: !967)
!967 = distinct !DILexicalBlock(scope: !929, file: !852, line: 484, column: 6)
!968 = !DILocation(line: 484, column: 24, scope: !967)
!969 = !DILocation(line: 484, column: 22, scope: !967)
!970 = !DILocation(line: 484, column: 6, scope: !929)
!971 = !DILocation(line: 485, column: 25, scope: !972)
!972 = distinct !DILexicalBlock(scope: !967, file: !852, line: 484, column: 54)
!973 = !DILocation(line: 485, column: 3, scope: !972)
!974 = !DILocation(line: 486, column: 2, scope: !972)
!975 = !DILocation(line: 487, column: 1, scope: !929)
!976 = distinct !DISubprogram(name: "fe_netjoin_deinit", scope: !852, file: !852, line: 502, type: !366, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!977 = !DILocation(line: 504, column: 2, scope: !976)
!978 = !DILocation(line: 504, column: 9, scope: !979)
!979 = !DILexicalBlockFile(scope: !976, file: !852, discriminator: 1)
!980 = !DILocation(line: 504, column: 21, scope: !979)
!981 = !DILocation(line: 504, column: 2, scope: !979)
!982 = !DILocation(line: 505, column: 25, scope: !976)
!983 = !DILocation(line: 505, column: 38, scope: !976)
!984 = !DILocation(line: 505, column: 3, scope: !976)
!985 = !DILocation(line: 504, column: 2, scope: !986)
!986 = !DILexicalBlockFile(scope: !976, file: !852, discriminator: 2)
!987 = distinct !{!987, !977}
!988 = !DILocation(line: 506, column: 6, scope: !989)
!989 = distinct !DILexicalBlock(scope: !976, file: !852, line: 506, column: 6)
!990 = !DILocation(line: 506, column: 15, scope: !989)
!991 = !DILocation(line: 506, column: 6, scope: !976)
!992 = !DILocation(line: 507, column: 19, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !852, line: 506, column: 22)
!994 = !DILocation(line: 507, column: 3, scope: !993)
!995 = !DILocation(line: 508, column: 3, scope: !993)
!996 = !DILocation(line: 509, column: 2, scope: !993)
!997 = !DILocation(line: 511, column: 2, scope: !976)
!998 = !DILocation(line: 512, column: 2, scope: !976)
!999 = !DILocation(line: 514, column: 2, scope: !976)
!1000 = !DILocation(line: 515, column: 2, scope: !976)
!1001 = !DILocation(line: 516, column: 2, scope: !976)
!1002 = !DILocation(line: 517, column: 1, scope: !976)
!1003 = distinct !DISubprogram(name: "netjoin_server_remove", scope: !852, file: !852, line: 142, type: !1004, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !868}
!1006 = !DILocalVariable(name: "server", arg: 1, scope: !1003, file: !852, line: 142, type: !868)
!1007 = !DILocation(line: 142, column: 55, scope: !1003)
!1008 = !DILocation(line: 144, column: 31, scope: !1003)
!1009 = !DILocation(line: 144, column: 44, scope: !1003)
!1010 = !DILocation(line: 144, column: 16, scope: !1003)
!1011 = !DILocation(line: 144, column: 14, scope: !1003)
!1012 = !DILocation(line: 146, column: 2, scope: !1003)
!1013 = !DILocation(line: 146, column: 9, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !1003, file: !852, discriminator: 1)
!1015 = !DILocation(line: 146, column: 17, scope: !1014)
!1016 = !DILocation(line: 146, column: 26, scope: !1014)
!1017 = !DILocation(line: 146, column: 2, scope: !1014)
!1018 = !DILocation(line: 147, column: 18, scope: !1003)
!1019 = !DILocation(line: 147, column: 26, scope: !1003)
!1020 = !DILocation(line: 147, column: 34, scope: !1003)
!1021 = !DILocation(line: 147, column: 44, scope: !1003)
!1022 = !DILocation(line: 147, column: 3, scope: !1003)
!1023 = !DILocation(line: 146, column: 2, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1003, file: !852, discriminator: 2)
!1025 = distinct !{!1025, !1012}
!1026 = !DILocation(line: 148, column: 16, scope: !1003)
!1027 = !DILocation(line: 148, column: 9, scope: !1003)
!1028 = !DILocation(line: 149, column: 1, scope: !1003)
!1029 = distinct !DISubprogram(name: "sig_print_starting", scope: !852, file: !852, line: 246, type: !1030, isLocal: true, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !886)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1032}
