; ModuleID = './line75-servers.o.i'
source_filename = "./line75-servers.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !68, globals: !539)
!1 = !DIFile(filename: "line75-servers.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 25, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!51 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!52 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!53 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!54 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!55 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!56 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!57 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!58 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!59 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!60 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!61 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!62 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!63 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!64 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!65 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!66 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!67 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!68 = !{!69, !165, !416, !210, !528, !81, !103, !209, !406, !532, !77}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !71, line: 107, baseType: !72)
!71 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !73, line: 30, size: 2240, align: 64, elements: !74)
!73 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !{!75, !78, !79, !80, !342, !347, !348, !349, !350, !351, !352, !353, !354, !355, !372, !373, !377, !378, !379, !389, !394, !395, !396, !397, !398, !399, !400, !401, !408, !409, !410, !411, !412, !418, !422, !426, !430, !434, !439, !496, !523, !527}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !76, line: 3, baseType: !77, size: 32, align: 32)
!76 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !72, file: !76, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !72, file: !76, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !72, file: !76, line: 8, baseType: !81, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !71, line: 113, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !73, line: 25, size: 1920, align: 64, elements: !84)
!84 = !{!85, !87, !88, !89, !92, !93, !94, !95, !96, !98, !99, !100, !101, !102, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !86, line: 3, baseType: !77, size: 32, align: 32)
!86 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !83, file: !86, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !83, file: !86, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !83, file: !86, line: 9, baseType: !90, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !83, file: !86, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !83, file: !86, line: 11, baseType: !90, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !83, file: !86, line: 11, baseType: !90, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !83, file: !86, line: 11, baseType: !90, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !83, file: !86, line: 13, baseType: !97, size: 16, align: 16, offset: 448)
!97 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !83, file: !86, line: 14, baseType: !90, size: 64, align: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !83, file: !86, line: 15, baseType: !90, size: 64, align: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !83, file: !86, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !83, file: !86, line: 17, baseType: !90, size: 64, align: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !83, file: !86, line: 19, baseType: !103, size: 64, align: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !71, line: 99, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !106, line: 22, size: 160, align: 32, elements: !107)
!106 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !105, file: !106, line: 23, baseType: !97, size: 16, align: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !105, file: !106, line: 24, baseType: !110, size: 128, align: 32, offset: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !111, line: 211, size: 128, align: 32, elements: !112)
!111 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !110, file: !111, line: 220, baseType: !114, size: 128, align: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !111, line: 213, size: 128, align: 32, elements: !115)
!115 = !{!116, !123, !128}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !114, file: !111, line: 215, baseType: !117, size: 128, align: 8)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 128, align: 8, elements: !121)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !119, line: 48, baseType: !120)
!119 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!121 = !{!122}
!122 = !DISubrange(count: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !114, file: !111, line: 217, baseType: !124, size: 128, align: 16)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, align: 16, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !119, line: 49, baseType: !97)
!126 = !{!127}
!127 = !DISubrange(count: 8)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !114, file: !111, line: 218, baseType: !129, size: 128, align: 32)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 32, elements: !132)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !119, line: 51, baseType: !131)
!131 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!132 = !{!133}
!133 = !DISubrange(count: 4)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !83, file: !86, line: 19, baseType: !103, size: 64, align: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !83, file: !86, line: 21, baseType: !90, size: 64, align: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !83, file: !86, line: 22, baseType: !90, size: 64, align: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !83, file: !86, line: 23, baseType: !90, size: 64, align: 64, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !83, file: !86, line: 24, baseType: !90, size: 64, align: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !83, file: !86, line: 26, baseType: !90, size: 64, align: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !83, file: !86, line: 27, baseType: !90, size: 64, align: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !83, file: !86, line: 28, baseType: !90, size: 64, align: 64, offset: 1280)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !83, file: !86, line: 29, baseType: !90, size: 64, align: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !83, file: !86, line: 30, baseType: !90, size: 64, align: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !83, file: !86, line: 31, baseType: !90, size: 64, align: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !83, file: !86, line: 32, baseType: !90, size: 64, align: 64, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !83, file: !86, line: 33, baseType: !90, size: 64, align: 64, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !83, file: !86, line: 35, baseType: !148, size: 64, align: 64, offset: 1664)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !151)
!151 = !{!152, !155, !299, !300, !305, !306, !307, !308, !309, !318, !319, !320, !324, !325, !326, !327, !328, !329, !330, !331}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !150, file: !4, line: 100, baseType: !153, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !154, line: 49, baseType: !77)
!154 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !150, file: !4, line: 101, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !159)
!159 = !{!160, !183, !189, !196, !200, !286, !290, !295}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !158, file: !4, line: 133, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !148, !165, !167, !170, !171}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !154, line: 46, baseType: !91)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !168, line: 66, baseType: !169)
!168 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!169 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !174, line: 42, baseType: !175)
!174 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !174, line: 44, size: 128, align: 64, elements: !176)
!176 = !{!177, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !175, file: !174, line: 46, baseType: !178, size: 32, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !179, line: 36, baseType: !180)
!179 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !168, line: 45, baseType: !131)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !175, file: !174, line: 47, baseType: !153, size: 32, align: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !175, file: !174, line: 48, baseType: !165, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !158, file: !4, line: 138, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!164, !148, !187, !167, !170, !171}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !158, file: !4, line: 143, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!164, !148, !193, !195, !171}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !168, line: 51, baseType: !194)
!194 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !158, file: !4, line: 147, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!164, !148, !171}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !158, file: !4, line: 149, baseType: !201, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!204, !148, !285}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !207)
!207 = !{!208, !211, !232, !261, !263, !267, !268, !269, !270, !278, !279, !280, !281}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !206, file: !16, line: 174, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !154, line: 77, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !206, file: !16, line: 175, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !215)
!215 = !{!216, !220, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !214, file: !16, line: 198, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !209}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !214, file: !16, line: 199, baseType: !217, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !214, file: !16, line: 200, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !209, !204, !225, !231}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !209}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !154, line: 50, baseType: !153)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !206, file: !16, line: 177, baseType: !233, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !237)
!237 = !{!238, !243, !247, !251, !255, !256}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !236, file: !16, line: 216, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!230, !204, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !236, file: !16, line: 218, baseType: !244, size: 64, align: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!230, !204}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !236, file: !16, line: 219, baseType: !248, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!230, !204, !226, !209}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !236, file: !16, line: 222, baseType: !252, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !204}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !236, file: !16, line: 226, baseType: !226, size: 64, align: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !236, file: !16, line: 227, baseType: !257, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !206, file: !16, line: 178, baseType: !262, size: 32, align: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !154, line: 55, baseType: !131)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !206, file: !16, line: 180, baseType: !264, size: 64, align: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !266)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !206, file: !16, line: 182, baseType: !153, size: 32, align: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !206, file: !16, line: 183, baseType: !262, size: 32, align: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !206, file: !16, line: 184, baseType: !262, size: 32, align: 32, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !206, file: !16, line: 186, baseType: !271, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !273, line: 37, baseType: !274)
!273 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !273, line: 39, size: 128, align: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !273, line: 41, baseType: !209, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !273, line: 42, baseType: !271, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !16, line: 188, baseType: !204, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !16, line: 189, baseType: !204, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !16, line: 191, baseType: !90, size: 64, align: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !206, file: !16, line: 193, baseType: !282, size: 64, align: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !284)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !158, file: !4, line: 151, baseType: !287, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !148}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !158, file: !4, line: 152, baseType: !291, size: 64, align: 64, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!164, !148, !294, !171}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !158, file: !4, line: 155, baseType: !296, size: 64, align: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!294, !148}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !150, file: !4, line: 103, baseType: !165, size: 64, align: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !150, file: !4, line: 104, baseType: !301, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !302, line: 77, baseType: !303)
!302 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !302, line: 77, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !150, file: !4, line: 105, baseType: !301, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !150, file: !4, line: 106, baseType: !165, size: 64, align: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !150, file: !4, line: 107, baseType: !262, size: 32, align: 32, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !150, file: !4, line: 109, baseType: !167, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !150, file: !4, line: 110, baseType: !310, size: 64, align: 64, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !312, line: 39, baseType: !313)
!312 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !312, line: 41, size: 192, align: 64, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !313, file: !312, line: 43, baseType: !165, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !313, file: !312, line: 44, baseType: !167, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !313, file: !312, line: 45, baseType: !167, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !150, file: !4, line: 111, baseType: !310, size: 64, align: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !150, file: !4, line: 112, baseType: !310, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !150, file: !4, line: 113, baseType: !321, size: 48, align: 8, offset: 704)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 48, align: 8, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 6)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !150, file: !4, line: 117, baseType: !262, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !150, file: !4, line: 118, baseType: !262, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !150, file: !4, line: 119, baseType: !262, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !150, file: !4, line: 120, baseType: !262, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !150, file: !4, line: 121, baseType: !262, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !150, file: !4, line: 122, baseType: !262, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !150, file: !4, line: 124, baseType: !209, size: 64, align: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !150, file: !4, line: 125, baseType: !209, size: 64, align: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !83, file: !86, line: 38, baseType: !131, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !83, file: !86, line: 39, baseType: !131, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !83, file: !86, line: 40, baseType: !131, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !83, file: !86, line: 41, baseType: !131, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !83, file: !86, line: 42, baseType: !131, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !83, file: !86, line: 43, baseType: !131, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !83, file: !86, line: 44, baseType: !131, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !83, file: !86, line: 45, baseType: !131, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !83, file: !86, line: 46, baseType: !90, size: 64, align: 64, offset: 1792)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !83, file: !86, line: 47, baseType: !90, size: 64, align: 64, offset: 1856)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !72, file: !76, line: 9, baseType: !343, size: 64, align: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !344, line: 75, baseType: !345)
!344 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !346, line: 139, baseType: !194)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !72, file: !76, line: 10, baseType: !343, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !72, file: !76, line: 12, baseType: !90, size: 64, align: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !72, file: !76, line: 13, baseType: !90, size: 64, align: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !72, file: !76, line: 15, baseType: !131, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !72, file: !76, line: 16, baseType: !131, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !72, file: !76, line: 17, baseType: !131, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !72, file: !76, line: 18, baseType: !131, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !72, file: !76, line: 19, baseType: !131, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !72, file: !76, line: 21, baseType: !356, size: 64, align: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !71, line: 102, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !359, line: 7, size: 384, align: 64, elements: !360)
!359 = !DIFile(filename: "net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!360 = !{!361, !362, !366, !367, !368, !369, !370, !371}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !358, file: !359, line: 8, baseType: !148, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !358, file: !359, line: 9, baseType: !363, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !71, line: 101, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !71, line: 101, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !358, file: !359, line: 11, baseType: !77, size: 32, align: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !358, file: !359, line: 12, baseType: !77, size: 32, align: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !358, file: !359, line: 13, baseType: !77, size: 32, align: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !358, file: !359, line: 14, baseType: !90, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !358, file: !359, line: 15, baseType: !77, size: 32, align: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !358, file: !359, line: 16, baseType: !131, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !72, file: !76, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !72, file: !76, line: 25, baseType: !374, size: 128, align: 64, offset: 640)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 128, align: 64, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !72, file: !76, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !72, file: !76, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !72, file: !76, line: 29, baseType: !380, size: 64, align: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !71, line: 103, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !383, line: 4, size: 192, align: 64, elements: !384)
!383 = !DIFile(filename: "rawlog.h", directory: "/home/lichi/Desktop/irssi/task1")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !382, file: !383, line: 5, baseType: !77, size: 32, align: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !382, file: !383, line: 6, baseType: !77, size: 32, align: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !382, file: !383, line: 8, baseType: !77, size: 32, align: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !382, file: !383, line: 9, baseType: !271, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !72, file: !76, line: 30, baseType: !390, size: 64, align: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !392, line: 37, baseType: !393)
!392 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !392, line: 37, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !72, file: !76, line: 32, baseType: !90, size: 64, align: 64, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !72, file: !76, line: 33, baseType: !90, size: 64, align: 64, offset: 1024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !72, file: !76, line: 34, baseType: !90, size: 64, align: 64, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !72, file: !76, line: 35, baseType: !131, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !72, file: !76, line: 36, baseType: !131, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !72, file: !76, line: 37, baseType: !131, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !72, file: !76, line: 38, baseType: !131, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !72, file: !76, line: 40, baseType: !402, size: 128, align: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !154, line: 504, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !154, line: 506, size: 128, align: 64, elements: !404)
!404 = !{!405, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !403, file: !154, line: 508, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !154, line: 48, baseType: !194)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !403, file: !154, line: 509, baseType: !406, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !72, file: !76, line: 41, baseType: !343, size: 64, align: 64, offset: 1344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !72, file: !76, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !72, file: !76, line: 44, baseType: !271, size: 64, align: 64, offset: 1472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !72, file: !76, line: 45, baseType: !271, size: 64, align: 64, offset: 1536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !72, file: !76, line: 53, baseType: !413, size: 64, align: 64, offset: 1600)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !69, !416, !77}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !72, file: !76, line: 55, baseType: !419, size: 64, align: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!77, !69, !91}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !72, file: !76, line: 57, baseType: !423, size: 64, align: 64, offset: 1728)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!77, !69, !416}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !72, file: !76, line: 60, baseType: !427, size: 64, align: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!416, !69}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !72, file: !76, line: 62, baseType: !431, size: 64, align: 64, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !69, !416, !416, !77}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !72, file: !76, line: 65, baseType: !435, size: 64, align: 64, offset: 1920)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !69, !416, !416}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !72, file: !76, line: 69, baseType: !440, size: 64, align: 64, offset: 1984)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!443, !69, !416}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !71, line: 109, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !446, line: 15, size: 1408, align: 64, elements: !447)
!446 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!447 = !{!448, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !466, !470, !472, !473, !474, !475, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !449, line: 3, baseType: !77, size: 32, align: 32)
!449 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !445, file: !449, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !445, file: !449, line: 5, baseType: !390, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !445, file: !449, line: 7, baseType: !210, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !445, file: !449, line: 8, baseType: !69, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !445, file: !449, line: 9, baseType: !90, size: 64, align: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !449, line: 10, baseType: !90, size: 64, align: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !445, file: !449, line: 11, baseType: !343, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !445, file: !449, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !445, file: !449, line: 13, baseType: !90, size: 64, align: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !445, file: !449, line: 15, baseType: !460, size: 64, align: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !71, line: 108, baseType: !465)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !71, line: 108, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !445, file: !449, line: 17, baseType: !467, size: 64, align: 64, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!416, !463}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !445, file: !471, line: 5, baseType: !90, size: 64, align: 64, offset: 704)
!471 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!472 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !445, file: !471, line: 6, baseType: !90, size: 64, align: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !445, file: !471, line: 7, baseType: !343, size: 64, align: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !445, file: !471, line: 9, baseType: !390, size: 64, align: 64, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !445, file: !471, line: 10, baseType: !476, size: 64, align: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !71, line: 111, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !71, line: 111, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !445, file: !471, line: 12, baseType: !131, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !445, file: !471, line: 13, baseType: !90, size: 64, align: 64, offset: 1088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !445, file: !471, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !445, file: !471, line: 15, baseType: !90, size: 64, align: 64, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !445, file: !471, line: 17, baseType: !131, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !445, file: !471, line: 18, baseType: !131, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !445, file: !471, line: 19, baseType: !131, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !445, file: !471, line: 20, baseType: !131, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !445, file: !471, line: 22, baseType: !131, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !445, file: !471, line: 23, baseType: !131, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !445, file: !471, line: 24, baseType: !131, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !445, file: !471, line: 25, baseType: !131, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !445, file: !471, line: 26, baseType: !131, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !445, file: !471, line: 31, baseType: !493, size: 64, align: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!90, !443}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !72, file: !76, line: 70, baseType: !497, size: 64, align: 64, offset: 2048)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !69, !416}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !71, line: 110, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !503, line: 15, size: 960, align: 64, elements: !504)
!503 = !DIFile(filename: "queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !519, !520, !521, !522}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !449, line: 3, baseType: !77, size: 32, align: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !502, file: !449, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !502, file: !449, line: 5, baseType: !390, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !502, file: !449, line: 7, baseType: !210, size: 64, align: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !502, file: !449, line: 8, baseType: !69, size: 64, align: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !502, file: !449, line: 9, baseType: !90, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !449, line: 10, baseType: !90, size: 64, align: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !502, file: !449, line: 11, baseType: !343, size: 64, align: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !502, file: !449, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !502, file: !449, line: 13, baseType: !90, size: 64, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !502, file: !449, line: 15, baseType: !460, size: 64, align: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !502, file: !449, line: 17, baseType: !467, size: 64, align: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !502, file: !518, line: 5, baseType: !90, size: 64, align: 64, offset: 704)
!518 = !DIFile(filename: "query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!519 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !502, file: !518, line: 6, baseType: !90, size: 64, align: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !502, file: !518, line: 7, baseType: !343, size: 64, align: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !502, file: !518, line: 9, baseType: !131, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !502, file: !518, line: 11, baseType: !131, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !72, file: !76, line: 71, baseType: !524, size: 64, align: 64, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!77, !416, !416}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !72, file: !76, line: 73, baseType: !524, size: 64, align: 64, offset: 2176)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !71, line: 60, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !210, !148, !77}
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !533, line: 9, baseType: !534)
!533 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !537, !537, !537, !537, !537, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!539 = !{!540, !542}
!540 = distinct !DIGlobalVariable(name: "servers", scope: !0, file: !541, line: 38, type: !271, isLocal: false, isDefinition: true, variable: %struct._GSList** @servers)
!541 = !DIFile(filename: "servers.c", directory: "/home/lichi/Desktop/irssi/task1")
!542 = distinct !DIGlobalVariable(name: "lookup_servers", scope: !0, file: !541, line: 38, type: !271, isLocal: false, isDefinition: true, variable: %struct._GSList** @lookup_servers)
!543 = !{i32 2, !"Dwarf Version", i32 4}
!544 = !{i32 2, !"Debug Info Version", i32 3}
!545 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!546 = distinct !DISubprogram(name: "server_connect_failed", scope: !541, file: !541, line: 41, type: !547, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !69, !416}
!549 = !{}
!550 = !DILocalVariable(name: "server", arg: 1, scope: !546, file: !541, line: 41, type: !69)
!551 = !DIExpression()
!552 = !DILocation(line: 41, column: 40, scope: !546)
!553 = !DILocalVariable(name: "msg", arg: 2, scope: !546, file: !541, line: 41, type: !416)
!554 = !DILocation(line: 41, column: 60, scope: !546)
!555 = !DILocation(line: 43, column: 2, scope: !546)
!556 = distinct !{!556, !555}
!557 = !DILocation(line: 43, column: 45, scope: !558)
!558 = !DILexicalBlockFile(scope: !559, file: !541, discriminator: 1)
!559 = distinct !DILexicalBlock(scope: !560, file: !541, line: 43, column: 10)
!560 = distinct !DILexicalBlock(scope: !546, file: !541, line: 43, column: 4)
!561 = !DILocation(line: 43, column: 27, scope: !558)
!562 = !DILocation(line: 43, column: 12, scope: !558)
!563 = !DILocation(line: 43, column: 10, scope: !558)
!564 = !DILocation(line: 43, column: 11, scope: !565)
!565 = !DILexicalBlockFile(scope: !559, file: !541, discriminator: 2)
!566 = !DILocation(line: 43, column: 10, scope: !567)
!567 = !DILexicalBlockFile(scope: !560, file: !541, discriminator: 3)
!568 = !DILocation(line: 43, column: 33, scope: !569)
!569 = !DILexicalBlockFile(scope: !570, file: !541, discriminator: 4)
!570 = distinct !DILexicalBlock(scope: !559, file: !541, line: 43, column: 31)
!571 = !DILocation(line: 43, column: 42, scope: !572)
!572 = !DILexicalBlockFile(scope: !573, file: !541, discriminator: 5)
!573 = distinct !DILexicalBlock(scope: !559, file: !541, line: 43, column: 40)
!574 = !DILocation(line: 43, column: 132, scope: !572)
!575 = !DILocation(line: 43, column: 143, scope: !576)
!576 = !DILexicalBlockFile(scope: !560, file: !541, discriminator: 6)
!577 = !DILocation(line: 45, column: 34, scope: !546)
!578 = !DILocation(line: 45, column: 50, scope: !546)
!579 = !DILocation(line: 45, column: 19, scope: !546)
!580 = !DILocation(line: 45, column: 17, scope: !546)
!581 = !DILocation(line: 47, column: 42, scope: !546)
!582 = !DILocation(line: 47, column: 50, scope: !546)
!583 = !DILocation(line: 47, column: 2, scope: !546)
!584 = !DILocation(line: 49, column: 6, scope: !585)
!585 = distinct !DILexicalBlock(scope: !546, file: !541, line: 49, column: 6)
!586 = !DILocation(line: 49, column: 14, scope: !585)
!587 = !DILocation(line: 49, column: 26, scope: !585)
!588 = !DILocation(line: 49, column: 6, scope: !546)
!589 = !DILocation(line: 50, column: 19, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !541, line: 49, column: 33)
!591 = !DILocation(line: 50, column: 27, scope: !590)
!592 = !DILocation(line: 50, column: 3, scope: !590)
!593 = !DILocation(line: 51, column: 3, scope: !590)
!594 = !DILocation(line: 51, column: 11, scope: !590)
!595 = !DILocation(line: 51, column: 23, scope: !590)
!596 = !DILocation(line: 52, column: 2, scope: !590)
!597 = !DILocation(line: 53, column: 6, scope: !598)
!598 = distinct !DILexicalBlock(scope: !546, file: !541, line: 53, column: 6)
!599 = !DILocation(line: 53, column: 14, scope: !598)
!600 = !DILocation(line: 53, column: 21, scope: !598)
!601 = !DILocation(line: 53, column: 6, scope: !546)
!602 = !DILocation(line: 54, column: 26, scope: !603)
!603 = distinct !DILexicalBlock(scope: !598, file: !541, line: 53, column: 29)
!604 = !DILocation(line: 54, column: 34, scope: !603)
!605 = !DILocation(line: 54, column: 3, scope: !603)
!606 = !DILocation(line: 55, column: 3, scope: !603)
!607 = !DILocation(line: 55, column: 11, scope: !603)
!608 = !DILocation(line: 55, column: 18, scope: !603)
!609 = !DILocation(line: 56, column: 2, scope: !603)
!610 = !DILocation(line: 58, column: 6, scope: !611)
!611 = distinct !DILexicalBlock(scope: !546, file: !541, line: 58, column: 6)
!612 = !DILocation(line: 58, column: 14, scope: !611)
!613 = !DILocation(line: 58, column: 30, scope: !611)
!614 = !DILocation(line: 58, column: 6, scope: !546)
!615 = !DILocation(line: 59, column: 25, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !541, line: 58, column: 38)
!617 = !DILocation(line: 59, column: 33, scope: !616)
!618 = !DILocation(line: 59, column: 3, scope: !616)
!619 = !DILocation(line: 60, column: 22, scope: !616)
!620 = !DILocation(line: 60, column: 30, scope: !616)
!621 = !DILocation(line: 60, column: 3, scope: !616)
!622 = !DILocation(line: 61, column: 25, scope: !616)
!623 = !DILocation(line: 61, column: 33, scope: !616)
!624 = !DILocation(line: 61, column: 3, scope: !616)
!625 = !DILocation(line: 62, column: 22, scope: !616)
!626 = !DILocation(line: 62, column: 30, scope: !616)
!627 = !DILocation(line: 62, column: 3, scope: !616)
!628 = !DILocation(line: 63, column: 3, scope: !616)
!629 = !DILocation(line: 63, column: 11, scope: !616)
!630 = !DILocation(line: 63, column: 27, scope: !616)
!631 = !DILocation(line: 64, column: 3, scope: !616)
!632 = !DILocation(line: 64, column: 11, scope: !616)
!633 = !DILocation(line: 64, column: 27, scope: !616)
!634 = !DILocation(line: 65, column: 2, scope: !616)
!635 = !DILocation(line: 67, column: 15, scope: !546)
!636 = !DILocation(line: 67, column: 2, scope: !546)
!637 = !DILocation(line: 68, column: 1, scope: !546)
!638 = !DILocation(line: 68, column: 1, scope: !639)
!639 = !DILexicalBlockFile(scope: !546, file: !541, discriminator: 1)
!640 = distinct !DISubprogram(name: "server_unref", scope: !541, file: !541, line: 501, type: !641, isLocal: false, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!641 = !DISubroutineType(types: !642)
!642 = !{!77, !69}
!643 = !DILocalVariable(name: "server", arg: 1, scope: !640, file: !541, line: 501, type: !69)
!644 = !DILocation(line: 501, column: 30, scope: !640)
!645 = !DILocalVariable(name: "chans", scope: !640, file: !541, line: 503, type: !77)
!646 = !DILocation(line: 503, column: 6, scope: !640)
!647 = !DILocation(line: 505, column: 2, scope: !640)
!648 = distinct !{!648, !647}
!649 = !DILocation(line: 505, column: 45, scope: !650)
!650 = !DILexicalBlockFile(scope: !651, file: !541, discriminator: 1)
!651 = distinct !DILexicalBlock(scope: !652, file: !541, line: 505, column: 10)
!652 = distinct !DILexicalBlock(scope: !640, file: !541, line: 505, column: 4)
!653 = !DILocation(line: 505, column: 27, scope: !650)
!654 = !DILocation(line: 505, column: 12, scope: !650)
!655 = !DILocation(line: 505, column: 10, scope: !650)
!656 = !DILocation(line: 505, column: 11, scope: !657)
!657 = !DILexicalBlockFile(scope: !651, file: !541, discriminator: 2)
!658 = !DILocation(line: 505, column: 10, scope: !659)
!659 = !DILexicalBlockFile(scope: !652, file: !541, discriminator: 3)
!660 = !DILocation(line: 505, column: 33, scope: !661)
!661 = !DILexicalBlockFile(scope: !662, file: !541, discriminator: 4)
!662 = distinct !DILexicalBlock(scope: !651, file: !541, line: 505, column: 31)
!663 = !DILocation(line: 505, column: 42, scope: !664)
!664 = !DILexicalBlockFile(scope: !665, file: !541, discriminator: 5)
!665 = distinct !DILexicalBlock(scope: !651, file: !541, line: 505, column: 40)
!666 = !DILocation(line: 505, column: 132, scope: !664)
!667 = !DILocation(line: 505, column: 149, scope: !668)
!668 = !DILexicalBlockFile(scope: !652, file: !541, discriminator: 6)
!669 = !DILocation(line: 507, column: 8, scope: !670)
!670 = distinct !DILexicalBlock(scope: !640, file: !541, line: 507, column: 6)
!671 = !DILocation(line: 507, column: 16, scope: !670)
!672 = !DILocation(line: 507, column: 6, scope: !670)
!673 = !DILocation(line: 507, column: 25, scope: !670)
!674 = !DILocation(line: 507, column: 6, scope: !640)
!675 = !DILocation(line: 508, column: 3, scope: !670)
!676 = !DILocation(line: 510, column: 19, scope: !677)
!677 = distinct !DILexicalBlock(scope: !640, file: !541, line: 510, column: 6)
!678 = !DILocation(line: 510, column: 28, scope: !677)
!679 = !DILocation(line: 510, column: 6, scope: !677)
!680 = !DILocation(line: 510, column: 36, scope: !677)
!681 = !DILocation(line: 510, column: 6, scope: !640)
!682 = !DILocation(line: 511, column: 3, scope: !683)
!683 = distinct !DILexicalBlock(scope: !677, file: !541, line: 510, column: 44)
!684 = !DILocation(line: 512, column: 21, scope: !683)
!685 = !DILocation(line: 512, column: 3, scope: !683)
!686 = !DILocation(line: 513, column: 3, scope: !683)
!687 = !DILocation(line: 517, column: 33, scope: !640)
!688 = !DILocation(line: 517, column: 10, scope: !640)
!689 = !DILocation(line: 517, column: 8, scope: !640)
!690 = !DILocation(line: 522, column: 6, scope: !691)
!691 = distinct !DILexicalBlock(scope: !640, file: !541, line: 522, column: 6)
!692 = !DILocation(line: 522, column: 14, scope: !691)
!693 = !DILocation(line: 522, column: 6, scope: !640)
!694 = !DILocation(line: 523, column: 38, scope: !695)
!695 = distinct !DILexicalBlock(scope: !691, file: !541, line: 522, column: 28)
!696 = !DILocation(line: 523, column: 3, scope: !695)
!697 = !DILocation(line: 524, column: 2, scope: !695)
!698 = !DILocation(line: 526, column: 6, scope: !699)
!699 = distinct !DILexicalBlock(scope: !640, file: !541, line: 526, column: 6)
!700 = !DILocation(line: 526, column: 14, scope: !699)
!701 = !DILocation(line: 526, column: 21, scope: !699)
!702 = !DILocation(line: 526, column: 6, scope: !640)
!703 = !DILocation(line: 527, column: 8, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !541, line: 527, column: 7)
!705 = distinct !DILexicalBlock(scope: !699, file: !541, line: 526, column: 29)
!706 = !DILocation(line: 527, column: 14, scope: !704)
!707 = !DILocation(line: 527, column: 17, scope: !708)
!708 = !DILexicalBlockFile(scope: !704, file: !541, discriminator: 1)
!709 = !DILocation(line: 527, column: 25, scope: !708)
!710 = !DILocation(line: 527, column: 7, scope: !708)
!711 = !DILocation(line: 528, column: 27, scope: !704)
!712 = !DILocation(line: 528, column: 35, scope: !704)
!713 = !DILocation(line: 528, column: 4, scope: !704)
!714 = !DILocation(line: 533, column: 47, scope: !715)
!715 = distinct !DILexicalBlock(scope: !704, file: !541, line: 529, column: 8)
!716 = !DILocation(line: 533, column: 55, scope: !715)
!717 = !DILocation(line: 533, column: 25, scope: !715)
!718 = !DILocation(line: 533, column: 4, scope: !719)
!719 = !DILexicalBlockFile(scope: !715, file: !541, discriminator: 1)
!720 = !DILocation(line: 534, column: 27, scope: !715)
!721 = !DILocation(line: 534, column: 35, scope: !715)
!722 = !DILocation(line: 534, column: 4, scope: !715)
!723 = !DILocation(line: 536, column: 3, scope: !705)
!724 = !DILocation(line: 536, column: 11, scope: !705)
!725 = !DILocation(line: 536, column: 18, scope: !705)
!726 = !DILocation(line: 537, column: 2, scope: !705)
!727 = !DILocation(line: 539, column: 31, scope: !640)
!728 = !DILocation(line: 539, column: 40, scope: !640)
!729 = !DILocation(line: 539, column: 9, scope: !640)
!730 = !DILocation(line: 540, column: 23, scope: !640)
!731 = !DILocation(line: 540, column: 31, scope: !640)
!732 = !DILocation(line: 540, column: 2, scope: !640)
!733 = !DILocation(line: 541, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !640, file: !541, line: 541, column: 6)
!735 = !DILocation(line: 541, column: 14, scope: !734)
!736 = !DILocation(line: 541, column: 21, scope: !734)
!737 = !DILocation(line: 541, column: 6, scope: !640)
!738 = !DILocation(line: 541, column: 44, scope: !739)
!739 = !DILexicalBlockFile(scope: !734, file: !541, discriminator: 1)
!740 = !DILocation(line: 541, column: 52, scope: !739)
!741 = !DILocation(line: 541, column: 29, scope: !739)
!742 = !DILocation(line: 542, column: 9, scope: !640)
!743 = !DILocation(line: 542, column: 17, scope: !640)
!744 = !DILocation(line: 542, column: 2, scope: !640)
!745 = !DILocation(line: 543, column: 9, scope: !640)
!746 = !DILocation(line: 543, column: 17, scope: !640)
!747 = !DILocation(line: 543, column: 2, scope: !640)
!748 = !DILocation(line: 544, column: 9, scope: !640)
!749 = !DILocation(line: 544, column: 17, scope: !640)
!750 = !DILocation(line: 544, column: 2, scope: !640)
!751 = !DILocation(line: 545, column: 9, scope: !640)
!752 = !DILocation(line: 545, column: 17, scope: !640)
!753 = !DILocation(line: 545, column: 2, scope: !640)
!754 = !DILocation(line: 547, column: 2, scope: !640)
!755 = !DILocation(line: 547, column: 10, scope: !640)
!756 = !DILocation(line: 547, column: 15, scope: !640)
!757 = !DILocation(line: 548, column: 9, scope: !640)
!758 = !DILocation(line: 548, column: 2, scope: !640)
!759 = !DILocation(line: 549, column: 9, scope: !640)
!760 = !DILocation(line: 550, column: 1, scope: !640)
!761 = distinct !DISubprogram(name: "server_connect_finished", scope: !541, file: !541, line: 142, type: !762, isLocal: false, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !69}
!764 = !DILocalVariable(name: "server", arg: 1, scope: !761, file: !541, line: 142, type: !69)
!765 = !DILocation(line: 142, column: 42, scope: !761)
!766 = !DILocation(line: 144, column: 25, scope: !761)
!767 = !DILocation(line: 144, column: 2, scope: !761)
!768 = !DILocation(line: 144, column: 10, scope: !761)
!769 = !DILocation(line: 144, column: 23, scope: !761)
!770 = !DILocation(line: 146, column: 27, scope: !761)
!771 = !DILocation(line: 146, column: 36, scope: !761)
!772 = !DILocation(line: 146, column: 12, scope: !761)
!773 = !DILocation(line: 146, column: 10, scope: !761)
!774 = !DILocation(line: 147, column: 37, scope: !761)
!775 = !DILocation(line: 147, column: 2, scope: !761)
!776 = !DILocation(line: 148, column: 1, scope: !761)
!777 = distinct !DISubprogram(name: "server_connect", scope: !541, file: !541, line: 340, type: !778, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!778 = !DISubroutineType(types: !779)
!779 = !{!69, !81}
!780 = !DILocalVariable(name: "conn", arg: 1, scope: !777, file: !541, line: 340, type: !81)
!781 = !DILocation(line: 340, column: 48, scope: !777)
!782 = !DILocalVariable(name: "proto", scope: !777, file: !541, line: 342, type: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !71, line: 105, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !786, line: 4, size: 832, align: 64, elements: !787)
!786 = !DIFile(filename: "chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !801, !840, !847, !851, !855, !857, !859, !863}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !785, file: !786, line: 5, baseType: !77, size: 32, align: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !785, file: !786, line: 7, baseType: !131, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !785, file: !786, line: 8, baseType: !131, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !786, line: 10, baseType: !90, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !785, file: !786, line: 11, baseType: !90, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !785, file: !786, line: 12, baseType: !90, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !785, file: !786, line: 14, baseType: !795, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !71, line: 106, baseType: !800)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !71, line: 106, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !785, file: !786, line: 15, baseType: !802, size: 64, align: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !71, line: 114, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !808, line: 13, size: 1408, align: 64, elements: !809)
!808 = !DIFile(filename: "servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!809 = !{!810, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !811, line: 1, baseType: !77, size: 32, align: 32)
!811 = !DIFile(filename: "server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!812 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !807, file: !811, line: 2, baseType: !77, size: 32, align: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !807, file: !811, line: 4, baseType: !90, size: 64, align: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !807, file: !811, line: 6, baseType: !97, size: 16, align: 16, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !807, file: !811, line: 7, baseType: !90, size: 64, align: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !807, file: !811, line: 8, baseType: !77, size: 32, align: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !807, file: !811, line: 9, baseType: !90, size: 64, align: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !807, file: !811, line: 11, baseType: !77, size: 32, align: 32, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !807, file: !811, line: 12, baseType: !90, size: 64, align: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !807, file: !811, line: 14, baseType: !90, size: 64, align: 64, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !807, file: !811, line: 15, baseType: !90, size: 64, align: 64, offset: 576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !807, file: !811, line: 16, baseType: !90, size: 64, align: 64, offset: 640)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !807, file: !811, line: 17, baseType: !90, size: 64, align: 64, offset: 704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !807, file: !811, line: 18, baseType: !90, size: 64, align: 64, offset: 768)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !807, file: !811, line: 19, baseType: !90, size: 64, align: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !807, file: !811, line: 20, baseType: !90, size: 64, align: 64, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !807, file: !811, line: 21, baseType: !90, size: 64, align: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !807, file: !811, line: 23, baseType: !90, size: 64, align: 64, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !807, file: !811, line: 24, baseType: !103, size: 64, align: 64, offset: 1088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !807, file: !811, line: 24, baseType: !103, size: 64, align: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !807, file: !811, line: 26, baseType: !343, size: 64, align: 64, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !807, file: !811, line: 28, baseType: !131, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !807, file: !811, line: 29, baseType: !131, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !807, file: !811, line: 30, baseType: !131, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !807, file: !811, line: 31, baseType: !131, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !807, file: !811, line: 32, baseType: !131, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !807, file: !811, line: 33, baseType: !131, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !807, file: !811, line: 34, baseType: !131, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !807, file: !811, line: 36, baseType: !390, size: 64, align: 64, offset: 1344)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !785, file: !786, line: 16, baseType: !841, size: 64, align: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !71, line: 115, baseType: !846)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !71, line: 115, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !785, file: !786, line: 17, baseType: !848, size: 64, align: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!81}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !785, file: !786, line: 18, baseType: !852, size: 64, align: 64, offset: 512)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !81}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !785, file: !786, line: 20, baseType: !856, size: 64, align: 64, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "server_connect", scope: !785, file: !786, line: 21, baseType: !858, size: 64, align: 64, offset: 640)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "channel_create", scope: !785, file: !786, line: 22, baseType: !860, size: 64, align: 64, offset: 704)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!443, !69, !416, !416, !77}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "query_create", scope: !785, file: !786, line: 24, baseType: !864, size: 64, align: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!500, !416, !416, !77}
!867 = !DILocation(line: 342, column: 21, scope: !777)
!868 = !DILocalVariable(name: "server", scope: !777, file: !541, line: 343, type: !69)
!869 = !DILocation(line: 343, column: 14, scope: !777)
!870 = !DILocation(line: 345, column: 12, scope: !777)
!871 = !DILocation(line: 345, column: 18, scope: !777)
!872 = !DILocation(line: 345, column: 11, scope: !777)
!873 = !DILocation(line: 345, column: 11, scope: !874)
!874 = !DILexicalBlockFile(scope: !777, file: !541, discriminator: 1)
!875 = !DILocation(line: 345, column: 64, scope: !876)
!876 = !DILexicalBlockFile(scope: !777, file: !541, discriminator: 2)
!877 = !DILocation(line: 345, column: 71, scope: !876)
!878 = !DILocation(line: 345, column: 41, scope: !876)
!879 = !DILocation(line: 345, column: 11, scope: !876)
!880 = !DILocation(line: 345, column: 11, scope: !881)
!881 = !DILexicalBlockFile(scope: !777, file: !541, discriminator: 3)
!882 = !DILocation(line: 345, column: 8, scope: !881)
!883 = !DILocation(line: 346, column: 11, scope: !777)
!884 = !DILocation(line: 346, column: 18, scope: !777)
!885 = !DILocation(line: 346, column: 38, scope: !777)
!886 = !DILocation(line: 346, column: 9, scope: !777)
!887 = !DILocation(line: 347, column: 2, scope: !777)
!888 = !DILocation(line: 347, column: 9, scope: !777)
!889 = !DILocation(line: 347, column: 24, scope: !777)
!890 = !DILocation(line: 349, column: 9, scope: !777)
!891 = !DILocation(line: 349, column: 2, scope: !777)
!892 = distinct !DISubprogram(name: "server_connect_init", scope: !541, file: !541, line: 353, type: !762, isLocal: false, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!893 = !DILocalVariable(name: "server", arg: 1, scope: !892, file: !541, line: 353, type: !69)
!894 = !DILocation(line: 353, column: 38, scope: !892)
!895 = !DILocalVariable(name: "str", scope: !892, file: !541, line: 355, type: !416)
!896 = !DILocation(line: 355, column: 14, scope: !892)
!897 = !DILocation(line: 357, column: 2, scope: !892)
!898 = distinct !{!898, !897}
!899 = !DILocation(line: 357, column: 10, scope: !900)
!900 = !DILexicalBlockFile(scope: !901, file: !541, discriminator: 1)
!901 = distinct !DILexicalBlock(scope: !902, file: !541, line: 357, column: 10)
!902 = distinct !DILexicalBlock(scope: !892, file: !541, line: 357, column: 4)
!903 = !DILocation(line: 357, column: 17, scope: !900)
!904 = !DILocation(line: 357, column: 5, scope: !905)
!905 = !DILexicalBlockFile(scope: !906, file: !541, discriminator: 2)
!906 = distinct !DILexicalBlock(scope: !901, file: !541, line: 357, column: 3)
!907 = !DILocation(line: 357, column: 14, scope: !908)
!908 = !DILexicalBlockFile(scope: !909, file: !541, discriminator: 3)
!909 = distinct !DILexicalBlock(scope: !901, file: !541, line: 357, column: 12)
!910 = !DILocation(line: 357, column: 101, scope: !908)
!911 = !DILocation(line: 357, column: 112, scope: !912)
!912 = !DILexicalBlockFile(scope: !902, file: !541, discriminator: 4)
!913 = !DILocation(line: 359, column: 26, scope: !892)
!914 = !DILocation(line: 359, column: 3, scope: !892)
!915 = !DILocation(line: 359, column: 12, scope: !892)
!916 = !DILocation(line: 359, column: 24, scope: !892)
!917 = !DILocation(line: 360, column: 17, scope: !892)
!918 = !DILocation(line: 360, column: 2, scope: !892)
!919 = !DILocation(line: 360, column: 10, scope: !892)
!920 = !DILocation(line: 360, column: 15, scope: !892)
!921 = !DILocation(line: 361, column: 13, scope: !892)
!922 = !DILocation(line: 361, column: 2, scope: !892)
!923 = !DILocation(line: 363, column: 26, scope: !892)
!924 = !DILocation(line: 363, column: 34, scope: !892)
!925 = !DILocation(line: 363, column: 43, scope: !892)
!926 = !DILocation(line: 363, column: 17, scope: !892)
!927 = !DILocation(line: 363, column: 2, scope: !892)
!928 = !DILocation(line: 363, column: 10, scope: !892)
!929 = !DILocation(line: 363, column: 15, scope: !892)
!930 = !DILocation(line: 364, column: 6, scope: !931)
!931 = distinct !DILexicalBlock(scope: !892, file: !541, line: 364, column: 6)
!932 = !DILocation(line: 364, column: 14, scope: !931)
!933 = !DILocation(line: 364, column: 23, scope: !931)
!934 = !DILocation(line: 364, column: 32, scope: !931)
!935 = !DILocation(line: 364, column: 39, scope: !931)
!936 = !DILocation(line: 364, column: 43, scope: !937)
!937 = !DILexicalBlockFile(scope: !931, file: !541, discriminator: 1)
!938 = !DILocation(line: 364, column: 51, scope: !937)
!939 = !DILocation(line: 364, column: 60, scope: !937)
!940 = !DILocation(line: 364, column: 42, scope: !937)
!941 = !DILocation(line: 364, column: 69, scope: !937)
!942 = !DILocation(line: 364, column: 6, scope: !937)
!943 = !DILocation(line: 365, column: 10, scope: !944)
!944 = distinct !DILexicalBlock(scope: !931, file: !541, line: 364, column: 78)
!945 = !DILocation(line: 365, column: 18, scope: !944)
!946 = !DILocation(line: 365, column: 27, scope: !944)
!947 = !DILocation(line: 365, column: 3, scope: !944)
!948 = !DILocation(line: 367, column: 9, scope: !944)
!949 = !DILocation(line: 367, column: 7, scope: !944)
!950 = !DILocation(line: 368, column: 8, scope: !951)
!951 = distinct !DILexicalBlock(scope: !944, file: !541, line: 368, column: 7)
!952 = !DILocation(line: 368, column: 7, scope: !951)
!953 = !DILocation(line: 368, column: 12, scope: !951)
!954 = !DILocation(line: 368, column: 7, scope: !944)
!955 = !DILocation(line: 368, column: 25, scope: !956)
!956 = !DILexicalBlockFile(scope: !951, file: !541, discriminator: 1)
!957 = !DILocation(line: 368, column: 21, scope: !956)
!958 = !DILocation(line: 369, column: 40, scope: !944)
!959 = !DILocation(line: 369, column: 31, scope: !944)
!960 = !DILocation(line: 369, column: 3, scope: !944)
!961 = !DILocation(line: 369, column: 11, scope: !944)
!962 = !DILocation(line: 369, column: 20, scope: !944)
!963 = !DILocation(line: 369, column: 29, scope: !944)
!964 = !DILocation(line: 370, column: 2, scope: !944)
!965 = !DILocation(line: 371, column: 6, scope: !966)
!966 = distinct !DILexicalBlock(scope: !892, file: !541, line: 371, column: 6)
!967 = !DILocation(line: 371, column: 14, scope: !966)
!968 = !DILocation(line: 371, column: 23, scope: !966)
!969 = !DILocation(line: 371, column: 32, scope: !966)
!970 = !DILocation(line: 371, column: 39, scope: !966)
!971 = !DILocation(line: 371, column: 43, scope: !972)
!972 = !DILexicalBlockFile(scope: !966, file: !541, discriminator: 1)
!973 = !DILocation(line: 371, column: 51, scope: !972)
!974 = !DILocation(line: 371, column: 60, scope: !972)
!975 = !DILocation(line: 371, column: 42, scope: !972)
!976 = !DILocation(line: 371, column: 69, scope: !972)
!977 = !DILocation(line: 371, column: 6, scope: !972)
!978 = !DILocation(line: 372, column: 10, scope: !979)
!979 = distinct !DILexicalBlock(scope: !966, file: !541, line: 371, column: 78)
!980 = !DILocation(line: 372, column: 18, scope: !979)
!981 = !DILocation(line: 372, column: 27, scope: !979)
!982 = !DILocation(line: 372, column: 3, scope: !979)
!983 = !DILocation(line: 374, column: 9, scope: !979)
!984 = !DILocation(line: 374, column: 7, scope: !979)
!985 = !DILocation(line: 375, column: 8, scope: !986)
!986 = distinct !DILexicalBlock(scope: !979, file: !541, line: 375, column: 7)
!987 = !DILocation(line: 375, column: 7, scope: !986)
!988 = !DILocation(line: 375, column: 12, scope: !986)
!989 = !DILocation(line: 375, column: 7, scope: !979)
!990 = !DILocation(line: 375, column: 27, scope: !991)
!991 = !DILexicalBlockFile(scope: !986, file: !541, discriminator: 1)
!992 = !DILocation(line: 375, column: 35, scope: !991)
!993 = !DILocation(line: 375, column: 44, scope: !991)
!994 = !DILocation(line: 375, column: 25, scope: !991)
!995 = !DILocation(line: 375, column: 21, scope: !991)
!996 = !DILocation(line: 376, column: 40, scope: !979)
!997 = !DILocation(line: 376, column: 31, scope: !979)
!998 = !DILocation(line: 376, column: 3, scope: !979)
!999 = !DILocation(line: 376, column: 11, scope: !979)
!1000 = !DILocation(line: 376, column: 20, scope: !979)
!1001 = !DILocation(line: 376, column: 29, scope: !979)
!1002 = !DILocation(line: 377, column: 2, scope: !979)
!1003 = !DILocation(line: 379, column: 34, scope: !892)
!1004 = !DILocation(line: 379, column: 42, scope: !892)
!1005 = !DILocation(line: 379, column: 16, scope: !892)
!1006 = !DILocation(line: 379, column: 2, scope: !892)
!1007 = !DILocation(line: 379, column: 10, scope: !892)
!1008 = !DILocation(line: 379, column: 14, scope: !892)
!1009 = !DILocation(line: 380, column: 2, scope: !892)
!1010 = !DILocation(line: 380, column: 10, scope: !892)
!1011 = !DILocation(line: 380, column: 22, scope: !892)
!1012 = !DILocation(line: 381, column: 1, scope: !892)
!1013 = !DILocation(line: 381, column: 1, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !892, file: !541, discriminator: 1)
!1015 = distinct !DISubprogram(name: "server_ref", scope: !541, file: !541, line: 494, type: !762, isLocal: false, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!1016 = !DILocalVariable(name: "server", arg: 1, scope: !1015, file: !541, line: 494, type: !69)
!1017 = !DILocation(line: 494, column: 29, scope: !1015)
!1018 = !DILocation(line: 496, column: 2, scope: !1015)
!1019 = distinct !{!1019, !1018}
!1020 = !DILocation(line: 496, column: 45, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !1022, file: !541, discriminator: 1)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !541, line: 496, column: 10)
!1023 = distinct !DILexicalBlock(scope: !1015, file: !541, line: 496, column: 4)
!1024 = !DILocation(line: 496, column: 27, scope: !1021)
!1025 = !DILocation(line: 496, column: 12, scope: !1021)
!1026 = !DILocation(line: 496, column: 10, scope: !1021)
!1027 = !DILocation(line: 496, column: 11, scope: !1028)
!1028 = !DILexicalBlockFile(scope: !1022, file: !541, discriminator: 2)
!1029 = !DILocation(line: 496, column: 10, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1023, file: !541, discriminator: 3)
!1031 = !DILocation(line: 496, column: 33, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !1033, file: !541, discriminator: 4)
!1033 = distinct !DILexicalBlock(scope: !1022, file: !541, line: 496, column: 31)
!1034 = !DILocation(line: 496, column: 42, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1036, file: !541, discriminator: 5)
!1036 = distinct !DILexicalBlock(scope: !1022, file: !541, line: 496, column: 40)
!1037 = !DILocation(line: 496, column: 132, scope: !1035)
!1038 = !DILocation(line: 496, column: 143, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1023, file: !541, discriminator: 6)
!1040 = !DILocation(line: 498, column: 2, scope: !1015)
!1041 = !DILocation(line: 498, column: 10, scope: !1015)
!1042 = !DILocation(line: 498, column: 18, scope: !1015)
!1043 = !DILocation(line: 499, column: 1, scope: !1015)
!1044 = !DILocation(line: 499, column: 1, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1015, file: !541, discriminator: 1)
!1046 = distinct !DISubprogram(name: "server_create_tag", scope: !541, file: !541, line: 100, type: !1047, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !549)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!90, !81}
!1049 = !DILocalVariable(name: "conn", arg: 1, scope: !1046, file: !541, line: 100, type: !81)
!1050 = !DILocation(line: 100, column: 52, scope: !1046)
!1051 = !DILocalVariable(name: "str", scope: !1046, file: !541, line: 102, type: !310)
!1052 = !DILocation(line: 102, column: 11, scope: !1046)
!1053 = !DILocalVariable(name: "tag", scope: !1046, file: !541, line: 103, type: !90)
!1054 = !DILocation(line: 103, column: 8, scope: !1046)
!1055 = !DILocalVariable(name: "num", scope: !1046, file: !541, line: 104, type: !77)
!1056 = !DILocation(line: 104, column: 6, scope: !1046)
!1057 = !DILocation(line: 106, column: 2, scope: !1046)
!1058 = distinct !{!1058, !1057}
!1059 = !DILocation(line: 106, column: 53, scope: !1060)
!1060 = !DILexicalBlockFile(scope: !1061, file: !541, discriminator: 1)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !541, line: 106, column: 10)
!1062 = distinct !DILexicalBlock(scope: !1046, file: !541, line: 106, column: 4)
!1063 = !DILocation(line: 106, column: 35, scope: !1060)
!1064 = !DILocation(line: 106, column: 12, scope: !1060)
!1065 = !DILocation(line: 106, column: 10, scope: !1060)
!1066 = !DILocation(line: 106, column: 11, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1061, file: !541, discriminator: 2)
!1068 = !DILocation(line: 106, column: 10, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1062, file: !541, discriminator: 3)
!1070 = !DILocation(line: 106, column: 41, scope: !1071)
!1071 = !DILexicalBlockFile(scope: !1072, file: !541, discriminator: 4)
!1072 = distinct !DILexicalBlock(scope: !1061, file: !541, line: 106, column: 39)
!1073 = !DILocation(line: 106, column: 50, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !1075, file: !541, discriminator: 5)
!1075 = distinct !DILexicalBlock(scope: !1061, file: !541, line: 106, column: 48)
!1076 = !DILocation(line: 106, column: 146, scope: !1074)
!1077 = !DILocation(line: 106, column: 7, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1062, file: !541, discriminator: 6)
!1079 = !DILocation(line: 108, column: 8, scope: !1046)
!1080 = !DILocation(line: 108, column: 14, scope: !1046)
!1081 = !DILocation(line: 108, column: 22, scope: !1046)
!1082 = !DILocation(line: 108, column: 29, scope: !1046)
!1083 = !DILocation(line: 108, column: 33, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1046, file: !541, discriminator: 1)
!1085 = !DILocation(line: 108, column: 39, scope: !1084)
!1086 = !DILocation(line: 108, column: 32, scope: !1084)
!1087 = !DILocation(line: 108, column: 47, scope: !1084)
!1088 = !DILocation(line: 108, column: 8, scope: !1084)
!1089 = !DILocation(line: 109, column: 12, scope: !1046)
!1090 = !DILocation(line: 109, column: 18, scope: !1046)
!1091 = !DILocation(line: 109, column: 3, scope: !1046)
!1092 = !DILocation(line: 108, column: 8, scope: !1093)
!1093 = !DILexicalBlockFile(scope: !1046, file: !541, discriminator: 2)
!1094 = !DILocation(line: 110, column: 29, scope: !1046)
!1095 = !DILocation(line: 110, column: 35, scope: !1046)
!1096 = !DILocation(line: 110, column: 3, scope: !1046)
!1097 = !DILocation(line: 108, column: 8, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1046, file: !541, discriminator: 3)
!1099 = !DILocation(line: 108, column: 8, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1046, file: !541, discriminator: 4)
!1101 = !DILocation(line: 108, column: 6, scope: !1100)
!1102 = !DILocation(line: 112, column: 6, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1046, file: !541, line: 112, column: 6)
!1104 = !DILocation(line: 112, column: 12, scope: !1103)
!1105 = !DILocation(line: 112, column: 16, scope: !1103)
!1106 = !DILocation(line: 112, column: 23, scope: !1103)
!1107 = !DILocation(line: 112, column: 42, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1103, file: !541, discriminator: 1)
!1109 = !DILocation(line: 112, column: 48, scope: !1108)
!1110 = !DILocation(line: 112, column: 26, scope: !1108)
!1111 = !DILocation(line: 112, column: 53, scope: !1108)
!1112 = !DILocation(line: 112, column: 61, scope: !1108)
!1113 = !DILocation(line: 113, column: 36, scope: !1103)
!1114 = !DILocation(line: 113, column: 42, scope: !1103)
!1115 = !DILocation(line: 113, column: 13, scope: !1103)
!1116 = !DILocation(line: 113, column: 47, scope: !1103)
!1117 = !DILocation(line: 113, column: 54, scope: !1103)
!1118 = !DILocation(line: 114, column: 14, scope: !1103)
!1119 = !DILocation(line: 114, column: 20, scope: !1103)
!1120 = !DILocation(line: 114, column: 25, scope: !1103)
!1121 = !DILocation(line: 114, column: 37, scope: !1103)
!1122 = !DILocation(line: 114, column: 30, scope: !1103)
!1123 = !DILocation(line: 114, column: 6, scope: !1108)
!1124 = !DILocation(line: 114, column: 43, scope: !1103)
!1125 = !DILocation(line: 112, column: 6, scope: !1093)
!1126 = !DILocation(line: 120, column: 10, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1103, file: !541, line: 114, column: 49)
!1128 = !DILocation(line: 120, column: 3, scope: !1127)
!1129 = !DILocation(line: 121, column: 19, scope: !1127)
!1130 = !DILocation(line: 121, column: 25, scope: !1127)
!1131 = !DILocation(line: 121, column: 10, scope: !1127)
!1132 = !DILocation(line: 121, column: 3, scope: !1127)
!1133 = !DILocation(line: 126, column: 21, scope: !1046)
!1134 = !DILocation(line: 126, column: 8, scope: !1046)
!1135 = !DILocation(line: 126, column: 6, scope: !1046)
!1136 = !DILocation(line: 128, column: 6, scope: !1046)
!1137 = !DILocation(line: 129, column: 2, scope: !1046)
!1138 = !DILocation(line: 129, column: 25, scope: !1084)
!1139 = !DILocation(line: 129, column: 30, scope: !1084)
!1140 = !DILocation(line: 129, column: 9, scope: !1084)
!1141 = !DILocation(line: 129, column: 35, scope: !1084)
!1142 = !DILocation(line: 129, column: 42, scope: !1084)
!1143 = !DILocation(line: 130, column: 32, scope: !1046)
!1144 = !DILocation(line: 130, column: 37, scope: !1046)
!1145 = !DILocation(line: 130, column: 9, scope: !1046)
!1146 = !DILocation(line: 130, column: 42, scope: !1046)
!1147 = !DILocation(line: 129, column: 42, scope: !1093)
