; ModuleID = './line19-channels.o.i'
source_filename = "./line19-channels.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)* }
%struct._WI_ITEM_REC = type opaque
%struct._GHashTable = type opaque
%struct._NICK_REC = type { i32, i32, i64, i8*, i8*, i8*, i32, i8, [8 x i8], i8*, %struct._NICK_REC* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !463)
!1 = !DIFile(filename: "line19-channels.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !41, !43, !50, !51, !53, !69, !451, !456}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !48, line: 108, baseType: !49)
!48 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !48, line: 108, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !39, line: 77, baseType: !36)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !39, line: 48, baseType: !52)
!52 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !48, line: 109, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !56, line: 15, size: 1408, align: 64, elements: !57)
!56 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!57 = !{!58, !61, !62, !67, !68, !393, !394, !395, !396, !397, !398, !399, !403, !405, !406, !407, !408, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !59, line: 3, baseType: !60, size: 32, align: 32)
!59 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !55, file: !59, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !55, file: !59, line: 5, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !65, line: 37, baseType: !66)
!65 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !65, line: 37, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !55, file: !59, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !55, file: !59, line: 8, baseType: !69, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !48, line: 107, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !72, line: 30, size: 2240, align: 64, elements: !73)
!72 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !{!74, !76, !77, !78, !306, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !324, !328, !329, !330, !334, !335, !336, !337, !338, !339, !340, !341, !342, !348, !349, !350, !351, !352, !356, !360, !364, !368, !372, !377, !381, !388, !392}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !75, line: 3, baseType: !60, size: 32, align: 32)
!75 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !71, file: !75, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !71, file: !75, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !71, file: !75, line: 8, baseType: !79, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !48, line: 113, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !72, line: 25, size: 1920, align: 64, elements: !82)
!82 = !{!83, !85, !86, !87, !89, !90, !91, !92, !93, !95, !96, !97, !98, !99, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !84, line: 3, baseType: !60, size: 32, align: 32)
!84 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !81, file: !84, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !81, file: !84, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !81, file: !84, line: 9, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !81, file: !84, line: 10, baseType: !60, size: 32, align: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !81, file: !84, line: 11, baseType: !88, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !81, file: !84, line: 13, baseType: !94, size: 16, align: 16, offset: 448)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !81, file: !84, line: 14, baseType: !88, size: 64, align: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !81, file: !84, line: 15, baseType: !88, size: 64, align: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !81, file: !84, line: 16, baseType: !60, size: 32, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !81, file: !84, line: 17, baseType: !88, size: 64, align: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !81, file: !84, line: 19, baseType: !100, size: 64, align: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !48, line: 99, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !48, line: 99, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !81, file: !84, line: 19, baseType: !100, size: 64, align: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !81, file: !84, line: 21, baseType: !88, size: 64, align: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !81, file: !84, line: 22, baseType: !88, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !81, file: !84, line: 23, baseType: !88, size: 64, align: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !81, file: !84, line: 24, baseType: !88, size: 64, align: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !81, file: !84, line: 26, baseType: !88, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !81, file: !84, line: 27, baseType: !88, size: 64, align: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !81, file: !84, line: 28, baseType: !88, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !81, file: !84, line: 29, baseType: !88, size: 64, align: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !81, file: !84, line: 30, baseType: !88, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !81, file: !84, line: 31, baseType: !88, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !81, file: !84, line: 32, baseType: !88, size: 64, align: 64, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !81, file: !84, line: 33, baseType: !88, size: 64, align: 64, offset: 1600)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !81, file: !84, line: 35, baseType: !117, size: 64, align: 64, offset: 1664)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !120)
!120 = !{!121, !123, !263, !264, !269, !270, !271, !272, !273, !282, !283, !284, !288, !289, !290, !291, !292, !293, !294, !295}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !119, file: !4, line: 100, baseType: !122, size: 32, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !39, line: 49, baseType: !60)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !119, file: !4, line: 101, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !127)
!127 = !{!128, !150, !156, !162, !166, !250, !254, !259}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !126, file: !4, line: 133, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !117, !37, !133, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !134, line: 66, baseType: !135)
!134 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !140, line: 42, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !140, line: 44, size: 128, align: 64, elements: !142)
!142 = !{!143, !148, !149}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !141, file: !140, line: 46, baseType: !144, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !134, line: 45, baseType: !147)
!147 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !141, file: !140, line: 47, baseType: !122, size: 32, align: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !140, line: 48, baseType: !37, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !126, file: !4, line: 138, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!132, !117, !154, !133, !136, !137}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !126, file: !4, line: 143, baseType: !157, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!132, !117, !160, !161, !137}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !134, line: 51, baseType: !52)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !126, file: !4, line: 147, baseType: !163, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!132, !117, !137}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !126, file: !4, line: 149, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !117, !249}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !173)
!173 = !{!174, !175, !196, !225, !227, !231, !232, !233, !234, !242, !243, !244, !245}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !172, file: !16, line: 174, baseType: !50, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !172, file: !16, line: 175, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !179)
!179 = !{!180, !184, !185}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !178, file: !16, line: 198, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !50}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !178, file: !16, line: 199, baseType: !181, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !178, file: !16, line: 200, baseType: !186, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !50, !170, !189, !195}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !50}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !39, line: 50, baseType: !122)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !172, file: !16, line: 177, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !201)
!201 = !{!202, !207, !211, !215, !219, !220}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !200, file: !16, line: 216, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!194, !170, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !200, file: !16, line: 218, baseType: !208, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!194, !170}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !200, file: !16, line: 219, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!194, !170, !190, !50}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !200, file: !16, line: 222, baseType: !216, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !170}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !200, file: !16, line: 226, baseType: !190, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !200, file: !16, line: 227, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !172, file: !16, line: 178, baseType: !226, size: 32, align: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !39, line: 55, baseType: !147)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !172, file: !16, line: 180, baseType: !228, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !172, file: !16, line: 182, baseType: !122, size: 32, align: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !16, line: 183, baseType: !226, size: 32, align: 32, offset: 352)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !172, file: !16, line: 184, baseType: !226, size: 32, align: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !172, file: !16, line: 186, baseType: !235, size: 64, align: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !237, line: 37, baseType: !238)
!237 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !237, line: 39, size: 128, align: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !237, line: 41, baseType: !50, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !237, line: 42, baseType: !235, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !16, line: 188, baseType: !170, size: 64, align: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !16, line: 189, baseType: !170, size: 64, align: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !16, line: 191, baseType: !88, size: 64, align: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !172, file: !16, line: 193, baseType: !246, size: 64, align: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !126, file: !4, line: 151, baseType: !251, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !117}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !126, file: !4, line: 152, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!132, !117, !258, !137}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !126, file: !4, line: 155, baseType: !260, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!258, !117}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !119, file: !4, line: 103, baseType: !37, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !119, file: !4, line: 104, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !266, line: 77, baseType: !267)
!266 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !266, line: 77, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !119, file: !4, line: 105, baseType: !265, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !119, file: !4, line: 106, baseType: !37, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !119, file: !4, line: 107, baseType: !226, size: 32, align: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !119, file: !4, line: 109, baseType: !133, size: 64, align: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !119, file: !4, line: 110, baseType: !274, size: 64, align: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !276, line: 39, baseType: !277)
!276 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !276, line: 41, size: 192, align: 64, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !277, file: !276, line: 43, baseType: !37, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !277, file: !276, line: 44, baseType: !133, size: 64, align: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !277, file: !276, line: 45, baseType: !133, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !119, file: !4, line: 111, baseType: !274, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !119, file: !4, line: 112, baseType: !274, size: 64, align: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !119, file: !4, line: 113, baseType: !285, size: 48, align: 8, offset: 704)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, align: 8, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 6)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !119, file: !4, line: 117, baseType: !226, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !119, file: !4, line: 118, baseType: !226, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !119, file: !4, line: 119, baseType: !226, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !119, file: !4, line: 120, baseType: !226, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !119, file: !4, line: 121, baseType: !226, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !119, file: !4, line: 122, baseType: !226, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !119, file: !4, line: 124, baseType: !50, size: 64, align: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !119, file: !4, line: 125, baseType: !50, size: 64, align: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !81, file: !84, line: 38, baseType: !147, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !81, file: !84, line: 39, baseType: !147, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !81, file: !84, line: 40, baseType: !147, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !81, file: !84, line: 41, baseType: !147, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !81, file: !84, line: 42, baseType: !147, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !81, file: !84, line: 43, baseType: !147, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !81, file: !84, line: 44, baseType: !147, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !81, file: !84, line: 45, baseType: !147, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !81, file: !84, line: 46, baseType: !88, size: 64, align: 64, offset: 1792)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !81, file: !84, line: 47, baseType: !88, size: 64, align: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !71, file: !75, line: 9, baseType: !307, size: 64, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !308, line: 75, baseType: !309)
!308 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !310, line: 139, baseType: !52)
!310 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !71, file: !75, line: 10, baseType: !307, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !71, file: !75, line: 12, baseType: !88, size: 64, align: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !71, file: !75, line: 13, baseType: !88, size: 64, align: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !71, file: !75, line: 15, baseType: !147, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !71, file: !75, line: 16, baseType: !147, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !71, file: !75, line: 17, baseType: !147, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !71, file: !75, line: 18, baseType: !147, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !71, file: !75, line: 19, baseType: !147, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !71, file: !75, line: 21, baseType: !320, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !48, line: 102, baseType: !322)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !48, line: 102, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !71, file: !75, line: 22, baseType: !60, size: 32, align: 32, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !71, file: !75, line: 25, baseType: !325, size: 128, align: 64, offset: 640)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, align: 64, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 2)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !71, file: !75, line: 26, baseType: !60, size: 32, align: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !71, file: !75, line: 27, baseType: !60, size: 32, align: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !71, file: !75, line: 29, baseType: !331, size: 64, align: 64, offset: 832)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !48, line: 103, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !48, line: 103, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !71, file: !75, line: 30, baseType: !63, size: 64, align: 64, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !71, file: !75, line: 32, baseType: !88, size: 64, align: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !71, file: !75, line: 33, baseType: !88, size: 64, align: 64, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !71, file: !75, line: 34, baseType: !88, size: 64, align: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !71, file: !75, line: 35, baseType: !147, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !71, file: !75, line: 36, baseType: !147, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !71, file: !75, line: 37, baseType: !147, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !71, file: !75, line: 38, baseType: !147, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !71, file: !75, line: 40, baseType: !343, size: 128, align: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !39, line: 504, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !39, line: 506, size: 128, align: 64, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !344, file: !39, line: 508, baseType: !51, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !344, file: !39, line: 509, baseType: !51, size: 64, align: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !71, file: !75, line: 41, baseType: !307, size: 64, align: 64, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !71, file: !75, line: 42, baseType: !60, size: 32, align: 32, offset: 1408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !71, file: !75, line: 44, baseType: !235, size: 64, align: 64, offset: 1472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !71, file: !75, line: 45, baseType: !235, size: 64, align: 64, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !71, file: !75, line: 53, baseType: !353, size: 64, align: 64, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !69, !41, !60}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !71, file: !75, line: 55, baseType: !357, size: 64, align: 64, offset: 1664)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!60, !69, !40}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !71, file: !75, line: 57, baseType: !361, size: 64, align: 64, offset: 1728)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!60, !69, !41}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !71, file: !75, line: 60, baseType: !365, size: 64, align: 64, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!41, !69}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !71, file: !75, line: 62, baseType: !369, size: 64, align: 64, offset: 1856)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !69, !41, !41, !60}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !71, file: !75, line: 65, baseType: !373, size: 64, align: 64, offset: 1920)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !69, !41, !41}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !71, file: !75, line: 69, baseType: !378, size: 64, align: 64, offset: 1984)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!53, !69, !41}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !71, file: !75, line: 70, baseType: !382, size: 64, align: 64, offset: 2048)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !69, !41}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !48, line: 110, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !48, line: 110, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !71, file: !75, line: 71, baseType: !389, size: 64, align: 64, offset: 2112)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!60, !41, !41}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !71, file: !75, line: 73, baseType: !389, size: 64, align: 64, offset: 2176)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !55, file: !59, line: 9, baseType: !88, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !59, line: 10, baseType: !88, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !55, file: !59, line: 11, baseType: !307, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !55, file: !59, line: 12, baseType: !60, size: 32, align: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !55, file: !59, line: 13, baseType: !88, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !55, file: !59, line: 15, baseType: !43, size: 64, align: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !55, file: !59, line: 17, baseType: !400, size: 64, align: 64, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!41, !46}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !55, file: !404, line: 5, baseType: !88, size: 64, align: 64, offset: 704)
!404 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!405 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !55, file: !404, line: 6, baseType: !88, size: 64, align: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !55, file: !404, line: 7, baseType: !307, size: 64, align: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !55, file: !404, line: 9, baseType: !63, size: 64, align: 64, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !55, file: !404, line: 10, baseType: !409, size: 64, align: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !48, line: 111, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !412, line: 13, size: 576, align: 64, elements: !413)
!412 = !DIFile(filename: "nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!413 = !{!414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !432, !433}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !415, line: 3, baseType: !60, size: 32, align: 32)
!415 = !DIFile(filename: "nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !411, file: !415, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !411, file: !415, line: 6, baseType: !307, size: 64, align: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !411, file: !415, line: 8, baseType: !88, size: 64, align: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !411, file: !415, line: 9, baseType: !88, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !411, file: !415, line: 10, baseType: !88, size: 64, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !411, file: !415, line: 11, baseType: !60, size: 32, align: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !411, file: !415, line: 14, baseType: !147, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !411, file: !415, line: 15, baseType: !147, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !411, file: !415, line: 18, baseType: !147, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !411, file: !415, line: 19, baseType: !147, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !411, file: !415, line: 20, baseType: !147, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !411, file: !415, line: 21, baseType: !147, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !411, file: !415, line: 22, baseType: !429, size: 64, align: 8, offset: 360)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, align: 8, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 8)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !411, file: !415, line: 26, baseType: !36, size: 64, align: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !415, line: 28, baseType: !409, size: 64, align: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !55, file: !404, line: 12, baseType: !147, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !55, file: !404, line: 13, baseType: !88, size: 64, align: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !55, file: !404, line: 14, baseType: !60, size: 32, align: 32, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !55, file: !404, line: 15, baseType: !88, size: 64, align: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !55, file: !404, line: 17, baseType: !147, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !55, file: !404, line: 18, baseType: !147, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !55, file: !404, line: 19, baseType: !147, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !55, file: !404, line: 20, baseType: !147, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !55, file: !404, line: 22, baseType: !147, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !55, file: !404, line: 23, baseType: !147, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !55, file: !404, line: 24, baseType: !147, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !55, file: !404, line: 25, baseType: !147, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !55, file: !404, line: 26, baseType: !147, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !55, file: !404, line: 31, baseType: !448, size: 64, align: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!88, !53}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "FOREACH_FIND_FUNC", file: !452, line: 11, baseType: !453)
!452 = !DIFile(filename: "misc.h", directory: "/home/lichi/Desktop/irssi/task1")
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!36, !36, !36}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !457, line: 9, baseType: !458)
!457 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !461, !461, !461, !461, !461, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!463 = !{!464}
!464 = distinct !DIGlobalVariable(name: "channels", scope: !0, file: !465, line: 31, type: !235, isLocal: false, isDefinition: true, variable: %struct._GSList** @channels)
!465 = !DIFile(filename: "channels.c", directory: "/home/lichi/Desktop/irssi/task1")
!466 = !{i32 2, !"Dwarf Version", i32 4}
!467 = !{i32 2, !"Debug Info Version", i32 3}
!468 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!469 = distinct !DISubprogram(name: "channel_init", scope: !465, file: !465, line: 43, type: !470, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !53, !69, !41, !41, !60}
!472 = !{}
!473 = !DILocalVariable(name: "channel", arg: 1, scope: !469, file: !465, line: 43, type: !53)
!474 = !DIExpression()
!475 = !DILocation(line: 43, column: 32, scope: !469)
!476 = !DILocalVariable(name: "server", arg: 2, scope: !469, file: !465, line: 43, type: !69)
!477 = !DILocation(line: 43, column: 53, scope: !469)
!478 = !DILocalVariable(name: "name", arg: 3, scope: !469, file: !465, line: 43, type: !41)
!479 = !DILocation(line: 43, column: 73, scope: !469)
!480 = !DILocalVariable(name: "visible_name", arg: 4, scope: !469, file: !465, line: 44, type: !41)
!481 = !DILocation(line: 44, column: 17, scope: !469)
!482 = !DILocalVariable(name: "automatic", arg: 5, scope: !469, file: !465, line: 44, type: !60)
!483 = !DILocation(line: 44, column: 35, scope: !469)
!484 = !DILocation(line: 46, column: 2, scope: !469)
!485 = distinct !{!485, !484}
!486 = !DILocation(line: 46, column: 10, scope: !487)
!487 = !DILexicalBlockFile(scope: !488, file: !465, discriminator: 1)
!488 = distinct !DILexicalBlock(scope: !489, file: !465, line: 46, column: 10)
!489 = distinct !DILexicalBlock(scope: !469, file: !465, line: 46, column: 4)
!490 = !DILocation(line: 46, column: 18, scope: !487)
!491 = !DILocation(line: 46, column: 5, scope: !492)
!492 = !DILexicalBlockFile(scope: !493, file: !465, discriminator: 2)
!493 = distinct !DILexicalBlock(scope: !488, file: !465, line: 46, column: 3)
!494 = !DILocation(line: 46, column: 14, scope: !495)
!495 = !DILexicalBlockFile(scope: !496, file: !465, discriminator: 3)
!496 = distinct !DILexicalBlock(scope: !488, file: !465, line: 46, column: 12)
!497 = !DILocation(line: 46, column: 102, scope: !495)
!498 = !DILocation(line: 46, column: 113, scope: !499)
!499 = !DILexicalBlockFile(scope: !489, file: !465, discriminator: 4)
!500 = !DILocation(line: 47, column: 2, scope: !469)
!501 = distinct !{!501, !500}
!502 = !DILocation(line: 47, column: 10, scope: !503)
!503 = !DILexicalBlockFile(scope: !504, file: !465, discriminator: 1)
!504 = distinct !DILexicalBlock(scope: !505, file: !465, line: 47, column: 10)
!505 = distinct !DILexicalBlock(scope: !469, file: !465, line: 47, column: 4)
!506 = !DILocation(line: 47, column: 15, scope: !503)
!507 = !DILocation(line: 47, column: 5, scope: !508)
!508 = !DILexicalBlockFile(scope: !509, file: !465, discriminator: 2)
!509 = distinct !DILexicalBlock(scope: !504, file: !465, line: 47, column: 3)
!510 = !DILocation(line: 47, column: 14, scope: !511)
!511 = !DILexicalBlockFile(scope: !512, file: !465, discriminator: 3)
!512 = distinct !DILexicalBlock(scope: !504, file: !465, line: 47, column: 12)
!513 = !DILocation(line: 47, column: 99, scope: !511)
!514 = !DILocation(line: 47, column: 110, scope: !515)
!515 = !DILexicalBlockFile(scope: !505, file: !465, discriminator: 4)
!516 = !DILocation(line: 48, column: 2, scope: !469)
!517 = distinct !{!517, !516}
!518 = !DILocation(line: 48, column: 10, scope: !519)
!519 = !DILexicalBlockFile(scope: !520, file: !465, discriminator: 1)
!520 = distinct !DILexicalBlock(scope: !521, file: !465, line: 48, column: 10)
!521 = distinct !DILexicalBlock(scope: !469, file: !465, line: 48, column: 4)
!522 = !DILocation(line: 48, column: 17, scope: !519)
!523 = !DILocation(line: 48, column: 5, scope: !524)
!524 = !DILexicalBlockFile(scope: !525, file: !465, discriminator: 2)
!525 = distinct !DILexicalBlock(scope: !520, file: !465, line: 48, column: 3)
!526 = !DILocation(line: 48, column: 14, scope: !527)
!527 = !DILexicalBlockFile(scope: !528, file: !465, discriminator: 3)
!528 = distinct !DILexicalBlock(scope: !520, file: !465, line: 48, column: 12)
!529 = !DILocation(line: 48, column: 101, scope: !527)
!530 = !DILocation(line: 48, column: 112, scope: !531)
!531 = !DILexicalBlockFile(scope: !521, file: !465, discriminator: 4)
!532 = !DILocation(line: 50, column: 6, scope: !533)
!533 = distinct !DILexicalBlock(scope: !469, file: !465, line: 50, column: 6)
!534 = !DILocation(line: 50, column: 19, scope: !533)
!535 = !DILocation(line: 50, column: 6, scope: !469)
!536 = !DILocation(line: 51, column: 18, scope: !533)
!537 = !DILocation(line: 51, column: 16, scope: !533)
!538 = !DILocation(line: 51, column: 3, scope: !533)
!539 = !DILocation(line: 53, column: 34, scope: !469)
!540 = !DILocation(line: 53, column: 10, scope: !469)
!541 = !DILocation(line: 53, column: 20, scope: !469)
!542 = !DILocation(line: 53, column: 32, scope: !469)
!543 = !DILocation(line: 54, column: 18, scope: !469)
!544 = !DILocation(line: 54, column: 2, scope: !469)
!545 = !DILocation(line: 54, column: 11, scope: !469)
!546 = !DILocation(line: 54, column: 16, scope: !469)
!547 = !DILocation(line: 55, column: 9, scope: !469)
!548 = !DILocation(line: 55, column: 18, scope: !469)
!549 = !DILocation(line: 55, column: 26, scope: !469)
!550 = !DILocation(line: 56, column: 2, scope: !469)
!551 = !DILocation(line: 56, column: 11, scope: !469)
!552 = !DILocation(line: 56, column: 22, scope: !469)
!553 = !DILocation(line: 57, column: 9, scope: !469)
!554 = !DILocation(line: 57, column: 18, scope: !469)
!555 = !DILocation(line: 57, column: 32, scope: !469)
!556 = !DILocation(line: 59, column: 23, scope: !469)
!557 = !DILocation(line: 59, column: 31, scope: !469)
!558 = !DILocation(line: 59, column: 2, scope: !469)
!559 = !DILocation(line: 59, column: 11, scope: !469)
!560 = !DILocation(line: 59, column: 21, scope: !469)
!561 = !DILocation(line: 60, column: 20, scope: !469)
!562 = !DILocation(line: 60, column: 2, scope: !469)
!563 = !DILocation(line: 60, column: 11, scope: !469)
!564 = !DILocation(line: 60, column: 18, scope: !469)
!565 = !DILocation(line: 61, column: 27, scope: !469)
!566 = !DILocation(line: 61, column: 18, scope: !469)
!567 = !DILocation(line: 61, column: 2, scope: !469)
!568 = !DILocation(line: 61, column: 11, scope: !469)
!569 = !DILocation(line: 61, column: 16, scope: !469)
!570 = !DILocation(line: 62, column: 35, scope: !469)
!571 = !DILocation(line: 62, column: 26, scope: !469)
!572 = !DILocation(line: 62, column: 2, scope: !469)
!573 = !DILocation(line: 62, column: 11, scope: !469)
!574 = !DILocation(line: 62, column: 24, scope: !469)
!575 = !DILocation(line: 63, column: 18, scope: !469)
!576 = !DILocation(line: 63, column: 2, scope: !469)
!577 = !DILocation(line: 63, column: 11, scope: !469)
!578 = !DILocation(line: 63, column: 16, scope: !469)
!579 = !DILocation(line: 64, column: 24, scope: !469)
!580 = !DILocation(line: 64, column: 2, scope: !469)
!581 = !DILocation(line: 64, column: 11, scope: !469)
!582 = !DILocation(line: 64, column: 22, scope: !469)
!583 = !DILocation(line: 66, column: 28, scope: !469)
!584 = !DILocation(line: 66, column: 38, scope: !469)
!585 = !DILocation(line: 66, column: 13, scope: !469)
!586 = !DILocation(line: 66, column: 11, scope: !469)
!587 = !DILocation(line: 67, column: 36, scope: !469)
!588 = !DILocation(line: 67, column: 44, scope: !469)
!589 = !DILocation(line: 67, column: 54, scope: !469)
!590 = !DILocation(line: 67, column: 21, scope: !469)
!591 = !DILocation(line: 67, column: 2, scope: !469)
!592 = !DILocation(line: 67, column: 10, scope: !469)
!593 = !DILocation(line: 67, column: 19, scope: !469)
!594 = !DILocation(line: 69, column: 36, scope: !469)
!595 = !DILocation(line: 69, column: 66, scope: !469)
!596 = !DILocation(line: 69, column: 57, scope: !469)
!597 = !DILocation(line: 69, column: 46, scope: !469)
!598 = !DILocation(line: 69, column: 2, scope: !469)
!599 = !DILocation(line: 70, column: 1, scope: !469)
!600 = !DILocation(line: 70, column: 1, scope: !601)
!601 = !DILexicalBlockFile(scope: !469, file: !465, discriminator: 1)
!602 = distinct !DISubprogram(name: "channel_destroy", scope: !465, file: !465, line: 72, type: !603, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !53}
!605 = !DILocalVariable(name: "channel", arg: 1, scope: !602, file: !465, line: 72, type: !53)
!606 = !DILocation(line: 72, column: 35, scope: !602)
!607 = !DILocation(line: 74, column: 2, scope: !602)
!608 = distinct !{!608, !607}
!609 = !DILocation(line: 74, column: 53, scope: !610)
!610 = !DILexicalBlockFile(scope: !611, file: !465, discriminator: 1)
!611 = distinct !DILexicalBlock(scope: !612, file: !465, line: 74, column: 10)
!612 = distinct !DILexicalBlock(scope: !602, file: !465, line: 74, column: 4)
!613 = !DILocation(line: 74, column: 28, scope: !610)
!614 = !DILocation(line: 74, column: 12, scope: !610)
!615 = !DILocation(line: 74, column: 10, scope: !610)
!616 = !DILocation(line: 74, column: 11, scope: !617)
!617 = !DILexicalBlockFile(scope: !611, file: !465, discriminator: 2)
!618 = !DILocation(line: 74, column: 10, scope: !619)
!619 = !DILexicalBlockFile(scope: !612, file: !465, discriminator: 3)
!620 = !DILocation(line: 74, column: 54, scope: !621)
!621 = !DILexicalBlockFile(scope: !622, file: !465, discriminator: 4)
!622 = distinct !DILexicalBlock(scope: !611, file: !465, line: 74, column: 52)
!623 = !DILocation(line: 74, column: 63, scope: !624)
!624 = !DILexicalBlockFile(scope: !625, file: !465, discriminator: 5)
!625 = distinct !DILexicalBlock(scope: !611, file: !465, line: 74, column: 61)
!626 = !DILocation(line: 74, column: 155, scope: !624)
!627 = !DILocation(line: 74, column: 166, scope: !628)
!628 = !DILexicalBlockFile(scope: !612, file: !465, discriminator: 6)
!629 = !DILocation(line: 76, column: 6, scope: !630)
!630 = distinct !DILexicalBlock(scope: !602, file: !465, line: 76, column: 6)
!631 = !DILocation(line: 76, column: 15, scope: !630)
!632 = !DILocation(line: 76, column: 6, scope: !602)
!633 = !DILocation(line: 76, column: 27, scope: !634)
!634 = !DILexicalBlockFile(scope: !630, file: !465, discriminator: 1)
!635 = !DILocation(line: 77, column: 2, scope: !602)
!636 = !DILocation(line: 77, column: 11, scope: !602)
!637 = !DILocation(line: 77, column: 22, scope: !602)
!638 = !DILocation(line: 79, column: 28, scope: !602)
!639 = !DILocation(line: 79, column: 38, scope: !602)
!640 = !DILocation(line: 79, column: 13, scope: !602)
!641 = !DILocation(line: 79, column: 11, scope: !602)
!642 = !DILocation(line: 81, column: 18, scope: !602)
!643 = !DILocation(line: 81, column: 27, scope: !602)
!644 = !DILocation(line: 81, column: 35, scope: !602)
!645 = !DILocation(line: 81, column: 45, scope: !602)
!646 = !DILocation(line: 81, column: 3, scope: !602)
!647 = !DILocation(line: 80, column: 2, scope: !602)
!648 = !DILocation(line: 80, column: 11, scope: !602)
!649 = !DILocation(line: 80, column: 19, scope: !602)
!650 = !DILocation(line: 80, column: 28, scope: !602)
!651 = !DILocation(line: 83, column: 38, scope: !602)
!652 = !DILocation(line: 83, column: 2, scope: !602)
!653 = !DILocation(line: 85, column: 31, scope: !602)
!654 = !DILocation(line: 85, column: 41, scope: !602)
!655 = !DILocation(line: 85, column: 9, scope: !602)
!656 = !DILocation(line: 86, column: 9, scope: !602)
!657 = !DILocation(line: 86, column: 18, scope: !602)
!658 = !DILocation(line: 86, column: 2, scope: !602)
!659 = !DILocation(line: 87, column: 9, scope: !602)
!660 = !DILocation(line: 87, column: 18, scope: !602)
!661 = !DILocation(line: 87, column: 2, scope: !602)
!662 = !DILocation(line: 88, column: 9, scope: !602)
!663 = !DILocation(line: 88, column: 18, scope: !602)
!664 = !DILocation(line: 88, column: 2, scope: !602)
!665 = !DILocation(line: 89, column: 9, scope: !602)
!666 = !DILocation(line: 89, column: 18, scope: !602)
!667 = !DILocation(line: 89, column: 2, scope: !602)
!668 = !DILocation(line: 90, column: 9, scope: !602)
!669 = !DILocation(line: 90, column: 18, scope: !602)
!670 = !DILocation(line: 90, column: 2, scope: !602)
!671 = !DILocation(line: 91, column: 9, scope: !602)
!672 = !DILocation(line: 91, column: 18, scope: !602)
!673 = !DILocation(line: 91, column: 2, scope: !602)
!674 = !DILocation(line: 92, column: 9, scope: !602)
!675 = !DILocation(line: 92, column: 18, scope: !602)
!676 = !DILocation(line: 92, column: 2, scope: !602)
!677 = !DILocation(line: 94, column: 9, scope: !602)
!678 = !DILocation(line: 94, column: 18, scope: !602)
!679 = !DILocation(line: 94, column: 23, scope: !602)
!680 = !DILocation(line: 95, column: 9, scope: !602)
!681 = !DILocation(line: 95, column: 2, scope: !602)
!682 = !DILocation(line: 96, column: 1, scope: !602)
!683 = !DILocation(line: 96, column: 1, scope: !684)
!684 = !DILexicalBlockFile(scope: !602, file: !465, discriminator: 1)
!685 = distinct !DISubprogram(name: "channel_get_target", scope: !465, file: !465, line: 38, type: !401, isLocal: true, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!686 = !DILocalVariable(name: "item", arg: 1, scope: !685, file: !465, line: 38, type: !46)
!687 = !DILocation(line: 38, column: 52, scope: !685)
!688 = !DILocation(line: 40, column: 26, scope: !685)
!689 = !DILocation(line: 40, column: 33, scope: !685)
!690 = !DILocation(line: 40, column: 2, scope: !685)
!691 = distinct !DISubprogram(name: "get_join_data", scope: !465, file: !465, line: 33, type: !449, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!692 = !DILocalVariable(name: "channel", arg: 1, scope: !691, file: !465, line: 33, type: !53)
!693 = !DILocation(line: 33, column: 41, scope: !691)
!694 = !DILocation(line: 35, column: 18, scope: !691)
!695 = !DILocation(line: 35, column: 27, scope: !691)
!696 = !DILocation(line: 35, column: 9, scope: !691)
!697 = !DILocation(line: 35, column: 2, scope: !691)
!698 = distinct !DISubprogram(name: "channel_find", scope: !465, file: !465, line: 120, type: !379, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!699 = !DILocalVariable(name: "server", arg: 1, scope: !698, file: !465, line: 120, type: !69)
!700 = !DILocation(line: 120, column: 39, scope: !698)
!701 = !DILocalVariable(name: "name", arg: 2, scope: !698, file: !465, line: 120, type: !41)
!702 = !DILocation(line: 120, column: 59, scope: !698)
!703 = !DILocation(line: 122, column: 2, scope: !698)
!704 = distinct !{!704, !703}
!705 = !DILocation(line: 122, column: 10, scope: !706)
!706 = !DILexicalBlockFile(scope: !707, file: !465, discriminator: 1)
!707 = distinct !DILexicalBlock(scope: !708, file: !465, line: 122, column: 10)
!708 = distinct !DILexicalBlock(scope: !698, file: !465, line: 122, column: 4)
!709 = !DILocation(line: 122, column: 17, scope: !706)
!710 = !DILocation(line: 122, column: 1, scope: !706)
!711 = !DILocation(line: 122, column: 39, scope: !712)
!712 = !DILexicalBlockFile(scope: !707, file: !465, discriminator: 2)
!713 = !DILocation(line: 122, column: 21, scope: !712)
!714 = !DILocation(line: 122, column: 6, scope: !712)
!715 = !DILocation(line: 122, column: 10, scope: !712)
!716 = !DILocation(line: 122, column: 5, scope: !717)
!717 = !DILexicalBlockFile(scope: !707, file: !465, discriminator: 3)
!718 = !DILocation(line: 122, column: 10, scope: !719)
!719 = !DILexicalBlockFile(scope: !708, file: !465, discriminator: 4)
!720 = !DILocation(line: 122, column: 33, scope: !721)
!721 = !DILexicalBlockFile(scope: !722, file: !465, discriminator: 5)
!722 = distinct !DILexicalBlock(scope: !707, file: !465, line: 122, column: 31)
!723 = !DILocation(line: 122, column: 42, scope: !724)
!724 = !DILexicalBlockFile(scope: !725, file: !465, discriminator: 6)
!725 = distinct !DILexicalBlock(scope: !707, file: !465, line: 122, column: 40)
!726 = !DILocation(line: 122, column: 150, scope: !724)
!727 = !DILocation(line: 122, column: 7, scope: !728)
!728 = !DILexicalBlockFile(scope: !708, file: !465, discriminator: 7)
!729 = !DILocation(line: 123, column: 2, scope: !698)
!730 = distinct !{!730, !729}
!731 = !DILocation(line: 123, column: 10, scope: !732)
!732 = !DILexicalBlockFile(scope: !733, file: !465, discriminator: 1)
!733 = distinct !DILexicalBlock(scope: !734, file: !465, line: 123, column: 10)
!734 = distinct !DILexicalBlock(scope: !698, file: !465, line: 123, column: 4)
!735 = !DILocation(line: 123, column: 15, scope: !732)
!736 = !DILocation(line: 123, column: 5, scope: !737)
!737 = !DILexicalBlockFile(scope: !738, file: !465, discriminator: 2)
!738 = distinct !DILexicalBlock(scope: !733, file: !465, line: 123, column: 3)
!739 = !DILocation(line: 123, column: 14, scope: !740)
!740 = !DILexicalBlockFile(scope: !741, file: !465, discriminator: 3)
!741 = distinct !DILexicalBlock(scope: !733, file: !465, line: 123, column: 12)
!742 = !DILocation(line: 123, column: 99, scope: !740)
!743 = !DILocation(line: 123, column: 7, scope: !744)
!744 = !DILexicalBlockFile(scope: !734, file: !465, discriminator: 4)
!745 = !DILocation(line: 125, column: 6, scope: !746)
!746 = distinct !DILexicalBlock(scope: !698, file: !465, line: 125, column: 6)
!747 = !DILocation(line: 125, column: 13, scope: !746)
!748 = !DILocation(line: 125, column: 6, scope: !698)
!749 = !DILocation(line: 126, column: 30, scope: !746)
!750 = !DILocation(line: 126, column: 38, scope: !746)
!751 = !DILocation(line: 126, column: 10, scope: !746)
!752 = !DILocation(line: 126, column: 3, scope: !746)
!753 = !DILocation(line: 129, column: 29, scope: !698)
!754 = !DILocation(line: 131, column: 17, scope: !698)
!755 = !DILocation(line: 129, column: 9, scope: !698)
!756 = !DILocation(line: 129, column: 2, scope: !698)
!757 = !DILocation(line: 132, column: 1, scope: !698)
!758 = distinct !DISubprogram(name: "channel_find_server", scope: !465, file: !465, line: 98, type: !379, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!759 = !DILocalVariable(name: "server", arg: 1, scope: !758, file: !465, line: 98, type: !69)
!760 = !DILocation(line: 98, column: 53, scope: !758)
!761 = !DILocalVariable(name: "name", arg: 2, scope: !758, file: !465, line: 99, type: !41)
!762 = !DILocation(line: 99, column: 18, scope: !758)
!763 = !DILocalVariable(name: "tmp", scope: !758, file: !465, line: 101, type: !235)
!764 = !DILocation(line: 101, column: 10, scope: !758)
!765 = !DILocation(line: 103, column: 2, scope: !758)
!766 = distinct !{!766, !765}
!767 = !DILocation(line: 103, column: 45, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !465, discriminator: 1)
!769 = distinct !DILexicalBlock(scope: !770, file: !465, line: 103, column: 10)
!770 = distinct !DILexicalBlock(scope: !758, file: !465, line: 103, column: 4)
!771 = !DILocation(line: 103, column: 27, scope: !768)
!772 = !DILocation(line: 103, column: 12, scope: !768)
!773 = !DILocation(line: 103, column: 10, scope: !768)
!774 = !DILocation(line: 103, column: 11, scope: !775)
!775 = !DILexicalBlockFile(scope: !769, file: !465, discriminator: 2)
!776 = !DILocation(line: 103, column: 10, scope: !777)
!777 = !DILexicalBlockFile(scope: !770, file: !465, discriminator: 3)
!778 = !DILocation(line: 103, column: 33, scope: !779)
!779 = !DILexicalBlockFile(scope: !780, file: !465, discriminator: 4)
!780 = distinct !DILexicalBlock(scope: !769, file: !465, line: 103, column: 31)
!781 = !DILocation(line: 103, column: 42, scope: !782)
!782 = !DILexicalBlockFile(scope: !783, file: !465, discriminator: 5)
!783 = distinct !DILexicalBlock(scope: !769, file: !465, line: 103, column: 40)
!784 = !DILocation(line: 103, column: 132, scope: !782)
!785 = !DILocation(line: 103, column: 7, scope: !786)
!786 = !DILexicalBlockFile(scope: !770, file: !465, discriminator: 6)
!787 = !DILocation(line: 105, column: 6, scope: !788)
!788 = distinct !DILexicalBlock(scope: !758, file: !465, line: 105, column: 6)
!789 = !DILocation(line: 105, column: 14, scope: !788)
!790 = !DILocation(line: 105, column: 32, scope: !788)
!791 = !DILocation(line: 105, column: 6, scope: !758)
!792 = !DILocation(line: 107, column: 10, scope: !793)
!793 = distinct !DILexicalBlock(scope: !788, file: !465, line: 105, column: 40)
!794 = !DILocation(line: 107, column: 18, scope: !793)
!795 = !DILocation(line: 107, column: 36, scope: !793)
!796 = !DILocation(line: 107, column: 44, scope: !793)
!797 = !DILocation(line: 107, column: 3, scope: !793)
!798 = !DILocation(line: 110, column: 13, scope: !799)
!799 = distinct !DILexicalBlock(scope: !758, file: !465, line: 110, column: 2)
!800 = !DILocation(line: 110, column: 21, scope: !799)
!801 = !DILocation(line: 110, column: 11, scope: !799)
!802 = !DILocation(line: 110, column: 7, scope: !799)
!803 = !DILocation(line: 110, column: 31, scope: !804)
!804 = !DILexicalBlockFile(scope: !805, file: !465, discriminator: 1)
!805 = distinct !DILexicalBlock(scope: !799, file: !465, line: 110, column: 2)
!806 = !DILocation(line: 110, column: 35, scope: !804)
!807 = !DILocation(line: 110, column: 2, scope: !804)
!808 = !DILocalVariable(name: "rec", scope: !809, file: !465, line: 111, type: !53)
!809 = distinct !DILexicalBlock(scope: !805, file: !465, line: 110, column: 60)
!810 = !DILocation(line: 111, column: 16, scope: !809)
!811 = !DILocation(line: 111, column: 22, scope: !809)
!812 = !DILocation(line: 111, column: 27, scope: !809)
!813 = !DILocation(line: 113, column: 26, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !465, line: 113, column: 7)
!815 = !DILocation(line: 113, column: 32, scope: !814)
!816 = !DILocation(line: 113, column: 37, scope: !814)
!817 = !DILocation(line: 113, column: 7, scope: !814)
!818 = !DILocation(line: 113, column: 43, scope: !814)
!819 = !DILocation(line: 113, column: 7, scope: !809)
!820 = !DILocation(line: 114, column: 11, scope: !814)
!821 = !DILocation(line: 114, column: 4, scope: !814)
!822 = !DILocation(line: 115, column: 2, scope: !809)
!823 = !DILocation(line: 110, column: 49, scope: !824)
!824 = !DILexicalBlockFile(scope: !805, file: !465, discriminator: 2)
!825 = !DILocation(line: 110, column: 54, scope: !824)
!826 = !DILocation(line: 110, column: 47, scope: !824)
!827 = !DILocation(line: 110, column: 2, scope: !824)
!828 = distinct !{!828, !829}
!829 = !DILocation(line: 110, column: 2, scope: !758)
!830 = !DILocation(line: 117, column: 2, scope: !758)
!831 = !DILocation(line: 118, column: 1, scope: !758)
!832 = distinct !DISubprogram(name: "channel_change_name", scope: !465, file: !465, line: 134, type: !833, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !53, !41}
!835 = !DILocalVariable(name: "channel", arg: 1, scope: !832, file: !465, line: 134, type: !53)
!836 = !DILocation(line: 134, column: 39, scope: !832)
!837 = !DILocalVariable(name: "name", arg: 2, scope: !832, file: !465, line: 134, type: !41)
!838 = !DILocation(line: 134, column: 60, scope: !832)
!839 = !DILocation(line: 136, column: 2, scope: !832)
!840 = distinct !{!840, !839}
!841 = !DILocation(line: 136, column: 53, scope: !842)
!842 = !DILexicalBlockFile(scope: !843, file: !465, discriminator: 1)
!843 = distinct !DILexicalBlock(scope: !844, file: !465, line: 136, column: 10)
!844 = distinct !DILexicalBlock(scope: !832, file: !465, line: 136, column: 4)
!845 = !DILocation(line: 136, column: 28, scope: !842)
!846 = !DILocation(line: 136, column: 12, scope: !842)
!847 = !DILocation(line: 136, column: 10, scope: !842)
!848 = !DILocation(line: 136, column: 11, scope: !849)
!849 = !DILexicalBlockFile(scope: !843, file: !465, discriminator: 2)
!850 = !DILocation(line: 136, column: 10, scope: !851)
!851 = !DILexicalBlockFile(scope: !844, file: !465, discriminator: 3)
!852 = !DILocation(line: 136, column: 54, scope: !853)
!853 = !DILexicalBlockFile(scope: !854, file: !465, discriminator: 4)
!854 = distinct !DILexicalBlock(scope: !843, file: !465, line: 136, column: 52)
!855 = !DILocation(line: 136, column: 63, scope: !856)
!856 = !DILexicalBlockFile(scope: !857, file: !465, discriminator: 5)
!857 = distinct !DILexicalBlock(scope: !843, file: !465, line: 136, column: 61)
!858 = !DILocation(line: 136, column: 155, scope: !856)
!859 = !DILocation(line: 136, column: 166, scope: !860)
!860 = !DILexicalBlockFile(scope: !844, file: !465, discriminator: 6)
!861 = !DILocation(line: 138, column: 9, scope: !832)
!862 = !DILocation(line: 138, column: 18, scope: !832)
!863 = !DILocation(line: 138, column: 2, scope: !832)
!864 = !DILocation(line: 139, column: 27, scope: !832)
!865 = !DILocation(line: 139, column: 18, scope: !832)
!866 = !DILocation(line: 139, column: 2, scope: !832)
!867 = !DILocation(line: 139, column: 11, scope: !832)
!868 = !DILocation(line: 139, column: 16, scope: !832)
!869 = !DILocation(line: 141, column: 41, scope: !832)
!870 = !DILocation(line: 141, column: 2, scope: !832)
!871 = !DILocation(line: 142, column: 1, scope: !832)
!872 = !DILocation(line: 142, column: 1, scope: !873)
!873 = !DILexicalBlockFile(scope: !832, file: !465, discriminator: 1)
!874 = distinct !DISubprogram(name: "channel_change_visible_name", scope: !465, file: !465, line: 144, type: !833, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!875 = !DILocalVariable(name: "channel", arg: 1, scope: !874, file: !465, line: 144, type: !53)
!876 = !DILocation(line: 144, column: 47, scope: !874)
!877 = !DILocalVariable(name: "name", arg: 2, scope: !874, file: !465, line: 144, type: !41)
!878 = !DILocation(line: 144, column: 68, scope: !874)
!879 = !DILocation(line: 146, column: 2, scope: !874)
!880 = distinct !{!880, !879}
!881 = !DILocation(line: 146, column: 53, scope: !882)
!882 = !DILexicalBlockFile(scope: !883, file: !465, discriminator: 1)
!883 = distinct !DILexicalBlock(scope: !884, file: !465, line: 146, column: 10)
!884 = distinct !DILexicalBlock(scope: !874, file: !465, line: 146, column: 4)
!885 = !DILocation(line: 146, column: 28, scope: !882)
!886 = !DILocation(line: 146, column: 12, scope: !882)
!887 = !DILocation(line: 146, column: 10, scope: !882)
!888 = !DILocation(line: 146, column: 11, scope: !889)
!889 = !DILexicalBlockFile(scope: !883, file: !465, discriminator: 2)
!890 = !DILocation(line: 146, column: 10, scope: !891)
!891 = !DILexicalBlockFile(scope: !884, file: !465, discriminator: 3)
!892 = !DILocation(line: 146, column: 54, scope: !893)
!893 = !DILexicalBlockFile(scope: !894, file: !465, discriminator: 4)
!894 = distinct !DILexicalBlock(scope: !883, file: !465, line: 146, column: 52)
!895 = !DILocation(line: 146, column: 63, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !465, discriminator: 5)
!897 = distinct !DILexicalBlock(scope: !883, file: !465, line: 146, column: 61)
!898 = !DILocation(line: 146, column: 155, scope: !896)
!899 = !DILocation(line: 146, column: 166, scope: !900)
!900 = !DILexicalBlockFile(scope: !884, file: !465, discriminator: 6)
!901 = !DILocation(line: 148, column: 9, scope: !874)
!902 = !DILocation(line: 148, column: 18, scope: !874)
!903 = !DILocation(line: 148, column: 2, scope: !874)
!904 = !DILocation(line: 149, column: 35, scope: !874)
!905 = !DILocation(line: 149, column: 26, scope: !874)
!906 = !DILocation(line: 149, column: 2, scope: !874)
!907 = !DILocation(line: 149, column: 11, scope: !874)
!908 = !DILocation(line: 149, column: 24, scope: !874)
!909 = !DILocation(line: 151, column: 45, scope: !874)
!910 = !DILocation(line: 151, column: 2, scope: !874)
!911 = !DILocation(line: 152, column: 1, scope: !874)
!912 = !DILocation(line: 152, column: 1, scope: !913)
!913 = !DILexicalBlockFile(scope: !874, file: !465, discriminator: 1)
!914 = distinct !DISubprogram(name: "channel_send_autocommands", scope: !465, file: !465, line: 233, type: !603, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !472)
!915 = !DILocalVariable(name: "channel", arg: 1, scope: !914, file: !465, line: 233, type: !53)
!916 = !DILocation(line: 233, column: 45, scope: !914)
!917 = !DILocalVariable(name: "rec", scope: !914, file: !465, line: 235, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !48, line: 115, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !921, line: 12, size: 512, align: 64, elements: !922)
!921 = !DIFile(filename: "channels-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!922 = !{!923, !925, !926, !927, !928, !929, !930, !931, !932}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !924, line: 1, baseType: !60, size: 32, align: 32)
!924 = !DIFile(filename: "channel-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!925 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !920, file: !924, line: 2, baseType: !60, size: 32, align: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !924, line: 4, baseType: !88, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !920, file: !924, line: 5, baseType: !88, size: 64, align: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !920, file: !924, line: 6, baseType: !88, size: 64, align: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "botmasks", scope: !920, file: !924, line: 8, baseType: !88, size: 64, align: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "autosendcmd", scope: !920, file: !924, line: 9, baseType: !88, size: 64, align: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "autojoin", scope: !920, file: !924, line: 11, baseType: !147, size: 1, align: 32, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !920, file: !924, line: 12, baseType: !63, size: 64, align: 64, offset: 448)
!933 = !DILocation(line: 235, column: 21, scope: !914)
!934 = !DILocation(line: 237, column: 2, scope: !914)
!935 = distinct !{!935, !934}
!936 = !DILocation(line: 237, column: 53, scope: !937)
!937 = !DILexicalBlockFile(scope: !938, file: !465, discriminator: 1)
!938 = distinct !DILexicalBlock(scope: !939, file: !465, line: 237, column: 10)
!939 = distinct !DILexicalBlock(scope: !914, file: !465, line: 237, column: 4)
!940 = !DILocation(line: 237, column: 28, scope: !937)
!941 = !DILocation(line: 237, column: 12, scope: !937)
!942 = !DILocation(line: 237, column: 10, scope: !937)
!943 = !DILocation(line: 237, column: 11, scope: !944)
!944 = !DILexicalBlockFile(scope: !938, file: !465, discriminator: 2)
!945 = !DILocation(line: 237, column: 10, scope: !946)
!946 = !DILexicalBlockFile(scope: !939, file: !465, discriminator: 3)
!947 = !DILocation(line: 237, column: 54, scope: !948)
!948 = !DILexicalBlockFile(scope: !949, file: !465, discriminator: 4)
!949 = distinct !DILexicalBlock(scope: !938, file: !465, line: 237, column: 52)
!950 = !DILocation(line: 237, column: 63, scope: !951)
!951 = !DILexicalBlockFile(scope: !952, file: !465, discriminator: 5)
!952 = distinct !DILexicalBlock(scope: !938, file: !465, line: 237, column: 61)
!953 = !DILocation(line: 237, column: 155, scope: !951)
!954 = !DILocation(line: 237, column: 166, scope: !955)
!955 = !DILexicalBlockFile(scope: !939, file: !465, discriminator: 6)
!956 = !DILocation(line: 239, column: 6, scope: !957)
!957 = distinct !DILexicalBlock(scope: !914, file: !465, line: 239, column: 6)
!958 = !DILocation(line: 239, column: 15, scope: !957)
!959 = !DILocation(line: 239, column: 6, scope: !914)
!960 = !DILocation(line: 240, column: 3, scope: !957)
!961 = !DILocation(line: 242, column: 27, scope: !914)
!962 = !DILocation(line: 242, column: 36, scope: !914)
!963 = !DILocation(line: 242, column: 42, scope: !914)
!964 = !DILocation(line: 242, column: 51, scope: !914)
!965 = !DILocation(line: 242, column: 59, scope: !914)
!966 = !DILocation(line: 242, column: 68, scope: !914)
!967 = !DILocation(line: 242, column: 8, scope: !914)
!968 = !DILocation(line: 242, column: 6, scope: !914)
!969 = !DILocation(line: 243, column: 6, scope: !970)
!970 = distinct !DILexicalBlock(scope: !914, file: !465, line: 243, column: 6)
!971 = !DILocation(line: 243, column: 10, scope: !970)
!972 = !DILocation(line: 243, column: 17, scope: !970)
!973 = !DILocation(line: 243, column: 20, scope: !974)
!974 = !DILexicalBlockFile(scope: !970, file: !465, discriminator: 1)
!975 = !DILocation(line: 243, column: 25, scope: !974)
!976 = !DILocation(line: 243, column: 37, scope: !974)
!977 = !DILocation(line: 243, column: 45, scope: !974)
!978 = !DILocation(line: 243, column: 50, scope: !979)
!979 = !DILexicalBlockFile(scope: !970, file: !465, discriminator: 2)
!980 = !DILocation(line: 243, column: 55, scope: !979)
!981 = !DILocation(line: 243, column: 49, scope: !979)
!982 = !DILocation(line: 243, column: 6, scope: !979)
!983 = !DILocation(line: 244, column: 3, scope: !970)
!984 = !DILocation(line: 252, column: 6, scope: !985)
!985 = distinct !DILexicalBlock(scope: !914, file: !465, line: 252, column: 6)
!986 = !DILocation(line: 252, column: 11, scope: !985)
!987 = !DILocation(line: 252, column: 20, scope: !985)
!988 = !DILocation(line: 252, column: 27, scope: !985)
!989 = !DILocation(line: 252, column: 32, scope: !990)
!990 = !DILexicalBlockFile(scope: !985, file: !465, discriminator: 1)
!991 = !DILocation(line: 252, column: 37, scope: !990)
!992 = !DILocation(line: 252, column: 31, scope: !990)
!993 = !DILocation(line: 252, column: 6, scope: !990)
!994 = !DILocation(line: 254, column: 23, scope: !995)
!995 = distinct !DILexicalBlock(scope: !985, file: !465, line: 252, column: 47)
!996 = !DILocation(line: 254, column: 28, scope: !995)
!997 = !DILocation(line: 254, column: 45, scope: !995)
