; ModuleID = './line159-servers-redirect.o.i'
source_filename = "./line159-servers-redirect.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct._REDIRECT_REC = type { %struct.REDIRECT_CMD_REC*, i64, i32, i8*, i8, i8*, i32, i8*, i8*, i8*, i8*, %struct._GSList* }
%struct.REDIRECT_CMD_REC = type { i8*, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, globals: !745)
!1 = !DIFile(filename: "line159-servers-redirect.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 46, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61}
!50 = !DIEnumerator(name: "_ISupper", value: 256)
!51 = !DIEnumerator(name: "_ISlower", value: 512)
!52 = !DIEnumerator(name: "_ISalpha", value: 1024)
!53 = !DIEnumerator(name: "_ISdigit", value: 2048)
!54 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!55 = !DIEnumerator(name: "_ISspace", value: 8192)
!56 = !DIEnumerator(name: "_ISprint", value: 16384)
!57 = !DIEnumerator(name: "_ISgraph", value: 32768)
!58 = !DIEnumerator(name: "_ISblank", value: 1)
!59 = !DIEnumerator(name: "_IScntrl", value: 2)
!60 = !DIEnumerator(name: "_ISpunct", value: 4)
!61 = !DIEnumerator(name: "_ISalnum", value: 8)
!62 = !{!63, !69, !68, !70, !72, !75, !77, !98, !401, !605, !724, !731, !735, !740, !85, !744, !123, !152}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !64, line: 88, baseType: !65)
!64 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !68}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !64, line: 77, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !64, line: 48, baseType: !71)
!71 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !64, line: 46, baseType: !74)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_CMD_REC", file: !79, line: 43, baseType: !80)
!79 = !DIFile(filename: "servers-redirect.c", directory: "/home/lichi/Desktop/irssi/task1")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 36, size: 384, align: 64, elements: !81)
!81 = !{!82, !84, !86, !87, !88, !96, !97}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !79, line: 37, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !80, file: !79, line: 38, baseType: !85, size: 32, align: 32, offset: 64)
!85 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !80, file: !79, line: 40, baseType: !85, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !80, file: !79, line: 41, baseType: !85, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !80, file: !79, line: 42, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !91, line: 37, baseType: !92)
!91 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !91, line: 39, size: 128, align: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !91, line: 41, baseType: !68, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !92, file: !91, line: 42, baseType: !89, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !80, file: !79, line: 42, baseType: !89, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "opt", scope: !80, file: !79, line: 42, baseType: !89, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !100, line: 6, baseType: !101)
!100 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !102, line: 42, size: 39168, align: 64, elements: !103)
!102 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !{!104, !106, !107, !108, !341, !346, !347, !348, !349, !350, !351, !352, !353, !354, !358, !359, !363, !364, !365, !375, !380, !381, !382, !383, !384, !385, !386, !387, !393, !394, !395, !396, !397, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !721, !723}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !105, line: 3, baseType: !85, size: 32, align: 32)
!105 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !101, file: !105, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !101, file: !105, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !101, file: !105, line: 8, baseType: !109, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !100, line: 5, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !102, line: 24, size: 2496, align: 64, elements: !112)
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !124, !125, !126, !127, !128, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !114, line: 3, baseType: !85, size: 32, align: 32)
!114 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !111, file: !114, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !111, file: !114, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !111, file: !114, line: 9, baseType: !83, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !111, file: !114, line: 10, baseType: !85, size: 32, align: 32, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !111, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !111, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !111, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !111, file: !114, line: 13, baseType: !123, size: 16, align: 16, offset: 448)
!123 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !111, file: !114, line: 14, baseType: !83, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !111, file: !114, line: 15, baseType: !83, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !111, file: !114, line: 16, baseType: !85, size: 32, align: 32, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !111, file: !114, line: 17, baseType: !83, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !111, file: !114, line: 19, baseType: !129, size: 64, align: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !131, line: 99, baseType: !132)
!131 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !131, line: 99, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !111, file: !114, line: 19, baseType: !129, size: 64, align: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !111, file: !114, line: 21, baseType: !83, size: 64, align: 64, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !111, file: !114, line: 22, baseType: !83, size: 64, align: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !111, file: !114, line: 23, baseType: !83, size: 64, align: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !111, file: !114, line: 24, baseType: !83, size: 64, align: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !111, file: !114, line: 26, baseType: !83, size: 64, align: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !111, file: !114, line: 27, baseType: !83, size: 64, align: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !111, file: !114, line: 28, baseType: !83, size: 64, align: 64, offset: 1280)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !111, file: !114, line: 29, baseType: !83, size: 64, align: 64, offset: 1344)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !111, file: !114, line: 30, baseType: !83, size: 64, align: 64, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !111, file: !114, line: 31, baseType: !83, size: 64, align: 64, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !111, file: !114, line: 32, baseType: !83, size: 64, align: 64, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !111, file: !114, line: 33, baseType: !83, size: 64, align: 64, offset: 1600)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !111, file: !114, line: 35, baseType: !147, size: 64, align: 64, offset: 1664)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !150)
!150 = !{!151, !153, !286, !287, !292, !293, !294, !295, !296, !305, !306, !307, !311, !312, !313, !314, !315, !316, !317, !318}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !149, file: !4, line: 100, baseType: !152, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !64, line: 49, baseType: !85)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !149, file: !4, line: 101, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !157)
!157 = !{!158, !180, !186, !192, !196, !273, !277, !282}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !156, file: !4, line: 133, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !147, !72, !163, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !164, line: 66, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!165 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !170, line: 42, baseType: !171)
!170 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !170, line: 44, size: 128, align: 64, elements: !172)
!172 = !{!173, !178, !179}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !171, file: !170, line: 46, baseType: !174, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !175, line: 36, baseType: !176)
!175 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !164, line: 45, baseType: !177)
!177 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !171, file: !170, line: 47, baseType: !152, size: 32, align: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !171, file: !170, line: 48, baseType: !72, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !156, file: !4, line: 138, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!162, !147, !184, !163, !166, !167}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !156, file: !4, line: 143, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!162, !147, !190, !191, !167}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !164, line: 51, baseType: !71)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !156, file: !4, line: 147, baseType: !193, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!162, !147, !167}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !156, file: !4, line: 149, baseType: !197, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !147, !272}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !203)
!203 = !{!204, !205, !226, !255, !257, !261, !262, !263, !264, !265, !266, !267, !268}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !202, file: !16, line: 174, baseType: !68, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !202, file: !16, line: 175, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !209)
!209 = !{!210, !214, !215}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !208, file: !16, line: 198, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !68}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !208, file: !16, line: 199, baseType: !211, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !208, file: !16, line: 200, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !68, !200, !219, !225}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !68}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !64, line: 50, baseType: !152)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !202, file: !16, line: 177, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !231)
!231 = !{!232, !237, !241, !245, !249, !250}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !230, file: !16, line: 216, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!224, !200, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !230, file: !16, line: 218, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!224, !200}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !230, file: !16, line: 219, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!224, !200, !220, !68}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !230, file: !16, line: 222, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !200}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !230, file: !16, line: 226, baseType: !220, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !230, file: !16, line: 227, baseType: !251, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !202, file: !16, line: 178, baseType: !256, size: 32, align: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !64, line: 55, baseType: !177)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !202, file: !16, line: 180, baseType: !258, size: 64, align: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !202, file: !16, line: 182, baseType: !152, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !16, line: 183, baseType: !256, size: 32, align: 32, offset: 352)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !202, file: !16, line: 184, baseType: !256, size: 32, align: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !202, file: !16, line: 186, baseType: !89, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !16, line: 188, baseType: !200, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !16, line: 189, baseType: !200, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !16, line: 191, baseType: !83, size: 64, align: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !202, file: !16, line: 193, baseType: !269, size: 64, align: 64, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !156, file: !4, line: 151, baseType: !274, size: 64, align: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !147}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !156, file: !4, line: 152, baseType: !278, size: 64, align: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!162, !147, !281, !167}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !156, file: !4, line: 155, baseType: !283, size: 64, align: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!281, !147}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !149, file: !4, line: 103, baseType: !72, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !149, file: !4, line: 104, baseType: !288, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !289, line: 77, baseType: !290)
!289 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !289, line: 77, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !149, file: !4, line: 105, baseType: !288, size: 64, align: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !149, file: !4, line: 106, baseType: !72, size: 64, align: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !149, file: !4, line: 107, baseType: !256, size: 32, align: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !149, file: !4, line: 109, baseType: !163, size: 64, align: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !149, file: !4, line: 110, baseType: !297, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !299, line: 39, baseType: !300)
!299 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !299, line: 41, size: 192, align: 64, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !300, file: !299, line: 43, baseType: !72, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !300, file: !299, line: 44, baseType: !163, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !300, file: !299, line: 45, baseType: !163, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !149, file: !4, line: 111, baseType: !297, size: 64, align: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !149, file: !4, line: 112, baseType: !297, size: 64, align: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !149, file: !4, line: 113, baseType: !308, size: 48, align: 8, offset: 704)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 48, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 6)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !149, file: !4, line: 117, baseType: !256, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !149, file: !4, line: 118, baseType: !256, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !149, file: !4, line: 119, baseType: !256, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !149, file: !4, line: 120, baseType: !256, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !149, file: !4, line: 121, baseType: !256, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !149, file: !4, line: 122, baseType: !256, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !149, file: !4, line: 124, baseType: !68, size: 64, align: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !149, file: !4, line: 125, baseType: !68, size: 64, align: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !111, file: !114, line: 38, baseType: !177, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !111, file: !114, line: 39, baseType: !177, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !111, file: !114, line: 40, baseType: !177, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !111, file: !114, line: 41, baseType: !177, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !111, file: !114, line: 42, baseType: !177, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !111, file: !114, line: 43, baseType: !177, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !111, file: !114, line: 44, baseType: !177, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !111, file: !114, line: 45, baseType: !177, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !111, file: !114, line: 46, baseType: !83, size: 64, align: 64, offset: 1792)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !111, file: !114, line: 47, baseType: !83, size: 64, align: 64, offset: 1856)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !111, file: !102, line: 27, baseType: !83, size: 64, align: 64, offset: 1920)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !111, file: !102, line: 28, baseType: !83, size: 64, align: 64, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !111, file: !102, line: 30, baseType: !85, size: 32, align: 32, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !111, file: !102, line: 31, baseType: !83, size: 64, align: 64, offset: 2112)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !111, file: !102, line: 32, baseType: !83, size: 64, align: 64, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !111, file: !102, line: 34, baseType: !85, size: 32, align: 32, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !111, file: !102, line: 35, baseType: !85, size: 32, align: 32, offset: 2272)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !111, file: !102, line: 36, baseType: !85, size: 32, align: 32, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !111, file: !102, line: 38, baseType: !85, size: 32, align: 32, offset: 2336)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !111, file: !102, line: 38, baseType: !85, size: 32, align: 32, offset: 2368)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !111, file: !102, line: 38, baseType: !85, size: 32, align: 32, offset: 2400)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !111, file: !102, line: 38, baseType: !85, size: 32, align: 32, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !101, file: !105, line: 9, baseType: !342, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !343, line: 75, baseType: !344)
!343 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !345, line: 139, baseType: !71)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !101, file: !105, line: 10, baseType: !342, size: 64, align: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !101, file: !105, line: 12, baseType: !83, size: 64, align: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !101, file: !105, line: 13, baseType: !83, size: 64, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !101, file: !105, line: 15, baseType: !177, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !101, file: !105, line: 16, baseType: !177, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !101, file: !105, line: 17, baseType: !177, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !101, file: !105, line: 18, baseType: !177, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !101, file: !105, line: 19, baseType: !177, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !101, file: !105, line: 21, baseType: !355, size: 64, align: 64, offset: 512)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !131, line: 102, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !131, line: 102, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !101, file: !105, line: 22, baseType: !85, size: 32, align: 32, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !101, file: !105, line: 25, baseType: !360, size: 128, align: 64, offset: 640)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, align: 64, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 2)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !101, file: !105, line: 26, baseType: !85, size: 32, align: 32, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !101, file: !105, line: 27, baseType: !85, size: 32, align: 32, offset: 800)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !101, file: !105, line: 29, baseType: !366, size: 64, align: 64, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !131, line: 103, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !369, line: 4, size: 192, align: 64, elements: !370)
!369 = !DIFile(filename: "../../../src/core/rawlog.h", directory: "/home/lichi/Desktop/irssi/task1")
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !368, file: !369, line: 5, baseType: !85, size: 32, align: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !368, file: !369, line: 6, baseType: !85, size: 32, align: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !368, file: !369, line: 8, baseType: !85, size: 32, align: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !368, file: !369, line: 9, baseType: !89, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !101, file: !105, line: 30, baseType: !376, size: 64, align: 64, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !378, line: 37, baseType: !379)
!378 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !378, line: 37, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !101, file: !105, line: 32, baseType: !83, size: 64, align: 64, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !101, file: !105, line: 33, baseType: !83, size: 64, align: 64, offset: 1024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !101, file: !105, line: 34, baseType: !83, size: 64, align: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !101, file: !105, line: 35, baseType: !177, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !101, file: !105, line: 36, baseType: !177, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !101, file: !105, line: 37, baseType: !177, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !101, file: !105, line: 38, baseType: !177, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !101, file: !105, line: 40, baseType: !388, size: 128, align: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !64, line: 504, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !64, line: 506, size: 128, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !389, file: !64, line: 508, baseType: !70, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !389, file: !64, line: 509, baseType: !70, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !101, file: !105, line: 41, baseType: !342, size: 64, align: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !101, file: !105, line: 42, baseType: !85, size: 32, align: 32, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !101, file: !105, line: 44, baseType: !89, size: 64, align: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !101, file: !105, line: 45, baseType: !89, size: 64, align: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !101, file: !105, line: 53, baseType: !398, size: 64, align: 64, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401, !75, !85}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !131, line: 107, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !404, line: 30, size: 2240, align: 64, elements: !405)
!404 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!405 = !{!406, !407, !408, !409, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !485, !489, !493, !497, !502, !581, !588, !592}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !105, line: 3, baseType: !85, size: 32, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !403, file: !105, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !403, file: !105, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !403, file: !105, line: 8, baseType: !410, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !131, line: 113, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !404, line: 25, size: 1920, align: 64, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !114, line: 3, baseType: !85, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !412, file: !114, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !412, file: !114, line: 6, baseType: !85, size: 32, align: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !412, file: !114, line: 9, baseType: !83, size: 64, align: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !412, file: !114, line: 10, baseType: !85, size: 32, align: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !412, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !412, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !412, file: !114, line: 11, baseType: !83, size: 64, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !412, file: !114, line: 13, baseType: !123, size: 16, align: 16, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !412, file: !114, line: 14, baseType: !83, size: 64, align: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !412, file: !114, line: 15, baseType: !83, size: 64, align: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !412, file: !114, line: 16, baseType: !85, size: 32, align: 32, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !412, file: !114, line: 17, baseType: !83, size: 64, align: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !412, file: !114, line: 19, baseType: !129, size: 64, align: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !412, file: !114, line: 19, baseType: !129, size: 64, align: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !412, file: !114, line: 21, baseType: !83, size: 64, align: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !412, file: !114, line: 22, baseType: !83, size: 64, align: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !412, file: !114, line: 23, baseType: !83, size: 64, align: 64, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !412, file: !114, line: 24, baseType: !83, size: 64, align: 64, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !412, file: !114, line: 26, baseType: !83, size: 64, align: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !412, file: !114, line: 27, baseType: !83, size: 64, align: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !412, file: !114, line: 28, baseType: !83, size: 64, align: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !412, file: !114, line: 29, baseType: !83, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !412, file: !114, line: 30, baseType: !83, size: 64, align: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !412, file: !114, line: 31, baseType: !83, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !412, file: !114, line: 32, baseType: !83, size: 64, align: 64, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !412, file: !114, line: 33, baseType: !83, size: 64, align: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !412, file: !114, line: 35, baseType: !147, size: 64, align: 64, offset: 1664)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !412, file: !114, line: 38, baseType: !177, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !412, file: !114, line: 39, baseType: !177, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !412, file: !114, line: 40, baseType: !177, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !412, file: !114, line: 41, baseType: !177, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !412, file: !114, line: 42, baseType: !177, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !412, file: !114, line: 43, baseType: !177, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !412, file: !114, line: 44, baseType: !177, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !412, file: !114, line: 45, baseType: !177, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !412, file: !114, line: 46, baseType: !83, size: 64, align: 64, offset: 1792)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !412, file: !114, line: 47, baseType: !83, size: 64, align: 64, offset: 1856)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !403, file: !105, line: 9, baseType: !342, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !403, file: !105, line: 10, baseType: !342, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !403, file: !105, line: 12, baseType: !83, size: 64, align: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !403, file: !105, line: 13, baseType: !83, size: 64, align: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !403, file: !105, line: 15, baseType: !177, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !403, file: !105, line: 16, baseType: !177, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !403, file: !105, line: 17, baseType: !177, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !403, file: !105, line: 18, baseType: !177, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !403, file: !105, line: 19, baseType: !177, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !403, file: !105, line: 21, baseType: !355, size: 64, align: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !403, file: !105, line: 22, baseType: !85, size: 32, align: 32, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !403, file: !105, line: 25, baseType: !360, size: 128, align: 64, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !403, file: !105, line: 26, baseType: !85, size: 32, align: 32, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !403, file: !105, line: 27, baseType: !85, size: 32, align: 32, offset: 800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !403, file: !105, line: 29, baseType: !366, size: 64, align: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !403, file: !105, line: 30, baseType: !376, size: 64, align: 64, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !403, file: !105, line: 32, baseType: !83, size: 64, align: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !403, file: !105, line: 33, baseType: !83, size: 64, align: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !403, file: !105, line: 34, baseType: !83, size: 64, align: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !403, file: !105, line: 35, baseType: !177, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !403, file: !105, line: 36, baseType: !177, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !403, file: !105, line: 37, baseType: !177, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !403, file: !105, line: 38, baseType: !177, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !403, file: !105, line: 40, baseType: !388, size: 128, align: 64, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !403, file: !105, line: 41, baseType: !342, size: 64, align: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !403, file: !105, line: 42, baseType: !85, size: 32, align: 32, offset: 1408)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !403, file: !105, line: 44, baseType: !89, size: 64, align: 64, offset: 1472)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !403, file: !105, line: 45, baseType: !89, size: 64, align: 64, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !403, file: !105, line: 53, baseType: !398, size: 64, align: 64, offset: 1600)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !403, file: !105, line: 55, baseType: !482, size: 64, align: 64, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!85, !401, !74}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !403, file: !105, line: 57, baseType: !486, size: 64, align: 64, offset: 1728)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!85, !401, !75}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !403, file: !105, line: 60, baseType: !490, size: 64, align: 64, offset: 1792)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!75, !401}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !403, file: !105, line: 62, baseType: !494, size: 64, align: 64, offset: 1856)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !401, !75, !75, !85}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !403, file: !105, line: 65, baseType: !498, size: 64, align: 64, offset: 1920)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !401, !75, !75}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !403, file: !105, line: 69, baseType: !503, size: 64, align: 64, offset: 1984)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !401, !75}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !131, line: 109, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !509, line: 15, size: 1408, align: 64, elements: !510)
!509 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!510 = !{!511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !529, !533, !535, !536, !537, !538, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !512, line: 3, baseType: !85, size: 32, align: 32)
!512 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !508, file: !512, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !508, file: !512, line: 5, baseType: !376, size: 64, align: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !508, file: !512, line: 7, baseType: !69, size: 64, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !508, file: !512, line: 8, baseType: !401, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !508, file: !512, line: 9, baseType: !83, size: 64, align: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !512, line: 10, baseType: !83, size: 64, align: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !508, file: !512, line: 11, baseType: !342, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !508, file: !512, line: 12, baseType: !85, size: 32, align: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !508, file: !512, line: 13, baseType: !83, size: 64, align: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !508, file: !512, line: 15, baseType: !523, size: 64, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !131, line: 108, baseType: !528)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !131, line: 108, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !508, file: !512, line: 17, baseType: !530, size: 64, align: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!75, !526}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !508, file: !534, line: 5, baseType: !83, size: 64, align: 64, offset: 704)
!534 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !508, file: !534, line: 6, baseType: !83, size: 64, align: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !508, file: !534, line: 7, baseType: !342, size: 64, align: 64, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !508, file: !534, line: 9, baseType: !376, size: 64, align: 64, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !508, file: !534, line: 10, baseType: !539, size: 64, align: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !131, line: 111, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !542, line: 13, size: 576, align: 64, elements: !543)
!542 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!543 = !{!544, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !562, !563}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !545, line: 3, baseType: !85, size: 32, align: 32)
!545 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!546 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !541, file: !545, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !541, file: !545, line: 6, baseType: !342, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !541, file: !545, line: 8, baseType: !83, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !541, file: !545, line: 9, baseType: !83, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !541, file: !545, line: 10, baseType: !83, size: 64, align: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !541, file: !545, line: 11, baseType: !85, size: 32, align: 32, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !541, file: !545, line: 14, baseType: !177, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !541, file: !545, line: 15, baseType: !177, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !541, file: !545, line: 18, baseType: !177, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !541, file: !545, line: 19, baseType: !177, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !541, file: !545, line: 20, baseType: !177, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !541, file: !545, line: 21, baseType: !177, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !541, file: !545, line: 22, baseType: !559, size: 64, align: 8, offset: 360)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, align: 8, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !541, file: !545, line: 26, baseType: !69, size: 64, align: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !545, line: 28, baseType: !539, size: 64, align: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !508, file: !534, line: 12, baseType: !177, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !508, file: !534, line: 13, baseType: !83, size: 64, align: 64, offset: 1088)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !508, file: !534, line: 14, baseType: !85, size: 32, align: 32, offset: 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !508, file: !534, line: 15, baseType: !83, size: 64, align: 64, offset: 1216)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !508, file: !534, line: 17, baseType: !177, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !508, file: !534, line: 18, baseType: !177, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !508, file: !534, line: 19, baseType: !177, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !508, file: !534, line: 20, baseType: !177, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !508, file: !534, line: 22, baseType: !177, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !508, file: !534, line: 23, baseType: !177, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !508, file: !534, line: 24, baseType: !177, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !508, file: !534, line: 25, baseType: !177, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !508, file: !534, line: 26, baseType: !177, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !508, file: !534, line: 31, baseType: !578, size: 64, align: 64, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!83, !506}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !403, file: !105, line: 70, baseType: !582, size: 64, align: 64, offset: 2048)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !401, !75}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !131, line: 110, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !131, line: 110, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !403, file: !105, line: 71, baseType: !589, size: 64, align: 64, offset: 2112)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!85, !75, !75}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !403, file: !105, line: 73, baseType: !589, size: 64, align: 64, offset: 2176)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !101, file: !105, line: 55, baseType: !482, size: 64, align: 64, offset: 1664)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !101, file: !105, line: 57, baseType: !486, size: 64, align: 64, offset: 1728)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !101, file: !105, line: 60, baseType: !490, size: 64, align: 64, offset: 1792)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !101, file: !105, line: 62, baseType: !494, size: 64, align: 64, offset: 1856)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !101, file: !105, line: 65, baseType: !498, size: 64, align: 64, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !101, file: !105, line: 69, baseType: !503, size: 64, align: 64, offset: 1984)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !101, file: !105, line: 70, baseType: !582, size: 64, align: 64, offset: 2048)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !101, file: !105, line: 71, baseType: !589, size: 64, align: 64, offset: 2112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !101, file: !105, line: 73, baseType: !589, size: 64, align: 64, offset: 2176)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !101, file: !102, line: 46, baseType: !89, size: 64, align: 64, offset: 2240)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !101, file: !102, line: 47, baseType: !89, size: 64, align: 64, offset: 2304)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !101, file: !102, line: 48, baseType: !605, size: 64, align: 64, offset: 2368)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !100, line: 8, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !79, line: 45, size: 768, align: 64, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !607, file: !79, line: 46, baseType: !77, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !607, file: !79, line: 47, baseType: !342, size: 64, align: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "failures", scope: !607, file: !79, line: 48, baseType: !85, size: 32, align: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !607, file: !79, line: 49, baseType: !83, size: 64, align: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !607, file: !79, line: 51, baseType: !177, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "aborted", scope: !607, file: !79, line: 52, baseType: !177, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !607, file: !79, line: 53, baseType: !177, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "first_signal_sent", scope: !607, file: !79, line: 54, baseType: !177, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !607, file: !79, line: 56, baseType: !83, size: 64, align: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !607, file: !79, line: 57, baseType: !85, size: 32, align: 32, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "failure_signal", scope: !607, file: !79, line: 58, baseType: !83, size: 64, align: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "default_signal", scope: !607, file: !79, line: 58, baseType: !83, size: 64, align: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "first_signal", scope: !607, file: !79, line: 58, baseType: !83, size: 64, align: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "last_signal", scope: !607, file: !79, line: 58, baseType: !83, size: 64, align: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "signals", scope: !607, file: !79, line: 59, baseType: !89, size: 64, align: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !101, file: !102, line: 49, baseType: !89, size: 64, align: 64, offset: 2432)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !101, file: !102, line: 51, baseType: !83, size: 64, align: 64, offset: 2496)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !101, file: !102, line: 53, baseType: !83, size: 64, align: 64, offset: 2560)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !101, file: !102, line: 54, baseType: !83, size: 64, align: 64, offset: 2624)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !101, file: !102, line: 55, baseType: !83, size: 64, align: 64, offset: 2688)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !101, file: !102, line: 56, baseType: !83, size: 64, align: 64, offset: 2752)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !101, file: !102, line: 57, baseType: !85, size: 32, align: 32, offset: 2816)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !101, file: !102, line: 59, baseType: !177, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !101, file: !102, line: 60, baseType: !177, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !101, file: !102, line: 62, baseType: !177, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !101, file: !102, line: 63, baseType: !177, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !101, file: !102, line: 64, baseType: !177, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !101, file: !102, line: 65, baseType: !177, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !101, file: !102, line: 66, baseType: !177, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !101, file: !102, line: 67, baseType: !177, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !101, file: !102, line: 68, baseType: !177, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !101, file: !102, line: 69, baseType: !177, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !101, file: !102, line: 70, baseType: !177, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !101, file: !102, line: 71, baseType: !177, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !101, file: !102, line: 72, baseType: !177, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !101, file: !102, line: 74, baseType: !85, size: 32, align: 32, offset: 2880)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !101, file: !102, line: 75, baseType: !85, size: 32, align: 32, offset: 2912)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !101, file: !102, line: 76, baseType: !85, size: 32, align: 32, offset: 2944)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !101, file: !102, line: 77, baseType: !85, size: 32, align: 32, offset: 2976)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !101, file: !102, line: 79, baseType: !376, size: 64, align: 64, offset: 3008)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !101, file: !102, line: 80, baseType: !89, size: 64, align: 64, offset: 3072)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !101, file: !102, line: 81, baseType: !89, size: 64, align: 64, offset: 3136)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !101, file: !102, line: 83, baseType: !297, size: 64, align: 64, offset: 3200)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !101, file: !102, line: 84, baseType: !256, size: 32, align: 32, offset: 3264)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !101, file: !102, line: 87, baseType: !85, size: 32, align: 32, offset: 3296)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !101, file: !102, line: 91, baseType: !89, size: 64, align: 64, offset: 3328)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !101, file: !102, line: 92, baseType: !388, size: 128, align: 64, offset: 3392)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !101, file: !102, line: 93, baseType: !388, size: 128, align: 64, offset: 3520)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !101, file: !102, line: 95, baseType: !85, size: 32, align: 32, offset: 3648)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !101, file: !102, line: 96, baseType: !85, size: 32, align: 32, offset: 3680)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !101, file: !102, line: 97, baseType: !85, size: 32, align: 32, offset: 3712)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !101, file: !102, line: 100, baseType: !89, size: 64, align: 64, offset: 3776)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !101, file: !102, line: 103, baseType: !89, size: 64, align: 64, offset: 3840)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !101, file: !102, line: 106, baseType: !89, size: 64, align: 64, offset: 3904)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !101, file: !102, line: 108, baseType: !376, size: 64, align: 64, offset: 3968)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !101, file: !102, line: 109, baseType: !89, size: 64, align: 64, offset: 4032)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !101, file: !102, line: 111, baseType: !89, size: 64, align: 64, offset: 4096)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !101, file: !102, line: 114, baseType: !69, size: 64, align: 64, offset: 4160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !101, file: !102, line: 116, baseType: !376, size: 64, align: 64, offset: 4224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !101, file: !102, line: 117, baseType: !669, size: 32768, align: 64, offset: 4288)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 32768, align: 64, elements: !719)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !671, line: 10, size: 128, align: 64, elements: !672)
!671 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!672 = !{!673, !718}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !670, file: !671, line: 11, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !671, line: 7, baseType: !676)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !678, !75, !74, !74, !83, !297}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !100, line: 7, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !681, line: 15, size: 1600, align: 64, elements: !682)
!681 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !512, line: 3, baseType: !85, size: 32, align: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !680, file: !512, line: 4, baseType: !85, size: 32, align: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !680, file: !512, line: 5, baseType: !376, size: 64, align: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !680, file: !512, line: 7, baseType: !69, size: 64, align: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !680, file: !512, line: 8, baseType: !98, size: 64, align: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !680, file: !512, line: 9, baseType: !83, size: 64, align: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !512, line: 10, baseType: !83, size: 64, align: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !680, file: !512, line: 11, baseType: !342, size: 64, align: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !680, file: !512, line: 12, baseType: !85, size: 32, align: 32, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !680, file: !512, line: 13, baseType: !83, size: 64, align: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !680, file: !512, line: 15, baseType: !523, size: 64, align: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !680, file: !512, line: 17, baseType: !530, size: 64, align: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !680, file: !534, line: 5, baseType: !83, size: 64, align: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !680, file: !534, line: 6, baseType: !83, size: 64, align: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !680, file: !534, line: 7, baseType: !342, size: 64, align: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !680, file: !534, line: 9, baseType: !376, size: 64, align: 64, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !680, file: !534, line: 10, baseType: !539, size: 64, align: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !680, file: !534, line: 12, baseType: !177, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !680, file: !534, line: 13, baseType: !83, size: 64, align: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !680, file: !534, line: 14, baseType: !85, size: 32, align: 32, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !680, file: !534, line: 15, baseType: !83, size: 64, align: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !680, file: !534, line: 17, baseType: !177, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !680, file: !534, line: 18, baseType: !177, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !680, file: !534, line: 19, baseType: !177, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !680, file: !534, line: 20, baseType: !177, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !680, file: !534, line: 22, baseType: !177, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !680, file: !534, line: 23, baseType: !177, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !680, file: !534, line: 24, baseType: !177, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !680, file: !534, line: 25, baseType: !177, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !680, file: !534, line: 26, baseType: !177, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !680, file: !534, line: 31, baseType: !578, size: 64, align: 64, offset: 1344)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !680, file: !681, line: 18, baseType: !89, size: 64, align: 64, offset: 1408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !680, file: !681, line: 20, baseType: !342, size: 64, align: 64, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !680, file: !681, line: 21, baseType: !85, size: 32, align: 32, offset: 1536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !680, file: !681, line: 22, baseType: !85, size: 32, align: 32, offset: 1568)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !670, file: !671, line: 12, baseType: !74, size: 8, align: 8, offset: 64)
!719 = !{!720}
!720 = !DISubrange(count: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !101, file: !102, line: 118, baseType: !722, size: 2048, align: 8, offset: 37056)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !719)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !101, file: !102, line: 120, baseType: !589, size: 64, align: 64, offset: 39104)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !64, line: 90, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!256, !728}
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !64, line: 78, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !64, line: 80, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!152, !728, !728}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !736, line: 9, baseType: !737)
!736 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !729, !729, !729, !729, !729, !729}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !64, line: 91, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !68, !68, !68}
!744 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!745 = !{!746}
!746 = distinct !DIGlobalVariable(name: "command_redirects", scope: !0, file: !79, line: 62, type: !376, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @command_redirects)
!747 = !{i32 2, !"Dwarf Version", i32 4}
!748 = !{i32 2, !"Debug Info Version", i32 3}
!749 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!750 = distinct !DISubprogram(name: "server_redirect_destroy", scope: !79, file: !79, line: 110, type: !751, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !605}
!753 = !{}
!754 = !DILocalVariable(name: "rec", arg: 1, scope: !750, file: !79, line: 110, type: !605)
!755 = !DIExpression()
!756 = !DILocation(line: 110, column: 44, scope: !750)
!757 = !DILocation(line: 112, column: 21, scope: !750)
!758 = !DILocation(line: 112, column: 26, scope: !750)
!759 = !DILocation(line: 112, column: 2, scope: !750)
!760 = !DILocation(line: 114, column: 9, scope: !750)
!761 = !DILocation(line: 114, column: 14, scope: !750)
!762 = !DILocation(line: 114, column: 2, scope: !750)
!763 = !DILocation(line: 115, column: 9, scope: !750)
!764 = !DILocation(line: 115, column: 14, scope: !750)
!765 = !DILocation(line: 115, column: 2, scope: !750)
!766 = !DILocation(line: 116, column: 16, scope: !750)
!767 = !DILocation(line: 116, column: 21, scope: !750)
!768 = !DILocation(line: 116, column: 9, scope: !750)
!769 = !DILocation(line: 117, column: 16, scope: !750)
!770 = !DILocation(line: 117, column: 21, scope: !750)
!771 = !DILocation(line: 117, column: 9, scope: !750)
!772 = !DILocation(line: 118, column: 16, scope: !750)
!773 = !DILocation(line: 118, column: 21, scope: !750)
!774 = !DILocation(line: 118, column: 9, scope: !750)
!775 = !DILocation(line: 119, column: 16, scope: !750)
!776 = !DILocation(line: 119, column: 21, scope: !750)
!777 = !DILocation(line: 119, column: 9, scope: !750)
!778 = !DILocation(line: 120, column: 18, scope: !750)
!779 = !DILocation(line: 120, column: 23, scope: !750)
!780 = !DILocation(line: 120, column: 2, scope: !750)
!781 = !DILocation(line: 121, column: 15, scope: !750)
!782 = !DILocation(line: 121, column: 20, scope: !750)
!783 = !DILocation(line: 121, column: 2, scope: !750)
!784 = !DILocation(line: 122, column: 16, scope: !750)
!785 = !DILocation(line: 122, column: 9, scope: !750)
!786 = !DILocation(line: 123, column: 1, scope: !750)
!787 = distinct !DISubprogram(name: "redirect_cmd_unref", scope: !79, file: !79, line: 104, type: !788, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !753)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !77}
!790 = !DILocalVariable(name: "rec", arg: 1, scope: !787, file: !79, line: 104, type: !77)
!791 = !DILocation(line: 104, column: 50, scope: !787)
!792 = !DILocation(line: 106, column: 8, scope: !793)
!793 = distinct !DILexicalBlock(scope: !787, file: !79, line: 106, column: 6)
!794 = !DILocation(line: 106, column: 13, scope: !793)
!795 = !DILocation(line: 106, column: 6, scope: !793)
!796 = !DILocation(line: 106, column: 22, scope: !793)
!797 = !DILocation(line: 106, column: 6, scope: !787)
!798 = !DILocation(line: 107, column: 38, scope: !793)
!799 = !DILocation(line: 107, column: 17, scope: !793)
!800 = !DILocation(line: 108, column: 1, scope: !787)
!801 = distinct !DISubprogram(name: "server_redirect_register", scope: !79, file: !79, line: 125, type: !802, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !753)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !75, !85, !85, null}
!804 = !DILocalVariable(name: "command", arg: 1, scope: !801, file: !79, line: 125, type: !75)
!805 = !DILocation(line: 125, column: 43, scope: !801)
!806 = !DILocalVariable(name: "remote", arg: 2, scope: !801, file: !79, line: 126, type: !85)
!807 = !DILocation(line: 126, column: 14, scope: !801)
!808 = !DILocalVariable(name: "timeout", arg: 3, scope: !801, file: !79, line: 126, type: !85)
!809 = !DILocation(line: 126, column: 26, scope: !801)
!810 = !DILocalVariable(name: "va", scope: !801, file: !79, line: 128, type: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !812, line: 79, baseType: !813)
!812 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !814, line: 40, baseType: !815)
!814 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/irssi/task1")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 128, baseType: !816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 192, align: 64, elements: !823)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 128, size: 192, align: 64, elements: !818)
!818 = !{!819, !820, !821, !822}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !817, file: !1, line: 128, baseType: !177, size: 32, align: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !817, file: !1, line: 128, baseType: !177, size: 32, align: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !817, file: !1, line: 128, baseType: !69, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !817, file: !1, line: 128, baseType: !69, size: 64, align: 64, offset: 128)
!823 = !{!824}
!824 = !DISubrange(count: 1)
!825 = !DILocation(line: 128, column: 10, scope: !801)
!826 = !DILocalVariable(name: "start", scope: !801, file: !79, line: 129, type: !89)
!827 = !DILocation(line: 129, column: 10, scope: !801)
!828 = !DILocalVariable(name: "stop", scope: !801, file: !79, line: 129, type: !89)
!829 = !DILocation(line: 129, column: 18, scope: !801)
!830 = !DILocalVariable(name: "opt", scope: !801, file: !79, line: 129, type: !89)
!831 = !DILocation(line: 129, column: 25, scope: !801)
!832 = !DILocalVariable(name: "list", scope: !801, file: !79, line: 129, type: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!834 = !DILocation(line: 129, column: 32, scope: !801)
!835 = !DILocalVariable(name: "event", scope: !801, file: !79, line: 130, type: !75)
!836 = !DILocation(line: 130, column: 14, scope: !801)
!837 = !DILocalVariable(name: "argpos", scope: !801, file: !79, line: 131, type: !85)
!838 = !DILocation(line: 131, column: 13, scope: !801)
!839 = !DILocation(line: 133, column: 1, scope: !801)
!840 = !DILocation(line: 134, column: 21, scope: !801)
!841 = !DILocation(line: 134, column: 15, scope: !801)
!842 = !DILocation(line: 134, column: 8, scope: !801)
!843 = !DILocation(line: 134, column: 33, scope: !801)
!844 = !DILocation(line: 135, column: 2, scope: !801)
!845 = !DILocation(line: 136, column: 10, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !79, line: 135, column: 11)
!847 = distinct !DILexicalBlock(scope: !848, file: !79, line: 135, column: 2)
!848 = distinct !DILexicalBlock(scope: !801, file: !79, line: 135, column: 2)
!849 = !DILocation(line: 136, column: 10, scope: !850)
!850 = !DILexicalBlockFile(scope: !846, file: !79, discriminator: 1)
!851 = !DILocation(line: 136, column: 10, scope: !852)
!852 = !DILexicalBlockFile(scope: !846, file: !79, discriminator: 2)
!853 = !DILocation(line: 136, column: 10, scope: !854)
!854 = !DILexicalBlockFile(scope: !846, file: !79, discriminator: 3)
!855 = !DILocation(line: 136, column: 9, scope: !854)
!856 = !DILocation(line: 137, column: 7, scope: !857)
!857 = distinct !DILexicalBlock(scope: !846, file: !79, line: 137, column: 7)
!858 = !DILocation(line: 137, column: 13, scope: !857)
!859 = !DILocation(line: 137, column: 7, scope: !846)
!860 = !DILocation(line: 138, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !79, line: 138, column: 8)
!862 = distinct !DILexicalBlock(scope: !857, file: !79, line: 137, column: 21)
!863 = !DILocation(line: 138, column: 13, scope: !861)
!864 = !DILocation(line: 138, column: 8, scope: !862)
!865 = !DILocation(line: 139, column: 10, scope: !861)
!866 = !DILocation(line: 139, column: 5, scope: !861)
!867 = !DILocation(line: 140, column: 13, scope: !868)
!868 = distinct !DILexicalBlock(scope: !861, file: !79, line: 140, column: 13)
!869 = !DILocation(line: 140, column: 18, scope: !868)
!870 = !DILocation(line: 140, column: 13, scope: !861)
!871 = !DILocation(line: 141, column: 10, scope: !868)
!872 = !DILocation(line: 141, column: 5, scope: !868)
!873 = !DILocation(line: 143, column: 33, scope: !868)
!874 = !DILocation(line: 144, column: 25, scope: !862)
!875 = distinct !{!875, !844}
!876 = !DILocation(line: 147, column: 25, scope: !846)
!877 = !DILocation(line: 147, column: 25, scope: !850)
!878 = !DILocation(line: 147, column: 25, scope: !852)
!879 = !DILocation(line: 147, column: 25, scope: !854)
!880 = !DILocation(line: 147, column: 24, scope: !854)
!881 = !DILocation(line: 148, column: 27, scope: !846)
!882 = !DILocation(line: 148, column: 26, scope: !846)
!883 = !DILocation(line: 148, column: 42, scope: !846)
!884 = !DILocation(line: 148, column: 33, scope: !846)
!885 = !DILocation(line: 148, column: 11, scope: !850)
!886 = !DILocation(line: 148, column: 4, scope: !846)
