; ModuleID = './line364-statusbar-config.o.i'
source_filename = "./line364-statusbar-config.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!115 = !DIEnumerator(name: "TXT_CANT_HIDE_LAST", value: 11)
!116 = !DIEnumerator(name: "TXT_CANT_HIDE_STICKY_WINDOWS", value: 12)
!117 = !DIEnumerator(name: "TXT_CANT_SHOW_STICKY_WINDOWS", value: 13)
!118 = !DIEnumerator(name: "TXT_WINDOW_NOT_STICKY", value: 14)
!119 = !DIEnumerator(name: "TXT_WINDOW_SET_STICKY", value: 15)
!120 = !DIEnumerator(name: "TXT_WINDOW_UNSET_STICKY", value: 16)
!121 = !DIEnumerator(name: "TXT_WINDOW_INFO_STICKY", value: 17)
!122 = !DIEnumerator(name: "TXT_WINDOW_INFO_SCROLL", value: 18)
!123 = !DIEnumerator(name: "TXT_WINDOW_SCROLL", value: 19)
!124 = !DIEnumerator(name: "TXT_WINDOW_SCROLL_UNKNOWN", value: 20)
!125 = !DIEnumerator(name: "TXT_WINDOW_HIDELEVEL", value: 21)
!126 = !DIEnumerator(name: "TXT_FILL_3", value: 22)
!127 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_HEADER", value: 23)
!128 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_FOOTER", value: 24)
!129 = !DIEnumerator(name: "TXT_STATUSBAR_LIST", value: 25)
!130 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_NAME", value: 26)
!131 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_TYPE", value: 27)
!132 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_PLACEMENT", value: 28)
!133 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_POSITION", value: 29)
!134 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_VISIBLE", value: 30)
!135 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_HEADER", value: 31)
!136 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_FOOTER", value: 32)
!137 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_NAME", value: 33)
!138 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_FOUND", value: 34)
!139 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_ENABLED", value: 35)
!140 = !DIEnumerator(name: "TXT_STATUSBAR_ITEM_NOT_FOUND", value: 36)
!141 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_COMMAND", value: 37)
!142 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_TYPE", value: 38)
!143 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_PLACEMENT", value: 39)
!144 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_VISIBILITY", value: 40)
!145 = !DIEnumerator(name: "TXT_FILL_4", value: 41)
!146 = !DIEnumerator(name: "TXT_PASTE_WARNING", value: 42)
!147 = !DIEnumerator(name: "TXT_PASTE_PROMPT", value: 43)
!148 = !DIEnumerator(name: "TXT_FILL_5", value: 44)
!149 = !DIEnumerator(name: "TXT_IRSSI_BANNER", value: 45)
!150 = !DIEnumerator(name: "TXT_WELCOME_FIRSTTIME", value: 46)
!151 = !DIEnumerator(name: "TXT_WELCOME_INIT_SETTINGS", value: 47)
!152 = !DIEnumerator(name: "TXT_COUNT", value: 48)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !154, line: 25, size: 32, align: 32, elements: !155)
!154 = !DIFile(filename: "../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!156 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!157 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!158 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!159 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!160 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!161 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!162 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!163 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!164 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!165 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!166 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!167 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!168 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!169 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!170 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!171 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!172 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!173 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!174 = !{!175, !176, !183, !185, !187, !190, !192, !212, !221}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !177, line: 9, baseType: !178)
!177 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181, !181, !181, !181, !181, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !184, line: 77, baseType: !175)
!184 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !184, line: 48, baseType: !186)
!186 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !184, line: 46, baseType: !189)
!189 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_CONFIG_REC", file: !194, line: 47, baseType: !195)
!194 = !DIFile(filename: "statusbar.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 38, size: 256, align: 64, elements: !196)
!196 = !{!197, !199, !201, !202, !203, !204}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !194, line: 39, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !194, line: 41, baseType: !200, size: 32, align: 32, offset: 64)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "placement", scope: !195, file: !194, line: 42, baseType: !200, size: 32, align: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !195, file: !194, line: 43, baseType: !200, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !195, file: !194, line: 44, baseType: !200, size: 32, align: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !195, file: !194, line: 46, baseType: !205, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !207, line: 37, baseType: !208)
!207 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !207, line: 39, size: 128, align: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !207, line: 41, baseType: !183, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !207, line: 42, baseType: !205, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBAR_ITEM_CONFIG_REC", file: !194, line: 69, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 63, size: 192, align: 64, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !194, line: 64, baseType: !198, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !214, file: !194, line: 65, baseType: !198, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !214, file: !194, line: 67, baseType: !200, size: 32, align: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "right_alignment", scope: !214, file: !194, line: 68, baseType: !220, size: 1, align: 32, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!220 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !184, line: 49, baseType: !200)
!222 = !{i32 2, !"Dwarf Version", i32 4}
!223 = !{i32 2, !"Debug Info Version", i32 3}
!224 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!225 = distinct !DISubprogram(name: "statusbar_config_destroy", scope: !226, file: !226, line: 78, type: !227, isLocal: false, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!226 = !DIFile(filename: "statusbar-config.c", directory: "/home/lichi/Desktop/irssi/task1")
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229, !192}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_GROUP_REC", file: !194, line: 36, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !194, line: 32, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !194, line: 33, baseType: !198, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "config_bars", scope: !231, file: !194, line: 34, baseType: !205, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bars", scope: !231, file: !194, line: 35, baseType: !205, size: 64, align: 64, offset: 128)
!236 = !{}
!237 = !DILocalVariable(name: "group", arg: 1, scope: !225, file: !226, line: 78, type: !229)
!238 = !DIExpression()
!239 = !DILocation(line: 78, column: 52, scope: !225)
!240 = !DILocalVariable(name: "config", arg: 2, scope: !225, file: !226, line: 79, type: !192)
!241 = !DILocation(line: 79, column: 32, scope: !225)
!242 = !DILocation(line: 81, column: 38, scope: !225)
!243 = !DILocation(line: 81, column: 45, scope: !225)
!244 = !DILocation(line: 81, column: 58, scope: !225)
!245 = !DILocation(line: 81, column: 23, scope: !225)
!246 = !DILocation(line: 81, column: 2, scope: !225)
!247 = !DILocation(line: 81, column: 9, scope: !225)
!248 = !DILocation(line: 81, column: 21, scope: !225)
!249 = !DILocation(line: 83, column: 2, scope: !225)
!250 = !DILocation(line: 83, column: 9, scope: !251)
!251 = !DILexicalBlockFile(scope: !225, file: !226, discriminator: 1)
!252 = !DILocation(line: 83, column: 17, scope: !251)
!253 = !DILocation(line: 83, column: 23, scope: !251)
!254 = !DILocation(line: 83, column: 2, scope: !251)
!255 = !DILocation(line: 84, column: 33, scope: !225)
!256 = !DILocation(line: 84, column: 41, scope: !225)
!257 = !DILocation(line: 84, column: 49, scope: !225)
!258 = !DILocation(line: 84, column: 56, scope: !225)
!259 = !DILocation(line: 84, column: 3, scope: !225)
!260 = !DILocation(line: 83, column: 2, scope: !261)
!261 = !DILexicalBlockFile(scope: !225, file: !226, discriminator: 2)
!262 = distinct !{!262, !249}
!263 = !DILocation(line: 86, column: 9, scope: !225)
!264 = !DILocation(line: 86, column: 17, scope: !225)
!265 = !DILocation(line: 86, column: 2, scope: !225)
!266 = !DILocation(line: 87, column: 16, scope: !225)
!267 = !DILocation(line: 87, column: 9, scope: !225)
!268 = !DILocation(line: 88, column: 1, scope: !225)
!269 = distinct !DISubprogram(name: "statusbar_config_item_destroy", scope: !226, file: !226, line: 69, type: !270, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !192, !212}
!272 = !DILocalVariable(name: "barconfig", arg: 1, scope: !269, file: !226, line: 69, type: !192)
!273 = !DILocation(line: 69, column: 65, scope: !269)
!274 = !DILocalVariable(name: "itemconfig", arg: 2, scope: !269, file: !226, line: 70, type: !212)
!275 = !DILocation(line: 70, column: 30, scope: !269)
!276 = !DILocation(line: 72, column: 36, scope: !269)
!277 = !DILocation(line: 72, column: 47, scope: !269)
!278 = !DILocation(line: 72, column: 54, scope: !269)
!279 = !DILocation(line: 72, column: 21, scope: !269)
!280 = !DILocation(line: 72, column: 2, scope: !269)
!281 = !DILocation(line: 72, column: 13, scope: !269)
!282 = !DILocation(line: 72, column: 19, scope: !269)
!283 = !DILocation(line: 74, column: 9, scope: !269)
!284 = !DILocation(line: 74, column: 21, scope: !269)
!285 = !DILocation(line: 74, column: 2, scope: !269)
!286 = !DILocation(line: 75, column: 16, scope: !269)
!287 = !DILocation(line: 75, column: 9, scope: !269)
!288 = !DILocation(line: 76, column: 1, scope: !269)
!289 = distinct !DISubprogram(name: "statusbar_config_init", scope: !226, file: !226, line: 764, type: !290, isLocal: false, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !DILocation(line: 766, column: 9, scope: !289)
!293 = !DILocation(line: 767, column: 2, scope: !289)
!294 = !DILocation(line: 768, column: 2, scope: !289)
!295 = !DILocation(line: 770, column: 2, scope: !289)
!296 = !DILocation(line: 771, column: 2, scope: !289)
!297 = !DILocation(line: 772, column: 2, scope: !289)
!298 = !DILocation(line: 773, column: 2, scope: !289)
!299 = !DILocation(line: 774, column: 2, scope: !289)
!300 = !DILocation(line: 775, column: 2, scope: !289)
!301 = !DILocation(line: 776, column: 2, scope: !289)
!302 = !DILocation(line: 777, column: 2, scope: !289)
!303 = !DILocation(line: 778, column: 2, scope: !289)
!304 = !DILocation(line: 780, column: 2, scope: !289)
!305 = !DILocation(line: 781, column: 2, scope: !289)
!306 = !DILocation(line: 782, column: 2, scope: !289)
!307 = !DILocation(line: 784, column: 2, scope: !289)
!308 = !DILocation(line: 786, column: 1, scope: !289)
!309 = distinct !DISubprogram(name: "read_statusbar_config", scope: !226, file: !226, line: 245, type: !290, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!310 = !DILocalVariable(name: "node", scope: !309, file: !226, line: 247, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !63, line: 17, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !63, line: 20, size: 192, align: 64, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !313, file: !63, line: 21, baseType: !200, size: 32, align: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !313, file: !63, line: 22, baseType: !198, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !313, file: !63, line: 23, baseType: !175, size: 64, align: 64, offset: 128)
!318 = !DILocation(line: 247, column: 15, scope: !309)
!319 = !DILocation(line: 249, column: 9, scope: !309)
!320 = !DILocation(line: 251, column: 30, scope: !309)
!321 = !DILocation(line: 251, column: 9, scope: !309)
!322 = !DILocation(line: 251, column: 7, scope: !309)
!323 = !DILocation(line: 252, column: 6, scope: !324)
!324 = distinct !DILexicalBlock(scope: !309, file: !226, line: 252, column: 6)
!325 = !DILocation(line: 252, column: 11, scope: !324)
!326 = !DILocation(line: 252, column: 6, scope: !309)
!327 = !DILocation(line: 253, column: 35, scope: !324)
!328 = !DILocation(line: 253, column: 3, scope: !324)
!329 = !DILocation(line: 255, column: 9, scope: !309)
!330 = !DILocation(line: 256, column: 9, scope: !309)
!331 = !DILocation(line: 257, column: 1, scope: !309)
!332 = distinct !DISubprogram(name: "cmd_statusbar", scope: !226, file: !226, line: 711, type: !333, isLocal: true, isDefinition: true, scopeLine: 712, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !190}
!335 = !DILocalVariable(name: "data", arg: 1, scope: !332, file: !226, line: 711, type: !190)
!336 = !DILocation(line: 711, column: 39, scope: !332)
!337 = !DILocalVariable(name: "arg1", scope: !332, file: !226, line: 713, type: !198)
!338 = !DILocation(line: 713, column: 8, scope: !332)
!339 = !DILocalVariable(name: "arg2", scope: !332, file: !226, line: 713, type: !198)
!340 = !DILocation(line: 713, column: 15, scope: !332)
!341 = !DILocalVariable(name: "params", scope: !332, file: !226, line: 713, type: !198)
!342 = !DILocation(line: 713, column: 22, scope: !332)
!343 = !DILocalVariable(name: "oldcmd", scope: !332, file: !226, line: 713, type: !198)
!344 = !DILocation(line: 713, column: 31, scope: !332)
!345 = !DILocalVariable(name: "free_arg", scope: !332, file: !226, line: 714, type: !175)
!346 = !DILocation(line: 714, column: 8, scope: !332)
!347 = !DILocation(line: 716, column: 22, scope: !348)
!348 = distinct !DILexicalBlock(scope: !332, file: !226, line: 716, column: 6)
!349 = !DILocation(line: 716, column: 7, scope: !348)
!350 = !DILocation(line: 716, column: 6, scope: !332)
!351 = !DILocation(line: 718, column: 3, scope: !348)
!352 = !DILocation(line: 721, column: 9, scope: !332)
!353 = !DILocation(line: 722, column: 7, scope: !354)
!354 = distinct !DILexicalBlock(scope: !332, file: !226, line: 722, column: 6)
!355 = !DILocation(line: 722, column: 6, scope: !354)
!356 = !DILocation(line: 722, column: 12, scope: !354)
!357 = !DILocation(line: 722, column: 6, scope: !332)
!358 = !DILocation(line: 723, column: 12, scope: !359)
!359 = distinct !DILexicalBlock(scope: !354, file: !226, line: 722, column: 21)
!360 = !DILocation(line: 723, column: 10, scope: !359)
!361 = !DILocation(line: 724, column: 2, scope: !359)
!362 = !DILocation(line: 724, column: 32, scope: !363)
!363 = !DILexicalBlockFile(scope: !364, file: !226, discriminator: 1)
!364 = distinct !DILexicalBlock(scope: !354, file: !226, line: 724, column: 13)
!365 = !DILocation(line: 724, column: 13, scope: !363)
!366 = !DILocation(line: 724, column: 48, scope: !363)
!367 = !DILocation(line: 725, column: 52, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !226, line: 724, column: 54)
!369 = !DILocation(line: 725, column: 58, scope: !368)
!370 = !DILocation(line: 725, column: 12, scope: !368)
!371 = !DILocation(line: 725, column: 10, scope: !368)
!372 = !DILocation(line: 726, column: 2, scope: !368)
!373 = !DILocation(line: 726, column: 32, scope: !374)
!374 = !DILexicalBlockFile(scope: !375, file: !226, discriminator: 1)
!375 = distinct !DILexicalBlock(scope: !364, file: !226, line: 726, column: 13)
!376 = !DILocation(line: 726, column: 13, scope: !374)
!377 = !DILocation(line: 726, column: 49, scope: !374)
!378 = !DILocation(line: 727, column: 50, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !226, line: 726, column: 55)
!380 = !DILocation(line: 727, column: 56, scope: !379)
!381 = !DILocation(line: 727, column: 12, scope: !379)
!382 = !DILocation(line: 727, column: 10, scope: !379)
!383 = !DILocation(line: 728, column: 2, scope: !379)
!384 = !DILocation(line: 728, column: 32, scope: !385)
!385 = !DILexicalBlockFile(scope: !386, file: !226, discriminator: 1)
!386 = distinct !DILexicalBlock(scope: !375, file: !226, line: 728, column: 13)
!387 = !DILocation(line: 728, column: 13, scope: !385)
!388 = !DILocation(line: 728, column: 47, scope: !385)
!389 = !DILocation(line: 729, column: 40, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !226, line: 728, column: 53)
!391 = !DILocation(line: 729, column: 12, scope: !390)
!392 = !DILocation(line: 729, column: 10, scope: !390)
!393 = !DILocation(line: 730, column: 2, scope: !390)
!394 = !DILocation(line: 730, column: 32, scope: !395)
!395 = !DILexicalBlockFile(scope: !396, file: !226, discriminator: 1)
!396 = distinct !DILexicalBlock(scope: !386, file: !226, line: 730, column: 13)
!397 = !DILocation(line: 730, column: 13, scope: !395)
!398 = !DILocation(line: 730, column: 46, scope: !395)
!399 = !DILocation(line: 731, column: 47, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !226, line: 730, column: 52)
!401 = !DILocation(line: 731, column: 55, scope: !400)
!402 = !DILocation(line: 731, column: 12, scope: !400)
!403 = !DILocation(line: 731, column: 10, scope: !400)
!404 = !DILocation(line: 732, column: 2, scope: !400)
!405 = !DILocation(line: 732, column: 32, scope: !406)
!406 = !DILexicalBlockFile(scope: !407, file: !226, discriminator: 1)
!407 = distinct !DILexicalBlock(scope: !396, file: !226, line: 732, column: 13)
!408 = !DILocation(line: 732, column: 13, scope: !406)
!409 = !DILocation(line: 732, column: 51, scope: !406)
!410 = !DILocation(line: 733, column: 52, scope: !411)
!411 = distinct !DILexicalBlock(scope: !407, file: !226, line: 732, column: 57)
!412 = !DILocation(line: 733, column: 60, scope: !411)
!413 = !DILocation(line: 733, column: 12, scope: !411)
!414 = !DILocation(line: 733, column: 10, scope: !411)
!415 = !DILocation(line: 734, column: 2, scope: !411)
!416 = !DILocation(line: 734, column: 32, scope: !417)
!417 = !DILexicalBlockFile(scope: !418, file: !226, discriminator: 1)
!418 = distinct !DILexicalBlock(scope: !407, file: !226, line: 734, column: 13)
!419 = !DILocation(line: 734, column: 13, scope: !417)
!420 = !DILocation(line: 734, column: 50, scope: !417)
!421 = !DILocation(line: 735, column: 51, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !226, line: 734, column: 56)
!423 = !DILocation(line: 735, column: 59, scope: !422)
!424 = !DILocation(line: 735, column: 12, scope: !422)
!425 = !DILocation(line: 735, column: 10, scope: !422)
!426 = !DILocation(line: 736, column: 2, scope: !422)
!427 = !DILocation(line: 736, column: 32, scope: !428)
!428 = !DILexicalBlockFile(scope: !429, file: !226, discriminator: 1)
!429 = distinct !DILexicalBlock(scope: !418, file: !226, line: 736, column: 13)
!430 = !DILocation(line: 736, column: 13, scope: !428)
!431 = !DILocation(line: 736, column: 49, scope: !428)
!432 = !DILocation(line: 737, column: 50, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !226, line: 736, column: 55)
!434 = !DILocation(line: 737, column: 58, scope: !433)
!435 = !DILocation(line: 737, column: 12, scope: !433)
!436 = !DILocation(line: 737, column: 10, scope: !433)
!437 = !DILocation(line: 738, column: 2, scope: !433)
!438 = !DILocation(line: 738, column: 32, scope: !439)
!439 = !DILexicalBlockFile(scope: !440, file: !226, discriminator: 1)
!440 = distinct !DILexicalBlock(scope: !429, file: !226, line: 738, column: 13)
!441 = !DILocation(line: 738, column: 13, scope: !439)
!442 = !DILocation(line: 738, column: 45, scope: !439)
!443 = !DILocation(line: 739, column: 45, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !226, line: 738, column: 51)
!445 = !DILocation(line: 739, column: 53, scope: !444)
!446 = !DILocation(line: 739, column: 12, scope: !444)
!447 = !DILocation(line: 739, column: 10, scope: !444)
!448 = !DILocation(line: 740, column: 2, scope: !444)
!449 = !DILocation(line: 740, column: 32, scope: !450)
!450 = !DILexicalBlockFile(scope: !451, file: !226, discriminator: 1)
!451 = distinct !DILexicalBlock(scope: !440, file: !226, line: 740, column: 13)
!452 = !DILocation(line: 740, column: 13, scope: !450)
!453 = !DILocation(line: 740, column: 48, scope: !450)
!454 = !DILocation(line: 741, column: 48, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !226, line: 740, column: 54)
!456 = !DILocation(line: 741, column: 56, scope: !455)
!457 = !DILocation(line: 741, column: 12, scope: !455)
!458 = !DILocation(line: 741, column: 10, scope: !455)
!459 = !DILocation(line: 742, column: 2, scope: !455)
!460 = !DILocation(line: 742, column: 14, scope: !461)
!461 = !DILexicalBlockFile(scope: !462, file: !226, discriminator: 1)
!462 = distinct !DILexicalBlock(scope: !451, file: !226, line: 742, column: 13)
!463 = !DILocation(line: 742, column: 13, scope: !461)
!464 = !DILocation(line: 742, column: 19, scope: !461)
!465 = !DILocation(line: 743, column: 44, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !226, line: 742, column: 28)
!467 = !DILocation(line: 743, column: 12, scope: !466)
!468 = !DILocation(line: 743, column: 10, scope: !466)
!469 = !DILocation(line: 744, column: 20, scope: !470)
!470 = distinct !DILexicalBlock(scope: !466, file: !226, line: 744, column: 7)
!471 = !DILocation(line: 744, column: 7, scope: !470)
!472 = !DILocation(line: 744, column: 28, scope: !470)
!473 = !DILocation(line: 744, column: 7, scope: !466)
!474 = !DILocation(line: 745, column: 11, scope: !475)
!475 = distinct !DILexicalBlock(scope: !470, file: !226, line: 744, column: 36)
!476 = !DILocation(line: 745, column: 4, scope: !475)
!477 = !DILocation(line: 746, column: 40, scope: !475)
!478 = !DILocation(line: 746, column: 13, scope: !475)
!479 = !DILocation(line: 746, column: 11, scope: !475)
!480 = !DILocation(line: 747, column: 3, scope: !475)
!481 = !DILocation(line: 748, column: 11, scope: !482)
!482 = distinct !DILexicalBlock(scope: !470, file: !226, line: 747, column: 10)
!483 = !DILocation(line: 748, column: 4, scope: !482)
!484 = !DILocation(line: 749, column: 11, scope: !482)
!485 = !DILocation(line: 751, column: 2, scope: !466)
!486 = !DILocation(line: 753, column: 18, scope: !332)
!487 = !DILocation(line: 753, column: 2, scope: !332)
!488 = !DILocation(line: 754, column: 6, scope: !489)
!489 = distinct !DILexicalBlock(scope: !332, file: !226, line: 754, column: 6)
!490 = !DILocation(line: 754, column: 6, scope: !332)
!491 = !DILocation(line: 755, column: 31, scope: !492)
!492 = distinct !DILexicalBlock(scope: !489, file: !226, line: 754, column: 14)
!493 = !DILocation(line: 755, column: 3, scope: !492)
!494 = !DILocation(line: 756, column: 10, scope: !492)
!495 = !DILocation(line: 756, column: 3, scope: !492)
!496 = !DILocation(line: 757, column: 2, scope: !492)
!497 = !DILocation(line: 758, column: 31, scope: !498)
!498 = distinct !DILexicalBlock(scope: !489, file: !226, line: 757, column: 9)
!499 = !DILocation(line: 758, column: 3, scope: !498)
!500 = !DILocation(line: 761, column: 2, scope: !332)
!501 = !DILocation(line: 762, column: 1, scope: !332)
!502 = distinct !DISubprogram(name: "cmd_statusbar_list", scope: !226, file: !226, line: 363, type: !290, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!503 = !DILocalVariable(name: "tmp", scope: !502, file: !226, line: 365, type: !205)
!504 = !DILocation(line: 365, column: 10, scope: !502)
!505 = !DILocation(line: 367, column: 2, scope: !502)
!506 = !DILocation(line: 369, column: 15, scope: !502)
!507 = !DILocation(line: 369, column: 39, scope: !502)
!508 = !DILocation(line: 369, column: 13, scope: !502)
!509 = !DILocation(line: 370, column: 2, scope: !502)
!510 = !DILocation(line: 370, column: 9, scope: !511)
!511 = !DILexicalBlockFile(scope: !512, file: !226, discriminator: 1)
!512 = distinct !DILexicalBlock(scope: !513, file: !226, line: 370, column: 2)
!513 = distinct !DILexicalBlock(scope: !502, file: !226, line: 370, column: 2)
!514 = !DILocation(line: 370, column: 13, scope: !511)
!515 = !DILocation(line: 370, column: 2, scope: !511)
!516 = !DILocalVariable(name: "rec", scope: !517, file: !226, line: 371, type: !192)
!517 = distinct !DILexicalBlock(scope: !512, file: !226, line: 370, column: 38)
!518 = !DILocation(line: 371, column: 25, scope: !517)
!519 = !DILocation(line: 371, column: 31, scope: !517)
!520 = !DILocation(line: 371, column: 36, scope: !517)
!521 = !DILocation(line: 373, column: 45, scope: !517)
!522 = !DILocation(line: 373, column: 50, scope: !517)
!523 = !DILocation(line: 373, column: 70, scope: !517)
!524 = !DILocation(line: 373, column: 56, scope: !517)
!525 = !DILocation(line: 373, column: 95, scope: !517)
!526 = !DILocation(line: 373, column: 76, scope: !527)
!527 = !DILexicalBlockFile(scope: !517, file: !226, discriminator: 1)
!528 = !DILocation(line: 373, column: 101, scope: !517)
!529 = !DILocation(line: 373, column: 106, scope: !517)
!530 = !DILocation(line: 373, column: 136, scope: !517)
!531 = !DILocation(line: 373, column: 116, scope: !532)
!532 = !DILexicalBlockFile(scope: !517, file: !226, discriminator: 2)
!533 = !DILocation(line: 373, column: 3, scope: !534)
!534 = !DILexicalBlockFile(scope: !517, file: !226, discriminator: 3)
!535 = !DILocation(line: 377, column: 2, scope: !517)
!536 = !DILocation(line: 370, column: 27, scope: !537)
!537 = !DILexicalBlockFile(scope: !512, file: !226, discriminator: 2)
!538 = !DILocation(line: 370, column: 32, scope: !537)
!539 = !DILocation(line: 370, column: 25, scope: !537)
!540 = !DILocation(line: 370, column: 2, scope: !537)
!541 = distinct !{!541, !509}
!542 = !DILocation(line: 379, column: 2, scope: !502)
!543 = !DILocation(line: 380, column: 1, scope: !502)
!544 = distinct !DISubprogram(name: "cmd_statusbar_add_modify", scope: !226, file: !226, line: 401, type: !545, isLocal: true, isDefinition: true, scopeLine: 402, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !190, !175, !175}
!547 = !DILocalVariable(name: "data", arg: 1, scope: !544, file: !226, line: 401, type: !190)
!548 = !DILocation(line: 401, column: 50, scope: !544)
!549 = !DILocalVariable(name: "server", arg: 2, scope: !544, file: !226, line: 401, type: !175)
!550 = !DILocation(line: 401, column: 62, scope: !544)
!551 = !DILocalVariable(name: "witem", arg: 3, scope: !544, file: !226, line: 401, type: !175)
!552 = !DILocation(line: 401, column: 76, scope: !544)
!553 = !DILocalVariable(name: "optlist", scope: !544, file: !226, line: 403, type: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !556, line: 37, baseType: !557)
!556 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !556, line: 37, flags: DIFlagFwdDecl)
!558 = !DILocation(line: 403, column: 14, scope: !544)
!559 = !DILocalVariable(name: "node", scope: !544, file: !226, line: 404, type: !311)
!560 = !DILocation(line: 404, column: 15, scope: !544)
!561 = !DILocalVariable(name: "name", scope: !544, file: !226, line: 405, type: !198)
!562 = !DILocation(line: 405, column: 8, scope: !544)
!563 = !DILocalVariable(name: "type", scope: !544, file: !226, line: 405, type: !198)
!564 = !DILocation(line: 405, column: 15, scope: !544)
!565 = !DILocalVariable(name: "placement", scope: !544, file: !226, line: 405, type: !198)
!566 = !DILocation(line: 405, column: 22, scope: !544)
!567 = !DILocalVariable(name: "visible", scope: !544, file: !226, line: 405, type: !198)
!568 = !DILocation(line: 405, column: 34, scope: !544)
!569 = !DILocalVariable(name: "free_arg", scope: !544, file: !226, line: 406, type: !175)
!570 = !DILocation(line: 406, column: 8, scope: !544)
!571 = !DILocalVariable(name: "error", scope: !544, file: !226, line: 407, type: !200)
!572 = !DILocation(line: 407, column: 6, scope: !544)
!573 = !DILocalVariable(name: "add", scope: !544, file: !226, line: 408, type: !200)
!574 = !DILocation(line: 408, column: 6, scope: !544)
!575 = !DILocation(line: 408, column: 29, scope: !544)
!576 = !DILocation(line: 408, column: 20, scope: !544)
!577 = !DILocation(line: 408, column: 13, scope: !544)
!578 = !DILocation(line: 410, column: 22, scope: !579)
!579 = distinct !DILexicalBlock(scope: !544, file: !226, line: 410, column: 6)
!580 = !DILocation(line: 410, column: 7, scope: !579)
!581 = !DILocation(line: 410, column: 6, scope: !544)
!582 = !DILocation(line: 412, column: 3, scope: !579)
!583 = !DILocation(line: 414, column: 7, scope: !584)
!584 = distinct !DILexicalBlock(scope: !544, file: !226, line: 414, column: 6)
!585 = !DILocation(line: 414, column: 6, scope: !584)
!586 = !DILocation(line: 414, column: 12, scope: !584)
!587 = !DILocation(line: 414, column: 6, scope: !544)
!588 = !DILocation(line: 415, column: 3, scope: !589)
!589 = distinct !DILexicalBlock(scope: !584, file: !226, line: 414, column: 21)
!590 = distinct !{!590, !588}
!591 = !DILocation(line: 415, column: 24, scope: !592)
!592 = !DILexicalBlockFile(scope: !593, file: !226, discriminator: 1)
!593 = distinct !DILexicalBlock(scope: !589, file: !226, line: 415, column: 6)
!594 = !DILocation(line: 415, column: 8, scope: !592)
!595 = !DILocation(line: 415, column: 35, scope: !592)
!596 = distinct !{!596, !597}
!597 = !DILocation(line: 415, column: 35, scope: !593)
!598 = !DILocation(line: 415, column: 40, scope: !599)
!599 = !DILexicalBlockFile(scope: !600, file: !226, discriminator: 2)
!600 = distinct !DILexicalBlock(scope: !593, file: !226, line: 415, column: 38)
!601 = !DILocation(line: 415, column: 122, scope: !602)
!602 = !DILexicalBlockFile(scope: !599, file: !226, discriminator: 4)
!603 = !DILocation(line: 415, column: 137, scope: !599)
!604 = !DILocation(line: 415, column: 158, scope: !605)
!605 = !DILexicalBlockFile(scope: !593, file: !226, discriminator: 3)
!606 = !DILocation(line: 416, column: 2, scope: !589)
!607 = !DILocation(line: 418, column: 8, scope: !544)
!608 = !DILocation(line: 420, column: 7, scope: !544)
!609 = !DILocation(line: 421, column: 29, scope: !544)
!610 = !DILocation(line: 421, column: 9, scope: !544)
!611 = !DILocation(line: 421, column: 7, scope: !544)
!612 = !DILocation(line: 422, column: 6, scope: !613)
!613 = distinct !DILexicalBlock(scope: !544, file: !226, line: 422, column: 6)
!614 = !DILocation(line: 422, column: 11, scope: !613)
!615 = !DILocation(line: 422, column: 6, scope: !544)
!616 = !DILocation(line: 423, column: 26, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !226, line: 423, column: 7)
!618 = distinct !DILexicalBlock(scope: !613, file: !226, line: 422, column: 19)
!619 = !DILocation(line: 423, column: 7, scope: !617)
!620 = !DILocation(line: 423, column: 42, scope: !617)
!621 = !DILocation(line: 423, column: 7, scope: !618)
!622 = !DILocation(line: 424, column: 9, scope: !617)
!623 = !DILocation(line: 424, column: 4, scope: !617)
!624 = !DILocation(line: 425, column: 31, scope: !625)
!625 = distinct !DILexicalBlock(scope: !617, file: !226, line: 425, column: 12)
!626 = !DILocation(line: 425, column: 12, scope: !625)
!627 = !DILocation(line: 425, column: 45, scope: !625)
!628 = !DILocation(line: 425, column: 12, scope: !617)
!629 = !DILocation(line: 426, column: 9, scope: !625)
!630 = !DILocation(line: 426, column: 4, scope: !625)
!631 = !DILocation(line: 428, column: 55, scope: !632)
!632 = distinct !DILexicalBlock(scope: !625, file: !226, line: 427, column: 8)
!633 = !DILocation(line: 428, column: 4, scope: !632)
!634 = !DILocation(line: 430, column: 9, scope: !632)
!635 = !DILocation(line: 432, column: 2, scope: !618)
!636 = !DILocation(line: 434, column: 12, scope: !544)
!637 = !DILocation(line: 435, column: 29, scope: !544)
!638 = !DILocation(line: 435, column: 9, scope: !544)
!639 = !DILocation(line: 435, column: 7, scope: !544)
!640 = !DILocation(line: 436, column: 6, scope: !641)
!641 = distinct !DILexicalBlock(scope: !544, file: !226, line: 436, column: 6)
!642 = !DILocation(line: 436, column: 11, scope: !641)
!643 = !DILocation(line: 436, column: 6, scope: !544)
!644 = !DILocation(line: 437, column: 26, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !226, line: 437, column: 7)
!646 = distinct !DILexicalBlock(scope: !641, file: !226, line: 436, column: 19)
!647 = !DILocation(line: 437, column: 7, scope: !645)
!648 = !DILocation(line: 437, column: 39, scope: !645)
!649 = !DILocation(line: 437, column: 7, scope: !646)
!650 = !DILocation(line: 438, column: 14, scope: !645)
!651 = !DILocation(line: 438, column: 4, scope: !645)
!652 = !DILocation(line: 439, column: 31, scope: !653)
!653 = distinct !DILexicalBlock(scope: !645, file: !226, line: 439, column: 12)
!654 = !DILocation(line: 439, column: 12, scope: !653)
!655 = !DILocation(line: 439, column: 47, scope: !653)
!656 = !DILocation(line: 439, column: 12, scope: !645)
!657 = !DILocation(line: 440, column: 14, scope: !653)
!658 = !DILocation(line: 440, column: 4, scope: !653)
!659 = !DILocation(line: 442, column: 60, scope: !660)
!660 = distinct !DILexicalBlock(scope: !653, file: !226, line: 441, column: 8)
!661 = !DILocation(line: 442, column: 4, scope: !660)
!662 = !DILocation(line: 444, column: 9, scope: !660)
!663 = !DILocation(line: 446, column: 2, scope: !646)
!664 = !DILocation(line: 448, column: 10, scope: !544)
!665 = !DILocation(line: 449, column: 29, scope: !544)
!666 = !DILocation(line: 449, column: 9, scope: !544)
!667 = !DILocation(line: 449, column: 7, scope: !544)
!668 = !DILocation(line: 450, column: 6, scope: !669)
!669 = distinct !DILexicalBlock(scope: !544, file: !226, line: 450, column: 6)
!670 = !DILocation(line: 450, column: 11, scope: !669)
!671 = !DILocation(line: 450, column: 6, scope: !544)
!672 = !DILocation(line: 451, column: 26, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !226, line: 451, column: 7)
!674 = distinct !DILexicalBlock(scope: !669, file: !226, line: 450, column: 19)
!675 = !DILocation(line: 451, column: 7, scope: !673)
!676 = !DILocation(line: 451, column: 42, scope: !673)
!677 = !DILocation(line: 451, column: 7, scope: !674)
!678 = !DILocation(line: 452, column: 12, scope: !673)
!679 = !DILocation(line: 452, column: 4, scope: !673)
!680 = !DILocation(line: 453, column: 31, scope: !681)
!681 = distinct !DILexicalBlock(scope: !673, file: !226, line: 453, column: 12)
!682 = !DILocation(line: 453, column: 12, scope: !681)
!683 = !DILocation(line: 453, column: 47, scope: !681)
!684 = !DILocation(line: 453, column: 12, scope: !673)
!685 = !DILocation(line: 454, column: 12, scope: !681)
!686 = !DILocation(line: 454, column: 4, scope: !681)
!687 = !DILocation(line: 455, column: 31, scope: !688)
!688 = distinct !DILexicalBlock(scope: !681, file: !226, line: 455, column: 12)
!689 = !DILocation(line: 455, column: 12, scope: !688)
!690 = !DILocation(line: 455, column: 49, scope: !688)
!691 = !DILocation(line: 455, column: 12, scope: !681)
!692 = !DILocation(line: 456, column: 12, scope: !688)
!693 = !DILocation(line: 456, column: 4, scope: !688)
!694 = !DILocation(line: 458, column: 61, scope: !695)
!695 = distinct !DILexicalBlock(scope: !688, file: !226, line: 457, column: 8)
!696 = !DILocation(line: 458, column: 4, scope: !695)
!697 = !DILocation(line: 460, column: 9, scope: !695)
!698 = !DILocation(line: 462, column: 2, scope: !674)
!699 = !DILocation(line: 464, column: 7, scope: !700)
!700 = distinct !DILexicalBlock(scope: !544, file: !226, line: 464, column: 6)
!701 = !DILocation(line: 464, column: 6, scope: !544)
!702 = !DILocation(line: 465, column: 20, scope: !703)
!703 = distinct !DILexicalBlock(scope: !700, file: !226, line: 464, column: 14)
!704 = !DILocation(line: 465, column: 26, scope: !703)
!705 = !DILocation(line: 465, column: 10, scope: !703)
!706 = !DILocation(line: 465, column: 8, scope: !703)
!707 = !DILocation(line: 466, column: 7, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !226, line: 466, column: 7)
!709 = !DILocation(line: 466, column: 12, scope: !708)
!710 = !DILocation(line: 466, column: 19, scope: !708)
!711 = !DILocation(line: 466, column: 23, scope: !712)
!712 = !DILexicalBlockFile(scope: !708, file: !226, discriminator: 1)
!713 = !DILocation(line: 466, column: 27, scope: !712)
!714 = !DILocation(line: 466, column: 50, scope: !715)
!715 = !DILexicalBlockFile(scope: !708, file: !226, discriminator: 2)
!716 = !DILocation(line: 466, column: 30, scope: !715)
!717 = !DILocation(line: 466, column: 7, scope: !715)
!718 = !DILocation(line: 469, column: 21, scope: !719)
!719 = distinct !DILexicalBlock(scope: !708, file: !226, line: 466, column: 57)
!720 = !DILocation(line: 469, column: 11, scope: !719)
!721 = !DILocation(line: 469, column: 9, scope: !719)
!722 = !DILocation(line: 470, column: 3, scope: !719)
!723 = !DILocation(line: 472, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !703, file: !226, line: 472, column: 7)
!725 = !DILocation(line: 472, column: 12, scope: !724)
!726 = !DILocation(line: 472, column: 7, scope: !703)
!727 = !DILocation(line: 473, column: 52, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !226, line: 472, column: 20)
!729 = !DILocation(line: 473, column: 4, scope: !728)
!730 = !DILocation(line: 474, column: 9, scope: !728)
!731 = !DILocation(line: 475, column: 3, scope: !728)
!732 = !DILocation(line: 476, column: 2, scope: !703)
!733 = !DILocation(line: 478, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !544, file: !226, line: 478, column: 6)
!735 = !DILocation(line: 478, column: 6, scope: !544)
!736 = !DILocation(line: 479, column: 19, scope: !737)
!737 = distinct !DILexicalBlock(scope: !734, file: !226, line: 478, column: 13)
!738 = !DILocation(line: 479, column: 3, scope: !737)
!739 = !DILocation(line: 480, column: 3, scope: !737)
!740 = !DILocation(line: 483, column: 26, scope: !741)
!741 = distinct !DILexicalBlock(scope: !544, file: !226, line: 483, column: 6)
!742 = !DILocation(line: 483, column: 6, scope: !741)
!743 = !DILocation(line: 483, column: 6, scope: !544)
!744 = !DILocation(line: 484, column: 23, scope: !741)
!745 = !DILocation(line: 484, column: 35, scope: !741)
!746 = !DILocation(line: 484, column: 3, scope: !741)
!747 = !DILocation(line: 485, column: 26, scope: !748)
!748 = distinct !DILexicalBlock(scope: !544, file: !226, line: 485, column: 6)
!749 = !DILocation(line: 485, column: 6, scope: !748)
!750 = !DILocation(line: 485, column: 6, scope: !544)
!751 = !DILocation(line: 486, column: 24, scope: !748)
!752 = !DILocation(line: 486, column: 36, scope: !748)
!753 = !DILocation(line: 486, column: 3, scope: !748)
!754 = !DILocation(line: 487, column: 6, scope: !755)
!755 = distinct !DILexicalBlock(scope: !544, file: !226, line: 487, column: 6)
!756 = !DILocation(line: 487, column: 11, scope: !755)
!757 = !DILocation(line: 487, column: 6, scope: !544)
!758 = !DILocation(line: 488, column: 23, scope: !755)
!759 = !DILocation(line: 488, column: 35, scope: !755)
!760 = !DILocation(line: 488, column: 49, scope: !755)
!761 = !DILocation(line: 488, column: 3, scope: !755)
!762 = !DILocation(line: 489, column: 6, scope: !763)
!763 = distinct !DILexicalBlock(scope: !544, file: !226, line: 489, column: 6)
!764 = !DILocation(line: 489, column: 16, scope: !763)
!765 = !DILocation(line: 489, column: 6, scope: !544)
!766 = !DILocation(line: 490, column: 23, scope: !763)
!767 = !DILocation(line: 490, column: 35, scope: !763)
!768 = !DILocation(line: 490, column: 54, scope: !763)
!769 = !DILocation(line: 490, column: 3, scope: !763)
!770 = !DILocation(line: 491, column: 29, scope: !544)
!771 = !DILocation(line: 491, column: 9, scope: !544)
!772 = !DILocation(line: 491, column: 7, scope: !544)
!773 = !DILocation(line: 492, column: 6, scope: !774)
!774 = distinct !DILexicalBlock(scope: !544, file: !226, line: 492, column: 6)
!775 = !DILocation(line: 492, column: 11, scope: !774)
!776 = !DILocation(line: 492, column: 6, scope: !544)
!777 = !DILocation(line: 493, column: 23, scope: !774)
!778 = !DILocation(line: 493, column: 35, scope: !774)
!779 = !DILocation(line: 493, column: 58, scope: !774)
!780 = !DILocation(line: 493, column: 53, scope: !774)
!781 = !DILocation(line: 493, column: 3, scope: !782)
!782 = !DILexicalBlockFile(scope: !774, file: !226, discriminator: 1)
!783 = !DILocation(line: 493, column: 3, scope: !774)
!784 = !DILocation(line: 494, column: 6, scope: !785)
!785 = distinct !DILexicalBlock(scope: !544, file: !226, line: 494, column: 6)
!786 = !DILocation(line: 494, column: 14, scope: !785)
!787 = !DILocation(line: 494, column: 6, scope: !544)
!788 = !DILocation(line: 495, column: 23, scope: !785)
!789 = !DILocation(line: 495, column: 35, scope: !785)
!790 = !DILocation(line: 495, column: 52, scope: !785)
!791 = !DILocation(line: 495, column: 3, scope: !785)
!792 = !DILocation(line: 497, column: 2, scope: !544)
!793 = !DILocation(line: 498, column: 18, scope: !544)
!794 = !DILocation(line: 498, column: 2, scope: !544)
!795 = !DILocation(line: 499, column: 1, scope: !544)
!796 = !DILocation(line: 499, column: 1, scope: !797)
!797 = !DILexicalBlockFile(scope: !544, file: !226, discriminator: 1)
!798 = distinct !DISubprogram(name: "cmd_statusbar_reset", scope: !226, file: !226, line: 502, type: !545, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!799 = !DILocalVariable(name: "data", arg: 1, scope: !798, file: !226, line: 502, type: !190)
!800 = !DILocation(line: 502, column: 45, scope: !798)
!801 = !DILocalVariable(name: "server", arg: 2, scope: !798, file: !226, line: 502, type: !175)
!802 = !DILocation(line: 502, column: 57, scope: !798)
!803 = !DILocalVariable(name: "witem", arg: 3, scope: !798, file: !226, line: 502, type: !175)
!804 = !DILocation(line: 502, column: 71, scope: !798)
!805 = !DILocalVariable(name: "node", scope: !798, file: !226, line: 504, type: !311)
!806 = !DILocation(line: 504, column: 15, scope: !798)
!807 = !DILocalVariable(name: "parent", scope: !798, file: !226, line: 504, type: !311)
!808 = !DILocation(line: 504, column: 22, scope: !798)
!809 = !DILocalVariable(name: "name", scope: !798, file: !226, line: 505, type: !198)
!810 = !DILocation(line: 505, column: 8, scope: !798)
!811 = !DILocalVariable(name: "free_arg", scope: !798, file: !226, line: 506, type: !175)
!812 = !DILocation(line: 506, column: 8, scope: !798)
!813 = !DILocation(line: 508, column: 22, scope: !814)
!814 = distinct !DILexicalBlock(scope: !798, file: !226, line: 508, column: 6)
!815 = !DILocation(line: 508, column: 7, scope: !814)
!816 = !DILocation(line: 508, column: 6, scope: !798)
!817 = !DILocation(line: 509, column: 3, scope: !814)
!818 = !DILocation(line: 511, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !798, file: !226, line: 511, column: 6)
!820 = !DILocation(line: 511, column: 6, scope: !819)
!821 = !DILocation(line: 511, column: 12, scope: !819)
!822 = !DILocation(line: 511, column: 6, scope: !798)
!823 = !DILocation(line: 512, column: 3, scope: !824)
!824 = distinct !DILexicalBlock(scope: !819, file: !226, line: 511, column: 21)
!825 = distinct !{!825, !823}
!826 = !DILocation(line: 512, column: 24, scope: !827)
!827 = !DILexicalBlockFile(scope: !828, file: !226, discriminator: 1)
!828 = distinct !DILexicalBlock(scope: !824, file: !226, line: 512, column: 6)
!829 = !DILocation(line: 512, column: 8, scope: !827)
!830 = !DILocation(line: 512, column: 35, scope: !827)
!831 = distinct !{!831, !832}
!832 = !DILocation(line: 512, column: 35, scope: !828)
!833 = !DILocation(line: 512, column: 40, scope: !834)
!834 = !DILexicalBlockFile(scope: !835, file: !226, discriminator: 2)
!835 = distinct !DILexicalBlock(scope: !828, file: !226, line: 512, column: 38)
!836 = !DILocation(line: 512, column: 122, scope: !837)
!837 = !DILexicalBlockFile(scope: !834, file: !226, discriminator: 4)
!838 = !DILocation(line: 512, column: 137, scope: !834)
!839 = !DILocation(line: 512, column: 158, scope: !840)
!840 = !DILexicalBlockFile(scope: !828, file: !226, discriminator: 3)
!841 = !DILocation(line: 513, column: 2, scope: !824)
!842 = !DILocation(line: 515, column: 19, scope: !798)
!843 = !DILocation(line: 515, column: 9, scope: !798)
!844 = !DILocation(line: 515, column: 7, scope: !798)
!845 = !DILocation(line: 516, column: 6, scope: !846)
!846 = distinct !DILexicalBlock(scope: !798, file: !226, line: 516, column: 6)
!847 = !DILocation(line: 516, column: 11, scope: !846)
!848 = !DILocation(line: 516, column: 18, scope: !846)
!849 = !DILocation(line: 516, column: 42, scope: !850)
!850 = !DILexicalBlockFile(scope: !846, file: !226, discriminator: 1)
!851 = !DILocation(line: 516, column: 22, scope: !850)
!852 = !DILocation(line: 516, column: 6, scope: !850)
!853 = !DILocation(line: 517, column: 51, scope: !854)
!854 = distinct !DILexicalBlock(scope: !846, file: !226, line: 516, column: 49)
!855 = !DILocation(line: 517, column: 3, scope: !854)
!856 = !DILocation(line: 518, column: 19, scope: !854)
!857 = !DILocation(line: 518, column: 3, scope: !854)
!858 = !DILocation(line: 519, column: 3, scope: !854)
!859 = !DILocation(line: 522, column: 32, scope: !798)
!860 = !DILocation(line: 522, column: 11, scope: !798)
!861 = !DILocation(line: 522, column: 9, scope: !798)
!862 = !DILocation(line: 523, column: 6, scope: !863)
!863 = distinct !DILexicalBlock(scope: !798, file: !226, line: 523, column: 6)
!864 = !DILocation(line: 523, column: 13, scope: !863)
!865 = !DILocation(line: 523, column: 6, scope: !798)
!866 = !DILocation(line: 524, column: 32, scope: !867)
!867 = distinct !DILexicalBlock(scope: !863, file: !226, line: 523, column: 21)
!868 = !DILocation(line: 524, column: 44, scope: !867)
!869 = !DILocation(line: 524, column: 52, scope: !867)
!870 = !DILocation(line: 524, column: 76, scope: !867)
!871 = !DILocation(line: 524, column: 12, scope: !867)
!872 = !DILocation(line: 524, column: 10, scope: !867)
!873 = !DILocation(line: 525, column: 2, scope: !867)
!874 = !DILocation(line: 527, column: 6, scope: !875)
!875 = distinct !DILexicalBlock(scope: !798, file: !226, line: 527, column: 6)
!876 = !DILocation(line: 527, column: 13, scope: !875)
!877 = !DILocation(line: 527, column: 20, scope: !875)
!878 = !DILocation(line: 527, column: 23, scope: !879)
!879 = !DILexicalBlockFile(scope: !875, file: !226, discriminator: 1)
!880 = !DILocation(line: 527, column: 28, scope: !879)
!881 = !DILocation(line: 527, column: 6, scope: !879)
!882 = !DILocation(line: 528, column: 23, scope: !883)
!883 = distinct !DILexicalBlock(scope: !875, file: !226, line: 527, column: 37)
!884 = !DILocation(line: 528, column: 35, scope: !883)
!885 = !DILocation(line: 528, column: 43, scope: !883)
!886 = !DILocation(line: 528, column: 49, scope: !883)
!887 = !DILocation(line: 528, column: 3, scope: !883)
!888 = !DILocation(line: 529, column: 2, scope: !883)
!889 = !DILocation(line: 531, column: 2, scope: !798)
!890 = !DILocation(line: 532, column: 18, scope: !798)
!891 = !DILocation(line: 532, column: 2, scope: !798)
!892 = !DILocation(line: 533, column: 1, scope: !798)
!893 = !DILocation(line: 533, column: 1, scope: !894)
!894 = !DILexicalBlockFile(scope: !798, file: !226, discriminator: 1)
!895 = distinct !DISubprogram(name: "cmd_statusbar_info", scope: !226, file: !226, line: 694, type: !333, isLocal: true, isDefinition: true, scopeLine: 695, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!896 = !DILocalVariable(name: "data", arg: 1, scope: !895, file: !226, line: 694, type: !190)
!897 = !DILocation(line: 694, column: 44, scope: !895)
!898 = !DILocalVariable(name: "free_arg", scope: !895, file: !226, line: 696, type: !175)
!899 = !DILocation(line: 696, column: 8, scope: !895)
!900 = !DILocalVariable(name: "name", scope: !895, file: !226, line: 697, type: !198)
!901 = !DILocation(line: 697, column: 8, scope: !895)
!902 = !DILocation(line: 698, column: 22, scope: !903)
!903 = distinct !DILexicalBlock(scope: !895, file: !226, line: 698, column: 6)
!904 = !DILocation(line: 698, column: 7, scope: !903)
!905 = !DILocation(line: 698, column: 6, scope: !895)
!906 = !DILocation(line: 699, column: 3, scope: !903)
!907 = !DILocation(line: 701, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !895, file: !226, line: 701, column: 6)
!909 = !DILocation(line: 701, column: 6, scope: !908)
!910 = !DILocation(line: 701, column: 12, scope: !908)
!911 = !DILocation(line: 701, column: 6, scope: !895)
!912 = !DILocation(line: 702, column: 3, scope: !913)
!913 = distinct !DILexicalBlock(scope: !908, file: !226, line: 701, column: 21)
!914 = distinct !{!914, !912}
!915 = !DILocation(line: 702, column: 24, scope: !916)
!916 = !DILexicalBlockFile(scope: !917, file: !226, discriminator: 1)
!917 = distinct !DILexicalBlock(scope: !913, file: !226, line: 702, column: 6)
!918 = !DILocation(line: 702, column: 8, scope: !916)
!919 = !DILocation(line: 702, column: 35, scope: !916)
!920 = distinct !{!920, !921}
!921 = !DILocation(line: 702, column: 35, scope: !917)
!922 = !DILocation(line: 702, column: 40, scope: !923)
!923 = !DILexicalBlockFile(scope: !924, file: !226, discriminator: 2)
!924 = distinct !DILexicalBlock(scope: !917, file: !226, line: 702, column: 38)
!925 = !DILocation(line: 702, column: 122, scope: !926)
!926 = !DILexicalBlockFile(scope: !923, file: !226, discriminator: 4)
!927 = !DILocation(line: 702, column: 137, scope: !923)
!928 = !DILocation(line: 702, column: 158, scope: !929)
!929 = !DILexicalBlockFile(scope: !917, file: !226, discriminator: 3)
!930 = !DILocation(line: 703, column: 2, scope: !913)
!931 = !DILocation(line: 706, column: 27, scope: !895)
!932 = !DILocation(line: 706, column: 2, scope: !895)
!933 = !DILocation(line: 707, column: 18, scope: !895)
!934 = !DILocation(line: 707, column: 2, scope: !895)
!935 = !DILocation(line: 708, column: 2, scope: !895)
!936 = !DILocation(line: 709, column: 1, scope: !895)
!937 = distinct !DISubprogram(name: "cmd_statusbar_additem_modifyitem", scope: !226, file: !226, line: 621, type: !545, isLocal: true, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!938 = !DILocalVariable(name: "data", arg: 1, scope: !937, file: !226, line: 621, type: !190)
!939 = !DILocation(line: 621, column: 58, scope: !937)
!940 = !DILocalVariable(name: "server", arg: 2, scope: !937, file: !226, line: 621, type: !175)
!941 = !DILocation(line: 621, column: 70, scope: !937)
!942 = !DILocalVariable(name: "witem", arg: 3, scope: !937, file: !226, line: 621, type: !175)
!943 = !DILocation(line: 621, column: 84, scope: !937)
!944 = !DILocalVariable(name: "node", scope: !937, file: !226, line: 623, type: !311)
!945 = !DILocation(line: 623, column: 15, scope: !937)
!946 = !DILocalVariable(name: "optlist", scope: !937, file: !226, line: 624, type: !554)
!947 = !DILocation(line: 624, column: 14, scope: !937)
!948 = !DILocalVariable(name: "item", scope: !937, file: !226, line: 625, type: !198)
!949 = !DILocation(line: 625, column: 8, scope: !937)
!950 = !DILocalVariable(name: "statusbar", scope: !937, file: !226, line: 625, type: !198)
!951 = !DILocation(line: 625, column: 15, scope: !937)
!952 = !DILocalVariable(name: "value", scope: !937, file: !226, line: 625, type: !198)
!953 = !DILocation(line: 625, column: 27, scope: !937)
!954 = !DILocalVariable(name: "free_arg", scope: !937, file: !226, line: 626, type: !175)
!955 = !DILocation(line: 626, column: 8, scope: !937)
!956 = !DILocalVariable(name: "index", scope: !937, file: !226, line: 627, type: !200)
!957 = !DILocation(line: 627, column: 6, scope: !937)
!958 = !DILocalVariable(name: "additem", scope: !937, file: !226, line: 628, type: !200)
!959 = !DILocation(line: 628, column: 6, scope: !937)
!960 = !DILocation(line: 628, column: 33, scope: !937)
!961 = !DILocation(line: 628, column: 24, scope: !937)
!962 = !DILocation(line: 628, column: 17, scope: !937)
!963 = !DILocation(line: 630, column: 22, scope: !964)
!964 = distinct !DILexicalBlock(scope: !937, file: !226, line: 630, column: 6)
!965 = !DILocation(line: 630, column: 7, scope: !964)
!966 = !DILocation(line: 630, column: 6, scope: !937)
!967 = !DILocation(line: 632, column: 3, scope: !964)
!968 = !DILocation(line: 634, column: 7, scope: !969)
!969 = distinct !DILexicalBlock(scope: !937, file: !226, line: 634, column: 6)
!970 = !DILocation(line: 634, column: 6, scope: !969)
!971 = !DILocation(line: 634, column: 17, scope: !969)
!972 = !DILocation(line: 634, column: 6, scope: !937)
!973 = !DILocation(line: 635, column: 3, scope: !974)
!974 = distinct !DILexicalBlock(scope: !969, file: !226, line: 634, column: 26)
!975 = distinct !{!975, !973}
!976 = !DILocation(line: 635, column: 24, scope: !977)
!977 = !DILexicalBlockFile(scope: !978, file: !226, discriminator: 1)
!978 = distinct !DILexicalBlock(scope: !974, file: !226, line: 635, column: 6)
!979 = !DILocation(line: 635, column: 8, scope: !977)
!980 = !DILocation(line: 635, column: 35, scope: !977)
!981 = distinct !{!981, !982}
!982 = !DILocation(line: 635, column: 35, scope: !978)
!983 = !DILocation(line: 635, column: 40, scope: !984)
!984 = !DILexicalBlockFile(scope: !985, file: !226, discriminator: 2)
!985 = distinct !DILexicalBlock(scope: !978, file: !226, line: 635, column: 38)
!986 = !DILocation(line: 635, column: 122, scope: !987)
!987 = !DILexicalBlockFile(scope: !984, file: !226, discriminator: 4)
!988 = !DILocation(line: 635, column: 137, scope: !984)
!989 = !DILocation(line: 635, column: 158, scope: !990)
!990 = !DILexicalBlockFile(scope: !978, file: !226, discriminator: 3)
!991 = !DILocation(line: 636, column: 2, scope: !974)
!992 = !DILocation(line: 638, column: 38, scope: !937)
!993 = !DILocation(line: 638, column: 49, scope: !937)
!994 = !DILocation(line: 638, column: 55, scope: !937)
!995 = !DILocation(line: 638, column: 9, scope: !937)
!996 = !DILocation(line: 638, column: 7, scope: !937)
!997 = !DILocation(line: 639, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !937, file: !226, line: 639, column: 6)
!999 = !DILocation(line: 639, column: 11, scope: !998)
!1000 = !DILocation(line: 639, column: 6, scope: !937)
!1001 = !DILocation(line: 640, column: 19, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !998, file: !226, line: 639, column: 19)
!1003 = !DILocation(line: 640, column: 3, scope: !1002)
!1004 = !DILocation(line: 641, column: 3, scope: !1002)
!1005 = !DILocation(line: 645, column: 8, scope: !937)
!1006 = !DILocation(line: 646, column: 30, scope: !937)
!1007 = !DILocation(line: 646, column: 10, scope: !937)
!1008 = !DILocation(line: 646, column: 8, scope: !937)
!1009 = !DILocation(line: 647, column: 6, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !937, file: !226, line: 647, column: 6)
!1011 = !DILocation(line: 647, column: 12, scope: !1010)
!1012 = !DILocation(line: 647, column: 6, scope: !937)
!1013 = !DILocation(line: 648, column: 29, scope: !1010)
!1014 = !DILocation(line: 648, column: 35, scope: !1010)
!1015 = !DILocation(line: 648, column: 11, scope: !1010)
!1016 = !DILocation(line: 648, column: 9, scope: !1010)
!1017 = !DILocation(line: 648, column: 3, scope: !1010)
!1018 = !DILocation(line: 649, column: 30, scope: !937)
!1019 = !DILocation(line: 649, column: 10, scope: !937)
!1020 = !DILocation(line: 649, column: 8, scope: !937)
!1021 = !DILocation(line: 650, column: 6, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !937, file: !226, line: 650, column: 6)
!1023 = !DILocation(line: 650, column: 12, scope: !1022)
!1024 = !DILocation(line: 650, column: 6, scope: !937)
!1025 = !DILocation(line: 651, column: 29, scope: !1022)
!1026 = !DILocation(line: 651, column: 35, scope: !1022)
!1027 = !DILocation(line: 651, column: 11, scope: !1022)
!1028 = !DILocation(line: 651, column: 42, scope: !1022)
!1029 = !DILocation(line: 651, column: 9, scope: !1022)
!1030 = !DILocation(line: 651, column: 3, scope: !1022)
!1031 = !DILocation(line: 654, column: 35, scope: !937)
!1032 = !DILocation(line: 654, column: 47, scope: !937)
!1033 = !DILocation(line: 654, column: 53, scope: !937)
!1034 = !DILocation(line: 654, column: 59, scope: !937)
!1035 = !DILocation(line: 654, column: 9, scope: !937)
!1036 = !DILocation(line: 654, column: 7, scope: !937)
!1037 = !DILocation(line: 657, column: 30, scope: !937)
!1038 = !DILocation(line: 657, column: 10, scope: !937)
!1039 = !DILocation(line: 657, column: 8, scope: !937)
!1040 = !DILocation(line: 658, column: 6, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !937, file: !226, line: 658, column: 6)
!1042 = !DILocation(line: 658, column: 12, scope: !1041)
!1043 = !DILocation(line: 658, column: 6, scope: !937)
!1044 = !DILocation(line: 658, column: 40, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1041, file: !226, discriminator: 1)
!1046 = !DILocation(line: 658, column: 52, scope: !1045)
!1047 = !DILocation(line: 658, column: 75, scope: !1045)
!1048 = !DILocation(line: 658, column: 70, scope: !1045)
!1049 = !DILocation(line: 658, column: 20, scope: !1050)
!1050 = !DILexicalBlockFile(scope: !1045, file: !226, discriminator: 2)
!1051 = !DILocation(line: 658, column: 20, scope: !1045)
!1052 = !DILocation(line: 660, column: 30, scope: !937)
!1053 = !DILocation(line: 660, column: 10, scope: !937)
!1054 = !DILocation(line: 660, column: 8, scope: !937)
!1055 = !DILocation(line: 661, column: 6, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !937, file: !226, line: 661, column: 6)
!1057 = !DILocation(line: 661, column: 12, scope: !1056)
!1058 = !DILocation(line: 661, column: 6, scope: !937)
!1059 = !DILocation(line: 662, column: 23, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1056, file: !226, line: 661, column: 20)
!1061 = !DILocation(line: 662, column: 35, scope: !1060)
!1062 = !DILocation(line: 662, column: 73, scope: !1060)
!1063 = !DILocation(line: 662, column: 54, scope: !1060)
!1064 = !DILocation(line: 662, column: 89, scope: !1060)
!1065 = !DILocation(line: 662, column: 3, scope: !1066)
!1066 = !DILexicalBlockFile(scope: !1060, file: !226, discriminator: 1)
!1067 = !DILocation(line: 665, column: 2, scope: !1060)
!1068 = !DILocation(line: 667, column: 2, scope: !937)
!1069 = !DILocation(line: 668, column: 18, scope: !937)
!1070 = !DILocation(line: 668, column: 2, scope: !937)
!1071 = !DILocation(line: 669, column: 1, scope: !937)
!1072 = !DILocation(line: 669, column: 1, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !937, file: !226, discriminator: 1)
!1074 = distinct !DISubprogram(name: "cmd_statusbar_removeitem", scope: !226, file: !226, line: 672, type: !545, isLocal: true, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!1075 = !DILocalVariable(name: "data", arg: 1, scope: !1074, file: !226, line: 672, type: !190)
!1076 = !DILocation(line: 672, column: 50, scope: !1074)
!1077 = !DILocalVariable(name: "server", arg: 2, scope: !1074, file: !226, line: 672, type: !175)
!1078 = !DILocation(line: 672, column: 62, scope: !1074)
!1079 = !DILocalVariable(name: "witem", arg: 3, scope: !1074, file: !226, line: 672, type: !175)
!1080 = !DILocation(line: 672, column: 76, scope: !1074)
!1081 = !DILocalVariable(name: "node", scope: !1074, file: !226, line: 674, type: !311)
!1082 = !DILocation(line: 674, column: 15, scope: !1074)
!1083 = !DILocalVariable(name: "item", scope: !1074, file: !226, line: 675, type: !198)
!1084 = !DILocation(line: 675, column: 8, scope: !1074)
!1085 = !DILocalVariable(name: "statusbar", scope: !1074, file: !226, line: 675, type: !198)
!1086 = !DILocation(line: 675, column: 15, scope: !1074)
!1087 = !DILocalVariable(name: "free_arg", scope: !1074, file: !226, line: 676, type: !175)
!1088 = !DILocation(line: 676, column: 8, scope: !1074)
!1089 = !DILocation(line: 677, column: 22, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1074, file: !226, line: 677, column: 6)
!1091 = !DILocation(line: 677, column: 7, scope: !1090)
!1092 = !DILocation(line: 677, column: 6, scope: !1074)
!1093 = !DILocation(line: 678, column: 3, scope: !1090)
!1094 = !DILocation(line: 680, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1074, file: !226, line: 680, column: 6)
!1096 = !DILocation(line: 680, column: 6, scope: !1095)
!1097 = !DILocation(line: 680, column: 17, scope: !1095)
!1098 = !DILocation(line: 680, column: 6, scope: !1074)
!1099 = !DILocation(line: 681, column: 3, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !226, line: 680, column: 26)
!1101 = distinct !{!1101, !1099}
!1102 = !DILocation(line: 681, column: 24, scope: !1103)
!1103 = !DILexicalBlockFile(scope: !1104, file: !226, discriminator: 1)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !226, line: 681, column: 6)
!1105 = !DILocation(line: 681, column: 8, scope: !1103)
!1106 = !DILocation(line: 681, column: 35, scope: !1103)
!1107 = distinct !{!1107, !1108}
!1108 = !DILocation(line: 681, column: 35, scope: !1104)
!1109 = !DILocation(line: 681, column: 40, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1111, file: !226, discriminator: 2)
!1111 = distinct !DILexicalBlock(scope: !1104, file: !226, line: 681, column: 38)
!1112 = !DILocation(line: 681, column: 122, scope: !1113)
!1113 = !DILexicalBlockFile(scope: !1110, file: !226, discriminator: 4)
!1114 = !DILocation(line: 681, column: 137, scope: !1110)
!1115 = !DILocation(line: 681, column: 158, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1104, file: !226, discriminator: 3)
!1117 = !DILocation(line: 682, column: 2, scope: !1100)
!1118 = !DILocation(line: 684, column: 38, scope: !1074)
!1119 = !DILocation(line: 684, column: 49, scope: !1074)
!1120 = !DILocation(line: 684, column: 9, scope: !1074)
!1121 = !DILocation(line: 684, column: 7, scope: !1074)
!1122 = !DILocation(line: 686, column: 6, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1074, file: !226, line: 686, column: 6)
!1124 = !DILocation(line: 686, column: 11, scope: !1123)
!1125 = !DILocation(line: 686, column: 6, scope: !1074)
!1126 = !DILocation(line: 687, column: 23, scope: !1123)
!1127 = !DILocation(line: 687, column: 35, scope: !1123)
!1128 = !DILocation(line: 687, column: 41, scope: !1123)
!1129 = !DILocation(line: 687, column: 3, scope: !1123)
!1130 = !DILocation(line: 689, column: 2, scope: !1074)
!1131 = !DILocation(line: 690, column: 18, scope: !1074)
!1132 = !DILocation(line: 690, column: 2, scope: !1074)
!1133 = !DILocation(line: 691, column: 1, scope: !1074)
!1134 = !DILocation(line: 691, column: 1, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1074, file: !226, discriminator: 1)
!1136 = distinct !DISubprogram(name: "statusbar_config_deinit", scope: !226, file: !226, line: 788, type: !290, isLocal: false, isDefinition: true, scopeLine: 789, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!1137 = !DILocation(line: 790, column: 2, scope: !1136)
!1138 = !DILocation(line: 791, column: 2, scope: !1136)
!1139 = !DILocation(line: 793, column: 2, scope: !1136)
!1140 = !DILocation(line: 794, column: 2, scope: !1136)
!1141 = !DILocation(line: 795, column: 2, scope: !1136)
!1142 = !DILocation(line: 796, column: 2, scope: !1136)
!1143 = !DILocation(line: 797, column: 2, scope: !1136)
!1144 = !DILocation(line: 798, column: 2, scope: !1136)
!1145 = !DILocation(line: 799, column: 2, scope: !1136)
!1146 = !DILocation(line: 800, column: 2, scope: !1136)
!1147 = !DILocation(line: 801, column: 2, scope: !1136)
!1148 = !DILocation(line: 802, column: 1, scope: !1136)
!1149 = distinct !DISubprogram(name: "statusbar_reset_defaults", scope: !226, file: !226, line: 107, type: !290, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !236)
!1150 = !DILocalVariable(name: "config", scope: !1149, file: !226, line: 109, type: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !63, line: 18, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !63, line: 49, size: 576, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1255, !1418, !1419}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !1153, file: !63, line: 50, baseType: !198, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !1153, file: !63, line: 51, baseType: !200, size: 32, align: 32, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !1153, file: !63, line: 52, baseType: !200, size: 32, align: 32, offset: 96)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !1153, file: !63, line: 54, baseType: !198, size: 64, align: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !1153, file: !63, line: 55, baseType: !311, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1153, file: !63, line: 56, baseType: !554, size: 64, align: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !1153, file: !63, line: 57, baseType: !554, size: 64, align: 64, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !1153, file: !63, line: 59, baseType: !1163, size: 64, align: 64, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !4, line: 37, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !4, line: 169, size: 1152, align: 64, elements: !1166)
!1166 = !{!1167, !1168, !1170, !1171, !1174, !1179, !1211, !1213, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1165, file: !4, line: 172, baseType: !183, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !1165, file: !4, line: 173, baseType: !1169, size: 32, align: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !184, line: 55, baseType: !220)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !1165, file: !4, line: 176, baseType: !1169, size: 32, align: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !1165, file: !4, line: 179, baseType: !1172, size: 64, align: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !1165, file: !4, line: 182, baseType: !1175, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !1177, line: 36, baseType: !1178)
!1177 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !1177, line: 36, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1165, file: !4, line: 185, baseType: !1180, size: 64, align: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !4, line: 38, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !4, line: 127, size: 320, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !1182, file: !4, line: 131, baseType: !187, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !1182, file: !4, line: 132, baseType: !187, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !1182, file: !4, line: 133, baseType: !187, size: 64, align: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !1182, file: !4, line: 134, baseType: !187, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !1182, file: !4, line: 138, baseType: !1169, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !1182, file: !4, line: 143, baseType: !1169, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !1182, file: !4, line: 144, baseType: !1169, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !1182, file: !4, line: 145, baseType: !1169, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !1182, file: !4, line: 146, baseType: !1169, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !1182, file: !4, line: 147, baseType: !1169, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !1182, file: !4, line: 148, baseType: !1169, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !1182, file: !4, line: 149, baseType: !1169, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !1182, file: !4, line: 150, baseType: !1169, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !1182, file: !4, line: 151, baseType: !1169, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !1182, file: !4, line: 152, baseType: !1169, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !1182, file: !4, line: 153, baseType: !1169, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !1182, file: !4, line: 154, baseType: !1169, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !1182, file: !4, line: 155, baseType: !1169, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !1182, file: !4, line: 156, baseType: !1169, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !1182, file: !4, line: 157, baseType: !1169, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !1182, file: !4, line: 158, baseType: !1169, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !1182, file: !4, line: 159, baseType: !1169, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !1182, file: !4, line: 160, baseType: !1169, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !1182, file: !4, line: 161, baseType: !1169, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !1182, file: !4, line: 162, baseType: !1169, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !1182, file: !4, line: 163, baseType: !1169, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !1182, file: !4, line: 166, baseType: !1169, size: 32, align: 32, offset: 288)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !1165, file: !4, line: 188, baseType: !1212, size: 32, align: 32, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !4, line: 109, baseType: !3)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1165, file: !4, line: 189, baseType: !1214, size: 64, align: 64, offset: 384)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !4, line: 39, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !4, line: 111, size: 64, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1222, !1223, !1224, !1227, !1230, !1231, !1232, !1233, !1236}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !1215, file: !4, line: 113, baseType: !183, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !1215, file: !4, line: 114, baseType: !187, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !1215, file: !4, line: 115, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !184, line: 54, baseType: !1221)
!1221 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !1215, file: !4, line: 116, baseType: !1220, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !1215, file: !4, line: 117, baseType: !1220, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !1215, file: !4, line: 118, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !1226, line: 52, baseType: !1221)
!1226 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !1215, file: !4, line: 119, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !184, line: 58, baseType: !1229)
!1229 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !1215, file: !4, line: 120, baseType: !1220, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !1215, file: !4, line: 121, baseType: !187, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !1215, file: !4, line: 122, baseType: !187, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !1215, file: !4, line: 123, baseType: !1234, size: 8, align: 8)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !184, line: 52, baseType: !1235)
!1235 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !1215, file: !4, line: 124, baseType: !1169, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1165, file: !4, line: 190, baseType: !1169, size: 32, align: 32, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1165, file: !4, line: 191, baseType: !1169, size: 32, align: 32, offset: 480)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !1165, file: !4, line: 194, baseType: !1212, size: 32, align: 32, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !1165, file: !4, line: 195, baseType: !1214, size: 64, align: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !1165, file: !4, line: 196, baseType: !1169, size: 32, align: 32, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !1165, file: !4, line: 197, baseType: !1169, size: 32, align: 32, offset: 672)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !1165, file: !4, line: 201, baseType: !554, size: 64, align: 64, offset: 704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !1165, file: !4, line: 202, baseType: !221, size: 32, align: 32, offset: 768)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1165, file: !4, line: 203, baseType: !1172, size: 64, align: 64, offset: 832)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !1165, file: !4, line: 204, baseType: !1172, size: 64, align: 64, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1165, file: !4, line: 205, baseType: !187, size: 64, align: 64, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !1165, file: !4, line: 206, baseType: !1169, size: 32, align: 32, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !1165, file: !4, line: 210, baseType: !1250, size: 64, align: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !4, line: 41, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !1163, !187, !1254}
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !184, line: 50, baseType: !221)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1153, file: !63, line: 62, baseType: !1256, size: 64, align: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !31, line: 41, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !31, line: 97, size: 896, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1385, !1386, !1391, !1392, !1393, !1394, !1395, !1404, !1405, !1406, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1258, file: !31, line: 100, baseType: !221, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !1258, file: !31, line: 101, baseType: !1262, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !31, line: 42, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !31, line: 131, size: 512, align: 64, elements: !1265)
!1265 = !{!1266, !1285, !1289, !1295, !1299, !1372, !1376, !1381}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !1264, file: !31, line: 133, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!1270, !1256, !187, !1271, !1272, !1273}
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !31, line: 75, baseType: !30)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !1226, line: 66, baseType: !1221)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !1276, line: 42, baseType: !1277)
!1276 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !1276, line: 44, size: 128, align: 64, elements: !1278)
!1278 = !{!1279, !1283, !1284}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !1277, file: !1276, line: 46, baseType: !1280, size: 32, align: 32)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !1281, line: 36, baseType: !1282)
!1281 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !1226, line: 45, baseType: !220)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1277, file: !1276, line: 47, baseType: !221, size: 32, align: 32, offset: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1277, file: !1276, line: 48, baseType: !187, size: 64, align: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !1264, file: !31, line: 138, baseType: !1286, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!1270, !1256, !1172, !1271, !1272, !1273}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !1264, file: !31, line: 143, baseType: !1290, size: 64, align: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!1270, !1256, !1293, !1294, !1273}
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !1226, line: 51, baseType: !186)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !31, line: 82, baseType: !37)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !1264, file: !31, line: 147, baseType: !1296, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!1270, !1256, !1273}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !1264, file: !31, line: 149, baseType: !1300, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!1303, !1256, !1371}
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !43, line: 64, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !43, line: 171, size: 768, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1328, !1355, !1356, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !1305, file: !43, line: 174, baseType: !183, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !1305, file: !43, line: 175, baseType: !1309, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !43, line: 77, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !43, line: 196, size: 192, align: 64, elements: !1312)
!1312 = !{!1313, !1317, !1318}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1311, file: !43, line: 198, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !183}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !1311, file: !43, line: 199, baseType: !1314, size: 64, align: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !1311, file: !43, line: 200, baseType: !1319, size: 64, align: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{null, !183, !1303, !1322, !1327}
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !43, line: 155, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!1254, !183}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !1305, file: !43, line: 177, baseType: !1329, size: 64, align: 64, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !43, line: 130, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !43, line: 214, size: 384, align: 64, elements: !1333)
!1333 = !{!1334, !1339, !1343, !1347, !1351, !1352}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !1332, file: !43, line: 216, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!1254, !1303, !1338}
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !1332, file: !43, line: 218, baseType: !1340, size: 64, align: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1254, !1303}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !1332, file: !43, line: 219, baseType: !1344, size: 64, align: 64, offset: 128)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!1254, !1303, !1323, !183}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !1332, file: !43, line: 222, baseType: !1348, size: 64, align: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{null, !1303}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !1332, file: !43, line: 226, baseType: !1323, size: 64, align: 64, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !1332, file: !43, line: 227, baseType: !1353, size: 64, align: 64, offset: 320)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !43, line: 212, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !1305, file: !43, line: 178, baseType: !1169, size: 32, align: 32, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1305, file: !43, line: 180, baseType: !1357, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !43, line: 48, baseType: !1359)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !43, line: 48, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !1305, file: !43, line: 182, baseType: !221, size: 32, align: 32, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1305, file: !43, line: 183, baseType: !1169, size: 32, align: 32, offset: 352)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !1305, file: !43, line: 184, baseType: !1169, size: 32, align: 32, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !1305, file: !43, line: 186, baseType: !205, size: 64, align: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1305, file: !43, line: 188, baseType: !1303, size: 64, align: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1305, file: !43, line: 189, baseType: !1303, size: 64, align: 64, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1305, file: !43, line: 191, baseType: !198, size: 64, align: 64, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1305, file: !43, line: 193, baseType: !1368, size: 64, align: 64, offset: 704)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !43, line: 65, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !43, line: 65, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !43, line: 39, baseType: !42)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !1264, file: !31, line: 151, baseType: !1373, size: 64, align: 64, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{null, !1256}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !1264, file: !31, line: 152, baseType: !1377, size: 64, align: 64, offset: 384)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{!1270, !1256, !1380, !1273}
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !31, line: 95, baseType: !51)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !1264, file: !31, line: 155, baseType: !1382, size: 64, align: 64, offset: 448)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!1380, !1256}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1258, file: !31, line: 103, baseType: !187, size: 64, align: 64, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !1258, file: !31, line: 104, baseType: !1387, size: 64, align: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !1388, line: 77, baseType: !1389)
!1388 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !1388, line: 77, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !1258, file: !31, line: 105, baseType: !1387, size: 64, align: 64, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !1258, file: !31, line: 106, baseType: !187, size: 64, align: 64, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !1258, file: !31, line: 107, baseType: !1169, size: 32, align: 32, offset: 384)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1258, file: !31, line: 109, baseType: !1271, size: 64, align: 64, offset: 448)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !1258, file: !31, line: 110, baseType: !1396, size: 64, align: 64, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !1398, line: 39, baseType: !1399)
!1398 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !1398, line: 41, size: 192, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1399, file: !1398, line: 43, baseType: !187, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1399, file: !1398, line: 44, baseType: !1271, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !1399, file: !1398, line: 45, baseType: !1271, size: 64, align: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !1258, file: !31, line: 111, baseType: !1396, size: 64, align: 64, offset: 576)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !1258, file: !31, line: 112, baseType: !1396, size: 64, align: 64, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !1258, file: !31, line: 113, baseType: !1407, size: 48, align: 8, offset: 704)
!1407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, align: 8, elements: !1408)
!1408 = !{!1409}
!1409 = !DISubrange(count: 6)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !1258, file: !31, line: 117, baseType: !1169, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !1258, file: !31, line: 118, baseType: !1169, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !1258, file: !31, line: 119, baseType: !1169, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !1258, file: !31, line: 120, baseType: !1169, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
