; ModuleID = './line157-servers-idle.o.i'
source_filename = "./line157-servers-idle.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47, globals: !695)
!1 = !DIFile(filename: "line157-servers-idle.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !{!48, !49, !53, !55, !63, !70, !91, !95, !388}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !62}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !51, line: 50, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !51, line: 49, baseType: !61)
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !51, line: 77, baseType: !48)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !64, line: 9, baseType: !65)
!64 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68, !68, !68, !68, !68, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_IDLE_REC", file: !72, line: 38, baseType: !73)
!72 = !DIFile(filename: "servers-idle.c", directory: "/home/lichi/Desktop/irssi/task1")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 28, size: 448, align: 64, elements: !74)
!74 = !{!75, !77, !78, !79, !80, !81, !82, !83}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !73, file: !72, line: 29, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !73, file: !72, line: 30, baseType: !76, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !73, file: !72, line: 31, baseType: !61, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_cmd", scope: !73, file: !72, line: 33, baseType: !76, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !73, file: !72, line: 34, baseType: !61, size: 32, align: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !73, file: !72, line: 35, baseType: !61, size: 32, align: 32, offset: 288)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "failure_signal", scope: !73, file: !72, line: 36, baseType: !76, size: 64, align: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !73, file: !72, line: 37, baseType: !84, size: 64, align: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !86, line: 37, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !86, line: 39, size: 128, align: 64, elements: !88)
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !86, line: 41, baseType: !62, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 42, baseType: !84, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !51, line: 88, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !62, !62}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !97, line: 6, baseType: !98)
!97 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !99, line: 42, size: 39168, align: 64, elements: !100)
!99 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!100 = !{!101, !103, !104, !105, !333, !338, !339, !340, !341, !342, !343, !344, !345, !346, !350, !351, !355, !356, !357, !361, !366, !367, !368, !369, !370, !371, !372, !373, !380, !381, !382, !383, !384, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !692, !694}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !102, line: 3, baseType: !61, size: 32, align: 32)
!102 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !98, file: !102, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !98, file: !102, line: 6, baseType: !61, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !98, file: !102, line: 8, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !97, line: 5, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !99, line: 24, size: 2496, align: 64, elements: !109)
!109 = !{!110, !112, !113, !114, !115, !116, !117, !118, !119, !121, !122, !123, !124, !125, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !111, line: 3, baseType: !61, size: 32, align: 32)
!111 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !108, file: !111, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !108, file: !111, line: 6, baseType: !61, size: 32, align: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !108, file: !111, line: 9, baseType: !76, size: 64, align: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !108, file: !111, line: 10, baseType: !61, size: 32, align: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !108, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !108, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !108, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !108, file: !111, line: 13, baseType: !120, size: 16, align: 16, offset: 448)
!120 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !108, file: !111, line: 14, baseType: !76, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !108, file: !111, line: 15, baseType: !76, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !108, file: !111, line: 16, baseType: !61, size: 32, align: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !108, file: !111, line: 17, baseType: !76, size: 64, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !108, file: !111, line: 19, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !128, line: 99, baseType: !129)
!128 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !128, line: 99, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !108, file: !111, line: 19, baseType: !126, size: 64, align: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !108, file: !111, line: 21, baseType: !76, size: 64, align: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !108, file: !111, line: 22, baseType: !76, size: 64, align: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !108, file: !111, line: 23, baseType: !76, size: 64, align: 64, offset: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !108, file: !111, line: 24, baseType: !76, size: 64, align: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !108, file: !111, line: 26, baseType: !76, size: 64, align: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !108, file: !111, line: 27, baseType: !76, size: 64, align: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !108, file: !111, line: 28, baseType: !76, size: 64, align: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !108, file: !111, line: 29, baseType: !76, size: 64, align: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !108, file: !111, line: 30, baseType: !76, size: 64, align: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !108, file: !111, line: 31, baseType: !76, size: 64, align: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !108, file: !111, line: 32, baseType: !76, size: 64, align: 64, offset: 1536)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !108, file: !111, line: 33, baseType: !76, size: 64, align: 64, offset: 1600)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !108, file: !111, line: 35, baseType: !144, size: 64, align: 64, offset: 1664)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !147)
!147 = !{!148, !149, !278, !279, !284, !285, !286, !287, !288, !297, !298, !299, !303, !304, !305, !306, !307, !308, !309, !310}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !146, file: !4, line: 100, baseType: !60, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !146, file: !4, line: 101, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !153)
!153 = !{!154, !176, !182, !189, !193, !265, !269, !274}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !152, file: !4, line: 133, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!158, !144, !49, !159, !162, !163}
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !160, line: 66, baseType: !161)
!160 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !166, line: 42, baseType: !167)
!166 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !166, line: 44, size: 128, align: 64, elements: !168)
!168 = !{!169, !174, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !167, file: !166, line: 46, baseType: !170, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !171, line: 36, baseType: !172)
!171 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !160, line: 45, baseType: !173)
!173 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !167, file: !166, line: 47, baseType: !60, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !167, file: !166, line: 48, baseType: !49, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !152, file: !4, line: 138, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!158, !144, !180, !159, !162, !163}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !152, file: !4, line: 143, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!158, !144, !186, !188, !163}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !160, line: 51, baseType: !187)
!187 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !152, file: !4, line: 147, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!158, !144, !163}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !152, file: !4, line: 149, baseType: !194, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !144, !264}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !200)
!200 = !{!201, !202, !218, !247, !249, !253, !254, !255, !256, !257, !258, !259, !260}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !199, file: !16, line: 174, baseType: !62, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !199, file: !16, line: 175, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !206)
!206 = !{!207, !211, !212}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !205, file: !16, line: 198, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !62}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !205, file: !16, line: 199, baseType: !208, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !205, file: !16, line: 200, baseType: !213, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !62, !197, !216, !217}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !199, file: !16, line: 177, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !223)
!223 = !{!224, !229, !233, !237, !241, !242}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !222, file: !16, line: 216, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!59, !197, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !222, file: !16, line: 218, baseType: !230, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!59, !197}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !222, file: !16, line: 219, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!59, !197, !55, !62}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !222, file: !16, line: 222, baseType: !238, size: 64, align: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !197}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !222, file: !16, line: 226, baseType: !55, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !222, file: !16, line: 227, baseType: !243, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !199, file: !16, line: 178, baseType: !248, size: 32, align: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !51, line: 55, baseType: !173)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !199, file: !16, line: 180, baseType: !250, size: 64, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !199, file: !16, line: 182, baseType: !60, size: 32, align: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !199, file: !16, line: 183, baseType: !248, size: 32, align: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !199, file: !16, line: 184, baseType: !248, size: 32, align: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !199, file: !16, line: 186, baseType: !84, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !199, file: !16, line: 188, baseType: !197, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !199, file: !16, line: 189, baseType: !197, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !16, line: 191, baseType: !76, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !199, file: !16, line: 193, baseType: !261, size: 64, align: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !152, file: !4, line: 151, baseType: !266, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !144}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !152, file: !4, line: 152, baseType: !270, size: 64, align: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!158, !144, !273, !163}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !152, file: !4, line: 155, baseType: !275, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!273, !144}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !146, file: !4, line: 103, baseType: !49, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !146, file: !4, line: 104, baseType: !280, size: 64, align: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !281, line: 77, baseType: !282)
!281 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !281, line: 77, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !146, file: !4, line: 105, baseType: !280, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !146, file: !4, line: 106, baseType: !49, size: 64, align: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !146, file: !4, line: 107, baseType: !248, size: 32, align: 32, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !146, file: !4, line: 109, baseType: !159, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !146, file: !4, line: 110, baseType: !289, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !291, line: 39, baseType: !292)
!291 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !291, line: 41, size: 192, align: 64, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !292, file: !291, line: 43, baseType: !49, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !292, file: !291, line: 44, baseType: !159, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !292, file: !291, line: 45, baseType: !159, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !146, file: !4, line: 111, baseType: !289, size: 64, align: 64, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !146, file: !4, line: 112, baseType: !289, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !146, file: !4, line: 113, baseType: !300, size: 48, align: 8, offset: 704)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 48, align: 8, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 6)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !146, file: !4, line: 117, baseType: !248, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !146, file: !4, line: 118, baseType: !248, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !146, file: !4, line: 119, baseType: !248, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !146, file: !4, line: 120, baseType: !248, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !146, file: !4, line: 121, baseType: !248, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !146, file: !4, line: 122, baseType: !248, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !146, file: !4, line: 124, baseType: !62, size: 64, align: 64, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !146, file: !4, line: 125, baseType: !62, size: 64, align: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !108, file: !111, line: 38, baseType: !173, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !108, file: !111, line: 39, baseType: !173, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !108, file: !111, line: 40, baseType: !173, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !108, file: !111, line: 41, baseType: !173, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !108, file: !111, line: 42, baseType: !173, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !108, file: !111, line: 43, baseType: !173, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !108, file: !111, line: 44, baseType: !173, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !108, file: !111, line: 45, baseType: !173, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !108, file: !111, line: 46, baseType: !76, size: 64, align: 64, offset: 1792)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !108, file: !111, line: 47, baseType: !76, size: 64, align: 64, offset: 1856)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !108, file: !99, line: 27, baseType: !76, size: 64, align: 64, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !108, file: !99, line: 28, baseType: !76, size: 64, align: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !108, file: !99, line: 30, baseType: !61, size: 32, align: 32, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !108, file: !99, line: 31, baseType: !76, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !108, file: !99, line: 32, baseType: !76, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !108, file: !99, line: 34, baseType: !61, size: 32, align: 32, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !108, file: !99, line: 35, baseType: !61, size: 32, align: 32, offset: 2272)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !108, file: !99, line: 36, baseType: !61, size: 32, align: 32, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !108, file: !99, line: 38, baseType: !61, size: 32, align: 32, offset: 2336)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !108, file: !99, line: 38, baseType: !61, size: 32, align: 32, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !108, file: !99, line: 38, baseType: !61, size: 32, align: 32, offset: 2400)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !108, file: !99, line: 38, baseType: !61, size: 32, align: 32, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !98, file: !102, line: 9, baseType: !334, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !335, line: 75, baseType: !336)
!335 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !337, line: 139, baseType: !187)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!338 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !98, file: !102, line: 10, baseType: !334, size: 64, align: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !98, file: !102, line: 12, baseType: !76, size: 64, align: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !98, file: !102, line: 13, baseType: !76, size: 64, align: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !98, file: !102, line: 15, baseType: !173, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !98, file: !102, line: 16, baseType: !173, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !98, file: !102, line: 17, baseType: !173, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !98, file: !102, line: 18, baseType: !173, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !98, file: !102, line: 19, baseType: !173, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !98, file: !102, line: 21, baseType: !347, size: 64, align: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !128, line: 102, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !128, line: 102, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !98, file: !102, line: 22, baseType: !61, size: 32, align: 32, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !98, file: !102, line: 25, baseType: !352, size: 128, align: 64, offset: 640)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, align: 64, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 2)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !98, file: !102, line: 26, baseType: !61, size: 32, align: 32, offset: 768)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !98, file: !102, line: 27, baseType: !61, size: 32, align: 32, offset: 800)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !98, file: !102, line: 29, baseType: !358, size: 64, align: 64, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !128, line: 103, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !128, line: 103, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !98, file: !102, line: 30, baseType: !362, size: 64, align: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !364, line: 37, baseType: !365)
!364 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !364, line: 37, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !98, file: !102, line: 32, baseType: !76, size: 64, align: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !98, file: !102, line: 33, baseType: !76, size: 64, align: 64, offset: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !98, file: !102, line: 34, baseType: !76, size: 64, align: 64, offset: 1088)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !98, file: !102, line: 35, baseType: !173, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !98, file: !102, line: 36, baseType: !173, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !98, file: !102, line: 37, baseType: !173, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !98, file: !102, line: 38, baseType: !173, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !98, file: !102, line: 40, baseType: !374, size: 128, align: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !51, line: 504, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !51, line: 506, size: 128, align: 64, elements: !376)
!376 = !{!377, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !375, file: !51, line: 508, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !51, line: 48, baseType: !187)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !375, file: !51, line: 509, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !98, file: !102, line: 41, baseType: !334, size: 64, align: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !98, file: !102, line: 42, baseType: !61, size: 32, align: 32, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !98, file: !102, line: 44, baseType: !84, size: 64, align: 64, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !98, file: !102, line: 45, baseType: !84, size: 64, align: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !98, file: !102, line: 53, baseType: !385, size: 64, align: 64, offset: 1600)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388, !53, !61}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !128, line: 107, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !391, line: 30, size: 2240, align: 64, elements: !392)
!391 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!392 = !{!393, !394, !395, !396, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !476, !480, !484, !489, !568, !575, !579}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !102, line: 3, baseType: !61, size: 32, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !390, file: !102, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !390, file: !102, line: 6, baseType: !61, size: 32, align: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !390, file: !102, line: 8, baseType: !397, size: 64, align: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !128, line: 113, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !391, line: 25, size: 1920, align: 64, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !111, line: 3, baseType: !61, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !399, file: !111, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !399, file: !111, line: 6, baseType: !61, size: 32, align: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !399, file: !111, line: 9, baseType: !76, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !399, file: !111, line: 10, baseType: !61, size: 32, align: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !399, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !399, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !399, file: !111, line: 11, baseType: !76, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !399, file: !111, line: 13, baseType: !120, size: 16, align: 16, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !399, file: !111, line: 14, baseType: !76, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !399, file: !111, line: 15, baseType: !76, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !399, file: !111, line: 16, baseType: !61, size: 32, align: 32, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !399, file: !111, line: 17, baseType: !76, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !399, file: !111, line: 19, baseType: !126, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !399, file: !111, line: 19, baseType: !126, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !399, file: !111, line: 21, baseType: !76, size: 64, align: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !399, file: !111, line: 22, baseType: !76, size: 64, align: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !399, file: !111, line: 23, baseType: !76, size: 64, align: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !399, file: !111, line: 24, baseType: !76, size: 64, align: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !399, file: !111, line: 26, baseType: !76, size: 64, align: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !399, file: !111, line: 27, baseType: !76, size: 64, align: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !399, file: !111, line: 28, baseType: !76, size: 64, align: 64, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !399, file: !111, line: 29, baseType: !76, size: 64, align: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !399, file: !111, line: 30, baseType: !76, size: 64, align: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !399, file: !111, line: 31, baseType: !76, size: 64, align: 64, offset: 1472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !399, file: !111, line: 32, baseType: !76, size: 64, align: 64, offset: 1536)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !399, file: !111, line: 33, baseType: !76, size: 64, align: 64, offset: 1600)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !399, file: !111, line: 35, baseType: !144, size: 64, align: 64, offset: 1664)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !399, file: !111, line: 38, baseType: !173, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !399, file: !111, line: 39, baseType: !173, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !399, file: !111, line: 40, baseType: !173, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !399, file: !111, line: 41, baseType: !173, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !399, file: !111, line: 42, baseType: !173, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !399, file: !111, line: 43, baseType: !173, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !399, file: !111, line: 44, baseType: !173, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !399, file: !111, line: 45, baseType: !173, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !399, file: !111, line: 46, baseType: !76, size: 64, align: 64, offset: 1792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !399, file: !111, line: 47, baseType: !76, size: 64, align: 64, offset: 1856)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !390, file: !102, line: 9, baseType: !334, size: 64, align: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !390, file: !102, line: 10, baseType: !334, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !102, line: 12, baseType: !76, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !390, file: !102, line: 13, baseType: !76, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !390, file: !102, line: 15, baseType: !173, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !390, file: !102, line: 16, baseType: !173, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !390, file: !102, line: 17, baseType: !173, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !390, file: !102, line: 18, baseType: !173, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !390, file: !102, line: 19, baseType: !173, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !390, file: !102, line: 21, baseType: !347, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !390, file: !102, line: 22, baseType: !61, size: 32, align: 32, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !390, file: !102, line: 25, baseType: !352, size: 128, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !390, file: !102, line: 26, baseType: !61, size: 32, align: 32, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !390, file: !102, line: 27, baseType: !61, size: 32, align: 32, offset: 800)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !390, file: !102, line: 29, baseType: !358, size: 64, align: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !390, file: !102, line: 30, baseType: !362, size: 64, align: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !390, file: !102, line: 32, baseType: !76, size: 64, align: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !390, file: !102, line: 33, baseType: !76, size: 64, align: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !390, file: !102, line: 34, baseType: !76, size: 64, align: 64, offset: 1088)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !390, file: !102, line: 35, baseType: !173, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !390, file: !102, line: 36, baseType: !173, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !390, file: !102, line: 37, baseType: !173, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !390, file: !102, line: 38, baseType: !173, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !390, file: !102, line: 40, baseType: !374, size: 128, align: 64, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !390, file: !102, line: 41, baseType: !334, size: 64, align: 64, offset: 1344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !390, file: !102, line: 42, baseType: !61, size: 32, align: 32, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !390, file: !102, line: 44, baseType: !84, size: 64, align: 64, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !390, file: !102, line: 45, baseType: !84, size: 64, align: 64, offset: 1536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !390, file: !102, line: 53, baseType: !385, size: 64, align: 64, offset: 1600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !390, file: !102, line: 55, baseType: !469, size: 64, align: 64, offset: 1664)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!61, !388, !52}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !390, file: !102, line: 57, baseType: !473, size: 64, align: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!61, !388, !53}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !390, file: !102, line: 60, baseType: !477, size: 64, align: 64, offset: 1792)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!53, !388}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !390, file: !102, line: 62, baseType: !481, size: 64, align: 64, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !388, !53, !53, !61}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !390, file: !102, line: 65, baseType: !485, size: 64, align: 64, offset: 1920)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !388, !53, !53}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !390, file: !102, line: 69, baseType: !490, size: 64, align: 64, offset: 1984)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !388, !53}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !128, line: 109, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !496, line: 15, size: 1408, align: 64, elements: !497)
!496 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !516, !520, !522, !523, !524, !525, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !499, line: 3, baseType: !61, size: 32, align: 32)
!499 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !495, file: !499, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !495, file: !499, line: 5, baseType: !362, size: 64, align: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !495, file: !499, line: 7, baseType: !48, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !495, file: !499, line: 8, baseType: !388, size: 64, align: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !495, file: !499, line: 9, baseType: !76, size: 64, align: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !499, line: 10, baseType: !76, size: 64, align: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !495, file: !499, line: 11, baseType: !334, size: 64, align: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !495, file: !499, line: 12, baseType: !61, size: 32, align: 32, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !495, file: !499, line: 13, baseType: !76, size: 64, align: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !495, file: !499, line: 15, baseType: !510, size: 64, align: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !128, line: 108, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !128, line: 108, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !495, file: !499, line: 17, baseType: !517, size: 64, align: 64, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!53, !513}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !495, file: !521, line: 5, baseType: !76, size: 64, align: 64, offset: 704)
!521 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !495, file: !521, line: 6, baseType: !76, size: 64, align: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !495, file: !521, line: 7, baseType: !334, size: 64, align: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !495, file: !521, line: 9, baseType: !362, size: 64, align: 64, offset: 896)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !495, file: !521, line: 10, baseType: !526, size: 64, align: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !128, line: 111, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !529, line: 13, size: 576, align: 64, elements: !530)
!529 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!530 = !{!531, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !549, !550}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !532, line: 3, baseType: !61, size: 32, align: 32)
!532 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !528, file: !532, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !528, file: !532, line: 6, baseType: !334, size: 64, align: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !528, file: !532, line: 8, baseType: !76, size: 64, align: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !528, file: !532, line: 9, baseType: !76, size: 64, align: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !528, file: !532, line: 10, baseType: !76, size: 64, align: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !528, file: !532, line: 11, baseType: !61, size: 32, align: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !528, file: !532, line: 14, baseType: !173, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !528, file: !532, line: 15, baseType: !173, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !528, file: !532, line: 18, baseType: !173, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !528, file: !532, line: 19, baseType: !173, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !528, file: !532, line: 20, baseType: !173, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !528, file: !532, line: 21, baseType: !173, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !528, file: !532, line: 22, baseType: !546, size: 64, align: 8, offset: 360)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !528, file: !532, line: 26, baseType: !48, size: 64, align: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !532, line: 28, baseType: !526, size: 64, align: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !495, file: !521, line: 12, baseType: !173, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !495, file: !521, line: 13, baseType: !76, size: 64, align: 64, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !495, file: !521, line: 14, baseType: !61, size: 32, align: 32, offset: 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !495, file: !521, line: 15, baseType: !76, size: 64, align: 64, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !495, file: !521, line: 17, baseType: !173, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !495, file: !521, line: 18, baseType: !173, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !495, file: !521, line: 19, baseType: !173, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !495, file: !521, line: 20, baseType: !173, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !495, file: !521, line: 22, baseType: !173, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !495, file: !521, line: 23, baseType: !173, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !495, file: !521, line: 24, baseType: !173, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !495, file: !521, line: 25, baseType: !173, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !495, file: !521, line: 26, baseType: !173, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !495, file: !521, line: 31, baseType: !565, size: 64, align: 64, offset: 1344)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!76, !493}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !390, file: !102, line: 70, baseType: !569, size: 64, align: 64, offset: 2048)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!572, !388, !53}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !128, line: 110, baseType: !574)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !128, line: 110, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !390, file: !102, line: 71, baseType: !576, size: 64, align: 64, offset: 2112)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!61, !53, !53}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !390, file: !102, line: 73, baseType: !576, size: 64, align: 64, offset: 2176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !98, file: !102, line: 55, baseType: !469, size: 64, align: 64, offset: 1664)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !98, file: !102, line: 57, baseType: !473, size: 64, align: 64, offset: 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !98, file: !102, line: 60, baseType: !477, size: 64, align: 64, offset: 1792)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !98, file: !102, line: 62, baseType: !481, size: 64, align: 64, offset: 1856)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !98, file: !102, line: 65, baseType: !485, size: 64, align: 64, offset: 1920)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !98, file: !102, line: 69, baseType: !490, size: 64, align: 64, offset: 1984)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !98, file: !102, line: 70, baseType: !569, size: 64, align: 64, offset: 2048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !98, file: !102, line: 71, baseType: !576, size: 64, align: 64, offset: 2112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !98, file: !102, line: 73, baseType: !576, size: 64, align: 64, offset: 2176)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !98, file: !99, line: 46, baseType: !84, size: 64, align: 64, offset: 2240)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !98, file: !99, line: 47, baseType: !84, size: 64, align: 64, offset: 2304)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !98, file: !99, line: 48, baseType: !592, size: 64, align: 64, offset: 2368)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !97, line: 8, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !97, line: 8, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !98, file: !99, line: 49, baseType: !84, size: 64, align: 64, offset: 2432)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !98, file: !99, line: 51, baseType: !76, size: 64, align: 64, offset: 2496)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !98, file: !99, line: 53, baseType: !76, size: 64, align: 64, offset: 2560)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !98, file: !99, line: 54, baseType: !76, size: 64, align: 64, offset: 2624)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !98, file: !99, line: 55, baseType: !76, size: 64, align: 64, offset: 2688)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !98, file: !99, line: 56, baseType: !76, size: 64, align: 64, offset: 2752)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !98, file: !99, line: 57, baseType: !61, size: 32, align: 32, offset: 2816)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !98, file: !99, line: 59, baseType: !173, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !98, file: !99, line: 60, baseType: !173, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !98, file: !99, line: 62, baseType: !173, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !98, file: !99, line: 63, baseType: !173, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !98, file: !99, line: 64, baseType: !173, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !98, file: !99, line: 65, baseType: !173, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !98, file: !99, line: 66, baseType: !173, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !98, file: !99, line: 67, baseType: !173, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !98, file: !99, line: 68, baseType: !173, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !98, file: !99, line: 69, baseType: !173, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !98, file: !99, line: 70, baseType: !173, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !98, file: !99, line: 71, baseType: !173, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !98, file: !99, line: 72, baseType: !173, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !98, file: !99, line: 74, baseType: !61, size: 32, align: 32, offset: 2880)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !98, file: !99, line: 75, baseType: !61, size: 32, align: 32, offset: 2912)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !98, file: !99, line: 76, baseType: !61, size: 32, align: 32, offset: 2944)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !98, file: !99, line: 77, baseType: !61, size: 32, align: 32, offset: 2976)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !98, file: !99, line: 79, baseType: !362, size: 64, align: 64, offset: 3008)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !98, file: !99, line: 80, baseType: !84, size: 64, align: 64, offset: 3072)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !98, file: !99, line: 81, baseType: !84, size: 64, align: 64, offset: 3136)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !98, file: !99, line: 83, baseType: !289, size: 64, align: 64, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !98, file: !99, line: 84, baseType: !248, size: 32, align: 32, offset: 3264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !98, file: !99, line: 87, baseType: !61, size: 32, align: 32, offset: 3296)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !98, file: !99, line: 91, baseType: !84, size: 64, align: 64, offset: 3328)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !98, file: !99, line: 92, baseType: !374, size: 128, align: 64, offset: 3392)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !98, file: !99, line: 93, baseType: !374, size: 128, align: 64, offset: 3520)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !98, file: !99, line: 95, baseType: !61, size: 32, align: 32, offset: 3648)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !98, file: !99, line: 96, baseType: !61, size: 32, align: 32, offset: 3680)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !98, file: !99, line: 97, baseType: !61, size: 32, align: 32, offset: 3712)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !98, file: !99, line: 100, baseType: !84, size: 64, align: 64, offset: 3776)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !98, file: !99, line: 103, baseType: !84, size: 64, align: 64, offset: 3840)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !98, file: !99, line: 106, baseType: !84, size: 64, align: 64, offset: 3904)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !98, file: !99, line: 108, baseType: !362, size: 64, align: 64, offset: 3968)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !98, file: !99, line: 109, baseType: !84, size: 64, align: 64, offset: 4032)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !98, file: !99, line: 111, baseType: !84, size: 64, align: 64, offset: 4096)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !98, file: !99, line: 114, baseType: !48, size: 64, align: 64, offset: 4160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !98, file: !99, line: 116, baseType: !362, size: 64, align: 64, offset: 4224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !98, file: !99, line: 117, baseType: !640, size: 32768, align: 64, offset: 4288)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 32768, align: 64, elements: !690)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !642, line: 10, size: 128, align: 64, elements: !643)
!642 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!643 = !{!644, !689}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !641, file: !642, line: 11, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !642, line: 7, baseType: !647)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !649, !53, !52, !52, !76, !289}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !97, line: 7, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !652, line: 15, size: 1600, align: 64, elements: !653)
!652 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !651, file: !499, line: 3, baseType: !61, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !651, file: !499, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !651, file: !499, line: 5, baseType: !362, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !651, file: !499, line: 7, baseType: !48, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !651, file: !499, line: 8, baseType: !95, size: 64, align: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !651, file: !499, line: 9, baseType: !76, size: 64, align: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !499, line: 10, baseType: !76, size: 64, align: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !651, file: !499, line: 11, baseType: !334, size: 64, align: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !651, file: !499, line: 12, baseType: !61, size: 32, align: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !651, file: !499, line: 13, baseType: !76, size: 64, align: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !651, file: !499, line: 15, baseType: !510, size: 64, align: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !651, file: !499, line: 17, baseType: !517, size: 64, align: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !651, file: !521, line: 5, baseType: !76, size: 64, align: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !651, file: !521, line: 6, baseType: !76, size: 64, align: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !651, file: !521, line: 7, baseType: !334, size: 64, align: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !651, file: !521, line: 9, baseType: !362, size: 64, align: 64, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !651, file: !521, line: 10, baseType: !526, size: 64, align: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !651, file: !521, line: 12, baseType: !173, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !651, file: !521, line: 13, baseType: !76, size: 64, align: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !651, file: !521, line: 14, baseType: !61, size: 32, align: 32, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !651, file: !521, line: 15, baseType: !76, size: 64, align: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !651, file: !521, line: 17, baseType: !173, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !651, file: !521, line: 18, baseType: !173, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !651, file: !521, line: 19, baseType: !173, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !651, file: !521, line: 20, baseType: !173, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !651, file: !521, line: 22, baseType: !173, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !651, file: !521, line: 23, baseType: !173, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !651, file: !521, line: 24, baseType: !173, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !651, file: !521, line: 25, baseType: !173, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !651, file: !521, line: 26, baseType: !173, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !651, file: !521, line: 31, baseType: !565, size: 64, align: 64, offset: 1344)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !651, file: !652, line: 18, baseType: !84, size: 64, align: 64, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !651, file: !652, line: 20, baseType: !334, size: 64, align: 64, offset: 1472)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !651, file: !652, line: 21, baseType: !61, size: 32, align: 32, offset: 1536)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !651, file: !652, line: 22, baseType: !61, size: 32, align: 32, offset: 1568)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !641, file: !642, line: 12, baseType: !52, size: 8, align: 8, offset: 64)
!690 = !{!691}
!691 = !DISubrange(count: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !98, file: !99, line: 118, baseType: !693, size: 2048, align: 8, offset: 37056)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2048, align: 8, elements: !690)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !98, file: !99, line: 120, baseType: !576, size: 64, align: 64, offset: 39104)
!695 = !{!696, !697}
!696 = distinct !DIGlobalVariable(name: "idle_tag", scope: !0, file: !72, line: 40, type: !61, isLocal: true, isDefinition: true, variable: i32* @idle_tag)
!697 = distinct !DIGlobalVariable(name: "idlepos", scope: !0, file: !72, line: 40, type: !61, isLocal: true, isDefinition: true, variable: i32* @idlepos)
!698 = !{i32 2, !"Dwarf Version", i32 4}
!699 = !{i32 2, !"Debug Info Version", i32 3}
!700 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!701 = distinct !DISubprogram(name: "server_idle_add_redir", scope: !72, file: !72, line: 98, type: !702, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{!61, !95, !53, !53, !61, !53, !61, !53, null}
!704 = !{}
!705 = !DILocalVariable(name: "server", arg: 1, scope: !701, file: !72, line: 98, type: !95)
!706 = !DIExpression()
!707 = !DILocation(line: 98, column: 43, scope: !701)
!708 = !DILocalVariable(name: "cmd", arg: 2, scope: !701, file: !72, line: 98, type: !53)
!709 = !DILocation(line: 98, column: 63, scope: !701)
!710 = !DILocalVariable(name: "redirect_cmd", arg: 3, scope: !701, file: !72, line: 99, type: !53)
!711 = !DILocation(line: 99, column: 18, scope: !701)
!712 = !DILocalVariable(name: "count", arg: 4, scope: !701, file: !72, line: 99, type: !61)
!713 = !DILocation(line: 99, column: 36, scope: !701)
!714 = !DILocalVariable(name: "arg", arg: 5, scope: !701, file: !72, line: 99, type: !53)
!715 = !DILocation(line: 99, column: 55, scope: !701)
!716 = !DILocalVariable(name: "remote", arg: 6, scope: !701, file: !72, line: 100, type: !61)
!717 = !DILocation(line: 100, column: 10, scope: !701)
!718 = !DILocalVariable(name: "failure_signal", arg: 7, scope: !701, file: !72, line: 100, type: !53)
!719 = !DILocation(line: 100, column: 30, scope: !701)
!720 = !DILocalVariable(name: "va", scope: !701, file: !72, line: 102, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !722, line: 79, baseType: !723)
!722 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !724, line: 40, baseType: !725)
!724 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/irssi/task1")
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 102, baseType: !726)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 192, align: 64, elements: !733)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 102, size: 192, align: 64, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !727, file: !1, line: 102, baseType: !173, size: 32, align: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !727, file: !1, line: 102, baseType: !173, size: 32, align: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !727, file: !1, line: 102, baseType: !48, size: 64, align: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !727, file: !1, line: 102, baseType: !48, size: 64, align: 64, offset: 128)
!733 = !{!734}
!734 = !DISubrange(count: 1)
!735 = !DILocation(line: 102, column: 10, scope: !701)
!736 = !DILocalVariable(name: "rec", scope: !701, file: !72, line: 103, type: !70)
!737 = !DILocation(line: 103, column: 19, scope: !701)
!738 = !DILocation(line: 105, column: 2, scope: !701)
!739 = distinct !{!739, !738}
!740 = !DILocation(line: 105, column: 10, scope: !741)
!741 = !DILexicalBlockFile(scope: !742, file: !72, discriminator: 1)
!742 = distinct !DILexicalBlock(scope: !743, file: !72, line: 105, column: 10)
!743 = distinct !DILexicalBlock(scope: !701, file: !72, line: 105, column: 4)
!744 = !DILocation(line: 105, column: 17, scope: !741)
!745 = !DILocation(line: 105, column: 5, scope: !746)
!746 = !DILexicalBlockFile(scope: !747, file: !72, discriminator: 2)
!747 = distinct !DILexicalBlock(scope: !742, file: !72, line: 105, column: 3)
!748 = !DILocation(line: 105, column: 14, scope: !749)
!749 = !DILexicalBlockFile(scope: !750, file: !72, discriminator: 3)
!750 = distinct !DILexicalBlock(scope: !742, file: !72, line: 105, column: 12)
!751 = !DILocation(line: 105, column: 101, scope: !749)
!752 = !DILocation(line: 105, column: 117, scope: !753)
!753 = !DILexicalBlockFile(scope: !743, file: !72, discriminator: 4)
!754 = !DILocation(line: 107, column: 1, scope: !701)
!755 = !DILocation(line: 108, column: 27, scope: !701)
!756 = !DILocation(line: 108, column: 32, scope: !701)
!757 = !DILocation(line: 108, column: 46, scope: !701)
!758 = !DILocation(line: 108, column: 53, scope: !701)
!759 = !DILocation(line: 108, column: 58, scope: !701)
!760 = !DILocation(line: 109, column: 6, scope: !701)
!761 = !DILocation(line: 109, column: 22, scope: !701)
!762 = !DILocation(line: 108, column: 8, scope: !701)
!763 = !DILocation(line: 108, column: 6, scope: !701)
!764 = !DILocation(line: 110, column: 33, scope: !701)
!765 = !DILocation(line: 110, column: 41, scope: !701)
!766 = !DILocation(line: 110, column: 48, scope: !701)
!767 = !DILocation(line: 110, column: 18, scope: !701)
!768 = !DILocation(line: 110, column: 2, scope: !701)
!769 = !DILocation(line: 110, column: 10, scope: !701)
!770 = !DILocation(line: 110, column: 16, scope: !701)
!771 = !DILocation(line: 111, column: 1, scope: !701)
!772 = !DILocation(line: 113, column: 9, scope: !701)
!773 = !DILocation(line: 113, column: 14, scope: !701)
!774 = !DILocation(line: 113, column: 2, scope: !701)
!775 = !DILocation(line: 114, column: 1, scope: !701)
!776 = distinct !DISubprogram(name: "server_idle_create", scope: !72, file: !72, line: 44, type: !777, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !704)
!777 = !DISubroutineType(types: !778)
!778 = !{!70, !53, !53, !61, !53, !61, !53, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!780 = !DILocalVariable(name: "cmd", arg: 1, scope: !776, file: !72, line: 44, type: !53)
!781 = !DILocation(line: 44, column: 32, scope: !776)
!782 = !DILocalVariable(name: "redirect_cmd", arg: 2, scope: !776, file: !72, line: 44, type: !53)
!783 = !DILocation(line: 44, column: 49, scope: !776)
!784 = !DILocalVariable(name: "count", arg: 3, scope: !776, file: !72, line: 44, type: !61)
!785 = !DILocation(line: 44, column: 67, scope: !776)
!786 = !DILocalVariable(name: "arg", arg: 4, scope: !776, file: !72, line: 45, type: !53)
!787 = !DILocation(line: 45, column: 18, scope: !776)
!788 = !DILocalVariable(name: "remote", arg: 5, scope: !776, file: !72, line: 45, type: !61)
!789 = !DILocation(line: 45, column: 27, scope: !776)
!790 = !DILocalVariable(name: "failure_signal", arg: 6, scope: !776, file: !72, line: 45, type: !53)
!791 = !DILocation(line: 45, column: 47, scope: !776)
!792 = !DILocalVariable(name: "va", arg: 7, scope: !776, file: !72, line: 46, type: !779)
!793 = !DILocation(line: 46, column: 14, scope: !776)
