; ModuleID = './line73-recode.o.i'
source_filename = "./line73-recode.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!50 = distinct !DIGlobalVariable(name: "translit_charset", scope: !0, file: !51, line: 28, type: !48, isLocal: true, isDefinition: true, variable: i8** @translit_charset)
!51 = !DIFile(filename: "recode.c", directory: "/home/lichi/Desktop/irssi/task1")
!52 = distinct !DIGlobalVariable(name: "term_is_utf8", scope: !0, file: !51, line: 29, type: !53, isLocal: true, isDefinition: true, variable: i32* @term_is_utf8)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !43, line: 50, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !43, line: 49, baseType: !55)
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !{i32 2, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!59 = distinct !DISubprogram(name: "is_utf8", scope: !51, file: !51, line: 31, type: !60, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!60 = !DISubroutineType(types: !61)
!61 = !{!53}
!62 = !{}
!63 = !DILocation(line: 33, column: 9, scope: !59)
!64 = !DILocation(line: 33, column: 2, scope: !59)
!65 = distinct !DISubprogram(name: "is_valid_charset", scope: !51, file: !51, line: 44, type: !66, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!66 = !DISubroutineType(types: !67)
!67 = !{!53, !45}
!68 = !DILocalVariable(name: "charset", arg: 1, scope: !65, file: !51, line: 44, type: !45)
!69 = !DIExpression()
!70 = !DILocation(line: 44, column: 39, scope: !65)
!71 = !DILocalVariable(name: "cd", scope: !65, file: !51, line: 46, type: !37)
!72 = !DILocation(line: 46, column: 9, scope: !65)
!73 = !DILocalVariable(name: "to", scope: !65, file: !51, line: 47, type: !48)
!74 = !DILocation(line: 47, column: 8, scope: !65)
!75 = !DILocation(line: 49, column: 7, scope: !76)
!76 = distinct !DILexicalBlock(scope: !65, file: !51, line: 49, column: 6)
!77 = !DILocation(line: 49, column: 15, scope: !76)
!78 = !DILocation(line: 49, column: 19, scope: !79)
!79 = !DILexicalBlockFile(scope: !76, file: !51, discriminator: 1)
!80 = !DILocation(line: 49, column: 18, scope: !79)
!81 = !DILocation(line: 49, column: 27, scope: !79)
!82 = !DILocation(line: 49, column: 6, scope: !79)
!83 = !DILocation(line: 50, column: 3, scope: !76)
!84 = !DILocation(line: 52, column: 6, scope: !85)
!85 = distinct !DILexicalBlock(scope: !65, file: !51, line: 52, column: 6)
!86 = !DILocation(line: 52, column: 48, scope: !85)
!87 = !DILocation(line: 52, column: 64, scope: !88)
!88 = !DILexicalBlockFile(scope: !85, file: !51, discriminator: 1)
!89 = !DILocation(line: 52, column: 52, scope: !88)
!90 = !DILocation(line: 52, column: 6, scope: !88)
!91 = !DILocation(line: 53, column: 30, scope: !85)
!92 = !DILocation(line: 53, column: 18, scope: !85)
!93 = !DILocation(line: 53, column: 16, scope: !85)
!94 = !DILocation(line: 53, column: 11, scope: !85)
!95 = !DILocation(line: 53, column: 3, scope: !85)
!96 = !DILocation(line: 55, column: 20, scope: !65)
!97 = !DILocation(line: 55, column: 7, scope: !65)
!98 = !DILocation(line: 55, column: 5, scope: !65)
!99 = !DILocation(line: 56, column: 9, scope: !65)
!100 = !DILocation(line: 56, column: 2, scope: !65)
!101 = !DILocation(line: 57, column: 6, scope: !102)
!102 = distinct !DILexicalBlock(scope: !65, file: !51, line: 57, column: 6)
!103 = !DILocation(line: 57, column: 9, scope: !102)
!104 = !DILocation(line: 57, column: 6, scope: !65)
!105 = !DILocation(line: 58, column: 17, scope: !106)
!106 = distinct !DILexicalBlock(scope: !102, file: !51, line: 57, column: 24)
!107 = !DILocation(line: 58, column: 3, scope: !106)
!108 = !DILocation(line: 59, column: 3, scope: !106)
!109 = !DILocation(line: 61, column: 2, scope: !65)
!110 = !DILocation(line: 62, column: 1, scope: !65)
!111 = distinct !DISubprogram(name: "is_translit", scope: !51, file: !51, line: 36, type: !66, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!112 = !DILocalVariable(name: "charset", arg: 1, scope: !111, file: !51, line: 36, type: !45)
!113 = !DILocation(line: 36, column: 41, scope: !111)
!114 = !DILocalVariable(name: "pos", scope: !111, file: !51, line: 38, type: !48)
!115 = !DILocation(line: 38, column: 8, scope: !111)
!116 = !DILocation(line: 40, column: 16, scope: !111)
!117 = !DILocation(line: 40, column: 8, scope: !111)
!118 = !DILocation(line: 40, column: 6, scope: !111)
!119 = !DILocation(line: 41, column: 10, scope: !111)
!120 = !DILocation(line: 41, column: 14, scope: !111)
!121 = !DILocation(line: 41, column: 2, scope: !111)
!122 = distinct !DISubprogram(name: "recode_in", scope: !51, file: !51, line: 90, type: !123, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !62)
!123 = !DISubroutineType(types: !124)
!124 = !{!48, !125, !45, !45}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !128, line: 107, baseType: !129)
!128 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !130, line: 30, size: 2240, align: 64, elements: !131)
!130 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!131 = !{!132, !134, !135, !136, !359, !364, !365, !366, !367, !368, !369, !370, !371, !372, !376, !377, !381, !382, !383, !387, !392, !393, !394, !395, !396, !397, !398, !399, !406, !407, !408, !409, !410, !415, !419, !423, !427, !431, !435, !442, !449, !453}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !133, line: 3, baseType: !55, size: 32, align: 32)
!133 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !129, file: !133, line: 4, baseType: !55, size: 32, align: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !129, file: !133, line: 6, baseType: !55, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !129, file: !133, line: 8, baseType: !137, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !128, line: 113, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !130, line: 25, size: 1920, align: 64, elements: !140)
!140 = !{!141, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !155, !156, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !142, line: 3, baseType: !55, size: 32, align: 32)
!142 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !139, file: !142, line: 4, baseType: !55, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !139, file: !142, line: 6, baseType: !55, size: 32, align: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !139, file: !142, line: 9, baseType: !48, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !139, file: !142, line: 10, baseType: !55, size: 32, align: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !139, file: !142, line: 11, baseType: !48, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !139, file: !142, line: 11, baseType: !48, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !139, file: !142, line: 11, baseType: !48, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !139, file: !142, line: 13, baseType: !151, size: 16, align: 16, offset: 448)
!151 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !139, file: !142, line: 14, baseType: !48, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !139, file: !142, line: 15, baseType: !48, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !139, file: !142, line: 16, baseType: !55, size: 32, align: 32, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !139, file: !142, line: 17, baseType: !48, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !139, file: !142, line: 19, baseType: !157, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !128, line: 99, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !128, line: 99, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !139, file: !142, line: 19, baseType: !157, size: 64, align: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !139, file: !142, line: 21, baseType: !48, size: 64, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !139, file: !142, line: 22, baseType: !48, size: 64, align: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !139, file: !142, line: 23, baseType: !48, size: 64, align: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !139, file: !142, line: 24, baseType: !48, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !139, file: !142, line: 26, baseType: !48, size: 64, align: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !139, file: !142, line: 27, baseType: !48, size: 64, align: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !139, file: !142, line: 28, baseType: !48, size: 64, align: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !139, file: !142, line: 29, baseType: !48, size: 64, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !139, file: !142, line: 30, baseType: !48, size: 64, align: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !139, file: !142, line: 31, baseType: !48, size: 64, align: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !139, file: !142, line: 32, baseType: !48, size: 64, align: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !139, file: !142, line: 33, baseType: !48, size: 64, align: 64, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !139, file: !142, line: 35, baseType: !174, size: 64, align: 64, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !177)
!177 = !{!178, !179, !320, !321, !322, !323, !324, !325, !326, !335, !336, !337, !341, !342, !343, !344, !345, !346, !347, !348}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !176, file: !4, line: 100, baseType: !54, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !176, file: !4, line: 101, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !183)
!183 = !{!184, !206, !212, !219, !223, !307, !311, !316}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !182, file: !4, line: 133, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!188, !174, !41, !189, !192, !193}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !190, line: 66, baseType: !191)
!190 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !196, line: 42, baseType: !197)
!196 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !196, line: 44, size: 128, align: 64, elements: !198)
!198 = !{!199, !204, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !197, file: !196, line: 46, baseType: !200, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !201, line: 36, baseType: !202)
!201 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !190, line: 45, baseType: !203)
!203 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !197, file: !196, line: 47, baseType: !54, size: 32, align: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !197, file: !196, line: 48, baseType: !41, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !182, file: !4, line: 138, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!188, !174, !210, !189, !192, !193}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !182, file: !4, line: 143, baseType: !213, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!188, !174, !216, !218, !193}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !190, line: 51, baseType: !217)
!217 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !182, file: !4, line: 147, baseType: !220, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!188, !174, !193}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !182, file: !4, line: 149, baseType: !224, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !174, !306}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !230)
!230 = !{!231, !233, !253, !282, !284, !288, !289, !290, !291, !299, !300, !301, !302}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !229, file: !16, line: 174, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !43, line: 77, baseType: !36)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !229, file: !16, line: 175, baseType: !234, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !237)
!237 = !{!238, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !236, file: !16, line: 198, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !232}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !236, file: !16, line: 199, baseType: !239, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !236, file: !16, line: 200, baseType: !244, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !232, !227, !247, !252}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!53, !232}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !229, file: !16, line: 177, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !258)
!258 = !{!259, !264, !268, !272, !276, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !257, file: !16, line: 216, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!53, !227, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !257, file: !16, line: 218, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!53, !227}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !257, file: !16, line: 219, baseType: !269, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!53, !227, !248, !232}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !257, file: !16, line: 222, baseType: !273, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !227}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !257, file: !16, line: 226, baseType: !248, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !257, file: !16, line: 227, baseType: !278, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !229, file: !16, line: 178, baseType: !283, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !43, line: 55, baseType: !203)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !229, file: !16, line: 180, baseType: !285, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !229, file: !16, line: 182, baseType: !54, size: 32, align: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !16, line: 183, baseType: !283, size: 32, align: 32, offset: 352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !229, file: !16, line: 184, baseType: !283, size: 32, align: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !229, file: !16, line: 186, baseType: !292, size: 64, align: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !294, line: 37, baseType: !295)
!294 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !294, line: 39, size: 128, align: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !294, line: 41, baseType: !232, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !294, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !229, file: !16, line: 188, baseType: !227, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !16, line: 189, baseType: !227, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !16, line: 191, baseType: !48, size: 64, align: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !229, file: !16, line: 193, baseType: !303, size: 64, align: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !182, file: !4, line: 151, baseType: !308, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !174}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !182, file: !4, line: 152, baseType: !312, size: 64, align: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!188, !174, !315, !193}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !182, file: !4, line: 155, baseType: !317, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!315, !174}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !176, file: !4, line: 103, baseType: !41, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !176, file: !4, line: 104, baseType: !37, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !176, file: !4, line: 105, baseType: !37, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !176, file: !4, line: 106, baseType: !41, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !176, file: !4, line: 107, baseType: !283, size: 32, align: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !176, file: !4, line: 109, baseType: !189, size: 64, align: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !176, file: !4, line: 110, baseType: !327, size: 64, align: 64, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !329, line: 39, baseType: !330)
!329 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !329, line: 41, size: 192, align: 64, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !330, file: !329, line: 43, baseType: !41, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !330, file: !329, line: 44, baseType: !189, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !330, file: !329, line: 45, baseType: !189, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !176, file: !4, line: 111, baseType: !327, size: 64, align: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !176, file: !4, line: 112, baseType: !327, size: 64, align: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !176, file: !4, line: 113, baseType: !338, size: 48, align: 8, offset: 704)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 48, align: 8, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 6)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !176, file: !4, line: 117, baseType: !283, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !176, file: !4, line: 118, baseType: !283, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !176, file: !4, line: 119, baseType: !283, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !176, file: !4, line: 120, baseType: !283, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !176, file: !4, line: 121, baseType: !283, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !176, file: !4, line: 122, baseType: !283, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !176, file: !4, line: 124, baseType: !232, size: 64, align: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !176, file: !4, line: 125, baseType: !232, size: 64, align: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !139, file: !142, line: 38, baseType: !203, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !139, file: !142, line: 39, baseType: !203, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !139, file: !142, line: 40, baseType: !203, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !139, file: !142, line: 41, baseType: !203, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !139, file: !142, line: 42, baseType: !203, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !139, file: !142, line: 43, baseType: !203, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !139, file: !142, line: 44, baseType: !203, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !139, file: !142, line: 45, baseType: !203, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !139, file: !142, line: 46, baseType: !48, size: 64, align: 64, offset: 1792)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !139, file: !142, line: 47, baseType: !48, size: 64, align: 64, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !129, file: !133, line: 9, baseType: !360, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !361, line: 75, baseType: !362)
!361 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !363, line: 139, baseType: !217)
!363 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !129, file: !133, line: 10, baseType: !360, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !129, file: !133, line: 12, baseType: !48, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !129, file: !133, line: 13, baseType: !48, size: 64, align: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !129, file: !133, line: 15, baseType: !203, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !129, file: !133, line: 16, baseType: !203, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !129, file: !133, line: 17, baseType: !203, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !129, file: !133, line: 18, baseType: !203, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !129, file: !133, line: 19, baseType: !203, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !129, file: !133, line: 21, baseType: !373, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !128, line: 102, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !128, line: 102, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !129, file: !133, line: 22, baseType: !55, size: 32, align: 32, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !129, file: !133, line: 25, baseType: !378, size: 128, align: 64, offset: 640)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 128, align: 64, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 2)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !129, file: !133, line: 26, baseType: !55, size: 32, align: 32, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !129, file: !133, line: 27, baseType: !55, size: 32, align: 32, offset: 800)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !129, file: !133, line: 29, baseType: !384, size: 64, align: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !128, line: 103, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !128, line: 103, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !129, file: !133, line: 30, baseType: !388, size: 64, align: 64, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !390, line: 37, baseType: !391)
!390 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !390, line: 37, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !129, file: !133, line: 32, baseType: !48, size: 64, align: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !129, file: !133, line: 33, baseType: !48, size: 64, align: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !129, file: !133, line: 34, baseType: !48, size: 64, align: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !129, file: !133, line: 35, baseType: !203, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !129, file: !133, line: 36, baseType: !203, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !129, file: !133, line: 37, baseType: !203, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !129, file: !133, line: 38, baseType: !203, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !129, file: !133, line: 40, baseType: !400, size: 128, align: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !43, line: 504, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !43, line: 506, size: 128, align: 64, elements: !402)
!402 = !{!403, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !401, file: !43, line: 508, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !43, line: 48, baseType: !217)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !401, file: !43, line: 509, baseType: !404, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !129, file: !133, line: 41, baseType: !360, size: 64, align: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !129, file: !133, line: 42, baseType: !55, size: 32, align: 32, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !129, file: !133, line: 44, baseType: !292, size: 64, align: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !129, file: !133, line: 45, baseType: !292, size: 64, align: 64, offset: 1536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !129, file: !133, line: 53, baseType: !411, size: 64, align: 64, offset: 1600)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414, !45, !55}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !129, file: !133, line: 55, baseType: !416, size: 64, align: 64, offset: 1664)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!55, !414, !44}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !129, file: !133, line: 57, baseType: !420, size: 64, align: 64, offset: 1728)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!55, !414, !45}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !129, file: !133, line: 60, baseType: !424, size: 64, align: 64, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!45, !414}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !129, file: !133, line: 62, baseType: !428, size: 64, align: 64, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !414, !45, !45, !55}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !129, file: !133, line: 65, baseType: !432, size: 64, align: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!47, !414, !45, !45}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !129, file: !133, line: 69, baseType: !436, size: 64, align: 64, offset: 1984)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !414, !45}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !128, line: 109, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !128, line: 109, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !129, file: !133, line: 70, baseType: !443, size: 64, align: 64, offset: 2048)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!446, !414, !45}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !128, line: 110, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !128, line: 110, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !129, file: !133, line: 71, baseType: !450, size: 64, align: 64, offset: 2112)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!55, !45, !45}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !129, file: !133, line: 73, baseType: !450, size: 64, align: 64, offset: 2176)
!454 = !DILocalVariable(name: "server", arg: 1, scope: !122, file: !51, line: 90, type: !125)
!455 = !DILocation(line: 90, column: 35, scope: !122)
!456 = !DILocalVariable(name: "str", arg: 2, scope: !122, file: !51, line: 90, type: !45)
!457 = !DILocation(line: 90, column: 55, scope: !122)
!458 = !DILocalVariable(name: "target", arg: 3, scope: !122, file: !51, line: 90, type: !45)
!459 = !DILocation(line: 90, column: 72, scope: !122)
!460 = !DILocalVariable(name: "from", scope: !122, file: !51, line: 92, type: !45)
!461 = !DILocation(line: 92, column: 14, scope: !122)
!462 = !DILocalVariable(name: "to", scope: !122, file: !51, line: 93, type: !45)
!463 = !DILocation(line: 93, column: 14, scope: !122)
!464 = !DILocation(line: 93, column: 19, scope: !122)
!465 = !DILocalVariable(name: "recoded", scope: !122, file: !51, line: 94, type: !48)
!466 = !DILocation(line: 94, column: 8, scope: !122)
!467 = !DILocalVariable(name: "str_is_utf8", scope: !122, file: !51, line: 95, type: !53)
!468 = !DILocation(line: 95, column: 11, scope: !122)
!469 = !DILocalVariable(name: "recode", scope: !122, file: !51, line: 95, type: !53)
!470 = !DILocation(line: 95, column: 24, scope: !122)
!471 = !DILocalVariable(name: "autodetect", scope: !122, file: !51, line: 95, type: !53)
!472 = !DILocation(line: 95, column: 32, scope: !122)
!473 = !DILocalVariable(name: "len", scope: !122, file: !51, line: 96, type: !55)
!474 = !DILocation(line: 96, column: 6, scope: !122)
!475 = !DILocation(line: 98, column: 7, scope: !476)
!476 = distinct !DILexicalBlock(scope: !122, file: !51, line: 98, column: 6)
!477 = !DILocation(line: 98, column: 6, scope: !122)
!478 = !DILocation(line: 99, column: 3, scope: !476)
!479 = !DILocation(line: 101, column: 11, scope: !122)
!480 = !DILocation(line: 101, column: 9, scope: !122)
!481 = !DILocation(line: 102, column: 7, scope: !482)
!482 = distinct !DILexicalBlock(scope: !122, file: !51, line: 102, column: 6)
!483 = !DILocation(line: 102, column: 6, scope: !122)
!484 = !DILocation(line: 103, column: 19, scope: !482)
!485 = !DILocation(line: 103, column: 10, scope: !482)
!486 = !DILocation(line: 103, column: 3, scope: !482)
!487 = !DILocation(line: 105, column: 15, scope: !122)
!488 = !DILocation(line: 105, column: 8, scope: !122)
!489 = !DILocation(line: 105, column: 6, scope: !122)
!490 = !DILocation(line: 108, column: 14, scope: !122)
!491 = !DILocation(line: 109, column: 20, scope: !492)
!492 = distinct !DILexicalBlock(scope: !122, file: !51, line: 109, column: 6)
!493 = !DILocation(line: 109, column: 7, scope: !492)
!494 = !DILocation(line: 109, column: 6, scope: !122)
!495 = !DILocation(line: 110, column: 33, scope: !492)
!496 = !DILocation(line: 110, column: 38, scope: !492)
!497 = !DILocation(line: 110, column: 17, scope: !492)
!498 = !DILocation(line: 110, column: 15, scope: !492)
!499 = !DILocation(line: 110, column: 3, scope: !492)
!500 = !DILocation(line: 111, column: 19, scope: !501)
!501 = distinct !DILexicalBlock(scope: !492, file: !51, line: 111, column: 11)
!502 = !DILocation(line: 111, column: 12, scope: !501)
!503 = !DILocation(line: 111, column: 11, scope: !492)
!504 = !DILocation(line: 112, column: 15, scope: !501)
!505 = !DILocation(line: 112, column: 3, scope: !501)
!506 = !DILocation(line: 113, column: 15, scope: !122)
!507 = !DILocation(line: 113, column: 13, scope: !122)
!508 = !DILocation(line: 115, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !122, file: !51, line: 115, column: 6)
!510 = !DILocation(line: 115, column: 17, scope: !509)
!511 = !DILocation(line: 115, column: 20, scope: !512)
!512 = !DILexicalBlockFile(scope: !509, file: !51, discriminator: 1)
!513 = !DILocation(line: 115, column: 6, scope: !512)
!514 = !DILocation(line: 116, column: 7, scope: !515)
!515 = distinct !DILexicalBlock(scope: !509, file: !51, line: 116, column: 7)
