; ModuleID = './line155-netsplit.o.i'
source_filename = "./line155-netsplit.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.NETSPLIT_REC = type { %struct.NETSPLIT_SERVER_REC*, i8*, i8*, %struct._GSList*, i8, i64 }
%struct.NETSPLIT_SERVER_REC = type { i8*, i8*, i32, i32, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !62, globals: !731)
!1 = !DIFile(filename: "line155-netsplit.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !50}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 51, size: 32, align: 32, elements: !52)
!51 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!54 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!55 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!56 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!57 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!58 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!59 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!60 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!61 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!62 = !{!63, !377, !132, !465, !178, !71, !686, !91, !194, !687, !694, !698, !702, !722, !708}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !65, line: 6, baseType: !66)
!65 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !67, line: 42, size: 39168, align: 64, elements: !68)
!67 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = !{!69, !72, !73, !74, !322, !327, !328, !329, !330, !331, !332, !333, !334, !335, !339, !340, !344, !345, !346, !350, !355, !356, !357, !358, !359, !360, !361, !362, !369, !370, !371, !372, !373, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !683, !685}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !70, line: 3, baseType: !71, size: 32, align: 32)
!70 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !66, file: !70, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !66, file: !70, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !66, file: !70, line: 8, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !65, line: 5, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !67, line: 24, size: 2496, align: 64, elements: !78)
!78 = !{!79, !81, !82, !83, !86, !87, !88, !89, !90, !92, !93, !94, !95, !96, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !80, line: 3, baseType: !71, size: 32, align: 32)
!80 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !77, file: !80, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !77, file: !80, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !77, file: !80, line: 9, baseType: !84, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !77, file: !80, line: 10, baseType: !71, size: 32, align: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !77, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !77, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !77, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !77, file: !80, line: 13, baseType: !91, size: 16, align: 16, offset: 448)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !77, file: !80, line: 14, baseType: !84, size: 64, align: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !77, file: !80, line: 15, baseType: !84, size: 64, align: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !77, file: !80, line: 16, baseType: !71, size: 32, align: 32, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !77, file: !80, line: 17, baseType: !84, size: 64, align: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !77, file: !80, line: 19, baseType: !97, size: 64, align: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !99, line: 99, baseType: !100)
!99 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !99, line: 99, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !77, file: !80, line: 19, baseType: !97, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !77, file: !80, line: 21, baseType: !84, size: 64, align: 64, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !77, file: !80, line: 22, baseType: !84, size: 64, align: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !77, file: !80, line: 23, baseType: !84, size: 64, align: 64, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !77, file: !80, line: 24, baseType: !84, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !77, file: !80, line: 26, baseType: !84, size: 64, align: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !77, file: !80, line: 27, baseType: !84, size: 64, align: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !77, file: !80, line: 28, baseType: !84, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !77, file: !80, line: 29, baseType: !84, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !77, file: !80, line: 30, baseType: !84, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !77, file: !80, line: 31, baseType: !84, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !77, file: !80, line: 32, baseType: !84, size: 64, align: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !77, file: !80, line: 33, baseType: !84, size: 64, align: 64, offset: 1600)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !77, file: !80, line: 35, baseType: !115, size: 64, align: 64, offset: 1664)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !118)
!118 = !{!119, !122, !267, !268, !273, !274, !275, !276, !277, !286, !287, !288, !292, !293, !294, !295, !296, !297, !298, !299}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !117, file: !4, line: 100, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !121, line: 49, baseType: !71)
!121 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !117, file: !4, line: 101, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !126)
!126 = !{!127, !151, !157, !164, !168, !254, !258, !263}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !125, file: !4, line: 133, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !115, !132, !134, !137, !138}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !121, line: 46, baseType: !85)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !135, line: 66, baseType: !136)
!135 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !141, line: 42, baseType: !142)
!141 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !141, line: 44, size: 128, align: 64, elements: !143)
!143 = !{!144, !149, !150}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !142, file: !141, line: 46, baseType: !145, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !146, line: 36, baseType: !147)
!146 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !135, line: 45, baseType: !148)
!148 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !142, file: !141, line: 47, baseType: !120, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !142, file: !141, line: 48, baseType: !132, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !125, file: !4, line: 138, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!131, !115, !155, !134, !137, !138}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !125, file: !4, line: 143, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!131, !115, !161, !163, !138}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !135, line: 51, baseType: !162)
!162 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !125, file: !4, line: 147, baseType: !165, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!131, !115, !138}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !125, file: !4, line: 149, baseType: !169, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !115, !253}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !175)
!175 = !{!176, !179, !200, !229, !231, !235, !236, !237, !238, !246, !247, !248, !249}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !174, file: !16, line: 174, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !121, line: 77, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !174, file: !16, line: 175, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !183)
!183 = !{!184, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !182, file: !16, line: 198, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !177}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !182, file: !16, line: 199, baseType: !185, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !182, file: !16, line: 200, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !177, !172, !193, !199}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !177}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !121, line: 50, baseType: !120)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !174, file: !16, line: 177, baseType: !201, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !205)
!205 = !{!206, !211, !215, !219, !223, !224}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !204, file: !16, line: 216, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!198, !172, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !204, file: !16, line: 218, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!198, !172}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !204, file: !16, line: 219, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!198, !172, !194, !177}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !204, file: !16, line: 222, baseType: !220, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !172}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !204, file: !16, line: 226, baseType: !194, size: 64, align: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !204, file: !16, line: 227, baseType: !225, size: 64, align: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !174, file: !16, line: 178, baseType: !230, size: 32, align: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !121, line: 55, baseType: !148)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !174, file: !16, line: 180, baseType: !232, size: 64, align: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !174, file: !16, line: 182, baseType: !120, size: 32, align: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !16, line: 183, baseType: !230, size: 32, align: 32, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !174, file: !16, line: 184, baseType: !230, size: 32, align: 32, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !174, file: !16, line: 186, baseType: !239, size: 64, align: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !241, line: 37, baseType: !242)
!241 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !241, line: 39, size: 128, align: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !241, line: 41, baseType: !177, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !241, line: 42, baseType: !239, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !174, file: !16, line: 188, baseType: !172, size: 64, align: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !16, line: 189, baseType: !172, size: 64, align: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !16, line: 191, baseType: !84, size: 64, align: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !174, file: !16, line: 193, baseType: !250, size: 64, align: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !125, file: !4, line: 151, baseType: !255, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !115}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !125, file: !4, line: 152, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!131, !115, !262, !138}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !125, file: !4, line: 155, baseType: !264, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!262, !115}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !117, file: !4, line: 103, baseType: !132, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !117, file: !4, line: 104, baseType: !269, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !270, line: 77, baseType: !271)
!270 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !270, line: 77, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !117, file: !4, line: 105, baseType: !269, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !117, file: !4, line: 106, baseType: !132, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !117, file: !4, line: 107, baseType: !230, size: 32, align: 32, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !117, file: !4, line: 109, baseType: !134, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !117, file: !4, line: 110, baseType: !278, size: 64, align: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !280, line: 39, baseType: !281)
!280 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !280, line: 41, size: 192, align: 64, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !281, file: !280, line: 43, baseType: !132, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !281, file: !280, line: 44, baseType: !134, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !281, file: !280, line: 45, baseType: !134, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !117, file: !4, line: 111, baseType: !278, size: 64, align: 64, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !117, file: !4, line: 112, baseType: !278, size: 64, align: 64, offset: 640)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !117, file: !4, line: 113, baseType: !289, size: 48, align: 8, offset: 704)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 48, align: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 6)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !117, file: !4, line: 117, baseType: !230, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !117, file: !4, line: 118, baseType: !230, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !117, file: !4, line: 119, baseType: !230, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !117, file: !4, line: 120, baseType: !230, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !117, file: !4, line: 121, baseType: !230, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !117, file: !4, line: 122, baseType: !230, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !117, file: !4, line: 124, baseType: !177, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !117, file: !4, line: 125, baseType: !177, size: 64, align: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !77, file: !80, line: 38, baseType: !148, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !77, file: !80, line: 39, baseType: !148, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !77, file: !80, line: 40, baseType: !148, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !77, file: !80, line: 41, baseType: !148, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !77, file: !80, line: 42, baseType: !148, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !77, file: !80, line: 43, baseType: !148, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !77, file: !80, line: 44, baseType: !148, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !77, file: !80, line: 45, baseType: !148, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !77, file: !80, line: 46, baseType: !84, size: 64, align: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !77, file: !80, line: 47, baseType: !84, size: 64, align: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !77, file: !67, line: 27, baseType: !84, size: 64, align: 64, offset: 1920)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !77, file: !67, line: 28, baseType: !84, size: 64, align: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !77, file: !67, line: 30, baseType: !71, size: 32, align: 32, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !77, file: !67, line: 31, baseType: !84, size: 64, align: 64, offset: 2112)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !77, file: !67, line: 32, baseType: !84, size: 64, align: 64, offset: 2176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !77, file: !67, line: 34, baseType: !71, size: 32, align: 32, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !77, file: !67, line: 35, baseType: !71, size: 32, align: 32, offset: 2272)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !77, file: !67, line: 36, baseType: !71, size: 32, align: 32, offset: 2304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !77, file: !67, line: 38, baseType: !71, size: 32, align: 32, offset: 2336)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !77, file: !67, line: 38, baseType: !71, size: 32, align: 32, offset: 2368)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !77, file: !67, line: 38, baseType: !71, size: 32, align: 32, offset: 2400)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !77, file: !67, line: 38, baseType: !71, size: 32, align: 32, offset: 2432)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !66, file: !70, line: 9, baseType: !323, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !324, line: 75, baseType: !325)
!324 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !326, line: 139, baseType: !162)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !66, file: !70, line: 10, baseType: !323, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !70, line: 12, baseType: !84, size: 64, align: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !66, file: !70, line: 13, baseType: !84, size: 64, align: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !66, file: !70, line: 15, baseType: !148, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !66, file: !70, line: 16, baseType: !148, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !66, file: !70, line: 17, baseType: !148, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !66, file: !70, line: 18, baseType: !148, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !66, file: !70, line: 19, baseType: !148, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !66, file: !70, line: 21, baseType: !336, size: 64, align: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !99, line: 102, baseType: !338)
!338 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !99, line: 102, flags: DIFlagFwdDecl)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !66, file: !70, line: 22, baseType: !71, size: 32, align: 32, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !66, file: !70, line: 25, baseType: !341, size: 128, align: 64, offset: 640)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, align: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !66, file: !70, line: 26, baseType: !71, size: 32, align: 32, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !66, file: !70, line: 27, baseType: !71, size: 32, align: 32, offset: 800)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !66, file: !70, line: 29, baseType: !347, size: 64, align: 64, offset: 832)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !99, line: 103, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !99, line: 103, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !66, file: !70, line: 30, baseType: !351, size: 64, align: 64, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !353, line: 37, baseType: !354)
!353 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !353, line: 37, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !66, file: !70, line: 32, baseType: !84, size: 64, align: 64, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !66, file: !70, line: 33, baseType: !84, size: 64, align: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !66, file: !70, line: 34, baseType: !84, size: 64, align: 64, offset: 1088)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !66, file: !70, line: 35, baseType: !148, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !66, file: !70, line: 36, baseType: !148, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !66, file: !70, line: 37, baseType: !148, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !66, file: !70, line: 38, baseType: !148, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !66, file: !70, line: 40, baseType: !363, size: 128, align: 64, offset: 1216)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !121, line: 504, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !121, line: 506, size: 128, align: 64, elements: !365)
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !364, file: !121, line: 508, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !121, line: 48, baseType: !162)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !364, file: !121, line: 509, baseType: !367, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !66, file: !70, line: 41, baseType: !323, size: 64, align: 64, offset: 1344)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !66, file: !70, line: 42, baseType: !71, size: 32, align: 32, offset: 1408)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !66, file: !70, line: 44, baseType: !239, size: 64, align: 64, offset: 1472)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !66, file: !70, line: 45, baseType: !239, size: 64, align: 64, offset: 1536)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !66, file: !70, line: 53, baseType: !374, size: 64, align: 64, offset: 1600)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !377, !465, !71}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !99, line: 107, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !380, line: 30, size: 2240, align: 64, elements: !381)
!380 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!381 = !{!382, !383, !384, !385, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !461, !467, !471, !475, !480, !559, !566, !570}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !70, line: 3, baseType: !71, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !379, file: !70, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !379, file: !70, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !379, file: !70, line: 8, baseType: !386, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !99, line: 113, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !380, line: 25, size: 1920, align: 64, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !80, line: 3, baseType: !71, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !388, file: !80, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !388, file: !80, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !388, file: !80, line: 9, baseType: !84, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !388, file: !80, line: 10, baseType: !71, size: 32, align: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !388, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !388, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !388, file: !80, line: 11, baseType: !84, size: 64, align: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !388, file: !80, line: 13, baseType: !91, size: 16, align: 16, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !388, file: !80, line: 14, baseType: !84, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !388, file: !80, line: 15, baseType: !84, size: 64, align: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !388, file: !80, line: 16, baseType: !71, size: 32, align: 32, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !388, file: !80, line: 17, baseType: !84, size: 64, align: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !388, file: !80, line: 19, baseType: !97, size: 64, align: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !388, file: !80, line: 19, baseType: !97, size: 64, align: 64, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !388, file: !80, line: 21, baseType: !84, size: 64, align: 64, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !388, file: !80, line: 22, baseType: !84, size: 64, align: 64, offset: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !388, file: !80, line: 23, baseType: !84, size: 64, align: 64, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !388, file: !80, line: 24, baseType: !84, size: 64, align: 64, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !388, file: !80, line: 26, baseType: !84, size: 64, align: 64, offset: 1152)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !388, file: !80, line: 27, baseType: !84, size: 64, align: 64, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !388, file: !80, line: 28, baseType: !84, size: 64, align: 64, offset: 1280)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !388, file: !80, line: 29, baseType: !84, size: 64, align: 64, offset: 1344)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !388, file: !80, line: 30, baseType: !84, size: 64, align: 64, offset: 1408)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !388, file: !80, line: 31, baseType: !84, size: 64, align: 64, offset: 1472)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !388, file: !80, line: 32, baseType: !84, size: 64, align: 64, offset: 1536)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !388, file: !80, line: 33, baseType: !84, size: 64, align: 64, offset: 1600)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !388, file: !80, line: 35, baseType: !115, size: 64, align: 64, offset: 1664)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !388, file: !80, line: 38, baseType: !148, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !388, file: !80, line: 39, baseType: !148, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !388, file: !80, line: 40, baseType: !148, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !388, file: !80, line: 41, baseType: !148, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !388, file: !80, line: 42, baseType: !148, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !388, file: !80, line: 43, baseType: !148, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !388, file: !80, line: 44, baseType: !148, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !388, file: !80, line: 45, baseType: !148, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !388, file: !80, line: 46, baseType: !84, size: 64, align: 64, offset: 1792)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !388, file: !80, line: 47, baseType: !84, size: 64, align: 64, offset: 1856)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !379, file: !70, line: 9, baseType: !323, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !379, file: !70, line: 10, baseType: !323, size: 64, align: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !379, file: !70, line: 12, baseType: !84, size: 64, align: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !379, file: !70, line: 13, baseType: !84, size: 64, align: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !379, file: !70, line: 15, baseType: !148, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !379, file: !70, line: 16, baseType: !148, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !379, file: !70, line: 17, baseType: !148, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !379, file: !70, line: 18, baseType: !148, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !379, file: !70, line: 19, baseType: !148, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !379, file: !70, line: 21, baseType: !336, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !379, file: !70, line: 22, baseType: !71, size: 32, align: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !379, file: !70, line: 25, baseType: !341, size: 128, align: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !379, file: !70, line: 26, baseType: !71, size: 32, align: 32, offset: 768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !379, file: !70, line: 27, baseType: !71, size: 32, align: 32, offset: 800)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !379, file: !70, line: 29, baseType: !347, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !379, file: !70, line: 30, baseType: !351, size: 64, align: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !379, file: !70, line: 32, baseType: !84, size: 64, align: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !379, file: !70, line: 33, baseType: !84, size: 64, align: 64, offset: 1024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !379, file: !70, line: 34, baseType: !84, size: 64, align: 64, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !379, file: !70, line: 35, baseType: !148, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !379, file: !70, line: 36, baseType: !148, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !379, file: !70, line: 37, baseType: !148, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !379, file: !70, line: 38, baseType: !148, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !379, file: !70, line: 40, baseType: !363, size: 128, align: 64, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !379, file: !70, line: 41, baseType: !323, size: 64, align: 64, offset: 1344)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !379, file: !70, line: 42, baseType: !71, size: 32, align: 32, offset: 1408)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !379, file: !70, line: 44, baseType: !239, size: 64, align: 64, offset: 1472)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !379, file: !70, line: 45, baseType: !239, size: 64, align: 64, offset: 1536)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !379, file: !70, line: 53, baseType: !374, size: 64, align: 64, offset: 1600)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !379, file: !70, line: 55, baseType: !458, size: 64, align: 64, offset: 1664)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!71, !377, !85}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !379, file: !70, line: 57, baseType: !462, size: 64, align: 64, offset: 1728)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!71, !377, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !379, file: !70, line: 60, baseType: !468, size: 64, align: 64, offset: 1792)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!465, !377}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !379, file: !70, line: 62, baseType: !472, size: 64, align: 64, offset: 1856)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !377, !465, !465, !71}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !379, file: !70, line: 65, baseType: !476, size: 64, align: 64, offset: 1920)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !377, !465, !465}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !379, file: !70, line: 69, baseType: !481, size: 64, align: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !377, !465}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !99, line: 109, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !487, line: 15, size: 1408, align: 64, elements: !488)
!487 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!488 = !{!489, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !507, !511, !513, !514, !515, !516, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !490, line: 3, baseType: !71, size: 32, align: 32)
!490 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !486, file: !490, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !486, file: !490, line: 5, baseType: !351, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !486, file: !490, line: 7, baseType: !178, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !486, file: !490, line: 8, baseType: !377, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !486, file: !490, line: 9, baseType: !84, size: 64, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !490, line: 10, baseType: !84, size: 64, align: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !486, file: !490, line: 11, baseType: !323, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !486, file: !490, line: 12, baseType: !71, size: 32, align: 32, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !486, file: !490, line: 13, baseType: !84, size: 64, align: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !486, file: !490, line: 15, baseType: !501, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !99, line: 108, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !99, line: 108, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !486, file: !490, line: 17, baseType: !508, size: 64, align: 64, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!465, !504}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !486, file: !512, line: 5, baseType: !84, size: 64, align: 64, offset: 704)
!512 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!513 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !486, file: !512, line: 6, baseType: !84, size: 64, align: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !486, file: !512, line: 7, baseType: !323, size: 64, align: 64, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !486, file: !512, line: 9, baseType: !351, size: 64, align: 64, offset: 896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !486, file: !512, line: 10, baseType: !517, size: 64, align: 64, offset: 960)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !99, line: 111, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !520, line: 13, size: 576, align: 64, elements: !521)
!520 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !540, !541}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !523, line: 3, baseType: !71, size: 32, align: 32)
!523 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !519, file: !523, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !519, file: !523, line: 6, baseType: !323, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !519, file: !523, line: 8, baseType: !84, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !519, file: !523, line: 9, baseType: !84, size: 64, align: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !519, file: !523, line: 10, baseType: !84, size: 64, align: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !519, file: !523, line: 11, baseType: !71, size: 32, align: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !519, file: !523, line: 14, baseType: !148, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !519, file: !523, line: 15, baseType: !148, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !519, file: !523, line: 18, baseType: !148, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !519, file: !523, line: 19, baseType: !148, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !519, file: !523, line: 20, baseType: !148, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !519, file: !523, line: 21, baseType: !148, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !519, file: !523, line: 22, baseType: !537, size: 64, align: 8, offset: 360)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, align: 8, elements: !538)
!538 = !{!539}
!539 = !DISubrange(count: 8)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !519, file: !523, line: 26, baseType: !178, size: 64, align: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !523, line: 28, baseType: !517, size: 64, align: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !486, file: !512, line: 12, baseType: !148, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !486, file: !512, line: 13, baseType: !84, size: 64, align: 64, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !486, file: !512, line: 14, baseType: !71, size: 32, align: 32, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !486, file: !512, line: 15, baseType: !84, size: 64, align: 64, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !486, file: !512, line: 17, baseType: !148, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !486, file: !512, line: 18, baseType: !148, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !486, file: !512, line: 19, baseType: !148, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !486, file: !512, line: 20, baseType: !148, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !486, file: !512, line: 22, baseType: !148, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !486, file: !512, line: 23, baseType: !148, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !486, file: !512, line: 24, baseType: !148, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !486, file: !512, line: 25, baseType: !148, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !486, file: !512, line: 26, baseType: !148, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !486, file: !512, line: 31, baseType: !556, size: 64, align: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{!84, !484}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !379, file: !70, line: 70, baseType: !560, size: 64, align: 64, offset: 2048)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !377, !465}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !99, line: 110, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !99, line: 110, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !379, file: !70, line: 71, baseType: !567, size: 64, align: 64, offset: 2112)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!71, !465, !465}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !379, file: !70, line: 73, baseType: !567, size: 64, align: 64, offset: 2176)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !66, file: !70, line: 55, baseType: !458, size: 64, align: 64, offset: 1664)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !66, file: !70, line: 57, baseType: !462, size: 64, align: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !66, file: !70, line: 60, baseType: !468, size: 64, align: 64, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !66, file: !70, line: 62, baseType: !472, size: 64, align: 64, offset: 1856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !66, file: !70, line: 65, baseType: !476, size: 64, align: 64, offset: 1920)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !66, file: !70, line: 69, baseType: !481, size: 64, align: 64, offset: 1984)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !66, file: !70, line: 70, baseType: !560, size: 64, align: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !66, file: !70, line: 71, baseType: !567, size: 64, align: 64, offset: 2112)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !66, file: !70, line: 73, baseType: !567, size: 64, align: 64, offset: 2176)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !66, file: !67, line: 46, baseType: !239, size: 64, align: 64, offset: 2240)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !66, file: !67, line: 47, baseType: !239, size: 64, align: 64, offset: 2304)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !66, file: !67, line: 48, baseType: !583, size: 64, align: 64, offset: 2368)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !65, line: 8, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !65, line: 8, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !66, file: !67, line: 49, baseType: !239, size: 64, align: 64, offset: 2432)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !66, file: !67, line: 51, baseType: !84, size: 64, align: 64, offset: 2496)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !66, file: !67, line: 53, baseType: !84, size: 64, align: 64, offset: 2560)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !66, file: !67, line: 54, baseType: !84, size: 64, align: 64, offset: 2624)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !66, file: !67, line: 55, baseType: !84, size: 64, align: 64, offset: 2688)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !66, file: !67, line: 56, baseType: !84, size: 64, align: 64, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !66, file: !67, line: 57, baseType: !71, size: 32, align: 32, offset: 2816)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !66, file: !67, line: 59, baseType: !148, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !66, file: !67, line: 60, baseType: !148, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !66, file: !67, line: 62, baseType: !148, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !66, file: !67, line: 63, baseType: !148, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !66, file: !67, line: 64, baseType: !148, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !66, file: !67, line: 65, baseType: !148, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !66, file: !67, line: 66, baseType: !148, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !66, file: !67, line: 67, baseType: !148, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !66, file: !67, line: 68, baseType: !148, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !66, file: !67, line: 69, baseType: !148, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !66, file: !67, line: 70, baseType: !148, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !66, file: !67, line: 71, baseType: !148, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !66, file: !67, line: 72, baseType: !148, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !66, file: !67, line: 74, baseType: !71, size: 32, align: 32, offset: 2880)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !66, file: !67, line: 75, baseType: !71, size: 32, align: 32, offset: 2912)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !66, file: !67, line: 76, baseType: !71, size: 32, align: 32, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !66, file: !67, line: 77, baseType: !71, size: 32, align: 32, offset: 2976)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !66, file: !67, line: 79, baseType: !351, size: 64, align: 64, offset: 3008)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !66, file: !67, line: 80, baseType: !239, size: 64, align: 64, offset: 3072)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !66, file: !67, line: 81, baseType: !239, size: 64, align: 64, offset: 3136)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !66, file: !67, line: 83, baseType: !278, size: 64, align: 64, offset: 3200)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !66, file: !67, line: 84, baseType: !230, size: 32, align: 32, offset: 3264)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !66, file: !67, line: 87, baseType: !71, size: 32, align: 32, offset: 3296)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !66, file: !67, line: 91, baseType: !239, size: 64, align: 64, offset: 3328)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !66, file: !67, line: 92, baseType: !363, size: 128, align: 64, offset: 3392)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !66, file: !67, line: 93, baseType: !363, size: 128, align: 64, offset: 3520)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !66, file: !67, line: 95, baseType: !71, size: 32, align: 32, offset: 3648)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !66, file: !67, line: 96, baseType: !71, size: 32, align: 32, offset: 3680)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !66, file: !67, line: 97, baseType: !71, size: 32, align: 32, offset: 3712)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !66, file: !67, line: 100, baseType: !239, size: 64, align: 64, offset: 3776)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !66, file: !67, line: 103, baseType: !239, size: 64, align: 64, offset: 3840)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !66, file: !67, line: 106, baseType: !239, size: 64, align: 64, offset: 3904)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !66, file: !67, line: 108, baseType: !351, size: 64, align: 64, offset: 3968)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !66, file: !67, line: 109, baseType: !239, size: 64, align: 64, offset: 4032)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !66, file: !67, line: 111, baseType: !239, size: 64, align: 64, offset: 4096)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !66, file: !67, line: 114, baseType: !178, size: 64, align: 64, offset: 4160)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !66, file: !67, line: 116, baseType: !351, size: 64, align: 64, offset: 4224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !66, file: !67, line: 117, baseType: !631, size: 32768, align: 64, offset: 4288)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 32768, align: 64, elements: !681)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !633, line: 10, size: 128, align: 64, elements: !634)
!633 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!634 = !{!635, !680}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !632, file: !633, line: 11, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !633, line: 7, baseType: !638)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640, !465, !85, !85, !84, !278}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !65, line: 7, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !643, line: 15, size: 1600, align: 64, elements: !644)
!643 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !490, line: 3, baseType: !71, size: 32, align: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !642, file: !490, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !642, file: !490, line: 5, baseType: !351, size: 64, align: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !642, file: !490, line: 7, baseType: !178, size: 64, align: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !642, file: !490, line: 8, baseType: !63, size: 64, align: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !642, file: !490, line: 9, baseType: !84, size: 64, align: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !642, file: !490, line: 10, baseType: !84, size: 64, align: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !642, file: !490, line: 11, baseType: !323, size: 64, align: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !642, file: !490, line: 12, baseType: !71, size: 32, align: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !642, file: !490, line: 13, baseType: !84, size: 64, align: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !642, file: !490, line: 15, baseType: !501, size: 64, align: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !642, file: !490, line: 17, baseType: !508, size: 64, align: 64, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !642, file: !512, line: 5, baseType: !84, size: 64, align: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !642, file: !512, line: 6, baseType: !84, size: 64, align: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !642, file: !512, line: 7, baseType: !323, size: 64, align: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !642, file: !512, line: 9, baseType: !351, size: 64, align: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !642, file: !512, line: 10, baseType: !517, size: 64, align: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !642, file: !512, line: 12, baseType: !148, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !642, file: !512, line: 13, baseType: !84, size: 64, align: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !642, file: !512, line: 14, baseType: !71, size: 32, align: 32, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !642, file: !512, line: 15, baseType: !84, size: 64, align: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !642, file: !512, line: 17, baseType: !148, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !642, file: !512, line: 18, baseType: !148, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !642, file: !512, line: 19, baseType: !148, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !642, file: !512, line: 20, baseType: !148, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !642, file: !512, line: 22, baseType: !148, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !642, file: !512, line: 23, baseType: !148, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !642, file: !512, line: 24, baseType: !148, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !642, file: !512, line: 25, baseType: !148, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !642, file: !512, line: 26, baseType: !148, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !642, file: !512, line: 31, baseType: !556, size: 64, align: 64, offset: 1344)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !642, file: !643, line: 18, baseType: !239, size: 64, align: 64, offset: 1408)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !642, file: !643, line: 20, baseType: !323, size: 64, align: 64, offset: 1472)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !642, file: !643, line: 21, baseType: !71, size: 32, align: 32, offset: 1536)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !642, file: !643, line: 22, baseType: !71, size: 32, align: 32, offset: 1568)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !632, file: !633, line: 12, baseType: !85, size: 8, align: 8, offset: 64)
!681 = !{!682}
!682 = !DISubrange(count: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !66, file: !67, line: 118, baseType: !684, size: 2048, align: 8, offset: 37056)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 2048, align: 8, elements: !681)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !66, file: !67, line: 120, baseType: !567, size: 64, align: 64, offset: 39104)
!686 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !688, line: 9, baseType: !689)
!688 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !692, !692, !692, !692, !692, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHRFunc", file: !353, line: 39, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!198, !177, !177, !177}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !121, line: 91, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !177, !177, !177}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSPLIT_REC", file: !704, line: 24, baseType: !705)
!704 = !DIFile(filename: "netsplit.h", directory: "/home/lichi/Desktop/irssi/task1")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 15, size: 384, align: 64, elements: !706)
!706 = !{!707, !717, !718, !719, !720, !721}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !705, file: !704, line: 16, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSPLIT_SERVER_REC", file: !704, line: 13, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 6, size: 256, align: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !710, file: !704, line: 7, baseType: !84, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "destserver", scope: !710, file: !704, line: 8, baseType: !84, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !710, file: !704, line: 9, baseType: !71, size: 32, align: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "prints", scope: !710, file: !704, line: 10, baseType: !71, size: 32, align: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !710, file: !704, line: 12, baseType: !323, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !705, file: !704, line: 18, baseType: !84, size: 64, align: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !705, file: !704, line: 19, baseType: !84, size: 64, align: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !705, file: !704, line: 20, baseType: !239, size: 64, align: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !705, file: !704, line: 22, baseType: !148, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !705, file: !704, line: 23, baseType: !323, size: 64, align: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSPLIT_CHAN_REC", file: !704, line: 32, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 26, size: 192, align: 64, elements: !725)
!725 = !{!726, !727, !728, !729, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !704, line: 27, baseType: !84, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !724, file: !704, line: 28, baseType: !148, size: 1, align: 32, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !724, file: !704, line: 29, baseType: !148, size: 1, align: 32, offset: 65, flags: DIFlagBitField, extraData: i64 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !724, file: !704, line: 30, baseType: !148, size: 1, align: 32, offset: 66, flags: DIFlagBitField, extraData: i64 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !724, file: !704, line: 31, baseType: !537, size: 64, align: 8, offset: 72)
!731 = !{!732}
!732 = distinct !DIGlobalVariable(name: "split_tag", scope: !0, file: !733, line: 33, type: !71, isLocal: true, isDefinition: true, variable: i32* @split_tag)
!733 = !DIFile(filename: "netsplit.c", directory: "/home/lichi/Desktop/irssi/task1")
!734 = !{i32 2, !"Dwarf Version", i32 4}
!735 = !{i32 2, !"Debug Info Version", i32 3}
!736 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!737 = distinct !DISubprogram(name: "netsplit_find", scope: !733, file: !733, line: 182, type: !738, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!702, !63, !465, !465}
!740 = !{}
!741 = !DILocalVariable(name: "server", arg: 1, scope: !737, file: !733, line: 182, type: !63)
!742 = !DIExpression()
!743 = !DILocation(line: 182, column: 45, scope: !737)
!744 = !DILocalVariable(name: "nick", arg: 2, scope: !737, file: !733, line: 182, type: !465)
!745 = !DILocation(line: 182, column: 65, scope: !737)
!746 = !DILocalVariable(name: "address", arg: 3, scope: !737, file: !733, line: 183, type: !465)
!747 = !DILocation(line: 183, column: 20, scope: !737)
!748 = !DILocalVariable(name: "rec", scope: !737, file: !733, line: 185, type: !702)
!749 = !DILocation(line: 185, column: 16, scope: !737)
!750 = !DILocation(line: 187, column: 2, scope: !737)
!751 = distinct !{!751, !750}
!752 = !DILocation(line: 187, column: 90, scope: !753)
!753 = !DILexicalBlockFile(scope: !754, file: !733, discriminator: 1)
!754 = distinct !DILexicalBlock(scope: !755, file: !733, line: 187, column: 10)
!755 = distinct !DILexicalBlock(scope: !737, file: !733, line: 187, column: 4)
!756 = !DILocation(line: 187, column: 72, scope: !753)
!757 = !DILocation(line: 187, column: 57, scope: !753)
!758 = !DILocation(line: 187, column: 56, scope: !753)
!759 = !DILocation(line: 187, column: 31, scope: !760)
!760 = !DILexicalBlockFile(scope: !753, file: !733, discriminator: 7)
!761 = !DILocation(line: 187, column: 12, scope: !753)
!762 = !DILocation(line: 187, column: 10, scope: !753)
!763 = !DILocation(line: 187, column: 11, scope: !764)
!764 = !DILexicalBlockFile(scope: !754, file: !733, discriminator: 2)
!765 = !DILocation(line: 187, column: 10, scope: !766)
!766 = !DILexicalBlockFile(scope: !755, file: !733, discriminator: 3)
!767 = !DILocation(line: 187, column: 30, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !733, discriminator: 4)
!769 = distinct !DILexicalBlock(scope: !754, file: !733, line: 187, column: 28)
!770 = !DILocation(line: 187, column: 39, scope: !771)
!771 = !DILexicalBlockFile(scope: !772, file: !733, discriminator: 5)
!772 = distinct !DILexicalBlock(scope: !754, file: !733, line: 187, column: 37)
!773 = !DILocation(line: 187, column: 133, scope: !771)
!774 = !DILocation(line: 187, column: 7, scope: !775)
!775 = !DILexicalBlockFile(scope: !755, file: !733, discriminator: 6)
!776 = !DILocation(line: 188, column: 2, scope: !737)
!777 = distinct !{!777, !776}
!778 = !DILocation(line: 188, column: 10, scope: !779)
!779 = !DILexicalBlockFile(scope: !780, file: !733, discriminator: 1)
!780 = distinct !DILexicalBlock(scope: !781, file: !733, line: 188, column: 10)
!781 = distinct !DILexicalBlock(scope: !737, file: !733, line: 188, column: 4)
!782 = !DILocation(line: 188, column: 15, scope: !779)
!783 = !DILocation(line: 188, column: 5, scope: !784)
!784 = !DILexicalBlockFile(scope: !785, file: !733, discriminator: 2)
!785 = distinct !DILexicalBlock(scope: !780, file: !733, line: 188, column: 3)
!786 = !DILocation(line: 188, column: 14, scope: !787)
!787 = !DILexicalBlockFile(scope: !788, file: !733, discriminator: 3)
!788 = distinct !DILexicalBlock(scope: !780, file: !733, line: 188, column: 12)
!789 = !DILocation(line: 188, column: 99, scope: !787)
