; ModuleID = './line8-set.o.i'
source_filename = "./line8-set.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!6 = !DIEnumerator(name: "G_TOKEN_EOF", value: 0)
!7 = !DIEnumerator(name: "G_TOKEN_LEFT_PAREN", value: 40)
!8 = !DIEnumerator(name: "G_TOKEN_RIGHT_PAREN", value: 41)
!9 = !DIEnumerator(name: "G_TOKEN_LEFT_CURLY", value: 123)
!10 = !DIEnumerator(name: "G_TOKEN_RIGHT_CURLY", value: 125)
!11 = !DIEnumerator(name: "G_TOKEN_LEFT_BRACE", value: 91)
!12 = !DIEnumerator(name: "G_TOKEN_RIGHT_BRACE", value: 93)
!13 = !DIEnumerator(name: "G_TOKEN_EQUAL_SIGN", value: 61)
!14 = !DIEnumerator(name: "G_TOKEN_COMMA", value: 44)
!15 = !DIEnumerator(name: "G_TOKEN_NONE", value: 256)
!16 = !DIEnumerator(name: "G_TOKEN_ERROR", value: 257)
!17 = !DIEnumerator(name: "G_TOKEN_CHAR", value: 258)
!18 = !DIEnumerator(name: "G_TOKEN_BINARY", value: 259)
!19 = !DIEnumerator(name: "G_TOKEN_OCTAL", value: 260)
!20 = !DIEnumerator(name: "G_TOKEN_INT", value: 261)
!21 = !DIEnumerator(name: "G_TOKEN_HEX", value: 262)
!22 = !DIEnumerator(name: "G_TOKEN_FLOAT", value: 263)
!23 = !DIEnumerator(name: "G_TOKEN_STRING", value: 264)
!24 = !DIEnumerator(name: "G_TOKEN_SYMBOL", value: 265)
!25 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER", value: 266)
!26 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER_NULL", value: 267)
!27 = !DIEnumerator(name: "G_TOKEN_COMMENT_SINGLE", value: 268)
!28 = !DIEnumerator(name: "G_TOKEN_COMMENT_MULTI", value: 269)
!29 = !DIEnumerator(name: "G_TOKEN_LAST", value: 270)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 69, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!34 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!35 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!36 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 77, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!40 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!41 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 31, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "G_IO_IN", value: 1)
!46 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!47 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!48 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!49 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!50 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 84, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!54 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!55 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!56 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!57 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!58 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!59 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!60 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!61 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 4, size: 32, align: 32, elements: !64)
!63 = !DIFile(filename: "iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!66 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!67 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!68 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!69 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 51, size: 32, align: 32, elements: !72)
!71 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!74 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!75 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!76 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!77 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!78 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!79 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!80 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!81 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!82 = !{!83, !84, !88, !90, !98}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !92, line: 37, baseType: !93)
!92 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !92, line: 39, size: 128, align: 64, elements: !94)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !92, line: 41, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !86, line: 77, baseType: !83)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !92, line: 42, baseType: !90, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !63, line: 17, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !63, line: 20, size: 192, align: 64, elements: !101)
!101 = !{!102, !104, !106}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !63, line: 21, baseType: !103, size: 32, align: 32)
!103 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !100, file: !63, line: 22, baseType: !105, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !100, file: !63, line: 23, baseType: !83, size: 64, align: 64, offset: 128)
!107 = !{i32 2, !"Dwarf Version", i32 4}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!110 = distinct !DISubprogram(name: "config_node_remove", scope: !111, file: !111, line: 35, type: !112, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !392)
!111 = !DIFile(filename: "set.c", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !98, !98}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !63, line: 18, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !63, line: 49, size: 576, align: 64, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !128, !129, !224, !390, !391}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !116, file: !63, line: 50, baseType: !105, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !116, file: !63, line: 51, baseType: !103, size: 32, align: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !116, file: !63, line: 52, baseType: !103, size: 32, align: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !116, file: !63, line: 54, baseType: !105, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !116, file: !63, line: 55, baseType: !98, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !116, file: !63, line: 56, baseType: !124, size: 64, align: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !126, line: 37, baseType: !127)
!126 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !126, line: 37, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !116, file: !63, line: 57, baseType: !124, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !116, file: !63, line: 59, baseType: !130, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !4, line: 37, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !4, line: 169, size: 1152, align: 64, elements: !133)
!133 = !{!134, !135, !138, !139, !142, !147, !179, !181, !205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !132, file: !4, line: 172, baseType: !96, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !132, file: !4, line: 173, baseType: !136, size: 32, align: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !86, line: 55, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !132, file: !4, line: 176, baseType: !136, size: 32, align: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !132, file: !4, line: 179, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !132, file: !4, line: 182, baseType: !143, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !145, line: 36, baseType: !146)
!145 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !145, line: 36, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !132, file: !4, line: 185, baseType: !148, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !4, line: 38, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !4, line: 127, size: 320, align: 64, elements: !151)
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !150, file: !4, line: 131, baseType: !84, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !150, file: !4, line: 132, baseType: !84, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !150, file: !4, line: 133, baseType: !84, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !150, file: !4, line: 134, baseType: !84, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !150, file: !4, line: 138, baseType: !136, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !150, file: !4, line: 143, baseType: !136, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !150, file: !4, line: 144, baseType: !136, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !150, file: !4, line: 145, baseType: !136, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !150, file: !4, line: 146, baseType: !136, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !150, file: !4, line: 147, baseType: !136, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !150, file: !4, line: 148, baseType: !136, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !150, file: !4, line: 149, baseType: !136, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !150, file: !4, line: 150, baseType: !136, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !150, file: !4, line: 151, baseType: !136, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !150, file: !4, line: 152, baseType: !136, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !150, file: !4, line: 153, baseType: !136, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !150, file: !4, line: 154, baseType: !136, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !150, file: !4, line: 155, baseType: !136, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !150, file: !4, line: 156, baseType: !136, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !150, file: !4, line: 157, baseType: !136, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !150, file: !4, line: 158, baseType: !136, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !150, file: !4, line: 159, baseType: !136, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !150, file: !4, line: 160, baseType: !136, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !150, file: !4, line: 161, baseType: !136, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !150, file: !4, line: 162, baseType: !136, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !150, file: !4, line: 163, baseType: !136, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !150, file: !4, line: 166, baseType: !136, size: 32, align: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !132, file: !4, line: 188, baseType: !180, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !4, line: 109, baseType: !3)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !132, file: !4, line: 189, baseType: !182, size: 64, align: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !4, line: 39, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !4, line: 111, size: 64, align: 64, elements: !184)
!184 = !{!185, !186, !187, !190, !191, !192, !195, !198, !199, !200, !201, !204}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !183, file: !4, line: 113, baseType: !96, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !183, file: !4, line: 114, baseType: !84, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !183, file: !4, line: 115, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !86, line: 54, baseType: !189)
!189 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !183, file: !4, line: 116, baseType: !188, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !183, file: !4, line: 117, baseType: !188, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !183, file: !4, line: 118, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !194, line: 52, baseType: !189)
!194 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !183, file: !4, line: 119, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !86, line: 58, baseType: !197)
!197 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !183, file: !4, line: 120, baseType: !188, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !183, file: !4, line: 121, baseType: !84, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !183, file: !4, line: 122, baseType: !84, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !183, file: !4, line: 123, baseType: !202, size: 8, align: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !86, line: 52, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !183, file: !4, line: 124, baseType: !136, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !132, file: !4, line: 190, baseType: !136, size: 32, align: 32, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !132, file: !4, line: 191, baseType: !136, size: 32, align: 32, offset: 480)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !132, file: !4, line: 194, baseType: !180, size: 32, align: 32, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !132, file: !4, line: 195, baseType: !182, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !132, file: !4, line: 196, baseType: !136, size: 32, align: 32, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !132, file: !4, line: 197, baseType: !136, size: 32, align: 32, offset: 672)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !132, file: !4, line: 201, baseType: !124, size: 64, align: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !132, file: !4, line: 202, baseType: !213, size: 32, align: 32, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !86, line: 49, baseType: !103)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !132, file: !4, line: 203, baseType: !140, size: 64, align: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !132, file: !4, line: 204, baseType: !140, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !132, file: !4, line: 205, baseType: !84, size: 64, align: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !132, file: !4, line: 206, baseType: !136, size: 32, align: 32, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !132, file: !4, line: 210, baseType: !219, size: 64, align: 64, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !4, line: 41, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !130, !84, !223}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !86, line: 50, baseType: !213)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !116, file: !63, line: 62, baseType: !225, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !31, line: 41, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !31, line: 97, size: 896, align: 64, elements: !228)
!228 = !{!229, !230, !357, !358, !363, !364, !365, !366, !367, !376, !377, !378, !382, !383, !384, !385, !386, !387, !388, !389}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !227, file: !31, line: 100, baseType: !213, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !227, file: !31, line: 101, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !31, line: 42, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !31, line: 131, size: 512, align: 64, elements: !234)
!234 = !{!235, !254, !258, !265, !269, !344, !348, !353}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !233, file: !31, line: 133, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !225, !84, !240, !241, !242}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !31, line: 75, baseType: !30)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !194, line: 66, baseType: !189)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !245, line: 42, baseType: !246)
!245 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !245, line: 44, size: 128, align: 64, elements: !247)
!247 = !{!248, !252, !253}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !246, file: !245, line: 46, baseType: !249, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !250, line: 36, baseType: !251)
!250 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !194, line: 45, baseType: !137)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !246, file: !245, line: 47, baseType: !213, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !246, file: !245, line: 48, baseType: !84, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !233, file: !31, line: 138, baseType: !255, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!239, !225, !140, !240, !241, !242}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !233, file: !31, line: 143, baseType: !259, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!239, !225, !262, !264, !242}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !194, line: 51, baseType: !263)
!263 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !31, line: 82, baseType: !37)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !233, file: !31, line: 147, baseType: !266, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!239, !225, !242}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !233, file: !31, line: 149, baseType: !270, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !225, !343}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !43, line: 64, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !43, line: 171, size: 768, align: 64, elements: !276)
!276 = !{!277, !278, !298, !327, !328, !332, !333, !334, !335, !336, !337, !338, !339}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !275, file: !43, line: 174, baseType: !96, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !275, file: !43, line: 175, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !43, line: 77, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !43, line: 196, size: 192, align: 64, elements: !282)
!282 = !{!283, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !281, file: !43, line: 198, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !96}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !281, file: !43, line: 199, baseType: !284, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !281, file: !43, line: 200, baseType: !289, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !96, !273, !292, !297}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !43, line: 155, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!223, !96}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !275, file: !43, line: 177, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !43, line: 130, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !43, line: 214, size: 384, align: 64, elements: !303)
!303 = !{!304, !309, !313, !317, !321, !322}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !302, file: !43, line: 216, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!223, !273, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !302, file: !43, line: 218, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!223, !273}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !302, file: !43, line: 219, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!223, !273, !293, !96}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !302, file: !43, line: 222, baseType: !318, size: 64, align: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !273}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !302, file: !43, line: 226, baseType: !293, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !302, file: !43, line: 227, baseType: !323, size: 64, align: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !43, line: 212, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !275, file: !43, line: 178, baseType: !136, size: 32, align: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !275, file: !43, line: 180, baseType: !329, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !43, line: 48, baseType: !331)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !43, line: 48, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !275, file: !43, line: 182, baseType: !213, size: 32, align: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !43, line: 183, baseType: !136, size: 32, align: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !275, file: !43, line: 184, baseType: !136, size: 32, align: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !275, file: !43, line: 186, baseType: !90, size: 64, align: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !43, line: 188, baseType: !273, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !43, line: 189, baseType: !273, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !275, file: !43, line: 191, baseType: !105, size: 64, align: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !275, file: !43, line: 193, baseType: !340, size: 64, align: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !43, line: 65, baseType: !342)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !43, line: 65, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !43, line: 39, baseType: !42)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !233, file: !31, line: 151, baseType: !345, size: 64, align: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !225}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !233, file: !31, line: 152, baseType: !349, size: 64, align: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!239, !225, !352, !242}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !31, line: 95, baseType: !51)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !233, file: !31, line: 155, baseType: !354, size: 64, align: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!352, !225}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !227, file: !31, line: 103, baseType: !84, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !227, file: !31, line: 104, baseType: !359, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !360, line: 77, baseType: !361)
!360 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !360, line: 77, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !227, file: !31, line: 105, baseType: !359, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !227, file: !31, line: 106, baseType: !84, size: 64, align: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !227, file: !31, line: 107, baseType: !136, size: 32, align: 32, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !227, file: !31, line: 109, baseType: !240, size: 64, align: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !227, file: !31, line: 110, baseType: !368, size: 64, align: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !370, line: 39, baseType: !371)
!370 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !370, line: 41, size: 192, align: 64, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !371, file: !370, line: 43, baseType: !84, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !371, file: !370, line: 44, baseType: !240, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !371, file: !370, line: 45, baseType: !240, size: 64, align: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !227, file: !31, line: 111, baseType: !368, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !227, file: !31, line: 112, baseType: !368, size: 64, align: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !227, file: !31, line: 113, baseType: !379, size: 48, align: 8, offset: 704)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, align: 8, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 6)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !227, file: !31, line: 117, baseType: !136, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !227, file: !31, line: 118, baseType: !136, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !227, file: !31, line: 119, baseType: !136, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !227, file: !31, line: 120, baseType: !136, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !227, file: !31, line: 121, baseType: !136, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !227, file: !31, line: 122, baseType: !136, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !227, file: !31, line: 124, baseType: !96, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !227, file: !31, line: 125, baseType: !96, size: 64, align: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !116, file: !63, line: 63, baseType: !103, size: 32, align: 32, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !116, file: !63, line: 64, baseType: !103, size: 32, align: 32, offset: 544)
!392 = !{}
!393 = !DILocalVariable(name: "rec", arg: 1, scope: !110, file: !111, line: 35, type: !114)
!394 = !DIExpression()
!395 = !DILocation(line: 35, column: 37, scope: !110)
!396 = !DILocalVariable(name: "parent", arg: 2, scope: !110, file: !111, line: 35, type: !98)
!397 = !DILocation(line: 35, column: 55, scope: !110)
!398 = !DILocalVariable(name: "node", arg: 3, scope: !110, file: !111, line: 35, type: !98)
!399 = !DILocation(line: 35, column: 76, scope: !110)
!400 = !DILocation(line: 37, column: 2, scope: !110)
!401 = distinct !{!401, !400}
!402 = !DILocation(line: 37, column: 10, scope: !403)
!403 = !DILexicalBlockFile(scope: !404, file: !111, discriminator: 1)
!404 = distinct !DILexicalBlock(scope: !405, file: !111, line: 37, column: 10)
!405 = distinct !DILexicalBlock(scope: !110, file: !111, line: 37, column: 4)
!406 = !DILocation(line: 37, column: 15, scope: !403)
!407 = !DILocation(line: 37, column: 5, scope: !408)
!408 = !DILexicalBlockFile(scope: !409, file: !111, discriminator: 2)
!409 = distinct !DILexicalBlock(scope: !404, file: !111, line: 37, column: 3)
!410 = !DILocation(line: 37, column: 14, scope: !411)
!411 = !DILexicalBlockFile(scope: !412, file: !111, discriminator: 3)
!412 = distinct !DILexicalBlock(scope: !404, file: !111, line: 37, column: 12)
!413 = !DILocation(line: 37, column: 99, scope: !411)
!414 = !DILocation(line: 37, column: 110, scope: !415)
!415 = !DILexicalBlockFile(scope: !405, file: !111, discriminator: 4)
!416 = !DILocation(line: 39, column: 6, scope: !417)
!417 = distinct !DILexicalBlock(scope: !110, file: !111, line: 39, column: 6)
!418 = !DILocation(line: 39, column: 13, scope: !417)
!419 = !DILocation(line: 39, column: 6, scope: !110)
!420 = !DILocation(line: 40, column: 26, scope: !417)
!421 = !DILocation(line: 40, column: 31, scope: !417)
!422 = !DILocation(line: 40, column: 24, scope: !417)
!423 = !DILocation(line: 40, column: 17, scope: !417)
!424 = !DILocation(line: 42, column: 2, scope: !110)
!425 = !DILocation(line: 42, column: 7, scope: !110)
!426 = !DILocation(line: 42, column: 20, scope: !110)
!427 = !DILocation(line: 43, column: 15, scope: !110)
!428 = !DILocation(line: 43, column: 20, scope: !110)
!429 = !DILocation(line: 43, column: 2, scope: !110)
!430 = !DILocation(line: 44, column: 33, scope: !110)
!431 = !DILocation(line: 44, column: 41, scope: !110)
!432 = !DILocation(line: 44, column: 48, scope: !110)
!433 = !DILocation(line: 44, column: 18, scope: !110)
!434 = !DILocation(line: 44, column: 2, scope: !110)
!435 = !DILocation(line: 44, column: 10, scope: !110)
!436 = !DILocation(line: 44, column: 16, scope: !110)
!437 = !DILocation(line: 46, column: 10, scope: !110)
!438 = !DILocation(line: 46, column: 16, scope: !110)
!439 = !DILocation(line: 46, column: 2, scope: !110)
!440 = !DILocation(line: 50, column: 10, scope: !441)
!441 = distinct !DILexicalBlock(scope: !110, file: !111, line: 46, column: 22)
!442 = !DILocation(line: 50, column: 16, scope: !441)
!443 = !DILocation(line: 50, column: 3, scope: !441)
!444 = !DILocation(line: 51, column: 3, scope: !441)
!445 = !DILocation(line: 54, column: 3, scope: !441)
!446 = !DILocation(line: 54, column: 10, scope: !447)
!447 = !DILexicalBlockFile(scope: !441, file: !111, discriminator: 1)
!448 = !DILocation(line: 54, column: 16, scope: !447)
!449 = !DILocation(line: 54, column: 22, scope: !447)
!450 = !DILocation(line: 54, column: 3, scope: !447)
!451 = !DILocation(line: 55, column: 23, scope: !441)
!452 = !DILocation(line: 55, column: 28, scope: !441)
!453 = !DILocation(line: 55, column: 46, scope: !441)
!454 = !DILocation(line: 55, column: 52, scope: !441)
!455 = !DILocation(line: 55, column: 35, scope: !441)
!456 = !DILocation(line: 55, column: 60, scope: !441)
!457 = !DILocation(line: 55, column: 34, scope: !441)
!458 = !DILocation(line: 55, column: 4, scope: !441)
