; ModuleID = './line264-window-items.o.i'
source_filename = "./line264-window-items.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!242 = !DIEnumerator(name: "TXT_INVALID_TIME", value: 165)
!243 = !DIEnumerator(name: "TXT_INVALID_LEVEL", value: 166)
!244 = !DIEnumerator(name: "TXT_INVALID_SIZE", value: 167)
!245 = !DIEnumerator(name: "TXT_INVALID_CHARSET", value: 168)
!246 = !DIEnumerator(name: "TXT_INVALID_CHOICE", value: 169)
!247 = !DIEnumerator(name: "TXT_EVAL_MAX_RECURSE", value: 170)
!248 = !DIEnumerator(name: "TXT_PROGRAM_NOT_FOUND", value: 171)
!249 = !DIEnumerator(name: "TXT_NO_SERVER_DEFINED", value: 172)
!250 = !DIEnumerator(name: "TXT_FILL_11", value: 173)
!251 = !DIEnumerator(name: "TXT_THEME_SAVED", value: 174)
!252 = !DIEnumerator(name: "TXT_THEME_SAVE_FAILED", value: 175)
!253 = !DIEnumerator(name: "TXT_THEME_NOT_FOUND", value: 176)
!254 = !DIEnumerator(name: "TXT_THEME_CHANGED", value: 177)
!255 = !DIEnumerator(name: "TXT_WINDOW_THEME", value: 178)
!256 = !DIEnumerator(name: "TXT_WINDOW_THEME_DEFAULT", value: 179)
!257 = !DIEnumerator(name: "TXT_WINDOW_THEME_CHANGED", value: 180)
!258 = !DIEnumerator(name: "TXT_WINDOW_THEME_REMOVED", value: 181)
!259 = !DIEnumerator(name: "TXT_FORMAT_TITLE", value: 182)
!260 = !DIEnumerator(name: "TXT_FORMAT_SUBTITLE", value: 183)
!261 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!262 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!263 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!264 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!265 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!266 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!267 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!268 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!269 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!270 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!271 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!272 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!273 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!274 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!275 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!276 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!277 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!278 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!279 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!280 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!281 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!282 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!283 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!284 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!285 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!286 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!287 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!288 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!289 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!290 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!291 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!292 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!293 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!294 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!295 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!296 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!297 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!298 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!299 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!300 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!301 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!302 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!303 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!304 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!305 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!306 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!307 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!308 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!309 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!310 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!311 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!312 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!313 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!314 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!315 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!316 = !{!317, !318, !322, !324, !345, !342, !631, !769}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !320, line: 46, baseType: !321)
!320 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!321 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !326, line: 117, baseType: !327)
!326 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !36, line: 28, size: 1280, align: 64, elements: !328)
!328 = !{!329, !331, !333, !334, !335, !344, !734, !735, !736, !737, !738, !739, !740, !741, !742, !761, !762, !763, !764, !765, !766, !767, !768}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !327, file: !36, line: 29, baseType: !330, size: 32, align: 32)
!330 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !36, line: 30, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !327, file: !36, line: 32, baseType: !330, size: 32, align: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !327, file: !36, line: 32, baseType: !330, size: 32, align: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !327, file: !36, line: 34, baseType: !336, size: 64, align: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !338, line: 37, baseType: !339)
!338 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !338, line: 39, size: 128, align: 64, elements: !340)
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !338, line: 41, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !320, line: 77, baseType: !317)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !338, line: 42, baseType: !336, size: 64, align: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !327, file: !36, line: 35, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !326, line: 108, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !348, line: 5, size: 704, align: 64, elements: !349)
!348 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!349 = !{!350, !352, !353, !358, !359, !727, !728, !729, !730, !731, !732, !733}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !347, file: !351, line: 3, baseType: !330, size: 32, align: 32)
!351 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !347, file: !351, line: 4, baseType: !330, size: 32, align: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !347, file: !351, line: 5, baseType: !354, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !356, line: 37, baseType: !357)
!356 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !356, line: 37, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !347, file: !351, line: 7, baseType: !317, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !347, file: !351, line: 8, baseType: !360, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !326, line: 107, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !363, line: 30, size: 2240, align: 64, elements: !364)
!363 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = !{!365, !367, !368, !369, !590, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !608, !612, !613, !614, !618, !619, !620, !621, !622, !623, !624, !625, !626, !633, !634, !635, !636, !637, !641, !645, !649, !653, !657, !662, !715, !722, !726}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !366, line: 3, baseType: !330, size: 32, align: 32)
!366 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !362, file: !366, line: 4, baseType: !330, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !362, file: !366, line: 6, baseType: !330, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !362, file: !366, line: 8, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !326, line: 113, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !363, line: 25, size: 1920, align: 64, elements: !373)
!373 = !{!374, !376, !377, !378, !379, !380, !381, !382, !383, !385, !386, !387, !388, !389, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !375, line: 3, baseType: !330, size: 32, align: 32)
!375 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !372, file: !375, line: 4, baseType: !330, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !372, file: !375, line: 6, baseType: !330, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !372, file: !375, line: 9, baseType: !332, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !372, file: !375, line: 10, baseType: !330, size: 32, align: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !372, file: !375, line: 11, baseType: !332, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !372, file: !375, line: 11, baseType: !332, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !372, file: !375, line: 11, baseType: !332, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !372, file: !375, line: 13, baseType: !384, size: 16, align: 16, offset: 448)
!384 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !372, file: !375, line: 14, baseType: !332, size: 64, align: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !372, file: !375, line: 15, baseType: !332, size: 64, align: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !372, file: !375, line: 16, baseType: !330, size: 32, align: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !372, file: !375, line: 17, baseType: !332, size: 64, align: 64, offset: 704)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !372, file: !375, line: 19, baseType: !390, size: 64, align: 64, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !326, line: 99, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !326, line: 99, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !372, file: !375, line: 19, baseType: !390, size: 64, align: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !372, file: !375, line: 21, baseType: !332, size: 64, align: 64, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !372, file: !375, line: 22, baseType: !332, size: 64, align: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !372, file: !375, line: 23, baseType: !332, size: 64, align: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !372, file: !375, line: 24, baseType: !332, size: 64, align: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !372, file: !375, line: 26, baseType: !332, size: 64, align: 64, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !372, file: !375, line: 27, baseType: !332, size: 64, align: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !372, file: !375, line: 28, baseType: !332, size: 64, align: 64, offset: 1280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !372, file: !375, line: 29, baseType: !332, size: 64, align: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !372, file: !375, line: 30, baseType: !332, size: 64, align: 64, offset: 1408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !372, file: !375, line: 31, baseType: !332, size: 64, align: 64, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !372, file: !375, line: 32, baseType: !332, size: 64, align: 64, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !372, file: !375, line: 33, baseType: !332, size: 64, align: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !372, file: !375, line: 35, baseType: !407, size: 64, align: 64, offset: 1664)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !410)
!410 = !{!411, !413, !547, !548, !553, !554, !555, !556, !557, !566, !567, !568, !572, !573, !574, !575, !576, !577, !578, !579}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !409, file: !4, line: 100, baseType: !412, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !320, line: 49, baseType: !330)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !409, file: !4, line: 101, baseType: !414, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !417)
!417 = !{!418, !440, !446, !453, !457, !534, !538, !543}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !416, file: !4, line: 133, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !407, !318, !423, !426, !427}
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !424, line: 66, baseType: !425)
!424 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!425 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !430, line: 42, baseType: !431)
!430 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !430, line: 44, size: 128, align: 64, elements: !432)
!432 = !{!433, !438, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !431, file: !430, line: 46, baseType: !434, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !435, line: 36, baseType: !436)
!435 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !424, line: 45, baseType: !437)
!437 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !431, file: !430, line: 47, baseType: !412, size: 32, align: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !431, file: !430, line: 48, baseType: !318, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !416, file: !4, line: 138, baseType: !441, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!422, !407, !444, !423, !426, !427}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !416, file: !4, line: 143, baseType: !447, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!422, !407, !450, !452, !427}
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !424, line: 51, baseType: !451)
!451 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !416, file: !4, line: 147, baseType: !454, size: 64, align: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!422, !407, !427}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !416, file: !4, line: 149, baseType: !458, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !407, !533}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !464)
!464 = !{!465, !466, !487, !516, !518, !522, !523, !524, !525, !526, !527, !528, !529}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !463, file: !16, line: 174, baseType: !342, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !463, file: !16, line: 175, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !470)
!470 = !{!471, !475, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !469, file: !16, line: 198, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !342}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !469, file: !16, line: 199, baseType: !472, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !469, file: !16, line: 200, baseType: !477, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !342, !461, !480, !486}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !342}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !320, line: 50, baseType: !412)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !463, file: !16, line: 177, baseType: !488, size: 64, align: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !492)
!492 = !{!493, !498, !502, !506, !510, !511}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !491, file: !16, line: 216, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!485, !461, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !491, file: !16, line: 218, baseType: !499, size: 64, align: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!485, !461}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !491, file: !16, line: 219, baseType: !503, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!485, !461, !481, !342}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !491, file: !16, line: 222, baseType: !507, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !461}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !491, file: !16, line: 226, baseType: !481, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !491, file: !16, line: 227, baseType: !512, size: 64, align: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{null}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !463, file: !16, line: 178, baseType: !517, size: 32, align: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !320, line: 55, baseType: !437)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !463, file: !16, line: 180, baseType: !519, size: 64, align: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !463, file: !16, line: 182, baseType: !412, size: 32, align: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !463, file: !16, line: 183, baseType: !517, size: 32, align: 32, offset: 352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !463, file: !16, line: 184, baseType: !517, size: 32, align: 32, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !463, file: !16, line: 186, baseType: !336, size: 64, align: 64, offset: 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !16, line: 188, baseType: !461, size: 64, align: 64, offset: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !16, line: 189, baseType: !461, size: 64, align: 64, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !463, file: !16, line: 191, baseType: !332, size: 64, align: 64, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !463, file: !16, line: 193, baseType: !530, size: 64, align: 64, offset: 704)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !416, file: !4, line: 151, baseType: !535, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !407}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !416, file: !4, line: 152, baseType: !539, size: 64, align: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!422, !407, !542, !427}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !416, file: !4, line: 155, baseType: !544, size: 64, align: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!542, !407}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !409, file: !4, line: 103, baseType: !318, size: 64, align: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !409, file: !4, line: 104, baseType: !549, size: 64, align: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !550, line: 77, baseType: !551)
!550 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !550, line: 77, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !409, file: !4, line: 105, baseType: !549, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !409, file: !4, line: 106, baseType: !318, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !409, file: !4, line: 107, baseType: !517, size: 32, align: 32, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !409, file: !4, line: 109, baseType: !423, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !409, file: !4, line: 110, baseType: !558, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !560, line: 39, baseType: !561)
!560 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !560, line: 41, size: 192, align: 64, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !561, file: !560, line: 43, baseType: !318, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !561, file: !560, line: 44, baseType: !423, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !561, file: !560, line: 45, baseType: !423, size: 64, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !409, file: !4, line: 111, baseType: !558, size: 64, align: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !409, file: !4, line: 112, baseType: !558, size: 64, align: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !409, file: !4, line: 113, baseType: !569, size: 48, align: 8, offset: 704)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 48, align: 8, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 6)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !409, file: !4, line: 117, baseType: !517, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !409, file: !4, line: 118, baseType: !517, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !409, file: !4, line: 119, baseType: !517, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !409, file: !4, line: 120, baseType: !517, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !409, file: !4, line: 121, baseType: !517, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !409, file: !4, line: 122, baseType: !517, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !409, file: !4, line: 124, baseType: !342, size: 64, align: 64, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !409, file: !4, line: 125, baseType: !342, size: 64, align: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !372, file: !375, line: 38, baseType: !437, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !372, file: !375, line: 39, baseType: !437, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !372, file: !375, line: 40, baseType: !437, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !372, file: !375, line: 41, baseType: !437, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !372, file: !375, line: 42, baseType: !437, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !372, file: !375, line: 43, baseType: !437, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !372, file: !375, line: 44, baseType: !437, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !372, file: !375, line: 45, baseType: !437, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !372, file: !375, line: 46, baseType: !332, size: 64, align: 64, offset: 1792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !372, file: !375, line: 47, baseType: !332, size: 64, align: 64, offset: 1856)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !362, file: !366, line: 9, baseType: !591, size: 64, align: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !592, line: 75, baseType: !593)
!592 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !594, line: 139, baseType: !451)
!594 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !362, file: !366, line: 10, baseType: !591, size: 64, align: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !362, file: !366, line: 12, baseType: !332, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !362, file: !366, line: 13, baseType: !332, size: 64, align: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !362, file: !366, line: 15, baseType: !437, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !362, file: !366, line: 16, baseType: !437, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !362, file: !366, line: 17, baseType: !437, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !362, file: !366, line: 18, baseType: !437, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !362, file: !366, line: 19, baseType: !437, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !362, file: !366, line: 21, baseType: !604, size: 64, align: 64, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !326, line: 102, baseType: !606)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !326, line: 102, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !362, file: !366, line: 22, baseType: !330, size: 32, align: 32, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !362, file: !366, line: 25, baseType: !609, size: 128, align: 64, offset: 640)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 128, align: 64, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 2)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !362, file: !366, line: 26, baseType: !330, size: 32, align: 32, offset: 768)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !362, file: !366, line: 27, baseType: !330, size: 32, align: 32, offset: 800)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !362, file: !366, line: 29, baseType: !615, size: 64, align: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !326, line: 103, baseType: !617)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !326, line: 103, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !362, file: !366, line: 30, baseType: !354, size: 64, align: 64, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !362, file: !366, line: 32, baseType: !332, size: 64, align: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !362, file: !366, line: 33, baseType: !332, size: 64, align: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !362, file: !366, line: 34, baseType: !332, size: 64, align: 64, offset: 1088)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !362, file: !366, line: 35, baseType: !437, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !362, file: !366, line: 36, baseType: !437, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !362, file: !366, line: 37, baseType: !437, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !362, file: !366, line: 38, baseType: !437, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !362, file: !366, line: 40, baseType: !627, size: 128, align: 64, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !320, line: 504, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !320, line: 506, size: 128, align: 64, elements: !629)
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !628, file: !320, line: 508, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !320, line: 48, baseType: !451)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !628, file: !320, line: 509, baseType: !631, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !362, file: !366, line: 41, baseType: !591, size: 64, align: 64, offset: 1344)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !362, file: !366, line: 42, baseType: !330, size: 32, align: 32, offset: 1408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !362, file: !366, line: 44, baseType: !336, size: 64, align: 64, offset: 1472)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !362, file: !366, line: 45, baseType: !336, size: 64, align: 64, offset: 1536)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !362, file: !366, line: 53, baseType: !638, size: 64, align: 64, offset: 1600)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !360, !322, !330}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !362, file: !366, line: 55, baseType: !642, size: 64, align: 64, offset: 1664)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!330, !360, !321}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !362, file: !366, line: 57, baseType: !646, size: 64, align: 64, offset: 1728)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!330, !360, !322}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !362, file: !366, line: 60, baseType: !650, size: 64, align: 64, offset: 1792)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!322, !360}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !362, file: !366, line: 62, baseType: !654, size: 64, align: 64, offset: 1856)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !360, !322, !322, !330}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !362, file: !366, line: 65, baseType: !658, size: 64, align: 64, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!661, !360, !322, !322}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !362, file: !366, line: 69, baseType: !663, size: 64, align: 64, offset: 1984)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !360, !322}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !326, line: 109, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !669, line: 15, size: 1408, align: 64, elements: !670)
!669 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !685, !689, !691, !692, !693, !694, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !351, line: 3, baseType: !330, size: 32, align: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !668, file: !351, line: 4, baseType: !330, size: 32, align: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !668, file: !351, line: 5, baseType: !354, size: 64, align: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !668, file: !351, line: 7, baseType: !317, size: 64, align: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !668, file: !351, line: 8, baseType: !360, size: 64, align: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !668, file: !351, line: 9, baseType: !332, size: 64, align: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !351, line: 10, baseType: !332, size: 64, align: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !668, file: !351, line: 11, baseType: !591, size: 64, align: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !668, file: !351, line: 12, baseType: !330, size: 32, align: 32, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !668, file: !351, line: 13, baseType: !332, size: 64, align: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !668, file: !351, line: 15, baseType: !682, size: 64, align: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !345}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !668, file: !351, line: 17, baseType: !686, size: 64, align: 64, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!322, !345}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !668, file: !690, line: 5, baseType: !332, size: 64, align: 64, offset: 704)
!690 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !668, file: !690, line: 6, baseType: !332, size: 64, align: 64, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !668, file: !690, line: 7, baseType: !591, size: 64, align: 64, offset: 832)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !668, file: !690, line: 9, baseType: !354, size: 64, align: 64, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !668, file: !690, line: 10, baseType: !695, size: 64, align: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !326, line: 111, baseType: !697)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !326, line: 111, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !668, file: !690, line: 12, baseType: !437, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !668, file: !690, line: 13, baseType: !332, size: 64, align: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !668, file: !690, line: 14, baseType: !330, size: 32, align: 32, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !668, file: !690, line: 15, baseType: !332, size: 64, align: 64, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !668, file: !690, line: 17, baseType: !437, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !668, file: !690, line: 18, baseType: !437, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !668, file: !690, line: 19, baseType: !437, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !668, file: !690, line: 20, baseType: !437, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !668, file: !690, line: 22, baseType: !437, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !668, file: !690, line: 23, baseType: !437, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !668, file: !690, line: 24, baseType: !437, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !668, file: !690, line: 25, baseType: !437, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !668, file: !690, line: 26, baseType: !437, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !668, file: !690, line: 31, baseType: !712, size: 64, align: 64, offset: 1344)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!332, !666}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !362, file: !366, line: 70, baseType: !716, size: 64, align: 64, offset: 2048)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!719, !360, !322}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !326, line: 110, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !326, line: 110, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !362, file: !366, line: 71, baseType: !723, size: 64, align: 64, offset: 2112)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!330, !322, !322}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !362, file: !366, line: 73, baseType: !723, size: 64, align: 64, offset: 2176)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !347, file: !351, line: 9, baseType: !332, size: 64, align: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !351, line: 10, baseType: !332, size: 64, align: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !347, file: !351, line: 11, baseType: !591, size: 64, align: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !347, file: !351, line: 12, baseType: !330, size: 32, align: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !347, file: !351, line: 13, baseType: !332, size: 64, align: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !347, file: !351, line: 15, baseType: !682, size: 64, align: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !347, file: !351, line: 17, baseType: !686, size: 64, align: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !327, file: !36, line: 36, baseType: !360, size: 64, align: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !327, file: !36, line: 37, baseType: !360, size: 64, align: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !327, file: !36, line: 38, baseType: !332, size: 64, align: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !327, file: !36, line: 40, baseType: !330, size: 32, align: 32, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !327, file: !36, line: 41, baseType: !336, size: 64, align: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !327, file: !36, line: 43, baseType: !437, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !327, file: !36, line: 44, baseType: !437, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !327, file: !36, line: 45, baseType: !437, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !327, file: !36, line: 48, baseType: !743, size: 64, align: 64, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !745, line: 14, baseType: !746)
!745 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 6, size: 256, align: 64, elements: !747)
!747 = !{!748, !749, !758, !759, !760}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !746, file: !745, line: 7, baseType: !332, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !746, file: !745, line: 9, baseType: !750, size: 64, align: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !752, line: 37, baseType: !753)
!752 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !752, line: 39, size: 192, align: 64, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !752, line: 41, baseType: !342, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !752, line: 42, baseType: !750, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !753, file: !752, line: 43, baseType: !750, size: 64, align: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !746, file: !745, line: 10, baseType: !330, size: 32, align: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !746, file: !745, line: 12, baseType: !330, size: 32, align: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !746, file: !745, line: 13, baseType: !330, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !327, file: !36, line: 49, baseType: !332, size: 64, align: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !327, file: !36, line: 51, baseType: !330, size: 32, align: 32, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !327, file: !36, line: 52, baseType: !332, size: 64, align: 64, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !327, file: !36, line: 54, baseType: !591, size: 64, align: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !327, file: !36, line: 55, baseType: !591, size: 64, align: 64, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !327, file: !36, line: 57, baseType: !332, size: 64, align: 64, offset: 1088)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !327, file: !36, line: 58, baseType: !317, size: 64, align: 64, offset: 1152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !327, file: !36, line: 60, baseType: !317, size: 64, align: 64, offset: 1216)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !770, line: 9, baseType: !771)
!770 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !774, !774, !774, !774, !774, !774}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!776 = !{i32 2, !"Dwarf Version", i32 4}
!777 = !{i32 2, !"Debug Info Version", i32 3}
!778 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!779 = distinct !DISubprogram(name: "window_item_add", scope: !780, file: !780, line: 65, type: !781, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!780 = !DIFile(filename: "window-items.c", directory: "/home/lichi/Desktop/irssi/task1")
!781 = !DISubroutineType(types: !782)
!782 = !{null, !324, !345, !330}
!783 = !{}
!784 = !DILocalVariable(name: "window", arg: 1, scope: !779, file: !780, line: 65, type: !324)
!785 = !DIExpression()
!786 = !DILocation(line: 65, column: 34, scope: !779)
!787 = !DILocalVariable(name: "item", arg: 2, scope: !779, file: !780, line: 65, type: !345)
!788 = !DILocation(line: 65, column: 55, scope: !779)
!789 = !DILocalVariable(name: "automatic", arg: 3, scope: !779, file: !780, line: 65, type: !330)
!790 = !DILocation(line: 65, column: 65, scope: !779)
!791 = !DILocation(line: 67, column: 25, scope: !779)
!792 = !DILocation(line: 67, column: 33, scope: !779)
!793 = !DILocation(line: 67, column: 39, scope: !779)
!794 = !DILocation(line: 67, column: 2, scope: !779)
!795 = !DILocation(line: 68, column: 1, scope: !779)
!796 = distinct !DISubprogram(name: "window_item_add_signal", scope: !780, file: !780, line: 35, type: !797, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !324, !345, !330, !330}
!799 = !DILocalVariable(name: "window", arg: 1, scope: !796, file: !780, line: 35, type: !324)
!800 = !DILocation(line: 35, column: 48, scope: !796)
!801 = !DILocalVariable(name: "item", arg: 2, scope: !796, file: !780, line: 35, type: !345)
!802 = !DILocation(line: 35, column: 69, scope: !796)
!803 = !DILocalVariable(name: "automatic", arg: 3, scope: !796, file: !780, line: 35, type: !330)
!804 = !DILocation(line: 35, column: 79, scope: !796)
!805 = !DILocalVariable(name: "send_signal", arg: 4, scope: !796, file: !780, line: 35, type: !330)
!806 = !DILocation(line: 35, column: 94, scope: !796)
!807 = !DILocation(line: 37, column: 2, scope: !796)
!808 = distinct !{!808, !807}
!809 = !DILocation(line: 37, column: 10, scope: !810)
!810 = !DILexicalBlockFile(scope: !811, file: !780, discriminator: 1)
!811 = distinct !DILexicalBlock(scope: !812, file: !780, line: 37, column: 10)
!812 = distinct !DILexicalBlock(scope: !796, file: !780, line: 37, column: 4)
!813 = !DILocation(line: 37, column: 17, scope: !810)
!814 = !DILocation(line: 37, column: 5, scope: !815)
!815 = !DILexicalBlockFile(scope: !816, file: !780, discriminator: 2)
!816 = distinct !DILexicalBlock(scope: !811, file: !780, line: 37, column: 3)
!817 = !DILocation(line: 37, column: 14, scope: !818)
!818 = !DILexicalBlockFile(scope: !819, file: !780, discriminator: 3)
!819 = distinct !DILexicalBlock(scope: !811, file: !780, line: 37, column: 12)
!820 = !DILocation(line: 37, column: 101, scope: !818)
!821 = !DILocation(line: 37, column: 112, scope: !822)
!822 = !DILexicalBlockFile(scope: !812, file: !780, discriminator: 4)
!823 = !DILocation(line: 38, column: 2, scope: !796)
!824 = distinct !{!824, !823}
!825 = !DILocation(line: 38, column: 10, scope: !826)
!826 = !DILexicalBlockFile(scope: !827, file: !780, discriminator: 1)
!827 = distinct !DILexicalBlock(scope: !828, file: !780, line: 38, column: 10)
!828 = distinct !DILexicalBlock(scope: !796, file: !780, line: 38, column: 4)
!829 = !DILocation(line: 38, column: 15, scope: !826)
!830 = !DILocation(line: 38, column: 5, scope: !831)
!831 = !DILexicalBlockFile(scope: !832, file: !780, discriminator: 2)
!832 = distinct !DILexicalBlock(scope: !827, file: !780, line: 38, column: 3)
!833 = !DILocation(line: 38, column: 14, scope: !834)
!834 = !DILexicalBlockFile(scope: !835, file: !780, discriminator: 3)
!835 = distinct !DILexicalBlock(scope: !827, file: !780, line: 38, column: 12)
!836 = !DILocation(line: 38, column: 99, scope: !834)
!837 = !DILocation(line: 38, column: 110, scope: !838)
!838 = !DILexicalBlockFile(scope: !828, file: !780, discriminator: 4)
!839 = !DILocation(line: 39, column: 2, scope: !796)
!840 = distinct !{!840, !839}
!841 = !DILocation(line: 39, column: 10, scope: !842)
!842 = !DILexicalBlockFile(scope: !843, file: !780, discriminator: 1)
!843 = distinct !DILexicalBlock(scope: !844, file: !780, line: 39, column: 10)
!844 = distinct !DILexicalBlock(scope: !796, file: !780, line: 39, column: 4)
!845 = !DILocation(line: 39, column: 16, scope: !842)
!846 = !DILocation(line: 39, column: 23, scope: !842)
!847 = !DILocation(line: 39, column: 5, scope: !848)
!848 = !DILexicalBlockFile(scope: !849, file: !780, discriminator: 2)
!849 = distinct !DILexicalBlock(scope: !843, file: !780, line: 39, column: 3)
!850 = !DILocation(line: 39, column: 14, scope: !851)
!851 = !DILexicalBlockFile(scope: !852, file: !780, discriminator: 3)
!852 = distinct !DILexicalBlock(scope: !843, file: !780, line: 39, column: 12)
!853 = !DILocation(line: 39, column: 107, scope: !851)
!854 = !DILocation(line: 39, column: 118, scope: !855)
!855 = !DILexicalBlockFile(scope: !844, file: !780, discriminator: 4)
!856 = !DILocation(line: 41, column: 24, scope: !796)
!857 = !DILocation(line: 41, column: 9, scope: !796)
!858 = !DILocation(line: 41, column: 15, scope: !796)
!859 = !DILocation(line: 41, column: 22, scope: !796)
!860 = !DILocation(line: 43, column: 6, scope: !861)
!861 = distinct !DILexicalBlock(scope: !796, file: !780, line: 43, column: 6)
!862 = !DILocation(line: 43, column: 14, scope: !861)
!863 = !DILocation(line: 43, column: 20, scope: !861)
!864 = !DILocation(line: 43, column: 6, scope: !796)
!865 = !DILocation(line: 44, column: 20, scope: !866)
!866 = distinct !DILexicalBlock(scope: !861, file: !780, line: 43, column: 28)
!867 = !DILocation(line: 44, column: 3, scope: !866)
!868 = !DILocation(line: 44, column: 11, scope: !866)
!869 = !DILocation(line: 44, column: 18, scope: !866)
!870 = !DILocation(line: 45, column: 27, scope: !866)
!871 = !DILocation(line: 45, column: 33, scope: !866)
!872 = !DILocation(line: 45, column: 3, scope: !866)
!873 = !DILocation(line: 45, column: 11, scope: !866)
!874 = !DILocation(line: 45, column: 25, scope: !866)
!875 = !DILocation(line: 46, column: 2, scope: !866)
!876 = !DILocation(line: 48, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !796, file: !780, line: 48, column: 6)
!878 = !DILocation(line: 48, column: 17, scope: !877)
!879 = !DILocation(line: 48, column: 20, scope: !880)
!880 = !DILexicalBlockFile(scope: !877, file: !780, discriminator: 1)
!881 = !DILocation(line: 48, column: 6, scope: !880)
!882 = !DILocation(line: 49, column: 7, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !780, line: 49, column: 7)
!884 = distinct !DILexicalBlock(scope: !877, file: !780, line: 48, column: 61)
!885 = !DILocation(line: 49, column: 7, scope: !884)
!886 = !DILocation(line: 50, column: 47, scope: !883)
!887 = !DILocation(line: 50, column: 4, scope: !883)
!888 = !DILocation(line: 51, column: 21, scope: !884)
!889 = !DILocation(line: 51, column: 3, scope: !884)
!890 = !DILocation(line: 52, column: 2, scope: !884)
!891 = !DILocation(line: 54, column: 33, scope: !796)
!892 = !DILocation(line: 54, column: 41, scope: !796)
!893 = !DILocation(line: 54, column: 48, scope: !796)
!894 = !DILocation(line: 54, column: 18, scope: !796)
!895 = !DILocation(line: 54, column: 2, scope: !796)
!896 = !DILocation(line: 54, column: 10, scope: !796)
!897 = !DILocation(line: 54, column: 16, scope: !796)
!898 = !DILocation(line: 55, column: 6, scope: !899)
!899 = distinct !DILexicalBlock(scope: !796, file: !780, line: 55, column: 6)
!900 = !DILocation(line: 55, column: 6, scope: !796)
!901 = !DILocation(line: 56, column: 37, scope: !899)
!902 = !DILocation(line: 56, column: 45, scope: !899)
!903 = !DILocation(line: 56, column: 3, scope: !899)
!904 = !DILocation(line: 58, column: 21, scope: !905)
!905 = distinct !DILexicalBlock(scope: !796, file: !780, line: 58, column: 6)
!906 = !DILocation(line: 58, column: 29, scope: !905)
!907 = !DILocation(line: 58, column: 6, scope: !905)
!908 = !DILocation(line: 58, column: 36, scope: !905)
!909 = !DILocation(line: 58, column: 41, scope: !905)
!910 = !DILocation(line: 59, column: 8, scope: !905)
!911 = !DILocation(line: 59, column: 18, scope: !905)
!912 = !DILocation(line: 59, column: 21, scope: !913)
!913 = !DILexicalBlockFile(scope: !905, file: !780, discriminator: 1)
!914 = !DILocation(line: 58, column: 6, scope: !915)
!915 = !DILexicalBlockFile(scope: !796, file: !780, discriminator: 1)
!916 = !DILocation(line: 60, column: 17, scope: !917)
!917 = distinct !DILexicalBlock(scope: !905, file: !780, line: 59, column: 64)
!918 = !DILocation(line: 60, column: 25, scope: !917)
!919 = !DILocation(line: 60, column: 32, scope: !917)
!920 = !DILocation(line: 61, column: 26, scope: !917)
!921 = !DILocation(line: 61, column: 34, scope: !917)
!922 = !DILocation(line: 61, column: 3, scope: !917)
!923 = !DILocation(line: 62, column: 2, scope: !917)
!924 = !DILocation(line: 63, column: 1, scope: !796)
!925 = distinct !DISubprogram(name: "window_item_remove", scope: !780, file: !780, line: 93, type: !683, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!926 = !DILocalVariable(name: "item", arg: 1, scope: !925, file: !780, line: 93, type: !345)
!927 = !DILocation(line: 93, column: 38, scope: !925)
!928 = !DILocation(line: 95, column: 28, scope: !925)
!929 = !DILocation(line: 95, column: 2, scope: !925)
!930 = !DILocation(line: 96, column: 1, scope: !925)
!931 = distinct !DISubprogram(name: "window_item_remove_signal", scope: !780, file: !780, line: 70, type: !932, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !345, !330}
!934 = !DILocalVariable(name: "item", arg: 1, scope: !931, file: !780, line: 70, type: !345)
!935 = !DILocation(line: 70, column: 52, scope: !931)
!936 = !DILocalVariable(name: "emit_signal", arg: 2, scope: !931, file: !780, line: 70, type: !330)
!937 = !DILocation(line: 70, column: 62, scope: !931)
!938 = !DILocalVariable(name: "window", scope: !931, file: !780, line: 72, type: !324)
!939 = !DILocation(line: 72, column: 14, scope: !931)
!940 = !DILocation(line: 74, column: 2, scope: !931)
!941 = distinct !{!941, !940}
!942 = !DILocation(line: 74, column: 10, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !780, discriminator: 1)
!944 = distinct !DILexicalBlock(scope: !945, file: !780, line: 74, column: 10)
!945 = distinct !DILexicalBlock(scope: !931, file: !780, line: 74, column: 4)
!946 = !DILocation(line: 74, column: 15, scope: !943)
!947 = !DILocation(line: 74, column: 5, scope: !948)
!948 = !DILexicalBlockFile(scope: !949, file: !780, discriminator: 2)
!949 = distinct !DILexicalBlock(scope: !944, file: !780, line: 74, column: 3)
!950 = !DILocation(line: 74, column: 14, scope: !951)
!951 = !DILexicalBlockFile(scope: !952, file: !780, discriminator: 3)
!952 = distinct !DILexicalBlock(scope: !944, file: !780, line: 74, column: 12)
!953 = !DILocation(line: 74, column: 99, scope: !951)
!954 = !DILocation(line: 74, column: 110, scope: !955)
!955 = !DILexicalBlockFile(scope: !945, file: !780, discriminator: 4)
!956 = !DILocation(line: 76, column: 45, scope: !931)
!957 = !DILocation(line: 76, column: 53, scope: !931)
!958 = !DILocation(line: 76, column: 12, scope: !931)
!959 = !DILocation(line: 76, column: 9, scope: !931)
!960 = !DILocation(line: 78, column: 6, scope: !961)
!961 = distinct !DILexicalBlock(scope: !931, file: !780, line: 78, column: 6)
!962 = !DILocation(line: 78, column: 13, scope: !961)
!963 = !DILocation(line: 78, column: 6, scope: !931)
!964 = !DILocation(line: 79, column: 3, scope: !961)
!965 = !DILocation(line: 81, column: 9, scope: !931)
!966 = !DILocation(line: 81, column: 15, scope: !931)
!967 = !DILocation(line: 81, column: 22, scope: !931)
!968 = !DILocation(line: 82, column: 33, scope: !931)
!969 = !DILocation(line: 82, column: 41, scope: !931)
!970 = !DILocation(line: 82, column: 48, scope: !931)
!971 = !DILocation(line: 82, column: 18, scope: !931)
!972 = !DILocation(line: 82, column: 2, scope: !931)
!973 = !DILocation(line: 82, column: 10, scope: !931)
!974 = !DILocation(line: 82, column: 16, scope: !931)
!975 = !DILocation(line: 84, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !931, file: !780, line: 84, column: 6)
!977 = !DILocation(line: 84, column: 14, scope: !976)
!978 = !DILocation(line: 84, column: 24, scope: !976)
!979 = !DILocation(line: 84, column: 21, scope: !976)
!980 = !DILocation(line: 84, column: 6, scope: !931)
!981 = !DILocation(line: 85, column: 26, scope: !982)
!982 = distinct !DILexicalBlock(scope: !976, file: !780, line: 84, column: 30)
!983 = !DILocation(line: 85, column: 34, scope: !982)
!984 = !DILocation(line: 85, column: 42, scope: !982)
!985 = !DILocation(line: 85, column: 48, scope: !982)
!986 = !DILocation(line: 85, column: 34, scope: !987)
!987 = !DILexicalBlockFile(scope: !982, file: !780, discriminator: 1)
!988 = !DILocation(line: 86, column: 12, scope: !982)
!989 = !DILocation(line: 86, column: 20, scope: !982)
!990 = !DILocation(line: 86, column: 27, scope: !982)
!991 = !DILocation(line: 85, column: 34, scope: !992)
!992 = !DILexicalBlockFile(scope: !982, file: !780, discriminator: 2)
!993 = !DILocation(line: 85, column: 34, scope: !994)
!994 = !DILexicalBlockFile(scope: !982, file: !780, discriminator: 3)
!995 = !DILocation(line: 85, column: 3, scope: !994)
!996 = !DILocation(line: 87, column: 2, scope: !982)
!997 = !DILocation(line: 89, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !931, file: !780, line: 89, column: 6)
!999 = !DILocation(line: 89, column: 6, scope: !931)
!1000 = !DILocation(line: 90, column: 40, scope: !998)
!1001 = !DILocation(line: 90, column: 48, scope: !998)
!1002 = !DILocation(line: 90, column: 3, scope: !998)
!1003 = !DILocation(line: 91, column: 1, scope: !931)
!1004 = distinct !DISubprogram(name: "window_item_destroy", scope: !780, file: !780, line: 98, type: !683, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1005 = !DILocalVariable(name: "item", arg: 1, scope: !1004, file: !780, line: 98, type: !345)
!1006 = !DILocation(line: 98, column: 39, scope: !1004)
!1007 = !DILocation(line: 100, column: 28, scope: !1004)
!1008 = !DILocation(line: 100, column: 9, scope: !1004)
!1009 = !DILocation(line: 101, column: 9, scope: !1004)
!1010 = !DILocation(line: 101, column: 15, scope: !1004)
!1011 = !DILocation(line: 101, column: 23, scope: !1004)
!1012 = !DILocation(line: 102, column: 1, scope: !1004)
!1013 = distinct !DISubprogram(name: "window_item_change_server", scope: !780, file: !780, line: 104, type: !1014, isLocal: false, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !345, !317}
!1016 = !DILocalVariable(name: "item", arg: 1, scope: !1013, file: !780, line: 104, type: !345)
!1017 = !DILocation(line: 104, column: 45, scope: !1013)
!1018 = !DILocalVariable(name: "server", arg: 2, scope: !1013, file: !780, line: 104, type: !317)
!1019 = !DILocation(line: 104, column: 57, scope: !1013)
!1020 = !DILocalVariable(name: "window", scope: !1013, file: !780, line: 106, type: !324)
!1021 = !DILocation(line: 106, column: 14, scope: !1013)
!1022 = !DILocation(line: 108, column: 2, scope: !1013)
!1023 = distinct !{!1023, !1022}
!1024 = !DILocation(line: 108, column: 10, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !1026, file: !780, discriminator: 1)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !780, line: 108, column: 10)
!1027 = distinct !DILexicalBlock(scope: !1013, file: !780, line: 108, column: 4)
!1028 = !DILocation(line: 108, column: 15, scope: !1025)
!1029 = !DILocation(line: 108, column: 5, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1031, file: !780, discriminator: 2)
!1031 = distinct !DILexicalBlock(scope: !1026, file: !780, line: 108, column: 3)
!1032 = !DILocation(line: 108, column: 14, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1034, file: !780, discriminator: 3)
!1034 = distinct !DILexicalBlock(scope: !1026, file: !780, line: 108, column: 12)
!1035 = !DILocation(line: 108, column: 99, scope: !1033)
!1036 = !DILocation(line: 108, column: 110, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1027, file: !780, discriminator: 4)
!1038 = !DILocation(line: 110, column: 45, scope: !1013)
!1039 = !DILocation(line: 110, column: 53, scope: !1013)
!1040 = !DILocation(line: 110, column: 12, scope: !1013)
!1041 = !DILocation(line: 110, column: 9, scope: !1013)
!1042 = !DILocation(line: 111, column: 17, scope: !1013)
!1043 = !DILocation(line: 111, column: 2, scope: !1013)
!1044 = !DILocation(line: 111, column: 8, scope: !1013)
!1045 = !DILocation(line: 111, column: 15, scope: !1013)
!1046 = !DILocation(line: 113, column: 54, scope: !1013)
!1047 = !DILocation(line: 113, column: 62, scope: !1013)
!1048 = !DILocation(line: 113, column: 9, scope: !1013)
!1049 = !DILocation(line: 114, column: 6, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1013, file: !780, line: 114, column: 6)
!1051 = !DILocation(line: 114, column: 14, scope: !1050)
!1052 = !DILocation(line: 114, column: 24, scope: !1050)
!1053 = !DILocation(line: 114, column: 21, scope: !1050)
!1054 = !DILocation(line: 114, column: 6, scope: !1013)
!1055 = !DILocation(line: 114, column: 51, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !1050, file: !780, discriminator: 1)
!1057 = !DILocation(line: 114, column: 59, scope: !1056)
!1058 = !DILocation(line: 114, column: 65, scope: !1056)
!1059 = !DILocation(line: 114, column: 30, scope: !1056)
!1060 = !DILocation(line: 115, column: 1, scope: !1013)
!1061 = distinct !DISubprogram(name: "window_item_set_active", scope: !780, file: !780, line: 117, type: !1062, isLocal: false, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !324, !345}
!1064 = !DILocalVariable(name: "window", arg: 1, scope: !1061, file: !780, line: 117, type: !324)
!1065 = !DILocation(line: 117, column: 41, scope: !1061)
!1066 = !DILocalVariable(name: "item", arg: 2, scope: !1061, file: !780, line: 117, type: !345)
!1067 = !DILocation(line: 117, column: 62, scope: !1061)
!1068 = !DILocalVariable(name: "old_window", scope: !1061, file: !780, line: 119, type: !324)
!1069 = !DILocation(line: 119, column: 15, scope: !1061)
!1070 = !DILocation(line: 121, column: 9, scope: !1061)
!1071 = distinct !{!1071, !1070}
!1072 = !DILocation(line: 121, column: 17, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1074, file: !780, discriminator: 1)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !780, line: 121, column: 17)
!1075 = distinct !DILexicalBlock(scope: !1061, file: !780, line: 121, column: 11)
!1076 = !DILocation(line: 121, column: 24, scope: !1073)
!1077 = !DILocation(line: 121, column: 12, scope: !1078)
!1078 = !DILexicalBlockFile(scope: !1079, file: !780, discriminator: 2)
!1079 = distinct !DILexicalBlock(scope: !1074, file: !780, line: 121, column: 10)
!1080 = !DILocation(line: 121, column: 21, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1082, file: !780, discriminator: 3)
!1082 = distinct !DILexicalBlock(scope: !1074, file: !780, line: 121, column: 19)
!1083 = !DILocation(line: 121, column: 108, scope: !1081)
!1084 = !DILocation(line: 121, column: 119, scope: !1085)
!1085 = !DILexicalBlockFile(scope: !1075, file: !780, discriminator: 4)
!1086 = !DILocation(line: 123, column: 13, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1061, file: !780, line: 123, column: 13)
!1088 = !DILocation(line: 123, column: 18, scope: !1087)
!1089 = !DILocation(line: 123, column: 13, scope: !1061)
!1090 = !DILocation(line: 124, column: 60, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1087, file: !780, line: 123, column: 26)
!1092 = !DILocation(line: 124, column: 68, scope: !1091)
!1093 = !DILocation(line: 124, column: 27, scope: !1091)
!1094 = !DILocation(line: 124, column: 24, scope: !1091)
!1095 = !DILocation(line: 125, column: 14, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !780, line: 125, column: 14)
!1097 = !DILocation(line: 125, column: 28, scope: !1096)
!1098 = !DILocation(line: 125, column: 25, scope: !1096)
!1099 = !DILocation(line: 125, column: 14, scope: !1091)
!1100 = !DILocation(line: 127, column: 43, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !780, line: 125, column: 36)
!1102 = !DILocation(line: 127, column: 17, scope: !1101)
!1103 = !DILocation(line: 128, column: 40, scope: !1101)
!1104 = !DILocation(line: 128, column: 48, scope: !1101)
!1105 = !DILocation(line: 128, column: 17, scope: !1101)
!1106 = !DILocation(line: 129, column: 53, scope: !1101)
!1107 = !DILocation(line: 129, column: 61, scope: !1101)
!1108 = !DILocation(line: 129, column: 67, scope: !1101)
!1109 = !DILocation(line: 129, column: 17, scope: !1101)
!1110 = !DILocation(line: 130, column: 10, scope: !1101)
!1111 = !DILocation(line: 131, column: 9, scope: !1091)
!1112 = !DILocation(line: 133, column: 6, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1061, file: !780, line: 133, column: 6)
!1114 = !DILocation(line: 133, column: 14, scope: !1113)
!1115 = !DILocation(line: 133, column: 24, scope: !1113)
!1116 = !DILocation(line: 133, column: 21, scope: !1113)
!1117 = !DILocation(line: 133, column: 6, scope: !1061)
!1118 = !DILocation(line: 134, column: 20, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1113, file: !780, line: 133, column: 30)
!1120 = !DILocation(line: 134, column: 3, scope: !1119)
!1121 = !DILocation(line: 134, column: 11, scope: !1119)
!1122 = !DILocation(line: 134, column: 18, scope: !1119)
!1123 = !DILocation(line: 135, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !780, line: 135, column: 7)
!1125 = !DILocation(line: 135, column: 12, scope: !1124)
!1126 = !DILocation(line: 135, column: 19, scope: !1124)
!1127 = !DILocation(line: 135, column: 22, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1124, file: !780, discriminator: 1)
!1129 = !DILocation(line: 135, column: 30, scope: !1128)
!1130 = !DILocation(line: 135, column: 47, scope: !1128)
!1131 = !DILocation(line: 135, column: 53, scope: !1128)
!1132 = !DILocation(line: 135, column: 44, scope: !1128)
!1133 = !DILocation(line: 135, column: 7, scope: !1128)
!1134 = !DILocation(line: 136, column: 25, scope: !1124)
!1135 = !DILocation(line: 136, column: 33, scope: !1124)
!1136 = !DILocation(line: 136, column: 39, scope: !1124)
!1137 = !DILocation(line: 136, column: 4, scope: !1124)
!1138 = !DILocation(line: 137, column: 41, scope: !1119)
!1139 = !DILocation(line: 137, column: 49, scope: !1119)
!1140 = !DILocation(line: 137, column: 3, scope: !1119)
!1141 = !DILocation(line: 138, column: 2, scope: !1119)
!1142 = !DILocation(line: 139, column: 1, scope: !1061)
!1143 = distinct !DISubprogram(name: "window_item_is_active", scope: !780, file: !780, line: 143, type: !1144, isLocal: false, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!330, !345}
!1146 = !DILocalVariable(name: "item", arg: 1, scope: !1143, file: !780, line: 143, type: !345)
!1147 = !DILocation(line: 143, column: 40, scope: !1143)
!1148 = !DILocalVariable(name: "window", scope: !1143, file: !780, line: 145, type: !324)
!1149 = !DILocation(line: 145, column: 14, scope: !1143)
!1150 = !DILocation(line: 147, column: 6, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1143, file: !780, line: 147, column: 6)
!1152 = !DILocation(line: 147, column: 11, scope: !1151)
!1153 = !DILocation(line: 147, column: 6, scope: !1143)
!1154 = !DILocation(line: 148, column: 3, scope: !1151)
!1155 = !DILocation(line: 150, column: 45, scope: !1143)
!1156 = !DILocation(line: 150, column: 53, scope: !1143)
!1157 = !DILocation(line: 150, column: 12, scope: !1143)
!1158 = !DILocation(line: 150, column: 9, scope: !1143)
!1159 = !DILocation(line: 151, column: 6, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1143, file: !780, line: 151, column: 6)
!1161 = !DILocation(line: 151, column: 13, scope: !1160)
!1162 = !DILocation(line: 151, column: 6, scope: !1143)
!1163 = !DILocation(line: 152, column: 3, scope: !1160)
!1164 = !DILocation(line: 154, column: 9, scope: !1143)
!1165 = !DILocation(line: 154, column: 17, scope: !1143)
!1166 = !DILocation(line: 154, column: 27, scope: !1143)
!1167 = !DILocation(line: 154, column: 24, scope: !1143)
!1168 = !DILocation(line: 154, column: 2, scope: !1143)
!1169 = !DILocation(line: 155, column: 1, scope: !1143)
!1170 = distinct !DISubprogram(name: "window_item_prev", scope: !780, file: !780, line: 157, type: !1171, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !324}
!1173 = !DILocalVariable(name: "window", arg: 1, scope: !1170, file: !780, line: 157, type: !324)
!1174 = !DILocation(line: 157, column: 35, scope: !1170)
!1175 = !DILocalVariable(name: "last", scope: !1170, file: !780, line: 159, type: !345)
!1176 = !DILocation(line: 159, column: 15, scope: !1170)
!1177 = !DILocalVariable(name: "tmp", scope: !1170, file: !780, line: 160, type: !336)
!1178 = !DILocation(line: 160, column: 10, scope: !1170)
!1179 = !DILocation(line: 162, column: 2, scope: !1170)
!1180 = distinct !{!1180, !1179}
!1181 = !DILocation(line: 162, column: 10, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1183, file: !780, discriminator: 1)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !780, line: 162, column: 10)
!1184 = distinct !DILexicalBlock(scope: !1170, file: !780, line: 162, column: 4)
!1185 = !DILocation(line: 162, column: 17, scope: !1182)
!1186 = !DILocation(line: 162, column: 5, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1188, file: !780, discriminator: 2)
!1188 = distinct !DILexicalBlock(scope: !1183, file: !780, line: 162, column: 3)
!1189 = !DILocation(line: 162, column: 14, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1191, file: !780, discriminator: 3)
!1191 = distinct !DILexicalBlock(scope: !1183, file: !780, line: 162, column: 12)
!1192 = !DILocation(line: 162, column: 101, scope: !1190)
!1193 = !DILocation(line: 162, column: 112, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1184, file: !780, discriminator: 4)
!1195 = !DILocation(line: 164, column: 7, scope: !1170)
!1196 = !DILocation(line: 165, column: 13, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1170, file: !780, line: 165, column: 2)
!1198 = !DILocation(line: 165, column: 21, scope: !1197)
!1199 = !DILocation(line: 165, column: 11, scope: !1197)
!1200 = !DILocation(line: 165, column: 7, scope: !1197)
!1201 = !DILocation(line: 165, column: 28, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1203, file: !780, discriminator: 1)
!1203 = distinct !DILexicalBlock(scope: !1197, file: !780, line: 165, column: 2)
!1204 = !DILocation(line: 165, column: 32, scope: !1202)
!1205 = !DILocation(line: 165, column: 2, scope: !1202)
!1206 = !DILocalVariable(name: "rec", scope: !1207, file: !780, line: 166, type: !345)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !780, line: 165, column: 57)
!1208 = !DILocation(line: 166, column: 16, scope: !1207)
!1209 = !DILocation(line: 166, column: 22, scope: !1207)
!1210 = !DILocation(line: 166, column: 27, scope: !1207)
!1211 = !DILocation(line: 168, column: 7, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1207, file: !780, line: 168, column: 7)
!1213 = !DILocation(line: 168, column: 14, scope: !1212)
!1214 = !DILocation(line: 168, column: 22, scope: !1212)
!1215 = !DILocation(line: 168, column: 11, scope: !1212)
!1216 = !DILocation(line: 168, column: 7, scope: !1207)
!1217 = !DILocation(line: 169, column: 11, scope: !1212)
!1218 = !DILocation(line: 169, column: 9, scope: !1212)
!1219 = !DILocation(line: 169, column: 4, scope: !1212)
!1220 = !DILocation(line: 173, column: 8, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1222, file: !780, line: 173, column: 8)
!1222 = distinct !DILexicalBlock(scope: !1212, file: !780, line: 170, column: 8)
!1223 = !DILocation(line: 173, column: 13, scope: !1221)
!1224 = !DILocation(line: 173, column: 8, scope: !1222)
!1225 = !DILocation(line: 173, column: 21, scope: !1226)
!1226 = !DILexicalBlockFile(scope: !1221, file: !780, discriminator: 1)
!1227 = !DILocation(line: 175, column: 2, scope: !1207)
!1228 = !DILocation(line: 165, column: 46, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1203, file: !780, discriminator: 2)
!1230 = !DILocation(line: 165, column: 51, scope: !1229)
!1231 = !DILocation(line: 165, column: 44, scope: !1229)
!1232 = !DILocation(line: 165, column: 2, scope: !1229)
!1233 = distinct !{!1233, !1234}
!1234 = !DILocation(line: 165, column: 2, scope: !1170)
!1235 = !DILocation(line: 177, column: 6, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1170, file: !780, line: 177, column: 6)
!1237 = !DILocation(line: 177, column: 11, scope: !1236)
!1238 = !DILocation(line: 177, column: 6, scope: !1170)
!1239 = !DILocation(line: 178, column: 40, scope: !1236)
!1240 = !DILocation(line: 178, column: 48, scope: !1236)
!1241 = !DILocation(line: 178, column: 17, scope: !1236)
!1242 = !DILocation(line: 179, column: 1, scope: !1170)
!1243 = distinct !DISubprogram(name: "window_item_next", scope: !780, file: !780, line: 181, type: !1171, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1244 = !DILocalVariable(name: "window", arg: 1, scope: !1243, file: !780, line: 181, type: !324)
!1245 = !DILocation(line: 181, column: 35, scope: !1243)
!1246 = !DILocalVariable(name: "next", scope: !1243, file: !780, line: 183, type: !345)
!1247 = !DILocation(line: 183, column: 15, scope: !1243)
!1248 = !DILocalVariable(name: "tmp", scope: !1243, file: !780, line: 184, type: !336)
!1249 = !DILocation(line: 184, column: 10, scope: !1243)
!1250 = !DILocalVariable(name: "gone", scope: !1243, file: !780, line: 185, type: !330)
!1251 = !DILocation(line: 185, column: 6, scope: !1243)
!1252 = !DILocation(line: 187, column: 2, scope: !1243)
!1253 = distinct !{!1253, !1252}
!1254 = !DILocation(line: 187, column: 10, scope: !1255)
!1255 = !DILexicalBlockFile(scope: !1256, file: !780, discriminator: 1)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !780, line: 187, column: 10)
!1257 = distinct !DILexicalBlock(scope: !1243, file: !780, line: 187, column: 4)
!1258 = !DILocation(line: 187, column: 17, scope: !1255)
!1259 = !DILocation(line: 187, column: 5, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1261, file: !780, discriminator: 2)
!1261 = distinct !DILexicalBlock(scope: !1256, file: !780, line: 187, column: 3)
!1262 = !DILocation(line: 187, column: 14, scope: !1263)
!1263 = !DILexicalBlockFile(scope: !1264, file: !780, discriminator: 3)
!1264 = distinct !DILexicalBlock(scope: !1256, file: !780, line: 187, column: 12)
!1265 = !DILocation(line: 187, column: 101, scope: !1263)
!1266 = !DILocation(line: 187, column: 112, scope: !1267)
!1267 = !DILexicalBlockFile(scope: !1257, file: !780, discriminator: 4)
!1268 = !DILocation(line: 189, column: 7, scope: !1243)
!1269 = !DILocation(line: 189, column: 19, scope: !1243)
!1270 = !DILocation(line: 190, column: 13, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1243, file: !780, line: 190, column: 2)
!1272 = !DILocation(line: 190, column: 21, scope: !1271)
!1273 = !DILocation(line: 190, column: 11, scope: !1271)
!1274 = !DILocation(line: 190, column: 7, scope: !1271)
!1275 = !DILocation(line: 190, column: 28, scope: !1276)
!1276 = !DILexicalBlockFile(scope: !1277, file: !780, discriminator: 1)
!1277 = distinct !DILexicalBlock(scope: !1271, file: !780, line: 190, column: 2)
!1278 = !DILocation(line: 190, column: 32, scope: !1276)
!1279 = !DILocation(line: 190, column: 2, scope: !1276)
!1280 = !DILocalVariable(name: "rec", scope: !1281, file: !780, line: 191, type: !345)
!1281 = distinct !DILexicalBlock(scope: !1277, file: !780, line: 190, column: 57)
!1282 = !DILocation(line: 191, column: 16, scope: !1281)
!1283 = !DILocation(line: 191, column: 22, scope: !1281)
!1284 = !DILocation(line: 191, column: 27, scope: !1281)
!1285 = !DILocation(line: 193, column: 7, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1281, file: !780, line: 193, column: 7)
!1287 = !DILocation(line: 193, column: 14, scope: !1286)
!1288 = !DILocation(line: 193, column: 22, scope: !1286)
!1289 = !DILocation(line: 193, column: 11, scope: !1286)
!1290 = !DILocation(line: 193, column: 7, scope: !1281)
!1291 = !DILocation(line: 194, column: 9, scope: !1286)
!1292 = !DILocation(line: 194, column: 4, scope: !1286)
!1293 = !DILocation(line: 196, column: 8, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1295, file: !780, line: 196, column: 8)
!1295 = distinct !DILexicalBlock(scope: !1286, file: !780, line: 195, column: 8)
!1296 = !DILocation(line: 196, column: 8, scope: !1295)
!1297 = !DILocation(line: 198, column: 12, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1294, file: !780, line: 196, column: 14)
!1299 = !DILocation(line: 198, column: 10, scope: !1298)
!1300 = !DILocation(line: 199, column: 5, scope: !1298)
!1301 = !DILocation(line: 202, column: 8, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1295, file: !780, line: 202, column: 8)
!1303 = !DILocation(line: 202, column: 13, scope: !1302)
!1304 = !DILocation(line: 202, column: 8, scope: !1295)
!1305 = !DILocation(line: 203, column: 12, scope: !1302)
!1306 = !DILocation(line: 203, column: 10, scope: !1302)
!1307 = !DILocation(line: 203, column: 5, scope: !1302)
!1308 = !DILocation(line: 205, column: 2, scope: !1281)
!1309 = !DILocation(line: 190, column: 46, scope: !1310)
!1310 = !DILexicalBlockFile(scope: !1277, file: !780, discriminator: 2)
!1311 = !DILocation(line: 190, column: 51, scope: !1310)
!1312 = !DILocation(line: 190, column: 44, scope: !1310)
!1313 = !DILocation(line: 190, column: 2, scope: !1310)
!1314 = distinct !{!1314, !1315}
!1315 = !DILocation(line: 190, column: 2, scope: !1243)
!1316 = !DILocation(line: 207, column: 6, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1243, file: !780, line: 207, column: 6)
!1318 = !DILocation(line: 207, column: 11, scope: !1317)
!1319 = !DILocation(line: 207, column: 6, scope: !1243)
!1320 = !DILocation(line: 208, column: 40, scope: !1317)
!1321 = !DILocation(line: 208, column: 48, scope: !1317)
!1322 = !DILocation(line: 208, column: 17, scope: !1317)
!1323 = !DILocation(line: 209, column: 1, scope: !1243)
!1324 = distinct !DISubprogram(name: "window_item_find_window", scope: !780, file: !780, line: 211, type: !1325, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!345, !324, !317, !322}
!1327 = !DILocalVariable(name: "window", arg: 1, scope: !1324, file: !780, line: 211, type: !324)
!1328 = !DILocation(line: 211, column: 50, scope: !1324)
!1329 = !DILocalVariable(name: "server", arg: 2, scope: !1324, file: !780, line: 212, type: !317)
!1330 = !DILocation(line: 212, column: 44, scope: !1324)
!1331 = !DILocalVariable(name: "name", arg: 3, scope: !1324, file: !780, line: 212, type: !322)
!1332 = !DILocation(line: 212, column: 64, scope: !1324)
!1333 = !DILocalVariable(name: "tmp", scope: !1324, file: !780, line: 214, type: !336)
!1334 = !DILocation(line: 214, column: 10, scope: !1324)
!1335 = !DILocation(line: 216, column: 13, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1324, file: !780, line: 216, column: 2)
!1337 = !DILocation(line: 216, column: 21, scope: !1336)
!1338 = !DILocation(line: 216, column: 11, scope: !1336)
!1339 = !DILocation(line: 216, column: 7, scope: !1336)
!1340 = !DILocation(line: 216, column: 28, scope: !1341)
!1341 = !DILexicalBlockFile(scope: !1342, file: !780, discriminator: 1)
!1342 = distinct !DILexicalBlock(scope: !1336, file: !780, line: 216, column: 2)
!1343 = !DILocation(line: 216, column: 32, scope: !1341)
!1344 = !DILocation(line: 216, column: 2, scope: !1341)
!1345 = !DILocalVariable(name: "rec", scope: !1346, file: !780, line: 217, type: !345)
!1346 = distinct !DILexicalBlock(scope: !1342, file: !780, line: 216, column: 57)
!1347 = !DILocation(line: 217, column: 16, scope: !1346)
!1348 = !DILocation(line: 217, column: 22, scope: !1346)
!1349 = !DILocation(line: 217, column: 27, scope: !1346)
!1350 = !DILocation(line: 219, column: 8, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1346, file: !780, line: 219, column: 7)
!1352 = !DILocation(line: 219, column: 15, scope: !1351)
!1353 = !DILocation(line: 219, column: 22, scope: !1351)
!1354 = !DILocation(line: 219, column: 25, scope: !1355)
!1355 = !DILexicalBlockFile(scope: !1351, file: !780, discriminator: 1)
!1356 = !DILocation(line: 219, column: 30, scope: !1355)
!1357 = !DILocation(line: 219, column: 40, scope: !1355)
!1358 = !DILocation(line: 219, column: 37, scope: !1355)
!1359 = !DILocation(line: 219, column: 48, scope: !1355)
!1360 = !DILocation(line: 220, column: 27, scope: !1351)
!1361 = !DILocation(line: 220, column: 33, scope: !1351)
!1362 = !DILocation(line: 220, column: 38, scope: !1351)
!1363 = !DILocation(line: 220, column: 8, scope: !1351)
!1364 = !DILocation(line: 220, column: 52, scope: !1351)
!1365 = !DILocation(line: 221, column: 8, scope: !1351)
!1366 = !DILocation(line: 221, column: 12, scope: !1355)
!1367 = !DILocation(line: 221, column: 17, scope: !1355)
!1368 = !DILocation(line: 221, column: 22, scope: !1355)
!1369 = !DILocation(line: 221, column: 44, scope: !1370)
!1370 = !DILexicalBlockFile(scope: !1351, file: !780, discriminator: 2)
!1371 = !DILocation(line: 221, column: 50, scope: !1370)
!1372 = !DILocation(line: 221, column: 55, scope: !1370)
!1373 = !DILocation(line: 221, column: 25, scope: !1370)
!1374 = !DILocation(line: 221, column: 61, scope: !1370)
!1375 = !DILocation(line: 219, column: 7, scope: !1376)
!1376 = !DILexicalBlockFile(scope: !1346, file: !780, discriminator: 2)
!1377 = !DILocation(line: 222, column: 11, scope: !1351)
!1378 = !DILocation(line: 222, column: 4, scope: !1351)
!1379 = !DILocation(line: 223, column: 2, scope: !1346)
!1380 = !DILocation(line: 216, column: 46, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1342, file: !780, discriminator: 2)
!1382 = !DILocation(line: 216, column: 51, scope: !1381)
!1383 = !DILocation(line: 216, column: 44, scope: !1381)
!1384 = !DILocation(line: 216, column: 2, scope: !1381)
!1385 = distinct !{!1385, !1386}
!1386 = !DILocation(line: 216, column: 2, scope: !1324)
!1387 = !DILocation(line: 224, column: 2, scope: !1324)
!1388 = !DILocation(line: 225, column: 1, scope: !1324)
!1389 = distinct !DISubprogram(name: "window_item_find", scope: !780, file: !780, line: 228, type: !1390, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !783)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!345, !317, !322}
!1392 = !DILocalVariable(name: "server", arg: 1, scope: !1389, file: !780, line: 228, type: !317)
!1393 = !DILocation(line: 228, column: 37, scope: !1389)
!1394 = !DILocalVariable(name: "name", arg: 2, scope: !1389, file: !780, line: 228, type: !322)
!1395 = !DILocation(line: 228, column: 57, scope: !1389)
!1396 = !DILocalVariable(name: "item", scope: !1389, file: !780, line: 230, type: !345)
!1397 = !DILocation(line: 230, column: 15, scope: !1389)
!1398 = !DILocalVariable(name: "tmp", scope: !1389, file: !780, line: 231, type: !336)
!1399 = !DILocation(line: 231, column: 10, scope: !1389)
!1400 = !DILocation(line: 233, column: 2, scope: !1389)
!1401 = distinct !{!1401, !1400}
!1402 = !DILocation(line: 233, column: 10, scope: !1403)
!1403 = !DILexicalBlockFile(scope: !1404, file: !780, discriminator: 1)
!1404 = distinct !DILexicalBlock(scope: !1405, file: !780, line: 233, column: 10)
!1405 = distinct !DILexicalBlock(scope: !1389, file: !780, line: 233, column: 4)
!1406 = !DILocation(line: 233, column: 15, scope: !1403)
!1407 = !DILocation(line: 233, column: 5, scope: !1408)
!1408 = !DILexicalBlockFile(scope: !1409, file: !780, discriminator: 2)
!1409 = distinct !DILexicalBlock(scope: !1404, file: !780, line: 233, column: 3)
!1410 = !DILocation(line: 233, column: 14, scope: !1411)
!1411 = !DILexicalBlockFile(scope: !1412, file: !780, discriminator: 3)
!1412 = distinct !DILexicalBlock(scope: !1404, file: !780, line: 233, column: 12)
!1413 = !DILocation(line: 233, column: 99, scope: !1411)
!1414 = !DILocation(line: 233, column: 7, scope: !1415)
!1415 = !DILexicalBlockFile(scope: !1405, file: !780, discriminator: 4)
!1416 = !DILocation(line: 235, column: 13, scope: !1417)
!1417 = distinct !DILexicalBlock(scope: !1389, file: !780, line: 235, column: 2)
!1418 = !DILocation(line: 235, column: 11, scope: !1417)
!1419 = !DILocation(line: 235, column: 7, scope: !1417)
!1420 = !DILocation(line: 235, column: 22, scope: !1421)
!1421 = !DILexicalBlockFile(scope: !1422, file: !780, discriminator: 1)
