; ModuleID = './line236-fe-modules.o.i'
source_filename = "./line236-fe-modules.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._MODULE_REC = type { i8*, %struct._GSList* }
%struct.MODULE_FILE_REC = type { %struct._MODULE_REC*, i8*, i8*, void ()*, %struct._GModule*, i8 }
%struct._GModule = type opaque
%struct._GString = type { i8*, i64, i64 }
%struct._CHAT_PROTOCOL_REC = type { i32, i8, i8*, i8*, i8*, %struct._CHATNET_REC* ()*, %struct._SERVER_SETUP_REC* ()*, %struct._CHANNEL_SETUP_REC* ()*, %struct._SERVER_CONNECT_REC* ()*, void (%struct._SERVER_CONNECT_REC*)*, %struct._SERVER_REC* (%struct._SERVER_CONNECT_REC*)*, void (%struct._SERVER_REC*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*, i8*, i32)*, %struct._QUERY_REC* (i8*, i8*, i32)* }
%struct._CHATNET_REC = type opaque
%struct._SERVER_SETUP_REC = type opaque
%struct._CHANNEL_SETUP_REC = type opaque
%struct._SERVER_CONNECT_REC = type opaque
%struct._SERVER_REC = type opaque
%struct._CHANNEL_REC = type opaque
%struct._QUERY_REC = type opaque

@.str = private unnamed_addr constant [15 x i8] c"fe-common/core\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"module error\00", align 1
@.str.2 = private unnamed_addr constant [14 x i8] c"module loaded\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"module unloaded\00", align 1

!249 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!250 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!251 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!252 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!253 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!254 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!255 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!256 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!257 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!258 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!259 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!260 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!261 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!262 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!263 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!264 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!265 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!266 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!267 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!268 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!269 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!270 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!271 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!272 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!273 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!274 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!275 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 25, size: 32, align: 32, elements: !278)
!277 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!279 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!280 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!281 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!282 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!283 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!284 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!285 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!286 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!287 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!288 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!289 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!290 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!291 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!292 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!293 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!294 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!295 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!296 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!297 = !{!298, !305, !306, !309, !311, !314, !316, !318, !319}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !299, line: 9, baseType: !300)
!299 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !303, !303, !303, !303, !303, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !307, line: 49, baseType: !308)
!307 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!308 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !307, line: 48, baseType: !310)
!310 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !307, line: 46, baseType: !313)
!313 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !307, line: 77, baseType: !305)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_FILE_REC", file: !321, line: 46, baseType: !322)
!321 = !DIFile(filename: "../../../src/core/modules.h", directory: "/home/lichi/Desktop/irssi/task1")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 36, size: 384, align: 64, elements: !323)
!323 = !{!324, !338, !339, !340, !344, !349}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !322, file: !321, line: 37, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_REC", file: !321, line: 34, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MODULE_REC", file: !321, line: 48, size: 128, align: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !321, line: 49, baseType: !317, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !327, file: !321, line: 50, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !333, line: 37, baseType: !334)
!333 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !333, line: 39, size: 128, align: 64, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !333, line: 41, baseType: !318, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !333, line: 42, baseType: !331, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !321, line: 38, baseType: !317, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "defined_module_name", scope: !322, file: !321, line: 39, baseType: !317, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "module_deinit", scope: !322, file: !321, line: 40, baseType: !341, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gmodule", scope: !322, file: !321, line: 43, baseType: !345, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "GModule", file: !347, line: 49, baseType: !348)
!347 = !DIFile(filename: "/usr/include/glib-2.0/gmodule.h", directory: "/home/lichi/Desktop/irssi/task1")
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GModule", file: !347, line: 49, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !322, file: !321, line: 45, baseType: !350, size: 1, align: 32, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!350 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!351 = !{i32 2, !"Dwarf Version", i32 4}
!352 = !{i32 2, !"Debug Info Version", i32 3}
!353 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!354 = distinct !DISubprogram(name: "fe_modules_init", scope: !355, file: !355, line: 239, type: !342, isLocal: false, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!355 = !DIFile(filename: "fe-modules.c", directory: "/home/lichi/Desktop/irssi/task1")
!356 = !{}
!357 = !DILocation(line: 241, column: 2, scope: !354)
!358 = !DILocation(line: 242, column: 2, scope: !354)
!359 = !DILocation(line: 243, column: 2, scope: !354)
!360 = !DILocation(line: 245, column: 2, scope: !354)
!361 = !DILocation(line: 246, column: 2, scope: !354)
!362 = !DILocation(line: 247, column: 1, scope: !354)
!363 = distinct !DISubprogram(name: "sig_module_error", scope: !355, file: !355, line: 34, type: !364, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !305, !314, !314, !314}
!366 = !DILocalVariable(name: "number", arg: 1, scope: !363, file: !355, line: 34, type: !305)
!367 = !DIExpression()
!368 = !DILocation(line: 34, column: 36, scope: !363)
!369 = !DILocalVariable(name: "data", arg: 2, scope: !363, file: !355, line: 34, type: !314)
!370 = !DILocation(line: 34, column: 56, scope: !363)
!371 = !DILocalVariable(name: "rootmodule", arg: 3, scope: !363, file: !355, line: 35, type: !314)
!372 = !DILocation(line: 35, column: 21, scope: !363)
!373 = !DILocalVariable(name: "submodule", arg: 4, scope: !363, file: !355, line: 35, type: !314)
!374 = !DILocation(line: 35, column: 45, scope: !363)
!375 = !DILocation(line: 37, column: 27, scope: !363)
!376 = !DILocation(line: 37, column: 18, scope: !363)
!377 = !DILocation(line: 37, column: 11, scope: !363)
!378 = !DILocation(line: 37, column: 2, scope: !363)
!379 = !DILocation(line: 39, column: 53, scope: !380)
!380 = distinct !DILexicalBlock(scope: !363, file: !355, line: 37, column: 37)
!381 = !DILocation(line: 39, column: 65, scope: !380)
!382 = !DILocation(line: 39, column: 3, scope: !380)
!383 = !DILocation(line: 41, column: 3, scope: !380)
!384 = !DILocation(line: 43, column: 49, scope: !380)
!385 = !DILocation(line: 43, column: 61, scope: !380)
!386 = !DILocation(line: 43, column: 72, scope: !380)
!387 = !DILocation(line: 43, column: 3, scope: !380)
!388 = !DILocation(line: 45, column: 3, scope: !380)
!389 = !DILocation(line: 47, column: 55, scope: !380)
!390 = !DILocation(line: 47, column: 67, scope: !380)
!391 = !DILocation(line: 47, column: 78, scope: !380)
!392 = !DILocation(line: 47, column: 3, scope: !380)
!393 = !DILocation(line: 49, column: 3, scope: !380)
!394 = !DILocation(line: 51, column: 46, scope: !380)
!395 = !DILocation(line: 51, column: 58, scope: !380)
!396 = !DILocation(line: 51, column: 3, scope: !380)
!397 = !DILocation(line: 53, column: 3, scope: !380)
!398 = !DILocation(line: 55, column: 1, scope: !363)
!399 = distinct !DISubprogram(name: "sig_module_loaded", scope: !355, file: !355, line: 57, type: !400, isLocal: true, isDefinition: true, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !325, !319}
!402 = !DILocalVariable(name: "module", arg: 1, scope: !399, file: !355, line: 57, type: !325)
!403 = !DILocation(line: 57, column: 43, scope: !399)
!404 = !DILocalVariable(name: "file", arg: 2, scope: !399, file: !355, line: 57, type: !319)
!405 = !DILocation(line: 57, column: 68, scope: !399)
!406 = !DILocation(line: 59, column: 45, scope: !399)
!407 = !DILocation(line: 59, column: 53, scope: !399)
!408 = !DILocation(line: 59, column: 59, scope: !399)
!409 = !DILocation(line: 59, column: 65, scope: !399)
!410 = !DILocation(line: 59, column: 2, scope: !399)
!411 = !DILocation(line: 61, column: 1, scope: !399)
!412 = distinct !DISubprogram(name: "sig_module_unloaded", scope: !355, file: !355, line: 63, type: !400, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!413 = !DILocalVariable(name: "module", arg: 1, scope: !412, file: !355, line: 63, type: !325)
!414 = !DILocation(line: 63, column: 45, scope: !412)
!415 = !DILocalVariable(name: "file", arg: 2, scope: !412, file: !355, line: 63, type: !319)
!416 = !DILocation(line: 63, column: 70, scope: !412)
!417 = !DILocation(line: 65, column: 6, scope: !418)
!418 = distinct !DILexicalBlock(scope: !412, file: !355, line: 65, column: 6)
!419 = !DILocation(line: 65, column: 11, scope: !418)
!420 = !DILocation(line: 65, column: 18, scope: !418)
!421 = !DILocation(line: 65, column: 21, scope: !422)
!422 = !DILexicalBlockFile(scope: !418, file: !355, discriminator: 1)
!423 = !DILocation(line: 65, column: 27, scope: !422)
!424 = !DILocation(line: 65, column: 35, scope: !422)
!425 = !DILocation(line: 65, column: 6, scope: !422)
!426 = !DILocation(line: 66, column: 48, scope: !427)
!427 = distinct !DILexicalBlock(scope: !418, file: !355, line: 65, column: 44)
!428 = !DILocation(line: 66, column: 56, scope: !427)
!429 = !DILocation(line: 66, column: 62, scope: !427)
!430 = !DILocation(line: 66, column: 68, scope: !427)
!431 = !DILocation(line: 66, column: 3, scope: !427)
!432 = !DILocation(line: 68, column: 2, scope: !427)
!433 = !DILocation(line: 69, column: 1, scope: !412)
!434 = distinct !DISubprogram(name: "cmd_load", scope: !355, file: !355, line: 168, type: !435, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !314}
!437 = !DILocalVariable(name: "data", arg: 1, scope: !434, file: !355, line: 168, type: !314)
!438 = !DILocation(line: 168, column: 34, scope: !434)
!439 = !DILocalVariable(name: "rootmodule", scope: !434, file: !355, line: 170, type: !317)
!440 = !DILocation(line: 170, column: 15, scope: !434)
!441 = !DILocalVariable(name: "submodule", scope: !434, file: !355, line: 170, type: !317)
!442 = !DILocation(line: 170, column: 28, scope: !434)
!443 = !DILocalVariable(name: "module_prefixes", scope: !434, file: !355, line: 171, type: !316)
!444 = !DILocation(line: 171, column: 9, scope: !434)
!445 = !DILocalVariable(name: "free_arg", scope: !434, file: !355, line: 172, type: !305)
!446 = !DILocation(line: 172, column: 8, scope: !434)
!447 = !DILocation(line: 174, column: 2, scope: !434)
!448 = distinct !{!448, !447}
!449 = !DILocation(line: 174, column: 10, scope: !450)
!450 = !DILexicalBlockFile(scope: !451, file: !355, discriminator: 1)
!451 = distinct !DILexicalBlock(scope: !452, file: !355, line: 174, column: 10)
!452 = distinct !DILexicalBlock(scope: !434, file: !355, line: 174, column: 4)
!453 = !DILocation(line: 174, column: 15, scope: !450)
!454 = !DILocation(line: 174, column: 5, scope: !455)
!455 = !DILexicalBlockFile(scope: !456, file: !355, discriminator: 2)
!456 = distinct !DILexicalBlock(scope: !451, file: !355, line: 174, column: 3)
!457 = !DILocation(line: 174, column: 14, scope: !458)
!458 = !DILexicalBlockFile(scope: !459, file: !355, discriminator: 3)
!459 = distinct !DILexicalBlock(scope: !451, file: !355, line: 174, column: 12)
!460 = !DILocation(line: 174, column: 99, scope: !458)
!461 = !DILocation(line: 174, column: 110, scope: !462)
!462 = !DILexicalBlockFile(scope: !452, file: !355, discriminator: 4)
!463 = !DILocation(line: 176, column: 22, scope: !464)
!464 = distinct !DILexicalBlock(scope: !434, file: !355, line: 176, column: 6)
!465 = !DILocation(line: 176, column: 7, scope: !464)
!466 = !DILocation(line: 176, column: 6, scope: !434)
!467 = !DILocation(line: 177, column: 3, scope: !464)
!468 = !DILocation(line: 179, column: 7, scope: !469)
!469 = distinct !DILexicalBlock(scope: !434, file: !355, line: 179, column: 6)
!470 = !DILocation(line: 179, column: 6, scope: !469)
!471 = !DILocation(line: 179, column: 18, scope: !469)
!472 = !DILocation(line: 179, column: 6, scope: !434)
!473 = !DILocation(line: 180, column: 3, scope: !469)
!474 = !DILocation(line: 182, column: 21, scope: !475)
!475 = distinct !DILexicalBlock(scope: !469, file: !355, line: 181, column: 7)
!476 = !DILocation(line: 182, column: 19, scope: !475)
!477 = !DILocation(line: 183, column: 8, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !355, line: 183, column: 7)
!479 = !DILocation(line: 183, column: 7, scope: !478)
!480 = !DILocation(line: 183, column: 18, scope: !478)
!481 = !DILocation(line: 183, column: 7, scope: !475)
!482 = !DILocation(line: 184, column: 16, scope: !478)
!483 = !DILocation(line: 184, column: 28, scope: !478)
!484 = !DILocation(line: 184, column: 4, scope: !478)
!485 = !DILocation(line: 186, column: 20, scope: !486)
!486 = distinct !DILexicalBlock(scope: !478, file: !355, line: 185, column: 8)
!487 = !DILocation(line: 186, column: 32, scope: !486)
!488 = !DILocation(line: 187, column: 6, scope: !486)
!489 = !DILocation(line: 186, column: 4, scope: !486)
!490 = !DILocation(line: 189, column: 38, scope: !475)
!491 = !DILocation(line: 189, column: 17, scope: !475)
!492 = !DILocation(line: 192, column: 18, scope: !434)
!493 = !DILocation(line: 192, column: 2, scope: !434)
!494 = !DILocation(line: 193, column: 1, scope: !434)
!495 = !DILocation(line: 193, column: 1, scope: !496)
!496 = !DILexicalBlockFile(scope: !434, file: !355, discriminator: 1)
!497 = distinct !DISubprogram(name: "cmd_unload", scope: !355, file: !355, line: 196, type: !435, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!498 = !DILocalVariable(name: "data", arg: 1, scope: !497, file: !355, line: 196, type: !314)
!499 = !DILocation(line: 196, column: 36, scope: !497)
!500 = !DILocalVariable(name: "module", scope: !497, file: !355, line: 198, type: !325)
!501 = !DILocation(line: 198, column: 14, scope: !497)
!502 = !DILocalVariable(name: "file", scope: !497, file: !355, line: 199, type: !319)
!503 = !DILocation(line: 199, column: 26, scope: !497)
!504 = !DILocalVariable(name: "rootmodule", scope: !497, file: !355, line: 200, type: !317)
!505 = !DILocation(line: 200, column: 15, scope: !497)
!506 = !DILocalVariable(name: "submodule", scope: !497, file: !355, line: 200, type: !317)
!507 = !DILocation(line: 200, column: 28, scope: !497)
!508 = !DILocalVariable(name: "free_arg", scope: !497, file: !355, line: 201, type: !305)
!509 = !DILocation(line: 201, column: 8, scope: !497)
!510 = !DILocalVariable(name: "tmp", scope: !497, file: !355, line: 202, type: !331)
!511 = !DILocation(line: 202, column: 10, scope: !497)
!512 = !DILocalVariable(name: "all_dynamic", scope: !497, file: !355, line: 203, type: !308)
!513 = !DILocation(line: 203, column: 6, scope: !497)
!514 = !DILocation(line: 205, column: 2, scope: !497)
!515 = distinct !{!515, !514}
!516 = !DILocation(line: 205, column: 10, scope: !517)
!517 = !DILexicalBlockFile(scope: !518, file: !355, discriminator: 1)
!518 = distinct !DILexicalBlock(scope: !519, file: !355, line: 205, column: 10)
!519 = distinct !DILexicalBlock(scope: !497, file: !355, line: 205, column: 4)
!520 = !DILocation(line: 205, column: 15, scope: !517)
!521 = !DILocation(line: 205, column: 5, scope: !522)
!522 = !DILexicalBlockFile(scope: !523, file: !355, discriminator: 2)
!523 = distinct !DILexicalBlock(scope: !518, file: !355, line: 205, column: 3)
!524 = !DILocation(line: 205, column: 14, scope: !525)
!525 = !DILexicalBlockFile(scope: !526, file: !355, discriminator: 3)
!526 = distinct !DILexicalBlock(scope: !518, file: !355, line: 205, column: 12)
!527 = !DILocation(line: 205, column: 99, scope: !525)
!528 = !DILocation(line: 205, column: 110, scope: !529)
!529 = !DILexicalBlockFile(scope: !519, file: !355, discriminator: 4)
!530 = !DILocation(line: 207, column: 22, scope: !531)
!531 = distinct !DILexicalBlock(scope: !497, file: !355, line: 207, column: 6)
!532 = !DILocation(line: 207, column: 7, scope: !531)
!533 = !DILocation(line: 207, column: 6, scope: !497)
!534 = !DILocation(line: 208, column: 3, scope: !531)
!535 = !DILocation(line: 209, column: 7, scope: !536)
!536 = distinct !DILexicalBlock(scope: !497, file: !355, line: 209, column: 6)
!537 = !DILocation(line: 209, column: 6, scope: !536)
!538 = !DILocation(line: 209, column: 18, scope: !536)
!539 = !DILocation(line: 209, column: 6, scope: !497)
!540 = !DILocation(line: 209, column: 27, scope: !541)
!541 = !DILexicalBlockFile(scope: !536, file: !355, discriminator: 1)
!542 = distinct !{!542, !543}
!543 = !DILocation(line: 209, column: 27, scope: !536)
!544 = !DILocation(line: 209, column: 48, scope: !545)
!545 = !DILexicalBlockFile(scope: !546, file: !355, discriminator: 2)
!546 = distinct !DILexicalBlock(scope: !536, file: !355, line: 209, column: 30)
!547 = !DILocation(line: 209, column: 32, scope: !545)
!548 = !DILocation(line: 209, column: 59, scope: !545)
!549 = distinct !{!549, !550}
!550 = !DILocation(line: 209, column: 59, scope: !546)
!551 = !DILocation(line: 209, column: 64, scope: !552)
!552 = !DILexicalBlockFile(scope: !553, file: !355, discriminator: 3)
!553 = distinct !DILexicalBlock(scope: !546, file: !355, line: 209, column: 62)
!554 = !DILocation(line: 209, column: 146, scope: !555)
!555 = !DILexicalBlockFile(scope: !552, file: !355, discriminator: 6)
!556 = !DILocation(line: 209, column: 161, scope: !552)
!557 = !DILocation(line: 209, column: 182, scope: !558)
!558 = !DILexicalBlockFile(scope: !546, file: !355, discriminator: 4)
!559 = !DILocation(line: 209, column: 182, scope: !560)
!560 = !DILexicalBlockFile(scope: !546, file: !355, discriminator: 5)
!561 = !DILocation(line: 211, column: 23, scope: !497)
!562 = !DILocation(line: 211, column: 11, scope: !497)
!563 = !DILocation(line: 211, column: 9, scope: !497)
!564 = !DILocation(line: 212, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !497, file: !355, line: 212, column: 6)
!566 = !DILocation(line: 212, column: 13, scope: !565)
!567 = !DILocation(line: 212, column: 6, scope: !497)
!568 = !DILocation(line: 213, column: 8, scope: !569)
!569 = distinct !DILexicalBlock(scope: !570, file: !355, line: 213, column: 7)
!570 = distinct !DILexicalBlock(scope: !565, file: !355, line: 212, column: 21)
!571 = !DILocation(line: 213, column: 7, scope: !569)
!572 = !DILocation(line: 213, column: 18, scope: !569)
!573 = !DILocation(line: 213, column: 7, scope: !570)
!574 = !DILocation(line: 214, column: 16, scope: !575)
!575 = distinct !DILexicalBlock(scope: !569, file: !355, line: 213, column: 27)
!576 = !DILocation(line: 215, column: 15, scope: !577)
!577 = distinct !DILexicalBlock(scope: !575, file: !355, line: 215, column: 4)
!578 = !DILocation(line: 215, column: 23, scope: !577)
!579 = !DILocation(line: 215, column: 13, scope: !577)
!580 = !DILocation(line: 215, column: 9, scope: !577)
!581 = !DILocation(line: 215, column: 30, scope: !582)
!582 = !DILexicalBlockFile(scope: !583, file: !355, discriminator: 1)
!583 = distinct !DILexicalBlock(scope: !577, file: !355, line: 215, column: 4)
!584 = !DILocation(line: 215, column: 34, scope: !582)
!585 = !DILocation(line: 215, column: 4, scope: !582)
!586 = !DILocation(line: 216, column: 42, scope: !583)
!587 = !DILocation(line: 216, column: 47, scope: !583)
!588 = !DILocation(line: 216, column: 23, scope: !583)
!589 = !DILocation(line: 216, column: 54, scope: !583)
!590 = !DILocation(line: 216, column: 62, scope: !583)
!591 = !DILocation(line: 216, column: 20, scope: !583)
!592 = !DILocation(line: 216, column: 17, scope: !583)
!593 = !DILocation(line: 216, column: 5, scope: !583)
!594 = !DILocation(line: 215, column: 48, scope: !595)
!595 = !DILexicalBlockFile(scope: !583, file: !355, discriminator: 2)
!596 = !DILocation(line: 215, column: 53, scope: !595)
!597 = !DILocation(line: 215, column: 46, scope: !595)
!598 = !DILocation(line: 215, column: 4, scope: !595)
!599 = distinct !{!599, !600}
!600 = !DILocation(line: 215, column: 4, scope: !575)
!601 = !DILocation(line: 217, column: 8, scope: !602)
!602 = distinct !DILexicalBlock(scope: !575, file: !355, line: 217, column: 8)
!603 = !DILocation(line: 217, column: 8, scope: !575)
!604 = !DILocation(line: 218, column: 19, scope: !602)
!605 = !DILocation(line: 218, column: 5, scope: !602)
!606 = !DILocation(line: 219, column: 3, scope: !575)
!607 = !DILocation(line: 221, column: 28, scope: !608)
!608 = distinct !DILexicalBlock(scope: !569, file: !355, line: 220, column: 8)
!609 = !DILocation(line: 221, column: 36, scope: !608)
!610 = !DILocation(line: 221, column: 11, scope: !608)
!611 = !DILocation(line: 221, column: 9, scope: !608)
!612 = !DILocation(line: 222, column: 8, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !355, line: 222, column: 8)
!614 = !DILocation(line: 222, column: 13, scope: !613)
!615 = !DILocation(line: 222, column: 8, scope: !608)
!616 = !DILocation(line: 223, column: 12, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !355, line: 223, column: 9)
!618 = distinct !DILexicalBlock(scope: !613, file: !355, line: 222, column: 21)
!619 = !DILocation(line: 223, column: 19, scope: !617)
!620 = !DILocation(line: 223, column: 27, scope: !617)
!621 = !DILocation(line: 223, column: 9, scope: !618)
!622 = !DILocation(line: 224, column: 25, scope: !617)
!623 = !DILocation(line: 224, column: 6, scope: !617)
!624 = !DILocation(line: 225, column: 4, scope: !618)
!625 = !DILocation(line: 227, column: 12, scope: !613)
!626 = !DILocation(line: 229, column: 2, scope: !570)
!627 = !DILocation(line: 231, column: 6, scope: !628)
!628 = distinct !DILexicalBlock(scope: !497, file: !355, line: 231, column: 6)
!629 = !DILocation(line: 231, column: 13, scope: !628)
!630 = !DILocation(line: 231, column: 6, scope: !497)
!631 = !DILocation(line: 232, column: 49, scope: !632)
!632 = distinct !DILexicalBlock(scope: !628, file: !355, line: 231, column: 21)
!633 = !DILocation(line: 232, column: 61, scope: !632)
!634 = !DILocation(line: 232, column: 3, scope: !632)
!635 = !DILocation(line: 234, column: 2, scope: !632)
!636 = !DILocation(line: 236, column: 18, scope: !497)
!637 = !DILocation(line: 236, column: 2, scope: !497)
!638 = !DILocation(line: 237, column: 1, scope: !497)
!639 = !DILocation(line: 237, column: 1, scope: !640)
!640 = !DILexicalBlockFile(scope: !497, file: !355, discriminator: 1)
!641 = distinct !DISubprogram(name: "fe_modules_deinit", scope: !355, file: !355, line: 249, type: !342, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!642 = !DILocation(line: 251, column: 2, scope: !641)
!643 = !DILocation(line: 252, column: 2, scope: !641)
!644 = !DILocation(line: 253, column: 2, scope: !641)
!645 = !DILocation(line: 255, column: 2, scope: !641)
!646 = !DILocation(line: 256, column: 2, scope: !641)
!647 = !DILocation(line: 257, column: 1, scope: !641)
!648 = distinct !DISubprogram(name: "cmd_load_list", scope: !355, file: !355, line: 106, type: !342, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!649 = !DILocalVariable(name: "tmp", scope: !648, file: !355, line: 108, type: !331)
!650 = !DILocation(line: 108, column: 10, scope: !648)
!651 = !DILocalVariable(name: "submodules", scope: !648, file: !355, line: 109, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !654, line: 39, baseType: !655)
!654 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !654, line: 41, size: 192, align: 64, elements: !656)
!656 = !{!657, !658, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !655, file: !654, line: 43, baseType: !311, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !655, file: !654, line: 44, baseType: !659, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !660, line: 66, baseType: !661)
!660 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!661 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !655, file: !654, line: 45, baseType: !659, size: 64, align: 64, offset: 128)
!663 = !DILocation(line: 109, column: 11, scope: !648)
!664 = !DILocalVariable(name: "type", scope: !648, file: !355, line: 110, type: !314)
!665 = !DILocation(line: 110, column: 21, scope: !648)
!666 = !DILocalVariable(name: "dynamic", scope: !648, file: !355, line: 111, type: !308)
!667 = !DILocation(line: 111, column: 13, scope: !648)
!668 = !DILocation(line: 113, column: 22, scope: !648)
!669 = !DILocation(line: 113, column: 20, scope: !648)
!670 = !DILocation(line: 115, column: 2, scope: !648)
!671 = !DILocation(line: 116, column: 13, scope: !672)
!672 = distinct !DILexicalBlock(scope: !648, file: !355, line: 116, column: 2)
!673 = !DILocation(line: 116, column: 11, scope: !672)
!674 = !DILocation(line: 116, column: 7, scope: !672)
!675 = !DILocation(line: 116, column: 22, scope: !676)
!676 = !DILexicalBlockFile(scope: !677, file: !355, discriminator: 1)
!677 = distinct !DILexicalBlock(scope: !672, file: !355, line: 116, column: 2)
!678 = !DILocation(line: 116, column: 26, scope: !676)
!679 = !DILocation(line: 116, column: 2, scope: !676)
!680 = !DILocalVariable(name: "rec", scope: !681, file: !355, line: 117, type: !325)
!681 = distinct !DILexicalBlock(scope: !677, file: !355, line: 116, column: 51)
!682 = !DILocation(line: 117, column: 15, scope: !681)
!683 = !DILocation(line: 117, column: 21, scope: !681)
!684 = !DILocation(line: 117, column: 26, scope: !681)
!685 = !DILocation(line: 119, column: 43, scope: !681)
!686 = !DILocation(line: 119, column: 53, scope: !681)
!687 = !DILocation(line: 119, column: 27, scope: !681)
!688 = !DILocation(line: 119, column: 25, scope: !681)
!689 = !DILocation(line: 120, column: 10, scope: !681)
!690 = !DILocation(line: 120, column: 18, scope: !681)
!691 = !DILocation(line: 120, column: 10, scope: !692)
!692 = !DILexicalBlockFile(scope: !681, file: !355, discriminator: 1)
!693 = !DILocation(line: 121, column: 4, scope: !681)
!694 = !DILocation(line: 120, column: 10, scope: !695)
!695 = !DILexicalBlockFile(scope: !681, file: !355, discriminator: 2)
!696 = !DILocation(line: 120, column: 10, scope: !697)
!697 = !DILexicalBlockFile(scope: !681, file: !355, discriminator: 3)
!698 = !DILocation(line: 120, column: 8, scope: !697)
!699 = !DILocation(line: 123, column: 42, scope: !681)
!700 = !DILocation(line: 123, column: 47, scope: !681)
!701 = !DILocation(line: 123, column: 53, scope: !681)
!702 = !DILocation(line: 123, column: 59, scope: !681)
!703 = !DILocation(line: 123, column: 71, scope: !681)
!704 = !DILocation(line: 123, column: 3, scope: !681)
!705 = !DILocation(line: 125, column: 2, scope: !681)
!706 = !DILocation(line: 116, column: 40, scope: !707)
!707 = !DILexicalBlockFile(scope: !677, file: !355, discriminator: 2)
!708 = !DILocation(line: 116, column: 45, scope: !707)
!709 = !DILocation(line: 116, column: 38, scope: !707)
!710 = !DILocation(line: 116, column: 2, scope: !707)
!711 = distinct !{!711, !712}
!712 = !DILocation(line: 116, column: 2, scope: !648)
!713 = !DILocation(line: 126, column: 2, scope: !648)
!714 = !DILocation(line: 128, column: 16, scope: !648)
!715 = !DILocation(line: 128, column: 2, scope: !648)
!716 = !DILocation(line: 129, column: 1, scope: !648)
!717 = distinct !DISubprogram(name: "module_prefixes_get", scope: !355, file: !355, line: 131, type: !718, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!718 = !DISubroutineType(types: !719)
!719 = !{!316}
!720 = !DILocalVariable(name: "tmp", scope: !717, file: !355, line: 133, type: !331)
!721 = !DILocation(line: 133, column: 17, scope: !717)
!722 = !DILocalVariable(name: "list", scope: !717, file: !355, line: 134, type: !316)
!723 = !DILocation(line: 134, column: 16, scope: !717)
!724 = !DILocalVariable(name: "name", scope: !717, file: !355, line: 134, type: !317)
!725 = !DILocation(line: 134, column: 23, scope: !717)
!726 = !DILocalVariable(name: "count", scope: !717, file: !355, line: 135, type: !308)
!727 = !DILocation(line: 135, column: 13, scope: !717)
!728 = !DILocation(line: 137, column: 55, scope: !717)
!729 = !DILocation(line: 137, column: 40, scope: !717)
!730 = !DILocation(line: 137, column: 39, scope: !717)
!731 = !DILocation(line: 137, column: 36, scope: !717)
!732 = !DILocation(line: 137, column: 33, scope: !717)
!733 = !DILocation(line: 137, column: 21, scope: !734)
!734 = !DILexicalBlockFile(scope: !717, file: !355, discriminator: 1)
!735 = !DILocation(line: 137, column: 10, scope: !717)
!736 = !DILocation(line: 137, column: 7, scope: !717)
!737 = !DILocation(line: 138, column: 2, scope: !717)
!738 = !DILocation(line: 138, column: 10, scope: !717)
!739 = !DILocation(line: 139, column: 2, scope: !717)
!740 = !DILocation(line: 139, column: 10, scope: !717)
!741 = !DILocation(line: 141, column: 8, scope: !717)
!742 = !DILocation(line: 142, column: 13, scope: !743)
!743 = distinct !DILexicalBlock(scope: !717, file: !355, line: 142, column: 2)
!744 = !DILocation(line: 142, column: 11, scope: !743)
!745 = !DILocation(line: 142, column: 7, scope: !743)
!746 = !DILocation(line: 142, column: 29, scope: !747)
!747 = !DILexicalBlockFile(scope: !748, file: !355, discriminator: 1)
!748 = distinct !DILexicalBlock(scope: !743, file: !355, line: 142, column: 2)
!749 = !DILocation(line: 142, column: 33, scope: !747)
!750 = !DILocation(line: 142, column: 2, scope: !747)
!751 = !DILocalVariable(name: "rec", scope: !752, file: !355, line: 143, type: !753)
!752 = distinct !DILexicalBlock(scope: !748, file: !355, line: 142, column: 58)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !755, line: 105, baseType: !756)
!755 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !757, line: 4, size: 832, align: 64, elements: !758)
!757 = !DIFile(filename: "../../../src/core/chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!758 = !{!759, !760, !761, !762, !763, !764, !765, !772, !779, !786, !793, !797, !804, !808, !815}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !756, file: !757, line: 5, baseType: !308, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !756, file: !757, line: 7, baseType: !350, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !756, file: !757, line: 8, baseType: !350, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !757, line: 10, baseType: !317, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !756, file: !757, line: 11, baseType: !317, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !756, file: !757, line: 12, baseType: !317, size: 64, align: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !756, file: !757, line: 14, baseType: !766, size: 64, align: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !755, line: 106, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !755, line: 106, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !756, file: !757, line: 15, baseType: !773, size: 64, align: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !755, line: 114, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !755, line: 114, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !756, file: !757, line: 16, baseType: !780, size: 64, align: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !755, line: 115, baseType: !785)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !755, line: 115, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !756, file: !757, line: 17, baseType: !787, size: 64, align: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !755, line: 113, baseType: !792)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !755, line: 113, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !756, file: !757, line: 18, baseType: !794, size: 64, align: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !790}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !756, file: !757, line: 20, baseType: !798, size: 64, align: 64, offset: 576)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !790}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !755, line: 107, baseType: !803)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !755, line: 107, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "server_connect", scope: !756, file: !757, line: 21, baseType: !805, size: 64, align: 64, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !801}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "channel_create", scope: !756, file: !757, line: 22, baseType: !809, size: 64, align: 64, offset: 704)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !801, !314, !314, !308}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !755, line: 109, baseType: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !755, line: 109, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "query_create", scope: !756, file: !757, line: 24, baseType: !816, size: 64, align: 64, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!819, !314, !314, !308}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !755, line: 110, baseType: !821)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !755, line: 110, flags: DIFlagFwdDecl)
!822 = !DILocation(line: 143, column: 22, scope: !752)
!823 = !DILocation(line: 143, column: 28, scope: !752)
!824 = !DILocation(line: 143, column: 33, scope: !752)
!825 = !DILocation(line: 145, column: 26, scope: !752)
!826 = !DILocation(line: 145, column: 31, scope: !752)
!827 = !DILocation(line: 145, column: 10, scope: !752)
!828 = !DILocation(line: 145, column: 8, scope: !752)
!829 = !DILocation(line: 147, column: 19, scope: !752)
!830 = !DILocation(line: 147, column: 13, scope: !752)
!831 = !DILocation(line: 147, column: 3, scope: !752)
!832 = !DILocation(line: 147, column: 17, scope: !752)
!833 = !DILocation(line: 148, column: 52, scope: !752)
!834 = !DILocation(line: 148, column: 33, scope: !752)
!835 = !DILocation(line: 148, column: 27, scope: !752)
!836 = !DILocation(line: 148, column: 17, scope: !752)
!837 = !DILocation(line: 148, column: 31, scope: !752)
!838 = !DILocation(line: 149, column: 59, scope: !752)
!839 = !DILocation(line: 149, column: 33, scope: !752)
!840 = !DILocation(line: 149, column: 27, scope: !752)
!841 = !DILocation(line: 149, column: 17, scope: !752)
!842 = !DILocation(line: 149, column: 31, scope: !752)
!843 = !DILocation(line: 150, column: 2, scope: !752)
!844 = !DILocation(line: 142, column: 47, scope: !845)
!845 = !DILexicalBlockFile(scope: !748, file: !355, discriminator: 2)
!846 = !DILocation(line: 142, column: 52, scope: !845)
!847 = !DILocation(line: 142, column: 45, scope: !845)
!848 = !DILocation(line: 142, column: 2, scope: !845)
!849 = distinct !{!849, !850}
!850 = !DILocation(line: 142, column: 2, scope: !717)
!851 = !DILocation(line: 151, column: 7, scope: !717)
!852 = !DILocation(line: 151, column: 2, scope: !717)
!853 = !DILocation(line: 151, column: 14, scope: !717)
!854 = !DILocation(line: 153, column: 16, scope: !717)
!855 = !DILocation(line: 153, column: 9, scope: !717)
!856 = distinct !DISubprogram(name: "module_prefixes_free", scope: !355, file: !355, line: 156, type: !857, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !356)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !316}
!859 = !DILocalVariable(name: "list", arg: 1, scope: !856, file: !355, line: 156, type: !316)
!860 = !DILocation(line: 156, column: 41, scope: !856)
!861 = !DILocalVariable(name: "pos", scope: !856, file: !355, line: 158, type: !316)
!862 = !DILocation(line: 158, column: 9, scope: !856)
!863 = !DILocation(line: 158, column: 15, scope: !856)
!864 = !DILocation(line: 158, column: 19, scope: !856)
!865 = !DILocation(line: 160, column: 2, scope: !856)
!866 = !DILocation(line: 160, column: 10, scope: !867)
!867 = !DILexicalBlockFile(scope: !856, file: !355, discriminator: 1)
!868 = !DILocation(line: 160, column: 9, scope: !867)
!869 = !DILocation(line: 160, column: 14, scope: !867)
!870 = !DILocation(line: 160, column: 2, scope: !867)
!871 = !DILocation(line: 161, column: 25, scope: !872)
!872 = distinct !DILexicalBlock(scope: !856, file: !355, line: 160, column: 22)
!873 = !DILocation(line: 161, column: 24, scope: !872)
!874 = !DILocation(line: 161, column: 17, scope: !872)
!875 = !DILocation(line: 162, column: 20, scope: !872)
!876 = !DILocation(line: 160, column: 2, scope: !877)
!877 = !DILexicalBlockFile(scope: !856, file: !355, discriminator: 2)
!878 = distinct !{!878, !865}
!879 = !DILocation(line: 164, column: 16, scope: !856)
