; ModuleID = './line113-channel-rejoin.o.i'
source_filename = "./line113-channel-rejoin.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !66, !67, !74, !378, !140, !466, !65, !368, !641, !485, !687}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !65}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !62, line: 50, baseType: !63)
!62 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !62, line: 49, baseType: !64)
!64 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !62, line: 77, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !68, line: 9, baseType: !69)
!68 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !72, !72, !72, !72, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !76, line: 6, baseType: !77)
!76 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !78, line: 42, size: 39168, align: 64, elements: !79)
!78 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = !{!80, !82, !83, !84, !323, !328, !329, !330, !331, !332, !333, !334, !335, !336, !340, !341, !345, !346, !347, !351, !356, !357, !358, !359, !360, !361, !362, !363, !370, !371, !372, !373, !374, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !684, !686}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !81, line: 3, baseType: !64, size: 32, align: 32)
!81 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !77, file: !81, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !77, file: !81, line: 6, baseType: !64, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !77, file: !81, line: 8, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !76, line: 5, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !78, line: 24, size: 2496, align: 64, elements: !88)
!88 = !{!89, !91, !92, !93, !96, !97, !98, !99, !100, !102, !103, !104, !105, !106, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !90, line: 3, baseType: !64, size: 32, align: 32)
!90 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !87, file: !90, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !87, file: !90, line: 6, baseType: !64, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !87, file: !90, line: 9, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !87, file: !90, line: 10, baseType: !64, size: 32, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !87, file: !90, line: 13, baseType: !101, size: 16, align: 16, offset: 448)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !90, line: 14, baseType: !94, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !87, file: !90, line: 15, baseType: !94, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !87, file: !90, line: 16, baseType: !64, size: 32, align: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !87, file: !90, line: 17, baseType: !94, size: 64, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !87, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !109, line: 99, baseType: !110)
!109 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !109, line: 99, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !87, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !87, file: !90, line: 21, baseType: !94, size: 64, align: 64, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !87, file: !90, line: 22, baseType: !94, size: 64, align: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !87, file: !90, line: 23, baseType: !94, size: 64, align: 64, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !87, file: !90, line: 24, baseType: !94, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !87, file: !90, line: 26, baseType: !94, size: 64, align: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !87, file: !90, line: 27, baseType: !94, size: 64, align: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !87, file: !90, line: 28, baseType: !94, size: 64, align: 64, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !87, file: !90, line: 29, baseType: !94, size: 64, align: 64, offset: 1344)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !87, file: !90, line: 30, baseType: !94, size: 64, align: 64, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !87, file: !90, line: 31, baseType: !94, size: 64, align: 64, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !87, file: !90, line: 32, baseType: !94, size: 64, align: 64, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !87, file: !90, line: 33, baseType: !94, size: 64, align: 64, offset: 1600)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !87, file: !90, line: 35, baseType: !125, size: 64, align: 64, offset: 1664)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !128)
!128 = !{!129, !130, !268, !269, !274, !275, !276, !277, !278, !287, !288, !289, !293, !294, !295, !296, !297, !298, !299, !300}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !127, file: !4, line: 100, baseType: !63, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !127, file: !4, line: 101, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !134)
!134 = !{!135, !159, !165, !172, !176, !255, !259, !264}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !133, file: !4, line: 133, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !125, !140, !142, !145, !146}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !62, line: 46, baseType: !95)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !143, line: 66, baseType: !144)
!143 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!144 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !149, line: 42, baseType: !150)
!149 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !149, line: 44, size: 128, align: 64, elements: !151)
!151 = !{!152, !157, !158}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !150, file: !149, line: 46, baseType: !153, size: 32, align: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !154, line: 36, baseType: !155)
!154 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !143, line: 45, baseType: !156)
!156 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !150, file: !149, line: 47, baseType: !63, size: 32, align: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !150, file: !149, line: 48, baseType: !140, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !133, file: !4, line: 138, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!139, !125, !163, !142, !145, !146}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !133, file: !4, line: 143, baseType: !166, size: 64, align: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!139, !125, !169, !171, !146}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !143, line: 51, baseType: !170)
!170 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !133, file: !4, line: 147, baseType: !173, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!139, !125, !146}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !133, file: !4, line: 149, baseType: !177, size: 64, align: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !125, !254}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !183)
!183 = !{!184, !185, !201, !230, !232, !236, !237, !238, !239, !247, !248, !249, !250}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !182, file: !16, line: 174, baseType: !65, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !182, file: !16, line: 175, baseType: !186, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !189)
!189 = !{!190, !194, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !188, file: !16, line: 198, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !65}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !188, file: !16, line: 199, baseType: !191, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !188, file: !16, line: 200, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !65, !180, !199, !200}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !182, file: !16, line: 177, baseType: !202, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !206)
!206 = !{!207, !212, !216, !220, !224, !225}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !205, file: !16, line: 216, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!61, !180, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !205, file: !16, line: 218, baseType: !213, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!61, !180}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !205, file: !16, line: 219, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!61, !180, !57, !65}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !205, file: !16, line: 222, baseType: !221, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !180}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !205, file: !16, line: 226, baseType: !57, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !205, file: !16, line: 227, baseType: !226, size: 64, align: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !182, file: !16, line: 178, baseType: !231, size: 32, align: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !62, line: 55, baseType: !156)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !182, file: !16, line: 180, baseType: !233, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !182, file: !16, line: 182, baseType: !63, size: 32, align: 32, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !16, line: 183, baseType: !231, size: 32, align: 32, offset: 352)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !182, file: !16, line: 184, baseType: !231, size: 32, align: 32, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !182, file: !16, line: 186, baseType: !240, size: 64, align: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !242, line: 37, baseType: !243)
!242 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !242, line: 39, size: 128, align: 64, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !242, line: 41, baseType: !65, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !242, line: 42, baseType: !240, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !16, line: 188, baseType: !180, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !16, line: 189, baseType: !180, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !16, line: 191, baseType: !94, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !182, file: !16, line: 193, baseType: !251, size: 64, align: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !133, file: !4, line: 151, baseType: !256, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !125}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !133, file: !4, line: 152, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!139, !125, !263, !146}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !133, file: !4, line: 155, baseType: !265, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!263, !125}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !127, file: !4, line: 103, baseType: !140, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !127, file: !4, line: 104, baseType: !270, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !271, line: 77, baseType: !272)
!271 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !271, line: 77, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !127, file: !4, line: 105, baseType: !270, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !127, file: !4, line: 106, baseType: !140, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !127, file: !4, line: 107, baseType: !231, size: 32, align: 32, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !127, file: !4, line: 109, baseType: !142, size: 64, align: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !127, file: !4, line: 110, baseType: !279, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !281, line: 39, baseType: !282)
!281 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !281, line: 41, size: 192, align: 64, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !282, file: !281, line: 43, baseType: !140, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !282, file: !281, line: 44, baseType: !142, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !282, file: !281, line: 45, baseType: !142, size: 64, align: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !127, file: !4, line: 111, baseType: !279, size: 64, align: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !127, file: !4, line: 112, baseType: !279, size: 64, align: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !127, file: !4, line: 113, baseType: !290, size: 48, align: 8, offset: 704)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 48, align: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 6)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !127, file: !4, line: 117, baseType: !231, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !127, file: !4, line: 118, baseType: !231, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !127, file: !4, line: 119, baseType: !231, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !127, file: !4, line: 120, baseType: !231, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !127, file: !4, line: 121, baseType: !231, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !127, file: !4, line: 122, baseType: !231, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !127, file: !4, line: 124, baseType: !65, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !127, file: !4, line: 125, baseType: !65, size: 64, align: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !87, file: !90, line: 38, baseType: !156, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !87, file: !90, line: 39, baseType: !156, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !87, file: !90, line: 40, baseType: !156, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !87, file: !90, line: 41, baseType: !156, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !87, file: !90, line: 42, baseType: !156, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !87, file: !90, line: 43, baseType: !156, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !87, file: !90, line: 44, baseType: !156, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !87, file: !90, line: 45, baseType: !156, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !87, file: !90, line: 46, baseType: !94, size: 64, align: 64, offset: 1792)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !87, file: !90, line: 47, baseType: !94, size: 64, align: 64, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !87, file: !78, line: 27, baseType: !94, size: 64, align: 64, offset: 1920)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !87, file: !78, line: 28, baseType: !94, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !87, file: !78, line: 30, baseType: !64, size: 32, align: 32, offset: 2048)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !87, file: !78, line: 31, baseType: !94, size: 64, align: 64, offset: 2112)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !87, file: !78, line: 32, baseType: !94, size: 64, align: 64, offset: 2176)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !87, file: !78, line: 34, baseType: !64, size: 32, align: 32, offset: 2240)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !87, file: !78, line: 35, baseType: !64, size: 32, align: 32, offset: 2272)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !87, file: !78, line: 36, baseType: !64, size: 32, align: 32, offset: 2304)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !87, file: !78, line: 38, baseType: !64, size: 32, align: 32, offset: 2336)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !87, file: !78, line: 38, baseType: !64, size: 32, align: 32, offset: 2368)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !87, file: !78, line: 38, baseType: !64, size: 32, align: 32, offset: 2400)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !87, file: !78, line: 38, baseType: !64, size: 32, align: 32, offset: 2432)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !77, file: !81, line: 9, baseType: !324, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !325, line: 75, baseType: !326)
!325 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !327, line: 139, baseType: !170)
!327 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !77, file: !81, line: 10, baseType: !324, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !77, file: !81, line: 12, baseType: !94, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !77, file: !81, line: 13, baseType: !94, size: 64, align: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !77, file: !81, line: 15, baseType: !156, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !77, file: !81, line: 16, baseType: !156, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !77, file: !81, line: 17, baseType: !156, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !77, file: !81, line: 18, baseType: !156, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !77, file: !81, line: 19, baseType: !156, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !77, file: !81, line: 21, baseType: !337, size: 64, align: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !109, line: 102, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !109, line: 102, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !77, file: !81, line: 22, baseType: !64, size: 32, align: 32, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !77, file: !81, line: 25, baseType: !342, size: 128, align: 64, offset: 640)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, align: 64, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 2)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !77, file: !81, line: 26, baseType: !64, size: 32, align: 32, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !77, file: !81, line: 27, baseType: !64, size: 32, align: 32, offset: 800)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !77, file: !81, line: 29, baseType: !348, size: 64, align: 64, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !109, line: 103, baseType: !350)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !109, line: 103, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !77, file: !81, line: 30, baseType: !352, size: 64, align: 64, offset: 896)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !354, line: 37, baseType: !355)
!354 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !354, line: 37, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !81, line: 32, baseType: !94, size: 64, align: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !77, file: !81, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !77, file: !81, line: 34, baseType: !94, size: 64, align: 64, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !77, file: !81, line: 35, baseType: !156, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !77, file: !81, line: 36, baseType: !156, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !77, file: !81, line: 37, baseType: !156, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !77, file: !81, line: 38, baseType: !156, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !77, file: !81, line: 40, baseType: !364, size: 128, align: 64, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !62, line: 504, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !62, line: 506, size: 128, align: 64, elements: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !365, file: !62, line: 508, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !62, line: 48, baseType: !170)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !365, file: !62, line: 509, baseType: !368, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !77, file: !81, line: 41, baseType: !324, size: 64, align: 64, offset: 1344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !77, file: !81, line: 42, baseType: !64, size: 32, align: 32, offset: 1408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !77, file: !81, line: 44, baseType: !240, size: 64, align: 64, offset: 1472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !77, file: !81, line: 45, baseType: !240, size: 64, align: 64, offset: 1536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !77, file: !81, line: 53, baseType: !375, size: 64, align: 64, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !378, !466, !64}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !109, line: 107, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !381, line: 30, size: 2240, align: 64, elements: !382)
!381 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!382 = !{!383, !384, !385, !386, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !462, !468, !472, !476, !481, !560, !567, !571}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !81, line: 3, baseType: !64, size: 32, align: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !380, file: !81, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !380, file: !81, line: 6, baseType: !64, size: 32, align: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !380, file: !81, line: 8, baseType: !387, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !109, line: 113, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !381, line: 25, size: 1920, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !90, line: 3, baseType: !64, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !389, file: !90, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !389, file: !90, line: 6, baseType: !64, size: 32, align: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !389, file: !90, line: 9, baseType: !94, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !389, file: !90, line: 10, baseType: !64, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !389, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !389, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !389, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !389, file: !90, line: 13, baseType: !101, size: 16, align: 16, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !389, file: !90, line: 14, baseType: !94, size: 64, align: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !389, file: !90, line: 15, baseType: !94, size: 64, align: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !389, file: !90, line: 16, baseType: !64, size: 32, align: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !389, file: !90, line: 17, baseType: !94, size: 64, align: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !389, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !389, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !389, file: !90, line: 21, baseType: !94, size: 64, align: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !389, file: !90, line: 22, baseType: !94, size: 64, align: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !389, file: !90, line: 23, baseType: !94, size: 64, align: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !389, file: !90, line: 24, baseType: !94, size: 64, align: 64, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !389, file: !90, line: 26, baseType: !94, size: 64, align: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !389, file: !90, line: 27, baseType: !94, size: 64, align: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !389, file: !90, line: 28, baseType: !94, size: 64, align: 64, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !389, file: !90, line: 29, baseType: !94, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !389, file: !90, line: 30, baseType: !94, size: 64, align: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !389, file: !90, line: 31, baseType: !94, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !389, file: !90, line: 32, baseType: !94, size: 64, align: 64, offset: 1536)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !389, file: !90, line: 33, baseType: !94, size: 64, align: 64, offset: 1600)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !389, file: !90, line: 35, baseType: !125, size: 64, align: 64, offset: 1664)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !389, file: !90, line: 38, baseType: !156, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !389, file: !90, line: 39, baseType: !156, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !389, file: !90, line: 40, baseType: !156, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !389, file: !90, line: 41, baseType: !156, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !389, file: !90, line: 42, baseType: !156, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !389, file: !90, line: 43, baseType: !156, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !389, file: !90, line: 44, baseType: !156, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !389, file: !90, line: 45, baseType: !156, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !389, file: !90, line: 46, baseType: !94, size: 64, align: 64, offset: 1792)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !389, file: !90, line: 47, baseType: !94, size: 64, align: 64, offset: 1856)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !380, file: !81, line: 9, baseType: !324, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !380, file: !81, line: 10, baseType: !324, size: 64, align: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !380, file: !81, line: 12, baseType: !94, size: 64, align: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !380, file: !81, line: 13, baseType: !94, size: 64, align: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !380, file: !81, line: 15, baseType: !156, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !380, file: !81, line: 16, baseType: !156, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !380, file: !81, line: 17, baseType: !156, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !380, file: !81, line: 18, baseType: !156, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !380, file: !81, line: 19, baseType: !156, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !380, file: !81, line: 21, baseType: !337, size: 64, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !380, file: !81, line: 22, baseType: !64, size: 32, align: 32, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !380, file: !81, line: 25, baseType: !342, size: 128, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !380, file: !81, line: 26, baseType: !64, size: 32, align: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !380, file: !81, line: 27, baseType: !64, size: 32, align: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !380, file: !81, line: 29, baseType: !348, size: 64, align: 64, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !380, file: !81, line: 30, baseType: !352, size: 64, align: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !380, file: !81, line: 32, baseType: !94, size: 64, align: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !380, file: !81, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !380, file: !81, line: 34, baseType: !94, size: 64, align: 64, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !380, file: !81, line: 35, baseType: !156, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !380, file: !81, line: 36, baseType: !156, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !380, file: !81, line: 37, baseType: !156, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !380, file: !81, line: 38, baseType: !156, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !380, file: !81, line: 40, baseType: !364, size: 128, align: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !380, file: !81, line: 41, baseType: !324, size: 64, align: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !380, file: !81, line: 42, baseType: !64, size: 32, align: 32, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !380, file: !81, line: 44, baseType: !240, size: 64, align: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !380, file: !81, line: 45, baseType: !240, size: 64, align: 64, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !380, file: !81, line: 53, baseType: !375, size: 64, align: 64, offset: 1600)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !380, file: !81, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!64, !378, !95}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !380, file: !81, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!64, !378, !466}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !380, file: !81, line: 60, baseType: !469, size: 64, align: 64, offset: 1792)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!466, !378}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !380, file: !81, line: 62, baseType: !473, size: 64, align: 64, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !378, !466, !466, !64}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !380, file: !81, line: 65, baseType: !477, size: 64, align: 64, offset: 1920)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !378, !466, !466}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !380, file: !81, line: 69, baseType: !482, size: 64, align: 64, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !378, !466}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !109, line: 109, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !488, line: 15, size: 1408, align: 64, elements: !489)
!488 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!489 = !{!490, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !508, !512, !514, !515, !516, !517, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !491, line: 3, baseType: !64, size: 32, align: 32)
!491 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !487, file: !491, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !487, file: !491, line: 5, baseType: !352, size: 64, align: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !487, file: !491, line: 7, baseType: !66, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !487, file: !491, line: 8, baseType: !378, size: 64, align: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !487, file: !491, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !491, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !487, file: !491, line: 11, baseType: !324, size: 64, align: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !487, file: !491, line: 12, baseType: !64, size: 32, align: 32, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !487, file: !491, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !487, file: !491, line: 15, baseType: !502, size: 64, align: 64, offset: 576)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !109, line: 108, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !109, line: 108, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !487, file: !491, line: 17, baseType: !509, size: 64, align: 64, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!466, !505}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !487, file: !513, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!513 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !487, file: !513, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !487, file: !513, line: 7, baseType: !324, size: 64, align: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !487, file: !513, line: 9, baseType: !352, size: 64, align: 64, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !487, file: !513, line: 10, baseType: !518, size: 64, align: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !109, line: 111, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !521, line: 13, size: 576, align: 64, elements: !522)
!521 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!522 = !{!523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !541, !542}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !520, file: !524, line: 3, baseType: !64, size: 32, align: 32)
!524 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !520, file: !524, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !520, file: !524, line: 6, baseType: !324, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !520, file: !524, line: 8, baseType: !94, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !520, file: !524, line: 9, baseType: !94, size: 64, align: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !520, file: !524, line: 10, baseType: !94, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !520, file: !524, line: 11, baseType: !64, size: 32, align: 32, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !520, file: !524, line: 14, baseType: !156, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !520, file: !524, line: 15, baseType: !156, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !520, file: !524, line: 18, baseType: !156, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !520, file: !524, line: 19, baseType: !156, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !520, file: !524, line: 20, baseType: !156, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !520, file: !524, line: 21, baseType: !156, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !520, file: !524, line: 22, baseType: !538, size: 64, align: 8, offset: 360)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, align: 8, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !520, file: !524, line: 26, baseType: !66, size: 64, align: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !524, line: 28, baseType: !518, size: 64, align: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !487, file: !513, line: 12, baseType: !156, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !487, file: !513, line: 13, baseType: !94, size: 64, align: 64, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !487, file: !513, line: 14, baseType: !64, size: 32, align: 32, offset: 1152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !487, file: !513, line: 15, baseType: !94, size: 64, align: 64, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !487, file: !513, line: 17, baseType: !156, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !487, file: !513, line: 18, baseType: !156, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !487, file: !513, line: 19, baseType: !156, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !487, file: !513, line: 20, baseType: !156, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !487, file: !513, line: 22, baseType: !156, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !487, file: !513, line: 23, baseType: !156, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !487, file: !513, line: 24, baseType: !156, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !487, file: !513, line: 25, baseType: !156, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !487, file: !513, line: 26, baseType: !156, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !487, file: !513, line: 31, baseType: !557, size: 64, align: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!94, !485}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !380, file: !81, line: 70, baseType: !561, size: 64, align: 64, offset: 2048)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !378, !466}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !109, line: 110, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !109, line: 110, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !380, file: !81, line: 71, baseType: !568, size: 64, align: 64, offset: 2112)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!64, !466, !466}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !380, file: !81, line: 73, baseType: !568, size: 64, align: 64, offset: 2176)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !77, file: !81, line: 55, baseType: !459, size: 64, align: 64, offset: 1664)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !77, file: !81, line: 57, baseType: !463, size: 64, align: 64, offset: 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !77, file: !81, line: 60, baseType: !469, size: 64, align: 64, offset: 1792)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !77, file: !81, line: 62, baseType: !473, size: 64, align: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !77, file: !81, line: 65, baseType: !477, size: 64, align: 64, offset: 1920)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !77, file: !81, line: 69, baseType: !482, size: 64, align: 64, offset: 1984)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !77, file: !81, line: 70, baseType: !561, size: 64, align: 64, offset: 2048)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !77, file: !81, line: 71, baseType: !568, size: 64, align: 64, offset: 2112)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !77, file: !81, line: 73, baseType: !568, size: 64, align: 64, offset: 2176)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !77, file: !78, line: 46, baseType: !240, size: 64, align: 64, offset: 2240)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !77, file: !78, line: 47, baseType: !240, size: 64, align: 64, offset: 2304)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !77, file: !78, line: 48, baseType: !584, size: 64, align: 64, offset: 2368)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !76, line: 8, baseType: !586)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !76, line: 8, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !77, file: !78, line: 49, baseType: !240, size: 64, align: 64, offset: 2432)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !77, file: !78, line: 51, baseType: !94, size: 64, align: 64, offset: 2496)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !77, file: !78, line: 53, baseType: !94, size: 64, align: 64, offset: 2560)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !77, file: !78, line: 54, baseType: !94, size: 64, align: 64, offset: 2624)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !77, file: !78, line: 55, baseType: !94, size: 64, align: 64, offset: 2688)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !77, file: !78, line: 56, baseType: !94, size: 64, align: 64, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !77, file: !78, line: 57, baseType: !64, size: 32, align: 32, offset: 2816)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !77, file: !78, line: 59, baseType: !156, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !77, file: !78, line: 60, baseType: !156, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !77, file: !78, line: 62, baseType: !156, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !77, file: !78, line: 63, baseType: !156, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !77, file: !78, line: 64, baseType: !156, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !77, file: !78, line: 65, baseType: !156, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !77, file: !78, line: 66, baseType: !156, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !77, file: !78, line: 67, baseType: !156, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !77, file: !78, line: 68, baseType: !156, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !77, file: !78, line: 69, baseType: !156, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !77, file: !78, line: 70, baseType: !156, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !77, file: !78, line: 71, baseType: !156, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !77, file: !78, line: 72, baseType: !156, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !77, file: !78, line: 74, baseType: !64, size: 32, align: 32, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !77, file: !78, line: 75, baseType: !64, size: 32, align: 32, offset: 2912)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !77, file: !78, line: 76, baseType: !64, size: 32, align: 32, offset: 2944)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !77, file: !78, line: 77, baseType: !64, size: 32, align: 32, offset: 2976)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !77, file: !78, line: 79, baseType: !352, size: 64, align: 64, offset: 3008)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !77, file: !78, line: 80, baseType: !240, size: 64, align: 64, offset: 3072)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !77, file: !78, line: 81, baseType: !240, size: 64, align: 64, offset: 3136)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !77, file: !78, line: 83, baseType: !279, size: 64, align: 64, offset: 3200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !77, file: !78, line: 84, baseType: !231, size: 32, align: 32, offset: 3264)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !77, file: !78, line: 87, baseType: !64, size: 32, align: 32, offset: 3296)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !77, file: !78, line: 91, baseType: !240, size: 64, align: 64, offset: 3328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !77, file: !78, line: 92, baseType: !364, size: 128, align: 64, offset: 3392)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !77, file: !78, line: 93, baseType: !364, size: 128, align: 64, offset: 3520)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !77, file: !78, line: 95, baseType: !64, size: 32, align: 32, offset: 3648)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !77, file: !78, line: 96, baseType: !64, size: 32, align: 32, offset: 3680)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !77, file: !78, line: 97, baseType: !64, size: 32, align: 32, offset: 3712)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !77, file: !78, line: 100, baseType: !240, size: 64, align: 64, offset: 3776)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !77, file: !78, line: 103, baseType: !240, size: 64, align: 64, offset: 3840)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !77, file: !78, line: 106, baseType: !240, size: 64, align: 64, offset: 3904)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !77, file: !78, line: 108, baseType: !352, size: 64, align: 64, offset: 3968)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !77, file: !78, line: 109, baseType: !240, size: 64, align: 64, offset: 4032)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !77, file: !78, line: 111, baseType: !240, size: 64, align: 64, offset: 4096)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !77, file: !78, line: 114, baseType: !66, size: 64, align: 64, offset: 4160)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !77, file: !78, line: 116, baseType: !352, size: 64, align: 64, offset: 4224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !77, file: !78, line: 117, baseType: !632, size: 32768, align: 64, offset: 4288)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 32768, align: 64, elements: !682)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !634, line: 10, size: 128, align: 64, elements: !635)
!634 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!635 = !{!636, !681}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !633, file: !634, line: 11, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !634, line: 7, baseType: !639)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !641, !466, !95, !95, !94, !279}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !76, line: 7, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !644, line: 15, size: 1600, align: 64, elements: !645)
!644 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !491, line: 3, baseType: !64, size: 32, align: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !643, file: !491, line: 4, baseType: !64, size: 32, align: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !643, file: !491, line: 5, baseType: !352, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !643, file: !491, line: 7, baseType: !66, size: 64, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !643, file: !491, line: 8, baseType: !74, size: 64, align: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !643, file: !491, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !491, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !643, file: !491, line: 11, baseType: !324, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !643, file: !491, line: 12, baseType: !64, size: 32, align: 32, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !643, file: !491, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !643, file: !491, line: 15, baseType: !502, size: 64, align: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !643, file: !491, line: 17, baseType: !509, size: 64, align: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !643, file: !513, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !643, file: !513, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !643, file: !513, line: 7, baseType: !324, size: 64, align: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !643, file: !513, line: 9, baseType: !352, size: 64, align: 64, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !643, file: !513, line: 10, baseType: !518, size: 64, align: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !643, file: !513, line: 12, baseType: !156, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !643, file: !513, line: 13, baseType: !94, size: 64, align: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !643, file: !513, line: 14, baseType: !64, size: 32, align: 32, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !643, file: !513, line: 15, baseType: !94, size: 64, align: 64, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !643, file: !513, line: 17, baseType: !156, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !643, file: !513, line: 18, baseType: !156, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !643, file: !513, line: 19, baseType: !156, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !643, file: !513, line: 20, baseType: !156, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !643, file: !513, line: 22, baseType: !156, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !643, file: !513, line: 23, baseType: !156, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !643, file: !513, line: 24, baseType: !156, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !643, file: !513, line: 25, baseType: !156, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !643, file: !513, line: 26, baseType: !156, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !643, file: !513, line: 31, baseType: !557, size: 64, align: 64, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !643, file: !644, line: 18, baseType: !240, size: 64, align: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !643, file: !644, line: 20, baseType: !324, size: 64, align: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !643, file: !644, line: 21, baseType: !64, size: 32, align: 32, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !643, file: !644, line: 22, baseType: !64, size: 32, align: 32, offset: 1568)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !633, file: !634, line: 12, baseType: !95, size: 8, align: 8, offset: 64)
!682 = !{!683}
!683 = !DISubrange(count: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !77, file: !78, line: 118, baseType: !685, size: 2048, align: 8, offset: 37056)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, align: 8, elements: !682)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !77, file: !78, line: 120, baseType: !568, size: 64, align: 64, offset: 39104)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "REJOIN_REC", file: !689, line: 8, baseType: !690)
!689 = !DIFile(filename: "channel-rejoin.h", directory: "/home/lichi/Desktop/irssi/task1")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 4, size: 192, align: 64, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !690, file: !689, line: 5, baseType: !94, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !690, file: !689, line: 6, baseType: !94, size: 64, align: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "joining", scope: !690, file: !689, line: 7, baseType: !156, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!695 = !{!696}
!696 = distinct !DIGlobalVariable(name: "rejoin_tag", scope: !0, file: !697, line: 34, type: !64, isLocal: true, isDefinition: true, variable: i32* @rejoin_tag)
!697 = !DIFile(filename: "channel-rejoin.c", directory: "/home/lichi/Desktop/irssi/task1")
!698 = !{i32 2, !"Dwarf Version", i32 4}
!699 = !{i32 2, !"Debug Info Version", i32 3}
!700 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!701 = distinct !DISubprogram(name: "channel_rejoin_init", scope: !697, file: !697, line: 261, type: !228, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !702)
!702 = !{}
!703 = !DILocation(line: 263, column: 2, scope: !701)
!704 = !DILocation(line: 265, column: 15, scope: !701)
!705 = !DILocation(line: 265, column: 13, scope: !701)
!706 = !DILocation(line: 268, column: 49, scope: !701)
!707 = !DILocation(line: 268, column: 2, scope: !708)
!708 = !DILexicalBlockFile(scope: !701, file: !697, discriminator: 1)
!709 = !DILocation(line: 269, column: 2, scope: !701)
!710 = !DILocation(line: 270, column: 2, scope: !701)
!711 = !DILocation(line: 271, column: 2, scope: !701)
!712 = !DILocation(line: 272, column: 2, scope: !701)
!713 = !DILocation(line: 273, column: 2, scope: !701)
!714 = !DILocation(line: 274, column: 1, scope: !701)
!715 = distinct !DISubprogram(name: "sig_rejoin", scope: !697, file: !697, line: 239, type: !716, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !702)
!716 = !DISubroutineType(types: !717)
!717 = !{!64}
!718 = !DILocalVariable(name: "tmp", scope: !715, file: !697, line: 241, type: !240)
!719 = !DIExpression()
!720 = !DILocation(line: 241, column: 10, scope: !715)
!721 = !DILocation(line: 243, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !715, file: !697, line: 243, column: 2)
!723 = !DILocation(line: 243, column: 11, scope: !722)
!724 = !DILocation(line: 243, column: 7, scope: !722)
!725 = !DILocation(line: 243, column: 22, scope: !726)
!726 = !DILexicalBlockFile(scope: !727, file: !697, discriminator: 1)
!727 = distinct !DILexicalBlock(scope: !722, file: !697, line: 243, column: 2)
!728 = !DILocation(line: 243, column: 26, scope: !726)
!729 = !DILocation(line: 243, column: 2, scope: !726)
!730 = !DILocalVariable(name: "rec", scope: !731, file: !697, line: 244, type: !74)
!731 = distinct !DILexicalBlock(scope: !727, file: !697, line: 243, column: 51)
!732 = !DILocation(line: 244, column: 19, scope: !731)
!733 = !DILocation(line: 244, column: 25, scope: !731)
!734 = !DILocation(line: 244, column: 30, scope: !731)
!735 = !DILocation(line: 246, column: 87, scope: !736)
!736 = distinct !DILexicalBlock(scope: !731, file: !697, line: 246, column: 7)
!737 = !DILocation(line: 246, column: 69, scope: !736)
!738 = !DILocation(line: 246, column: 54, scope: !736)
!739 = !DILocation(line: 246, column: 53, scope: !736)
!740 = !DILocation(line: 246, column: 28, scope: !741)
!741 = !DILexicalBlockFile(scope: !736, file: !697, discriminator: 4)
!742 = !DILocation(line: 246, column: 9, scope: !736)
!743 = !DILocation(line: 246, column: 32, scope: !736)
!744 = !DILocation(line: 246, column: 8, scope: !745)
!745 = !DILexicalBlockFile(scope: !736, file: !697, discriminator: 1)
!746 = !DILocation(line: 246, column: 32, scope: !747)
!747 = !DILexicalBlockFile(scope: !736, file: !697, discriminator: 2)
!748 = !DILocation(line: 246, column: 35, scope: !749)
!749 = !DILexicalBlockFile(scope: !736, file: !697, discriminator: 3)
!750 = !DILocation(line: 246, column: 40, scope: !749)
!751 = !DILocation(line: 246, column: 56, scope: !749)
!752 = !DILocation(line: 246, column: 7, scope: !749)
!753 = !DILocation(line: 247, column: 27, scope: !736)
!754 = !DILocation(line: 247, column: 4, scope: !736)
