; ModuleID = './line312-fe-events.o.i'
source_filename = "./line312-fe-events.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 46, size: 32, align: 32, elements: !194)
!193 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!195 = !DIEnumerator(name: "_ISupper", value: 256)
!196 = !DIEnumerator(name: "_ISlower", value: 512)
!197 = !DIEnumerator(name: "_ISalpha", value: 1024)
!198 = !DIEnumerator(name: "_ISdigit", value: 2048)
!199 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!200 = !DIEnumerator(name: "_ISspace", value: 8192)
!201 = !DIEnumerator(name: "_ISprint", value: 16384)
!202 = !DIEnumerator(name: "_ISgraph", value: 32768)
!203 = !DIEnumerator(name: "_ISblank", value: 1)
!204 = !DIEnumerator(name: "_IScntrl", value: 2)
!205 = !DIEnumerator(name: "_ISpunct", value: 4)
!206 = !DIEnumerator(name: "_ISalnum", value: 8)
!207 = !{!208, !215, !216, !220, !222, !230, !664, !249, !316, !277, !508}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !209, line: 9, baseType: !210)
!209 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !213, !213, !213, !213, !213, !213}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !218, line: 46, baseType: !219)
!218 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!219 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !224, line: 107, baseType: !225)
!224 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !226, line: 30, size: 2240, align: 64, elements: !227)
!226 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!227 = !{!228, !231, !232, !233, !463, !468, !469, !470, !471, !472, !473, !474, !475, !476, !480, !481, !485, !486, !487, !491, !496, !497, !498, !499, !500, !501, !502, !503, !510, !511, !512, !513, !514, !518, !522, !526, !530, !534, !539, !632, !659, !663}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !229, line: 3, baseType: !230, size: 32, align: 32)
!229 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !225, file: !229, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !225, file: !229, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !225, file: !229, line: 8, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !224, line: 113, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !226, line: 25, size: 1920, align: 64, elements: !237)
!237 = !{!238, !240, !241, !242, !244, !245, !246, !247, !248, !250, !251, !252, !253, !254, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !239, line: 3, baseType: !230, size: 32, align: 32)
!239 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !236, file: !239, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !236, file: !239, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !236, file: !239, line: 9, baseType: !243, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !236, file: !239, line: 10, baseType: !230, size: 32, align: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !236, file: !239, line: 13, baseType: !249, size: 16, align: 16, offset: 448)
!249 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !236, file: !239, line: 14, baseType: !243, size: 64, align: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !236, file: !239, line: 15, baseType: !243, size: 64, align: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !236, file: !239, line: 16, baseType: !230, size: 32, align: 32, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !236, file: !239, line: 17, baseType: !243, size: 64, align: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !236, file: !239, line: 19, baseType: !255, size: 64, align: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !224, line: 99, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !224, line: 99, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !236, file: !239, line: 19, baseType: !255, size: 64, align: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !236, file: !239, line: 21, baseType: !243, size: 64, align: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !236, file: !239, line: 22, baseType: !243, size: 64, align: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !236, file: !239, line: 23, baseType: !243, size: 64, align: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !236, file: !239, line: 24, baseType: !243, size: 64, align: 64, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !236, file: !239, line: 26, baseType: !243, size: 64, align: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !236, file: !239, line: 27, baseType: !243, size: 64, align: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !236, file: !239, line: 28, baseType: !243, size: 64, align: 64, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !236, file: !239, line: 29, baseType: !243, size: 64, align: 64, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !236, file: !239, line: 30, baseType: !243, size: 64, align: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !236, file: !239, line: 31, baseType: !243, size: 64, align: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !236, file: !239, line: 32, baseType: !243, size: 64, align: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !236, file: !239, line: 33, baseType: !243, size: 64, align: 64, offset: 1600)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !236, file: !239, line: 35, baseType: !272, size: 64, align: 64, offset: 1664)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !275)
!275 = !{!276, !278, !420, !421, !426, !427, !428, !429, !430, !439, !440, !441, !445, !446, !447, !448, !449, !450, !451, !452}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !274, file: !4, line: 100, baseType: !277, size: 32, align: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !218, line: 49, baseType: !230)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !274, file: !4, line: 101, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !282)
!282 = !{!283, !305, !311, !318, !322, !407, !411, !416}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !281, file: !4, line: 133, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !272, !216, !288, !291, !292}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !289, line: 66, baseType: !290)
!289 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!290 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !295, line: 42, baseType: !296)
!295 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !295, line: 44, size: 128, align: 64, elements: !297)
!297 = !{!298, !303, !304}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !296, file: !295, line: 46, baseType: !299, size: 32, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !300, line: 36, baseType: !301)
!300 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !289, line: 45, baseType: !302)
!302 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !296, file: !295, line: 47, baseType: !277, size: 32, align: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !296, file: !295, line: 48, baseType: !216, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !281, file: !4, line: 138, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!287, !272, !309, !288, !291, !292}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !281, file: !4, line: 143, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!287, !272, !315, !317, !292}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !289, line: 51, baseType: !316)
!316 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !281, file: !4, line: 147, baseType: !319, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!287, !272, !292}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !281, file: !4, line: 149, baseType: !323, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!326, !272, !406}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !329)
!329 = !{!330, !332, !353, !382, !384, !388, !389, !390, !391, !399, !400, !401, !402}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !328, file: !16, line: 174, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !218, line: 77, baseType: !215)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !328, file: !16, line: 175, baseType: !333, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !336)
!336 = !{!337, !341, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !335, file: !16, line: 198, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !331}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !335, file: !16, line: 199, baseType: !338, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !335, file: !16, line: 200, baseType: !343, size: 64, align: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !331, !326, !346, !352}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!351, !331}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !218, line: 50, baseType: !277)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !328, file: !16, line: 177, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !358)
!358 = !{!359, !364, !368, !372, !376, !377}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !357, file: !16, line: 216, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!351, !326, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !357, file: !16, line: 218, baseType: !365, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!351, !326}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !357, file: !16, line: 219, baseType: !369, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!351, !326, !347, !331}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !357, file: !16, line: 222, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !326}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !357, file: !16, line: 226, baseType: !347, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !357, file: !16, line: 227, baseType: !378, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !328, file: !16, line: 178, baseType: !383, size: 32, align: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !218, line: 55, baseType: !302)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !328, file: !16, line: 180, baseType: !385, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !328, file: !16, line: 182, baseType: !277, size: 32, align: 32, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !16, line: 183, baseType: !383, size: 32, align: 32, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !328, file: !16, line: 184, baseType: !383, size: 32, align: 32, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !328, file: !16, line: 186, baseType: !392, size: 64, align: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !394, line: 37, baseType: !395)
!394 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !394, line: 39, size: 128, align: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !394, line: 41, baseType: !331, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !394, line: 42, baseType: !392, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !328, file: !16, line: 188, baseType: !326, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !16, line: 189, baseType: !326, size: 64, align: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !16, line: 191, baseType: !243, size: 64, align: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !328, file: !16, line: 193, baseType: !403, size: 64, align: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !281, file: !4, line: 151, baseType: !408, size: 64, align: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !272}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !281, file: !4, line: 152, baseType: !412, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!287, !272, !415, !292}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !281, file: !4, line: 155, baseType: !417, size: 64, align: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!415, !272}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !274, file: !4, line: 103, baseType: !216, size: 64, align: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !274, file: !4, line: 104, baseType: !422, size: 64, align: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !423, line: 77, baseType: !424)
!423 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !423, line: 77, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !274, file: !4, line: 105, baseType: !422, size: 64, align: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !274, file: !4, line: 106, baseType: !216, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !274, file: !4, line: 107, baseType: !383, size: 32, align: 32, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !274, file: !4, line: 109, baseType: !288, size: 64, align: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !274, file: !4, line: 110, baseType: !431, size: 64, align: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !433, line: 39, baseType: !434)
!433 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !433, line: 41, size: 192, align: 64, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !434, file: !433, line: 43, baseType: !216, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !434, file: !433, line: 44, baseType: !288, size: 64, align: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !434, file: !433, line: 45, baseType: !288, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !274, file: !4, line: 111, baseType: !431, size: 64, align: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !274, file: !4, line: 112, baseType: !431, size: 64, align: 64, offset: 640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !274, file: !4, line: 113, baseType: !442, size: 48, align: 8, offset: 704)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 48, align: 8, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 6)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !274, file: !4, line: 117, baseType: !383, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !274, file: !4, line: 118, baseType: !383, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !274, file: !4, line: 119, baseType: !383, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !274, file: !4, line: 120, baseType: !383, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !274, file: !4, line: 121, baseType: !383, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !274, file: !4, line: 122, baseType: !383, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !274, file: !4, line: 124, baseType: !331, size: 64, align: 64, offset: 768)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !274, file: !4, line: 125, baseType: !331, size: 64, align: 64, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !236, file: !239, line: 38, baseType: !302, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !236, file: !239, line: 39, baseType: !302, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !236, file: !239, line: 40, baseType: !302, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !236, file: !239, line: 41, baseType: !302, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !236, file: !239, line: 42, baseType: !302, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !236, file: !239, line: 43, baseType: !302, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !236, file: !239, line: 44, baseType: !302, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !236, file: !239, line: 45, baseType: !302, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !236, file: !239, line: 46, baseType: !243, size: 64, align: 64, offset: 1792)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !236, file: !239, line: 47, baseType: !243, size: 64, align: 64, offset: 1856)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !225, file: !229, line: 9, baseType: !464, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !465, line: 75, baseType: !466)
!465 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !467, line: 139, baseType: !316)
!467 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!468 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !225, file: !229, line: 10, baseType: !464, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !225, file: !229, line: 12, baseType: !243, size: 64, align: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !225, file: !229, line: 13, baseType: !243, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !225, file: !229, line: 15, baseType: !302, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !225, file: !229, line: 16, baseType: !302, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !225, file: !229, line: 17, baseType: !302, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !225, file: !229, line: 18, baseType: !302, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !225, file: !229, line: 19, baseType: !302, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !225, file: !229, line: 21, baseType: !477, size: 64, align: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !224, line: 102, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !224, line: 102, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !225, file: !229, line: 22, baseType: !230, size: 32, align: 32, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !225, file: !229, line: 25, baseType: !482, size: 128, align: 64, offset: 640)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, align: 64, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 2)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !225, file: !229, line: 26, baseType: !230, size: 32, align: 32, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !225, file: !229, line: 27, baseType: !230, size: 32, align: 32, offset: 800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !225, file: !229, line: 29, baseType: !488, size: 64, align: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !224, line: 103, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !224, line: 103, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !225, file: !229, line: 30, baseType: !492, size: 64, align: 64, offset: 896)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !494, line: 37, baseType: !495)
!494 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !494, line: 37, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !229, line: 32, baseType: !243, size: 64, align: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !225, file: !229, line: 33, baseType: !243, size: 64, align: 64, offset: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !225, file: !229, line: 34, baseType: !243, size: 64, align: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !225, file: !229, line: 35, baseType: !302, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !225, file: !229, line: 36, baseType: !302, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !225, file: !229, line: 37, baseType: !302, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !225, file: !229, line: 38, baseType: !302, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !225, file: !229, line: 40, baseType: !504, size: 128, align: 64, offset: 1216)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !218, line: 504, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !218, line: 506, size: 128, align: 64, elements: !506)
!506 = !{!507, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !505, file: !218, line: 508, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !218, line: 48, baseType: !316)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !505, file: !218, line: 509, baseType: !508, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !225, file: !229, line: 41, baseType: !464, size: 64, align: 64, offset: 1344)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !225, file: !229, line: 42, baseType: !230, size: 32, align: 32, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !225, file: !229, line: 44, baseType: !392, size: 64, align: 64, offset: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !225, file: !229, line: 45, baseType: !392, size: 64, align: 64, offset: 1536)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !225, file: !229, line: 53, baseType: !515, size: 64, align: 64, offset: 1600)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !222, !220, !230}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !225, file: !229, line: 55, baseType: !519, size: 64, align: 64, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!230, !222, !219}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !225, file: !229, line: 57, baseType: !523, size: 64, align: 64, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!230, !222, !220}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !225, file: !229, line: 60, baseType: !527, size: 64, align: 64, offset: 1792)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!220, !222}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !225, file: !229, line: 62, baseType: !531, size: 64, align: 64, offset: 1856)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !222, !220, !220, !230}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !225, file: !229, line: 65, baseType: !535, size: 64, align: 64, offset: 1920)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !222, !220, !220}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !225, file: !229, line: 69, baseType: !540, size: 64, align: 64, offset: 1984)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !222, !220}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !224, line: 109, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !546, line: 15, size: 1408, align: 64, elements: !547)
!546 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!547 = !{!548, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !583, !584, !586, !587, !588, !589, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !549, line: 3, baseType: !230, size: 32, align: 32)
!549 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !545, file: !549, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !545, file: !549, line: 5, baseType: !492, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !545, file: !549, line: 7, baseType: !215, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !545, file: !549, line: 8, baseType: !222, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !545, file: !549, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !549, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !545, file: !549, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !545, file: !549, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !545, file: !549, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !545, file: !549, line: 15, baseType: !560, size: 64, align: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !224, line: 108, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !566, line: 5, size: 704, align: 64, elements: !567)
!566 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !549, line: 3, baseType: !230, size: 32, align: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !565, file: !549, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !565, file: !549, line: 5, baseType: !492, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !565, file: !549, line: 7, baseType: !215, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !565, file: !549, line: 8, baseType: !222, size: 64, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !565, file: !549, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !549, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !565, file: !549, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !565, file: !549, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !565, file: !549, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !565, file: !549, line: 15, baseType: !560, size: 64, align: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !565, file: !549, line: 17, baseType: !580, size: 64, align: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!220, !563}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !545, file: !549, line: 17, baseType: !580, size: 64, align: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !545, file: !585, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!585 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!586 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !545, file: !585, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !545, file: !585, line: 7, baseType: !464, size: 64, align: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !545, file: !585, line: 9, baseType: !492, size: 64, align: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !545, file: !585, line: 10, baseType: !590, size: 64, align: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !224, line: 111, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !593, line: 13, size: 576, align: 64, elements: !594)
!593 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!594 = !{!595, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !613, !614}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !596, line: 3, baseType: !230, size: 32, align: 32)
!596 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !592, file: !596, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !592, file: !596, line: 6, baseType: !464, size: 64, align: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !592, file: !596, line: 8, baseType: !243, size: 64, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !592, file: !596, line: 9, baseType: !243, size: 64, align: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !592, file: !596, line: 10, baseType: !243, size: 64, align: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !592, file: !596, line: 11, baseType: !230, size: 32, align: 32, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !592, file: !596, line: 14, baseType: !302, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !592, file: !596, line: 15, baseType: !302, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !592, file: !596, line: 18, baseType: !302, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !592, file: !596, line: 19, baseType: !302, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !592, file: !596, line: 20, baseType: !302, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !592, file: !596, line: 21, baseType: !302, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !592, file: !596, line: 22, baseType: !610, size: 64, align: 8, offset: 360)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 64, align: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 8)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !592, file: !596, line: 26, baseType: !215, size: 64, align: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !592, file: !596, line: 28, baseType: !590, size: 64, align: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !545, file: !585, line: 12, baseType: !302, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !545, file: !585, line: 13, baseType: !243, size: 64, align: 64, offset: 1088)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !545, file: !585, line: 14, baseType: !230, size: 32, align: 32, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !545, file: !585, line: 15, baseType: !243, size: 64, align: 64, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !545, file: !585, line: 17, baseType: !302, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !545, file: !585, line: 18, baseType: !302, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !545, file: !585, line: 19, baseType: !302, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !545, file: !585, line: 20, baseType: !302, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !545, file: !585, line: 22, baseType: !302, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !545, file: !585, line: 23, baseType: !302, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !545, file: !585, line: 24, baseType: !302, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !545, file: !585, line: 25, baseType: !302, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !545, file: !585, line: 26, baseType: !302, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !545, file: !585, line: 31, baseType: !629, size: 64, align: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!243, !543}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !225, file: !229, line: 70, baseType: !633, size: 64, align: 64, offset: 2048)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !222, !220}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !224, line: 110, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !639, line: 15, size: 960, align: 64, elements: !640)
!639 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !655, !656, !657, !658}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !549, line: 3, baseType: !230, size: 32, align: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !638, file: !549, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !638, file: !549, line: 5, baseType: !492, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !638, file: !549, line: 7, baseType: !215, size: 64, align: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !638, file: !549, line: 8, baseType: !222, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !638, file: !549, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !549, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !638, file: !549, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !638, file: !549, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !638, file: !549, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !638, file: !549, line: 15, baseType: !560, size: 64, align: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !638, file: !549, line: 17, baseType: !580, size: 64, align: 64, offset: 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !638, file: !654, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!654 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!655 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !638, file: !654, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !638, file: !654, line: 7, baseType: !464, size: 64, align: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !638, file: !654, line: 9, baseType: !302, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !638, file: !654, line: 11, baseType: !302, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !225, file: !229, line: 71, baseType: !660, size: 64, align: 64, offset: 2112)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!230, !220, !220}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !225, file: !229, line: 73, baseType: !660, size: 64, align: 64, offset: 2176)
!664 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!665 = !{i32 2, !"Dwarf Version", i32 4}
!666 = !{i32 2, !"Debug Info Version", i32 3}
!667 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!668 = distinct !DISubprogram(name: "fe_events_init", scope: !669, file: !669, line: 438, type: !380, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !670)
!669 = !DIFile(filename: "fe-events.c", directory: "/home/lichi/Desktop/irssi/task1")
!670 = !{}
!671 = !DILocation(line: 440, column: 2, scope: !668)
!672 = !DILocation(line: 441, column: 2, scope: !668)
!673 = !DILocation(line: 442, column: 2, scope: !668)
!674 = !DILocation(line: 443, column: 2, scope: !668)
!675 = !DILocation(line: 444, column: 2, scope: !668)
!676 = !DILocation(line: 445, column: 2, scope: !668)
!677 = !DILocation(line: 446, column: 2, scope: !668)
!678 = !DILocation(line: 447, column: 2, scope: !668)
!679 = !DILocation(line: 448, column: 2, scope: !668)
!680 = !DILocation(line: 449, column: 2, scope: !668)
!681 = !DILocation(line: 450, column: 2, scope: !668)
!682 = !DILocation(line: 451, column: 2, scope: !668)
!683 = !DILocation(line: 452, column: 2, scope: !668)
!684 = !DILocation(line: 453, column: 2, scope: !668)
!685 = !DILocation(line: 454, column: 2, scope: !668)
!686 = !DILocation(line: 455, column: 2, scope: !668)
!687 = !DILocation(line: 457, column: 2, scope: !668)
!688 = !DILocation(line: 459, column: 2, scope: !668)
!689 = !DILocation(line: 460, column: 2, scope: !668)
!690 = !DILocation(line: 461, column: 2, scope: !668)
!691 = !DILocation(line: 462, column: 2, scope: !668)
!692 = !DILocation(line: 463, column: 2, scope: !668)
!693 = !DILocation(line: 464, column: 2, scope: !668)
!694 = !DILocation(line: 465, column: 1, scope: !668)
!695 = distinct !DISubprogram(name: "event_privmsg", scope: !669, file: !669, line: 46, type: !696, isLocal: true, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !670)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !698, !220, !220, !220}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !700, line: 6, baseType: !701)
!700 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !702, line: 42, size: 39168, align: 64, elements: !703)
!702 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!703 = !{!704, !705, !706, !707, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !903, !905}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !229, line: 3, baseType: !230, size: 32, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !701, file: !229, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !701, file: !229, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !701, file: !229, line: 8, baseType: !708, size: 64, align: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !700, line: 5, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !702, line: 24, size: 2496, align: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !710, file: !239, line: 3, baseType: !230, size: 32, align: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !710, file: !239, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !710, file: !239, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !710, file: !239, line: 9, baseType: !243, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !710, file: !239, line: 10, baseType: !230, size: 32, align: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !710, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !710, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !710, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !710, file: !239, line: 13, baseType: !249, size: 16, align: 16, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !710, file: !239, line: 14, baseType: !243, size: 64, align: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !710, file: !239, line: 15, baseType: !243, size: 64, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !710, file: !239, line: 16, baseType: !230, size: 32, align: 32, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !710, file: !239, line: 17, baseType: !243, size: 64, align: 64, offset: 704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !710, file: !239, line: 19, baseType: !255, size: 64, align: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !710, file: !239, line: 19, baseType: !255, size: 64, align: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !710, file: !239, line: 21, baseType: !243, size: 64, align: 64, offset: 896)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !710, file: !239, line: 22, baseType: !243, size: 64, align: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !710, file: !239, line: 23, baseType: !243, size: 64, align: 64, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !710, file: !239, line: 24, baseType: !243, size: 64, align: 64, offset: 1088)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !710, file: !239, line: 26, baseType: !243, size: 64, align: 64, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !710, file: !239, line: 27, baseType: !243, size: 64, align: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !710, file: !239, line: 28, baseType: !243, size: 64, align: 64, offset: 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !710, file: !239, line: 29, baseType: !243, size: 64, align: 64, offset: 1344)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !710, file: !239, line: 30, baseType: !243, size: 64, align: 64, offset: 1408)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !710, file: !239, line: 31, baseType: !243, size: 64, align: 64, offset: 1472)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !710, file: !239, line: 32, baseType: !243, size: 64, align: 64, offset: 1536)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !710, file: !239, line: 33, baseType: !243, size: 64, align: 64, offset: 1600)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !710, file: !239, line: 35, baseType: !272, size: 64, align: 64, offset: 1664)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !710, file: !239, line: 38, baseType: !302, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !710, file: !239, line: 39, baseType: !302, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !710, file: !239, line: 40, baseType: !302, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !710, file: !239, line: 41, baseType: !302, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !710, file: !239, line: 42, baseType: !302, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !710, file: !239, line: 43, baseType: !302, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !710, file: !239, line: 44, baseType: !302, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !710, file: !239, line: 45, baseType: !302, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !710, file: !239, line: 46, baseType: !243, size: 64, align: 64, offset: 1792)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !710, file: !239, line: 47, baseType: !243, size: 64, align: 64, offset: 1856)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !710, file: !702, line: 27, baseType: !243, size: 64, align: 64, offset: 1920)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !710, file: !702, line: 28, baseType: !243, size: 64, align: 64, offset: 1984)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !710, file: !702, line: 30, baseType: !230, size: 32, align: 32, offset: 2048)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !710, file: !702, line: 31, baseType: !243, size: 64, align: 64, offset: 2112)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !710, file: !702, line: 32, baseType: !243, size: 64, align: 64, offset: 2176)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !710, file: !702, line: 34, baseType: !230, size: 32, align: 32, offset: 2240)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !710, file: !702, line: 35, baseType: !230, size: 32, align: 32, offset: 2272)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !710, file: !702, line: 36, baseType: !230, size: 32, align: 32, offset: 2304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !710, file: !702, line: 38, baseType: !230, size: 32, align: 32, offset: 2336)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !710, file: !702, line: 38, baseType: !230, size: 32, align: 32, offset: 2368)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !710, file: !702, line: 38, baseType: !230, size: 32, align: 32, offset: 2400)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !710, file: !702, line: 38, baseType: !230, size: 32, align: 32, offset: 2432)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !701, file: !229, line: 9, baseType: !464, size: 64, align: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !701, file: !229, line: 10, baseType: !464, size: 64, align: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !701, file: !229, line: 12, baseType: !243, size: 64, align: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !701, file: !229, line: 13, baseType: !243, size: 64, align: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !701, file: !229, line: 15, baseType: !302, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !701, file: !229, line: 16, baseType: !302, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !701, file: !229, line: 17, baseType: !302, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !701, file: !229, line: 18, baseType: !302, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !701, file: !229, line: 19, baseType: !302, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !701, file: !229, line: 21, baseType: !477, size: 64, align: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !701, file: !229, line: 22, baseType: !230, size: 32, align: 32, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !701, file: !229, line: 25, baseType: !482, size: 128, align: 64, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !701, file: !229, line: 26, baseType: !230, size: 32, align: 32, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !701, file: !229, line: 27, baseType: !230, size: 32, align: 32, offset: 800)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !701, file: !229, line: 29, baseType: !488, size: 64, align: 64, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !701, file: !229, line: 30, baseType: !492, size: 64, align: 64, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !701, file: !229, line: 32, baseType: !243, size: 64, align: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !701, file: !229, line: 33, baseType: !243, size: 64, align: 64, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !701, file: !229, line: 34, baseType: !243, size: 64, align: 64, offset: 1088)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !701, file: !229, line: 35, baseType: !302, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !701, file: !229, line: 36, baseType: !302, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !701, file: !229, line: 37, baseType: !302, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !701, file: !229, line: 38, baseType: !302, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !701, file: !229, line: 40, baseType: !504, size: 128, align: 64, offset: 1216)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !701, file: !229, line: 41, baseType: !464, size: 64, align: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !701, file: !229, line: 42, baseType: !230, size: 32, align: 32, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !701, file: !229, line: 44, baseType: !392, size: 64, align: 64, offset: 1472)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !701, file: !229, line: 45, baseType: !392, size: 64, align: 64, offset: 1536)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !701, file: !229, line: 53, baseType: !515, size: 64, align: 64, offset: 1600)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !701, file: !229, line: 55, baseType: !519, size: 64, align: 64, offset: 1664)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !701, file: !229, line: 57, baseType: !523, size: 64, align: 64, offset: 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !701, file: !229, line: 60, baseType: !527, size: 64, align: 64, offset: 1792)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !701, file: !229, line: 62, baseType: !531, size: 64, align: 64, offset: 1856)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !701, file: !229, line: 65, baseType: !535, size: 64, align: 64, offset: 1920)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !701, file: !229, line: 69, baseType: !540, size: 64, align: 64, offset: 1984)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !701, file: !229, line: 70, baseType: !633, size: 64, align: 64, offset: 2048)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !701, file: !229, line: 71, baseType: !660, size: 64, align: 64, offset: 2112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !701, file: !229, line: 73, baseType: !660, size: 64, align: 64, offset: 2176)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !701, file: !702, line: 46, baseType: !392, size: 64, align: 64, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !701, file: !702, line: 47, baseType: !392, size: 64, align: 64, offset: 2304)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !701, file: !702, line: 48, baseType: !803, size: 64, align: 64, offset: 2368)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !700, line: 8, baseType: !805)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !700, line: 8, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !701, file: !702, line: 49, baseType: !392, size: 64, align: 64, offset: 2432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !701, file: !702, line: 51, baseType: !243, size: 64, align: 64, offset: 2496)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !701, file: !702, line: 53, baseType: !243, size: 64, align: 64, offset: 2560)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !701, file: !702, line: 54, baseType: !243, size: 64, align: 64, offset: 2624)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !701, file: !702, line: 55, baseType: !243, size: 64, align: 64, offset: 2688)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !701, file: !702, line: 56, baseType: !243, size: 64, align: 64, offset: 2752)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !701, file: !702, line: 57, baseType: !230, size: 32, align: 32, offset: 2816)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !701, file: !702, line: 59, baseType: !302, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !701, file: !702, line: 60, baseType: !302, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !701, file: !702, line: 62, baseType: !302, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !701, file: !702, line: 63, baseType: !302, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !701, file: !702, line: 64, baseType: !302, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !701, file: !702, line: 65, baseType: !302, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !701, file: !702, line: 66, baseType: !302, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !701, file: !702, line: 67, baseType: !302, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !701, file: !702, line: 68, baseType: !302, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !701, file: !702, line: 69, baseType: !302, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !701, file: !702, line: 70, baseType: !302, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !701, file: !702, line: 71, baseType: !302, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !701, file: !702, line: 72, baseType: !302, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !701, file: !702, line: 74, baseType: !230, size: 32, align: 32, offset: 2880)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !701, file: !702, line: 75, baseType: !230, size: 32, align: 32, offset: 2912)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !701, file: !702, line: 76, baseType: !230, size: 32, align: 32, offset: 2944)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !701, file: !702, line: 77, baseType: !230, size: 32, align: 32, offset: 2976)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !701, file: !702, line: 79, baseType: !492, size: 64, align: 64, offset: 3008)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !701, file: !702, line: 80, baseType: !392, size: 64, align: 64, offset: 3072)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !701, file: !702, line: 81, baseType: !392, size: 64, align: 64, offset: 3136)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !701, file: !702, line: 83, baseType: !431, size: 64, align: 64, offset: 3200)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !701, file: !702, line: 84, baseType: !383, size: 32, align: 32, offset: 3264)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !701, file: !702, line: 87, baseType: !230, size: 32, align: 32, offset: 3296)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !701, file: !702, line: 91, baseType: !392, size: 64, align: 64, offset: 3328)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !701, file: !702, line: 92, baseType: !504, size: 128, align: 64, offset: 3392)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !701, file: !702, line: 93, baseType: !504, size: 128, align: 64, offset: 3520)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !701, file: !702, line: 95, baseType: !230, size: 32, align: 32, offset: 3648)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !701, file: !702, line: 96, baseType: !230, size: 32, align: 32, offset: 3680)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !701, file: !702, line: 97, baseType: !230, size: 32, align: 32, offset: 3712)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !701, file: !702, line: 100, baseType: !392, size: 64, align: 64, offset: 3776)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !701, file: !702, line: 103, baseType: !392, size: 64, align: 64, offset: 3840)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !701, file: !702, line: 106, baseType: !392, size: 64, align: 64, offset: 3904)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !701, file: !702, line: 108, baseType: !492, size: 64, align: 64, offset: 3968)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !701, file: !702, line: 109, baseType: !392, size: 64, align: 64, offset: 4032)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !701, file: !702, line: 111, baseType: !392, size: 64, align: 64, offset: 4096)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !701, file: !702, line: 114, baseType: !215, size: 64, align: 64, offset: 4160)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !701, file: !702, line: 116, baseType: !492, size: 64, align: 64, offset: 4224)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !701, file: !702, line: 117, baseType: !851, size: 32768, align: 64, offset: 4288)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 32768, align: 64, elements: !901)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !853, line: 10, size: 128, align: 64, elements: !854)
!853 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!854 = !{!855, !900}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !852, file: !853, line: 11, baseType: !856, size: 64, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !853, line: 7, baseType: !858)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !860, !220, !219, !219, !243, !431}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !700, line: 7, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !863, line: 15, size: 1600, align: 64, elements: !864)
!863 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !862, file: !549, line: 3, baseType: !230, size: 32, align: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !862, file: !549, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !862, file: !549, line: 5, baseType: !492, size: 64, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !862, file: !549, line: 7, baseType: !215, size: 64, align: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !862, file: !549, line: 8, baseType: !698, size: 64, align: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !862, file: !549, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !862, file: !549, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !862, file: !549, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !862, file: !549, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !862, file: !549, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !862, file: !549, line: 15, baseType: !560, size: 64, align: 64, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !862, file: !549, line: 17, baseType: !580, size: 64, align: 64, offset: 640)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !862, file: !585, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !862, file: !585, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !862, file: !585, line: 7, baseType: !464, size: 64, align: 64, offset: 832)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !862, file: !585, line: 9, baseType: !492, size: 64, align: 64, offset: 896)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !862, file: !585, line: 10, baseType: !590, size: 64, align: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !862, file: !585, line: 12, baseType: !302, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !862, file: !585, line: 13, baseType: !243, size: 64, align: 64, offset: 1088)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !862, file: !585, line: 14, baseType: !230, size: 32, align: 32, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !862, file: !585, line: 15, baseType: !243, size: 64, align: 64, offset: 1216)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !862, file: !585, line: 17, baseType: !302, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !862, file: !585, line: 18, baseType: !302, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !862, file: !585, line: 19, baseType: !302, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !862, file: !585, line: 20, baseType: !302, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !862, file: !585, line: 22, baseType: !302, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !862, file: !585, line: 23, baseType: !302, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !862, file: !585, line: 24, baseType: !302, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !862, file: !585, line: 25, baseType: !302, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !862, file: !585, line: 26, baseType: !302, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !862, file: !585, line: 31, baseType: !629, size: 64, align: 64, offset: 1344)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !862, file: !863, line: 18, baseType: !392, size: 64, align: 64, offset: 1408)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !862, file: !863, line: 20, baseType: !464, size: 64, align: 64, offset: 1472)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !862, file: !863, line: 21, baseType: !230, size: 32, align: 32, offset: 1536)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !862, file: !863, line: 22, baseType: !230, size: 32, align: 32, offset: 1568)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !852, file: !853, line: 12, baseType: !219, size: 8, align: 8, offset: 64)
!901 = !{!902}
!902 = !DISubrange(count: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !701, file: !702, line: 118, baseType: !904, size: 2048, align: 8, offset: 37056)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 2048, align: 8, elements: !901)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !701, file: !702, line: 120, baseType: !660, size: 64, align: 64, offset: 39104)
!906 = !DILocalVariable(name: "server", arg: 1, scope: !695, file: !669, line: 46, type: !698)
!907 = !DIExpression()
!908 = !DILocation(line: 46, column: 43, scope: !695)
!909 = !DILocalVariable(name: "data", arg: 2, scope: !695, file: !669, line: 46, type: !220)
!910 = !DILocation(line: 46, column: 63, scope: !695)
!911 = !DILocalVariable(name: "nick", arg: 3, scope: !695, file: !669, line: 47, type: !220)
!912 = !DILocation(line: 47, column: 18, scope: !695)
!913 = !DILocalVariable(name: "addr", arg: 4, scope: !695, file: !669, line: 47, type: !220)
!914 = !DILocation(line: 47, column: 36, scope: !695)
!915 = !DILocalVariable(name: "params", scope: !695, file: !669, line: 49, type: !243)
!916 = !DILocation(line: 49, column: 8, scope: !695)
!917 = !DILocalVariable(name: "target", scope: !695, file: !669, line: 49, type: !243)
!918 = !DILocation(line: 49, column: 17, scope: !695)
!919 = !DILocalVariable(name: "msg", scope: !695, file: !669, line: 49, type: !243)
!920 = !DILocation(line: 49, column: 26, scope: !695)
!921 = !DILocalVariable(name: "recoded", scope: !695, file: !669, line: 49, type: !243)
!922 = !DILocation(line: 49, column: 32, scope: !695)
!923 = !DILocation(line: 51, column: 2, scope: !695)
!924 = distinct !{!924, !923}
!925 = !DILocation(line: 51, column: 10, scope: !926)
!926 = !DILexicalBlockFile(scope: !927, file: !669, discriminator: 1)
!927 = distinct !DILexicalBlock(scope: !928, file: !669, line: 51, column: 10)
!928 = distinct !DILexicalBlock(scope: !695, file: !669, line: 51, column: 4)
!929 = !DILocation(line: 51, column: 15, scope: !926)
!930 = !DILocation(line: 51, column: 5, scope: !931)
!931 = !DILexicalBlockFile(scope: !932, file: !669, discriminator: 2)
!932 = distinct !DILexicalBlock(scope: !927, file: !669, line: 51, column: 3)
!933 = !DILocation(line: 51, column: 14, scope: !934)
!934 = !DILexicalBlockFile(scope: !935, file: !669, discriminator: 3)
!935 = distinct !DILexicalBlock(scope: !927, file: !669, line: 51, column: 12)
!936 = !DILocation(line: 51, column: 99, scope: !934)
!937 = !DILocation(line: 51, column: 110, scope: !938)
!938 = !DILexicalBlockFile(scope: !928, file: !669, discriminator: 4)
!939 = !DILocation(line: 53, column: 28, scope: !695)
!940 = !DILocation(line: 53, column: 11, scope: !695)
!941 = !DILocation(line: 53, column: 9, scope: !695)
!942 = !DILocation(line: 54, column: 6, scope: !943)
!943 = distinct !DILexicalBlock(scope: !695, file: !669, line: 54, column: 6)
!944 = !DILocation(line: 54, column: 11, scope: !943)
!945 = !DILocation(line: 54, column: 6, scope: !695)
!946 = !DILocation(line: 54, column: 26, scope: !947)
!947 = !DILexicalBlockFile(scope: !943, file: !669, discriminator: 1)
!948 = !DILocation(line: 54, column: 34, scope: !947)
!949 = !DILocation(line: 54, column: 24, scope: !947)
!950 = !DILocation(line: 54, column: 19, scope: !947)
!951 = !DILocation(line: 55, column: 6, scope: !952)
!952 = distinct !DILexicalBlock(scope: !695, file: !669, line: 55, column: 6)
!953 = !DILocation(line: 55, column: 11, scope: !952)
!954 = !DILocation(line: 55, column: 6, scope: !695)
!955 = !DILocation(line: 55, column: 24, scope: !956)
!956 = !DILexicalBlockFile(scope: !952, file: !669, discriminator: 1)
!957 = !DILocation(line: 55, column: 19, scope: !956)
!958 = !DILocation(line: 57, column: 30, scope: !959)
!959 = distinct !DILexicalBlock(scope: !695, file: !669, line: 57, column: 6)
!960 = !DILocation(line: 57, column: 38, scope: !959)
!961 = !DILocation(line: 57, column: 6, scope: !959)
!962 = !DILocation(line: 57, column: 6, scope: !695)
!963 = !DILocalVariable(name: "cleantarget", scope: !964, file: !669, line: 59, type: !220)
!964 = distinct !DILexicalBlock(scope: !959, file: !669, line: 57, column: 47)
!965 = !DILocation(line: 59, column: 15, scope: !964)
!966 = !DILocation(line: 59, column: 52, scope: !964)
