; ModuleID = './line151-modes.o.i'
source_filename = "./line151-modes.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56)
!1 = !DIFile(filename: "line151-modes.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !58, !59, !490, !143, !471, !67, !76, !383, !681, !188, !373}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !61, line: 7, baseType: !62)
!61 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !63, line: 15, size: 1600, align: 64, elements: !64)
!63 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !68, !69, !74, !75, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !66, line: 3, baseType: !67, size: 32, align: 32)
!66 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!67 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !62, file: !66, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !62, file: !66, line: 5, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !72, line: 37, baseType: !73)
!72 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !72, line: 37, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !62, file: !66, line: 7, baseType: !57, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !62, file: !66, line: 8, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !61, line: 6, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !79, line: 42, size: 39168, align: 64, elements: !80)
!79 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!80 = !{!81, !83, !84, !85, !332, !337, !338, !339, !340, !341, !342, !343, !344, !345, !349, !350, !354, !355, !356, !360, !361, !362, !363, !364, !365, !366, !367, !368, !375, !376, !377, !378, !379, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !648, !650}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !82, line: 3, baseType: !67, size: 32, align: 32)
!82 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !78, file: !82, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !78, file: !82, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !78, file: !82, line: 8, baseType: !86, size: 64, align: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !61, line: 5, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !79, line: 24, size: 2496, align: 64, elements: !89)
!89 = !{!90, !92, !93, !94, !97, !98, !99, !100, !101, !103, !104, !105, !106, !107, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !91, line: 3, baseType: !67, size: 32, align: 32)
!91 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !88, file: !91, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !88, file: !91, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !88, file: !91, line: 9, baseType: !95, size: 64, align: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !88, file: !91, line: 10, baseType: !67, size: 32, align: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !88, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !88, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !88, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !88, file: !91, line: 13, baseType: !102, size: 16, align: 16, offset: 448)
!102 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !88, file: !91, line: 14, baseType: !95, size: 64, align: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !88, file: !91, line: 15, baseType: !95, size: 64, align: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !88, file: !91, line: 16, baseType: !67, size: 32, align: 32, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !88, file: !91, line: 17, baseType: !95, size: 64, align: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !88, file: !91, line: 19, baseType: !108, size: 64, align: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !110, line: 99, baseType: !111)
!110 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !110, line: 99, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !88, file: !91, line: 19, baseType: !108, size: 64, align: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !88, file: !91, line: 21, baseType: !95, size: 64, align: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !88, file: !91, line: 22, baseType: !95, size: 64, align: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !88, file: !91, line: 23, baseType: !95, size: 64, align: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !88, file: !91, line: 24, baseType: !95, size: 64, align: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !88, file: !91, line: 26, baseType: !95, size: 64, align: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !88, file: !91, line: 27, baseType: !95, size: 64, align: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !88, file: !91, line: 28, baseType: !95, size: 64, align: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !88, file: !91, line: 29, baseType: !95, size: 64, align: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !88, file: !91, line: 30, baseType: !95, size: 64, align: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !88, file: !91, line: 31, baseType: !95, size: 64, align: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !88, file: !91, line: 32, baseType: !95, size: 64, align: 64, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !88, file: !91, line: 33, baseType: !95, size: 64, align: 64, offset: 1600)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !88, file: !91, line: 35, baseType: !126, size: 64, align: 64, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !129)
!129 = !{!130, !133, !277, !278, !283, !284, !285, !286, !287, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !128, file: !4, line: 100, baseType: !131, size: 32, align: 32)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !132, line: 49, baseType: !67)
!132 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!133 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !128, file: !4, line: 101, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !137)
!137 = !{!138, !162, !168, !175, !179, !264, !268, !273}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !136, file: !4, line: 133, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !126, !143, !145, !148, !149}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !132, line: 46, baseType: !96)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !146, line: 66, baseType: !147)
!146 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!147 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !152, line: 42, baseType: !153)
!152 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !152, line: 44, size: 128, align: 64, elements: !154)
!154 = !{!155, !160, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !153, file: !152, line: 46, baseType: !156, size: 32, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !157, line: 36, baseType: !158)
!157 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !146, line: 45, baseType: !159)
!159 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !153, file: !152, line: 47, baseType: !131, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !153, file: !152, line: 48, baseType: !143, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !136, file: !4, line: 138, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!142, !126, !166, !145, !148, !149}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !136, file: !4, line: 143, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!142, !126, !172, !174, !149}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !146, line: 51, baseType: !173)
!173 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !136, file: !4, line: 147, baseType: !176, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!142, !126, !149}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !136, file: !4, line: 149, baseType: !180, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !126, !263}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !186)
!186 = !{!187, !189, !210, !239, !241, !245, !246, !247, !248, !256, !257, !258, !259}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !185, file: !16, line: 174, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !132, line: 77, baseType: !57)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !185, file: !16, line: 175, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !193)
!193 = !{!194, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !192, file: !16, line: 198, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !188}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !192, file: !16, line: 199, baseType: !195, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !192, file: !16, line: 200, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !188, !183, !203, !209}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !188}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !132, line: 50, baseType: !131)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !185, file: !16, line: 177, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !215)
!215 = !{!216, !221, !225, !229, !233, !234}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !214, file: !16, line: 216, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!208, !183, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !214, file: !16, line: 218, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!208, !183}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !214, file: !16, line: 219, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!208, !183, !204, !188}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !214, file: !16, line: 222, baseType: !230, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !183}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !214, file: !16, line: 226, baseType: !204, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !214, file: !16, line: 227, baseType: !235, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !185, file: !16, line: 178, baseType: !240, size: 32, align: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !132, line: 55, baseType: !159)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !185, file: !16, line: 180, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !185, file: !16, line: 182, baseType: !131, size: 32, align: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !16, line: 183, baseType: !240, size: 32, align: 32, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !185, file: !16, line: 184, baseType: !240, size: 32, align: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !185, file: !16, line: 186, baseType: !249, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !251, line: 37, baseType: !252)
!251 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !251, line: 39, size: 128, align: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !251, line: 41, baseType: !188, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !251, line: 42, baseType: !249, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !16, line: 188, baseType: !183, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !16, line: 189, baseType: !183, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !16, line: 191, baseType: !95, size: 64, align: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !185, file: !16, line: 193, baseType: !260, size: 64, align: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !136, file: !4, line: 151, baseType: !265, size: 64, align: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !126}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !136, file: !4, line: 152, baseType: !269, size: 64, align: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!142, !126, !272, !149}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !136, file: !4, line: 155, baseType: !274, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!272, !126}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !128, file: !4, line: 103, baseType: !143, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !128, file: !4, line: 104, baseType: !279, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !280, line: 77, baseType: !281)
!280 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !280, line: 77, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !128, file: !4, line: 105, baseType: !279, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !128, file: !4, line: 106, baseType: !143, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !128, file: !4, line: 107, baseType: !240, size: 32, align: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !128, file: !4, line: 109, baseType: !145, size: 64, align: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !128, file: !4, line: 110, baseType: !288, size: 64, align: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !290, line: 39, baseType: !291)
!290 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !290, line: 41, size: 192, align: 64, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !291, file: !290, line: 43, baseType: !143, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !291, file: !290, line: 44, baseType: !145, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !291, file: !290, line: 45, baseType: !145, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !128, file: !4, line: 111, baseType: !288, size: 64, align: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !128, file: !4, line: 112, baseType: !288, size: 64, align: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !128, file: !4, line: 113, baseType: !299, size: 48, align: 8, offset: 704)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 48, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 6)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !128, file: !4, line: 117, baseType: !240, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !128, file: !4, line: 118, baseType: !240, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !128, file: !4, line: 119, baseType: !240, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !128, file: !4, line: 120, baseType: !240, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !128, file: !4, line: 121, baseType: !240, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !128, file: !4, line: 122, baseType: !240, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !128, file: !4, line: 124, baseType: !188, size: 64, align: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !128, file: !4, line: 125, baseType: !188, size: 64, align: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !88, file: !91, line: 38, baseType: !159, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !88, file: !91, line: 39, baseType: !159, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !88, file: !91, line: 40, baseType: !159, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !88, file: !91, line: 41, baseType: !159, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !88, file: !91, line: 42, baseType: !159, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !88, file: !91, line: 43, baseType: !159, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !88, file: !91, line: 44, baseType: !159, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !88, file: !91, line: 45, baseType: !159, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !88, file: !91, line: 46, baseType: !95, size: 64, align: 64, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !88, file: !91, line: 47, baseType: !95, size: 64, align: 64, offset: 1856)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !88, file: !79, line: 27, baseType: !95, size: 64, align: 64, offset: 1920)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !88, file: !79, line: 28, baseType: !95, size: 64, align: 64, offset: 1984)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !88, file: !79, line: 30, baseType: !67, size: 32, align: 32, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !88, file: !79, line: 31, baseType: !95, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !88, file: !79, line: 32, baseType: !95, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !88, file: !79, line: 34, baseType: !67, size: 32, align: 32, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !88, file: !79, line: 35, baseType: !67, size: 32, align: 32, offset: 2272)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !88, file: !79, line: 36, baseType: !67, size: 32, align: 32, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !88, file: !79, line: 38, baseType: !67, size: 32, align: 32, offset: 2336)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !88, file: !79, line: 38, baseType: !67, size: 32, align: 32, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !88, file: !79, line: 38, baseType: !67, size: 32, align: 32, offset: 2400)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !88, file: !79, line: 38, baseType: !67, size: 32, align: 32, offset: 2432)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !78, file: !82, line: 9, baseType: !333, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !334, line: 75, baseType: !335)
!334 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !336, line: 139, baseType: !173)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !78, file: !82, line: 10, baseType: !333, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !78, file: !82, line: 12, baseType: !95, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !78, file: !82, line: 13, baseType: !95, size: 64, align: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !78, file: !82, line: 15, baseType: !159, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !78, file: !82, line: 16, baseType: !159, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !78, file: !82, line: 17, baseType: !159, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !78, file: !82, line: 18, baseType: !159, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !78, file: !82, line: 19, baseType: !159, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !78, file: !82, line: 21, baseType: !346, size: 64, align: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !110, line: 102, baseType: !348)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !110, line: 102, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !78, file: !82, line: 22, baseType: !67, size: 32, align: 32, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !78, file: !82, line: 25, baseType: !351, size: 128, align: 64, offset: 640)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, align: 64, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 2)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !78, file: !82, line: 26, baseType: !67, size: 32, align: 32, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !78, file: !82, line: 27, baseType: !67, size: 32, align: 32, offset: 800)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !78, file: !82, line: 29, baseType: !357, size: 64, align: 64, offset: 832)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !110, line: 103, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !110, line: 103, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !78, file: !82, line: 30, baseType: !70, size: 64, align: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !78, file: !82, line: 32, baseType: !95, size: 64, align: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !78, file: !82, line: 33, baseType: !95, size: 64, align: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !78, file: !82, line: 34, baseType: !95, size: 64, align: 64, offset: 1088)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !78, file: !82, line: 35, baseType: !159, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !78, file: !82, line: 36, baseType: !159, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !78, file: !82, line: 37, baseType: !159, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !78, file: !82, line: 38, baseType: !159, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !78, file: !82, line: 40, baseType: !369, size: 128, align: 64, offset: 1216)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !132, line: 504, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !132, line: 506, size: 128, align: 64, elements: !371)
!371 = !{!372, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !370, file: !132, line: 508, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !132, line: 48, baseType: !173)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !370, file: !132, line: 509, baseType: !373, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !78, file: !82, line: 41, baseType: !333, size: 64, align: 64, offset: 1344)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !78, file: !82, line: 42, baseType: !67, size: 32, align: 32, offset: 1408)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !78, file: !82, line: 44, baseType: !249, size: 64, align: 64, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !78, file: !82, line: 45, baseType: !249, size: 64, align: 64, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !78, file: !82, line: 53, baseType: !380, size: 64, align: 64, offset: 1600)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383, !471, !67}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !110, line: 107, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !386, line: 30, size: 2240, align: 64, elements: !387)
!386 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!387 = !{!388, !389, !390, !391, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !467, !473, !477, !481, !486, !564, !571, !575}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !82, line: 3, baseType: !67, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !385, file: !82, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !385, file: !82, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !385, file: !82, line: 8, baseType: !392, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !110, line: 113, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !386, line: 25, size: 1920, align: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !394, file: !91, line: 3, baseType: !67, size: 32, align: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !394, file: !91, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !394, file: !91, line: 6, baseType: !67, size: 32, align: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !394, file: !91, line: 9, baseType: !95, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !394, file: !91, line: 10, baseType: !67, size: 32, align: 32, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !394, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !394, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !394, file: !91, line: 11, baseType: !95, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !394, file: !91, line: 13, baseType: !102, size: 16, align: 16, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !394, file: !91, line: 14, baseType: !95, size: 64, align: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !394, file: !91, line: 15, baseType: !95, size: 64, align: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !394, file: !91, line: 16, baseType: !67, size: 32, align: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !394, file: !91, line: 17, baseType: !95, size: 64, align: 64, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !394, file: !91, line: 19, baseType: !108, size: 64, align: 64, offset: 768)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !394, file: !91, line: 19, baseType: !108, size: 64, align: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !394, file: !91, line: 21, baseType: !95, size: 64, align: 64, offset: 896)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !394, file: !91, line: 22, baseType: !95, size: 64, align: 64, offset: 960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !394, file: !91, line: 23, baseType: !95, size: 64, align: 64, offset: 1024)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !394, file: !91, line: 24, baseType: !95, size: 64, align: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !394, file: !91, line: 26, baseType: !95, size: 64, align: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !394, file: !91, line: 27, baseType: !95, size: 64, align: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !394, file: !91, line: 28, baseType: !95, size: 64, align: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !394, file: !91, line: 29, baseType: !95, size: 64, align: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !394, file: !91, line: 30, baseType: !95, size: 64, align: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !394, file: !91, line: 31, baseType: !95, size: 64, align: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !394, file: !91, line: 32, baseType: !95, size: 64, align: 64, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !394, file: !91, line: 33, baseType: !95, size: 64, align: 64, offset: 1600)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !394, file: !91, line: 35, baseType: !126, size: 64, align: 64, offset: 1664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !394, file: !91, line: 38, baseType: !159, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !394, file: !91, line: 39, baseType: !159, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !394, file: !91, line: 40, baseType: !159, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !394, file: !91, line: 41, baseType: !159, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !394, file: !91, line: 42, baseType: !159, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !394, file: !91, line: 43, baseType: !159, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !394, file: !91, line: 44, baseType: !159, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !394, file: !91, line: 45, baseType: !159, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !394, file: !91, line: 46, baseType: !95, size: 64, align: 64, offset: 1792)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !394, file: !91, line: 47, baseType: !95, size: 64, align: 64, offset: 1856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !385, file: !82, line: 9, baseType: !333, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !385, file: !82, line: 10, baseType: !333, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !385, file: !82, line: 12, baseType: !95, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !385, file: !82, line: 13, baseType: !95, size: 64, align: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !385, file: !82, line: 15, baseType: !159, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !385, file: !82, line: 16, baseType: !159, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !385, file: !82, line: 17, baseType: !159, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !385, file: !82, line: 18, baseType: !159, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !385, file: !82, line: 19, baseType: !159, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !385, file: !82, line: 21, baseType: !346, size: 64, align: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !385, file: !82, line: 22, baseType: !67, size: 32, align: 32, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !385, file: !82, line: 25, baseType: !351, size: 128, align: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !385, file: !82, line: 26, baseType: !67, size: 32, align: 32, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !385, file: !82, line: 27, baseType: !67, size: 32, align: 32, offset: 800)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !385, file: !82, line: 29, baseType: !357, size: 64, align: 64, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !385, file: !82, line: 30, baseType: !70, size: 64, align: 64, offset: 896)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !385, file: !82, line: 32, baseType: !95, size: 64, align: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !385, file: !82, line: 33, baseType: !95, size: 64, align: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !385, file: !82, line: 34, baseType: !95, size: 64, align: 64, offset: 1088)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !385, file: !82, line: 35, baseType: !159, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !385, file: !82, line: 36, baseType: !159, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !385, file: !82, line: 37, baseType: !159, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !385, file: !82, line: 38, baseType: !159, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !385, file: !82, line: 40, baseType: !369, size: 128, align: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !385, file: !82, line: 41, baseType: !333, size: 64, align: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !385, file: !82, line: 42, baseType: !67, size: 32, align: 32, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !385, file: !82, line: 44, baseType: !249, size: 64, align: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !385, file: !82, line: 45, baseType: !249, size: 64, align: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !385, file: !82, line: 53, baseType: !380, size: 64, align: 64, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !385, file: !82, line: 55, baseType: !464, size: 64, align: 64, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!67, !383, !96}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !385, file: !82, line: 57, baseType: !468, size: 64, align: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!67, !383, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !385, file: !82, line: 60, baseType: !474, size: 64, align: 64, offset: 1792)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!471, !383}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !385, file: !82, line: 62, baseType: !478, size: 64, align: 64, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !383, !471, !471, !67}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !385, file: !82, line: 65, baseType: !482, size: 64, align: 64, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !383, !471, !471}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !385, file: !82, line: 69, baseType: !487, size: 64, align: 64, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !383, !471}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !110, line: 109, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !493, line: 15, size: 1408, align: 64, elements: !494)
!493 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !512, !516, !518, !519, !520, !521, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !492, file: !66, line: 3, baseType: !67, size: 32, align: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !492, file: !66, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !492, file: !66, line: 5, baseType: !70, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !492, file: !66, line: 7, baseType: !57, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !492, file: !66, line: 8, baseType: !383, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !492, file: !66, line: 9, baseType: !95, size: 64, align: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !66, line: 10, baseType: !95, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !492, file: !66, line: 11, baseType: !333, size: 64, align: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !492, file: !66, line: 12, baseType: !67, size: 32, align: 32, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !492, file: !66, line: 13, baseType: !95, size: 64, align: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !492, file: !66, line: 15, baseType: !506, size: 64, align: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !110, line: 108, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !110, line: 108, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !492, file: !66, line: 17, baseType: !513, size: 64, align: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!471, !509}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !492, file: !517, line: 5, baseType: !95, size: 64, align: 64, offset: 704)
!517 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!518 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !492, file: !517, line: 6, baseType: !95, size: 64, align: 64, offset: 768)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !492, file: !517, line: 7, baseType: !333, size: 64, align: 64, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !492, file: !517, line: 9, baseType: !70, size: 64, align: 64, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !492, file: !517, line: 10, baseType: !522, size: 64, align: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !110, line: 111, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !525, line: 13, size: 576, align: 64, elements: !526)
!525 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!526 = !{!527, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !545, !546}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !524, file: !528, line: 3, baseType: !67, size: 32, align: 32)
!528 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!529 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !524, file: !528, line: 4, baseType: !67, size: 32, align: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !524, file: !528, line: 6, baseType: !333, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !524, file: !528, line: 8, baseType: !95, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !524, file: !528, line: 9, baseType: !95, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !524, file: !528, line: 10, baseType: !95, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !524, file: !528, line: 11, baseType: !67, size: 32, align: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !524, file: !528, line: 14, baseType: !159, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !524, file: !528, line: 15, baseType: !159, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !524, file: !528, line: 18, baseType: !159, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !524, file: !528, line: 19, baseType: !159, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !524, file: !528, line: 20, baseType: !159, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !524, file: !528, line: 21, baseType: !159, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !524, file: !528, line: 22, baseType: !542, size: 64, align: 8, offset: 360)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, align: 8, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 8)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !524, file: !528, line: 26, baseType: !57, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !528, line: 28, baseType: !522, size: 64, align: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !492, file: !517, line: 12, baseType: !159, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !492, file: !517, line: 13, baseType: !95, size: 64, align: 64, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !492, file: !517, line: 14, baseType: !67, size: 32, align: 32, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !492, file: !517, line: 15, baseType: !95, size: 64, align: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !492, file: !517, line: 17, baseType: !159, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !492, file: !517, line: 18, baseType: !159, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !492, file: !517, line: 19, baseType: !159, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !492, file: !517, line: 20, baseType: !159, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !492, file: !517, line: 22, baseType: !159, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !492, file: !517, line: 23, baseType: !159, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !492, file: !517, line: 24, baseType: !159, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !492, file: !517, line: 25, baseType: !159, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !492, file: !517, line: 26, baseType: !159, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !492, file: !517, line: 31, baseType: !561, size: 64, align: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!95, !490}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !385, file: !82, line: 70, baseType: !565, size: 64, align: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !383, !471}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !110, line: 110, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !110, line: 110, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !385, file: !82, line: 71, baseType: !572, size: 64, align: 64, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!67, !471, !471}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !385, file: !82, line: 73, baseType: !572, size: 64, align: 64, offset: 2176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !78, file: !82, line: 55, baseType: !464, size: 64, align: 64, offset: 1664)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !78, file: !82, line: 57, baseType: !468, size: 64, align: 64, offset: 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !78, file: !82, line: 60, baseType: !474, size: 64, align: 64, offset: 1792)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !78, file: !82, line: 62, baseType: !478, size: 64, align: 64, offset: 1856)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !78, file: !82, line: 65, baseType: !482, size: 64, align: 64, offset: 1920)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !78, file: !82, line: 69, baseType: !487, size: 64, align: 64, offset: 1984)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !78, file: !82, line: 70, baseType: !565, size: 64, align: 64, offset: 2048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !78, file: !82, line: 71, baseType: !572, size: 64, align: 64, offset: 2112)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !78, file: !82, line: 73, baseType: !572, size: 64, align: 64, offset: 2176)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !78, file: !79, line: 46, baseType: !249, size: 64, align: 64, offset: 2240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !78, file: !79, line: 47, baseType: !249, size: 64, align: 64, offset: 2304)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !78, file: !79, line: 48, baseType: !588, size: 64, align: 64, offset: 2368)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !61, line: 8, baseType: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !61, line: 8, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !78, file: !79, line: 49, baseType: !249, size: 64, align: 64, offset: 2432)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !78, file: !79, line: 51, baseType: !95, size: 64, align: 64, offset: 2496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !78, file: !79, line: 53, baseType: !95, size: 64, align: 64, offset: 2560)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !78, file: !79, line: 54, baseType: !95, size: 64, align: 64, offset: 2624)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !78, file: !79, line: 55, baseType: !95, size: 64, align: 64, offset: 2688)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !78, file: !79, line: 56, baseType: !95, size: 64, align: 64, offset: 2752)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !78, file: !79, line: 57, baseType: !67, size: 32, align: 32, offset: 2816)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !78, file: !79, line: 59, baseType: !159, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !78, file: !79, line: 60, baseType: !159, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !78, file: !79, line: 62, baseType: !159, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !78, file: !79, line: 63, baseType: !159, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !78, file: !79, line: 64, baseType: !159, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !78, file: !79, line: 65, baseType: !159, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !78, file: !79, line: 66, baseType: !159, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !78, file: !79, line: 67, baseType: !159, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !78, file: !79, line: 68, baseType: !159, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !78, file: !79, line: 69, baseType: !159, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !78, file: !79, line: 70, baseType: !159, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !78, file: !79, line: 71, baseType: !159, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !78, file: !79, line: 72, baseType: !159, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !78, file: !79, line: 74, baseType: !67, size: 32, align: 32, offset: 2880)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !78, file: !79, line: 75, baseType: !67, size: 32, align: 32, offset: 2912)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !78, file: !79, line: 76, baseType: !67, size: 32, align: 32, offset: 2944)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !78, file: !79, line: 77, baseType: !67, size: 32, align: 32, offset: 2976)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !78, file: !79, line: 79, baseType: !70, size: 64, align: 64, offset: 3008)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !78, file: !79, line: 80, baseType: !249, size: 64, align: 64, offset: 3072)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !78, file: !79, line: 81, baseType: !249, size: 64, align: 64, offset: 3136)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !78, file: !79, line: 83, baseType: !288, size: 64, align: 64, offset: 3200)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !78, file: !79, line: 84, baseType: !240, size: 32, align: 32, offset: 3264)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !78, file: !79, line: 87, baseType: !67, size: 32, align: 32, offset: 3296)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !78, file: !79, line: 91, baseType: !249, size: 64, align: 64, offset: 3328)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !78, file: !79, line: 92, baseType: !369, size: 128, align: 64, offset: 3392)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !78, file: !79, line: 93, baseType: !369, size: 128, align: 64, offset: 3520)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !78, file: !79, line: 95, baseType: !67, size: 32, align: 32, offset: 3648)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !78, file: !79, line: 96, baseType: !67, size: 32, align: 32, offset: 3680)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !78, file: !79, line: 97, baseType: !67, size: 32, align: 32, offset: 3712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !78, file: !79, line: 100, baseType: !249, size: 64, align: 64, offset: 3776)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !78, file: !79, line: 103, baseType: !249, size: 64, align: 64, offset: 3840)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !78, file: !79, line: 106, baseType: !249, size: 64, align: 64, offset: 3904)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !78, file: !79, line: 108, baseType: !70, size: 64, align: 64, offset: 3968)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !78, file: !79, line: 109, baseType: !249, size: 64, align: 64, offset: 4032)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !78, file: !79, line: 111, baseType: !249, size: 64, align: 64, offset: 4096)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !78, file: !79, line: 114, baseType: !57, size: 64, align: 64, offset: 4160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !78, file: !79, line: 116, baseType: !70, size: 64, align: 64, offset: 4224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !78, file: !79, line: 117, baseType: !636, size: 32768, align: 64, offset: 4288)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 32768, align: 64, elements: !646)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !638, line: 10, size: 128, align: 64, elements: !639)
!638 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!639 = !{!640, !645}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !637, file: !638, line: 11, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !638, line: 7, baseType: !643)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !59, !471, !96, !96, !95, !288}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !637, file: !638, line: 12, baseType: !96, size: 8, align: 8, offset: 64)
!646 = !{!647}
!647 = !DISubrange(count: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !78, file: !79, line: 118, baseType: !649, size: 2048, align: 8, offset: 37056)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, align: 8, elements: !646)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !78, file: !79, line: 120, baseType: !572, size: 64, align: 64, offset: 39104)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !62, file: !66, line: 9, baseType: !95, size: 64, align: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !66, line: 10, baseType: !95, size: 64, align: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !62, file: !66, line: 11, baseType: !333, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !62, file: !66, line: 12, baseType: !67, size: 32, align: 32, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !62, file: !66, line: 13, baseType: !95, size: 64, align: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !62, file: !66, line: 15, baseType: !506, size: 64, align: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !62, file: !66, line: 17, baseType: !513, size: 64, align: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !62, file: !517, line: 5, baseType: !95, size: 64, align: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !62, file: !517, line: 6, baseType: !95, size: 64, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !62, file: !517, line: 7, baseType: !333, size: 64, align: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !62, file: !517, line: 9, baseType: !70, size: 64, align: 64, offset: 896)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !62, file: !517, line: 10, baseType: !522, size: 64, align: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !62, file: !517, line: 12, baseType: !159, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !62, file: !517, line: 13, baseType: !95, size: 64, align: 64, offset: 1088)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !62, file: !517, line: 14, baseType: !67, size: 32, align: 32, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !62, file: !517, line: 15, baseType: !95, size: 64, align: 64, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !62, file: !517, line: 17, baseType: !159, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !62, file: !517, line: 18, baseType: !159, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !62, file: !517, line: 19, baseType: !159, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !62, file: !517, line: 20, baseType: !159, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !62, file: !517, line: 22, baseType: !159, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !62, file: !517, line: 23, baseType: !159, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !62, file: !517, line: 24, baseType: !159, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !62, file: !517, line: 25, baseType: !159, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !62, file: !517, line: 26, baseType: !159, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !62, file: !517, line: 31, baseType: !561, size: 64, align: 64, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !62, file: !63, line: 18, baseType: !249, size: 64, align: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !62, file: !63, line: 20, baseType: !333, size: 64, align: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !62, file: !63, line: 21, baseType: !67, size: 32, align: 32, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !62, file: !63, line: 22, baseType: !67, size: 32, align: 32, offset: 1568)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !682, line: 9, baseType: !683)
!682 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !686, !686, !686, !686, !686, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!688 = !{i32 2, !"Dwarf Version", i32 4}
!689 = !{i32 2, !"Debug Info Version", i32 3}
!690 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!691 = distinct !DISubprogram(name: "prefix_add", scope: !692, file: !692, line: 62, type: !693, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !695)
!692 = !DIFile(filename: "modes.c", directory: "/home/lichi/Desktop/irssi/task1")
!693 = !DISubroutineType(types: !694)
!694 = !{null, !95, !96, !383}
!695 = !{}
!696 = !DILocalVariable(name: "prefixes", arg: 1, scope: !691, file: !692, line: 62, type: !95)
!697 = !DIExpression()
!698 = !DILocation(line: 62, column: 22, scope: !691)
!699 = !DILocalVariable(name: "newprefix", arg: 2, scope: !691, file: !692, line: 62, type: !96)
!700 = !DILocation(line: 62, column: 43, scope: !691)
!701 = !DILocalVariable(name: "server", arg: 3, scope: !691, file: !692, line: 62, type: !383)
!702 = !DILocation(line: 62, column: 66, scope: !691)
!703 = !DILocalVariable(name: "prefixlst", scope: !691, file: !692, line: 64, type: !471)
!704 = !DILocation(line: 64, column: 14, scope: !691)
!705 = !DILocalVariable(name: "newprefixes", scope: !691, file: !692, line: 65, type: !542)
!706 = !DILocation(line: 65, column: 7, scope: !691)
!707 = !DILocalVariable(name: "newpos", scope: !691, file: !692, line: 66, type: !159)
!708 = !DILocation(line: 66, column: 15, scope: !691)
!709 = !DILocalVariable(name: "oldpos", scope: !691, file: !692, line: 67, type: !159)
!710 = !DILocation(line: 67, column: 15, scope: !691)
!711 = !DILocation(line: 69, column: 14, scope: !691)
!712 = !DILocation(line: 69, column: 22, scope: !691)
!713 = !DILocation(line: 69, column: 37, scope: !691)
!714 = !DILocation(line: 69, column: 12, scope: !691)
!715 = !DILocation(line: 74, column: 2, scope: !691)
!716 = !DILocation(line: 74, column: 10, scope: !717)
!717 = !DILexicalBlockFile(scope: !691, file: !692, discriminator: 1)
!718 = !DILocation(line: 74, column: 9, scope: !717)
!719 = !DILocation(line: 74, column: 20, scope: !717)
!720 = !DILocation(line: 74, column: 28, scope: !717)
!721 = !DILocation(line: 74, column: 40, scope: !722)
!722 = !DILexicalBlockFile(scope: !691, file: !692, discriminator: 2)
!723 = !DILocation(line: 74, column: 31, scope: !722)
!724 = !DILocation(line: 74, column: 48, scope: !722)
!725 = !DILocation(line: 74, column: 56, scope: !722)
!726 = !DILocation(line: 75, column: 4, scope: !691)
!727 = !DILocation(line: 75, column: 11, scope: !691)
!728 = !DILocation(line: 74, column: 2, scope: !729)
!729 = !DILexicalBlockFile(scope: !691, file: !692, discriminator: 3)
!730 = !DILocation(line: 76, column: 16, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !692, line: 76, column: 7)
!732 = distinct !DILexicalBlock(scope: !691, file: !692, line: 75, column: 20)
!733 = !DILocation(line: 76, column: 7, scope: !731)
!734 = !DILocation(line: 76, column: 27, scope: !731)
!735 = !DILocation(line: 76, column: 24, scope: !731)
!736 = !DILocation(line: 76, column: 7, scope: !732)
!737 = !DILocation(line: 77, column: 4, scope: !731)
!738 = !DILocation(line: 79, column: 8, scope: !739)
!739 = distinct !DILexicalBlock(scope: !732, file: !692, line: 79, column: 7)
!740 = !DILocation(line: 79, column: 7, scope: !739)
