; ModuleID = './line320-fe-netsplit.o.i'
source_filename = "./line320-fe-netsplit.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 25, size: 32, align: 32, elements: !194)
!193 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!195 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!196 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!197 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!198 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!199 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!200 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!201 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!202 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!203 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!204 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!205 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!206 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!207 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!208 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!209 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!210 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!211 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!212 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!213 = !{!214, !221, !222, !231, !535, !297, !623, !858, !862, !866, !875, !230, !525, !885}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !215, line: 9, baseType: !216)
!215 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !219, !219, !219, !219, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !230}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !227, line: 50, baseType: !228)
!227 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !227, line: 49, baseType: !229)
!229 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !227, line: 77, baseType: !221)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !233, line: 6, baseType: !234)
!233 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !235, line: 42, size: 39168, align: 64, elements: !236)
!235 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!236 = !{!237, !239, !240, !241, !480, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !502, !503, !504, !508, !513, !514, !515, !516, !517, !518, !519, !520, !527, !528, !529, !530, !531, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !855, !857}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !238, line: 3, baseType: !229, size: 32, align: 32)
!238 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !234, file: !238, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !234, file: !238, line: 6, baseType: !229, size: 32, align: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !234, file: !238, line: 8, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !233, line: 5, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !235, line: 24, size: 2496, align: 64, elements: !245)
!245 = !{!246, !248, !249, !250, !253, !254, !255, !256, !257, !259, !260, !261, !262, !263, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !247, line: 3, baseType: !229, size: 32, align: 32)
!247 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !244, file: !247, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !244, file: !247, line: 6, baseType: !229, size: 32, align: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !244, file: !247, line: 9, baseType: !251, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !244, file: !247, line: 10, baseType: !229, size: 32, align: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !244, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !244, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !244, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !244, file: !247, line: 13, baseType: !258, size: 16, align: 16, offset: 448)
!258 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !244, file: !247, line: 14, baseType: !251, size: 64, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !244, file: !247, line: 15, baseType: !251, size: 64, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !244, file: !247, line: 16, baseType: !229, size: 32, align: 32, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !244, file: !247, line: 17, baseType: !251, size: 64, align: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !244, file: !247, line: 19, baseType: !264, size: 64, align: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !266, line: 99, baseType: !267)
!266 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !266, line: 99, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !244, file: !247, line: 19, baseType: !264, size: 64, align: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !244, file: !247, line: 21, baseType: !251, size: 64, align: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !244, file: !247, line: 22, baseType: !251, size: 64, align: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !244, file: !247, line: 23, baseType: !251, size: 64, align: 64, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !244, file: !247, line: 24, baseType: !251, size: 64, align: 64, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !244, file: !247, line: 26, baseType: !251, size: 64, align: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !244, file: !247, line: 27, baseType: !251, size: 64, align: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !244, file: !247, line: 28, baseType: !251, size: 64, align: 64, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !244, file: !247, line: 29, baseType: !251, size: 64, align: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !244, file: !247, line: 30, baseType: !251, size: 64, align: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !244, file: !247, line: 31, baseType: !251, size: 64, align: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !244, file: !247, line: 32, baseType: !251, size: 64, align: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !244, file: !247, line: 33, baseType: !251, size: 64, align: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !244, file: !247, line: 35, baseType: !282, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !285)
!285 = !{!286, !287, !425, !426, !431, !432, !433, !434, !435, !444, !445, !446, !450, !451, !452, !453, !454, !455, !456, !457}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !284, file: !4, line: 100, baseType: !228, size: 32, align: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !284, file: !4, line: 101, baseType: !288, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !291)
!291 = !{!292, !316, !322, !329, !333, !412, !416, !421}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !290, file: !4, line: 133, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!296, !282, !297, !299, !302, !303}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !227, line: 46, baseType: !252)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !300, line: 66, baseType: !301)
!300 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!301 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !306, line: 42, baseType: !307)
!306 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !306, line: 44, size: 128, align: 64, elements: !308)
!308 = !{!309, !314, !315}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !307, file: !306, line: 46, baseType: !310, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !311, line: 36, baseType: !312)
!311 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !300, line: 45, baseType: !313)
!313 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !307, file: !306, line: 47, baseType: !228, size: 32, align: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !307, file: !306, line: 48, baseType: !297, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !290, file: !4, line: 138, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!296, !282, !320, !299, !302, !303}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !290, file: !4, line: 143, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!296, !282, !326, !328, !303}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !300, line: 51, baseType: !327)
!327 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !290, file: !4, line: 147, baseType: !330, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!296, !282, !303}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !290, file: !4, line: 149, baseType: !334, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !282, !411}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !340)
!340 = !{!341, !342, !358, !387, !389, !393, !394, !395, !396, !404, !405, !406, !407}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !339, file: !16, line: 174, baseType: !230, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !339, file: !16, line: 175, baseType: !343, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !346)
!346 = !{!347, !351, !352}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !345, file: !16, line: 198, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !230}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !345, file: !16, line: 199, baseType: !348, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !345, file: !16, line: 200, baseType: !353, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !230, !337, !356, !357}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !339, file: !16, line: 177, baseType: !359, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !363)
!363 = !{!364, !369, !373, !377, !381, !382}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !362, file: !16, line: 216, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!226, !337, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !362, file: !16, line: 218, baseType: !370, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!226, !337}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !362, file: !16, line: 219, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!226, !337, !222, !230}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !362, file: !16, line: 222, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !337}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !362, file: !16, line: 226, baseType: !222, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !362, file: !16, line: 227, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !339, file: !16, line: 178, baseType: !388, size: 32, align: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !227, line: 55, baseType: !313)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !339, file: !16, line: 180, baseType: !390, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !339, file: !16, line: 182, baseType: !228, size: 32, align: 32, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !16, line: 183, baseType: !388, size: 32, align: 32, offset: 352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !339, file: !16, line: 184, baseType: !388, size: 32, align: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !339, file: !16, line: 186, baseType: !397, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !399, line: 37, baseType: !400)
!399 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !399, line: 39, size: 128, align: 64, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !400, file: !399, line: 41, baseType: !230, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !399, line: 42, baseType: !397, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !16, line: 188, baseType: !337, size: 64, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !16, line: 189, baseType: !337, size: 64, align: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !16, line: 191, baseType: !251, size: 64, align: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !339, file: !16, line: 193, baseType: !408, size: 64, align: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !290, file: !4, line: 151, baseType: !413, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !282}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !290, file: !4, line: 152, baseType: !417, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!296, !282, !420, !303}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !290, file: !4, line: 155, baseType: !422, size: 64, align: 64, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!420, !282}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !284, file: !4, line: 103, baseType: !297, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !284, file: !4, line: 104, baseType: !427, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !428, line: 77, baseType: !429)
!428 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !428, line: 77, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !284, file: !4, line: 105, baseType: !427, size: 64, align: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !284, file: !4, line: 106, baseType: !297, size: 64, align: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !284, file: !4, line: 107, baseType: !388, size: 32, align: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !284, file: !4, line: 109, baseType: !299, size: 64, align: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !284, file: !4, line: 110, baseType: !436, size: 64, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !438, line: 39, baseType: !439)
!438 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !438, line: 41, size: 192, align: 64, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !439, file: !438, line: 43, baseType: !297, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !439, file: !438, line: 44, baseType: !299, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !439, file: !438, line: 45, baseType: !299, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !284, file: !4, line: 111, baseType: !436, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !284, file: !4, line: 112, baseType: !436, size: 64, align: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !284, file: !4, line: 113, baseType: !447, size: 48, align: 8, offset: 704)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 48, align: 8, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 6)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !284, file: !4, line: 117, baseType: !388, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !284, file: !4, line: 118, baseType: !388, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !284, file: !4, line: 119, baseType: !388, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !284, file: !4, line: 120, baseType: !388, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !284, file: !4, line: 121, baseType: !388, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !284, file: !4, line: 122, baseType: !388, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !284, file: !4, line: 124, baseType: !230, size: 64, align: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !284, file: !4, line: 125, baseType: !230, size: 64, align: 64, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !244, file: !247, line: 38, baseType: !313, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !244, file: !247, line: 39, baseType: !313, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !244, file: !247, line: 40, baseType: !313, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !244, file: !247, line: 41, baseType: !313, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !244, file: !247, line: 42, baseType: !313, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !244, file: !247, line: 43, baseType: !313, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !244, file: !247, line: 44, baseType: !313, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !244, file: !247, line: 45, baseType: !313, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !244, file: !247, line: 46, baseType: !251, size: 64, align: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !244, file: !247, line: 47, baseType: !251, size: 64, align: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !244, file: !235, line: 27, baseType: !251, size: 64, align: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !244, file: !235, line: 28, baseType: !251, size: 64, align: 64, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !244, file: !235, line: 30, baseType: !229, size: 32, align: 32, offset: 2048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !244, file: !235, line: 31, baseType: !251, size: 64, align: 64, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !244, file: !235, line: 32, baseType: !251, size: 64, align: 64, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !244, file: !235, line: 34, baseType: !229, size: 32, align: 32, offset: 2240)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !244, file: !235, line: 35, baseType: !229, size: 32, align: 32, offset: 2272)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !244, file: !235, line: 36, baseType: !229, size: 32, align: 32, offset: 2304)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !244, file: !235, line: 38, baseType: !229, size: 32, align: 32, offset: 2336)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !244, file: !235, line: 38, baseType: !229, size: 32, align: 32, offset: 2368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !244, file: !235, line: 38, baseType: !229, size: 32, align: 32, offset: 2400)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !244, file: !235, line: 38, baseType: !229, size: 32, align: 32, offset: 2432)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !234, file: !238, line: 9, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !482, line: 75, baseType: !483)
!482 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !484, line: 139, baseType: !327)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !234, file: !238, line: 10, baseType: !481, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !234, file: !238, line: 12, baseType: !251, size: 64, align: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !234, file: !238, line: 13, baseType: !251, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !234, file: !238, line: 15, baseType: !313, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !234, file: !238, line: 16, baseType: !313, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !234, file: !238, line: 17, baseType: !313, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !234, file: !238, line: 18, baseType: !313, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !234, file: !238, line: 19, baseType: !313, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !234, file: !238, line: 21, baseType: !494, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !266, line: 102, baseType: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !266, line: 102, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !234, file: !238, line: 22, baseType: !229, size: 32, align: 32, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !234, file: !238, line: 25, baseType: !499, size: 128, align: 64, offset: 640)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, align: 64, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !234, file: !238, line: 26, baseType: !229, size: 32, align: 32, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !234, file: !238, line: 27, baseType: !229, size: 32, align: 32, offset: 800)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !234, file: !238, line: 29, baseType: !505, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !266, line: 103, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !266, line: 103, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !234, file: !238, line: 30, baseType: !509, size: 64, align: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !511, line: 37, baseType: !512)
!511 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !511, line: 37, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !234, file: !238, line: 32, baseType: !251, size: 64, align: 64, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !234, file: !238, line: 33, baseType: !251, size: 64, align: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !234, file: !238, line: 34, baseType: !251, size: 64, align: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !234, file: !238, line: 35, baseType: !313, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !234, file: !238, line: 36, baseType: !313, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !234, file: !238, line: 37, baseType: !313, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !234, file: !238, line: 38, baseType: !313, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !234, file: !238, line: 40, baseType: !521, size: 128, align: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !227, line: 504, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !227, line: 506, size: 128, align: 64, elements: !523)
!523 = !{!524, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !522, file: !227, line: 508, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !227, line: 48, baseType: !327)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !522, file: !227, line: 509, baseType: !525, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !234, file: !238, line: 41, baseType: !481, size: 64, align: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !234, file: !238, line: 42, baseType: !229, size: 32, align: 32, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !234, file: !238, line: 44, baseType: !397, size: 64, align: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !234, file: !238, line: 45, baseType: !397, size: 64, align: 64, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !234, file: !238, line: 53, baseType: !532, size: 64, align: 64, offset: 1600)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535, !623, !229}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !266, line: 107, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !538, line: 30, size: 2240, align: 64, elements: !539)
!538 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!539 = !{!540, !541, !542, !543, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !625, !629, !633, !638, !731, !738, !742}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !238, line: 3, baseType: !229, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !537, file: !238, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !537, file: !238, line: 6, baseType: !229, size: 32, align: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !537, file: !238, line: 8, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !266, line: 113, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !538, line: 25, size: 1920, align: 64, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !247, line: 3, baseType: !229, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !546, file: !247, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !546, file: !247, line: 6, baseType: !229, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !546, file: !247, line: 9, baseType: !251, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !546, file: !247, line: 10, baseType: !229, size: 32, align: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !546, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !546, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !546, file: !247, line: 11, baseType: !251, size: 64, align: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !546, file: !247, line: 13, baseType: !258, size: 16, align: 16, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !546, file: !247, line: 14, baseType: !251, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !546, file: !247, line: 15, baseType: !251, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !546, file: !247, line: 16, baseType: !229, size: 32, align: 32, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !546, file: !247, line: 17, baseType: !251, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !546, file: !247, line: 19, baseType: !264, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !546, file: !247, line: 19, baseType: !264, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !546, file: !247, line: 21, baseType: !251, size: 64, align: 64, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !546, file: !247, line: 22, baseType: !251, size: 64, align: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !546, file: !247, line: 23, baseType: !251, size: 64, align: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !546, file: !247, line: 24, baseType: !251, size: 64, align: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !546, file: !247, line: 26, baseType: !251, size: 64, align: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !546, file: !247, line: 27, baseType: !251, size: 64, align: 64, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !546, file: !247, line: 28, baseType: !251, size: 64, align: 64, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !546, file: !247, line: 29, baseType: !251, size: 64, align: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !546, file: !247, line: 30, baseType: !251, size: 64, align: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !546, file: !247, line: 31, baseType: !251, size: 64, align: 64, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !546, file: !247, line: 32, baseType: !251, size: 64, align: 64, offset: 1536)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !546, file: !247, line: 33, baseType: !251, size: 64, align: 64, offset: 1600)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !546, file: !247, line: 35, baseType: !282, size: 64, align: 64, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !546, file: !247, line: 38, baseType: !313, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !546, file: !247, line: 39, baseType: !313, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !546, file: !247, line: 40, baseType: !313, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !546, file: !247, line: 41, baseType: !313, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !546, file: !247, line: 42, baseType: !313, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !546, file: !247, line: 43, baseType: !313, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !546, file: !247, line: 44, baseType: !313, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !546, file: !247, line: 45, baseType: !313, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !546, file: !247, line: 46, baseType: !251, size: 64, align: 64, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !546, file: !247, line: 47, baseType: !251, size: 64, align: 64, offset: 1856)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !537, file: !238, line: 9, baseType: !481, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !537, file: !238, line: 10, baseType: !481, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !537, file: !238, line: 12, baseType: !251, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !537, file: !238, line: 13, baseType: !251, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !537, file: !238, line: 15, baseType: !313, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !537, file: !238, line: 16, baseType: !313, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !537, file: !238, line: 17, baseType: !313, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !537, file: !238, line: 18, baseType: !313, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !537, file: !238, line: 19, baseType: !313, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !537, file: !238, line: 21, baseType: !494, size: 64, align: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !537, file: !238, line: 22, baseType: !229, size: 32, align: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !537, file: !238, line: 25, baseType: !499, size: 128, align: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !537, file: !238, line: 26, baseType: !229, size: 32, align: 32, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !537, file: !238, line: 27, baseType: !229, size: 32, align: 32, offset: 800)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !537, file: !238, line: 29, baseType: !505, size: 64, align: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !537, file: !238, line: 30, baseType: !509, size: 64, align: 64, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !537, file: !238, line: 32, baseType: !251, size: 64, align: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !537, file: !238, line: 33, baseType: !251, size: 64, align: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !537, file: !238, line: 34, baseType: !251, size: 64, align: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !537, file: !238, line: 35, baseType: !313, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !537, file: !238, line: 36, baseType: !313, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !537, file: !238, line: 37, baseType: !313, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !537, file: !238, line: 38, baseType: !313, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !537, file: !238, line: 40, baseType: !521, size: 128, align: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !537, file: !238, line: 41, baseType: !481, size: 64, align: 64, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !537, file: !238, line: 42, baseType: !229, size: 32, align: 32, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !537, file: !238, line: 44, baseType: !397, size: 64, align: 64, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !537, file: !238, line: 45, baseType: !397, size: 64, align: 64, offset: 1536)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !537, file: !238, line: 53, baseType: !532, size: 64, align: 64, offset: 1600)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !537, file: !238, line: 55, baseType: !616, size: 64, align: 64, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!229, !535, !252}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !537, file: !238, line: 57, baseType: !620, size: 64, align: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!229, !535, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !537, file: !238, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!623, !535}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !537, file: !238, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !535, !623, !623, !229}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !537, file: !238, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !535, !623, !623}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !537, file: !238, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !535, !623}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !266, line: 109, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !645, line: 15, size: 1408, align: 64, elements: !646)
!645 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!646 = !{!647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !682, !683, !685, !686, !687, !688, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !648, line: 3, baseType: !229, size: 32, align: 32)
!648 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !644, file: !648, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !644, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !644, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !644, file: !648, line: 8, baseType: !535, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !644, file: !648, line: 9, baseType: !251, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !648, line: 10, baseType: !251, size: 64, align: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !644, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !644, file: !648, line: 12, baseType: !229, size: 32, align: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !644, file: !648, line: 13, baseType: !251, size: 64, align: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !644, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !266, line: 108, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !665, line: 5, size: 704, align: 64, elements: !666)
!665 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !648, line: 3, baseType: !229, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !664, file: !648, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !664, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !664, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !664, file: !648, line: 8, baseType: !535, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !664, file: !648, line: 9, baseType: !251, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !648, line: 10, baseType: !251, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !664, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !664, file: !648, line: 12, baseType: !229, size: 32, align: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !664, file: !648, line: 13, baseType: !251, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !664, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !664, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!623, !662}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !644, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !644, file: !684, line: 5, baseType: !251, size: 64, align: 64, offset: 704)
!684 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !644, file: !684, line: 6, baseType: !251, size: 64, align: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !644, file: !684, line: 7, baseType: !481, size: 64, align: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !644, file: !684, line: 9, baseType: !509, size: 64, align: 64, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !644, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !266, line: 111, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !692, line: 13, size: 576, align: 64, elements: !693)
!692 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!693 = !{!694, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !712, !713}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !695, line: 3, baseType: !229, size: 32, align: 32)
!695 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !691, file: !695, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !691, file: !695, line: 6, baseType: !481, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !691, file: !695, line: 8, baseType: !251, size: 64, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !691, file: !695, line: 9, baseType: !251, size: 64, align: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !691, file: !695, line: 10, baseType: !251, size: 64, align: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !691, file: !695, line: 11, baseType: !229, size: 32, align: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !691, file: !695, line: 14, baseType: !313, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !691, file: !695, line: 15, baseType: !313, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !691, file: !695, line: 18, baseType: !313, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !691, file: !695, line: 19, baseType: !313, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !691, file: !695, line: 20, baseType: !313, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !691, file: !695, line: 21, baseType: !313, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !691, file: !695, line: 22, baseType: !709, size: 64, align: 8, offset: 360)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, align: 8, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !691, file: !695, line: 26, baseType: !221, size: 64, align: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !695, line: 28, baseType: !689, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !644, file: !684, line: 12, baseType: !313, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !644, file: !684, line: 13, baseType: !251, size: 64, align: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !644, file: !684, line: 14, baseType: !229, size: 32, align: 32, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !644, file: !684, line: 15, baseType: !251, size: 64, align: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !644, file: !684, line: 17, baseType: !313, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !644, file: !684, line: 18, baseType: !313, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !644, file: !684, line: 19, baseType: !313, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !644, file: !684, line: 20, baseType: !313, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !644, file: !684, line: 22, baseType: !313, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !644, file: !684, line: 23, baseType: !313, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !644, file: !684, line: 24, baseType: !313, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !644, file: !684, line: 25, baseType: !313, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !644, file: !684, line: 26, baseType: !313, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !644, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!251, !642}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !537, file: !238, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !535, !623}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !266, line: 110, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !266, line: 110, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !537, file: !238, line: 71, baseType: !739, size: 64, align: 64, offset: 2112)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64, align: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!229, !623, !623}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !537, file: !238, line: 73, baseType: !739, size: 64, align: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !234, file: !238, line: 55, baseType: !616, size: 64, align: 64, offset: 1664)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !234, file: !238, line: 57, baseType: !620, size: 64, align: 64, offset: 1728)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !234, file: !238, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !234, file: !238, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !234, file: !238, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !234, file: !238, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !234, file: !238, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !234, file: !238, line: 71, baseType: !739, size: 64, align: 64, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !234, file: !238, line: 73, baseType: !739, size: 64, align: 64, offset: 2176)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !234, file: !235, line: 46, baseType: !397, size: 64, align: 64, offset: 2240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !234, file: !235, line: 47, baseType: !397, size: 64, align: 64, offset: 2304)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !234, file: !235, line: 48, baseType: !755, size: 64, align: 64, offset: 2368)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !233, line: 8, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !233, line: 8, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !234, file: !235, line: 49, baseType: !397, size: 64, align: 64, offset: 2432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !234, file: !235, line: 51, baseType: !251, size: 64, align: 64, offset: 2496)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !234, file: !235, line: 53, baseType: !251, size: 64, align: 64, offset: 2560)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !234, file: !235, line: 54, baseType: !251, size: 64, align: 64, offset: 2624)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !234, file: !235, line: 55, baseType: !251, size: 64, align: 64, offset: 2688)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !234, file: !235, line: 56, baseType: !251, size: 64, align: 64, offset: 2752)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !234, file: !235, line: 57, baseType: !229, size: 32, align: 32, offset: 2816)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !234, file: !235, line: 59, baseType: !313, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !234, file: !235, line: 60, baseType: !313, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !234, file: !235, line: 62, baseType: !313, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !234, file: !235, line: 63, baseType: !313, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !234, file: !235, line: 64, baseType: !313, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !234, file: !235, line: 65, baseType: !313, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !234, file: !235, line: 66, baseType: !313, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !234, file: !235, line: 67, baseType: !313, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !234, file: !235, line: 68, baseType: !313, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !234, file: !235, line: 69, baseType: !313, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !234, file: !235, line: 70, baseType: !313, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !234, file: !235, line: 71, baseType: !313, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !234, file: !235, line: 72, baseType: !313, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !234, file: !235, line: 74, baseType: !229, size: 32, align: 32, offset: 2880)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !234, file: !235, line: 75, baseType: !229, size: 32, align: 32, offset: 2912)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !234, file: !235, line: 76, baseType: !229, size: 32, align: 32, offset: 2944)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !234, file: !235, line: 77, baseType: !229, size: 32, align: 32, offset: 2976)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !234, file: !235, line: 79, baseType: !509, size: 64, align: 64, offset: 3008)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !234, file: !235, line: 80, baseType: !397, size: 64, align: 64, offset: 3072)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !234, file: !235, line: 81, baseType: !397, size: 64, align: 64, offset: 3136)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !234, file: !235, line: 83, baseType: !436, size: 64, align: 64, offset: 3200)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !234, file: !235, line: 84, baseType: !388, size: 32, align: 32, offset: 3264)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !234, file: !235, line: 87, baseType: !229, size: 32, align: 32, offset: 3296)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !234, file: !235, line: 91, baseType: !397, size: 64, align: 64, offset: 3328)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !234, file: !235, line: 92, baseType: !521, size: 128, align: 64, offset: 3392)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !234, file: !235, line: 93, baseType: !521, size: 128, align: 64, offset: 3520)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !234, file: !235, line: 95, baseType: !229, size: 32, align: 32, offset: 3648)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !234, file: !235, line: 96, baseType: !229, size: 32, align: 32, offset: 3680)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !234, file: !235, line: 97, baseType: !229, size: 32, align: 32, offset: 3712)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !234, file: !235, line: 100, baseType: !397, size: 64, align: 64, offset: 3776)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !234, file: !235, line: 103, baseType: !397, size: 64, align: 64, offset: 3840)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !234, file: !235, line: 106, baseType: !397, size: 64, align: 64, offset: 3904)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !234, file: !235, line: 108, baseType: !509, size: 64, align: 64, offset: 3968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !234, file: !235, line: 109, baseType: !397, size: 64, align: 64, offset: 4032)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !234, file: !235, line: 111, baseType: !397, size: 64, align: 64, offset: 4096)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !234, file: !235, line: 114, baseType: !221, size: 64, align: 64, offset: 4160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !234, file: !235, line: 116, baseType: !509, size: 64, align: 64, offset: 4224)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !234, file: !235, line: 117, baseType: !803, size: 32768, align: 64, offset: 4288)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 32768, align: 64, elements: !853)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !805, line: 10, size: 128, align: 64, elements: !806)
!805 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!806 = !{!807, !852}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !804, file: !805, line: 11, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !805, line: 7, baseType: !810)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !812, !623, !252, !252, !251, !436}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !233, line: 7, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !815, line: 15, size: 1600, align: 64, elements: !816)
!815 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !814, file: !648, line: 3, baseType: !229, size: 32, align: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !814, file: !648, line: 4, baseType: !229, size: 32, align: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !814, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !814, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !814, file: !648, line: 8, baseType: !231, size: 64, align: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !814, file: !648, line: 9, baseType: !251, size: 64, align: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !648, line: 10, baseType: !251, size: 64, align: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !814, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !814, file: !648, line: 12, baseType: !229, size: 32, align: 32, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !814, file: !648, line: 13, baseType: !251, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !814, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !814, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !814, file: !684, line: 5, baseType: !251, size: 64, align: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !814, file: !684, line: 6, baseType: !251, size: 64, align: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !814, file: !684, line: 7, baseType: !481, size: 64, align: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !814, file: !684, line: 9, baseType: !509, size: 64, align: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !814, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !814, file: !684, line: 12, baseType: !313, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !814, file: !684, line: 13, baseType: !251, size: 64, align: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !814, file: !684, line: 14, baseType: !229, size: 32, align: 32, offset: 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !814, file: !684, line: 15, baseType: !251, size: 64, align: 64, offset: 1216)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !814, file: !684, line: 17, baseType: !313, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !814, file: !684, line: 18, baseType: !313, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !814, file: !684, line: 19, baseType: !313, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !814, file: !684, line: 20, baseType: !313, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !814, file: !684, line: 22, baseType: !313, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !814, file: !684, line: 23, baseType: !313, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !814, file: !684, line: 24, baseType: !313, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !814, file: !684, line: 25, baseType: !313, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !814, file: !684, line: 26, baseType: !313, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !814, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !814, file: !815, line: 18, baseType: !397, size: 64, align: 64, offset: 1408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !814, file: !815, line: 20, baseType: !481, size: 64, align: 64, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !814, file: !815, line: 21, baseType: !229, size: 32, align: 32, offset: 1536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !814, file: !815, line: 22, baseType: !229, size: 32, align: 32, offset: 1568)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !804, file: !805, line: 12, baseType: !252, size: 8, align: 8, offset: 64)
!853 = !{!854}
!854 = !DISubrange(count: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !234, file: !235, line: 118, baseType: !856, size: 2048, align: 8, offset: 37056)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 2048, align: 8, elements: !853)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !234, file: !235, line: 120, baseType: !739, size: 64, align: 64, offset: 39104)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !227, line: 91, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !230, !230, !230}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !227, line: 88, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !230, !230}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEMP_SPLIT_CHAN_REC", file: !868, line: 59, baseType: !869)
!868 = !DIFile(filename: "fe-netsplit.c", directory: "/home/lichi/Desktop/irssi/task1")
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !868, line: 55, size: 192, align: 64, elements: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !868, line: 56, baseType: !251, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "nick_count", scope: !869, file: !868, line: 57, baseType: !229, size: 32, align: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "maxnickpos", scope: !869, file: !868, line: 57, baseType: !229, size: 32, align: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !869, file: !868, line: 58, baseType: !436, size: 64, align: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "NETSPLIT_SERVER_REC", file: !877, line: 13, baseType: !878)
!877 = !DIFile(filename: "../../../src/irc/core/netsplit.h", directory: "/home/lichi/Desktop/irssi/task1")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !877, line: 6, size: 256, align: 64, elements: !879)
!879 = !{!880, !881, !882, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !878, file: !877, line: 7, baseType: !251, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "destserver", scope: !878, file: !877, line: 8, baseType: !251, size: 64, align: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !878, file: !877, line: 9, baseType: !229, size: 32, align: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prints", scope: !878, file: !877, line: 10, baseType: !229, size: 32, align: 32, offset: 160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !878, file: !877, line: 12, baseType: !481, size: 64, align: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !227, line: 80, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64, align: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!228, !889, !889}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !227, line: 78, baseType: !219)
!890 = !{!891, !892, !893, !894}
!891 = distinct !DIGlobalVariable(name: "split_tag", scope: !0, file: !868, line: 36, type: !229, isLocal: true, isDefinition: true, variable: i32* @split_tag)
!892 = distinct !DIGlobalVariable(name: "printing_splits", scope: !0, file: !868, line: 38, type: !229, isLocal: true, isDefinition: true, variable: i32* @printing_splits)
!893 = distinct !DIGlobalVariable(name: "netsplit_max_nicks", scope: !0, file: !868, line: 37, type: !229, isLocal: true, isDefinition: true, variable: i32* @netsplit_max_nicks)
!894 = distinct !DIGlobalVariable(name: "netsplit_nicks_hide_threshold", scope: !0, file: !868, line: 37, type: !229, isLocal: true, isDefinition: true, variable: i32* @netsplit_nicks_hide_threshold)
!895 = !{i32 2, !"Dwarf Version", i32 4}
!896 = !{i32 2, !"Debug Info Version", i32 3}
!897 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!898 = distinct !DISubprogram(name: "fe_netsplit_init", scope: !868, file: !868, line: 366, type: !385, isLocal: false, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!899 = !{}
!900 = !DILocation(line: 368, column: 2, scope: !898)
!901 = !DILocation(line: 369, column: 2, scope: !898)
!902 = !DILocation(line: 370, column: 12, scope: !898)
!903 = !DILocation(line: 371, column: 18, scope: !898)
!904 = !DILocation(line: 373, column: 2, scope: !898)
!905 = !DILocation(line: 374, column: 2, scope: !898)
!906 = !DILocation(line: 375, column: 2, scope: !898)
!907 = !DILocation(line: 376, column: 53, scope: !898)
!908 = !DILocation(line: 376, column: 2, scope: !909)
!909 = !DILexicalBlockFile(scope: !898, file: !868, discriminator: 1)
!910 = !DILocation(line: 377, column: 1, scope: !898)
!911 = distinct !DISubprogram(name: "read_settings", scope: !868, file: !868, line: 357, type: !385, isLocal: true, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!912 = !DILocation(line: 359, column: 30, scope: !911)
!913 = !DILocation(line: 359, column: 28, scope: !911)
!914 = !DILocation(line: 361, column: 3, scope: !911)
!915 = !DILocation(line: 360, column: 32, scope: !911)
!916 = !DILocation(line: 362, column: 6, scope: !917)
!917 = distinct !DILexicalBlock(scope: !911, file: !868, line: 362, column: 6)
!918 = !DILocation(line: 362, column: 38, scope: !917)
!919 = !DILocation(line: 362, column: 36, scope: !917)
!920 = !DILocation(line: 362, column: 6, scope: !911)
!921 = !DILocation(line: 363, column: 24, scope: !917)
!922 = !DILocation(line: 363, column: 22, scope: !917)
!923 = !DILocation(line: 363, column: 3, scope: !917)
!924 = !DILocation(line: 364, column: 1, scope: !911)
!925 = distinct !DISubprogram(name: "sig_netsplit_servers", scope: !868, file: !868, line: 296, type: !385, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!926 = !DILocation(line: 298, column: 6, scope: !927)
!927 = distinct !DILexicalBlock(scope: !925, file: !868, line: 298, column: 6)
!928 = !DILocation(line: 298, column: 47, scope: !927)
!929 = !DILocation(line: 298, column: 50, scope: !930)
!930 = !DILexicalBlockFile(scope: !927, file: !868, discriminator: 1)
!931 = !DILocation(line: 298, column: 60, scope: !930)
!932 = !DILocation(line: 298, column: 6, scope: !930)
!933 = !DILocation(line: 299, column: 15, scope: !934)
!934 = distinct !DILexicalBlock(scope: !927, file: !868, line: 298, column: 67)
!935 = !DILocation(line: 299, column: 13, scope: !934)
!936 = !DILocation(line: 302, column: 3, scope: !934)
!937 = !DILocation(line: 303, column: 2, scope: !934)
!938 = !DILocation(line: 304, column: 1, scope: !925)
!939 = distinct !DISubprogram(name: "cmd_netsplit", scope: !868, file: !868, line: 335, type: !940, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !623, !231}
!942 = !DILocalVariable(name: "data", arg: 1, scope: !939, file: !868, line: 335, type: !623)
!943 = !DIExpression()
!944 = !DILocation(line: 335, column: 38, scope: !939)
!945 = !DILocalVariable(name: "server", arg: 2, scope: !939, file: !868, line: 335, type: !231)
!946 = !DILocation(line: 335, column: 60, scope: !939)
!947 = !DILocalVariable(name: "list", scope: !939, file: !868, line: 337, type: !397)
!948 = !DILocation(line: 337, column: 10, scope: !939)
!949 = !DILocation(line: 339, column: 9, scope: !939)
!950 = distinct !{!950, !949}
!951 = !DILocation(line: 339, column: 18, scope: !952)
!952 = !DILexicalBlockFile(scope: !953, file: !868, discriminator: 1)
!953 = distinct !DILexicalBlock(scope: !954, file: !868, line: 339, column: 18)
!954 = distinct !DILexicalBlock(scope: !939, file: !868, line: 339, column: 12)
!955 = !DILocation(line: 339, column: 25, scope: !952)
!956 = !DILocation(line: 339, column: 8, scope: !952)
!957 = !DILocation(line: 339, column: 92, scope: !958)
!958 = !DILexicalBlockFile(scope: !953, file: !868, discriminator: 2)
!959 = !DILocation(line: 339, column: 74, scope: !958)
!960 = !DILocation(line: 339, column: 59, scope: !958)
!961 = !DILocation(line: 339, column: 58, scope: !958)
!962 = !DILocation(line: 339, column: 33, scope: !963)
!963 = !DILexicalBlockFile(scope: !958, file: !868, discriminator: 12)
!964 = !DILocation(line: 339, column: 14, scope: !958)
!965 = !DILocation(line: 339, column: 18, scope: !958)
!966 = !DILocation(line: 339, column: 13, scope: !967)
!967 = !DILexicalBlockFile(scope: !953, file: !868, discriminator: 3)
!968 = !DILocation(line: 339, column: 18, scope: !969)
!969 = !DILexicalBlockFile(scope: !954, file: !868, discriminator: 4)
!970 = !DILocation(line: 339, column: 35, scope: !971)
!971 = !DILexicalBlockFile(scope: !953, file: !868, discriminator: 5)
!972 = !DILocation(line: 339, column: 47, scope: !973)
!973 = !DILexicalBlockFile(scope: !974, file: !868, discriminator: 6)
!974 = distinct !DILexicalBlock(scope: !954, file: !868, line: 339, column: 47)
!975 = !DILocation(line: 339, column: 54, scope: !973)
!976 = !DILocation(line: 339, column: 8, scope: !973)
!977 = !DILocation(line: 339, column: 13, scope: !978)
!978 = !DILexicalBlockFile(scope: !974, file: !868, discriminator: 7)
!979 = !DILocation(line: 339, column: 22, scope: !978)
!980 = !DILocation(line: 339, column: 12, scope: !978)
!981 = !DILocation(line: 339, column: 47, scope: !978)
!982 = !DILocation(line: 339, column: 33, scope: !983)
!983 = !DILexicalBlockFile(scope: !974, file: !868, discriminator: 8)
!984 = distinct !{!984, !985}
!985 = !DILocation(line: 339, column: 33, scope: !974)
!986 = !DILocation(line: 339, column: 38, scope: !987)
!987 = !DILexicalBlockFile(scope: !988, file: !868, discriminator: 9)
!988 = distinct !DILexicalBlock(scope: !974, file: !868, line: 339, column: 36)
!989 = !DILocation(line: 339, column: 116, scope: !990)
!990 = !DILexicalBlockFile(scope: !987, file: !868, discriminator: 13)
!991 = !DILocation(line: 339, column: 131, scope: !987)
!992 = !DILocation(line: 339, column: 139, scope: !993)
!993 = !DILexicalBlockFile(scope: !988, file: !868, discriminator: 10)
!994 = !DILocation(line: 339, column: 152, scope: !995)
!995 = !DILexicalBlockFile(scope: !954, file: !868, discriminator: 11)
!996 = !DILocation(line: 341, column: 6, scope: !997)
!997 = distinct !DILexicalBlock(scope: !939, file: !868, line: 341, column: 6)
!998 = !DILocation(line: 341, column: 14, scope: !997)
!999 = !DILocation(line: 341, column: 28, scope: !997)
!1000 = !DILocation(line: 341, column: 6, scope: !939)
!1001 = !DILocation(line: 342, column: 39, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !997, file: !868, line: 341, column: 36)
!1003 = !DILocation(line: 342, column: 3, scope: !1002)
!1004 = !DILocation(line: 344, column: 3, scope: !1002)
!1005 = !DILocation(line: 347, column: 38, scope: !939)
!1006 = !DILocation(line: 347, column: 2, scope: !939)
!1007 = !DILocation(line: 349, column: 14, scope: !939)
!1008 = !DILocation(line: 350, column: 23, scope: !939)
!1009 = !DILocation(line: 350, column: 31, scope: !939)
!1010 = !DILocation(line: 350, column: 59, scope: !939)
!1011 = !DILocation(line: 350, column: 2, scope: !939)
!1012 = !DILocation(line: 351, column: 18, scope: !939)
!1013 = !DILocation(line: 351, column: 45, scope: !939)
!1014 = !DILocation(line: 351, column: 2, scope: !939)
!1015 = !DILocation(line: 352, column: 22, scope: !939)
!1016 = !DILocation(line: 352, column: 9, scope: !939)
!1017 = !DILocation(line: 354, column: 38, scope: !939)
!1018 = !DILocation(line: 354, column: 2, scope: !939)
!1019 = !DILocation(line: 355, column: 1, scope: !939)
!1020 = !DILocation(line: 355, column: 1, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !939, file: !868, discriminator: 1)
!1022 = distinct !DISubprogram(name: "fe_netsplit_deinit", scope: !868, file: !868, line: 379, type: !385, isLocal: false, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!1023 = !DILocation(line: 381, column: 6, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1022, file: !868, line: 381, column: 6)
!1025 = !DILocation(line: 381, column: 16, scope: !1024)
!1026 = !DILocation(line: 381, column: 6, scope: !1022)
!1027 = !DILocation(line: 382, column: 19, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1024, file: !868, line: 381, column: 23)
!1029 = !DILocation(line: 382, column: 3, scope: !1028)
!1030 = !DILocation(line: 383, column: 3, scope: !1028)
!1031 = !DILocation(line: 384, column: 2, scope: !1028)
!1032 = !DILocation(line: 386, column: 2, scope: !1022)
!1033 = !DILocation(line: 387, column: 2, scope: !1022)
!1034 = !DILocation(line: 388, column: 2, scope: !1022)
!1035 = !DILocation(line: 389, column: 1, scope: !1022)
!1036 = distinct !DISubprogram(name: "sig_print_starting", scope: !868, file: !868, line: 248, type: !1037, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !899)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !1041, line: 62, baseType: !1042)
!1041 = !DIFile(filename: "../../../src/fe-common/core/formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !1041, line: 50, size: 576, align: 64, elements: !1043)
!1043 = !{!1044, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1042, file: !1041, line: 51, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !266, line: 117, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !1048, line: 28, size: 1280, align: 64, elements: !1049)
