; ModuleID = './line55-net-nonblock.o.i'
source_filename = "./line55-net-nonblock.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }
%struct._GSourceFuncs = type { i32 (%struct._GSource*, i32*)*, i32 (%struct._GSource*)*, i32 (%struct._GSource*, i32 (i8*)*, i8*)*, void (%struct._GSource*)*, i32 (i8*)*, void ()* }
%struct._GMainContext = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GSourcePrivate = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47)
!1 = !DIFile(filename: "line55-net-nonblock.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !{!48, !49, !53, !55, !289}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIMPLE_THREAD_REC", file: !57, line: 36, baseType: !58)
!57 = !DIFile(filename: "net-nonblock.c", directory: "/home/lichi/Desktop/irssi/task1")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 28, size: 448, align: 64, elements: !59)
!59 = !{!60, !249, !250, !254, !255, !288}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !58, file: !57, line: 29, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_CALLBACK", file: !62, line: 24, baseType: !63)
!62 = !DIFile(filename: "net-nonblock.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !48}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !69)
!69 = !{!70, !73, !216, !217, !222, !223, !224, !225, !226, !235, !236, !237, !241, !242, !243, !244, !245, !246, !247, !248}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !68, file: !4, line: 100, baseType: !71, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !51, line: 49, baseType: !72)
!72 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !68, file: !4, line: 101, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !77)
!77 = !{!78, !100, !106, !113, !117, !203, !207, !212}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !76, file: !4, line: 133, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!82, !66, !49, !83, !86, !87}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !84, line: 66, baseType: !85)
!84 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!85 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !90, line: 42, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !90, line: 44, size: 128, align: 64, elements: !92)
!92 = !{!93, !98, !99}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !91, file: !90, line: 46, baseType: !94, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !95, line: 36, baseType: !96)
!95 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !84, line: 45, baseType: !97)
!97 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !91, file: !90, line: 47, baseType: !71, size: 32, align: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !91, file: !90, line: 48, baseType: !49, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !76, file: !4, line: 138, baseType: !101, size: 64, align: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!82, !66, !104, !83, !86, !87}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !76, file: !4, line: 143, baseType: !107, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!82, !66, !110, !112, !87}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !84, line: 51, baseType: !111)
!111 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !76, file: !4, line: 147, baseType: !114, size: 64, align: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!82, !66, !87}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !76, file: !4, line: 149, baseType: !118, size: 64, align: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !66, !202}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !124)
!124 = !{!125, !127, !148, !177, !179, !183, !184, !185, !186, !194, !195, !196, !198}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !123, file: !16, line: 174, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !51, line: 77, baseType: !48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !123, file: !16, line: 175, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !131)
!131 = !{!132, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !130, file: !16, line: 198, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !126}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !130, file: !16, line: 199, baseType: !133, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !130, file: !16, line: 200, baseType: !138, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !126, !121, !141, !147}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !126}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !51, line: 50, baseType: !71)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !123, file: !16, line: 177, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !153)
!153 = !{!154, !159, !163, !167, !171, !172}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !152, file: !16, line: 216, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!146, !121, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !152, file: !16, line: 218, baseType: !160, size: 64, align: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!146, !121}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !152, file: !16, line: 219, baseType: !164, size: 64, align: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!146, !121, !142, !126}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !152, file: !16, line: 222, baseType: !168, size: 64, align: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !121}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !152, file: !16, line: 226, baseType: !142, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !152, file: !16, line: 227, baseType: !173, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !123, file: !16, line: 178, baseType: !178, size: 32, align: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !51, line: 55, baseType: !97)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !123, file: !16, line: 180, baseType: !180, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !123, file: !16, line: 182, baseType: !71, size: 32, align: 32, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !16, line: 183, baseType: !178, size: 32, align: 32, offset: 352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !123, file: !16, line: 184, baseType: !178, size: 32, align: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !123, file: !16, line: 186, baseType: !187, size: 64, align: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !189, line: 37, baseType: !190)
!189 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !189, line: 39, size: 128, align: 64, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !189, line: 41, baseType: !126, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !189, line: 42, baseType: !187, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !16, line: 188, baseType: !121, size: 64, align: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !16, line: 189, baseType: !121, size: 64, align: 64, offset: 576)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !16, line: 191, baseType: !197, size: 64, align: 64, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !123, file: !16, line: 193, baseType: !199, size: 64, align: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !201)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !76, file: !4, line: 151, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !66}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !76, file: !4, line: 152, baseType: !208, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!82, !66, !211, !87}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !76, file: !4, line: 155, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!211, !66}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !68, file: !4, line: 103, baseType: !49, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !68, file: !4, line: 104, baseType: !218, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !219, line: 77, baseType: !220)
!219 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !219, line: 77, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !68, file: !4, line: 105, baseType: !218, size: 64, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !68, file: !4, line: 106, baseType: !49, size: 64, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !68, file: !4, line: 107, baseType: !178, size: 32, align: 32, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !68, file: !4, line: 109, baseType: !83, size: 64, align: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !68, file: !4, line: 110, baseType: !227, size: 64, align: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !229, line: 39, baseType: !230)
!229 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !229, line: 41, size: 192, align: 64, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !230, file: !229, line: 43, baseType: !49, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !230, file: !229, line: 44, baseType: !83, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !230, file: !229, line: 45, baseType: !83, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !68, file: !4, line: 111, baseType: !227, size: 64, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !68, file: !4, line: 112, baseType: !227, size: 64, align: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !68, file: !4, line: 113, baseType: !238, size: 48, align: 8, offset: 704)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 48, align: 8, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 6)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !68, file: !4, line: 117, baseType: !178, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !68, file: !4, line: 118, baseType: !178, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !68, file: !4, line: 119, baseType: !178, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !68, file: !4, line: 120, baseType: !178, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !68, file: !4, line: 121, baseType: !178, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !68, file: !4, line: 122, baseType: !178, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !68, file: !4, line: 124, baseType: !126, size: 64, align: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !68, file: !4, line: 125, baseType: !126, size: 64, align: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !58, file: !57, line: 30, baseType: !48, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pipes", scope: !58, file: !57, line: 32, baseType: !251, size: 128, align: 64, offset: 128)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, align: 64, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !58, file: !57, line: 33, baseType: !72, size: 32, align: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "my_ip", scope: !58, file: !57, line: 34, baseType: !256, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !258, line: 99, baseType: !259)
!258 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !260, line: 22, size: 160, align: 32, elements: !261)
!260 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !259, file: !260, line: 23, baseType: !263, size: 16, align: 16)
!263 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !259, file: !260, line: 24, baseType: !265, size: 128, align: 32, offset: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !266, line: 211, size: 128, align: 32, elements: !267)
!266 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !265, file: !266, line: 220, baseType: !269, size: 128, align: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !265, file: !266, line: 213, size: 128, align: 32, elements: !270)
!270 = !{!271, !278, !283}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !269, file: !266, line: 215, baseType: !272, size: 128, align: 8)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 128, align: 8, elements: !276)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !274, line: 48, baseType: !275)
!274 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!276 = !{!277}
!277 = !DISubrange(count: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !269, file: !266, line: 217, baseType: !279, size: 128, align: 16)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, align: 16, elements: !281)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !274, line: 49, baseType: !263)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !269, file: !266, line: 218, baseType: !284, size: 128, align: 32)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 128, align: 32, elements: !286)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !274, line: 51, baseType: !97)
!286 = !{!287}
!287 = !DISubrange(count: 4)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !58, file: !57, line: 35, baseType: !72, size: 32, align: 32, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !258, line: 60, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !48, !66, !72}
!293 = !{i32 2, !"Dwarf Version", i32 4}
!294 = !{i32 2, !"Debug Info Version", i32 3}
!295 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!296 = distinct !DISubprogram(name: "net_gethostbyname_nonblock", scope: !57, file: !57, line: 40, type: !297, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !299)
!297 = !DISubroutineType(types: !298)
!298 = !{!72, !53, !66, !72}
!299 = !{}
!300 = !DILocalVariable(name: "addr", arg: 1, scope: !296, file: !57, line: 40, type: !53)
!301 = !DIExpression()
!302 = !DILocation(line: 40, column: 44, scope: !296)
!303 = !DILocalVariable(name: "pipe", arg: 2, scope: !296, file: !57, line: 40, type: !66)
!304 = !DILocation(line: 40, column: 62, scope: !296)
!305 = !DILocalVariable(name: "reverse_lookup", arg: 3, scope: !296, file: !57, line: 41, type: !72)
!306 = !DILocation(line: 41, column: 15, scope: !296)
!307 = !DILocalVariable(name: "rec", scope: !296, file: !57, line: 43, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESOLVED_IP_REC", file: !62, line: 13, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 6, size: 576, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ip4", scope: !309, file: !62, line: 7, baseType: !257, size: 160, align: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ip6", scope: !309, file: !62, line: 7, baseType: !257, size: 160, align: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !309, file: !62, line: 8, baseType: !72, size: 32, align: 32, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "errlen", scope: !309, file: !62, line: 9, baseType: !72, size: 32, align: 32, offset: 352)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "errorstr", scope: !309, file: !62, line: 10, baseType: !197, size: 64, align: 64, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "host4", scope: !309, file: !62, line: 12, baseType: !197, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "host6", scope: !309, file: !62, line: 12, baseType: !197, size: 64, align: 64, offset: 512)
!318 = !DILocation(line: 43, column: 18, scope: !296)
!319 = !DILocalVariable(name: "errorstr", scope: !296, file: !57, line: 44, type: !53)
!320 = !DILocation(line: 44, column: 14, scope: !296)
!321 = !DILocalVariable(name: "pid", scope: !296, file: !57, line: 45, type: !72)
!322 = !DILocation(line: 45, column: 6, scope: !296)
!323 = !DILocalVariable(name: "len", scope: !296, file: !57, line: 46, type: !72)
!324 = !DILocation(line: 46, column: 6, scope: !296)
!325 = !DILocation(line: 48, column: 2, scope: !296)
!326 = distinct !{!326, !325}
!327 = !DILocation(line: 48, column: 10, scope: !328)
!328 = !DILexicalBlockFile(scope: !329, file: !57, discriminator: 1)
!329 = distinct !DILexicalBlock(scope: !330, file: !57, line: 48, column: 10)
!330 = distinct !DILexicalBlock(scope: !296, file: !57, line: 48, column: 4)
!331 = !DILocation(line: 48, column: 15, scope: !328)
!332 = !DILocation(line: 48, column: 5, scope: !333)
!333 = !DILexicalBlockFile(scope: !334, file: !57, discriminator: 2)
!334 = distinct !DILexicalBlock(scope: !329, file: !57, line: 48, column: 3)
!335 = !DILocation(line: 48, column: 14, scope: !336)
!336 = !DILexicalBlockFile(scope: !337, file: !57, discriminator: 3)
!337 = distinct !DILexicalBlock(scope: !329, file: !57, line: 48, column: 12)
!338 = !DILocation(line: 48, column: 99, scope: !336)
!339 = !DILocation(line: 48, column: 116, scope: !340)
!340 = !DILexicalBlockFile(scope: !330, file: !57, discriminator: 4)
!341 = !DILocation(line: 50, column: 8, scope: !296)
!342 = !DILocation(line: 50, column: 6, scope: !296)
!343 = !DILocation(line: 51, column: 6, scope: !344)
!344 = distinct !DILexicalBlock(scope: !296, file: !57, line: 51, column: 6)
!345 = !DILocation(line: 51, column: 10, scope: !344)
!346 = !DILocation(line: 51, column: 6, scope: !296)
!347 = !DILocation(line: 53, column: 15, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !57, line: 51, column: 15)
!349 = !DILocation(line: 53, column: 3, scope: !348)
!350 = !DILocation(line: 54, column: 10, scope: !348)
!351 = !DILocation(line: 54, column: 3, scope: !348)
!352 = !DILocation(line: 57, column: 6, scope: !353)
!353 = distinct !DILexicalBlock(scope: !296, file: !57, line: 57, column: 6)
!354 = !DILocation(line: 57, column: 10, scope: !353)
!355 = !DILocation(line: 57, column: 6, scope: !296)
!356 = !DILocation(line: 59, column: 3, scope: !357)
!357 = distinct !DILexicalBlock(scope: !353, file: !57, line: 57, column: 16)
!358 = !DILocation(line: 61, column: 2, scope: !357)
!359 = !DILocation(line: 64, column: 8, scope: !296)
!360 = !DILocation(line: 64, column: 2, scope: !361)
!361 = !DILexicalBlockFile(scope: !296, file: !57, discriminator: 1)
!362 = !DILocation(line: 66, column: 9, scope: !296)
!363 = !DILocation(line: 67, column: 32, scope: !296)
!364 = !DILocation(line: 67, column: 43, scope: !296)
!365 = !DILocation(line: 67, column: 53, scope: !296)
!366 = !DILocation(line: 67, column: 14, scope: !296)
!367 = !DILocation(line: 67, column: 6, scope: !296)
!368 = !DILocation(line: 67, column: 12, scope: !296)
!369 = !DILocation(line: 68, column: 10, scope: !370)
!370 = distinct !DILexicalBlock(scope: !296, file: !57, line: 68, column: 6)
!371 = !DILocation(line: 68, column: 16, scope: !370)
!372 = !DILocation(line: 68, column: 6, scope: !296)
!373 = !DILocation(line: 69, column: 12, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !57, line: 68, column: 22)
!375 = !DILocation(line: 70, column: 7, scope: !376)
!376 = distinct !DILexicalBlock(scope: !374, file: !57, line: 70, column: 7)
!377 = !DILocation(line: 70, column: 7, scope: !374)
!378 = !DILocation(line: 72, column: 12, scope: !379)
!379 = distinct !DILexicalBlock(scope: !380, file: !57, line: 72, column: 8)
!380 = distinct !DILexicalBlock(scope: !376, file: !57, line: 70, column: 23)
!381 = !DILocation(line: 72, column: 16, scope: !379)
!382 = !DILocation(line: 72, column: 8, scope: !379)
!383 = !DILocation(line: 72, column: 23, scope: !379)
!384 = !DILocation(line: 72, column: 8, scope: !380)
!385 = !DILocation(line: 73, column: 28, scope: !379)
!386 = !DILocation(line: 73, column: 38, scope: !379)
!387 = !DILocation(line: 73, column: 5, scope: !379)
!388 = !DILocation(line: 74, column: 12, scope: !389)
!389 = distinct !DILexicalBlock(scope: !380, file: !57, line: 74, column: 8)
!390 = !DILocation(line: 74, column: 16, scope: !389)
!391 = !DILocation(line: 74, column: 8, scope: !389)
!392 = !DILocation(line: 74, column: 23, scope: !389)
!393 = !DILocation(line: 74, column: 8, scope: !380)
!394 = !DILocation(line: 75, column: 28, scope: !389)
!395 = !DILocation(line: 75, column: 38, scope: !389)
!396 = !DILocation(line: 75, column: 5, scope: !389)
!397 = !DILocation(line: 76, column: 3, scope: !380)
!398 = !DILocation(line: 77, column: 2, scope: !374)
!399 = !DILocation(line: 78, column: 35, scope: !400)
!400 = distinct !DILexicalBlock(scope: !370, file: !57, line: 77, column: 9)
!401 = !DILocation(line: 78, column: 14, scope: !400)
!402 = !DILocation(line: 78, column: 12, scope: !400)
!403 = !DILocation(line: 79, column: 16, scope: !400)
!404 = !DILocation(line: 79, column: 25, scope: !400)
!405 = !DILocation(line: 79, column: 16, scope: !406)
!406 = !DILexicalBlockFile(scope: !400, file: !57, discriminator: 1)
!407 = !DILocation(line: 79, column: 45, scope: !408)
!408 = !DILexicalBlockFile(scope: !400, file: !57, discriminator: 2)
!409 = !DILocation(line: 79, column: 38, scope: !408)
!410 = !DILocation(line: 79, column: 54, scope: !408)
!411 = !DILocation(line: 79, column: 16, scope: !408)
!412 = !DILocation(line: 79, column: 16, scope: !413)
!413 = !DILexicalBlockFile(scope: !400, file: !57, discriminator: 3)
!414 = !DILocation(line: 79, column: 7, scope: !413)
!415 = !DILocation(line: 79, column: 14, scope: !413)
!416 = !DILocation(line: 82, column: 34, scope: !296)
!417 = !DILocation(line: 82, column: 40, scope: !296)
!418 = !DILocation(line: 82, column: 9, scope: !296)
!419 = !DILocation(line: 83, column: 10, scope: !420)
!420 = distinct !DILexicalBlock(scope: !296, file: !57, line: 83, column: 6)
!421 = !DILocation(line: 83, column: 17, scope: !420)
!422 = !DILocation(line: 83, column: 6, scope: !296)
!423 = !DILocation(line: 84, column: 28, scope: !420)
!424 = !DILocation(line: 84, column: 43, scope: !420)
!425 = !DILocation(line: 84, column: 57, scope: !420)
!426 = !DILocation(line: 84, column: 3, scope: !420)
!427 = !DILocation(line: 86, column: 11, scope: !428)
!428 = distinct !DILexicalBlock(scope: !429, file: !57, line: 86, column: 7)
!429 = distinct !DILexicalBlock(scope: !420, file: !57, line: 85, column: 7)
!430 = !DILocation(line: 86, column: 7, scope: !428)
!431 = !DILocation(line: 86, column: 7, scope: !429)
!432 = !DILocation(line: 87, column: 21, scope: !433)
!433 = distinct !DILexicalBlock(scope: !428, file: !57, line: 86, column: 18)
!434 = !DILocation(line: 87, column: 10, scope: !433)
!435 = !DILocation(line: 87, column: 28, scope: !433)
!436 = !DILocation(line: 87, column: 8, scope: !433)
!437 = !DILocation(line: 88, column: 29, scope: !433)
!438 = !DILocation(line: 88, column: 35, scope: !433)
!439 = !DILocation(line: 88, column: 4, scope: !433)
!440 = !DILocation(line: 90, column: 29, scope: !433)
!441 = !DILocation(line: 90, column: 48, scope: !433)
!442 = !DILocation(line: 91, column: 14, scope: !433)
!443 = !DILocation(line: 90, column: 4, scope: !433)
!444 = !DILocation(line: 92, column: 3, scope: !433)
!445 = !DILocation(line: 93, column: 11, scope: !446)
!446 = distinct !DILexicalBlock(scope: !429, file: !57, line: 93, column: 7)
!447 = !DILocation(line: 93, column: 7, scope: !446)
!448 = !DILocation(line: 93, column: 7, scope: !429)
!449 = !DILocation(line: 94, column: 21, scope: !450)
!450 = distinct !DILexicalBlock(scope: !446, file: !57, line: 93, column: 18)
!451 = !DILocation(line: 94, column: 10, scope: !450)
!452 = !DILocation(line: 94, column: 28, scope: !450)
!453 = !DILocation(line: 94, column: 8, scope: !450)
!454 = !DILocation(line: 95, column: 29, scope: !450)
!455 = !DILocation(line: 95, column: 35, scope: !450)
!456 = !DILocation(line: 95, column: 4, scope: !450)
!457 = !DILocation(line: 97, column: 29, scope: !450)
!458 = !DILocation(line: 97, column: 48, scope: !450)
!459 = !DILocation(line: 98, column: 14, scope: !450)
!460 = !DILocation(line: 97, column: 4, scope: !450)
!461 = !DILocation(line: 99, column: 3, scope: !450)
!462 = !DILocation(line: 102, column: 6, scope: !463)
!463 = distinct !DILexicalBlock(scope: !296, file: !57, line: 102, column: 6)
!464 = !DILocation(line: 102, column: 10, scope: !463)
!465 = !DILocation(line: 102, column: 6, scope: !296)
!466 = !DILocation(line: 103, column: 3, scope: !463)
!467 = !DILocation(line: 106, column: 2, scope: !296)
!468 = !DILocation(line: 107, column: 1, scope: !296)
!469 = distinct !DISubprogram(name: "net_gethostbyname_return", scope: !57, file: !57, line: 110, type: !470, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !299)
!470 = !DISubroutineType(types: !471)
!471 = !{!72, !66, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!473 = !DILocalVariable(name: "pipe", arg: 1, scope: !469, file: !57, line: 110, type: !66)
!474 = !DILocation(line: 110, column: 42, scope: !469)
!475 = !DILocalVariable(name: "rec", arg: 2, scope: !469, file: !57, line: 110, type: !472)
!476 = !DILocation(line: 110, column: 65, scope: !469)
!477 = !DILocalVariable(name: "len", scope: !469, file: !57, line: 112, type: !72)
!478 = !DILocation(line: 112, column: 6, scope: !469)
!479 = !DILocation(line: 114, column: 2, scope: !469)
!480 = !DILocation(line: 114, column: 7, scope: !469)
!481 = !DILocation(line: 114, column: 13, scope: !469)
!482 = !DILocation(line: 115, column: 2, scope: !469)
!483 = !DILocation(line: 115, column: 7, scope: !469)
!484 = !DILocation(line: 115, column: 16, scope: !469)
!485 = !DILocation(line: 116, column: 2, scope: !469)
!486 = !DILocation(line: 116, column: 7, scope: !469)
!487 = !DILocation(line: 116, column: 13, scope: !469)
!488 = !DILocation(line: 117, column: 2, scope: !469)
!489 = !DILocation(line: 117, column: 7, scope: !469)
!490 = !DILocation(line: 117, column: 13, scope: !469)
!491 = !DILocation(line: 119, column: 33, scope: !469)
!492 = !DILocation(line: 119, column: 8, scope: !469)
!493 = !DILocation(line: 119, column: 2, scope: !494)
!494 = !DILexicalBlockFile(scope: !469, file: !57, discriminator: 1)
!495 = !DILocation(line: 122, column: 30, scope: !496)
!496 = distinct !DILexicalBlock(scope: !469, file: !57, line: 122, column: 6)
!497 = !DILocation(line: 122, column: 36, scope: !496)
!498 = !DILocation(line: 122, column: 6, scope: !496)
!499 = !DILocation(line: 122, column: 55, scope: !496)
!500 = !DILocation(line: 122, column: 6, scope: !469)
!501 = !DILocation(line: 124, column: 19, scope: !502)
!502 = distinct !DILexicalBlock(scope: !496, file: !57, line: 122, column: 62)
!503 = !DILocation(line: 124, column: 18, scope: !502)
!504 = !DILocation(line: 124, column: 7, scope: !505)
!505 = !DILexicalBlockFile(scope: !502, file: !57, discriminator: 1)
!506 = !DILocation(line: 123, column: 19, scope: !502)
!507 = !DILocation(line: 123, column: 3, scope: !502)
!508 = !DILocation(line: 123, column: 8, scope: !502)
!509 = !DILocation(line: 123, column: 17, scope: !502)
!510 = !DILocation(line: 125, column: 3, scope: !502)
!511 = !DILocation(line: 128, column: 6, scope: !512)
!512 = distinct !DILexicalBlock(scope: !469, file: !57, line: 128, column: 6)
!513 = !DILocation(line: 128, column: 11, scope: !512)
!514 = !DILocation(line: 128, column: 6, scope: !469)
!515 = !DILocation(line: 131, column: 29, scope: !516)
!516 = distinct !DILexicalBlock(scope: !512, file: !57, line: 128, column: 18)
!517 = !DILocation(line: 131, column: 34, scope: !516)
!518 = !DILocation(line: 131, column: 40, scope: !516)
!519 = !DILocation(line: 131, column: 19, scope: !516)
!520 = !DILocation(line: 131, column: 3, scope: !516)
!521 = !DILocation(line: 131, column: 8, scope: !516)
!522 = !DILocation(line: 131, column: 17, scope: !516)
!523 = !DILocation(line: 132, column: 41, scope: !516)
!524 = !DILocation(line: 132, column: 47, scope: !516)
!525 = !DILocation(line: 132, column: 52, scope: !516)
!526 = !DILocation(line: 132, column: 62, scope: !516)
!527 = !DILocation(line: 132, column: 67, scope: !516)
!528 = !DILocation(line: 132, column: 17, scope: !516)
!529 = !DILocation(line: 133, column: 2, scope: !516)
!530 = !DILocation(line: 134, column: 7, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !57, line: 134, column: 7)
!532 = distinct !DILexicalBlock(scope: !512, file: !57, line: 133, column: 9)
!533 = !DILocation(line: 134, column: 12, scope: !531)
!534 = !DILocation(line: 134, column: 7, scope: !532)
!535 = !DILocation(line: 135, column: 28, scope: !536)
!536 = distinct !DILexicalBlock(scope: !531, file: !57, line: 134, column: 19)
!537 = !DILocation(line: 135, column: 34, scope: !536)
!538 = !DILocation(line: 135, column: 4, scope: !536)
!539 = !DILocation(line: 136, column: 27, scope: !536)
!540 = !DILocation(line: 136, column: 17, scope: !536)
!541 = !DILocation(line: 136, column: 4, scope: !536)
!542 = !DILocation(line: 136, column: 9, scope: !536)
!543 = !DILocation(line: 136, column: 15, scope: !536)
!544 = !DILocation(line: 137, column: 28, scope: !536)
!545 = !DILocation(line: 137, column: 34, scope: !536)
!546 = !DILocation(line: 137, column: 39, scope: !536)
!547 = !DILocation(line: 137, column: 46, scope: !536)
!548 = !DILocation(line: 137, column: 4, scope: !536)
!549 = !DILocation(line: 138, column: 3, scope: !536)
!550 = !DILocation(line: 139, column: 7, scope: !551)
!551 = distinct !DILexicalBlock(scope: !532, file: !57, line: 139, column: 7)
!552 = !DILocation(line: 139, column: 12, scope: !551)
!553 = !DILocation(line: 139, column: 7, scope: !532)
!554 = !DILocation(line: 140, column: 28, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !57, line: 139, column: 19)
!556 = !DILocation(line: 140, column: 34, scope: !555)
!557 = !DILocation(line: 140, column: 4, scope: !555)
!558 = !DILocation(line: 141, column: 27, scope: !555)
!559 = !DILocation(line: 141, column: 17, scope: !555)
!560 = !DILocation(line: 141, column: 4, scope: !555)
!561 = !DILocation(line: 141, column: 9, scope: !555)
!562 = !DILocation(line: 141, column: 15, scope: !555)
!563 = !DILocation(line: 142, column: 28, scope: !555)
!564 = !DILocation(line: 142, column: 34, scope: !555)
!565 = !DILocation(line: 142, column: 39, scope: !555)
!566 = !DILocation(line: 142, column: 46, scope: !555)
!567 = !DILocation(line: 142, column: 4, scope: !555)
!568 = !DILocation(line: 143, column: 3, scope: !555)
!569 = !DILocation(line: 146, column: 2, scope: !469)
!570 = !DILocation(line: 147, column: 1, scope: !469)
!571 = distinct !DISubprogram(name: "net_gethostbyaddr_nonblock", scope: !57, file: !57, line: 150, type: !572, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !299)
!572 = !DISubroutineType(types: !573)
!573 = !{!72, !256, !574, !48}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_HOST_CALLBACK", file: !62, line: 25, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578, !48}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "RESOLVED_NAME_REC", file: !62, line: 22, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 15, size: 256, align: 64, elements: !581)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "namelen", scope: !580, file: !62, line: 16, baseType: !72, size: 32, align: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !62, line: 17, baseType: !197, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !580, file: !62, line: 19, baseType: !72, size: 32, align: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "errlen", scope: !580, file: !62, line: 20, baseType: !72, size: 32, align: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "errorstr", scope: !580, file: !62, line: 21, baseType: !197, size: 64, align: 64, offset: 192)
!587 = !DILocalVariable(name: "ip", arg: 1, scope: !571, file: !57, line: 150, type: !256)
!588 = !DILocation(line: 150, column: 40, scope: !571)
!589 = !DILocalVariable(name: "func", arg: 2, scope: !571, file: !57, line: 150, type: !574)
!590 = !DILocation(line: 150, column: 62, scope: !571)
!591 = !DILocalVariable(name: "data", arg: 3, scope: !571, file: !57, line: 150, type: !48)
!592 = !DILocation(line: 150, column: 74, scope: !571)
!593 = !DILocation(line: 153, column: 2, scope: !571)
!594 = distinct !DISubprogram(name: "net_disconnect_nonblock", scope: !57, file: !57, line: 157, type: !595, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !299)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !72}
!597 = !DILocalVariable(name: "pid", arg: 1, scope: !594, file: !57, line: 157, type: !72)
!598 = !DILocation(line: 157, column: 34, scope: !594)
!599 = !DILocation(line: 159, column: 2, scope: !594)
!600 = distinct !{!600, !599}
!601 = !DILocation(line: 159, column: 10, scope: !602)
!602 = !DILexicalBlockFile(scope: !603, file: !57, discriminator: 1)
!603 = distinct !DILexicalBlock(scope: !604, file: !57, line: 159, column: 10)
!604 = distinct !DILexicalBlock(scope: !594, file: !57, line: 159, column: 4)
!605 = !DILocation(line: 159, column: 14, scope: !602)
!606 = !DILocation(line: 159, column: 21, scope: !607)
!607 = !DILexicalBlockFile(scope: !608, file: !57, discriminator: 2)
!608 = distinct !DILexicalBlock(scope: !603, file: !57, line: 159, column: 19)
!609 = !DILocation(line: 159, column: 30, scope: !610)
!610 = !DILexicalBlockFile(scope: !611, file: !57, discriminator: 3)
!611 = distinct !DILexicalBlock(scope: !603, file: !57, line: 159, column: 28)
!612 = !DILocation(line: 159, column: 110, scope: !610)
!613 = !DILocation(line: 159, column: 121, scope: !614)
!614 = !DILexicalBlockFile(scope: !604, file: !57, discriminator: 4)
!615 = !DILocation(line: 161, column: 7, scope: !594)
!616 = !DILocation(line: 161, column: 2, scope: !594)
!617 = !DILocation(line: 162, column: 1, scope: !594)
!618 = !DILocation(line: 162, column: 1, scope: !619)
!619 = !DILexicalBlockFile(scope: !594, file: !57, discriminator: 1)
!620 = distinct !DISubprogram(name: "net_connect_nonblock", scope: !57, file: !57, line: 217, type: !621, isLocal: false, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !299)
!621 = !DISubroutineType(types: !622)
!622 = !{!72, !53, !72, !623, !61, !48}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!625 = !DILocalVariable(name: "server", arg: 1, scope: !620, file: !57, line: 217, type: !53)
!626 = !DILocation(line: 217, column: 38, scope: !620)
!627 = !DILocalVariable(name: "port", arg: 2, scope: !620, file: !57, line: 217, type: !72)
!628 = !DILocation(line: 217, column: 50, scope: !620)
!629 = !DILocalVariable(name: "my_ip", arg: 3, scope: !620, file: !57, line: 217, type: !623)
!630 = !DILocation(line: 217, column: 70, scope: !620)
!631 = !DILocalVariable(name: "func", arg: 4, scope: !620, file: !57, line: 218, type: !61)
!632 = !DILocation(line: 218, column: 18, scope: !620)
!633 = !DILocalVariable(name: "data", arg: 5, scope: !620, file: !57, line: 218, type: !48)
!634 = !DILocation(line: 218, column: 30, scope: !620)
!635 = !DILocalVariable(name: "rec", scope: !620, file: !57, line: 220, type: !55)
!636 = !DILocation(line: 220, column: 21, scope: !620)
!637 = !DILocalVariable(name: "fd", scope: !620, file: !57, line: 221, type: !638)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, align: 32, elements: !252)
!639 = !DILocation(line: 221, column: 6, scope: !620)
!640 = !DILocation(line: 223, column: 2, scope: !620)
!641 = distinct !{!641, !640}
