; ModuleID = './line324-fe-whois.o.i'
source_filename = "./line324-fe-whois.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.whois_event_table = type { i32, void (%struct._IRC_SERVER_REC*, i8*)* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!131 = !DIEnumerator(name: "IRCTXT_UNAWAY", value: 62)
!132 = !DIEnumerator(name: "IRCTXT_NICK_AWAY", value: 63)
!133 = !DIEnumerator(name: "IRCTXT_NO_SUCH_NICK", value: 64)
!134 = !DIEnumerator(name: "IRCTXT_NICK_IN_USE", value: 65)
!135 = !DIEnumerator(name: "IRCTXT_NICK_UNAVAILABLE", value: 66)
!136 = !DIEnumerator(name: "IRCTXT_YOUR_NICK_OWNED", value: 67)
!137 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!138 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!139 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!140 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!141 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!142 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!143 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!144 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!145 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!146 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!147 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!148 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!149 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!150 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!151 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!152 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!153 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!154 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!155 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!156 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!157 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!158 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!159 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!160 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!161 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!162 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!163 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!164 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!165 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!166 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!167 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!168 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!169 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!170 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!171 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!172 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!173 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!174 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!175 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!176 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!177 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!178 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!179 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!180 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!181 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!182 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!183 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!184 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!185 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!186 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!187 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!188 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!189 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!190 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!191 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!192 = !{!193, !200, !201, !205, !207, !449}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !194, line: 9, baseType: !195)
!194 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !198, !198, !198, !198, !198, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!204 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !209, line: 107, baseType: !210)
!209 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !211, line: 30, size: 2240, align: 64, elements: !212)
!211 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!212 = !{!213, !216, !217, !218, !448, !453, !454, !455, !456, !457, !458, !459, !460, !461, !465, !466, !470, !471, !472, !476, !481, !482, !483, !484, !485, !486, !487, !488, !495, !496, !497, !498, !499, !503, !507, !511, !515, !519, !524, !617, !624, !628}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !214, line: 3, baseType: !215, size: 32, align: 32)
!214 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!215 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !210, file: !214, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !210, file: !214, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !210, file: !214, line: 8, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !209, line: 113, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !211, line: 25, size: 1920, align: 64, elements: !222)
!222 = !{!223, !225, !226, !227, !229, !230, !231, !232, !233, !235, !236, !237, !238, !239, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !224, line: 3, baseType: !215, size: 32, align: 32)
!224 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !221, file: !224, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !221, file: !224, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !221, file: !224, line: 9, baseType: !228, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !221, file: !224, line: 10, baseType: !215, size: 32, align: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !221, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !221, file: !224, line: 13, baseType: !234, size: 16, align: 16, offset: 448)
!234 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !221, file: !224, line: 14, baseType: !228, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !221, file: !224, line: 15, baseType: !228, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !221, file: !224, line: 16, baseType: !215, size: 32, align: 32, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !221, file: !224, line: 17, baseType: !228, size: 64, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !221, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !209, line: 99, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !209, line: 99, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !221, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !221, file: !224, line: 21, baseType: !228, size: 64, align: 64, offset: 896)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !221, file: !224, line: 22, baseType: !228, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !221, file: !224, line: 23, baseType: !228, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !221, file: !224, line: 24, baseType: !228, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !221, file: !224, line: 26, baseType: !228, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !221, file: !224, line: 27, baseType: !228, size: 64, align: 64, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !221, file: !224, line: 28, baseType: !228, size: 64, align: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !221, file: !224, line: 29, baseType: !228, size: 64, align: 64, offset: 1344)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !221, file: !224, line: 30, baseType: !228, size: 64, align: 64, offset: 1408)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !221, file: !224, line: 31, baseType: !228, size: 64, align: 64, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !221, file: !224, line: 32, baseType: !228, size: 64, align: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !221, file: !224, line: 33, baseType: !228, size: 64, align: 64, offset: 1600)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !221, file: !224, line: 35, baseType: !257, size: 64, align: 64, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !260)
!260 = !{!261, !263, !405, !406, !411, !412, !413, !414, !415, !424, !425, !426, !430, !431, !432, !433, !434, !435, !436, !437}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !259, file: !4, line: 100, baseType: !262, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !203, line: 49, baseType: !215)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !259, file: !4, line: 101, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !267)
!267 = !{!268, !290, !296, !303, !307, !392, !396, !401}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !266, file: !4, line: 133, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !257, !201, !273, !276, !277}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !274, line: 66, baseType: !275)
!274 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !280, line: 42, baseType: !281)
!280 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !280, line: 44, size: 128, align: 64, elements: !282)
!282 = !{!283, !288, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !281, file: !280, line: 46, baseType: !284, size: 32, align: 32)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !285, line: 36, baseType: !286)
!285 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !274, line: 45, baseType: !287)
!287 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !281, file: !280, line: 47, baseType: !262, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !281, file: !280, line: 48, baseType: !201, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !266, file: !4, line: 138, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!272, !257, !294, !273, !276, !277}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !266, file: !4, line: 143, baseType: !297, size: 64, align: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!272, !257, !300, !302, !277}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !274, line: 51, baseType: !301)
!301 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !266, file: !4, line: 147, baseType: !304, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!272, !257, !277}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !266, file: !4, line: 149, baseType: !308, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !257, !391}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !314)
!314 = !{!315, !317, !338, !367, !369, !373, !374, !375, !376, !384, !385, !386, !387}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !313, file: !16, line: 174, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !203, line: 77, baseType: !200)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !313, file: !16, line: 175, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !321)
!321 = !{!322, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !320, file: !16, line: 198, baseType: !323, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !316}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !320, file: !16, line: 199, baseType: !323, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !320, file: !16, line: 200, baseType: !328, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !316, !311, !331, !337}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!336, !316}
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !203, line: 50, baseType: !262)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !313, file: !16, line: 177, baseType: !339, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !343)
!343 = !{!344, !349, !353, !357, !361, !362}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !342, file: !16, line: 216, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!336, !311, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !342, file: !16, line: 218, baseType: !350, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!336, !311}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !342, file: !16, line: 219, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!336, !311, !332, !316}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !342, file: !16, line: 222, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !311}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !342, file: !16, line: 226, baseType: !332, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !342, file: !16, line: 227, baseType: !363, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !313, file: !16, line: 178, baseType: !368, size: 32, align: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !203, line: 55, baseType: !287)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !313, file: !16, line: 180, baseType: !370, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !313, file: !16, line: 182, baseType: !262, size: 32, align: 32, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !16, line: 183, baseType: !368, size: 32, align: 32, offset: 352)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !313, file: !16, line: 184, baseType: !368, size: 32, align: 32, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !313, file: !16, line: 186, baseType: !377, size: 64, align: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !379, line: 37, baseType: !380)
!379 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !379, line: 39, size: 128, align: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !379, line: 41, baseType: !316, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !379, line: 42, baseType: !377, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !313, file: !16, line: 188, baseType: !311, size: 64, align: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !16, line: 189, baseType: !311, size: 64, align: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !16, line: 191, baseType: !228, size: 64, align: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !313, file: !16, line: 193, baseType: !388, size: 64, align: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !390)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !266, file: !4, line: 151, baseType: !393, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !257}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !266, file: !4, line: 152, baseType: !397, size: 64, align: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!272, !257, !400, !277}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !266, file: !4, line: 155, baseType: !402, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!400, !257}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !4, line: 103, baseType: !201, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !259, file: !4, line: 104, baseType: !407, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !408, line: 77, baseType: !409)
!408 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !408, line: 77, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !259, file: !4, line: 105, baseType: !407, size: 64, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !259, file: !4, line: 106, baseType: !201, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !259, file: !4, line: 107, baseType: !368, size: 32, align: 32, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !259, file: !4, line: 109, baseType: !273, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !259, file: !4, line: 110, baseType: !416, size: 64, align: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !418, line: 39, baseType: !419)
!418 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !418, line: 41, size: 192, align: 64, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !419, file: !418, line: 43, baseType: !201, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !419, file: !418, line: 44, baseType: !273, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !419, file: !418, line: 45, baseType: !273, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !259, file: !4, line: 111, baseType: !416, size: 64, align: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !259, file: !4, line: 112, baseType: !416, size: 64, align: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !259, file: !4, line: 113, baseType: !427, size: 48, align: 8, offset: 704)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 48, align: 8, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 6)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !259, file: !4, line: 117, baseType: !368, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !259, file: !4, line: 118, baseType: !368, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !259, file: !4, line: 119, baseType: !368, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !259, file: !4, line: 120, baseType: !368, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !259, file: !4, line: 121, baseType: !368, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !259, file: !4, line: 122, baseType: !368, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !259, file: !4, line: 124, baseType: !316, size: 64, align: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !259, file: !4, line: 125, baseType: !316, size: 64, align: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !221, file: !224, line: 38, baseType: !287, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !221, file: !224, line: 39, baseType: !287, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !221, file: !224, line: 40, baseType: !287, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !221, file: !224, line: 41, baseType: !287, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !221, file: !224, line: 42, baseType: !287, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !221, file: !224, line: 43, baseType: !287, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !221, file: !224, line: 44, baseType: !287, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !221, file: !224, line: 45, baseType: !287, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !221, file: !224, line: 46, baseType: !228, size: 64, align: 64, offset: 1792)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !221, file: !224, line: 47, baseType: !228, size: 64, align: 64, offset: 1856)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !210, file: !214, line: 9, baseType: !449, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !450, line: 75, baseType: !451)
!450 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !452, line: 139, baseType: !301)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!453 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !210, file: !214, line: 10, baseType: !449, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !210, file: !214, line: 12, baseType: !228, size: 64, align: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !210, file: !214, line: 13, baseType: !228, size: 64, align: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !210, file: !214, line: 15, baseType: !287, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !210, file: !214, line: 16, baseType: !287, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !210, file: !214, line: 17, baseType: !287, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !210, file: !214, line: 18, baseType: !287, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !210, file: !214, line: 19, baseType: !287, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !210, file: !214, line: 21, baseType: !462, size: 64, align: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !209, line: 102, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !209, line: 102, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !210, file: !214, line: 22, baseType: !215, size: 32, align: 32, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !210, file: !214, line: 25, baseType: !467, size: 128, align: 64, offset: 640)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 128, align: 64, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !210, file: !214, line: 26, baseType: !215, size: 32, align: 32, offset: 768)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !210, file: !214, line: 27, baseType: !215, size: 32, align: 32, offset: 800)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !210, file: !214, line: 29, baseType: !473, size: 64, align: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !209, line: 103, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !209, line: 103, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !210, file: !214, line: 30, baseType: !477, size: 64, align: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !479, line: 37, baseType: !480)
!479 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !479, line: 37, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !210, file: !214, line: 32, baseType: !228, size: 64, align: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !210, file: !214, line: 33, baseType: !228, size: 64, align: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !210, file: !214, line: 34, baseType: !228, size: 64, align: 64, offset: 1088)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !210, file: !214, line: 35, baseType: !287, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !210, file: !214, line: 36, baseType: !287, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !210, file: !214, line: 37, baseType: !287, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !210, file: !214, line: 38, baseType: !287, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !210, file: !214, line: 40, baseType: !489, size: 128, align: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !203, line: 504, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !203, line: 506, size: 128, align: 64, elements: !491)
!491 = !{!492, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !490, file: !203, line: 508, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !203, line: 48, baseType: !301)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !490, file: !203, line: 509, baseType: !493, size: 64, align: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !210, file: !214, line: 41, baseType: !449, size: 64, align: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !210, file: !214, line: 42, baseType: !215, size: 32, align: 32, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !210, file: !214, line: 44, baseType: !377, size: 64, align: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !210, file: !214, line: 45, baseType: !377, size: 64, align: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !210, file: !214, line: 53, baseType: !500, size: 64, align: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !207, !205, !215}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !210, file: !214, line: 55, baseType: !504, size: 64, align: 64, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!215, !207, !204}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !210, file: !214, line: 57, baseType: !508, size: 64, align: 64, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!215, !207, !205}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !210, file: !214, line: 60, baseType: !512, size: 64, align: 64, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!205, !207}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !210, file: !214, line: 62, baseType: !516, size: 64, align: 64, offset: 1856)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !207, !205, !205, !215}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !210, file: !214, line: 65, baseType: !520, size: 64, align: 64, offset: 1920)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !207, !205, !205}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !210, file: !214, line: 69, baseType: !525, size: 64, align: 64, offset: 1984)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !207, !205}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !209, line: 109, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !531, line: 15, size: 1408, align: 64, elements: !532)
!531 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!532 = !{!533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !568, !569, !571, !572, !573, !574, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !534, line: 3, baseType: !215, size: 32, align: 32)
!534 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !530, file: !534, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !530, file: !534, line: 5, baseType: !477, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !530, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !530, file: !534, line: 8, baseType: !207, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !530, file: !534, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !534, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !530, file: !534, line: 11, baseType: !449, size: 64, align: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !530, file: !534, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !530, file: !534, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !530, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !209, line: 108, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !551, line: 5, size: 704, align: 64, elements: !552)
!551 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !534, line: 3, baseType: !215, size: 32, align: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !550, file: !534, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !550, file: !534, line: 5, baseType: !477, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !550, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !550, file: !534, line: 8, baseType: !207, size: 64, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !550, file: !534, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !534, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !550, file: !534, line: 11, baseType: !449, size: 64, align: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !550, file: !534, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !550, file: !534, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !550, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !550, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!205, !548}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !530, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !530, file: !570, line: 5, baseType: !228, size: 64, align: 64, offset: 704)
!570 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !530, file: !570, line: 6, baseType: !228, size: 64, align: 64, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !530, file: !570, line: 7, baseType: !449, size: 64, align: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !530, file: !570, line: 9, baseType: !477, size: 64, align: 64, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !530, file: !570, line: 10, baseType: !575, size: 64, align: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !209, line: 111, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !578, line: 13, size: 576, align: 64, elements: !579)
!578 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!579 = !{!580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !598, !599}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !581, line: 3, baseType: !215, size: 32, align: 32)
!581 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !577, file: !581, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !577, file: !581, line: 6, baseType: !449, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !577, file: !581, line: 8, baseType: !228, size: 64, align: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !577, file: !581, line: 9, baseType: !228, size: 64, align: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !577, file: !581, line: 10, baseType: !228, size: 64, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !577, file: !581, line: 11, baseType: !215, size: 32, align: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !577, file: !581, line: 14, baseType: !287, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !577, file: !581, line: 15, baseType: !287, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !577, file: !581, line: 18, baseType: !287, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !577, file: !581, line: 19, baseType: !287, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !577, file: !581, line: 20, baseType: !287, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !577, file: !581, line: 21, baseType: !287, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !577, file: !581, line: 22, baseType: !595, size: 64, align: 8, offset: 360)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 64, align: 8, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !577, file: !581, line: 26, baseType: !200, size: 64, align: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !577, file: !581, line: 28, baseType: !575, size: 64, align: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !530, file: !570, line: 12, baseType: !287, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !530, file: !570, line: 13, baseType: !228, size: 64, align: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !530, file: !570, line: 14, baseType: !215, size: 32, align: 32, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !530, file: !570, line: 15, baseType: !228, size: 64, align: 64, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !530, file: !570, line: 17, baseType: !287, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !530, file: !570, line: 18, baseType: !287, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !530, file: !570, line: 19, baseType: !287, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !530, file: !570, line: 20, baseType: !287, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !530, file: !570, line: 22, baseType: !287, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !530, file: !570, line: 23, baseType: !287, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !530, file: !570, line: 24, baseType: !287, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !530, file: !570, line: 25, baseType: !287, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !530, file: !570, line: 26, baseType: !287, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !530, file: !570, line: 31, baseType: !614, size: 64, align: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!228, !528}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !210, file: !214, line: 70, baseType: !618, size: 64, align: 64, offset: 2048)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !207, !205}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !209, line: 110, baseType: !623)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !209, line: 110, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !210, file: !214, line: 71, baseType: !625, size: 64, align: 64, offset: 2112)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!215, !205, !205}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !210, file: !214, line: 73, baseType: !625, size: 64, align: 64, offset: 2176)
!629 = !{!630}
!630 = distinct !DIGlobalVariable(name: "events", scope: !0, file: !631, line: 377, type: !632, isLocal: true, isDefinition: true, variable: [11 x %struct.whois_event_table]* @events)
!631 = !DIFile(filename: "fe-whois.c", directory: "/home/lichi/Desktop/irssi/task1")
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 1408, align: 64, elements: !848)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "whois_event_table", file: !631, line: 372, size: 128, align: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !633, file: !631, line: 373, baseType: !215, size: 32, align: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !633, file: !631, line: 374, baseType: !637, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640, !205}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !642, line: 6, baseType: !643)
!642 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !644, line: 42, size: 39168, align: 64, elements: !645)
!644 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!645 = !{!646, !647, !648, !649, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !845, !847}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !214, line: 3, baseType: !215, size: 32, align: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !643, file: !214, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !643, file: !214, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !643, file: !214, line: 8, baseType: !650, size: 64, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !642, line: 5, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !644, line: 24, size: 2496, align: 64, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !224, line: 3, baseType: !215, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !652, file: !224, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !652, file: !224, line: 6, baseType: !215, size: 32, align: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !652, file: !224, line: 9, baseType: !228, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !652, file: !224, line: 10, baseType: !215, size: 32, align: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !652, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !652, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !652, file: !224, line: 11, baseType: !228, size: 64, align: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !652, file: !224, line: 13, baseType: !234, size: 16, align: 16, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !652, file: !224, line: 14, baseType: !228, size: 64, align: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !652, file: !224, line: 15, baseType: !228, size: 64, align: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !652, file: !224, line: 16, baseType: !215, size: 32, align: 32, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !652, file: !224, line: 17, baseType: !228, size: 64, align: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !652, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !652, file: !224, line: 19, baseType: !240, size: 64, align: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !652, file: !224, line: 21, baseType: !228, size: 64, align: 64, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !652, file: !224, line: 22, baseType: !228, size: 64, align: 64, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !652, file: !224, line: 23, baseType: !228, size: 64, align: 64, offset: 1024)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !652, file: !224, line: 24, baseType: !228, size: 64, align: 64, offset: 1088)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !652, file: !224, line: 26, baseType: !228, size: 64, align: 64, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !652, file: !224, line: 27, baseType: !228, size: 64, align: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !652, file: !224, line: 28, baseType: !228, size: 64, align: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !652, file: !224, line: 29, baseType: !228, size: 64, align: 64, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !652, file: !224, line: 30, baseType: !228, size: 64, align: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !652, file: !224, line: 31, baseType: !228, size: 64, align: 64, offset: 1472)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !652, file: !224, line: 32, baseType: !228, size: 64, align: 64, offset: 1536)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !652, file: !224, line: 33, baseType: !228, size: 64, align: 64, offset: 1600)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !652, file: !224, line: 35, baseType: !257, size: 64, align: 64, offset: 1664)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !652, file: !224, line: 38, baseType: !287, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !652, file: !224, line: 39, baseType: !287, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !652, file: !224, line: 40, baseType: !287, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !652, file: !224, line: 41, baseType: !287, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !652, file: !224, line: 42, baseType: !287, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !652, file: !224, line: 43, baseType: !287, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !652, file: !224, line: 44, baseType: !287, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !652, file: !224, line: 45, baseType: !287, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !652, file: !224, line: 46, baseType: !228, size: 64, align: 64, offset: 1792)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !652, file: !224, line: 47, baseType: !228, size: 64, align: 64, offset: 1856)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !652, file: !644, line: 27, baseType: !228, size: 64, align: 64, offset: 1920)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !652, file: !644, line: 28, baseType: !228, size: 64, align: 64, offset: 1984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !652, file: !644, line: 30, baseType: !215, size: 32, align: 32, offset: 2048)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !652, file: !644, line: 31, baseType: !228, size: 64, align: 64, offset: 2112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !652, file: !644, line: 32, baseType: !228, size: 64, align: 64, offset: 2176)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !652, file: !644, line: 34, baseType: !215, size: 32, align: 32, offset: 2240)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !652, file: !644, line: 35, baseType: !215, size: 32, align: 32, offset: 2272)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !652, file: !644, line: 36, baseType: !215, size: 32, align: 32, offset: 2304)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !652, file: !644, line: 38, baseType: !215, size: 32, align: 32, offset: 2336)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !652, file: !644, line: 38, baseType: !215, size: 32, align: 32, offset: 2368)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !652, file: !644, line: 38, baseType: !215, size: 32, align: 32, offset: 2400)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !652, file: !644, line: 38, baseType: !215, size: 32, align: 32, offset: 2432)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !643, file: !214, line: 9, baseType: !449, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !643, file: !214, line: 10, baseType: !449, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !643, file: !214, line: 12, baseType: !228, size: 64, align: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !643, file: !214, line: 13, baseType: !228, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !643, file: !214, line: 15, baseType: !287, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !643, file: !214, line: 16, baseType: !287, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !643, file: !214, line: 17, baseType: !287, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !643, file: !214, line: 18, baseType: !287, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !643, file: !214, line: 19, baseType: !287, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !643, file: !214, line: 21, baseType: !462, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !643, file: !214, line: 22, baseType: !215, size: 32, align: 32, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !643, file: !214, line: 25, baseType: !467, size: 128, align: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !643, file: !214, line: 26, baseType: !215, size: 32, align: 32, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !643, file: !214, line: 27, baseType: !215, size: 32, align: 32, offset: 800)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !643, file: !214, line: 29, baseType: !473, size: 64, align: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !643, file: !214, line: 30, baseType: !477, size: 64, align: 64, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !643, file: !214, line: 32, baseType: !228, size: 64, align: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !643, file: !214, line: 33, baseType: !228, size: 64, align: 64, offset: 1024)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !643, file: !214, line: 34, baseType: !228, size: 64, align: 64, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !643, file: !214, line: 35, baseType: !287, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !643, file: !214, line: 36, baseType: !287, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !643, file: !214, line: 37, baseType: !287, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !643, file: !214, line: 38, baseType: !287, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !643, file: !214, line: 40, baseType: !489, size: 128, align: 64, offset: 1216)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !643, file: !214, line: 41, baseType: !449, size: 64, align: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !643, file: !214, line: 42, baseType: !215, size: 32, align: 32, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !643, file: !214, line: 44, baseType: !377, size: 64, align: 64, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !643, file: !214, line: 45, baseType: !377, size: 64, align: 64, offset: 1536)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !643, file: !214, line: 53, baseType: !500, size: 64, align: 64, offset: 1600)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !643, file: !214, line: 55, baseType: !504, size: 64, align: 64, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !643, file: !214, line: 57, baseType: !508, size: 64, align: 64, offset: 1728)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !643, file: !214, line: 60, baseType: !512, size: 64, align: 64, offset: 1792)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !643, file: !214, line: 62, baseType: !516, size: 64, align: 64, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !643, file: !214, line: 65, baseType: !520, size: 64, align: 64, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !643, file: !214, line: 69, baseType: !525, size: 64, align: 64, offset: 1984)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !643, file: !214, line: 70, baseType: !618, size: 64, align: 64, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !643, file: !214, line: 71, baseType: !625, size: 64, align: 64, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !643, file: !214, line: 73, baseType: !625, size: 64, align: 64, offset: 2176)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !643, file: !644, line: 46, baseType: !377, size: 64, align: 64, offset: 2240)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !643, file: !644, line: 47, baseType: !377, size: 64, align: 64, offset: 2304)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !643, file: !644, line: 48, baseType: !745, size: 64, align: 64, offset: 2368)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !642, line: 8, baseType: !747)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !642, line: 8, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !643, file: !644, line: 49, baseType: !377, size: 64, align: 64, offset: 2432)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !643, file: !644, line: 51, baseType: !228, size: 64, align: 64, offset: 2496)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !643, file: !644, line: 53, baseType: !228, size: 64, align: 64, offset: 2560)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !643, file: !644, line: 54, baseType: !228, size: 64, align: 64, offset: 2624)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !643, file: !644, line: 55, baseType: !228, size: 64, align: 64, offset: 2688)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !643, file: !644, line: 56, baseType: !228, size: 64, align: 64, offset: 2752)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !643, file: !644, line: 57, baseType: !215, size: 32, align: 32, offset: 2816)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !643, file: !644, line: 59, baseType: !287, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !643, file: !644, line: 60, baseType: !287, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !643, file: !644, line: 62, baseType: !287, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !643, file: !644, line: 63, baseType: !287, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !643, file: !644, line: 64, baseType: !287, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !643, file: !644, line: 65, baseType: !287, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !643, file: !644, line: 66, baseType: !287, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !643, file: !644, line: 67, baseType: !287, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !643, file: !644, line: 68, baseType: !287, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !643, file: !644, line: 69, baseType: !287, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !643, file: !644, line: 70, baseType: !287, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !643, file: !644, line: 71, baseType: !287, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !643, file: !644, line: 72, baseType: !287, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !643, file: !644, line: 74, baseType: !215, size: 32, align: 32, offset: 2880)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !643, file: !644, line: 75, baseType: !215, size: 32, align: 32, offset: 2912)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !643, file: !644, line: 76, baseType: !215, size: 32, align: 32, offset: 2944)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !643, file: !644, line: 77, baseType: !215, size: 32, align: 32, offset: 2976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !643, file: !644, line: 79, baseType: !477, size: 64, align: 64, offset: 3008)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !643, file: !644, line: 80, baseType: !377, size: 64, align: 64, offset: 3072)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !643, file: !644, line: 81, baseType: !377, size: 64, align: 64, offset: 3136)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !643, file: !644, line: 83, baseType: !416, size: 64, align: 64, offset: 3200)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !643, file: !644, line: 84, baseType: !368, size: 32, align: 32, offset: 3264)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !643, file: !644, line: 87, baseType: !215, size: 32, align: 32, offset: 3296)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !643, file: !644, line: 91, baseType: !377, size: 64, align: 64, offset: 3328)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !643, file: !644, line: 92, baseType: !489, size: 128, align: 64, offset: 3392)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !643, file: !644, line: 93, baseType: !489, size: 128, align: 64, offset: 3520)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !643, file: !644, line: 95, baseType: !215, size: 32, align: 32, offset: 3648)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !643, file: !644, line: 96, baseType: !215, size: 32, align: 32, offset: 3680)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !643, file: !644, line: 97, baseType: !215, size: 32, align: 32, offset: 3712)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !643, file: !644, line: 100, baseType: !377, size: 64, align: 64, offset: 3776)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !643, file: !644, line: 103, baseType: !377, size: 64, align: 64, offset: 3840)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !643, file: !644, line: 106, baseType: !377, size: 64, align: 64, offset: 3904)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !643, file: !644, line: 108, baseType: !477, size: 64, align: 64, offset: 3968)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !643, file: !644, line: 109, baseType: !377, size: 64, align: 64, offset: 4032)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !643, file: !644, line: 111, baseType: !377, size: 64, align: 64, offset: 4096)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !643, file: !644, line: 114, baseType: !200, size: 64, align: 64, offset: 4160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !643, file: !644, line: 116, baseType: !477, size: 64, align: 64, offset: 4224)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !643, file: !644, line: 117, baseType: !793, size: 32768, align: 64, offset: 4288)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 32768, align: 64, elements: !843)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !795, line: 10, size: 128, align: 64, elements: !796)
!795 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!796 = !{!797, !842}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !794, file: !795, line: 11, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !795, line: 7, baseType: !800)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !802, !205, !204, !204, !228, !416}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !642, line: 7, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !805, line: 15, size: 1600, align: 64, elements: !806)
!805 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !804, file: !534, line: 3, baseType: !215, size: 32, align: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !804, file: !534, line: 4, baseType: !215, size: 32, align: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !804, file: !534, line: 5, baseType: !477, size: 64, align: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !804, file: !534, line: 7, baseType: !200, size: 64, align: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !804, file: !534, line: 8, baseType: !640, size: 64, align: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !804, file: !534, line: 9, baseType: !228, size: 64, align: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !534, line: 10, baseType: !228, size: 64, align: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !804, file: !534, line: 11, baseType: !449, size: 64, align: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !804, file: !534, line: 12, baseType: !215, size: 32, align: 32, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !804, file: !534, line: 13, baseType: !228, size: 64, align: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !804, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !804, file: !534, line: 17, baseType: !565, size: 64, align: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !804, file: !570, line: 5, baseType: !228, size: 64, align: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !804, file: !570, line: 6, baseType: !228, size: 64, align: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !804, file: !570, line: 7, baseType: !449, size: 64, align: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !804, file: !570, line: 9, baseType: !477, size: 64, align: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !804, file: !570, line: 10, baseType: !575, size: 64, align: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !804, file: !570, line: 12, baseType: !287, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !804, file: !570, line: 13, baseType: !228, size: 64, align: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !804, file: !570, line: 14, baseType: !215, size: 32, align: 32, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !804, file: !570, line: 15, baseType: !228, size: 64, align: 64, offset: 1216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !804, file: !570, line: 17, baseType: !287, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !804, file: !570, line: 18, baseType: !287, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !804, file: !570, line: 19, baseType: !287, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !804, file: !570, line: 20, baseType: !287, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !804, file: !570, line: 22, baseType: !287, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !804, file: !570, line: 23, baseType: !287, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !804, file: !570, line: 24, baseType: !287, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !804, file: !570, line: 25, baseType: !287, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !804, file: !570, line: 26, baseType: !287, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !804, file: !570, line: 31, baseType: !614, size: 64, align: 64, offset: 1344)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !804, file: !805, line: 18, baseType: !377, size: 64, align: 64, offset: 1408)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !804, file: !805, line: 20, baseType: !449, size: 64, align: 64, offset: 1472)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !804, file: !805, line: 21, baseType: !215, size: 32, align: 32, offset: 1536)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !804, file: !805, line: 22, baseType: !215, size: 32, align: 32, offset: 1568)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !794, file: !795, line: 12, baseType: !204, size: 8, align: 8, offset: 64)
!843 = !{!844}
!844 = !DISubrange(count: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !643, file: !644, line: 118, baseType: !846, size: 2048, align: 8, offset: 37056)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 2048, align: 8, elements: !843)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !643, file: !644, line: 120, baseType: !625, size: 64, align: 64, offset: 39104)
!848 = !{!849}
!849 = !DISubrange(count: 11)
!850 = !{i32 2, !"Dwarf Version", i32 4}
!851 = !{i32 2, !"Debug Info Version", i32 3}
!852 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!853 = distinct !DISubprogram(name: "fe_whois_init", scope: !631, file: !631, line: 406, type: !365, isLocal: false, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !854)
!854 = !{}
!855 = !DILocation(line: 408, column: 2, scope: !853)
!856 = !DILocation(line: 410, column: 2, scope: !853)
!857 = !DILocation(line: 411, column: 2, scope: !853)
!858 = !DILocation(line: 414, column: 2, scope: !853)
!859 = !DILocation(line: 415, column: 2, scope: !853)
!860 = !DILocation(line: 416, column: 2, scope: !853)
!861 = !DILocation(line: 417, column: 2, scope: !853)
!862 = !DILocation(line: 418, column: 2, scope: !853)
!863 = !DILocation(line: 419, column: 2, scope: !853)
!864 = !DILocation(line: 420, column: 2, scope: !853)
!865 = !DILocation(line: 421, column: 2, scope: !853)
!866 = !DILocation(line: 422, column: 2, scope: !853)
!867 = !DILocation(line: 423, column: 2, scope: !853)
!868 = !DILocation(line: 424, column: 2, scope: !853)
!869 = !DILocation(line: 425, column: 2, scope: !853)
!870 = !DILocation(line: 426, column: 2, scope: !853)
!871 = !DILocation(line: 427, column: 2, scope: !853)
!872 = !DILocation(line: 428, column: 2, scope: !853)
!873 = !DILocation(line: 429, column: 2, scope: !853)
!874 = !DILocation(line: 430, column: 2, scope: !853)
!875 = !DILocation(line: 431, column: 1, scope: !853)
!876 = distinct !DISubprogram(name: "event_whois", scope: !631, file: !631, line: 15, type: !638, isLocal: true, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !854)
!877 = !DILocalVariable(name: "server", arg: 1, scope: !876, file: !631, line: 15, type: !640)
!878 = !DIExpression()
!879 = !DILocation(line: 15, column: 41, scope: !876)
!880 = !DILocalVariable(name: "data", arg: 2, scope: !876, file: !631, line: 15, type: !205)
!881 = !DILocation(line: 15, column: 61, scope: !876)
!882 = !DILocalVariable(name: "params", scope: !876, file: !631, line: 17, type: !228)
!883 = !DILocation(line: 17, column: 8, scope: !876)
!884 = !DILocalVariable(name: "nick", scope: !876, file: !631, line: 17, type: !228)
!885 = !DILocation(line: 17, column: 17, scope: !876)
!886 = !DILocalVariable(name: "user", scope: !876, file: !631, line: 17, type: !228)
!887 = !DILocation(line: 17, column: 24, scope: !876)
!888 = !DILocalVariable(name: "host", scope: !876, file: !631, line: 17, type: !228)
!889 = !DILocation(line: 17, column: 31, scope: !876)
!890 = !DILocalVariable(name: "realname", scope: !876, file: !631, line: 17, type: !228)
!891 = !DILocation(line: 17, column: 38, scope: !876)
!892 = !DILocalVariable(name: "recoded", scope: !876, file: !631, line: 17, type: !228)
!893 = !DILocation(line: 17, column: 49, scope: !876)
!894 = !DILocation(line: 19, column: 2, scope: !876)
!895 = distinct !{!895, !894}
!896 = !DILocation(line: 19, column: 10, scope: !897)
!897 = !DILexicalBlockFile(scope: !898, file: !631, discriminator: 1)
!898 = distinct !DILexicalBlock(scope: !899, file: !631, line: 19, column: 10)
!899 = distinct !DILexicalBlock(scope: !876, file: !631, line: 19, column: 4)
!900 = !DILocation(line: 19, column: 15, scope: !897)
!901 = !DILocation(line: 19, column: 5, scope: !902)
!902 = !DILexicalBlockFile(scope: !903, file: !631, discriminator: 2)
!903 = distinct !DILexicalBlock(scope: !898, file: !631, line: 19, column: 3)
!904 = !DILocation(line: 19, column: 14, scope: !905)
!905 = !DILexicalBlockFile(scope: !906, file: !631, discriminator: 3)
!906 = distinct !DILexicalBlock(scope: !898, file: !631, line: 19, column: 12)
!907 = !DILocation(line: 19, column: 99, scope: !905)
