; ModuleID = './line115-irc.o.i'
source_filename = "./line115-irc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35, globals: !714)
!1 = !DIFile(filename: "line115-irc.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !41, !43, !45, !52, !406, !710}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !46, line: 9, baseType: !47)
!46 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !50, !50, !50, !50, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !54, line: 6, baseType: !55)
!54 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !56, line: 42, size: 39168, align: 64, elements: !57)
!56 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!57 = !{!58, !61, !62, !63, !332, !337, !338, !339, !340, !341, !342, !343, !344, !345, !362, !363, !367, !368, !369, !379, !384, !385, !386, !387, !388, !389, !390, !391, !398, !399, !400, !401, !402, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !707, !709}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !59, line: 3, baseType: !60, size: 32, align: 32)
!59 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !55, file: !59, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !55, file: !59, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !55, file: !59, line: 8, baseType: !64, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !54, line: 5, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !56, line: 24, size: 2496, align: 64, elements: !67)
!67 = !{!68, !70, !71, !72, !73, !74, !75, !76, !77, !79, !80, !81, !82, !83, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !69, line: 3, baseType: !60, size: 32, align: 32)
!69 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !66, file: !69, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !66, file: !69, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !66, file: !69, line: 9, baseType: !44, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !66, file: !69, line: 10, baseType: !60, size: 32, align: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !66, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !66, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !66, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !66, file: !69, line: 13, baseType: !78, size: 16, align: 16, offset: 448)
!78 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !69, line: 14, baseType: !44, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !66, file: !69, line: 15, baseType: !44, size: 64, align: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !66, file: !69, line: 16, baseType: !60, size: 32, align: 32, offset: 640)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !66, file: !69, line: 17, baseType: !44, size: 64, align: 64, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !66, file: !69, line: 19, baseType: !84, size: 64, align: 64, offset: 768)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !86, line: 99, baseType: !87)
!86 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !88, line: 22, size: 160, align: 32, elements: !89)
!88 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !87, file: !88, line: 23, baseType: !78, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !87, file: !88, line: 24, baseType: !92, size: 128, align: 32, offset: 32)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !93, line: 211, size: 128, align: 32, elements: !94)
!93 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!94 = !{!95}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !92, file: !93, line: 220, baseType: !96, size: 128, align: 32)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !92, file: !93, line: 213, size: 128, align: 32, elements: !97)
!97 = !{!98, !105, !110}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !96, file: !93, line: 215, baseType: !99, size: 128, align: 8)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, align: 8, elements: !103)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !101, line: 48, baseType: !102)
!101 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!103 = !{!104}
!104 = !DISubrange(count: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !96, file: !93, line: 217, baseType: !106, size: 128, align: 16)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, align: 16, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !101, line: 49, baseType: !78)
!108 = !{!109}
!109 = !DISubrange(count: 8)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !96, file: !93, line: 218, baseType: !111, size: 128, align: 32)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, align: 32, elements: !114)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !101, line: 51, baseType: !113)
!113 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!114 = !{!115}
!115 = !DISubrange(count: 4)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !66, file: !69, line: 19, baseType: !84, size: 64, align: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !66, file: !69, line: 21, baseType: !44, size: 64, align: 64, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !66, file: !69, line: 22, baseType: !44, size: 64, align: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !66, file: !69, line: 23, baseType: !44, size: 64, align: 64, offset: 1024)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !66, file: !69, line: 24, baseType: !44, size: 64, align: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !66, file: !69, line: 26, baseType: !44, size: 64, align: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !66, file: !69, line: 27, baseType: !44, size: 64, align: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !66, file: !69, line: 28, baseType: !44, size: 64, align: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !66, file: !69, line: 29, baseType: !44, size: 64, align: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !66, file: !69, line: 30, baseType: !44, size: 64, align: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !66, file: !69, line: 31, baseType: !44, size: 64, align: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !66, file: !69, line: 32, baseType: !44, size: 64, align: 64, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !66, file: !69, line: 33, baseType: !44, size: 64, align: 64, offset: 1600)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !66, file: !69, line: 35, baseType: !130, size: 64, align: 64, offset: 1664)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !133)
!133 = !{!134, !136, !277, !278, !283, !284, !285, !286, !287, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !132, file: !4, line: 100, baseType: !135, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !39, line: 49, baseType: !60)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !132, file: !4, line: 101, baseType: !137, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !140)
!140 = !{!141, !162, !168, !175, !179, !264, !268, !273}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !139, file: !4, line: 133, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !130, !37, !146, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !147, line: 66, baseType: !148)
!147 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !153, line: 42, baseType: !154)
!153 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !153, line: 44, size: 128, align: 64, elements: !155)
!155 = !{!156, !160, !161}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !154, file: !153, line: 46, baseType: !157, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !158, line: 36, baseType: !159)
!158 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !147, line: 45, baseType: !113)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !154, file: !153, line: 47, baseType: !135, size: 32, align: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !154, file: !153, line: 48, baseType: !37, size: 64, align: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !139, file: !4, line: 138, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!145, !130, !166, !146, !149, !150}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !139, file: !4, line: 143, baseType: !169, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!145, !130, !172, !174, !150}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !147, line: 51, baseType: !173)
!173 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !139, file: !4, line: 147, baseType: !176, size: 64, align: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!145, !130, !150}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !139, file: !4, line: 149, baseType: !180, size: 64, align: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !130, !263}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !186)
!186 = !{!187, !189, !210, !239, !241, !245, !246, !247, !248, !256, !257, !258, !259}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !185, file: !16, line: 174, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !39, line: 77, baseType: !36)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !185, file: !16, line: 175, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !193)
!193 = !{!194, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !192, file: !16, line: 198, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !188}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !192, file: !16, line: 199, baseType: !195, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !192, file: !16, line: 200, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !188, !183, !203, !209}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !188}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !39, line: 50, baseType: !135)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !185, file: !16, line: 177, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !215)
!215 = !{!216, !221, !225, !229, !233, !234}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !214, file: !16, line: 216, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!208, !183, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !214, file: !16, line: 218, baseType: !222, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!208, !183}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !214, file: !16, line: 219, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!208, !183, !204, !188}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !214, file: !16, line: 222, baseType: !230, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !183}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !214, file: !16, line: 226, baseType: !204, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !214, file: !16, line: 227, baseType: !235, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !185, file: !16, line: 178, baseType: !240, size: 32, align: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !39, line: 55, baseType: !113)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !185, file: !16, line: 180, baseType: !242, size: 64, align: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !185, file: !16, line: 182, baseType: !135, size: 32, align: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !16, line: 183, baseType: !240, size: 32, align: 32, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !185, file: !16, line: 184, baseType: !240, size: 32, align: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !185, file: !16, line: 186, baseType: !249, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !251, line: 37, baseType: !252)
!251 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !251, line: 39, size: 128, align: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !252, file: !251, line: 41, baseType: !188, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !251, line: 42, baseType: !249, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !16, line: 188, baseType: !183, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !16, line: 189, baseType: !183, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !16, line: 191, baseType: !44, size: 64, align: 64, offset: 640)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !185, file: !16, line: 193, baseType: !260, size: 64, align: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !139, file: !4, line: 151, baseType: !265, size: 64, align: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !130}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !139, file: !4, line: 152, baseType: !269, size: 64, align: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!145, !130, !272, !150}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !139, file: !4, line: 155, baseType: !274, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!272, !130}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !132, file: !4, line: 103, baseType: !37, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !132, file: !4, line: 104, baseType: !279, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !280, line: 77, baseType: !281)
!280 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !280, line: 77, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !132, file: !4, line: 105, baseType: !279, size: 64, align: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !132, file: !4, line: 106, baseType: !37, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !132, file: !4, line: 107, baseType: !240, size: 32, align: 32, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !132, file: !4, line: 109, baseType: !146, size: 64, align: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !132, file: !4, line: 110, baseType: !288, size: 64, align: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !290, line: 39, baseType: !291)
!290 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !290, line: 41, size: 192, align: 64, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !291, file: !290, line: 43, baseType: !37, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !291, file: !290, line: 44, baseType: !146, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !291, file: !290, line: 45, baseType: !146, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !132, file: !4, line: 111, baseType: !288, size: 64, align: 64, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !132, file: !4, line: 112, baseType: !288, size: 64, align: 64, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !132, file: !4, line: 113, baseType: !299, size: 48, align: 8, offset: 704)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 6)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !132, file: !4, line: 117, baseType: !240, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !132, file: !4, line: 118, baseType: !240, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !132, file: !4, line: 119, baseType: !240, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !132, file: !4, line: 120, baseType: !240, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !132, file: !4, line: 121, baseType: !240, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !132, file: !4, line: 122, baseType: !240, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !132, file: !4, line: 124, baseType: !188, size: 64, align: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !132, file: !4, line: 125, baseType: !188, size: 64, align: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !66, file: !69, line: 38, baseType: !113, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !66, file: !69, line: 39, baseType: !113, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !66, file: !69, line: 40, baseType: !113, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !66, file: !69, line: 41, baseType: !113, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !66, file: !69, line: 42, baseType: !113, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !66, file: !69, line: 43, baseType: !113, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !66, file: !69, line: 44, baseType: !113, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !66, file: !69, line: 45, baseType: !113, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !66, file: !69, line: 46, baseType: !44, size: 64, align: 64, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !66, file: !69, line: 47, baseType: !44, size: 64, align: 64, offset: 1856)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !66, file: !56, line: 27, baseType: !44, size: 64, align: 64, offset: 1920)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !66, file: !56, line: 28, baseType: !44, size: 64, align: 64, offset: 1984)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !66, file: !56, line: 30, baseType: !60, size: 32, align: 32, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !66, file: !56, line: 31, baseType: !44, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !66, file: !56, line: 32, baseType: !44, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !66, file: !56, line: 34, baseType: !60, size: 32, align: 32, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !66, file: !56, line: 35, baseType: !60, size: 32, align: 32, offset: 2272)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !66, file: !56, line: 36, baseType: !60, size: 32, align: 32, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !66, file: !56, line: 38, baseType: !60, size: 32, align: 32, offset: 2336)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !66, file: !56, line: 38, baseType: !60, size: 32, align: 32, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !66, file: !56, line: 38, baseType: !60, size: 32, align: 32, offset: 2400)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !66, file: !56, line: 38, baseType: !60, size: 32, align: 32, offset: 2432)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !55, file: !59, line: 9, baseType: !333, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !334, line: 75, baseType: !335)
!334 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !336, line: 139, baseType: !173)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!337 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !55, file: !59, line: 10, baseType: !333, size: 64, align: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !55, file: !59, line: 12, baseType: !44, size: 64, align: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !55, file: !59, line: 13, baseType: !44, size: 64, align: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !55, file: !59, line: 15, baseType: !113, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !55, file: !59, line: 16, baseType: !113, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !55, file: !59, line: 17, baseType: !113, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !55, file: !59, line: 18, baseType: !113, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !55, file: !59, line: 19, baseType: !113, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !55, file: !59, line: 21, baseType: !346, size: 64, align: 64, offset: 512)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !86, line: 102, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !349, line: 7, size: 384, align: 64, elements: !350)
!349 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!350 = !{!351, !352, !356, !357, !358, !359, !360, !361}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !348, file: !349, line: 8, baseType: !130, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !348, file: !349, line: 9, baseType: !353, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !86, line: 101, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !86, line: 101, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !348, file: !349, line: 11, baseType: !60, size: 32, align: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !348, file: !349, line: 12, baseType: !60, size: 32, align: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !348, file: !349, line: 13, baseType: !60, size: 32, align: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !348, file: !349, line: 14, baseType: !44, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !348, file: !349, line: 15, baseType: !60, size: 32, align: 32, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !348, file: !349, line: 16, baseType: !113, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !55, file: !59, line: 22, baseType: !60, size: 32, align: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !55, file: !59, line: 25, baseType: !364, size: 128, align: 64, offset: 640)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 64, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 2)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !55, file: !59, line: 26, baseType: !60, size: 32, align: 32, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !55, file: !59, line: 27, baseType: !60, size: 32, align: 32, offset: 800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !55, file: !59, line: 29, baseType: !370, size: 64, align: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !86, line: 103, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !373, line: 4, size: 192, align: 64, elements: !374)
!373 = !DIFile(filename: "../../../src/core/rawlog.h", directory: "/home/lichi/Desktop/irssi/task1")
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "logging", scope: !372, file: !373, line: 5, baseType: !60, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !372, file: !373, line: 6, baseType: !60, size: 32, align: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !372, file: !373, line: 8, baseType: !60, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !372, file: !373, line: 9, baseType: !249, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !55, file: !59, line: 30, baseType: !380, size: 64, align: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !382, line: 37, baseType: !383)
!382 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !382, line: 37, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !55, file: !59, line: 32, baseType: !44, size: 64, align: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !55, file: !59, line: 33, baseType: !44, size: 64, align: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !55, file: !59, line: 34, baseType: !44, size: 64, align: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !55, file: !59, line: 35, baseType: !113, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !55, file: !59, line: 36, baseType: !113, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !55, file: !59, line: 37, baseType: !113, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !55, file: !59, line: 38, baseType: !113, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !55, file: !59, line: 40, baseType: !392, size: 128, align: 64, offset: 1216)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !39, line: 504, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !39, line: 506, size: 128, align: 64, elements: !394)
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !393, file: !39, line: 508, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !39, line: 48, baseType: !173)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !393, file: !39, line: 509, baseType: !396, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !55, file: !59, line: 41, baseType: !333, size: 64, align: 64, offset: 1344)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !55, file: !59, line: 42, baseType: !60, size: 32, align: 32, offset: 1408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !55, file: !59, line: 44, baseType: !249, size: 64, align: 64, offset: 1472)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !55, file: !59, line: 45, baseType: !249, size: 64, align: 64, offset: 1536)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !55, file: !59, line: 53, baseType: !403, size: 64, align: 64, offset: 1600)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !406, !41, !60}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !86, line: 107, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !409, line: 30, size: 2240, align: 64, elements: !410)
!409 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!410 = !{!411, !412, !413, !414, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !490, !494, !498, !502, !506, !583, !590, !594}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !59, line: 3, baseType: !60, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !408, file: !59, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !408, file: !59, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !408, file: !59, line: 8, baseType: !415, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !86, line: 113, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !409, line: 25, size: 1920, align: 64, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !69, line: 3, baseType: !60, size: 32, align: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !417, file: !69, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !417, file: !69, line: 6, baseType: !60, size: 32, align: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !417, file: !69, line: 9, baseType: !44, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !417, file: !69, line: 10, baseType: !60, size: 32, align: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !417, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !417, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !417, file: !69, line: 11, baseType: !44, size: 64, align: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !417, file: !69, line: 13, baseType: !78, size: 16, align: 16, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !417, file: !69, line: 14, baseType: !44, size: 64, align: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !417, file: !69, line: 15, baseType: !44, size: 64, align: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !417, file: !69, line: 16, baseType: !60, size: 32, align: 32, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !417, file: !69, line: 17, baseType: !44, size: 64, align: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !417, file: !69, line: 19, baseType: !84, size: 64, align: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !417, file: !69, line: 19, baseType: !84, size: 64, align: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !417, file: !69, line: 21, baseType: !44, size: 64, align: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !417, file: !69, line: 22, baseType: !44, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !417, file: !69, line: 23, baseType: !44, size: 64, align: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !417, file: !69, line: 24, baseType: !44, size: 64, align: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !417, file: !69, line: 26, baseType: !44, size: 64, align: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !417, file: !69, line: 27, baseType: !44, size: 64, align: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !417, file: !69, line: 28, baseType: !44, size: 64, align: 64, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !417, file: !69, line: 29, baseType: !44, size: 64, align: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !417, file: !69, line: 30, baseType: !44, size: 64, align: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !417, file: !69, line: 31, baseType: !44, size: 64, align: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !417, file: !69, line: 32, baseType: !44, size: 64, align: 64, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !417, file: !69, line: 33, baseType: !44, size: 64, align: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !417, file: !69, line: 35, baseType: !130, size: 64, align: 64, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !417, file: !69, line: 38, baseType: !113, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !417, file: !69, line: 39, baseType: !113, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !417, file: !69, line: 40, baseType: !113, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !417, file: !69, line: 41, baseType: !113, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !417, file: !69, line: 42, baseType: !113, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !417, file: !69, line: 43, baseType: !113, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !417, file: !69, line: 44, baseType: !113, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !417, file: !69, line: 45, baseType: !113, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !417, file: !69, line: 46, baseType: !44, size: 64, align: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !417, file: !69, line: 47, baseType: !44, size: 64, align: 64, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !408, file: !59, line: 9, baseType: !333, size: 64, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !408, file: !59, line: 10, baseType: !333, size: 64, align: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !408, file: !59, line: 12, baseType: !44, size: 64, align: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !408, file: !59, line: 13, baseType: !44, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !408, file: !59, line: 15, baseType: !113, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !408, file: !59, line: 16, baseType: !113, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !408, file: !59, line: 17, baseType: !113, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !408, file: !59, line: 18, baseType: !113, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !408, file: !59, line: 19, baseType: !113, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !408, file: !59, line: 21, baseType: !346, size: 64, align: 64, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !408, file: !59, line: 22, baseType: !60, size: 32, align: 32, offset: 576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !408, file: !59, line: 25, baseType: !364, size: 128, align: 64, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !408, file: !59, line: 26, baseType: !60, size: 32, align: 32, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !408, file: !59, line: 27, baseType: !60, size: 32, align: 32, offset: 800)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !408, file: !59, line: 29, baseType: !370, size: 64, align: 64, offset: 832)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !408, file: !59, line: 30, baseType: !380, size: 64, align: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !408, file: !59, line: 32, baseType: !44, size: 64, align: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !408, file: !59, line: 33, baseType: !44, size: 64, align: 64, offset: 1024)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !408, file: !59, line: 34, baseType: !44, size: 64, align: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !408, file: !59, line: 35, baseType: !113, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !408, file: !59, line: 36, baseType: !113, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !408, file: !59, line: 37, baseType: !113, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !408, file: !59, line: 38, baseType: !113, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !408, file: !59, line: 40, baseType: !392, size: 128, align: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !408, file: !59, line: 41, baseType: !333, size: 64, align: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !408, file: !59, line: 42, baseType: !60, size: 32, align: 32, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !408, file: !59, line: 44, baseType: !249, size: 64, align: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !408, file: !59, line: 45, baseType: !249, size: 64, align: 64, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !408, file: !59, line: 53, baseType: !403, size: 64, align: 64, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !408, file: !59, line: 55, baseType: !487, size: 64, align: 64, offset: 1664)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!60, !406, !40}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !408, file: !59, line: 57, baseType: !491, size: 64, align: 64, offset: 1728)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!60, !406, !41}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !408, file: !59, line: 60, baseType: !495, size: 64, align: 64, offset: 1792)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!41, !406}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !408, file: !59, line: 62, baseType: !499, size: 64, align: 64, offset: 1856)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !406, !41, !41, !60}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !408, file: !59, line: 65, baseType: !503, size: 64, align: 64, offset: 1920)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!43, !406, !41, !41}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !408, file: !59, line: 69, baseType: !507, size: 64, align: 64, offset: 1984)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !406, !41}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !86, line: 109, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !513, line: 15, size: 1408, align: 64, elements: !514)
!513 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!514 = !{!515, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !533, !537, !539, !540, !541, !542, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !516, line: 3, baseType: !60, size: 32, align: 32)
!516 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !512, file: !516, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !512, file: !516, line: 5, baseType: !380, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !512, file: !516, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !512, file: !516, line: 8, baseType: !406, size: 64, align: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !512, file: !516, line: 9, baseType: !44, size: 64, align: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !516, line: 10, baseType: !44, size: 64, align: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !512, file: !516, line: 11, baseType: !333, size: 64, align: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !512, file: !516, line: 12, baseType: !60, size: 32, align: 32, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !512, file: !516, line: 13, baseType: !44, size: 64, align: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !512, file: !516, line: 15, baseType: !527, size: 64, align: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !86, line: 108, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !86, line: 108, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !512, file: !516, line: 17, baseType: !534, size: 64, align: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!41, !530}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !512, file: !538, line: 5, baseType: !44, size: 64, align: 64, offset: 704)
!538 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !512, file: !538, line: 6, baseType: !44, size: 64, align: 64, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !512, file: !538, line: 7, baseType: !333, size: 64, align: 64, offset: 832)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !512, file: !538, line: 9, baseType: !380, size: 64, align: 64, offset: 896)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !512, file: !538, line: 10, baseType: !543, size: 64, align: 64, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !86, line: 111, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !546, line: 13, size: 576, align: 64, elements: !547)
!546 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!547 = !{!548, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !564, !565}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !549, line: 3, baseType: !60, size: 32, align: 32)
!549 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !545, file: !549, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !545, file: !549, line: 6, baseType: !333, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !545, file: !549, line: 8, baseType: !44, size: 64, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !545, file: !549, line: 9, baseType: !44, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !545, file: !549, line: 10, baseType: !44, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !545, file: !549, line: 11, baseType: !60, size: 32, align: 32, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !545, file: !549, line: 14, baseType: !113, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !545, file: !549, line: 15, baseType: !113, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !545, file: !549, line: 18, baseType: !113, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !545, file: !549, line: 19, baseType: !113, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !545, file: !549, line: 20, baseType: !113, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !545, file: !549, line: 21, baseType: !113, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !545, file: !549, line: 22, baseType: !563, size: 64, align: 8, offset: 360)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, align: 8, elements: !108)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !545, file: !549, line: 26, baseType: !36, size: 64, align: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !549, line: 28, baseType: !543, size: 64, align: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !512, file: !538, line: 12, baseType: !113, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !512, file: !538, line: 13, baseType: !44, size: 64, align: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !512, file: !538, line: 14, baseType: !60, size: 32, align: 32, offset: 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !512, file: !538, line: 15, baseType: !44, size: 64, align: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !512, file: !538, line: 17, baseType: !113, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !512, file: !538, line: 18, baseType: !113, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !512, file: !538, line: 19, baseType: !113, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !512, file: !538, line: 20, baseType: !113, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !512, file: !538, line: 22, baseType: !113, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !512, file: !538, line: 23, baseType: !113, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !512, file: !538, line: 24, baseType: !113, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !512, file: !538, line: 25, baseType: !113, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !512, file: !538, line: 26, baseType: !113, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !512, file: !538, line: 31, baseType: !580, size: 64, align: 64, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!44, !510}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !408, file: !59, line: 70, baseType: !584, size: 64, align: 64, offset: 2048)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !406, !41}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !86, line: 110, baseType: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !86, line: 110, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !408, file: !59, line: 71, baseType: !591, size: 64, align: 64, offset: 2112)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!60, !41, !41}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !408, file: !59, line: 73, baseType: !591, size: 64, align: 64, offset: 2176)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !55, file: !59, line: 55, baseType: !487, size: 64, align: 64, offset: 1664)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !55, file: !59, line: 57, baseType: !491, size: 64, align: 64, offset: 1728)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !55, file: !59, line: 60, baseType: !495, size: 64, align: 64, offset: 1792)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !55, file: !59, line: 62, baseType: !499, size: 64, align: 64, offset: 1856)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !55, file: !59, line: 65, baseType: !503, size: 64, align: 64, offset: 1920)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !55, file: !59, line: 69, baseType: !507, size: 64, align: 64, offset: 1984)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !55, file: !59, line: 70, baseType: !584, size: 64, align: 64, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !55, file: !59, line: 71, baseType: !591, size: 64, align: 64, offset: 2112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !55, file: !59, line: 73, baseType: !591, size: 64, align: 64, offset: 2176)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !55, file: !56, line: 46, baseType: !249, size: 64, align: 64, offset: 2240)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !55, file: !56, line: 47, baseType: !249, size: 64, align: 64, offset: 2304)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !55, file: !56, line: 48, baseType: !607, size: 64, align: 64, offset: 2368)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !54, line: 8, baseType: !609)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !54, line: 8, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !55, file: !56, line: 49, baseType: !249, size: 64, align: 64, offset: 2432)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !55, file: !56, line: 51, baseType: !44, size: 64, align: 64, offset: 2496)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !55, file: !56, line: 53, baseType: !44, size: 64, align: 64, offset: 2560)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !55, file: !56, line: 54, baseType: !44, size: 64, align: 64, offset: 2624)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !55, file: !56, line: 55, baseType: !44, size: 64, align: 64, offset: 2688)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !55, file: !56, line: 56, baseType: !44, size: 64, align: 64, offset: 2752)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !55, file: !56, line: 57, baseType: !60, size: 32, align: 32, offset: 2816)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !55, file: !56, line: 59, baseType: !113, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !55, file: !56, line: 60, baseType: !113, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !55, file: !56, line: 62, baseType: !113, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !55, file: !56, line: 63, baseType: !113, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !55, file: !56, line: 64, baseType: !113, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !55, file: !56, line: 65, baseType: !113, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !55, file: !56, line: 66, baseType: !113, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !55, file: !56, line: 67, baseType: !113, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !55, file: !56, line: 68, baseType: !113, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !55, file: !56, line: 69, baseType: !113, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !55, file: !56, line: 70, baseType: !113, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !55, file: !56, line: 71, baseType: !113, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !55, file: !56, line: 72, baseType: !113, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !55, file: !56, line: 74, baseType: !60, size: 32, align: 32, offset: 2880)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !55, file: !56, line: 75, baseType: !60, size: 32, align: 32, offset: 2912)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !55, file: !56, line: 76, baseType: !60, size: 32, align: 32, offset: 2944)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !55, file: !56, line: 77, baseType: !60, size: 32, align: 32, offset: 2976)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !55, file: !56, line: 79, baseType: !380, size: 64, align: 64, offset: 3008)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !55, file: !56, line: 80, baseType: !249, size: 64, align: 64, offset: 3072)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !55, file: !56, line: 81, baseType: !249, size: 64, align: 64, offset: 3136)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !55, file: !56, line: 83, baseType: !288, size: 64, align: 64, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !55, file: !56, line: 84, baseType: !240, size: 32, align: 32, offset: 3264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !55, file: !56, line: 87, baseType: !60, size: 32, align: 32, offset: 3296)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !55, file: !56, line: 91, baseType: !249, size: 64, align: 64, offset: 3328)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !55, file: !56, line: 92, baseType: !392, size: 128, align: 64, offset: 3392)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !55, file: !56, line: 93, baseType: !392, size: 128, align: 64, offset: 3520)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !55, file: !56, line: 95, baseType: !60, size: 32, align: 32, offset: 3648)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !55, file: !56, line: 96, baseType: !60, size: 32, align: 32, offset: 3680)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !55, file: !56, line: 97, baseType: !60, size: 32, align: 32, offset: 3712)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !55, file: !56, line: 100, baseType: !249, size: 64, align: 64, offset: 3776)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !55, file: !56, line: 103, baseType: !249, size: 64, align: 64, offset: 3840)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !55, file: !56, line: 106, baseType: !249, size: 64, align: 64, offset: 3904)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !55, file: !56, line: 108, baseType: !380, size: 64, align: 64, offset: 3968)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !55, file: !56, line: 109, baseType: !249, size: 64, align: 64, offset: 4032)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !55, file: !56, line: 111, baseType: !249, size: 64, align: 64, offset: 4096)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !55, file: !56, line: 114, baseType: !36, size: 64, align: 64, offset: 4160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !55, file: !56, line: 116, baseType: !380, size: 64, align: 64, offset: 4224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !55, file: !56, line: 117, baseType: !655, size: 32768, align: 64, offset: 4288)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 32768, align: 64, elements: !705)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !657, line: 10, size: 128, align: 64, elements: !658)
!657 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!658 = !{!659, !704}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !656, file: !657, line: 11, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !657, line: 7, baseType: !662)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664, !41, !40, !40, !44, !288}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !54, line: 7, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !667, line: 15, size: 1600, align: 64, elements: !668)
!667 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !666, file: !516, line: 3, baseType: !60, size: 32, align: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !666, file: !516, line: 4, baseType: !60, size: 32, align: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !666, file: !516, line: 5, baseType: !380, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !666, file: !516, line: 7, baseType: !36, size: 64, align: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !666, file: !516, line: 8, baseType: !52, size: 64, align: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !666, file: !516, line: 9, baseType: !44, size: 64, align: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !516, line: 10, baseType: !44, size: 64, align: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !666, file: !516, line: 11, baseType: !333, size: 64, align: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !666, file: !516, line: 12, baseType: !60, size: 32, align: 32, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !666, file: !516, line: 13, baseType: !44, size: 64, align: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !666, file: !516, line: 15, baseType: !527, size: 64, align: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !666, file: !516, line: 17, baseType: !534, size: 64, align: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !666, file: !538, line: 5, baseType: !44, size: 64, align: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !666, file: !538, line: 6, baseType: !44, size: 64, align: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !666, file: !538, line: 7, baseType: !333, size: 64, align: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !666, file: !538, line: 9, baseType: !380, size: 64, align: 64, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !666, file: !538, line: 10, baseType: !543, size: 64, align: 64, offset: 960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !666, file: !538, line: 12, baseType: !113, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !666, file: !538, line: 13, baseType: !44, size: 64, align: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !666, file: !538, line: 14, baseType: !60, size: 32, align: 32, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !666, file: !538, line: 15, baseType: !44, size: 64, align: 64, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !666, file: !538, line: 17, baseType: !113, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !666, file: !538, line: 18, baseType: !113, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !666, file: !538, line: 19, baseType: !113, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !666, file: !538, line: 20, baseType: !113, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !666, file: !538, line: 22, baseType: !113, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !666, file: !538, line: 23, baseType: !113, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !666, file: !538, line: 24, baseType: !113, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !666, file: !538, line: 25, baseType: !113, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !666, file: !538, line: 26, baseType: !113, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !666, file: !538, line: 31, baseType: !580, size: 64, align: 64, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !666, file: !667, line: 18, baseType: !249, size: 64, align: 64, offset: 1408)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !666, file: !667, line: 20, baseType: !333, size: 64, align: 64, offset: 1472)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !666, file: !667, line: 21, baseType: !60, size: 32, align: 32, offset: 1536)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !666, file: !667, line: 22, baseType: !60, size: 32, align: 32, offset: 1568)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !656, file: !657, line: 12, baseType: !40, size: 8, align: 8, offset: 64)
!705 = !{!706}
!706 = !DISubrange(count: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !55, file: !56, line: 118, baseType: !708, size: 2048, align: 8, offset: 37056)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, align: 8, elements: !705)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !55, file: !56, line: 120, baseType: !591, size: 64, align: 64, offset: 39104)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !86, line: 60, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !36, !130, !60}
!714 = !{!715, !717, !718, !719}
!715 = distinct !DIGlobalVariable(name: "current_server_event", scope: !0, file: !716, line: 32, type: !44, isLocal: false, isDefinition: true, variable: i8** @current_server_event)
!716 = !DIFile(filename: "irc.c", directory: "/home/lichi/Desktop/irssi/task1")
!717 = distinct !DIGlobalVariable(name: "signal_default_event", scope: !0, file: !716, line: 33, type: !60, isLocal: true, isDefinition: true, variable: i32* @signal_default_event)
!718 = distinct !DIGlobalVariable(name: "signal_server_event", scope: !0, file: !716, line: 34, type: !60, isLocal: true, isDefinition: true, variable: i32* @signal_server_event)
!719 = distinct !DIGlobalVariable(name: "signal_server_incoming", scope: !0, file: !716, line: 35, type: !60, isLocal: true, isDefinition: true, variable: i32* @signal_server_incoming)
!720 = !{i32 2, !"Dwarf Version", i32 4}
!721 = !{i32 2, !"Debug Info Version", i32 3}
!722 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!723 = distinct !DISubprogram(name: "irc_send_cmd_full", scope: !716, file: !716, line: 48, type: !724, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !52, !41, !60, !60, !60}
!726 = !{}
!727 = !DILocalVariable(name: "server", arg: 1, scope: !723, file: !716, line: 48, type: !52)
!728 = !DIExpression()
!729 = !DILocation(line: 48, column: 40, scope: !723)
!730 = !DILocalVariable(name: "cmd", arg: 2, scope: !723, file: !716, line: 48, type: !41)
!731 = !DILocation(line: 48, column: 60, scope: !723)
!732 = !DILocalVariable(name: "send_now", arg: 3, scope: !723, file: !716, line: 49, type: !60)
!733 = !DILocation(line: 49, column: 14, scope: !723)
!734 = !DILocalVariable(name: "immediate", arg: 4, scope: !723, file: !716, line: 49, type: !60)
!735 = !DILocation(line: 49, column: 28, scope: !723)
!736 = !DILocalVariable(name: "raw", arg: 5, scope: !723, file: !716, line: 49, type: !60)
!737 = !DILocation(line: 49, column: 43, scope: !723)
!738 = !DILocalVariable(name: "str", scope: !723, file: !716, line: 51, type: !739)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4104, align: 8, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 513)
!742 = !DILocation(line: 51, column: 7, scope: !723)
!743 = !DILocalVariable(name: "len", scope: !723, file: !716, line: 52, type: !60)
!744 = !DILocation(line: 52, column: 6, scope: !723)
!745 = !DILocation(line: 54, column: 2, scope: !723)
!746 = distinct !{!746, !745}
!747 = !DILocation(line: 54, column: 10, scope: !748)
!748 = !DILexicalBlockFile(scope: !749, file: !716, discriminator: 1)
!749 = distinct !DILexicalBlock(scope: !750, file: !716, line: 54, column: 10)
!750 = distinct !DILexicalBlock(scope: !723, file: !716, line: 54, column: 4)
!751 = !DILocation(line: 54, column: 17, scope: !748)
!752 = !DILocation(line: 54, column: 5, scope: !753)
!753 = !DILexicalBlockFile(scope: !754, file: !716, discriminator: 2)
!754 = distinct !DILexicalBlock(scope: !749, file: !716, line: 54, column: 3)
!755 = !DILocation(line: 54, column: 14, scope: !756)
!756 = !DILexicalBlockFile(scope: !757, file: !716, discriminator: 3)
!757 = distinct !DILexicalBlock(scope: !749, file: !716, line: 54, column: 12)
!758 = !DILocation(line: 54, column: 101, scope: !756)
!759 = !DILocation(line: 54, column: 112, scope: !760)
!760 = !DILexicalBlockFile(scope: !750, file: !716, discriminator: 4)
!761 = !DILocation(line: 55, column: 2, scope: !723)
!762 = distinct !{!762, !761}
!763 = !DILocation(line: 55, column: 10, scope: !764)
!764 = !DILexicalBlockFile(scope: !765, file: !716, discriminator: 1)
!765 = distinct !DILexicalBlock(scope: !766, file: !716, line: 55, column: 10)
!766 = distinct !DILexicalBlock(scope: !723, file: !716, line: 55, column: 4)
!767 = !DILocation(line: 55, column: 14, scope: !764)
!768 = !DILocation(line: 55, column: 5, scope: !769)
!769 = !DILexicalBlockFile(scope: !770, file: !716, discriminator: 2)
!770 = distinct !DILexicalBlock(scope: !765, file: !716, line: 55, column: 3)
!771 = !DILocation(line: 55, column: 14, scope: !772)
!772 = !DILexicalBlockFile(scope: !773, file: !716, discriminator: 3)
!773 = distinct !DILexicalBlock(scope: !765, file: !716, line: 55, column: 12)
!774 = !DILocation(line: 55, column: 98, scope: !772)
!775 = !DILocation(line: 55, column: 109, scope: !776)
!776 = !DILexicalBlockFile(scope: !766, file: !716, discriminator: 4)
!777 = !DILocation(line: 57, column: 6, scope: !778)
!778 = distinct !DILexicalBlock(scope: !723, file: !716, line: 57, column: 6)
!779 = !DILocation(line: 57, column: 14, scope: !778)
!780 = !DILocation(line: 57, column: 6, scope: !723)
!781 = !DILocation(line: 58, column: 3, scope: !778)
!782 = !DILocation(line: 60, column: 15, scope: !723)
!783 = !DILocation(line: 60, column: 8, scope: !723)
!784 = !DILocation(line: 60, column: 6, scope: !723)
!785 = !DILocation(line: 61, column: 6, scope: !786)
!786 = distinct !DILexicalBlock(scope: !723, file: !716, line: 61, column: 6)
!787 = !DILocation(line: 61, column: 14, scope: !786)
!788 = !DILocation(line: 61, column: 23, scope: !786)
!789 = !DILocation(line: 61, column: 6, scope: !723)
!790 = !DILocation(line: 62, column: 3, scope: !786)
!791 = !DILocation(line: 63, column: 2, scope: !723)
!792 = !DILocation(line: 63, column: 10, scope: !723)
!793 = !DILocation(line: 63, column: 18, scope: !723)
!794 = !DILocation(line: 65, column: 7, scope: !795)
!795 = distinct !DILexicalBlock(scope: !723, file: !716, line: 65, column: 6)
!796 = !DILocation(line: 65, column: 6, scope: !723)
!797 = !DILocation(line: 68, column: 11, scope: !798)
!798 = distinct !DILexicalBlock(scope: !795, file: !716, line: 65, column: 12)
!799 = !DILocation(line: 68, column: 16, scope: !798)
!800 = !DILocation(line: 68, column: 3, scope: !798)
!801 = !DILocation(line: 69, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !798, file: !716, line: 69, column: 7)
!803 = !DILocation(line: 69, column: 11, scope: !802)
!804 = !DILocation(line: 69, column: 7, scope: !798)
!805 = !DILocation(line: 69, column: 22, scope: !806)
!806 = !DILexicalBlockFile(scope: !802, file: !716, discriminator: 1)
!807 = !DILocation(line: 69, column: 18, scope: !806)
!808 = !DILocation(line: 70, column: 7, scope: !798)
!809 = !DILocation(line: 70, column: 3, scope: !798)
!810 = !DILocation(line: 70, column: 12, scope: !798)
!811 = !DILocation(line: 71, column: 23, scope: !798)
!812 = !DILocation(line: 71, column: 21, scope: !798)
!813 = !DILocation(line: 72, column: 2, scope: !798)
!814 = !DILocation(line: 74, column: 6, scope: !815)
!815 = distinct !DILexicalBlock(scope: !723, file: !716, line: 74, column: 6)
!816 = !DILocation(line: 74, column: 6, scope: !723)
!817 = !DILocation(line: 75, column: 17, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !716, line: 74, column: 16)
!819 = !DILocation(line: 75, column: 25, scope: !818)
!820 = !DILocation(line: 75, column: 33, scope: !818)
!821 = !DILocation(line: 75, column: 3, scope: !818)
!822 = !DILocation(line: 76, column: 27, scope: !818)
!823 = !DILocation(line: 76, column: 35, scope: !818)
!824 = !DILocation(line: 76, column: 40, scope: !818)
!825 = !DILocation(line: 76, column: 48, scope: !818)
!826 = !DILocation(line: 76, column: 3, scope: !818)
!827 = !DILocation(line: 77, column: 17, scope: !818)
!828 = !DILocation(line: 77, column: 25, scope: !818)
!829 = !DILocation(line: 77, column: 39, scope: !818)
!830 = !DILocation(line: 78, column: 2, scope: !818)
!831 = !DILocation(line: 80, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !723, file: !716, line: 80, column: 6)
!833 = !DILocation(line: 80, column: 6, scope: !723)
!834 = !DILocation(line: 82, column: 10, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !716, line: 80, column: 12)
!836 = !DILocation(line: 82, column: 3, scope: !835)
!837 = !DILocation(line: 82, column: 14, scope: !835)
!838 = !DILocation(line: 83, column: 10, scope: !835)
!839 = !DILocation(line: 83, column: 3, scope: !835)
!840 = !DILocation(line: 83, column: 14, scope: !835)
!841 = !DILocation(line: 84, column: 7, scope: !835)
!842 = !DILocation(line: 84, column: 3, scope: !835)
!843 = !DILocation(line: 84, column: 12, scope: !835)
!844 = !DILocation(line: 85, column: 2, scope: !835)
!845 = !DILocation(line: 87, column: 6, scope: !846)
!846 = distinct !DILexicalBlock(scope: !723, file: !716, line: 87, column: 6)
!847 = !DILocation(line: 87, column: 6, scope: !723)
!848 = !DILocation(line: 88, column: 38, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !716, line: 87, column: 16)
!850 = !DILocation(line: 88, column: 46, scope: !849)
!851 = !DILocation(line: 88, column: 51, scope: !849)
!852 = !DILocation(line: 88, column: 17, scope: !849)
!853 = !DILocation(line: 89, column: 2, scope: !849)
!854 = !DILocation(line: 92, column: 7, scope: !855)
!855 = distinct !DILexicalBlock(scope: !856, file: !716, line: 92, column: 7)
!856 = distinct !DILexicalBlock(scope: !846, file: !716, line: 89, column: 9)
!857 = !DILocation(line: 92, column: 7, scope: !856)
!858 = !DILocation(line: 93, column: 39, scope: !859)
!859 = distinct !DILexicalBlock(scope: !855, file: !716, line: 92, column: 18)
!860 = !DILocation(line: 93, column: 47, scope: !859)
!861 = !DILocation(line: 94, column: 11, scope: !859)
!862 = !DILocation(line: 94, column: 19, scope: !859)
!863 = !DILocation(line: 93, column: 23, scope: !859)
!864 = !DILocation(line: 93, column: 4, scope: !859)
!865 = !DILocation(line: 93, column: 12, scope: !859)
!866 = !DILocation(line: 93, column: 21, scope: !859)
!867 = !DILocation(line: 95, column: 39, scope: !859)
!868 = !DILocation(line: 95, column: 47, scope: !859)
!869 = !DILocation(line: 96, column: 20, scope: !859)
!870 = !DILocation(line: 96, column: 11, scope: !859)
!871 = !DILocation(line: 95, column: 23, scope: !859)
!872 = !DILocation(line: 95, column: 4, scope: !859)
!873 = !DILocation(line: 95, column: 12, scope: !859)
!874 = !DILocation(line: 95, column: 21, scope: !859)
!875 = !DILocation(line: 97, column: 3, scope: !859)
!876 = !DILocation(line: 98, column: 38, scope: !877)
!877 = distinct !DILexicalBlock(scope: !855, file: !716, line: 97, column: 10)
!878 = !DILocation(line: 98, column: 46, scope: !877)
!879 = !DILocation(line: 99, column: 19, scope: !877)
!880 = !DILocation(line: 99, column: 10, scope: !877)
!881 = !DILocation(line: 98, column: 23, scope: !877)
!882 = !DILocation(line: 98, column: 4, scope: !877)
!883 = !DILocation(line: 98, column: 12, scope: !877)
!884 = !DILocation(line: 98, column: 21, scope: !877)
!885 = !DILocation(line: 100, column: 38, scope: !877)
!886 = !DILocation(line: 100, column: 46, scope: !877)
!887 = !DILocation(line: 101, column: 10, scope: !877)
!888 = !DILocation(line: 101, column: 18, scope: !877)
!889 = !DILocation(line: 100, column: 23, scope: !877)
!890 = !DILocation(line: 100, column: 4, scope: !877)
!891 = !DILocation(line: 100, column: 12, scope: !877)
!892 = !DILocation(line: 100, column: 21, scope: !877)
!893 = !DILocation(line: 104, column: 9, scope: !723)
!894 = !DILocation(line: 104, column: 17, scope: !723)
!895 = !DILocation(line: 104, column: 31, scope: !723)
!896 = !DILocation(line: 105, column: 1, scope: !723)
!897 = !DILocation(line: 105, column: 1, scope: !898)
!898 = !DILexicalBlockFile(scope: !723, file: !716, discriminator: 1)
!899 = distinct !DISubprogram(name: "irc_send_cmd", scope: !716, file: !716, line: 108, type: !900, isLocal: false, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !726)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !52, !41}
!902 = !DILocalVariable(name: "server", arg: 1, scope: !899, file: !716, line: 108, type: !52)
!903 = !DILocation(line: 108, column: 35, scope: !899)
!904 = !DILocalVariable(name: "cmd", arg: 2, scope: !899, file: !716, line: 108, type: !41)
!905 = !DILocation(line: 108, column: 55, scope: !899)
!906 = !DILocalVariable(name: "now", scope: !899, file: !716, line: 110, type: !392)
!907 = !DILocation(line: 110, column: 11, scope: !899)
!908 = !DILocalVariable(name: "send_now", scope: !899, file: !716, line: 111, type: !60)
!909 = !DILocation(line: 111, column: 6, scope: !899)
!910 = !DILocation(line: 113, column: 9, scope: !899)
!911 = !DILocation(line: 114, column: 34, scope: !899)
!912 = !DILocation(line: 114, column: 42, scope: !899)
!913 = !DILocation(line: 114, column: 13, scope: !899)
!914 = !DILocation(line: 114, column: 52, scope: !899)
!915 = !DILocation(line: 114, column: 57, scope: !899)
!916 = !DILocation(line: 115, column: 4, scope: !899)
!917 = !DILocation(line: 115, column: 12, scope: !899)
!918 = !DILocation(line: 115, column: 23, scope: !899)
!919 = !DILocation(line: 115, column: 31, scope: !899)
!920 = !DILocation(line: 115, column: 21, scope: !899)
!921 = !DILocation(line: 115, column: 48, scope: !899)
