; ModuleID = './line87-special-vars.o.i'
source_filename = "./line87-special-vars.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GString = type { i8*, i64, i64 }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!53 = !DIEnumerator(name: "_ISdigit", value: 2048)
!54 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!55 = !DIEnumerator(name: "_ISspace", value: 8192)
!56 = !DIEnumerator(name: "_ISprint", value: 16384)
!57 = !DIEnumerator(name: "_ISgraph", value: 32768)
!58 = !DIEnumerator(name: "_ISblank", value: 1)
!59 = !DIEnumerator(name: "_IScntrl", value: 2)
!60 = !DIEnumerator(name: "_ISpunct", value: 4)
!61 = !DIEnumerator(name: "_ISalnum", value: 8)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 4, size: 32, align: 32, elements: !64)
!63 = !DIFile(filename: "settings.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72}
!65 = !DIEnumerator(name: "SETTING_TYPE_STRING", value: 0)
!66 = !DIEnumerator(name: "SETTING_TYPE_INT", value: 1)
!67 = !DIEnumerator(name: "SETTING_TYPE_BOOLEAN", value: 2)
!68 = !DIEnumerator(name: "SETTING_TYPE_TIME", value: 3)
!69 = !DIEnumerator(name: "SETTING_TYPE_LEVEL", value: 4)
!70 = !DIEnumerator(name: "SETTING_TYPE_SIZE", value: 5)
!71 = !DIEnumerator(name: "SETTING_TYPE_CHOICE", value: 6)
!72 = !DIEnumerator(name: "SETTING_TYPE_ANY", value: 7)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 7, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "expandos.h", directory: "/home/lichi/Desktop/irssi/task1")
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "EXPANDO_ARG_NONE", value: 1)
!77 = !DIEnumerator(name: "EXPANDO_ARG_SERVER", value: 2)
!78 = !DIEnumerator(name: "EXPANDO_ARG_WINDOW", value: 3)
!79 = !DIEnumerator(name: "EXPANDO_ARG_WINDOW_ITEM", value: 4)
!80 = !DIEnumerator(name: "EXPANDO_NEVER", value: 5)
!81 = !{!82, !83, !87, !89, !91, !92, !93, !90, !94, !103, !108, !109, !107, !111, !112}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!91 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!92 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!93 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !85, line: 90, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !100}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !85, line: 55, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !85, line: 78, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !85, line: 80, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !100, !100}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !85, line: 49, baseType: !91)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !85, line: 77, baseType: !82)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !85, line: 48, baseType: !110)
!110 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !85, line: 91, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !108, !108, !108}
!116 = !{!117, !449}
!117 = distinct !DIGlobalVariable(name: "nested_orig_cmd", scope: !118, file: !119, line: 367, type: !89, isLocal: true, isDefinition: true, variable: i8*** @parse_special.nested_orig_cmd)
!118 = distinct !DISubprogram(name: "parse_special", scope: !119, file: !119, line: 364, type: !120, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!119 = !DIFile(filename: "special-vars.c", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DISubroutineType(types: !121)
!121 = !{!90, !89, !122, !82, !89, !111, !111, !91}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !124, line: 107, baseType: !125)
!124 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !126, line: 30, size: 2240, align: 64, elements: !127)
!126 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !{!128, !130, !131, !132, !355, !360, !361, !362, !363, !364, !365, !366, !367, !368, !372, !373, !377, !378, !379, !383, !388, !389, !390, !391, !392, !393, !394, !395, !401, !402, !403, !404, !405, !409, !413, !417, !421, !425, !429, !436, !443, !447}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !129, line: 3, baseType: !91, size: 32, align: 32)
!129 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !125, file: !129, line: 4, baseType: !91, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !125, file: !129, line: 6, baseType: !91, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !125, file: !129, line: 8, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !124, line: 113, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !126, line: 25, size: 1920, align: 64, elements: !136)
!136 = !{!137, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !138, line: 3, baseType: !91, size: 32, align: 32)
!138 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !135, file: !138, line: 4, baseType: !91, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !135, file: !138, line: 6, baseType: !91, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !135, file: !138, line: 9, baseType: !90, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !135, file: !138, line: 10, baseType: !91, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !135, file: !138, line: 11, baseType: !90, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !135, file: !138, line: 11, baseType: !90, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !135, file: !138, line: 11, baseType: !90, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !135, file: !138, line: 13, baseType: !93, size: 16, align: 16, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !135, file: !138, line: 14, baseType: !90, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !135, file: !138, line: 15, baseType: !90, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !135, file: !138, line: 16, baseType: !91, size: 32, align: 32, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !135, file: !138, line: 17, baseType: !90, size: 64, align: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !135, file: !138, line: 19, baseType: !152, size: 64, align: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !124, line: 99, baseType: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !124, line: 99, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !135, file: !138, line: 19, baseType: !152, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !135, file: !138, line: 21, baseType: !90, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !135, file: !138, line: 22, baseType: !90, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !135, file: !138, line: 23, baseType: !90, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !135, file: !138, line: 24, baseType: !90, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !135, file: !138, line: 26, baseType: !90, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !135, file: !138, line: 27, baseType: !90, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !135, file: !138, line: 28, baseType: !90, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !135, file: !138, line: 29, baseType: !90, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !135, file: !138, line: 30, baseType: !90, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !135, file: !138, line: 31, baseType: !90, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !135, file: !138, line: 32, baseType: !90, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !135, file: !138, line: 33, baseType: !90, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !135, file: !138, line: 35, baseType: !169, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !172)
!172 = !{!173, !174, !312, !313, !318, !319, !320, !321, !322, !331, !332, !333, !337, !338, !339, !340, !341, !342, !343, !344}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !171, file: !4, line: 100, baseType: !107, size: 32, align: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !171, file: !4, line: 101, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !178)
!178 = !{!179, !200, !206, !212, !216, !299, !303, !308}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !177, file: !4, line: 133, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !169, !83, !184, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !185, line: 66, baseType: !186)
!185 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!186 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !191, line: 42, baseType: !192)
!191 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !191, line: 44, size: 128, align: 64, elements: !193)
!193 = !{!194, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !192, file: !191, line: 46, baseType: !195, size: 32, align: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !196, line: 36, baseType: !197)
!196 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !185, line: 45, baseType: !99)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !192, file: !191, line: 47, baseType: !107, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !192, file: !191, line: 48, baseType: !83, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !177, file: !4, line: 138, baseType: !201, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!183, !169, !204, !184, !187, !188}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !177, file: !4, line: 143, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!183, !169, !210, !211, !188}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !185, line: 51, baseType: !110)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !177, file: !4, line: 147, baseType: !213, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!183, !169, !188}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !177, file: !4, line: 149, baseType: !217, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !169, !298}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !223)
!223 = !{!224, !225, !246, !275, !276, !280, !281, !282, !283, !291, !292, !293, !294}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !222, file: !16, line: 174, baseType: !108, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !222, file: !16, line: 175, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !229)
!229 = !{!230, !234, !235}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !228, file: !16, line: 198, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !108}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !228, file: !16, line: 199, baseType: !231, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !228, file: !16, line: 200, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !108, !220, !239, !245}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !108}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !85, line: 50, baseType: !107)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !222, file: !16, line: 177, baseType: !247, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !251)
!251 = !{!252, !257, !261, !265, !269, !270}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !250, file: !16, line: 216, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!244, !220, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !250, file: !16, line: 218, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!244, !220}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !250, file: !16, line: 219, baseType: !262, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!244, !220, !240, !108}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !250, file: !16, line: 222, baseType: !266, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !220}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !250, file: !16, line: 226, baseType: !240, size: 64, align: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !250, file: !16, line: 227, baseType: !271, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !222, file: !16, line: 178, baseType: !98, size: 32, align: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !222, file: !16, line: 180, baseType: !277, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !222, file: !16, line: 182, baseType: !107, size: 32, align: 32, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !16, line: 183, baseType: !98, size: 32, align: 32, offset: 352)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !222, file: !16, line: 184, baseType: !98, size: 32, align: 32, offset: 384)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !222, file: !16, line: 186, baseType: !284, size: 64, align: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !286, line: 37, baseType: !287)
!286 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !286, line: 39, size: 128, align: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !286, line: 41, baseType: !108, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !286, line: 42, baseType: !284, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !16, line: 188, baseType: !220, size: 64, align: 64, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !16, line: 189, baseType: !220, size: 64, align: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !16, line: 191, baseType: !90, size: 64, align: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !222, file: !16, line: 193, baseType: !295, size: 64, align: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !297)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !177, file: !4, line: 151, baseType: !300, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !169}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !177, file: !4, line: 152, baseType: !304, size: 64, align: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!183, !169, !307, !188}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !177, file: !4, line: 155, baseType: !309, size: 64, align: 64, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!307, !169}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !171, file: !4, line: 103, baseType: !83, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !171, file: !4, line: 104, baseType: !314, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !315, line: 77, baseType: !316)
!315 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !315, line: 77, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !171, file: !4, line: 105, baseType: !314, size: 64, align: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !171, file: !4, line: 106, baseType: !83, size: 64, align: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !171, file: !4, line: 107, baseType: !98, size: 32, align: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !171, file: !4, line: 109, baseType: !184, size: 64, align: 64, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !171, file: !4, line: 110, baseType: !323, size: 64, align: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !325, line: 39, baseType: !326)
!325 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !325, line: 41, size: 192, align: 64, elements: !327)
!327 = !{!328, !329, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !326, file: !325, line: 43, baseType: !83, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !326, file: !325, line: 44, baseType: !184, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !326, file: !325, line: 45, baseType: !184, size: 64, align: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !171, file: !4, line: 111, baseType: !323, size: 64, align: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !171, file: !4, line: 112, baseType: !323, size: 64, align: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !171, file: !4, line: 113, baseType: !334, size: 48, align: 8, offset: 704)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, align: 8, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 6)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !171, file: !4, line: 117, baseType: !98, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !171, file: !4, line: 118, baseType: !98, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !171, file: !4, line: 119, baseType: !98, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !171, file: !4, line: 120, baseType: !98, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !171, file: !4, line: 121, baseType: !98, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !171, file: !4, line: 122, baseType: !98, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !171, file: !4, line: 124, baseType: !108, size: 64, align: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !171, file: !4, line: 125, baseType: !108, size: 64, align: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !135, file: !138, line: 38, baseType: !99, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !135, file: !138, line: 39, baseType: !99, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !135, file: !138, line: 40, baseType: !99, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !135, file: !138, line: 41, baseType: !99, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !135, file: !138, line: 42, baseType: !99, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !135, file: !138, line: 43, baseType: !99, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !135, file: !138, line: 44, baseType: !99, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !135, file: !138, line: 45, baseType: !99, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !135, file: !138, line: 46, baseType: !90, size: 64, align: 64, offset: 1792)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !135, file: !138, line: 47, baseType: !90, size: 64, align: 64, offset: 1856)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !125, file: !129, line: 9, baseType: !356, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !357, line: 75, baseType: !358)
!357 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !359, line: 139, baseType: !110)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!360 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !125, file: !129, line: 10, baseType: !356, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !125, file: !129, line: 12, baseType: !90, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !125, file: !129, line: 13, baseType: !90, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !125, file: !129, line: 15, baseType: !99, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !125, file: !129, line: 16, baseType: !99, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !125, file: !129, line: 17, baseType: !99, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !125, file: !129, line: 18, baseType: !99, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !125, file: !129, line: 19, baseType: !99, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !125, file: !129, line: 21, baseType: !369, size: 64, align: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !124, line: 102, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !124, line: 102, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !125, file: !129, line: 22, baseType: !91, size: 32, align: 32, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !125, file: !129, line: 25, baseType: !374, size: 128, align: 64, offset: 640)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 128, align: 64, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !125, file: !129, line: 26, baseType: !91, size: 32, align: 32, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !125, file: !129, line: 27, baseType: !91, size: 32, align: 32, offset: 800)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !125, file: !129, line: 29, baseType: !380, size: 64, align: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !124, line: 103, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !124, line: 103, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !125, file: !129, line: 30, baseType: !384, size: 64, align: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !386, line: 37, baseType: !387)
!386 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !386, line: 37, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !125, file: !129, line: 32, baseType: !90, size: 64, align: 64, offset: 960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !125, file: !129, line: 33, baseType: !90, size: 64, align: 64, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !125, file: !129, line: 34, baseType: !90, size: 64, align: 64, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !125, file: !129, line: 35, baseType: !99, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !125, file: !129, line: 36, baseType: !99, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !125, file: !129, line: 37, baseType: !99, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !125, file: !129, line: 38, baseType: !99, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !125, file: !129, line: 40, baseType: !396, size: 128, align: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !85, line: 504, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !85, line: 506, size: 128, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !397, file: !85, line: 508, baseType: !109, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !397, file: !85, line: 509, baseType: !109, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !125, file: !129, line: 41, baseType: !356, size: 64, align: 64, offset: 1344)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !125, file: !129, line: 42, baseType: !91, size: 32, align: 32, offset: 1408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !125, file: !129, line: 44, baseType: !284, size: 64, align: 64, offset: 1472)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !125, file: !129, line: 45, baseType: !284, size: 64, align: 64, offset: 1536)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !125, file: !129, line: 53, baseType: !406, size: 64, align: 64, offset: 1600)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !122, !87, !91}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !125, file: !129, line: 55, baseType: !410, size: 64, align: 64, offset: 1664)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!91, !122, !86}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !125, file: !129, line: 57, baseType: !414, size: 64, align: 64, offset: 1728)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!91, !122, !87}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !125, file: !129, line: 60, baseType: !418, size: 64, align: 64, offset: 1792)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!87, !122}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !125, file: !129, line: 62, baseType: !422, size: 64, align: 64, offset: 1856)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !122, !87, !87, !91}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !125, file: !129, line: 65, baseType: !426, size: 64, align: 64, offset: 1920)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!89, !122, !87, !87}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !125, file: !129, line: 69, baseType: !430, size: 64, align: 64, offset: 1984)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !122, !87}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !124, line: 109, baseType: !435)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !124, line: 109, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !125, file: !129, line: 70, baseType: !437, size: 64, align: 64, offset: 2048)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!440, !122, !87}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !124, line: 110, baseType: !442)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !124, line: 110, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !125, file: !129, line: 71, baseType: !444, size: 64, align: 64, offset: 2112)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!91, !87, !87}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !125, file: !129, line: 73, baseType: !444, size: 64, align: 64, offset: 2176)
!448 = !{}
!449 = distinct !DIGlobalVariable(name: "history_func", scope: !0, file: !119, line: 38, type: !450, isLocal: true, isDefinition: true, variable: i8* (i8*, i8*, i32*)** @history_func)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPECIAL_HISTORY_FUNC", file: !451, line: 16, baseType: !452)
!451 = !DIFile(filename: "special-vars.h", directory: "/home/lichi/Desktop/irssi/task1")
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!90, !87, !82, !111}
!455 = !{i32 2, !"Dwarf Version", i32 4}
!456 = !{i32 2, !"Debug Info Version", i32 3}
!457 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!458 = distinct !DISubprogram(name: "get_alignment", scope: !119, file: !119, line: 325, type: !459, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!459 = !DISubroutineType(types: !460)
!460 = !{!90, !87, !91, !91, !86}
!461 = !DILocalVariable(name: "text", arg: 1, scope: !458, file: !119, line: 325, type: !87)
!462 = !DIExpression()
!463 = !DILocation(line: 325, column: 33, scope: !458)
!464 = !DILocalVariable(name: "align", arg: 2, scope: !458, file: !119, line: 325, type: !91)
!465 = !DILocation(line: 325, column: 43, scope: !458)
!466 = !DILocalVariable(name: "flags", arg: 3, scope: !458, file: !119, line: 325, type: !91)
!467 = !DILocation(line: 325, column: 54, scope: !458)
!468 = !DILocalVariable(name: "pad", arg: 4, scope: !458, file: !119, line: 325, type: !86)
!469 = !DILocation(line: 325, column: 66, scope: !458)
!470 = !DILocalVariable(name: "str", scope: !458, file: !119, line: 327, type: !323)
!471 = !DILocation(line: 327, column: 11, scope: !458)
!472 = !DILocalVariable(name: "ret", scope: !458, file: !119, line: 328, type: !90)
!473 = !DILocation(line: 328, column: 8, scope: !458)
!474 = !DILocalVariable(name: "policy", scope: !458, file: !119, line: 329, type: !91)
!475 = !DILocation(line: 329, column: 6, scope: !458)
!476 = !DILocalVariable(name: "cut_bytes", scope: !458, file: !119, line: 330, type: !99)
!477 = !DILocation(line: 330, column: 15, scope: !458)
!478 = !DILocation(line: 332, column: 2, scope: !458)
!479 = distinct !{!479, !478}
!480 = !DILocation(line: 332, column: 10, scope: !481)
!481 = !DILexicalBlockFile(scope: !482, file: !119, discriminator: 1)
!482 = distinct !DILexicalBlock(scope: !483, file: !119, line: 332, column: 10)
!483 = distinct !DILexicalBlock(scope: !458, file: !119, line: 332, column: 4)
!484 = !DILocation(line: 332, column: 15, scope: !481)
!485 = !DILocation(line: 332, column: 5, scope: !486)
!486 = !DILexicalBlockFile(scope: !487, file: !119, discriminator: 2)
!487 = distinct !DILexicalBlock(scope: !482, file: !119, line: 332, column: 3)
!488 = !DILocation(line: 332, column: 14, scope: !489)
!489 = !DILexicalBlockFile(scope: !490, file: !119, discriminator: 3)
!490 = distinct !DILexicalBlock(scope: !482, file: !119, line: 332, column: 12)
!491 = !DILocation(line: 332, column: 99, scope: !489)
!492 = !DILocation(line: 332, column: 7, scope: !493)
!493 = !DILexicalBlockFile(scope: !483, file: !119, discriminator: 4)
!494 = !DILocation(line: 334, column: 25, scope: !458)
!495 = !DILocation(line: 334, column: 11, scope: !458)
!496 = !DILocation(line: 334, column: 9, scope: !458)
!497 = !DILocation(line: 336, column: 21, scope: !458)
!498 = !DILocation(line: 336, column: 8, scope: !458)
!499 = !DILocation(line: 336, column: 6, scope: !458)
!500 = !DILocation(line: 339, column: 7, scope: !501)
!501 = distinct !DILexicalBlock(scope: !458, file: !119, line: 339, column: 6)
!502 = !DILocation(line: 339, column: 13, scope: !501)
!503 = !DILocation(line: 339, column: 21, scope: !501)
!504 = !DILocation(line: 339, column: 24, scope: !505)
!505 = !DILexicalBlockFile(scope: !501, file: !119, discriminator: 1)
!506 = !DILocation(line: 339, column: 30, scope: !505)
!507 = !DILocation(line: 339, column: 34, scope: !505)
!508 = !DILocation(line: 339, column: 50, scope: !509)
!509 = !DILexicalBlockFile(scope: !501, file: !119, discriminator: 2)
!510 = !DILocation(line: 339, column: 56, scope: !509)
!511 = !DILocation(line: 339, column: 37, scope: !509)
!512 = !DILocation(line: 339, column: 66, scope: !509)
!513 = !DILocation(line: 339, column: 64, scope: !509)
!514 = !DILocation(line: 339, column: 6, scope: !509)
!515 = !DILocation(line: 340, column: 26, scope: !516)
!516 = distinct !DILexicalBlock(scope: !501, file: !119, line: 339, column: 73)
!517 = !DILocation(line: 340, column: 32, scope: !516)
!518 = !DILocation(line: 340, column: 40, scope: !516)
!519 = !DILocation(line: 340, column: 3, scope: !516)
!520 = !DILocation(line: 341, column: 21, scope: !516)
!521 = !DILocation(line: 341, column: 26, scope: !516)
!522 = !DILocation(line: 341, column: 3, scope: !516)
!523 = !DILocation(line: 342, column: 2, scope: !516)
!524 = !DILocation(line: 345, column: 6, scope: !525)
!525 = distinct !DILexicalBlock(scope: !458, file: !119, line: 345, column: 6)
!526 = !DILocation(line: 345, column: 12, scope: !525)
!527 = !DILocation(line: 345, column: 6, scope: !458)
!528 = !DILocalVariable(name: "pad_len", scope: !529, file: !119, line: 346, type: !91)
!529 = distinct !DILexicalBlock(scope: !525, file: !119, line: 345, column: 20)
!530 = !DILocation(line: 346, column: 7, scope: !529)
!531 = !DILocation(line: 346, column: 17, scope: !529)
!532 = !DILocation(line: 346, column: 38, scope: !529)
!533 = !DILocation(line: 346, column: 43, scope: !529)
!534 = !DILocation(line: 346, column: 48, scope: !529)
!535 = !DILocation(line: 346, column: 25, scope: !529)
!536 = !DILocation(line: 346, column: 23, scope: !529)
!537 = !DILocation(line: 347, column: 7, scope: !538)
!538 = distinct !DILexicalBlock(scope: !529, file: !119, line: 347, column: 7)
!539 = !DILocation(line: 347, column: 15, scope: !538)
!540 = !DILocation(line: 347, column: 7, scope: !529)
!541 = !DILocalVariable(name: "pad_full", scope: !542, file: !119, line: 348, type: !90)
!542 = distinct !DILexicalBlock(scope: !538, file: !119, line: 347, column: 20)
!543 = !DILocation(line: 348, column: 10, scope: !542)
!544 = !DILocation(line: 348, column: 32, scope: !542)
!545 = !DILocation(line: 348, column: 41, scope: !542)
!546 = !DILocation(line: 348, column: 21, scope: !542)
!547 = !DILocation(line: 349, column: 8, scope: !548)
!548 = distinct !DILexicalBlock(scope: !542, file: !119, line: 349, column: 8)
!549 = !DILocation(line: 349, column: 14, scope: !548)
!550 = !DILocation(line: 349, column: 8, scope: !542)
!551 = !DILocation(line: 350, column: 22, scope: !548)
!552 = !DILocation(line: 350, column: 27, scope: !548)
!553 = !DILocation(line: 350, column: 5, scope: !548)
!554 = !DILocation(line: 352, column: 21, scope: !548)
!555 = !DILocation(line: 352, column: 26, scope: !548)
!556 = !DILocation(line: 352, column: 5, scope: !548)
!557 = !DILocation(line: 353, column: 11, scope: !542)
!558 = !DILocation(line: 353, column: 4, scope: !542)
!559 = !DILocation(line: 354, column: 3, scope: !542)
!560 = !DILocation(line: 355, column: 2, scope: !529)
!561 = !DILocation(line: 357, column: 8, scope: !458)
!562 = !DILocation(line: 357, column: 13, scope: !458)
!563 = !DILocation(line: 357, column: 6, scope: !458)
!564 = !DILocation(line: 358, column: 16, scope: !458)
!565 = !DILocation(line: 358, column: 2, scope: !458)
!566 = !DILocation(line: 359, column: 9, scope: !458)
!567 = !DILocation(line: 359, column: 2, scope: !458)
!568 = !DILocation(line: 360, column: 1, scope: !458)
!569 = !DILocalVariable(name: "cmd", arg: 1, scope: !118, file: !119, line: 364, type: !89)
!570 = !DILocation(line: 364, column: 28, scope: !118)
!571 = !DILocalVariable(name: "server", arg: 2, scope: !118, file: !119, line: 364, type: !122)
!572 = !DILocation(line: 364, column: 45, scope: !118)
!573 = !DILocalVariable(name: "item", arg: 3, scope: !118, file: !119, line: 364, type: !82)
!574 = !DILocation(line: 364, column: 59, scope: !118)
!575 = !DILocalVariable(name: "arglist", arg: 4, scope: !118, file: !119, line: 365, type: !89)
!576 = !DILocation(line: 365, column: 14, scope: !118)
!577 = !DILocalVariable(name: "free_ret", arg: 5, scope: !118, file: !119, line: 365, type: !111)
!578 = !DILocation(line: 365, column: 28, scope: !118)
!579 = !DILocalVariable(name: "arg_used", arg: 6, scope: !118, file: !119, line: 365, type: !111)
!580 = !DILocation(line: 365, column: 43, scope: !118)
!581 = !DILocalVariable(name: "flags", arg: 7, scope: !118, file: !119, line: 365, type: !91)
!582 = !DILocation(line: 365, column: 57, scope: !118)
!583 = !DILocalVariable(name: "command", scope: !118, file: !119, line: 368, type: !86)
!584 = !DILocation(line: 368, column: 7, scope: !118)
!585 = !DILocalVariable(name: "value", scope: !118, file: !119, line: 368, type: !90)
!586 = !DILocation(line: 368, column: 17, scope: !118)
!587 = !DILocalVariable(name: "align_pad", scope: !118, file: !119, line: 370, type: !86)
!588 = !DILocation(line: 370, column: 7, scope: !118)
!589 = !DILocalVariable(name: "align", scope: !118, file: !119, line: 371, type: !91)
!590 = !DILocation(line: 371, column: 6, scope: !118)
!591 = !DILocalVariable(name: "align_flags", scope: !118, file: !119, line: 371, type: !91)
!592 = !DILocation(line: 371, column: 17, scope: !118)
!593 = !DILocalVariable(name: "nest_value", scope: !118, file: !119, line: 373, type: !90)
!594 = !DILocation(line: 373, column: 8, scope: !118)
!595 = !DILocalVariable(name: "brackets", scope: !118, file: !119, line: 374, type: !91)
!596 = !DILocation(line: 374, column: 6, scope: !118)
!597 = !DILocalVariable(name: "nest_free", scope: !118, file: !119, line: 374, type: !91)
!598 = !DILocation(line: 374, column: 16, scope: !118)
!599 = !DILocation(line: 376, column: 3, scope: !118)
!600 = !DILocation(line: 376, column: 12, scope: !118)
!601 = !DILocation(line: 377, column: 8, scope: !602)
!602 = distinct !DILexicalBlock(scope: !118, file: !119, line: 377, column: 6)
!603 = !DILocation(line: 377, column: 7, scope: !602)
!604 = !DILocation(line: 377, column: 6, scope: !602)
!605 = !DILocation(line: 377, column: 12, scope: !602)
!606 = !DILocation(line: 377, column: 6, scope: !118)
!607 = !DILocation(line: 378, column: 3, scope: !602)
!608 = !DILocation(line: 380, column: 14, scope: !118)
!609 = !DILocation(line: 380, column: 13, scope: !118)
!610 = !DILocation(line: 380, column: 12, scope: !118)
!611 = !DILocation(line: 380, column: 10, scope: !118)
!612 = !DILocation(line: 380, column: 21, scope: !118)
!613 = !DILocation(line: 380, column: 25, scope: !118)
!614 = !DILocation(line: 381, column: 10, scope: !118)
!615 = !DILocation(line: 381, column: 2, scope: !118)
!616 = !DILocation(line: 384, column: 27, scope: !617)
!617 = distinct !DILexicalBlock(scope: !618, file: !119, line: 384, column: 7)
!618 = distinct !DILexicalBlock(scope: !118, file: !119, line: 381, column: 19)
!619 = !DILocation(line: 384, column: 8, scope: !617)
!620 = !DILocation(line: 385, column: 18, scope: !617)
!621 = !DILocation(line: 385, column: 23, scope: !622)
!622 = !DILexicalBlockFile(scope: !617, file: !119, discriminator: 1)
!623 = !DILocation(line: 385, column: 22, scope: !622)
!624 = !DILocation(line: 385, column: 21, scope: !622)
!625 = !DILocation(line: 385, column: 27, scope: !622)
!626 = !DILocation(line: 384, column: 7, scope: !627)
!627 = !DILexicalBlockFile(scope: !618, file: !119, discriminator: 1)
!628 = !DILocation(line: 386, column: 6, scope: !629)
!629 = distinct !DILexicalBlock(scope: !617, file: !119, line: 385, column: 36)
!630 = !DILocation(line: 386, column: 10, scope: !629)
!631 = !DILocation(line: 387, column: 4, scope: !629)
!632 = !DILocation(line: 389, column: 3, scope: !618)
!633 = !DILocation(line: 391, column: 11, scope: !618)
!634 = !DILocation(line: 392, column: 5, scope: !618)
!635 = !DILocation(line: 392, column: 9, scope: !618)
!636 = !DILocation(line: 393, column: 2, scope: !618)
!637 = !DILocation(line: 395, column: 12, scope: !118)
!638 = !DILocation(line: 395, column: 30, scope: !118)
!639 = !DILocation(line: 426, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !118, file: !119, line: 426, column: 6)
!641 = !DILocation(line: 426, column: 6, scope: !118)
!642 = !DILocation(line: 426, column: 39, scope: !643)
!643 = !DILexicalBlockFile(scope: !640, file: !119, discriminator: 1)
!644 = !DILocation(line: 426, column: 23, scope: !643)
!645 = !DILocation(line: 429, column: 8, scope: !646)
!646 = distinct !DILexicalBlock(scope: !118, file: !119, line: 429, column: 6)
!647 = !DILocation(line: 429, column: 7, scope: !646)
!648 = !DILocation(line: 429, column: 6, scope: !646)
!649 = !DILocation(line: 429, column: 12, scope: !646)
!650 = !DILocation(line: 429, column: 6, scope: !118)
!651 = !DILocation(line: 430, column: 12, scope: !646)
!652 = !DILocation(line: 430, column: 3, scope: !646)
!653 = !DILocation(line: 433, column: 9, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !119, line: 433, column: 7)
!655 = distinct !DILexicalBlock(scope: !646, file: !119, line: 431, column: 7)
!656 = !DILocation(line: 433, column: 8, scope: !654)
!657 = !DILocation(line: 433, column: 7, scope: !654)
!658 = !DILocation(line: 433, column: 17, scope: !654)
!659 = !DILocation(line: 433, column: 7, scope: !655)
!660 = !DILocation(line: 434, column: 4, scope: !654)
!661 = !DILocation(line: 435, column: 5, scope: !655)
!662 = !DILocation(line: 435, column: 9, scope: !655)
!663 = !DILocation(line: 436, column: 12, scope: !655)
!664 = !DILocation(line: 439, column: 28, scope: !118)
!665 = !DILocation(line: 439, column: 33, scope: !118)
!666 = !DILocation(line: 439, column: 41, scope: !118)
!667 = !DILocation(line: 439, column: 47, scope: !118)
!668 = !DILocation(line: 440, column: 7, scope: !118)
!669 = !DILocation(line: 440, column: 17, scope: !118)
!670 = !DILocation(line: 440, column: 27, scope: !118)
!671 = !DILocation(line: 439, column: 10, scope: !118)
!672 = !DILocation(line: 439, column: 8, scope: !118)
!673 = !DILocation(line: 441, column: 8, scope: !674)
!674 = distinct !DILexicalBlock(scope: !118, file: !119, line: 441, column: 6)
!675 = !DILocation(line: 441, column: 7, scope: !674)
!676 = !DILocation(line: 441, column: 6, scope: !674)
!677 = !DILocation(line: 441, column: 12, scope: !674)
!678 = !DILocation(line: 441, column: 6, scope: !118)
!679 = !DILocation(line: 442, column: 3, scope: !674)
!680 = distinct !{!680, !679}
!681 = !DILocation(line: 442, column: 8, scope: !682)
!682 = !DILexicalBlockFile(scope: !683, file: !119, discriminator: 1)
!683 = distinct !DILexicalBlock(scope: !674, file: !119, line: 442, column: 6)
!684 = !DILocation(line: 442, column: 87, scope: !682)
!685 = !DILocation(line: 442, column: 87, scope: !686)
!686 = !DILexicalBlockFile(scope: !687, file: !119, discriminator: 2)
!687 = distinct !DILexicalBlock(scope: !688, file: !119, line: 442, column: 87)
!688 = distinct !DILexicalBlock(scope: !683, file: !119, line: 442, column: 87)
!689 = distinct !{!689, !690}
!690 = !DILocation(line: 442, column: 87, scope: !683)
!691 = !DILocation(line: 442, column: 98, scope: !692)
!692 = !DILexicalBlockFile(scope: !683, file: !119, discriminator: 3)
!693 = !DILocation(line: 444, column: 6, scope: !694)
!694 = distinct !DILexicalBlock(scope: !118, file: !119, line: 444, column: 6)
!695 = !DILocation(line: 444, column: 12, scope: !694)
!696 = !DILocation(line: 444, column: 19, scope: !694)
!697 = !DILocation(line: 444, column: 23, scope: !698)
!698 = !DILexicalBlockFile(scope: !694, file: !119, discriminator: 1)
!699 = !DILocation(line: 444, column: 22, scope: !698)
!700 = !DILocation(line: 444, column: 29, scope: !698)
!701 = !DILocation(line: 444, column: 37, scope: !698)
!702 = !DILocation(line: 444, column: 41, scope: !703)
!703 = !DILexicalBlockFile(scope: !694, file: !119, discriminator: 2)
!704 = !DILocation(line: 444, column: 47, scope: !703)
!705 = !DILocation(line: 444, column: 6, scope: !703)
!706 = !DILocation(line: 445, column: 4, scope: !694)
!707 = !DILocation(line: 445, column: 13, scope: !694)
!708 = !DILocation(line: 445, column: 3, scope: !694)
!709 = !DILocation(line: 447, column: 6, scope: !710)
!710 = distinct !DILexicalBlock(scope: !118, file: !119, line: 447, column: 6)
!711 = !DILocation(line: 447, column: 6, scope: !118)
!712 = !DILocation(line: 448, column: 3, scope: !713)
!713 = distinct !DILexicalBlock(scope: !710, file: !119, line: 447, column: 16)
!714 = !DILocation(line: 448, column: 12, scope: !715)
!715 = !DILexicalBlockFile(scope: !713, file: !119, discriminator: 1)
!716 = !DILocation(line: 448, column: 11, scope: !715)
!717 = !DILocation(line: 448, column: 10, scope: !715)
!718 = !DILocation(line: 448, column: 16, scope: !715)
!719 = !DILocation(line: 448, column: 23, scope: !715)
!720 = !DILocation(line: 448, column: 28, scope: !721)
!721 = !DILexicalBlockFile(scope: !713, file: !119, discriminator: 2)
!722 = !DILocation(line: 448, column: 27, scope: !721)
!723 = !DILocation(line: 448, column: 26, scope: !721)
!724 = !DILocation(line: 448, column: 36, scope: !721)
!725 = !DILocation(line: 448, column: 3, scope: !726)
!726 = !DILexicalBlockFile(scope: !713, file: !119, discriminator: 3)
!727 = !DILocation(line: 449, column: 6, scope: !713)
!728 = !DILocation(line: 449, column: 10, scope: !713)
!729 = !DILocation(line: 448, column: 3, scope: !730)
!730 = !DILexicalBlockFile(scope: !713, file: !119, discriminator: 4)
!731 = distinct !{!731, !712}
!732 = !DILocation(line: 450, column: 2, scope: !713)
!733 = !DILocation(line: 452, column: 6, scope: !734)
!734 = distinct !DILexicalBlock(scope: !118, file: !119, line: 452, column: 6)
!735 = !DILocation(line: 452, column: 6, scope: !118)
!736 = !DILocation(line: 452, column: 24, scope: !737)
!737 = !DILexicalBlockFile(scope: !734, file: !119, discriminator: 1)
!738 = !DILocation(line: 452, column: 17, scope: !737)
!739 = !DILocation(line: 454, column: 6, scope: !740)
!740 = distinct !DILexicalBlock(scope: !118, file: !119, line: 454, column: 6)
!741 = !DILocation(line: 454, column: 14, scope: !740)
!742 = !DILocation(line: 454, column: 21, scope: !740)
!743 = !DILocation(line: 454, column: 25, scope: !744)
!744 = !DILexicalBlockFile(scope: !740, file: !119, discriminator: 1)
!745 = !DILocation(line: 454, column: 31, scope: !744)
!746 = !DILocation(line: 454, column: 39, scope: !744)
!747 = !DILocation(line: 454, column: 6, scope: !744)
!748 = !DILocalVariable(name: "p", scope: !749, file: !119, line: 456, type: !90)
!749 = distinct !DILexicalBlock(scope: !740, file: !119, line: 454, column: 45)
!750 = !DILocation(line: 456, column: 9, scope: !749)
!751 = !DILocation(line: 458, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !119, line: 458, column: 7)
!753 = !DILocation(line: 458, column: 13, scope: !752)
!754 = !DILocation(line: 458, column: 7, scope: !749)
!755 = !DILocation(line: 458, column: 21, scope: !756)
!756 = !DILexicalBlockFile(scope: !752, file: !119, discriminator: 1)
!757 = !DILocation(line: 460, column: 21, scope: !749)
!758 = !DILocation(line: 460, column: 28, scope: !749)
!759 = !DILocation(line: 460, column: 35, scope: !749)
!760 = !DILocation(line: 460, column: 48, scope: !749)
!761 = !DILocation(line: 460, column: 7, scope: !749)
!762 = !DILocation(line: 460, column: 5, scope: !749)
!763 = !DILocation(line: 461, column: 8, scope: !764)
!764 = distinct !DILexicalBlock(scope: !749, file: !119, line: 461, column: 7)
!765 = !DILocation(line: 461, column: 7, scope: !764)
!766 = !DILocation(line: 461, column: 7, scope: !749)
!767 = !DILocation(line: 461, column: 25, scope: !768)
!768 = !DILexicalBlockFile(scope: !764, file: !119, discriminator: 1)
!769 = !DILocation(line: 461, column: 18, scope: !768)
!770 = !DILocation(line: 463, column: 4, scope: !749)
!771 = !DILocation(line: 463, column: 13, scope: !749)
!772 = !DILocation(line: 464, column: 10, scope: !749)
!773 = !DILocation(line: 464, column: 3, scope: !749)
!774 = !DILocation(line: 467, column: 9, scope: !118)
!775 = !DILocation(line: 467, column: 2, scope: !118)
!776 = !DILocation(line: 468, column: 1, scope: !118)
!777 = distinct !DISubprogram(name: "get_alignment_args", scope: !119, file: !119, line: 277, type: !778, isLocal: true, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!778 = !DISubroutineType(types: !779)
!779 = !{!91, !89, !111, !111, !90}
!780 = !DILocalVariable(name: "data", arg: 1, scope: !777, file: !119, line: 277, type: !89)
!781 = !DILocation(line: 277, column: 38, scope: !777)
!782 = !DILocalVariable(name: "align", arg: 2, scope: !777, file: !119, line: 277, type: !111)
!783 = !DILocation(line: 277, column: 49, scope: !777)
!784 = !DILocalVariable(name: "flags", arg: 3, scope: !777, file: !119, line: 277, type: !111)
!785 = !DILocation(line: 277, column: 61, scope: !777)
!786 = !DILocalVariable(name: "pad", arg: 4, scope: !777, file: !119, line: 277, type: !90)
!787 = !DILocation(line: 277, column: 74, scope: !777)
!788 = !DILocalVariable(name: "str", scope: !777, file: !119, line: 279, type: !90)
!789 = !DILocation(line: 279, column: 8, scope: !777)
!790 = !DILocalVariable(name: "endptr", scope: !777, file: !119, line: 280, type: !90)
!791 = !DILocation(line: 280, column: 8, scope: !777)
!792 = !DILocalVariable(name: "align_", scope: !777, file: !119, line: 281, type: !98)
!793 = !DILocation(line: 281, column: 8, scope: !777)
!794 = !DILocation(line: 283, column: 3, scope: !777)
!795 = !DILocation(line: 283, column: 9, scope: !777)
!796 = !DILocation(line: 284, column: 3, scope: !777)
!797 = !DILocation(line: 284, column: 9, scope: !777)
!798 = !DILocation(line: 285, column: 10, scope: !777)
!799 = !DILocation(line: 285, column: 14, scope: !777)
!800 = !DILocation(line: 288, column: 9, scope: !777)
!801 = !DILocation(line: 288, column: 8, scope: !777)
!802 = !DILocation(line: 288, column: 6, scope: !777)
!803 = !DILocation(line: 289, column: 2, scope: !777)
!804 = !DILocation(line: 289, column: 10, scope: !805)
!805 = !DILexicalBlockFile(scope: !777, file: !119, discriminator: 1)
!806 = !DILocation(line: 289, column: 9, scope: !805)
!807 = !DILocation(line: 289, column: 14, scope: !805)
!808 = !DILocation(line: 289, column: 22, scope: !805)
!809 = !DILocation(line: 289, column: 26, scope: !810)
!810 = !DILexicalBlockFile(scope: !777, file: !119, discriminator: 2)
!811 = !DILocation(line: 289, column: 25, scope: !810)
!812 = !DILocation(line: 289, column: 30, scope: !810)
!813 = !DILocation(line: 289, column: 37, scope: !810)
!814 = !DILocation(line: 289, column: 64, scope: !815)
!815 = !DILexicalBlockFile(scope: !777, file: !119, discriminator: 3)
!816 = !DILocation(line: 289, column: 63, scope: !815)
!817 = !DILocation(line: 289, column: 40, scope: !815)
!818 = !DILocation(line: 289, column: 41, scope: !815)
!819 = !DILocation(line: 289, column: 43, scope: !815)
!820 = !DILocation(line: 289, column: 42, scope: !815)
!821 = !DILocation(line: 289, column: 44, scope: !815)
!822 = !DILocation(line: 289, column: 2, scope: !823)
!823 = !DILexicalBlockFile(scope: !777, file: !119, discriminator: 4)
!824 = !DILocation(line: 290, column: 8, scope: !825)
!825 = distinct !DILexicalBlock(scope: !826, file: !119, line: 290, column: 7)
!826 = distinct !DILexicalBlock(scope: !777, file: !119, line: 289, column: 57)
!827 = !DILocation(line: 290, column: 7, scope: !825)
!828 = !DILocation(line: 290, column: 12, scope: !825)
!829 = !DILocation(line: 290, column: 7, scope: !826)
!830 = !DILocation(line: 291, column: 5, scope: !825)
!831 = !DILocation(line: 291, column: 11, scope: !825)
!832 = !DILocation(line: 291, column: 4, scope: !825)
!833 = !DILocation(line: 292, column: 13, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !119, line: 292, column: 12)
!835 = !DILocation(line: 292, column: 12, scope: !834)
!836 = !DILocation(line: 292, column: 17, scope: !834)
!837 = !DILocation(line: 292, column: 12, scope: !825)
!838 = !DILocation(line: 293, column: 5, scope: !834)
!839 = !DILocation(line: 293, column: 11, scope: !834)
!840 = !DILocation(line: 293, column: 4, scope: !834)
!841 = !DILocation(line: 294, column: 13, scope: !842)
!842 = distinct !DILexicalBlock(scope: !834, file: !119, line: 294, column: 12)
!843 = !DILocation(line: 294, column: 12, scope: !842)
!844 = !DILocation(line: 294, column: 17, scope: !842)
!845 = !DILocation(line: 294, column: 12, scope: !834)
!846 = !DILocation(line: 295, column: 27, scope: !842)
!847 = !DILocation(line: 295, column: 33, scope: !842)
!848 = !DILocation(line: 295, column: 26, scope: !842)
!849 = !DILocation(line: 296, column: 6, scope: !826)
!850 = !DILocation(line: 289, column: 2, scope: !851)
!851 = !DILexicalBlockFile(scope: !777, file: !119, discriminator: 5)
!852 = distinct !{!852, !803}
!853 = !DILocation(line: 298, column: 30, scope: !854)
!854 = distinct !DILexicalBlock(scope: !777, file: !119, line: 298, column: 6)
!855 = !DILocation(line: 298, column: 29, scope: !854)
!856 = !DILocation(line: 298, column: 6, scope: !854)
!857 = !DILocation(line: 298, column: 7, scope: !854)
!858 = !DILocation(line: 298, column: 9, scope: !854)
!859 = !DILocation(line: 298, column: 8, scope: !854)
!860 = !DILocation(line: 298, column: 10, scope: !854)
!861 = !DILocation(line: 298, column: 6, scope: !777)
!862 = !DILocation(line: 299, column: 3, scope: !854)
!863 = !DILocation(line: 302, column: 18, scope: !864)
!864 = distinct !DILexicalBlock(scope: !777, file: !119, line: 302, column: 6)
!865 = !DILocation(line: 302, column: 7, scope: !864)
!866 = !DILocation(line: 302, column: 6, scope: !777)
!867 = !DILocation(line: 303, column: 3, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !119, line: 302, column: 46)
!869 = !DILocation(line: 306, column: 6, scope: !870)
!870 = distinct !DILexicalBlock(scope: !777, file: !119, line: 306, column: 6)
!871 = !DILocation(line: 306, column: 13, scope: !870)
!872 = !DILocation(line: 306, column: 6, scope: !777)
!873 = !DILocation(line: 307, column: 3, scope: !874)
!874 = distinct !DILexicalBlock(scope: !870, file: !119, line: 306, column: 23)
!875 = !DILocation(line: 309, column: 8, scope: !777)
!876 = !DILocation(line: 309, column: 6, scope: !777)
!877 = !DILocation(line: 310, column: 11, scope: !777)
!878 = !DILocation(line: 310, column: 3, scope: !777)
!879 = !DILocation(line: 310, column: 9, scope: !777)
!880 = !DILocation(line: 313, column: 2, scope: !777)
!881 = !DILocation(line: 313, column: 10, scope: !805)
!882 = !DILocation(line: 313, column: 9, scope: !805)
!883 = !DILocation(line: 313, column: 14, scope: !805)
!884 = !DILocation(line: 313, column: 22, scope: !805)
!885 = !DILocation(line: 313, column: 26, scope: !810)
!886 = !DILocation(line: 313, column: 25, scope: !810)
!887 = !DILocation(line: 313, column: 30, scope: !810)
!888 = !DILocation(line: 313, column: 2, scope: !815)
!889 = !DILocation(line: 314, column: 11, scope: !890)
!890 = distinct !DILexicalBlock(scope: !777, file: !119, line: 313, column: 38)
!891 = !DILocation(line: 314, column: 10, scope: !890)
!892 = !DILocation(line: 314, column: 4, scope: !890)
!893 = !DILocation(line: 314, column: 8, scope: !890)
!894 = !DILocation(line: 315, column: 6, scope: !890)
!895 = !DILocation(line: 313, column: 2, scope: !823)
!896 = distinct !{!896, !880}
!897 = !DILocation(line: 318, column: 10, scope: !898)
!898 = distinct !DILexicalBlock(scope: !777, file: !119, line: 318, column: 6)
!899 = !DILocation(line: 318, column: 6, scope: !898)
!900 = !DILocation(line: 318, column: 13, scope: !898)
!901 = !DILocation(line: 318, column: 6, scope: !777)
!902 = !DILocation(line: 318, column: 21, scope: !903)
!903 = !DILexicalBlockFile(scope: !898, file: !119, discriminator: 1)
!904 = !DILocation(line: 320, column: 10, scope: !777)
!905 = !DILocation(line: 320, column: 3, scope: !777)
!906 = !DILocation(line: 320, column: 8, scope: !777)
!907 = !DILocation(line: 321, column: 2, scope: !777)
!908 = !DILocation(line: 322, column: 1, scope: !777)
!909 = distinct !DISubprogram(name: "get_special_value", scope: !119, file: !119, line: 198, type: !120, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!910 = !DILocalVariable(name: "cmd", arg: 1, scope: !909, file: !119, line: 198, type: !89)
!911 = !DILocation(line: 198, column: 39, scope: !909)
!912 = !DILocalVariable(name: "server", arg: 2, scope: !909, file: !119, line: 198, type: !122)
!913 = !DILocation(line: 198, column: 56, scope: !909)
!914 = !DILocalVariable(name: "item", arg: 3, scope: !909, file: !119, line: 198, type: !82)
!915 = !DILocation(line: 198, column: 70, scope: !909)
!916 = !DILocalVariable(name: "arglist", arg: 4, scope: !909, file: !119, line: 199, type: !89)
!917 = !DILocation(line: 199, column: 18, scope: !909)
!918 = !DILocalVariable(name: "free_ret", arg: 5, scope: !909, file: !119, line: 199, type: !111)
!919 = !DILocation(line: 199, column: 32, scope: !909)
!920 = !DILocalVariable(name: "arg_used", arg: 6, scope: !909, file: !119, line: 199, type: !111)
!921 = !DILocation(line: 199, column: 47, scope: !909)
!922 = !DILocalVariable(name: "flags", arg: 7, scope: !909, file: !119, line: 200, type: !91)
!923 = !DILocation(line: 200, column: 15, scope: !909)
!924 = !DILocalVariable(name: "command", scope: !909, file: !119, line: 202, type: !86)
!925 = !DILocation(line: 202, column: 7, scope: !909)
!926 = !DILocalVariable(name: "value", scope: !909, file: !119, line: 202, type: !90)
!927 = !DILocation(line: 202, column: 17, scope: !909)
!928 = !DILocalVariable(name: "p", scope: !909, file: !119, line: 202, type: !90)
!929 = !DILocation(line: 202, column: 25, scope: !909)
!930 = !DILocalVariable(name: "len", scope: !909, file: !119, line: 203, type: !91)
!931 = !DILocation(line: 203, column: 6, scope: !909)
!932 = !DILocation(line: 205, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !909, file: !119, line: 205, column: 6)
!934 = !DILocation(line: 205, column: 13, scope: !933)
!935 = !DILocation(line: 205, column: 21, scope: !933)
!936 = !DILocation(line: 205, column: 65, scope: !937)
!937 = !DILexicalBlockFile(scope: !933, file: !119, discriminator: 1)
!938 = !DILocation(line: 205, column: 64, scope: !937)
!939 = !DILocation(line: 205, column: 63, scope: !937)
!940 = !DILocation(line: 205, column: 40, scope: !937)
!941 = !DILocation(line: 205, column: 41, scope: !937)
!942 = !DILocation(line: 205, column: 43, scope: !937)
!943 = !DILocation(line: 205, column: 42, scope: !937)
!944 = !DILocation(line: 205, column: 44, scope: !937)
!945 = !DILocation(line: 205, column: 46, scope: !946)
!946 = !DILexicalBlockFile(scope: !933, file: !119, discriminator: 2)
!947 = !DILocation(line: 205, column: 45, scope: !946)
!948 = !DILocation(line: 205, column: 44, scope: !946)
!949 = !DILocation(line: 205, column: 43, scope: !946)
!950 = !DILocation(line: 205, column: 51, scope: !946)
!951 = !DILocation(line: 205, column: 58, scope: !946)
!952 = !DILocation(line: 205, column: 64, scope: !953)
!953 = !DILexicalBlockFile(scope: !933, file: !119, discriminator: 3)
!954 = !DILocation(line: 205, column: 63, scope: !953)
!955 = !DILocation(line: 205, column: 62, scope: !953)
!956 = !DILocation(line: 205, column: 61, scope: !953)
!957 = !DILocation(line: 205, column: 69, scope: !953)
!958 = !DILocation(line: 205, column: 76, scope: !953)
!959 = !DILocation(line: 205, column: 82, scope: !960)
!960 = !DILexicalBlockFile(scope: !933, file: !119, discriminator: 4)
!961 = !DILocation(line: 205, column: 81, scope: !960)
!962 = !DILocation(line: 205, column: 80, scope: !960)
!963 = !DILocation(line: 205, column: 79, scope: !960)
!964 = !DILocation(line: 205, column: 87, scope: !960)
!965 = !DILocation(line: 205, column: 6, scope: !960)
!966 = !DILocation(line: 206, column: 4, scope: !967)
!967 = distinct !DILexicalBlock(scope: !933, file: !119, line: 205, column: 96)
!968 = !DILocation(line: 206, column: 13, scope: !967)
!969 = !DILocation(line: 207, column: 35, scope: !967)
!970 = !DILocation(line: 207, column: 34, scope: !967)
!971 = !DILocation(line: 207, column: 33, scope: !967)
!972 = !DILocation(line: 207, column: 10, scope: !967)
!973 = !DILocation(line: 207, column: 3, scope: !967)
!974 = !DILocation(line: 210, column: 8, scope: !975)
!975 = distinct !DILexicalBlock(scope: !909, file: !119, line: 210, column: 6)
!976 = !DILocation(line: 210, column: 7, scope: !975)
!977 = !DILocation(line: 210, column: 6, scope: !975)
!978 = !DILocation(line: 210, column: 12, scope: !975)
!979 = !DILocation(line: 210, column: 6, scope: !909)
!980 = !DILocation(line: 212, column: 7, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !119, line: 212, column: 7)
!982 = distinct !DILexicalBlock(scope: !975, file: !119, line: 210, column: 20)
!983 = !DILocation(line: 212, column: 13, scope: !981)
!984 = !DILocation(line: 212, column: 7, scope: !982)
!985 = !DILocation(line: 213, column: 4, scope: !981)
!986 = !DILocation(line: 215, column: 22, scope: !982)
!987 = !DILocation(line: 215, column: 27, scope: !982)
!988 = !DILocation(line: 215, column: 33, scope: !982)
!989 = !DILocation(line: 215, column: 10, scope: !982)
!990 = !DILocation(line: 215, column: 3, scope: !982)
!991 = !DILocation(line: 218, column: 10, scope: !909)
!992 = !DILocation(line: 219, column: 8, scope: !993)
!993 = distinct !DILexicalBlock(scope: !909, file: !119, line: 219, column: 6)
!994 = !DILocation(line: 219, column: 7, scope: !993)
!995 = !DILocation(line: 219, column: 6, scope: !993)
!996 = !DILocation(line: 219, column: 12, scope: !993)
!997 = !DILocation(line: 219, column: 19, scope: !993)
!998 = !DILocation(line: 219, column: 24, scope: !999)
!999 = !DILexicalBlockFile(scope: !993, file: !119, discriminator: 1)
!1000 = !DILocation(line: 219, column: 23, scope: !999)
!1001 = !DILocation(line: 219, column: 22, scope: !999)
!1002 = !DILocation(line: 219, column: 28, scope: !999)
!1003 = !DILocation(line: 219, column: 6, scope: !999)
!1004 = !DILocation(line: 220, column: 29, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !993, file: !119, line: 219, column: 36)
!1006 = !DILocation(line: 220, column: 28, scope: !1005)
!1007 = !DILocation(line: 220, column: 27, scope: !1005)
!1008 = !DILocation(line: 220, column: 25, scope: !1005)
!1009 = !DILocation(line: 221, column: 9, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !119, line: 221, column: 7)
!1011 = !DILocation(line: 221, column: 8, scope: !1010)
!1012 = !DILocation(line: 221, column: 7, scope: !1010)
!1013 = !DILocation(line: 221, column: 17, scope: !1010)
!1014 = !DILocation(line: 221, column: 7, scope: !1005)
!1015 = !DILocation(line: 222, column: 6, scope: !1010)
!1016 = !DILocation(line: 222, column: 10, scope: !1010)
!1017 = !DILocation(line: 222, column: 4, scope: !1010)
!1018 = !DILocalVariable(name: "temp_cmd", scope: !1019, file: !119, line: 225, type: !90)
!1019 = distinct !DILexicalBlock(scope: !1010, file: !119, line: 223, column: 8)
!1020 = !DILocation(line: 225, column: 10, scope: !1019)
!1021 = !DILocation(line: 227, column: 8, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !119, line: 227, column: 8)
!1023 = !DILocation(line: 227, column: 14, scope: !1022)
!1024 = !DILocation(line: 227, column: 8, scope: !1019)
!1025 = !DILocation(line: 228, column: 33, scope: !1022)
!1026 = !DILocation(line: 230, column: 5, scope: !1019)
!1027 = !DILocation(line: 230, column: 14, scope: !1019)
!1028 = !DILocation(line: 231, column: 35, scope: !1019)
!1029 = !DILocation(line: 231, column: 11, scope: !1019)
!1030 = !DILocation(line: 231, column: 4, scope: !1019)
!1031 = !DILocation(line: 233, column: 2, scope: !1005)
!1032 = !DILocation(line: 235, column: 23, scope: !909)
!1033 = !DILocation(line: 235, column: 28, scope: !909)
!1034 = !DILocation(line: 235, column: 36, scope: !909)
!1035 = !DILocation(line: 235, column: 42, scope: !909)
!1036 = !DILocation(line: 235, column: 51, scope: !909)
!1037 = !DILocation(line: 236, column: 9, scope: !909)
!1038 = !DILocation(line: 236, column: 19, scope: !909)
!1039 = !DILocation(line: 236, column: 25, scope: !909)
!1040 = !DILocation(line: 235, column: 10, scope: !909)
!1041 = !DILocation(line: 235, column: 8, scope: !909)
!1042 = !DILocation(line: 238, column: 6, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !909, file: !119, line: 238, column: 6)
!1044 = !DILocation(line: 238, column: 12, scope: !1043)
!1045 = !DILocation(line: 238, column: 6, scope: !909)
!1046 = !DILocation(line: 239, column: 10, scope: !1043)
!1047 = !DILocation(line: 239, column: 3, scope: !1043)
!1048 = !DILocation(line: 241, column: 6, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !909, file: !119, line: 241, column: 6)
!1050 = !DILocation(line: 241, column: 14, scope: !1049)
!1051 = !DILocation(line: 241, column: 6, scope: !909)
!1052 = !DILocation(line: 243, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !119, line: 243, column: 7)
!1054 = distinct !DILexicalBlock(scope: !1049, file: !119, line: 241, column: 22)
!1055 = !DILocation(line: 243, column: 13, scope: !1053)
!1056 = !DILocation(line: 243, column: 20, scope: !1053)
!1057 = !DILocation(line: 243, column: 24, scope: !1058)
!1058 = !DILexicalBlockFile(scope: !1053, file: !119, discriminator: 1)
!1059 = !DILocation(line: 243, column: 23, scope: !1058)
!1060 = !DILocation(line: 243, column: 30, scope: !1058)
!1061 = !DILocation(line: 243, column: 7, scope: !1058)
!1062 = !DILocation(line: 244, column: 8, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !119, line: 244, column: 8)
!1064 = distinct !DILexicalBlock(scope: !1053, file: !119, line: 243, column: 39)
!1065 = !DILocation(line: 244, column: 14, scope: !1063)
!1066 = !DILocation(line: 244, column: 21, scope: !1063)
!1067 = !DILocation(line: 244, column: 25, scope: !1068)
!1068 = !DILexicalBlockFile(scope: !1063, file: !119, discriminator: 1)
!1069 = !DILocation(line: 244, column: 24, scope: !1068)
!1070 = !DILocation(line: 244, column: 8, scope: !1068)
!1071 = !DILocation(line: 245, column: 12, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1063, file: !119, line: 244, column: 35)
!1073 = !DILocation(line: 245, column: 5, scope: !1072)
!1074 = !DILocation(line: 246, column: 6, scope: !1072)
!1075 = !DILocation(line: 246, column: 15, scope: !1072)
!1076 = !DILocation(line: 247, column: 4, scope: !1072)
!1077 = !DILocation(line: 248, column: 4, scope: !1064)
!1078 = !DILocation(line: 251, column: 7, scope: !1054)
!1079 = !DILocation(line: 252, column: 12, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1054, file: !119, line: 252, column: 3)
!1081 = !DILocation(line: 252, column: 10, scope: !1080)
!1082 = !DILocation(line: 252, column: 8, scope: !1080)
!1083 = !DILocation(line: 252, column: 20, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1085, file: !119, discriminator: 1)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !119, line: 252, column: 3)
!1086 = !DILocation(line: 252, column: 19, scope: !1084)
!1087 = !DILocation(line: 252, column: 22, scope: !1084)
!1088 = !DILocation(line: 252, column: 3, scope: !1084)
!1089 = !DILocation(line: 253, column: 9, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !119, line: 253, column: 8)
!1091 = distinct !DILexicalBlock(scope: !1085, file: !119, line: 252, column: 36)
!1092 = !DILocation(line: 253, column: 8, scope: !1090)
!1093 = !DILocation(line: 253, column: 11, scope: !1090)
!1094 = !DILocation(line: 253, column: 18, scope: !1090)
!1095 = !DILocation(line: 253, column: 22, scope: !1096)
!1096 = !DILexicalBlockFile(scope: !1090, file: !119, discriminator: 1)
!1097 = !DILocation(line: 253, column: 27, scope: !1096)
!1098 = !DILocation(line: 253, column: 34, scope: !1096)
!1099 = !DILocation(line: 253, column: 37, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1090, file: !119, discriminator: 2)
!1101 = !DILocation(line: 253, column: 42, scope: !1100)
!1102 = !DILocation(line: 253, column: 8, scope: !1100)
!1103 = !DILocation(line: 254, column: 8, scope: !1090)
!1104 = !DILocation(line: 254, column: 5, scope: !1090)
!1105 = !DILocation(line: 255, column: 3, scope: !1091)
!1106 = !DILocation(line: 252, column: 32, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1085, file: !119, discriminator: 2)
!1108 = !DILocation(line: 252, column: 3, scope: !1107)
!1109 = distinct !{!1109, !1110}
!1110 = !DILocation(line: 252, column: 3, scope: !1054)
!1111 = !DILocation(line: 256, column: 22, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1054, file: !119, line: 256, column: 21)
!1113 = !DILocation(line: 256, column: 21, scope: !1112)
!1114 = !DILocation(line: 256, column: 21, scope: !1054)
!1115 = !DILocation(line: 256, column: 39, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1112, file: !119, discriminator: 1)
!1117 = !DILocation(line: 256, column: 32, scope: !1116)
!1118 = !DILocation(line: 258, column: 4, scope: !1054)
!1119 = !DILocation(line: 258, column: 13, scope: !1054)
!1120 = !DILocation(line: 259, column: 32, scope: !1054)
!1121 = !DILocation(line: 259, column: 10, scope: !1054)
!1122 = !DILocation(line: 259, column: 3, scope: !1054)
!1123 = !DILocation(line: 262, column: 6, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !909, file: !119, line: 262, column: 6)
!1125 = !DILocation(line: 262, column: 14, scope: !1124)
!1126 = !DILocation(line: 262, column: 6, scope: !909)
!1127 = !DILocation(line: 264, column: 7, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !119, line: 264, column: 7)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !119, line: 262, column: 22)
!1130 = !DILocation(line: 264, column: 13, scope: !1128)
!1131 = !DILocation(line: 264, column: 7, scope: !1129)
!1132 = !DILocation(line: 264, column: 21, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1128, file: !119, discriminator: 1)
!1134 = !DILocation(line: 266, column: 16, scope: !1129)
!1135 = !DILocation(line: 266, column: 9, scope: !1129)
!1136 = !DILocation(line: 266, column: 7, scope: !1129)
!1137 = !DILocation(line: 267, column: 22, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1129, file: !119, line: 267, column: 21)
!1139 = !DILocation(line: 267, column: 21, scope: !1138)
!1140 = !DILocation(line: 267, column: 21, scope: !1129)
!1141 = !DILocation(line: 267, column: 39, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1138, file: !119, discriminator: 1)
!1143 = !DILocation(line: 267, column: 32, scope: !1142)
!1144 = !DILocation(line: 269, column: 4, scope: !1129)
!1145 = !DILocation(line: 269, column: 13, scope: !1129)
!1146 = !DILocation(line: 270, column: 32, scope: !1129)
!1147 = !DILocation(line: 270, column: 10, scope: !1129)
!1148 = !DILocation(line: 270, column: 3, scope: !1129)
!1149 = !DILocation(line: 273, column: 9, scope: !909)
!1150 = !DILocation(line: 273, column: 2, scope: !909)
!1151 = !DILocation(line: 274, column: 1, scope: !909)
!1152 = distinct !DISubprogram(name: "parse_special_string", scope: !119, file: !119, line: 501, type: !1153, isLocal: false, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!90, !87, !122, !82, !87, !111, !91}
!1155 = !DILocalVariable(name: "cmd", arg: 1, scope: !1152, file: !119, line: 501, type: !87)
!1156 = !DILocation(line: 501, column: 40, scope: !1152)
!1157 = !DILocalVariable(name: "server", arg: 2, scope: !1152, file: !119, line: 501, type: !122)
!1158 = !DILocation(line: 501, column: 57, scope: !1152)
!1159 = !DILocalVariable(name: "item", arg: 3, scope: !1152, file: !119, line: 501, type: !82)
!1160 = !DILocation(line: 501, column: 71, scope: !1152)
!1161 = !DILocalVariable(name: "data", arg: 4, scope: !1152, file: !119, line: 502, type: !87)
!1162 = !DILocation(line: 502, column: 19, scope: !1152)
!1163 = !DILocalVariable(name: "arg_used", arg: 5, scope: !1152, file: !119, line: 502, type: !111)
!1164 = !DILocation(line: 502, column: 30, scope: !1152)
!1165 = !DILocalVariable(name: "flags", arg: 6, scope: !1152, file: !119, line: 502, type: !91)
!1166 = !DILocation(line: 502, column: 44, scope: !1152)
!1167 = !DILocalVariable(name: "code", scope: !1152, file: !119, line: 504, type: !86)
!1168 = !DILocation(line: 504, column: 7, scope: !1152)
!1169 = !DILocalVariable(name: "arglist", scope: !1152, file: !119, line: 504, type: !89)
!1170 = !DILocation(line: 504, column: 15, scope: !1152)
!1171 = !DILocalVariable(name: "ret", scope: !1152, file: !119, line: 504, type: !90)
!1172 = !DILocation(line: 504, column: 25, scope: !1152)
!1173 = !DILocalVariable(name: "str", scope: !1152, file: !119, line: 505, type: !323)
!1174 = !DILocation(line: 505, column: 11, scope: !1152)
!1175 = !DILocalVariable(name: "need_free", scope: !1152, file: !119, line: 506, type: !91)
!1176 = !DILocation(line: 506, column: 6, scope: !1152)
!1177 = !DILocalVariable(name: "chr", scope: !1152, file: !119, line: 506, type: !91)
!1178 = !DILocation(line: 506, column: 17, scope: !1152)
!1179 = !DILocation(line: 508, column: 2, scope: !1152)
!1180 = distinct !{!1180, !1179}
!1181 = !DILocation(line: 508, column: 10, scope: !1182)
!1182 = !DILexicalBlockFile(scope: !1183, file: !119, discriminator: 1)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !119, line: 508, column: 10)
!1184 = distinct !DILexicalBlock(scope: !1152, file: !119, line: 508, column: 4)
!1185 = !DILocation(line: 508, column: 14, scope: !1182)
!1186 = !DILocation(line: 508, column: 5, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1188, file: !119, discriminator: 2)
!1188 = distinct !DILexicalBlock(scope: !1183, file: !119, line: 508, column: 3)
!1189 = !DILocation(line: 508, column: 14, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1191, file: !119, discriminator: 3)
!1191 = distinct !DILexicalBlock(scope: !1183, file: !119, line: 508, column: 12)
!1192 = !DILocation(line: 508, column: 98, scope: !1190)
!1193 = !DILocation(line: 508, column: 7, scope: !1194)
!1194 = !DILexicalBlockFile(scope: !1184, file: !119, discriminator: 4)
!1195 = !DILocation(line: 509, column: 2, scope: !1152)
!1196 = distinct !{!1196, !1195}
!1197 = !DILocation(line: 509, column: 10, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1199, file: !119, discriminator: 1)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !119, line: 509, column: 10)
!1200 = distinct !DILexicalBlock(scope: !1152, file: !119, line: 509, column: 4)
!1201 = !DILocation(line: 509, column: 15, scope: !1198)
!1202 = !DILocation(line: 509, column: 5, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1204, file: !119, discriminator: 2)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !119, line: 509, column: 3)
!1205 = !DILocation(line: 509, column: 14, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1207, file: !119, discriminator: 3)
!1207 = distinct !DILexicalBlock(scope: !1199, file: !119, line: 509, column: 12)
!1208 = !DILocation(line: 509, column: 99, scope: !1206)
!1209 = !DILocation(line: 509, column: 7, scope: !1210)
!1210 = !DILexicalBlockFile(scope: !1200, file: !119, discriminator: 4)
!1211 = !DILocation(line: 512, column: 23, scope: !1152)
!1212 = !DILocation(line: 512, column: 12, scope: !1152)
!1213 = !DILocation(line: 512, column: 10, scope: !1152)
!1214 = !DILocation(line: 514, column: 6, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1152, file: !119, line: 514, column: 6)
!1216 = !DILocation(line: 514, column: 15, scope: !1215)
!1217 = !DILocation(line: 514, column: 6, scope: !1152)
!1218 = !DILocation(line: 514, column: 24, scope: !1219)
!1219 = !DILexicalBlockFile(scope: !1215, file: !119, discriminator: 1)
!1220 = !DILocation(line: 514, column: 33, scope: !1219)
!1221 = !DILocation(line: 514, column: 23, scope: !1219)
!1222 = !DILocation(line: 515, column: 7, scope: !1152)
!1223 = !DILocation(line: 516, column: 8, scope: !1152)
!1224 = !DILocation(line: 516, column: 6, scope: !1152)
!1225 = !DILocation(line: 517, column: 2, scope: !1152)
!1226 = !DILocation(line: 517, column: 10, scope: !1227)
!1227 = !DILexicalBlockFile(scope: !1152, file: !119, discriminator: 1)
!1228 = !DILocation(line: 517, column: 9, scope: !1227)
!1229 = !DILocation(line: 517, column: 14, scope: !1227)
!1230 = !DILocation(line: 517, column: 2, scope: !1227)
!1231 = !DILocation(line: 518, column: 7, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !119, line: 518, column: 7)
!1233 = distinct !DILexicalBlock(scope: !1152, file: !119, line: 517, column: 23)
!1234 = !DILocation(line: 518, column: 12, scope: !1232)
!1235 = !DILocation(line: 518, column: 7, scope: !1233)
!1236 = !DILocation(line: 519, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !119, line: 519, column: 8)
!1238 = distinct !DILexicalBlock(scope: !1232, file: !119, line: 518, column: 21)
!1239 = !DILocation(line: 519, column: 8, scope: !1237)
!1240 = !DILocation(line: 519, column: 13, scope: !1237)
!1241 = !DILocation(line: 519, column: 8, scope: !1238)
!1242 = !DILocation(line: 520, column: 31, scope: !1237)
!1243 = !DILocation(line: 520, column: 5, scope: !1237)
!1244 = !DILocation(line: 522, column: 11, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1237, file: !119, line: 521, column: 9)
!1246 = !DILocation(line: 522, column: 9, scope: !1245)
!1247 = !DILocation(line: 523, column: 31, scope: !1245)
!1248 = !DILocation(line: 523, column: 36, scope: !1245)
!1249 = !DILocation(line: 523, column: 40, scope: !1245)
!1250 = !DILocation(line: 523, column: 48, scope: !1251)
!1251 = !DILexicalBlockFile(scope: !1245, file: !119, discriminator: 1)
!1252 = !DILocation(line: 523, column: 36, scope: !1251)
!1253 = !DILocation(line: 523, column: 55, scope: !1254)
!1254 = !DILexicalBlockFile(scope: !1245, file: !119, discriminator: 2)
!1255 = !DILocation(line: 523, column: 54, scope: !1254)
!1256 = !DILocation(line: 523, column: 36, scope: !1254)
!1257 = !DILocation(line: 523, column: 36, scope: !1258)
!1258 = !DILexicalBlockFile(scope: !1245, file: !119, discriminator: 3)
!1259 = !DILocation(line: 523, column: 5, scope: !1258)
!1260 = !DILocation(line: 525, column: 9, scope: !1238)
!1261 = !DILocation(line: 526, column: 3, scope: !1238)
!1262 = !DILocation(line: 526, column: 14, scope: !1263)
!1263 = !DILexicalBlockFile(scope: !1264, file: !119, discriminator: 1)
!1264 = distinct !DILexicalBlock(scope: !1232, file: !119, line: 526, column: 14)
!1265 = !DILocation(line: 526, column: 19, scope: !1263)
!1266 = !DILocalVariable(name: "ret", scope: !1267, file: !119, line: 527, type: !90)
!1267 = distinct !DILexicalBlock(scope: !1264, file: !119, line: 526, column: 27)
!1268 = !DILocation(line: 527, column: 10, scope: !1267)
!1269 = !DILocation(line: 529, column: 40, scope: !1267)
!1270 = !DILocation(line: 529, column: 48, scope: !1267)
!1271 = !DILocation(line: 530, column: 10, scope: !1267)
!1272 = !DILocation(line: 530, column: 31, scope: !1267)
!1273 = !DILocation(line: 531, column: 10, scope: !1267)
!1274 = !DILocation(line: 529, column: 10, scope: !1267)
!1275 = !DILocation(line: 529, column: 8, scope: !1267)
!1276 = !DILocation(line: 532, column: 8, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1267, file: !119, line: 532, column: 8)
!1278 = !DILocation(line: 532, column: 12, scope: !1277)
!1279 = !DILocation(line: 532, column: 8, scope: !1267)
!1280 = !DILocation(line: 533, column: 56, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1277, file: !119, line: 532, column: 20)
!1282 = !DILocation(line: 533, column: 61, scope: !1281)
!1283 = !DILocation(line: 533, column: 66, scope: !1281)
!1284 = !DILocation(line: 533, column: 33, scope: !1281)
!1285 = !DILocation(line: 534, column: 9, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1281, file: !119, line: 534, column: 9)
!1287 = !DILocation(line: 534, column: 9, scope: !1281)
!1288 = !DILocation(line: 534, column: 27, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1286, file: !119, discriminator: 1)
!1290 = !DILocation(line: 534, column: 20, scope: !1289)
!1291 = !DILocation(line: 535, column: 4, scope: !1281)
!1292 = !DILocation(line: 536, column: 9, scope: !1267)
!1293 = !DILocation(line: 537, column: 3, scope: !1267)
!1294 = !DILocation(line: 538, column: 9, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1296, file: !119, line: 538, column: 8)
!1296 = distinct !DILexicalBlock(scope: !1264, file: !119, line: 537, column: 10)
!1297 = !DILocation(line: 538, column: 8, scope: !1295)
!1298 = !DILocation(line: 538, column: 13, scope: !1295)
!1299 = !DILocation(line: 538, column: 21, scope: !1295)
!1300 = !DILocation(line: 538, column: 25, scope: !1301)
!1301 = !DILexicalBlockFile(scope: !1295, file: !119, discriminator: 1)
!1302 = !DILocation(line: 538, column: 24, scope: !1301)
!1303 = !DILocation(line: 538, column: 29, scope: !1301)
!1304 = !DILocation(line: 538, column: 8, scope: !1301)
!1305 = !DILocation(line: 539, column: 13, scope: !1295)
!1306 = !DILocation(line: 539, column: 12, scope: !1295)
!1307 = !DILocation(line: 539, column: 10, scope: !1295)
!1308 = !DILocation(line: 539, column: 5, scope: !1295)
!1309 = !DILocation(line: 541, column: 31, scope: !1295)
!1310 = !DILocation(line: 541, column: 37, scope: !1295)
!1311 = !DILocation(line: 541, column: 36, scope: !1295)
!1312 = !DILocation(line: 541, column: 5, scope: !1295)
!1313 = !DILocation(line: 544, column: 20, scope: !1233)
!1314 = !DILocation(line: 517, column: 2, scope: !1315)
!1315 = !DILexicalBlockFile(scope: !1152, file: !119, discriminator: 2)
!1316 = distinct !{!1316, !1225}
!1317 = !DILocation(line: 546, column: 13, scope: !1152)
!1318 = !DILocation(line: 546, column: 2, scope: !1152)
!1319 = !DILocation(line: 548, column: 8, scope: !1152)
!1320 = !DILocation(line: 548, column: 13, scope: !1152)
!1321 = !DILocation(line: 548, column: 6, scope: !1152)
!1322 = !DILocation(line: 549, column: 16, scope: !1152)
!1323 = !DILocation(line: 549, column: 2, scope: !1152)
!1324 = !DILocation(line: 550, column: 9, scope: !1152)
!1325 = !DILocation(line: 550, column: 2, scope: !1152)
!1326 = !DILocation(line: 551, column: 1, scope: !1152)
!1327 = distinct !DISubprogram(name: "g_string_append_c_inline", scope: !325, file: !325, line: 161, type: !1328, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!323, !323, !84}
!1330 = !DILocalVariable(name: "gstring", arg: 1, scope: !1327, file: !325, line: 161, type: !323)
!1331 = !DILocation(line: 161, column: 36, scope: !1327)
!1332 = !DILocalVariable(name: "c", arg: 2, scope: !1327, file: !325, line: 162, type: !84)
!1333 = !DILocation(line: 162, column: 33, scope: !1327)
!1334 = !DILocation(line: 164, column: 7, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1327, file: !325, line: 164, column: 7)
!1336 = !DILocation(line: 164, column: 16, scope: !1335)
!1337 = !DILocation(line: 164, column: 20, scope: !1335)
!1338 = !DILocation(line: 164, column: 26, scope: !1335)
!1339 = !DILocation(line: 164, column: 35, scope: !1335)
!1340 = !DILocation(line: 164, column: 24, scope: !1335)
!1341 = !DILocation(line: 164, column: 7, scope: !1327)
!1342 = !DILocation(line: 166, column: 38, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1335, file: !325, line: 165, column: 5)
!1344 = !DILocation(line: 166, column: 20, scope: !1343)
!1345 = !DILocation(line: 166, column: 29, scope: !1343)
!1346 = !DILocation(line: 166, column: 32, scope: !1343)
!1347 = !DILocation(line: 166, column: 7, scope: !1343)
!1348 = !DILocation(line: 166, column: 16, scope: !1343)
!1349 = !DILocation(line: 166, column: 36, scope: !1343)
!1350 = !DILocation(line: 167, column: 20, scope: !1343)
!1351 = !DILocation(line: 167, column: 29, scope: !1343)
!1352 = !DILocation(line: 167, column: 7, scope: !1343)
!1353 = !DILocation(line: 167, column: 16, scope: !1343)
!1354 = !DILocation(line: 167, column: 34, scope: !1343)
!1355 = !DILocation(line: 168, column: 5, scope: !1343)
!1356 = !DILocation(line: 170, column: 24, scope: !1335)
!1357 = !DILocation(line: 170, column: 37, scope: !1335)
!1358 = !DILocation(line: 170, column: 5, scope: !1335)
!1359 = !DILocation(line: 171, column: 10, scope: !1327)
!1360 = !DILocation(line: 171, column: 3, scope: !1327)
!1361 = distinct !DISubprogram(name: "gstring_append_escaped", scope: !119, file: !119, line: 470, type: !1362, isLocal: true, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !448)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !323, !87, !91}
!1364 = !DILocalVariable(name: "str", arg: 1, scope: !1361, file: !119, line: 470, type: !323)
!1365 = !DILocation(line: 470, column: 45, scope: !1361)
!1366 = !DILocalVariable(name: "text", arg: 2, scope: !1361, file: !119, line: 470, type: !87)
!1367 = !DILocation(line: 470, column: 62, scope: !1361)
!1368 = !DILocalVariable(name: "flags", arg: 3, scope: !1361, file: !119, line: 470, type: !91)
!1369 = !DILocation(line: 470, column: 72, scope: !1361)
!1370 = !DILocalVariable(name: "esc", scope: !1361, file: !119, line: 472, type: !1371)
!1371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 32, align: 8, elements: !1372)
!1372 = !{!1373}
!1373 = !DISubrange(count: 4)
!1374 = !DILocation(line: 472, column: 7, scope: !1361)
!1375 = !DILocalVariable(name: "escpos", scope: !1361, file: !119, line: 472, type: !90)
!1376 = !DILocation(line: 472, column: 16, scope: !1361)
!1377 = !DILocation(line: 474, column: 11, scope: !1361)
