; ModuleID = './line45-masks.o.i'
source_filename = "./line45-masks.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35)
!1 = !DIFile(filename: "line45-masks.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !37, !133, !364, !58}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !39, line: 107, baseType: !40)
!39 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !41, line: 30, size: 2240, align: 64, elements: !42)
!41 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!42 = !{!43, !46, !47, !48, !309, !314, !315, !316, !317, !318, !319, !320, !321, !322, !326, !327, !331, !332, !333, !337, !342, !343, !344, !345, !346, !347, !348, !349, !356, !357, !358, !359, !360, !366, !370, !374, !378, !382, !387, !394, !401, !405}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !44, line: 3, baseType: !45, size: 32, align: 32)
!44 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !40, file: !44, line: 4, baseType: !45, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !40, file: !44, line: 6, baseType: !45, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !40, file: !44, line: 8, baseType: !49, size: 64, align: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !39, line: 113, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !41, line: 25, size: 1920, align: 64, elements: !52)
!52 = !{!53, !55, !56, !57, !60, !61, !62, !63, !64, !66, !67, !68, !69, !70, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !54, line: 3, baseType: !45, size: 32, align: 32)
!54 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !51, file: !54, line: 4, baseType: !45, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !51, file: !54, line: 6, baseType: !45, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !51, file: !54, line: 9, baseType: !58, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !51, file: !54, line: 10, baseType: !45, size: 32, align: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !51, file: !54, line: 11, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !51, file: !54, line: 11, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !51, file: !54, line: 11, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !51, file: !54, line: 13, baseType: !65, size: 16, align: 16, offset: 448)
!65 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !51, file: !54, line: 14, baseType: !58, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !54, line: 15, baseType: !58, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !51, file: !54, line: 16, baseType: !45, size: 32, align: 32, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !51, file: !54, line: 17, baseType: !58, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !51, file: !54, line: 19, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !39, line: 99, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !74, line: 22, size: 160, align: 32, elements: !75)
!74 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !73, file: !74, line: 23, baseType: !65, size: 16, align: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !73, file: !74, line: 24, baseType: !78, size: 128, align: 32, offset: 32)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !79, line: 211, size: 128, align: 32, elements: !80)
!79 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !78, file: !79, line: 220, baseType: !82, size: 128, align: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !79, line: 213, size: 128, align: 32, elements: !83)
!83 = !{!84, !91, !96}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !82, file: !79, line: 215, baseType: !85, size: 128, align: 8)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 8, elements: !89)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 48, baseType: !88)
!87 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!88 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!89 = !{!90}
!90 = !DISubrange(count: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !82, file: !79, line: 217, baseType: !92, size: 128, align: 16)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, align: 16, elements: !94)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !87, line: 49, baseType: !65)
!94 = !{!95}
!95 = !DISubrange(count: 8)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !82, file: !79, line: 218, baseType: !97, size: 128, align: 32)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, align: 32, elements: !100)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !87, line: 51, baseType: !99)
!99 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !51, file: !54, line: 19, baseType: !71, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !51, file: !54, line: 21, baseType: !58, size: 64, align: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !51, file: !54, line: 22, baseType: !58, size: 64, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !51, file: !54, line: 23, baseType: !58, size: 64, align: 64, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !51, file: !54, line: 24, baseType: !58, size: 64, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !51, file: !54, line: 26, baseType: !58, size: 64, align: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !51, file: !54, line: 27, baseType: !58, size: 64, align: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !51, file: !54, line: 28, baseType: !58, size: 64, align: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !51, file: !54, line: 29, baseType: !58, size: 64, align: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !51, file: !54, line: 30, baseType: !58, size: 64, align: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !51, file: !54, line: 31, baseType: !58, size: 64, align: 64, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !51, file: !54, line: 32, baseType: !58, size: 64, align: 64, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !51, file: !54, line: 33, baseType: !58, size: 64, align: 64, offset: 1600)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !51, file: !54, line: 35, baseType: !116, size: 64, align: 64, offset: 1664)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !119)
!119 = !{!120, !123, !266, !267, !272, !273, !274, !275, !276, !285, !286, !287, !291, !292, !293, !294, !295, !296, !297, !298}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !118, file: !4, line: 100, baseType: !121, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !122, line: 49, baseType: !45)
!122 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !118, file: !4, line: 101, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !127)
!127 = !{!128, !151, !157, !164, !168, !253, !257, !262}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !126, file: !4, line: 133, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !116, !133, !135, !138, !139}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !122, line: 46, baseType: !59)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !136, line: 66, baseType: !137)
!136 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!137 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !142, line: 42, baseType: !143)
!142 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !142, line: 44, size: 128, align: 64, elements: !144)
!144 = !{!145, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !143, file: !142, line: 46, baseType: !146, size: 32, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !147, line: 36, baseType: !148)
!147 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !136, line: 45, baseType: !99)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !143, file: !142, line: 47, baseType: !121, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !143, file: !142, line: 48, baseType: !133, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !126, file: !4, line: 138, baseType: !152, size: 64, align: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!132, !116, !155, !135, !138, !139}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !126, file: !4, line: 143, baseType: !158, size: 64, align: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!132, !116, !161, !163, !139}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !136, line: 51, baseType: !162)
!162 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !126, file: !4, line: 147, baseType: !165, size: 64, align: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!132, !116, !139}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !126, file: !4, line: 149, baseType: !169, size: 64, align: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !116, !252}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !175)
!175 = !{!176, !178, !199, !228, !230, !234, !235, !236, !237, !245, !246, !247, !248}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !174, file: !16, line: 174, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !122, line: 77, baseType: !36)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !174, file: !16, line: 175, baseType: !179, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !182)
!182 = !{!183, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !181, file: !16, line: 198, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !177}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !181, file: !16, line: 199, baseType: !184, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !181, file: !16, line: 200, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !177, !172, !192, !198}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!197, !177}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !122, line: 50, baseType: !121)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !174, file: !16, line: 177, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !204)
!204 = !{!205, !210, !214, !218, !222, !223}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !203, file: !16, line: 216, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!197, !172, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !203, file: !16, line: 218, baseType: !211, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!197, !172}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !203, file: !16, line: 219, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!197, !172, !193, !177}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !203, file: !16, line: 222, baseType: !219, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !172}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !203, file: !16, line: 226, baseType: !193, size: 64, align: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !203, file: !16, line: 227, baseType: !224, size: 64, align: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !174, file: !16, line: 178, baseType: !229, size: 32, align: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !122, line: 55, baseType: !99)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !174, file: !16, line: 180, baseType: !231, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !174, file: !16, line: 182, baseType: !121, size: 32, align: 32, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !16, line: 183, baseType: !229, size: 32, align: 32, offset: 352)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !174, file: !16, line: 184, baseType: !229, size: 32, align: 32, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !174, file: !16, line: 186, baseType: !238, size: 64, align: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !240, line: 37, baseType: !241)
!240 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !240, line: 39, size: 128, align: 64, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !240, line: 41, baseType: !177, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !240, line: 42, baseType: !238, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !174, file: !16, line: 188, baseType: !172, size: 64, align: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !16, line: 189, baseType: !172, size: 64, align: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !16, line: 191, baseType: !58, size: 64, align: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !174, file: !16, line: 193, baseType: !249, size: 64, align: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !126, file: !4, line: 151, baseType: !254, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !116}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !126, file: !4, line: 152, baseType: !258, size: 64, align: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!132, !116, !261, !139}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !126, file: !4, line: 155, baseType: !263, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!261, !116}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !118, file: !4, line: 103, baseType: !133, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !118, file: !4, line: 104, baseType: !268, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !269, line: 77, baseType: !270)
!269 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !269, line: 77, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !118, file: !4, line: 105, baseType: !268, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !118, file: !4, line: 106, baseType: !133, size: 64, align: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !118, file: !4, line: 107, baseType: !229, size: 32, align: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !118, file: !4, line: 109, baseType: !135, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !118, file: !4, line: 110, baseType: !277, size: 64, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !279, line: 39, baseType: !280)
!279 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !279, line: 41, size: 192, align: 64, elements: !281)
!281 = !{!282, !283, !284}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !280, file: !279, line: 43, baseType: !133, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !280, file: !279, line: 44, baseType: !135, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !280, file: !279, line: 45, baseType: !135, size: 64, align: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !118, file: !4, line: 111, baseType: !277, size: 64, align: 64, offset: 576)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !118, file: !4, line: 112, baseType: !277, size: 64, align: 64, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !118, file: !4, line: 113, baseType: !288, size: 48, align: 8, offset: 704)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 48, align: 8, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !118, file: !4, line: 117, baseType: !229, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !118, file: !4, line: 118, baseType: !229, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !118, file: !4, line: 119, baseType: !229, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !118, file: !4, line: 120, baseType: !229, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !118, file: !4, line: 121, baseType: !229, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !118, file: !4, line: 122, baseType: !229, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !118, file: !4, line: 124, baseType: !177, size: 64, align: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !118, file: !4, line: 125, baseType: !177, size: 64, align: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !51, file: !54, line: 38, baseType: !99, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !51, file: !54, line: 39, baseType: !99, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !51, file: !54, line: 40, baseType: !99, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !51, file: !54, line: 41, baseType: !99, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !51, file: !54, line: 42, baseType: !99, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !51, file: !54, line: 43, baseType: !99, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !51, file: !54, line: 44, baseType: !99, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !51, file: !54, line: 45, baseType: !99, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !51, file: !54, line: 46, baseType: !58, size: 64, align: 64, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !51, file: !54, line: 47, baseType: !58, size: 64, align: 64, offset: 1856)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !40, file: !44, line: 9, baseType: !310, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !311, line: 75, baseType: !312)
!311 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !313, line: 139, baseType: !162)
!313 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !40, file: !44, line: 10, baseType: !310, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !40, file: !44, line: 12, baseType: !58, size: 64, align: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !40, file: !44, line: 13, baseType: !58, size: 64, align: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !40, file: !44, line: 15, baseType: !99, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !40, file: !44, line: 16, baseType: !99, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !40, file: !44, line: 17, baseType: !99, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !40, file: !44, line: 18, baseType: !99, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !40, file: !44, line: 19, baseType: !99, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !40, file: !44, line: 21, baseType: !323, size: 64, align: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !39, line: 102, baseType: !325)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !39, line: 102, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !40, file: !44, line: 22, baseType: !45, size: 32, align: 32, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !40, file: !44, line: 25, baseType: !328, size: 128, align: 64, offset: 640)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, align: 64, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !40, file: !44, line: 26, baseType: !45, size: 32, align: 32, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !40, file: !44, line: 27, baseType: !45, size: 32, align: 32, offset: 800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !40, file: !44, line: 29, baseType: !334, size: 64, align: 64, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !39, line: 103, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !39, line: 103, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !40, file: !44, line: 30, baseType: !338, size: 64, align: 64, offset: 896)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !340, line: 37, baseType: !341)
!340 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !340, line: 37, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !40, file: !44, line: 32, baseType: !58, size: 64, align: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !40, file: !44, line: 33, baseType: !58, size: 64, align: 64, offset: 1024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !40, file: !44, line: 34, baseType: !58, size: 64, align: 64, offset: 1088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !40, file: !44, line: 35, baseType: !99, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !40, file: !44, line: 36, baseType: !99, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !40, file: !44, line: 37, baseType: !99, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !40, file: !44, line: 38, baseType: !99, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !40, file: !44, line: 40, baseType: !350, size: 128, align: 64, offset: 1216)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !122, line: 504, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !122, line: 506, size: 128, align: 64, elements: !352)
!352 = !{!353, !355}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !351, file: !122, line: 508, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !122, line: 48, baseType: !162)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !351, file: !122, line: 509, baseType: !354, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !40, file: !44, line: 41, baseType: !310, size: 64, align: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !40, file: !44, line: 42, baseType: !45, size: 32, align: 32, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !40, file: !44, line: 44, baseType: !238, size: 64, align: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !40, file: !44, line: 45, baseType: !238, size: 64, align: 64, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !40, file: !44, line: 53, baseType: !361, size: 64, align: 64, offset: 1600)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !37, !364, !45}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !40, file: !44, line: 55, baseType: !367, size: 64, align: 64, offset: 1664)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!45, !37, !59}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !40, file: !44, line: 57, baseType: !371, size: 64, align: 64, offset: 1728)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!45, !37, !364}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !40, file: !44, line: 60, baseType: !375, size: 64, align: 64, offset: 1792)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!364, !37}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !40, file: !44, line: 62, baseType: !379, size: 64, align: 64, offset: 1856)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !37, !364, !364, !45}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !40, file: !44, line: 65, baseType: !383, size: 64, align: 64, offset: 1920)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!386, !37, !364, !364}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !40, file: !44, line: 69, baseType: !388, size: 64, align: 64, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!391, !37, !364}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !39, line: 109, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !39, line: 109, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !40, file: !44, line: 70, baseType: !395, size: 64, align: 64, offset: 2048)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !37, !364}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !39, line: 110, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !39, line: 110, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !40, file: !44, line: 71, baseType: !402, size: 64, align: 64, offset: 2112)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!45, !364, !364}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !40, file: !44, line: 73, baseType: !402, size: 64, align: 64, offset: 2176)
!406 = !{i32 2, !"Dwarf Version", i32 4}
!407 = !{i32 2, !"Debug Info Version", i32 3}
!408 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!409 = distinct !DISubprogram(name: "mask_match", scope: !410, file: !410, line: 63, type: !411, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !413)
!410 = !DIFile(filename: "masks.c", directory: "/home/lichi/Desktop/irssi/task1")
!411 = !DISubroutineType(types: !412)
!412 = !{!45, !37, !364, !364, !364, !364}
!413 = !{}
!414 = !DILocalVariable(name: "server", arg: 1, scope: !409, file: !410, line: 63, type: !37)
!415 = !DIExpression()
!416 = !DILocation(line: 63, column: 28, scope: !409)
!417 = !DILocalVariable(name: "mask", arg: 2, scope: !409, file: !410, line: 63, type: !364)
!418 = !DILocation(line: 63, column: 48, scope: !409)
!419 = !DILocalVariable(name: "nick", arg: 3, scope: !409, file: !410, line: 64, type: !364)
!420 = !DILocation(line: 64, column: 21, scope: !409)
!421 = !DILocalVariable(name: "user", arg: 4, scope: !409, file: !410, line: 64, type: !364)
!422 = !DILocation(line: 64, column: 39, scope: !409)
!423 = !DILocalVariable(name: "host", arg: 5, scope: !409, file: !410, line: 64, type: !364)
!424 = !DILocation(line: 64, column: 57, scope: !409)
!425 = !DILocalVariable(name: "str", scope: !409, file: !410, line: 66, type: !58)
!426 = !DILocation(line: 66, column: 8, scope: !409)
!427 = !DILocalVariable(name: "ret", scope: !409, file: !410, line: 67, type: !45)
!428 = !DILocation(line: 67, column: 6, scope: !409)
!429 = !DILocalVariable(name: "wildcards", scope: !409, file: !410, line: 67, type: !45)
!430 = !DILocation(line: 67, column: 11, scope: !409)
!431 = !DILocation(line: 69, column: 2, scope: !409)
!432 = distinct !{!432, !431}
!433 = !DILocation(line: 69, column: 10, scope: !434)
!434 = !DILexicalBlockFile(scope: !435, file: !410, discriminator: 1)
!435 = distinct !DILexicalBlock(scope: !436, file: !410, line: 69, column: 10)
!436 = distinct !DILexicalBlock(scope: !409, file: !410, line: 69, column: 4)
!437 = !DILocation(line: 69, column: 17, scope: !434)
!438 = !DILocation(line: 69, column: 1, scope: !434)
!439 = !DILocation(line: 69, column: 39, scope: !440)
!440 = !DILexicalBlockFile(scope: !435, file: !410, discriminator: 2)
!441 = !DILocation(line: 69, column: 21, scope: !440)
!442 = !DILocation(line: 69, column: 6, scope: !440)
!443 = !DILocation(line: 69, column: 10, scope: !440)
!444 = !DILocation(line: 69, column: 5, scope: !445)
!445 = !DILexicalBlockFile(scope: !435, file: !410, discriminator: 3)
!446 = !DILocation(line: 69, column: 10, scope: !447)
!447 = !DILexicalBlockFile(scope: !436, file: !410, discriminator: 4)
!448 = !DILocation(line: 69, column: 33, scope: !449)
!449 = !DILexicalBlockFile(scope: !450, file: !410, discriminator: 5)
!450 = distinct !DILexicalBlock(scope: !435, file: !410, line: 69, column: 31)
!451 = !DILocation(line: 69, column: 42, scope: !452)
!452 = !DILexicalBlockFile(scope: !453, file: !410, discriminator: 6)
!453 = distinct !DILexicalBlock(scope: !435, file: !410, line: 69, column: 40)
!454 = !DILocation(line: 69, column: 150, scope: !452)
!455 = !DILocation(line: 69, column: 167, scope: !456)
!456 = !DILexicalBlockFile(scope: !436, file: !410, discriminator: 7)
!457 = !DILocation(line: 70, column: 2, scope: !409)
!458 = distinct !{!458, !457}
!459 = !DILocation(line: 70, column: 10, scope: !460)
!460 = !DILexicalBlockFile(scope: !461, file: !410, discriminator: 1)
!461 = distinct !DILexicalBlock(scope: !462, file: !410, line: 70, column: 10)
!462 = distinct !DILexicalBlock(scope: !409, file: !410, line: 70, column: 4)
!463 = !DILocation(line: 70, column: 15, scope: !460)
!464 = !DILocation(line: 70, column: 1, scope: !460)
!465 = !DILocation(line: 70, column: 4, scope: !466)
