; ModuleID = './line33-expandos.o.i'
source_filename = "./line33-expandos.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct.EXPANDO_REC = type { i8* (%struct._SERVER_REC*, i8*, i32*)*, i32, [10 x i32], [10 x i32] }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !43, globals: !505)
!1 = !DIFile(filename: "line33-expandos.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 7, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "expandos.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIEnumerator(name: "EXPANDO_ARG_NONE", value: 1)
!39 = !DIEnumerator(name: "EXPANDO_ARG_SERVER", value: 2)
!40 = !DIEnumerator(name: "EXPANDO_ARG_WINDOW", value: 3)
!41 = !DIEnumerator(name: "EXPANDO_ARG_WINDOW_ITEM", value: 4)
!42 = !DIEnumerator(name: "EXPANDO_NEVER", value: 5)
!43 = !{!44, !45, !49, !51, !52, !53, !489, !482, !496, !501, !187, !383, !156, !63, !454, !403}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPANDO_REC", file: !55, line: 48, baseType: !56)
!55 = !DIFile(filename: "expandos.c", directory: "/home/lichi/Desktop/irssi/task1")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 42, size: 768, align: 64, elements: !57)
!57 = !{!58, !483, !484, !488}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !56, file: !55, line: 43, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPANDO_FUNC", file: !36, line: 16, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !44, !482}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !66, line: 107, baseType: !67)
!66 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !68, line: 30, size: 2240, align: 64, elements: !69)
!68 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!69 = !{!70, !72, !73, !74, !303, !308, !309, !310, !311, !312, !313, !314, !315, !316, !320, !321, !325, !326, !327, !331, !336, !337, !338, !339, !340, !341, !342, !343, !350, !351, !352, !353, !354, !358, !362, !366, !370, !374, !379, !450, !477, !481}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !71, line: 3, baseType: !51, size: 32, align: 32)
!71 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !67, file: !71, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !67, file: !71, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !67, file: !71, line: 8, baseType: !75, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !66, line: 113, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !68, line: 25, size: 1920, align: 64, elements: !78)
!78 = !{!79, !81, !82, !83, !84, !85, !86, !87, !88, !90, !91, !92, !93, !94, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !80, line: 3, baseType: !51, size: 32, align: 32)
!80 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !77, file: !80, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !77, file: !80, line: 6, baseType: !51, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !77, file: !80, line: 9, baseType: !63, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !77, file: !80, line: 10, baseType: !51, size: 32, align: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !77, file: !80, line: 11, baseType: !63, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !77, file: !80, line: 11, baseType: !63, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !77, file: !80, line: 11, baseType: !63, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !77, file: !80, line: 13, baseType: !89, size: 16, align: 16, offset: 448)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !77, file: !80, line: 14, baseType: !63, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !77, file: !80, line: 15, baseType: !63, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !77, file: !80, line: 16, baseType: !51, size: 32, align: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !77, file: !80, line: 17, baseType: !63, size: 64, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !77, file: !80, line: 19, baseType: !95, size: 64, align: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !66, line: 99, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !66, line: 99, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !77, file: !80, line: 19, baseType: !95, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !77, file: !80, line: 21, baseType: !63, size: 64, align: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !77, file: !80, line: 22, baseType: !63, size: 64, align: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !77, file: !80, line: 23, baseType: !63, size: 64, align: 64, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !77, file: !80, line: 24, baseType: !63, size: 64, align: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !77, file: !80, line: 26, baseType: !63, size: 64, align: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !77, file: !80, line: 27, baseType: !63, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !77, file: !80, line: 28, baseType: !63, size: 64, align: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !77, file: !80, line: 29, baseType: !63, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !77, file: !80, line: 30, baseType: !63, size: 64, align: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !77, file: !80, line: 31, baseType: !63, size: 64, align: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !77, file: !80, line: 32, baseType: !63, size: 64, align: 64, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !77, file: !80, line: 33, baseType: !63, size: 64, align: 64, offset: 1600)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !77, file: !80, line: 35, baseType: !112, size: 64, align: 64, offset: 1664)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !115)
!115 = !{!116, !118, !260, !261, !266, !267, !268, !269, !270, !279, !280, !281, !285, !286, !287, !288, !289, !290, !291, !292}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !114, file: !4, line: 100, baseType: !117, size: 32, align: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !47, line: 49, baseType: !51)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !114, file: !4, line: 101, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !122)
!122 = !{!123, !145, !151, !158, !162, !247, !251, !256}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !121, file: !4, line: 133, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !112, !45, !128, !131, !132}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !129, line: 66, baseType: !130)
!129 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !135, line: 42, baseType: !136)
!135 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !135, line: 44, size: 128, align: 64, elements: !137)
!137 = !{!138, !143, !144}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !136, file: !135, line: 46, baseType: !139, size: 32, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !140, line: 36, baseType: !141)
!140 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !129, line: 45, baseType: !142)
!142 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !136, file: !135, line: 47, baseType: !117, size: 32, align: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !136, file: !135, line: 48, baseType: !45, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !121, file: !4, line: 138, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!127, !112, !149, !128, !131, !132}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !121, file: !4, line: 143, baseType: !152, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!127, !112, !155, !157, !132}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !129, line: 51, baseType: !156)
!156 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !121, file: !4, line: 147, baseType: !159, size: 64, align: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!127, !112, !132}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !121, file: !4, line: 149, baseType: !163, size: 64, align: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !112, !246}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !169)
!169 = !{!170, !172, !193, !222, !224, !228, !229, !230, !231, !239, !240, !241, !242}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !168, file: !16, line: 174, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !47, line: 77, baseType: !44)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !168, file: !16, line: 175, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !176)
!176 = !{!177, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !175, file: !16, line: 198, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !171}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !175, file: !16, line: 199, baseType: !178, size: 64, align: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !175, file: !16, line: 200, baseType: !183, size: 64, align: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !171, !166, !186, !192}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!191, !171}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !47, line: 50, baseType: !117)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !168, file: !16, line: 177, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !198)
!198 = !{!199, !204, !208, !212, !216, !217}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !197, file: !16, line: 216, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!191, !166, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !197, file: !16, line: 218, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!191, !166}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !197, file: !16, line: 219, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!191, !166, !187, !171}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !197, file: !16, line: 222, baseType: !213, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !166}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !197, file: !16, line: 226, baseType: !187, size: 64, align: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !197, file: !16, line: 227, baseType: !218, size: 64, align: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !168, file: !16, line: 178, baseType: !223, size: 32, align: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !47, line: 55, baseType: !142)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !168, file: !16, line: 180, baseType: !225, size: 64, align: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !227)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !168, file: !16, line: 182, baseType: !117, size: 32, align: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !16, line: 183, baseType: !223, size: 32, align: 32, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !168, file: !16, line: 184, baseType: !223, size: 32, align: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !168, file: !16, line: 186, baseType: !232, size: 64, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !234, line: 37, baseType: !235)
!234 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !234, line: 39, size: 128, align: 64, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !234, line: 41, baseType: !171, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !234, line: 42, baseType: !232, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !16, line: 188, baseType: !166, size: 64, align: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !16, line: 189, baseType: !166, size: 64, align: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !16, line: 191, baseType: !63, size: 64, align: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !168, file: !16, line: 193, baseType: !243, size: 64, align: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !121, file: !4, line: 151, baseType: !248, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !112}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !121, file: !4, line: 152, baseType: !252, size: 64, align: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!127, !112, !255, !132}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !121, file: !4, line: 155, baseType: !257, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!255, !112}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !114, file: !4, line: 103, baseType: !45, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !114, file: !4, line: 104, baseType: !262, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !263, line: 77, baseType: !264)
!263 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !263, line: 77, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !114, file: !4, line: 105, baseType: !262, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !114, file: !4, line: 106, baseType: !45, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !114, file: !4, line: 107, baseType: !223, size: 32, align: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !114, file: !4, line: 109, baseType: !128, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !114, file: !4, line: 110, baseType: !271, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !273, line: 39, baseType: !274)
!273 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !273, line: 41, size: 192, align: 64, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !274, file: !273, line: 43, baseType: !45, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !274, file: !273, line: 44, baseType: !128, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !274, file: !273, line: 45, baseType: !128, size: 64, align: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !114, file: !4, line: 111, baseType: !271, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !114, file: !4, line: 112, baseType: !271, size: 64, align: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !114, file: !4, line: 113, baseType: !282, size: 48, align: 8, offset: 704)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 48, align: 8, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 6)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !114, file: !4, line: 117, baseType: !223, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !114, file: !4, line: 118, baseType: !223, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !114, file: !4, line: 119, baseType: !223, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !114, file: !4, line: 120, baseType: !223, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !114, file: !4, line: 121, baseType: !223, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !114, file: !4, line: 122, baseType: !223, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !114, file: !4, line: 124, baseType: !171, size: 64, align: 64, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !114, file: !4, line: 125, baseType: !171, size: 64, align: 64, offset: 832)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !77, file: !80, line: 38, baseType: !142, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !77, file: !80, line: 39, baseType: !142, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !77, file: !80, line: 40, baseType: !142, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !77, file: !80, line: 41, baseType: !142, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !77, file: !80, line: 42, baseType: !142, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !77, file: !80, line: 43, baseType: !142, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !77, file: !80, line: 44, baseType: !142, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !77, file: !80, line: 45, baseType: !142, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !77, file: !80, line: 46, baseType: !63, size: 64, align: 64, offset: 1792)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !77, file: !80, line: 47, baseType: !63, size: 64, align: 64, offset: 1856)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !67, file: !71, line: 9, baseType: !304, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !305, line: 75, baseType: !306)
!305 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !307, line: 139, baseType: !156)
!307 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!308 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !67, file: !71, line: 10, baseType: !304, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !67, file: !71, line: 12, baseType: !63, size: 64, align: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !67, file: !71, line: 13, baseType: !63, size: 64, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !67, file: !71, line: 15, baseType: !142, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !67, file: !71, line: 16, baseType: !142, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !67, file: !71, line: 17, baseType: !142, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !67, file: !71, line: 18, baseType: !142, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !67, file: !71, line: 19, baseType: !142, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !67, file: !71, line: 21, baseType: !317, size: 64, align: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !66, line: 102, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !66, line: 102, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !67, file: !71, line: 22, baseType: !51, size: 32, align: 32, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !67, file: !71, line: 25, baseType: !322, size: 128, align: 64, offset: 640)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 128, align: 64, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 2)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !67, file: !71, line: 26, baseType: !51, size: 32, align: 32, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !67, file: !71, line: 27, baseType: !51, size: 32, align: 32, offset: 800)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !67, file: !71, line: 29, baseType: !328, size: 64, align: 64, offset: 832)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !66, line: 103, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !66, line: 103, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !67, file: !71, line: 30, baseType: !332, size: 64, align: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !334, line: 37, baseType: !335)
!334 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !334, line: 37, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !67, file: !71, line: 32, baseType: !63, size: 64, align: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !67, file: !71, line: 33, baseType: !63, size: 64, align: 64, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !67, file: !71, line: 34, baseType: !63, size: 64, align: 64, offset: 1088)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !67, file: !71, line: 35, baseType: !142, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !67, file: !71, line: 36, baseType: !142, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !67, file: !71, line: 37, baseType: !142, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !67, file: !71, line: 38, baseType: !142, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !67, file: !71, line: 40, baseType: !344, size: 128, align: 64, offset: 1216)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !47, line: 504, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !47, line: 506, size: 128, align: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !345, file: !47, line: 508, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !47, line: 48, baseType: !156)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !345, file: !47, line: 509, baseType: !348, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !67, file: !71, line: 41, baseType: !304, size: 64, align: 64, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !67, file: !71, line: 42, baseType: !51, size: 32, align: 32, offset: 1408)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !67, file: !71, line: 44, baseType: !232, size: 64, align: 64, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !67, file: !71, line: 45, baseType: !232, size: 64, align: 64, offset: 1536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !67, file: !71, line: 53, baseType: !355, size: 64, align: 64, offset: 1600)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !64, !49, !51}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !67, file: !71, line: 55, baseType: !359, size: 64, align: 64, offset: 1664)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!51, !64, !48}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !67, file: !71, line: 57, baseType: !363, size: 64, align: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!51, !64, !49}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !67, file: !71, line: 60, baseType: !367, size: 64, align: 64, offset: 1792)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!49, !64}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !67, file: !71, line: 62, baseType: !371, size: 64, align: 64, offset: 1856)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !64, !49, !49, !51}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !67, file: !71, line: 65, baseType: !375, size: 64, align: 64, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !64, !49, !49}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !67, file: !71, line: 69, baseType: !380, size: 64, align: 64, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!383, !64, !49}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !66, line: 109, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !386, line: 15, size: 1408, align: 64, elements: !387)
!386 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!387 = !{!388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !423, !424, !426, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !389, line: 3, baseType: !51, size: 32, align: 32)
!389 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !385, file: !389, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !385, file: !389, line: 5, baseType: !332, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !385, file: !389, line: 7, baseType: !44, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !385, file: !389, line: 8, baseType: !64, size: 64, align: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !385, file: !389, line: 9, baseType: !63, size: 64, align: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !389, line: 10, baseType: !63, size: 64, align: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !385, file: !389, line: 11, baseType: !304, size: 64, align: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !385, file: !389, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !385, file: !389, line: 13, baseType: !63, size: 64, align: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !385, file: !389, line: 15, baseType: !400, size: 64, align: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !66, line: 108, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !406, line: 5, size: 704, align: 64, elements: !407)
!406 = !DIFile(filename: "window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !389, line: 3, baseType: !51, size: 32, align: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !405, file: !389, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !405, file: !389, line: 5, baseType: !332, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !405, file: !389, line: 7, baseType: !44, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !405, file: !389, line: 8, baseType: !64, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !405, file: !389, line: 9, baseType: !63, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !389, line: 10, baseType: !63, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !405, file: !389, line: 11, baseType: !304, size: 64, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !405, file: !389, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !405, file: !389, line: 13, baseType: !63, size: 64, align: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !405, file: !389, line: 15, baseType: !400, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !405, file: !389, line: 17, baseType: !420, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!49, !403}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !385, file: !389, line: 17, baseType: !420, size: 64, align: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !385, file: !425, line: 5, baseType: !63, size: 64, align: 64, offset: 704)
!425 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!426 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !385, file: !425, line: 6, baseType: !63, size: 64, align: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !385, file: !425, line: 7, baseType: !304, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !385, file: !425, line: 9, baseType: !332, size: 64, align: 64, offset: 896)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !385, file: !425, line: 10, baseType: !430, size: 64, align: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !66, line: 111, baseType: !432)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !66, line: 111, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !385, file: !425, line: 12, baseType: !142, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !385, file: !425, line: 13, baseType: !63, size: 64, align: 64, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !385, file: !425, line: 14, baseType: !51, size: 32, align: 32, offset: 1152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !385, file: !425, line: 15, baseType: !63, size: 64, align: 64, offset: 1216)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !385, file: !425, line: 17, baseType: !142, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !385, file: !425, line: 18, baseType: !142, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !385, file: !425, line: 19, baseType: !142, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !385, file: !425, line: 20, baseType: !142, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !385, file: !425, line: 22, baseType: !142, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !385, file: !425, line: 23, baseType: !142, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !385, file: !425, line: 24, baseType: !142, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !385, file: !425, line: 25, baseType: !142, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !385, file: !425, line: 26, baseType: !142, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !385, file: !425, line: 31, baseType: !447, size: 64, align: 64, offset: 1344)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!63, !383}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !67, file: !71, line: 70, baseType: !451, size: 64, align: 64, offset: 2048)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !64, !49}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !66, line: 110, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !457, line: 15, size: 960, align: 64, elements: !458)
!457 = !DIFile(filename: "queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !473, !474, !475, !476}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !389, line: 3, baseType: !51, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !456, file: !389, line: 4, baseType: !51, size: 32, align: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !456, file: !389, line: 5, baseType: !332, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !456, file: !389, line: 7, baseType: !44, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !456, file: !389, line: 8, baseType: !64, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !456, file: !389, line: 9, baseType: !63, size: 64, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !389, line: 10, baseType: !63, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !456, file: !389, line: 11, baseType: !304, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !456, file: !389, line: 12, baseType: !51, size: 32, align: 32, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !456, file: !389, line: 13, baseType: !63, size: 64, align: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !456, file: !389, line: 15, baseType: !400, size: 64, align: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !456, file: !389, line: 17, baseType: !420, size: 64, align: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !456, file: !472, line: 5, baseType: !63, size: 64, align: 64, offset: 704)
!472 = !DIFile(filename: "query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !456, file: !472, line: 6, baseType: !63, size: 64, align: 64, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !456, file: !472, line: 7, baseType: !304, size: 64, align: 64, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !456, file: !472, line: 9, baseType: !142, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !456, file: !472, line: 11, baseType: !142, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !67, file: !71, line: 71, baseType: !478, size: 64, align: 64, offset: 2112)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!51, !49, !49}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !67, file: !71, line: 73, baseType: !478, size: 64, align: 64, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "signals", scope: !56, file: !55, line: 45, baseType: !51, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "signal_ids", scope: !56, file: !55, line: 46, baseType: !485, size: 320, align: 32, offset: 96)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 320, align: 32, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 10)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "signal_args", scope: !56, file: !55, line: 47, baseType: !485, size: 320, align: 32, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !490, line: 9, baseType: !491)
!490 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494, !494, !494, !494, !494, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !47, line: 90, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!223, !500}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !47, line: 78, baseType: !494)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !47, line: 80, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!117, !500, !500}
!505 = !{!506, !507, !508, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!506 = distinct !DIGlobalVariable(name: "current_expando", scope: !0, file: !55, line: 50, type: !49, isLocal: false, isDefinition: true, variable: i8** @current_expando)
!507 = distinct !DIGlobalVariable(name: "timer_tag", scope: !0, file: !55, line: 52, type: !51, isLocal: true, isDefinition: true, variable: i32* @timer_tag)
!508 = distinct !DIGlobalVariable(name: "char_expandos", scope: !0, file: !55, line: 54, type: !509, isLocal: true, isDefinition: true, variable: [256 x %struct.EXPANDO_REC*]* @char_expandos)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 16384, align: 64, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 256)
!512 = distinct !DIGlobalVariable(name: "expandos", scope: !0, file: !55, line: 55, type: !332, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @expandos)
!513 = distinct !DIGlobalVariable(name: "last_sent_msg", scope: !0, file: !55, line: 56, type: !63, isLocal: true, isDefinition: true, variable: i8** @last_sent_msg)
!514 = distinct !DIGlobalVariable(name: "last_sent_msg_body", scope: !0, file: !55, line: 56, type: !63, isLocal: true, isDefinition: true, variable: i8** @last_sent_msg_body)
!515 = distinct !DIGlobalVariable(name: "last_privmsg_from", scope: !0, file: !55, line: 57, type: !63, isLocal: true, isDefinition: true, variable: i8** @last_privmsg_from)
!516 = distinct !DIGlobalVariable(name: "last_public_from", scope: !0, file: !55, line: 57, type: !63, isLocal: true, isDefinition: true, variable: i8** @last_public_from)
!517 = distinct !DIGlobalVariable(name: "sysname", scope: !0, file: !55, line: 58, type: !63, isLocal: true, isDefinition: true, variable: i8** @sysname)
!518 = distinct !DIGlobalVariable(name: "sysrelease", scope: !0, file: !55, line: 58, type: !63, isLocal: true, isDefinition: true, variable: i8** @sysrelease)
!519 = distinct !DIGlobalVariable(name: "sysarch", scope: !0, file: !55, line: 58, type: !63, isLocal: true, isDefinition: true, variable: i8** @sysarch)
!520 = distinct !DIGlobalVariable(name: "timestamp_format", scope: !0, file: !55, line: 60, type: !63, isLocal: true, isDefinition: true, variable: i8** @timestamp_format)
!521 = distinct !DIGlobalVariable(name: "last_timestamp", scope: !0, file: !55, line: 62, type: !304, isLocal: true, isDefinition: true, variable: i64* @last_timestamp)
!522 = distinct !DIGlobalVariable(name: "timestamp_seconds", scope: !0, file: !55, line: 61, type: !51, isLocal: true, isDefinition: true, variable: i32* @timestamp_seconds)
!523 = !{i32 2, !"Dwarf Version", i32 4}
!524 = !{i32 2, !"Debug Info Version", i32 3}
!525 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!526 = distinct !DISubprogram(name: "expando_create", scope: !55, file: !55, line: 68, type: !527, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !49, !59, null}
!529 = !{}
!530 = !DILocalVariable(name: "key", arg: 1, scope: !526, file: !55, line: 68, type: !49)
!531 = !DIExpression()
!532 = !DILocation(line: 68, column: 33, scope: !526)
!533 = !DILocalVariable(name: "func", arg: 2, scope: !526, file: !55, line: 68, type: !59)
!534 = !DILocation(line: 68, column: 51, scope: !526)
!535 = !DILocalVariable(name: "rec", scope: !526, file: !55, line: 70, type: !53)
!536 = !DILocation(line: 70, column: 22, scope: !526)
!537 = !DILocalVariable(name: "signal", scope: !526, file: !55, line: 71, type: !49)
!538 = !DILocation(line: 71, column: 21, scope: !526)
!539 = !DILocalVariable(name: "va", scope: !526, file: !55, line: 72, type: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !541, line: 79, baseType: !542)
!541 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !543, line: 40, baseType: !544)
!543 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdarg.h", directory: "/home/lichi/Desktop/irssi/task1")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 72, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 192, align: 64, elements: !552)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 72, size: 192, align: 64, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !546, file: !1, line: 72, baseType: !142, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !546, file: !1, line: 72, baseType: !142, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !546, file: !1, line: 72, baseType: !44, size: 64, align: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !546, file: !1, line: 72, baseType: !44, size: 64, align: 64, offset: 128)
!552 = !{!553}
!553 = !DISubrange(count: 1)
!554 = !DILocation(line: 72, column: 10, scope: !526)
!555 = !DILocation(line: 74, column: 2, scope: !526)
!556 = distinct !{!556, !555}
!557 = !DILocation(line: 74, column: 10, scope: !558)
!558 = !DILexicalBlockFile(scope: !559, file: !55, discriminator: 1)
!559 = distinct !DILexicalBlock(scope: !560, file: !55, line: 74, column: 10)
!560 = distinct !DILexicalBlock(scope: !526, file: !55, line: 74, column: 4)
!561 = !DILocation(line: 74, column: 14, scope: !558)
!562 = !DILocation(line: 74, column: 1, scope: !558)
!563 = !DILocation(line: 74, column: 5, scope: !564)
!564 = !DILexicalBlockFile(scope: !559, file: !55, discriminator: 2)
!565 = !DILocation(line: 74, column: 4, scope: !564)
!566 = !DILocation(line: 74, column: 9, scope: !564)
!567 = !DILocation(line: 74, column: 10, scope: !564)
!568 = !DILocation(line: 74, column: 20, scope: !569)
!569 = !DILexicalBlockFile(scope: !570, file: !55, discriminator: 3)
!570 = distinct !DILexicalBlock(scope: !559, file: !55, line: 74, column: 18)
!571 = !DILocation(line: 74, column: 29, scope: !572)
!572 = !DILexicalBlockFile(scope: !573, file: !55, discriminator: 4)
!573 = distinct !DILexicalBlock(scope: !559, file: !55, line: 74, column: 27)
!574 = !DILocation(line: 74, column: 130, scope: !572)
!575 = !DILocation(line: 74, column: 141, scope: !576)
!576 = !DILexicalBlockFile(scope: !560, file: !55, discriminator: 5)
!577 = !DILocation(line: 75, column: 2, scope: !526)
!578 = distinct !{!578, !577}
!579 = !DILocation(line: 75, column: 10, scope: !580)
!580 = !DILexicalBlockFile(scope: !581, file: !55, discriminator: 1)
!581 = distinct !DILexicalBlock(scope: !582, file: !55, line: 75, column: 10)
!582 = distinct !DILexicalBlock(scope: !526, file: !55, line: 75, column: 4)
!583 = !DILocation(line: 75, column: 15, scope: !580)
!584 = !DILocation(line: 75, column: 5, scope: !585)
!585 = !DILexicalBlockFile(scope: !586, file: !55, discriminator: 2)
!586 = distinct !DILexicalBlock(scope: !581, file: !55, line: 75, column: 3)
!587 = !DILocation(line: 75, column: 14, scope: !588)
!588 = !DILexicalBlockFile(scope: !589, file: !55, discriminator: 3)
!589 = distinct !DILexicalBlock(scope: !581, file: !55, line: 75, column: 12)
!590 = !DILocation(line: 75, column: 99, scope: !588)
!591 = !DILocation(line: 75, column: 110, scope: !592)
!592 = !DILexicalBlockFile(scope: !582, file: !55, discriminator: 4)
!593 = !DILocation(line: 77, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !526, file: !55, line: 77, column: 6)
!595 = !DILocation(line: 77, column: 13, scope: !594)
!596 = !DILocation(line: 77, column: 6, scope: !526)
!597 = !DILocation(line: 78, column: 29, scope: !594)
!598 = !DILocation(line: 78, column: 39, scope: !594)
!599 = !DILocation(line: 78, column: 9, scope: !594)
!600 = !DILocation(line: 78, column: 7, scope: !594)
!601 = !DILocation(line: 78, column: 3, scope: !594)
!602 = !DILocation(line: 81, column: 47, scope: !603)
!603 = distinct !DILexicalBlock(scope: !594, file: !55, line: 79, column: 7)
!604 = !DILocation(line: 81, column: 46, scope: !603)
!605 = !DILocation(line: 81, column: 24, scope: !603)
!606 = !DILocation(line: 81, column: 10, scope: !603)
!607 = !DILocation(line: 81, column: 7, scope: !603)
!608 = !DILocation(line: 84, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !526, file: !55, line: 84, column: 6)
!610 = !DILocation(line: 84, column: 10, scope: !609)
!611 = !DILocation(line: 84, column: 6, scope: !526)
!612 = !DILocation(line: 85, column: 3, scope: !609)
!613 = !DILocation(line: 85, column: 8, scope: !609)
!614 = !DILocation(line: 85, column: 16, scope: !609)
!615 = !DILocation(line: 87, column: 26, scope: !616)
!616 = distinct !DILexicalBlock(scope: !609, file: !55, line: 86, column: 7)
!617 = !DILocation(line: 87, column: 10, scope: !616)
!618 = !DILocation(line: 87, column: 7, scope: !616)
!619 = !DILocation(line: 88, column: 21, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !55, line: 88, column: 21)
!621 = !DILocation(line: 88, column: 28, scope: !620)
!622 = !DILocation(line: 88, column: 21, scope: !616)
!623 = !DILocation(line: 89, column: 24, scope: !620)
!624 = !DILocation(line: 89, column: 43, scope: !620)
!625 = !DILocation(line: 89, column: 34, scope: !620)
!626 = !DILocation(line: 89, column: 49, scope: !620)
!627 = !DILocation(line: 89, column: 4, scope: !628)
!628 = !DILexicalBlockFile(scope: !620, file: !55, discriminator: 1)
!629 = !DILocation(line: 89, column: 4, scope: !620)
!630 = !DILocation(line: 91, column: 48, scope: !620)
!631 = !DILocation(line: 91, column: 41, scope: !620)
!632 = !DILocation(line: 91, column: 40, scope: !620)
!633 = !DILocation(line: 91, column: 18, scope: !620)
!634 = !DILocation(line: 91, column: 4, scope: !620)
!635 = !DILocation(line: 91, column: 46, scope: !620)
!636 = !DILocation(line: 94, column: 14, scope: !526)
!637 = !DILocation(line: 94, column: 2, scope: !526)
!638 = !DILocation(line: 94, column: 7, scope: !526)
!639 = !DILocation(line: 94, column: 12, scope: !526)
!640 = !DILocation(line: 96, column: 1, scope: !526)
!641 = !DILocation(line: 97, column: 2, scope: !526)
!642 = !DILocation(line: 97, column: 33, scope: !643)
!643 = !DILexicalBlockFile(scope: !526, file: !55, discriminator: 1)
!644 = !DILocation(line: 97, column: 33, scope: !645)
!645 = !DILexicalBlockFile(scope: !526, file: !55, discriminator: 2)
!646 = !DILocation(line: 97, column: 33, scope: !647)
!647 = !DILexicalBlockFile(scope: !526, file: !55, discriminator: 3)
!648 = !DILocation(line: 97, column: 33, scope: !649)
!649 = !DILexicalBlockFile(scope: !526, file: !55, discriminator: 4)
!650 = !DILocation(line: 97, column: 17, scope: !649)
!651 = !DILocation(line: 97, column: 59, scope: !649)
!652 = !DILocation(line: 97, column: 2, scope: !649)
!653 = !DILocation(line: 98, column: 35, scope: !526)
!654 = !DILocation(line: 98, column: 40, scope: !526)
!655 = !DILocation(line: 98, column: 53, scope: !526)
!656 = !DILocation(line: 98, column: 53, scope: !643)
!657 = !DILocation(line: 98, column: 53, scope: !645)
!658 = !DILocation(line: 98, column: 53, scope: !647)
!659 = !DILocation(line: 98, column: 16, scope: !647)
!660 = !DILocation(line: 97, column: 2, scope: !661)
!661 = !DILexicalBlockFile(scope: !526, file: !55, discriminator: 5)
!662 = distinct !{!662, !641}
!663 = !DILocation(line: 99, column: 8, scope: !526)
!664 = !DILocation(line: 100, column: 1, scope: !526)
!665 = !DILocation(line: 100, column: 1, scope: !643)
!666 = distinct !DISubprogram(name: "expando_add_signal", scope: !55, file: !55, line: 111, type: !667, isLocal: false, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !49, !49, !669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExpandoArg", file: !36, line: 14, baseType: !35)
!670 = !DILocalVariable(name: "key", arg: 1, scope: !666, file: !55, line: 111, type: !49)
!671 = !DILocation(line: 111, column: 37, scope: !666)
!672 = !DILocalVariable(name: "signal", arg: 2, scope: !666, file: !55, line: 111, type: !49)
!673 = !DILocation(line: 111, column: 54, scope: !666)
!674 = !DILocalVariable(name: "arg", arg: 3, scope: !666, file: !55, line: 111, type: !669)
!675 = !DILocation(line: 111, column: 73, scope: !666)
!676 = !DILocalVariable(name: "rec", scope: !666, file: !55, line: 113, type: !53)
!677 = !DILocation(line: 113, column: 15, scope: !666)
!678 = !DILocation(line: 115, column: 2, scope: !666)
!679 = distinct !{!679, !678}
!680 = !DILocation(line: 115, column: 10, scope: !681)
!681 = !DILexicalBlockFile(scope: !682, file: !55, discriminator: 1)
!682 = distinct !DILexicalBlock(scope: !683, file: !55, line: 115, column: 10)
!683 = distinct !DILexicalBlock(scope: !666, file: !55, line: 115, column: 4)
!684 = !DILocation(line: 115, column: 14, scope: !681)
!685 = !DILocation(line: 115, column: 5, scope: !686)
!686 = !DILexicalBlockFile(scope: !687, file: !55, discriminator: 2)
!687 = distinct !DILexicalBlock(scope: !682, file: !55, line: 115, column: 3)
!688 = !DILocation(line: 115, column: 14, scope: !689)
!689 = !DILexicalBlockFile(scope: !690, file: !55, discriminator: 3)
!690 = distinct !DILexicalBlock(scope: !682, file: !55, line: 115, column: 12)
!691 = !DILocation(line: 115, column: 98, scope: !689)
!692 = !DILocation(line: 115, column: 109, scope: !693)
!693 = !DILexicalBlockFile(scope: !683, file: !55, discriminator: 4)
!694 = !DILocation(line: 116, column: 2, scope: !666)
!695 = distinct !{!695, !694}
!696 = !DILocation(line: 116, column: 10, scope: !697)
!697 = !DILexicalBlockFile(scope: !698, file: !55, discriminator: 1)
!698 = distinct !DILexicalBlock(scope: !699, file: !55, line: 116, column: 10)
!699 = distinct !DILexicalBlock(scope: !666, file: !55, line: 116, column: 4)
!700 = !DILocation(line: 116, column: 17, scope: !697)
!701 = !DILocation(line: 116, column: 5, scope: !702)
!702 = !DILexicalBlockFile(scope: !703, file: !55, discriminator: 2)
!703 = distinct !DILexicalBlock(scope: !698, file: !55, line: 116, column: 3)
!704 = !DILocation(line: 116, column: 14, scope: !705)
!705 = !DILexicalBlockFile(scope: !706, file: !55, discriminator: 3)
!706 = distinct !DILexicalBlock(scope: !698, file: !55, line: 116, column: 12)
!707 = !DILocation(line: 116, column: 101, scope: !705)
!708 = !DILocation(line: 116, column: 112, scope: !709)
!709 = !DILexicalBlockFile(scope: !699, file: !55, discriminator: 4)
!710 = !DILocation(line: 118, column: 28, scope: !666)
!711 = !DILocation(line: 118, column: 15, scope: !666)
!712 = !DILocation(line: 118, column: 13, scope: !666)
!713 = !DILocation(line: 119, column: 9, scope: !666)
!714 = distinct !{!714, !713}
!715 = !DILocation(line: 119, column: 17, scope: !716)
!716 = !DILexicalBlockFile(scope: !717, file: !55, discriminator: 1)
!717 = distinct !DILexicalBlock(scope: !718, file: !55, line: 119, column: 17)
!718 = distinct !DILexicalBlock(scope: !666, file: !55, line: 119, column: 11)
!719 = !DILocation(line: 119, column: 21, scope: !716)
!720 = !DILocation(line: 119, column: 12, scope: !721)
!721 = !DILexicalBlockFile(scope: !722, file: !55, discriminator: 2)
!722 = distinct !DILexicalBlock(scope: !717, file: !55, line: 119, column: 10)
!723 = !DILocation(line: 119, column: 21, scope: !724)
!724 = !DILexicalBlockFile(scope: !725, file: !55, discriminator: 3)
!725 = distinct !DILexicalBlock(scope: !717, file: !55, line: 119, column: 19)
!726 = !DILocation(line: 119, column: 105, scope: !724)
!727 = !DILocation(line: 119, column: 116, scope: !728)
!728 = !DILexicalBlockFile(scope: !718, file: !55, discriminator: 4)
!729 = !DILocation(line: 121, column: 6, scope: !730)
!730 = distinct !DILexicalBlock(scope: !666, file: !55, line: 121, column: 6)
!731 = !DILocation(line: 121, column: 10, scope: !730)
!732 = !DILocation(line: 121, column: 6, scope: !666)
!733 = !DILocation(line: 123, column: 3, scope: !734)
!734 = distinct !DILexicalBlock(scope: !730, file: !55, line: 121, column: 28)
!735 = !DILocation(line: 123, column: 8, scope: !734)
!736 = !DILocation(line: 123, column: 16, scope: !734)
!737 = !DILocation(line: 124, column: 2, scope: !734)
!738 = !DILocation(line: 124, column: 13, scope: !739)
!739 = !DILexicalBlockFile(scope: !740, file: !55, discriminator: 1)
!740 = distinct !DILexicalBlock(scope: !730, file: !55, line: 124, column: 13)
!741 = !DILocation(line: 124, column: 18, scope: !739)
!742 = !DILocation(line: 124, column: 26, scope: !739)
!743 = !DILocation(line: 125, column: 3, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !55, line: 124, column: 32)
!745 = distinct !{!745, !743}
!746 = !DILocation(line: 125, column: 11, scope: !747)
!747 = !DILexicalBlockFile(scope: !748, file: !55, discriminator: 1)
!748 = distinct !DILexicalBlock(scope: !749, file: !55, line: 125, column: 11)
!749 = distinct !DILexicalBlock(scope: !744, file: !55, line: 125, column: 5)
!750 = !DILocation(line: 125, column: 16, scope: !747)
!751 = !DILocation(line: 125, column: 24, scope: !747)
!752 = !DILocation(line: 125, column: 33, scope: !753)
!753 = !DILexicalBlockFile(scope: !754, file: !55, discriminator: 2)
!754 = distinct !DILexicalBlock(scope: !748, file: !55, line: 125, column: 31)
!755 = !DILocation(line: 125, column: 42, scope: !756)
!756 = !DILexicalBlockFile(scope: !757, file: !55, discriminator: 3)
!757 = distinct !DILexicalBlock(scope: !748, file: !55, line: 125, column: 40)
!758 = !DILocation(line: 125, column: 133, scope: !756)
!759 = !DILocation(line: 125, column: 144, scope: !760)
!760 = !DILexicalBlockFile(scope: !749, file: !55, discriminator: 4)
!761 = !DILocation(line: 127, column: 69, scope: !744)
!762 = !DILocation(line: 127, column: 35, scope: !744)
!763 = !DILocation(line: 127, column: 19, scope: !744)
!764 = !DILocation(line: 127, column: 24, scope: !744)
!765 = !DILocation(line: 127, column: 3, scope: !744)
!766 = !DILocation(line: 127, column: 8, scope: !744)
!767 = !DILocation(line: 127, column: 33, scope: !744)
!768 = !DILocation(line: 128, column: 36, scope: !744)
!769 = !DILocation(line: 128, column: 20, scope: !744)
!770 = !DILocation(line: 128, column: 25, scope: !744)
!771 = !DILocation(line: 128, column: 3, scope: !744)
!772 = !DILocation(line: 128, column: 8, scope: !744)
!773 = !DILocation(line: 128, column: 34, scope: !744)
!774 = !DILocation(line: 129, column: 17, scope: !744)
!775 = !DILocation(line: 129, column: 22, scope: !744)
!776 = !DILocation(line: 129, column: 29, scope: !744)
!777 = !DILocation(line: 130, column: 2, scope: !744)
!778 = !DILocation(line: 131, column: 1, scope: !666)
!779 = distinct !DISubprogram(name: "expando_find", scope: !55, file: !55, line: 102, type: !780, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!780 = !DISubroutineType(types: !781)
!781 = !{!53, !49}
!782 = !DILocalVariable(name: "key", arg: 1, scope: !779, file: !55, line: 102, type: !49)
!783 = !DILocation(line: 102, column: 46, scope: !779)
!784 = !DILocation(line: 104, column: 6, scope: !785)
!785 = distinct !DILexicalBlock(scope: !779, file: !55, line: 104, column: 6)
!786 = !DILocation(line: 104, column: 13, scope: !785)
!787 = !DILocation(line: 104, column: 6, scope: !779)
!788 = !DILocation(line: 105, column: 30, scope: !785)
!789 = !DILocation(line: 105, column: 40, scope: !785)
!790 = !DILocation(line: 105, column: 10, scope: !785)
!791 = !DILocation(line: 105, column: 3, scope: !785)
!792 = !DILocation(line: 107, column: 48, scope: !785)
!793 = !DILocation(line: 107, column: 47, scope: !785)
!794 = !DILocation(line: 107, column: 25, scope: !785)
!795 = !DILocation(line: 107, column: 11, scope: !785)
!796 = !DILocation(line: 107, column: 3, scope: !785)
!797 = !DILocation(line: 108, column: 1, scope: !779)
!798 = distinct !DISubprogram(name: "expando_destroy", scope: !55, file: !55, line: 134, type: !799, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !49, !59}
!801 = !DILocalVariable(name: "key", arg: 1, scope: !798, file: !55, line: 134, type: !49)
!802 = !DILocation(line: 134, column: 34, scope: !798)
!803 = !DILocalVariable(name: "func", arg: 2, scope: !798, file: !55, line: 134, type: !59)
!804 = !DILocation(line: 134, column: 52, scope: !798)
!805 = !DILocalVariable(name: "origkey", scope: !798, file: !55, line: 136, type: !171)
!806 = !DILocation(line: 136, column: 11, scope: !798)
!807 = !DILocalVariable(name: "value", scope: !798, file: !55, line: 136, type: !171)
!808 = !DILocation(line: 136, column: 20, scope: !798)
!809 = !DILocalVariable(name: "rec", scope: !798, file: !55, line: 137, type: !53)
!810 = !DILocation(line: 137, column: 22, scope: !798)
!811 = !DILocation(line: 139, column: 2, scope: !798)
!812 = distinct !{!812, !811}
!813 = !DILocation(line: 139, column: 10, scope: !814)
!814 = !DILexicalBlockFile(scope: !815, file: !55, discriminator: 1)
!815 = distinct !DILexicalBlock(scope: !816, file: !55, line: 139, column: 10)
!816 = distinct !DILexicalBlock(scope: !798, file: !55, line: 139, column: 4)
!817 = !DILocation(line: 139, column: 14, scope: !814)
!818 = !DILocation(line: 139, column: 1, scope: !814)
!819 = !DILocation(line: 139, column: 5, scope: !820)
!820 = !DILexicalBlockFile(scope: !815, file: !55, discriminator: 2)
!821 = !DILocation(line: 139, column: 4, scope: !820)
!822 = !DILocation(line: 139, column: 9, scope: !820)
!823 = !DILocation(line: 139, column: 10, scope: !820)
!824 = !DILocation(line: 139, column: 20, scope: !825)
!825 = !DILexicalBlockFile(scope: !826, file: !55, discriminator: 3)
!826 = distinct !DILexicalBlock(scope: !815, file: !55, line: 139, column: 18)
!827 = !DILocation(line: 139, column: 29, scope: !828)
!828 = !DILexicalBlockFile(scope: !829, file: !55, discriminator: 4)
!829 = distinct !DILexicalBlock(scope: !815, file: !55, line: 139, column: 27)
!830 = !DILocation(line: 139, column: 130, scope: !828)
!831 = !DILocation(line: 139, column: 141, scope: !832)
!832 = !DILexicalBlockFile(scope: !816, file: !55, discriminator: 5)
!833 = !DILocation(line: 140, column: 2, scope: !798)
!834 = distinct !{!834, !833}
!835 = !DILocation(line: 140, column: 10, scope: !836)
!836 = !DILexicalBlockFile(scope: !837, file: !55, discriminator: 1)
!837 = distinct !DILexicalBlock(scope: !838, file: !55, line: 140, column: 10)
!838 = distinct !DILexicalBlock(scope: !798, file: !55, line: 140, column: 4)
!839 = !DILocation(line: 140, column: 15, scope: !836)
!840 = !DILocation(line: 140, column: 5, scope: !841)
!841 = !DILexicalBlockFile(scope: !842, file: !55, discriminator: 2)
!842 = distinct !DILexicalBlock(scope: !837, file: !55, line: 140, column: 3)
!843 = !DILocation(line: 140, column: 14, scope: !844)
!844 = !DILexicalBlockFile(scope: !845, file: !55, discriminator: 3)
!845 = distinct !DILexicalBlock(scope: !837, file: !55, line: 140, column: 12)
!846 = !DILocation(line: 140, column: 99, scope: !844)
!847 = !DILocation(line: 140, column: 110, scope: !848)
!848 = !DILexicalBlockFile(scope: !838, file: !55, discriminator: 4)
!849 = !DILocation(line: 142, column: 6, scope: !850)
!850 = distinct !DILexicalBlock(scope: !798, file: !55, line: 142, column: 6)
!851 = !DILocation(line: 142, column: 13, scope: !850)
!852 = !DILocation(line: 142, column: 6, scope: !798)
!853 = !DILocation(line: 144, column: 47, scope: !854)
!854 = distinct !DILexicalBlock(scope: !850, file: !55, line: 142, column: 22)
!855 = !DILocation(line: 144, column: 46, scope: !854)
!856 = !DILocation(line: 144, column: 24, scope: !854)
!857 = !DILocation(line: 144, column: 10, scope: !854)
!858 = !DILocation(line: 144, column: 7, scope: !854)
!859 = !DILocation(line: 145, column: 7, scope: !860)
!860 = distinct !DILexicalBlock(scope: !854, file: !55, line: 145, column: 7)
!861 = !DILocation(line: 145, column: 11, scope: !860)
!862 = !DILocation(line: 145, column: 18, scope: !860)
!863 = !DILocation(line: 145, column: 21, scope: !864)
!864 = !DILexicalBlockFile(scope: !860, file: !55, discriminator: 1)
!865 = !DILocation(line: 145, column: 26, scope: !864)
!866 = !DILocation(line: 145, column: 34, scope: !864)
!867 = !DILocation(line: 145, column: 31, scope: !864)
!868 = !DILocation(line: 145, column: 7, scope: !864)
!869 = !DILocation(line: 146, column: 41, scope: !870)
!870 = distinct !DILexicalBlock(scope: !860, file: !55, line: 145, column: 40)
!871 = !DILocation(line: 146, column: 40, scope: !870)
!872 = !DILocation(line: 146, column: 18, scope: !870)
!873 = !DILocation(line: 146, column: 4, scope: !870)
!874 = !DILocation(line: 146, column: 46, scope: !870)
!875 = !DILocation(line: 147, column: 11, scope: !870)
!876 = !DILocation(line: 147, column: 4, scope: !870)
!877 = !DILocation(line: 148, column: 3, scope: !870)
!878 = !DILocation(line: 149, column: 2, scope: !854)
!879 = !DILocation(line: 149, column: 42, scope: !880)
!880 = !DILexicalBlockFile(scope: !881, file: !55, discriminator: 1)
!881 = distinct !DILexicalBlock(scope: !850, file: !55, line: 149, column: 13)
!882 = !DILocation(line: 149, column: 52, scope: !880)
!883 = !DILocation(line: 149, column: 13, scope: !880)
!884 = !DILocation(line: 151, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !55, line: 150, column: 26)
!886 = !DILocation(line: 151, column: 7, scope: !885)
!887 = !DILocation(line: 152, column: 7, scope: !888)
!888 = distinct !DILexicalBlock(scope: !885, file: !55, line: 152, column: 7)
!889 = !DILocation(line: 152, column: 12, scope: !888)
!890 = !DILocation(line: 152, column: 20, scope: !888)
!891 = !DILocation(line: 152, column: 17, scope: !888)
!892 = !DILocation(line: 152, column: 7, scope: !885)
!893 = !DILocation(line: 153, column: 24, scope: !894)
!894 = distinct !DILexicalBlock(scope: !888, file: !55, line: 152, column: 26)
!895 = !DILocation(line: 153, column: 34, scope: !894)
!896 = !DILocation(line: 153, column: 4, scope: !894)
!897 = !DILocation(line: 154, column: 11, scope: !894)
!898 = !DILocation(line: 154, column: 4, scope: !894)
!899 = !DILocation(line: 155, column: 11, scope: !894)
!900 = !DILocation(line: 155, column: 4, scope: !894)
!901 = !DILocation(line: 156, column: 3, scope: !894)
!902 = !DILocation(line: 157, column: 2, scope: !885)
!903 = !DILocation(line: 158, column: 1, scope: !798)
!904 = distinct !DISubprogram(name: "expando_bind", scope: !55, file: !55, line: 160, type: !905, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !49, !51, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!908 = !DILocalVariable(name: "key", arg: 1, scope: !904, file: !55, line: 160, type: !49)
!909 = !DILocation(line: 160, column: 31, scope: !904)
!910 = !DILocalVariable(name: "funccount", arg: 2, scope: !904, file: !55, line: 160, type: !51)
!911 = !DILocation(line: 160, column: 40, scope: !904)
!912 = !DILocalVariable(name: "funcs", arg: 3, scope: !904, file: !55, line: 160, type: !907)
!913 = !DILocation(line: 160, column: 64, scope: !904)
!914 = !DILocalVariable(name: "func", scope: !904, file: !55, line: 162, type: !489)
!915 = !DILocation(line: 162, column: 14, scope: !904)
!916 = !DILocalVariable(name: "rec", scope: !904, file: !55, line: 163, type: !53)
!917 = !DILocation(line: 163, column: 15, scope: !904)
!918 = !DILocalVariable(name: "n", scope: !904, file: !55, line: 164, type: !51)
!919 = !DILocation(line: 164, column: 13, scope: !904)
!920 = !DILocalVariable(name: "arg", scope: !904, file: !55, line: 164, type: !51)
!921 = !DILocation(line: 164, column: 16, scope: !904)
!922 = !DILocation(line: 166, column: 2, scope: !904)
!923 = distinct !{!923, !922}
!924 = !DILocation(line: 166, column: 10, scope: !925)
!925 = !DILexicalBlockFile(scope: !926, file: !55, discriminator: 1)
!926 = distinct !DILexicalBlock(scope: !927, file: !55, line: 166, column: 10)
!927 = distinct !DILexicalBlock(scope: !904, file: !55, line: 166, column: 4)
!928 = !DILocation(line: 166, column: 14, scope: !925)
!929 = !DILocation(line: 166, column: 5, scope: !930)
!930 = !DILexicalBlockFile(scope: !931, file: !55, discriminator: 2)
!931 = distinct !DILexicalBlock(scope: !926, file: !55, line: 166, column: 3)
!932 = !DILocation(line: 166, column: 14, scope: !933)
!933 = !DILexicalBlockFile(scope: !934, file: !55, discriminator: 3)
!934 = distinct !DILexicalBlock(scope: !926, file: !55, line: 166, column: 12)
!935 = !DILocation(line: 166, column: 98, scope: !933)
!936 = !DILocation(line: 166, column: 109, scope: !937)
!937 = !DILexicalBlockFile(scope: !927, file: !55, discriminator: 4)
!938 = !DILocation(line: 167, column: 2, scope: !904)
!939 = distinct !{!939, !938}
!940 = !DILocation(line: 167, column: 10, scope: !941)
!941 = !DILexicalBlockFile(scope: !942, file: !55, discriminator: 1)
!942 = distinct !DILexicalBlock(scope: !943, file: !55, line: 167, column: 10)
!943 = distinct !DILexicalBlock(scope: !904, file: !55, line: 167, column: 4)
!944 = !DILocation(line: 167, column: 20, scope: !941)
!945 = !DILocation(line: 167, column: 28, scope: !946)
!946 = !DILexicalBlockFile(scope: !947, file: !55, discriminator: 2)
!947 = distinct !DILexicalBlock(scope: !942, file: !55, line: 167, column: 26)
!948 = !DILocation(line: 167, column: 37, scope: !949)
!949 = !DILexicalBlockFile(scope: !950, file: !55, discriminator: 3)
!950 = distinct !DILexicalBlock(scope: !942, file: !55, line: 167, column: 35)
!951 = !DILocation(line: 167, column: 124, scope: !949)
!952 = !DILocation(line: 167, column: 135, scope: !953)
!953 = !DILexicalBlockFile(scope: !943, file: !55, discriminator: 4)
!954 = !DILocation(line: 168, column: 2, scope: !904)
!955 = distinct !{!955, !954}
!956 = !DILocation(line: 168, column: 10, scope: !957)
!957 = !DILexicalBlockFile(scope: !958, file: !55, discriminator: 1)
!958 = distinct !DILexicalBlock(scope: !959, file: !55, line: 168, column: 10)
!959 = distinct !DILexicalBlock(scope: !904, file: !55, line: 168, column: 4)
!960 = !DILocation(line: 168, column: 16, scope: !957)
!961 = !DILocation(line: 168, column: 5, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !55, discriminator: 2)
!963 = distinct !DILexicalBlock(scope: !958, file: !55, line: 168, column: 3)
!964 = !DILocation(line: 168, column: 14, scope: !965)
!965 = !DILexicalBlockFile(scope: !966, file: !55, discriminator: 3)
!966 = distinct !DILexicalBlock(scope: !958, file: !55, line: 168, column: 12)
!967 = !DILocation(line: 168, column: 100, scope: !965)
!968 = !DILocation(line: 168, column: 111, scope: !969)
!969 = !DILexicalBlockFile(scope: !959, file: !55, discriminator: 4)
!970 = !DILocation(line: 169, column: 2, scope: !904)
!971 = distinct !{!971, !970}
!972 = !DILocation(line: 169, column: 10, scope: !973)
!973 = !DILexicalBlockFile(scope: !974, file: !55, discriminator: 1)
!974 = distinct !DILexicalBlock(scope: !975, file: !55, line: 169, column: 10)
!975 = distinct !DILexicalBlock(scope: !904, file: !55, line: 169, column: 4)
!976 = !DILocation(line: 169, column: 19, scope: !973)
!977 = !DILocation(line: 169, column: 5, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !55, discriminator: 2)
!979 = distinct !DILexicalBlock(scope: !974, file: !55, line: 169, column: 3)
!980 = !DILocation(line: 169, column: 14, scope: !981)
!981 = !DILexicalBlockFile(scope: !982, file: !55, discriminator: 3)
!982 = distinct !DILexicalBlock(scope: !974, file: !55, line: 169, column: 12)
!983 = !DILocation(line: 169, column: 103, scope: !981)
!984 = !DILocation(line: 169, column: 114, scope: !985)
!985 = !DILexicalBlockFile(scope: !975, file: !55, discriminator: 4)
!986 = !DILocation(line: 171, column: 28, scope: !904)
!987 = !DILocation(line: 171, column: 15, scope: !904)
!988 = !DILocation(line: 171, column: 13, scope: !904)
!989 = !DILocation(line: 172, column: 2, scope: !904)
!990 = distinct !{!990, !989}
!991 = !DILocation(line: 172, column: 10, scope: !992)
!992 = !DILexicalBlockFile(scope: !993, file: !55, discriminator: 1)
!993 = distinct !DILexicalBlock(scope: !994, file: !55, line: 172, column: 10)
!994 = distinct !DILexicalBlock(scope: !904, file: !55, line: 172, column: 4)
!995 = !DILocation(line: 172, column: 14, scope: !992)
!996 = !DILocation(line: 172, column: 5, scope: !997)
!997 = !DILexicalBlockFile(scope: !998, file: !55, discriminator: 2)
!998 = distinct !DILexicalBlock(scope: !993, file: !55, line: 172, column: 3)
!999 = !DILocation(line: 172, column: 14, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !1001, file: !55, discriminator: 3)
!1001 = distinct !DILexicalBlock(scope: !993, file: !55, line: 172, column: 12)
!1002 = !DILocation(line: 172, column: 98, scope: !1000)
!1003 = !DILocation(line: 172, column: 109, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !994, file: !55, discriminator: 4)
!1005 = !DILocation(line: 174, column: 6, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !904, file: !55, line: 174, column: 6)
!1007 = !DILocation(line: 174, column: 11, scope: !1006)
!1008 = !DILocation(line: 174, column: 19, scope: !1006)
!1009 = !DILocation(line: 174, column: 6, scope: !904)
!1010 = !DILocation(line: 177, column: 78, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1006, file: !55, line: 174, column: 25)
!1012 = !DILocation(line: 177, column: 17, scope: !1011)
!1013 = !DILocation(line: 178, column: 2, scope: !1011)
!1014 = !DILocation(line: 180, column: 9, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !904, file: !55, line: 180, column: 2)
!1016 = !DILocation(line: 180, column: 7, scope: !1015)
!1017 = !DILocation(line: 180, column: 14, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1019, file: !55, discriminator: 1)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !55, line: 180, column: 2)
!1020 = !DILocation(line: 180, column: 18, scope: !1018)
!1021 = !DILocation(line: 180, column: 23, scope: !1018)
!1022 = !DILocation(line: 180, column: 16, scope: !1018)
!1023 = !DILocation(line: 180, column: 2, scope: !1018)
!1024 = !DILocation(line: 181, column: 26, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1019, file: !55, line: 180, column: 37)
!1026 = !DILocation(line: 181, column: 9, scope: !1025)
!1027 = !DILocation(line: 181, column: 14, scope: !1025)
!1028 = !DILocation(line: 181, column: 7, scope: !1025)
!1029 = !DILocation(line: 182, column: 10, scope: !1025)
!1030 = !DILocation(line: 182, column: 16, scope: !1025)
!1031 = !DILocation(line: 182, column: 14, scope: !1025)
!1032 = !DILocation(line: 182, column: 34, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1025, file: !55, discriminator: 1)
!1034 = !DILocation(line: 182, column: 28, scope: !1033)
!1035 = !DILocation(line: 182, column: 10, scope: !1033)
!1036 = !DILocation(line: 182, column: 10, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1025, file: !55, discriminator: 2)
!1038 = !DILocation(line: 182, column: 10, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1025, file: !55, discriminator: 3)
!1040 = !DILocation(line: 182, column: 8, scope: !1039)
!1041 = !DILocation(line: 183, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1025, file: !55, line: 183, column: 7)
!1043 = !DILocation(line: 183, column: 12, scope: !1042)
!1044 = !DILocation(line: 183, column: 7, scope: !1025)
!1045 = !DILocation(line: 183, column: 27, scope: !1046)
!1046 = !DILexicalBlockFile(scope: !1042, file: !55, discriminator: 1)
!1047 = !DILocation(line: 183, column: 25, scope: !1046)
!1048 = !DILocation(line: 183, column: 20, scope: !1046)
!1049 = !DILocation(line: 186, column: 24, scope: !1025)
!1050 = !DILocation(line: 186, column: 8, scope: !1025)
!1051 = !DILocation(line: 186, column: 13, scope: !1025)
!1052 = !DILocation(line: 186, column: 28, scope: !1025)
!1053 = !DILocation(line: 185, column: 3, scope: !1025)
!1054 = !DILocation(line: 187, column: 2, scope: !1025)
!1055 = !DILocation(line: 180, column: 33, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !1019, file: !55, discriminator: 2)
!1057 = !DILocation(line: 180, column: 2, scope: !1056)
!1058 = distinct !{!1058, !1059}
!1059 = !DILocation(line: 180, column: 2, scope: !904)
!1060 = !DILocation(line: 188, column: 1, scope: !904)
!1061 = distinct !DISubprogram(name: "expando_unbind", scope: !55, file: !55, line: 190, type: !905, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !529)
!1062 = !DILocalVariable(name: "key", arg: 1, scope: !1061, file: !55, line: 190, type: !49)
!1063 = !DILocation(line: 190, column: 33, scope: !1061)
!1064 = !DILocalVariable(name: "funccount", arg: 2, scope: !1061, file: !55, line: 190, type: !51)
!1065 = !DILocation(line: 190, column: 42, scope: !1061)
!1066 = !DILocalVariable(name: "funcs", arg: 3, scope: !1061, file: !55, line: 190, type: !907)
!1067 = !DILocation(line: 190, column: 66, scope: !1061)
!1068 = !DILocalVariable(name: "func", scope: !1061, file: !55, line: 192, type: !489)
!1069 = !DILocation(line: 192, column: 14, scope: !1061)
!1070 = !DILocalVariable(name: "rec", scope: !1061, file: !55, line: 193, type: !53)
!1071 = !DILocation(line: 193, column: 15, scope: !1061)
!1072 = !DILocalVariable(name: "n", scope: !1061, file: !55, line: 194, type: !51)
!1073 = !DILocation(line: 194, column: 13, scope: !1061)
!1074 = !DILocalVariable(name: "arg", scope: !1061, file: !55, line: 194, type: !51)
!1075 = !DILocation(line: 194, column: 16, scope: !1061)
!1076 = !DILocation(line: 196, column: 2, scope: !1061)
!1077 = distinct !{!1077, !1076}
!1078 = !DILocation(line: 196, column: 10, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !1080, file: !55, discriminator: 1)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !55, line: 196, column: 10)
!1081 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 196, column: 4)
!1082 = !DILocation(line: 196, column: 14, scope: !1079)
!1083 = !DILocation(line: 196, column: 5, scope: !1084)
!1084 = !DILexicalBlockFile(scope: !1085, file: !55, discriminator: 2)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !55, line: 196, column: 3)
!1086 = !DILocation(line: 196, column: 14, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1088, file: !55, discriminator: 3)
!1088 = distinct !DILexicalBlock(scope: !1080, file: !55, line: 196, column: 12)
!1089 = !DILocation(line: 196, column: 98, scope: !1087)
!1090 = !DILocation(line: 196, column: 109, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1081, file: !55, discriminator: 4)
!1092 = !DILocation(line: 197, column: 2, scope: !1061)
!1093 = distinct !{!1093, !1092}
!1094 = !DILocation(line: 197, column: 10, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1096, file: !55, discriminator: 1)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !55, line: 197, column: 10)
!1097 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 197, column: 4)
!1098 = !DILocation(line: 197, column: 20, scope: !1095)
!1099 = !DILocation(line: 197, column: 28, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1101, file: !55, discriminator: 2)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !55, line: 197, column: 26)
!1102 = !DILocation(line: 197, column: 37, scope: !1103)
!1103 = !DILexicalBlockFile(scope: !1104, file: !55, discriminator: 3)
!1104 = distinct !DILexicalBlock(scope: !1096, file: !55, line: 197, column: 35)
!1105 = !DILocation(line: 197, column: 124, scope: !1103)
!1106 = !DILocation(line: 197, column: 135, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1097, file: !55, discriminator: 4)
!1108 = !DILocation(line: 198, column: 2, scope: !1061)
!1109 = distinct !{!1109, !1108}
!1110 = !DILocation(line: 198, column: 10, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1112, file: !55, discriminator: 1)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !55, line: 198, column: 10)
!1113 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 198, column: 4)
!1114 = !DILocation(line: 198, column: 16, scope: !1111)
!1115 = !DILocation(line: 198, column: 5, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1117, file: !55, discriminator: 2)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !55, line: 198, column: 3)
!1118 = !DILocation(line: 198, column: 14, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1120, file: !55, discriminator: 3)
!1120 = distinct !DILexicalBlock(scope: !1112, file: !55, line: 198, column: 12)
!1121 = !DILocation(line: 198, column: 100, scope: !1119)
!1122 = !DILocation(line: 198, column: 111, scope: !1123)
!1123 = !DILexicalBlockFile(scope: !1113, file: !55, discriminator: 4)
!1124 = !DILocation(line: 199, column: 2, scope: !1061)
!1125 = distinct !{!1125, !1124}
!1126 = !DILocation(line: 199, column: 10, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1128, file: !55, discriminator: 1)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !55, line: 199, column: 10)
!1129 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 199, column: 4)
!1130 = !DILocation(line: 199, column: 19, scope: !1127)
!1131 = !DILocation(line: 199, column: 5, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !55, discriminator: 2)
!1133 = distinct !DILexicalBlock(scope: !1128, file: !55, line: 199, column: 3)
!1134 = !DILocation(line: 199, column: 14, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1136, file: !55, discriminator: 3)
!1136 = distinct !DILexicalBlock(scope: !1128, file: !55, line: 199, column: 12)
!1137 = !DILocation(line: 199, column: 103, scope: !1135)
!1138 = !DILocation(line: 199, column: 114, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1129, file: !55, discriminator: 4)
!1140 = !DILocation(line: 201, column: 28, scope: !1061)
!1141 = !DILocation(line: 201, column: 15, scope: !1061)
!1142 = !DILocation(line: 201, column: 13, scope: !1061)
!1143 = !DILocation(line: 202, column: 2, scope: !1061)
!1144 = distinct !{!1144, !1143}
!1145 = !DILocation(line: 202, column: 10, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1147, file: !55, discriminator: 1)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !55, line: 202, column: 10)
!1148 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 202, column: 4)
!1149 = !DILocation(line: 202, column: 14, scope: !1146)
!1150 = !DILocation(line: 202, column: 5, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1152, file: !55, discriminator: 2)
!1152 = distinct !DILexicalBlock(scope: !1147, file: !55, line: 202, column: 3)
!1153 = !DILocation(line: 202, column: 14, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1155, file: !55, discriminator: 3)
!1155 = distinct !DILexicalBlock(scope: !1147, file: !55, line: 202, column: 12)
!1156 = !DILocation(line: 202, column: 98, scope: !1154)
!1157 = !DILocation(line: 202, column: 109, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1148, file: !55, discriminator: 4)
!1159 = !DILocation(line: 204, column: 6, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 204, column: 6)
!1161 = !DILocation(line: 204, column: 11, scope: !1160)
!1162 = !DILocation(line: 204, column: 19, scope: !1160)
!1163 = !DILocation(line: 204, column: 6, scope: !1061)
!1164 = !DILocation(line: 207, column: 70, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1160, file: !55, line: 204, column: 25)
!1166 = !DILocation(line: 207, column: 17, scope: !1165)
!1167 = !DILocation(line: 208, column: 2, scope: !1165)
!1168 = !DILocation(line: 210, column: 9, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1061, file: !55, line: 210, column: 2)
!1170 = !DILocation(line: 210, column: 7, scope: !1169)
!1171 = !DILocation(line: 210, column: 14, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1173, file: !55, discriminator: 1)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !55, line: 210, column: 2)
!1174 = !DILocation(line: 210, column: 18, scope: !1172)
!1175 = !DILocation(line: 210, column: 23, scope: !1172)
!1176 = !DILocation(line: 210, column: 16, scope: !1172)
!1177 = !DILocation(line: 210, column: 2, scope: !1172)
!1178 = !DILocation(line: 211, column: 26, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1173, file: !55, line: 210, column: 37)
!1180 = !DILocation(line: 211, column: 9, scope: !1179)
!1181 = !DILocation(line: 211, column: 14, scope: !1179)
!1182 = !DILocation(line: 211, column: 7, scope: !1179)
