; ModuleID = './line248-hilight-text.o.i'
source_filename = "./line248-hilight-text.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.NICKMATCH_REC = type { %struct._GHashTable*, void (%struct._GHashTable*, %struct._CHANNEL_REC*, %struct._NICK_REC*)* }
%struct._GHashTable = type opaque
%struct._CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!294 = !DIEnumerator(name: "TXT_THEME_SAVE_FAILED", value: 175)
!295 = !DIEnumerator(name: "TXT_THEME_NOT_FOUND", value: 176)
!296 = !DIEnumerator(name: "TXT_THEME_CHANGED", value: 177)
!297 = !DIEnumerator(name: "TXT_WINDOW_THEME", value: 178)
!298 = !DIEnumerator(name: "TXT_WINDOW_THEME_DEFAULT", value: 179)
!299 = !DIEnumerator(name: "TXT_WINDOW_THEME_CHANGED", value: 180)
!300 = !DIEnumerator(name: "TXT_WINDOW_THEME_REMOVED", value: 181)
!301 = !DIEnumerator(name: "TXT_FORMAT_TITLE", value: 182)
!302 = !DIEnumerator(name: "TXT_FORMAT_SUBTITLE", value: 183)
!303 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!304 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!305 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!306 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!307 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!308 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!309 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!310 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!311 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!312 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!313 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!314 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!315 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!316 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!317 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!318 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!319 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!320 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!321 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!322 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!323 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!324 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!325 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!326 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!327 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!328 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!329 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!330 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!331 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!332 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!333 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!334 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!335 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!336 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!337 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!338 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!339 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!340 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!341 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!342 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!343 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!344 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!345 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!346 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!347 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!348 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!349 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!350 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!351 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!352 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!353 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!354 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!355 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!356 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!357 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!358 = !{!359, !360, !364, !366, !373, !374, !402, !403, !405}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !362, line: 46, baseType: !363)
!362 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!363 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !367, line: 9, baseType: !368)
!367 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !371, !371, !371, !371, !371, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!373 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "HILIGHT_REC", file: !376, line: 48, baseType: !377)
!376 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_HILIGHT_REC", file: !378, line: 7, size: 512, align: 64, elements: !379)
!378 = !DIFile(filename: "hilight-text.h", directory: "/home/lichi/Desktop/irssi/task1")
!379 = !{!380, !382, !384, !385, !386, !387, !388, !390, !391, !392, !393, !394, !395, !401}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !377, file: !378, line: 8, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !377, file: !378, line: 10, baseType: !383, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !377, file: !378, line: 11, baseType: !373, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !377, file: !378, line: 12, baseType: !381, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "act_color", scope: !377, file: !378, line: 14, baseType: !381, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !377, file: !378, line: 15, baseType: !373, size: 32, align: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !377, file: !378, line: 17, baseType: !389, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!389 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "word", scope: !377, file: !378, line: 18, baseType: !389, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nickmask", scope: !377, file: !378, line: 20, baseType: !389, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fullword", scope: !377, file: !378, line: 21, baseType: !389, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "regexp", scope: !377, file: !378, line: 22, baseType: !389, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !377, file: !378, line: 23, baseType: !389, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "preg", scope: !377, file: !378, line: 24, baseType: !396, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "Regex", file: !398, line: 9, baseType: !399)
!398 = !DIFile(filename: "../../../src/core/iregex.h", directory: "/home/lichi/Desktop/irssi/task1")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "GRegex", file: !75, line: 414, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GRegex", file: !75, line: 414, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !377, file: !378, line: 25, baseType: !381, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !362, line: 77, baseType: !359)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !362, line: 48, baseType: !404)
!404 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !362, line: 88, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !402, !402}
!409 = !{!410, !838, !839, !840}
!410 = distinct !DIGlobalVariable(name: "nickmatch", scope: !0, file: !411, line: 40, type: !412, isLocal: true, isDefinition: true, variable: %struct.NICKMATCH_REC** @nickmatch)
!411 = !DIFile(filename: "hilight-text.c", directory: "/home/lichi/Desktop/irssi/task1")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REC", file: !414, line: 10, baseType: !415)
!414 = !DIFile(filename: "../../../src/core/nickmatch-cache.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 7, size: 128, align: 64, elements: !416)
!416 = !{!417, !422}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !415, file: !414, line: 8, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !420, line: 37, baseType: !421)
!420 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !420, line: 37, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !415, file: !414, line: 9, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKMATCH_REBUILD_FUNC", file: !414, line: 4, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !418, !427, !796}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !429, line: 109, baseType: !430)
!429 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !431, line: 15, size: 1408, align: 64, elements: !432)
!431 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!432 = !{!433, !435, !436, !437, !438, !760, !761, !762, !763, !764, !765, !789, !790, !792, !793, !794, !795, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !434, line: 3, baseType: !373, size: 32, align: 32)
!434 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!435 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !430, file: !434, line: 4, baseType: !373, size: 32, align: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !430, file: !434, line: 5, baseType: !418, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !430, file: !434, line: 7, baseType: !359, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !430, file: !434, line: 8, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !429, line: 107, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !442, line: 30, size: 2240, align: 64, elements: !443)
!442 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!443 = !{!444, !446, !447, !448, !674, !679, !680, !681, !682, !683, !684, !685, !686, !687, !691, !692, !696, !697, !698, !702, !703, !704, !705, !706, !707, !708, !709, !710, !716, !717, !718, !719, !720, !724, !728, !732, !736, !740, !744, !748, !755, !759}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !445, line: 3, baseType: !373, size: 32, align: 32)
!445 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !441, file: !445, line: 4, baseType: !373, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !441, file: !445, line: 6, baseType: !373, size: 32, align: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !441, file: !445, line: 8, baseType: !449, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !429, line: 113, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !442, line: 25, size: 1920, align: 64, elements: !452)
!452 = !{!453, !455, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !451, file: !454, line: 3, baseType: !373, size: 32, align: 32)
!454 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!455 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !451, file: !454, line: 4, baseType: !373, size: 32, align: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !451, file: !454, line: 6, baseType: !373, size: 32, align: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !451, file: !454, line: 9, baseType: !381, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !451, file: !454, line: 10, baseType: !373, size: 32, align: 32, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !451, file: !454, line: 11, baseType: !381, size: 64, align: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !451, file: !454, line: 11, baseType: !381, size: 64, align: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !451, file: !454, line: 11, baseType: !381, size: 64, align: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !451, file: !454, line: 13, baseType: !463, size: 16, align: 16, offset: 448)
!463 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !451, file: !454, line: 14, baseType: !381, size: 64, align: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !451, file: !454, line: 15, baseType: !381, size: 64, align: 64, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !451, file: !454, line: 16, baseType: !373, size: 32, align: 32, offset: 640)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !451, file: !454, line: 17, baseType: !381, size: 64, align: 64, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !451, file: !454, line: 19, baseType: !469, size: 64, align: 64, offset: 768)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !429, line: 99, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !429, line: 99, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !451, file: !454, line: 19, baseType: !469, size: 64, align: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !451, file: !454, line: 21, baseType: !381, size: 64, align: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !451, file: !454, line: 22, baseType: !381, size: 64, align: 64, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !451, file: !454, line: 23, baseType: !381, size: 64, align: 64, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !451, file: !454, line: 24, baseType: !381, size: 64, align: 64, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !451, file: !454, line: 26, baseType: !381, size: 64, align: 64, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !451, file: !454, line: 27, baseType: !381, size: 64, align: 64, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !451, file: !454, line: 28, baseType: !381, size: 64, align: 64, offset: 1280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !451, file: !454, line: 29, baseType: !381, size: 64, align: 64, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !451, file: !454, line: 30, baseType: !381, size: 64, align: 64, offset: 1408)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !451, file: !454, line: 31, baseType: !381, size: 64, align: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !451, file: !454, line: 32, baseType: !381, size: 64, align: 64, offset: 1536)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !451, file: !454, line: 33, baseType: !381, size: 64, align: 64, offset: 1600)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !451, file: !454, line: 35, baseType: !486, size: 64, align: 64, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !489)
!489 = !{!490, !492, !631, !632, !637, !638, !639, !640, !641, !650, !651, !652, !656, !657, !658, !659, !660, !661, !662, !663}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !488, file: !4, line: 100, baseType: !491, size: 32, align: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !362, line: 49, baseType: !373)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !488, file: !4, line: 101, baseType: !493, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !496)
!496 = !{!497, !518, !524, !530, !534, !618, !622, !627}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !495, file: !4, line: 133, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !486, !360, !502, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !503, line: 66, baseType: !504)
!503 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!504 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !509, line: 42, baseType: !510)
!509 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !509, line: 44, size: 128, align: 64, elements: !511)
!511 = !{!512, !516, !517}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !510, file: !509, line: 46, baseType: !513, size: 32, align: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !514, line: 36, baseType: !515)
!514 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !503, line: 45, baseType: !389)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !510, file: !509, line: 47, baseType: !491, size: 32, align: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !510, file: !509, line: 48, baseType: !360, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !495, file: !4, line: 138, baseType: !519, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!501, !486, !522, !502, !505, !506}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !495, file: !4, line: 143, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!501, !486, !528, !529, !506}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !503, line: 51, baseType: !404)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !495, file: !4, line: 147, baseType: !531, size: 64, align: 64, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!501, !486, !506}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !495, file: !4, line: 149, baseType: !535, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!538, !486, !617}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !541)
!541 = !{!542, !543, !564, !593, !595, !599, !600, !601, !602, !610, !611, !612, !613}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !540, file: !16, line: 174, baseType: !402, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !540, file: !16, line: 175, baseType: !544, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !547)
!547 = !{!548, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !546, file: !16, line: 198, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !402}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !546, file: !16, line: 199, baseType: !549, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !546, file: !16, line: 200, baseType: !554, size: 64, align: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !402, !538, !557, !563}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !402}
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !362, line: 50, baseType: !491)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !540, file: !16, line: 177, baseType: !565, size: 64, align: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !569)
!569 = !{!570, !575, !579, !583, !587, !588}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !568, file: !16, line: 216, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!562, !538, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !568, file: !16, line: 218, baseType: !576, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!562, !538}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !568, file: !16, line: 219, baseType: !580, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!562, !538, !558, !402}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !568, file: !16, line: 222, baseType: !584, size: 64, align: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !538}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !568, file: !16, line: 226, baseType: !558, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !568, file: !16, line: 227, baseType: !589, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !540, file: !16, line: 178, baseType: !594, size: 32, align: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !362, line: 55, baseType: !389)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !540, file: !16, line: 180, baseType: !596, size: 64, align: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !598)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !540, file: !16, line: 182, baseType: !491, size: 32, align: 32, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !16, line: 183, baseType: !594, size: 32, align: 32, offset: 352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !540, file: !16, line: 184, baseType: !594, size: 32, align: 32, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !540, file: !16, line: 186, baseType: !603, size: 64, align: 64, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !605, line: 37, baseType: !606)
!605 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !605, line: 39, size: 128, align: 64, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !606, file: !605, line: 41, baseType: !402, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !606, file: !605, line: 42, baseType: !603, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !540, file: !16, line: 188, baseType: !538, size: 64, align: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !16, line: 189, baseType: !538, size: 64, align: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !16, line: 191, baseType: !381, size: 64, align: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !540, file: !16, line: 193, baseType: !614, size: 64, align: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !495, file: !4, line: 151, baseType: !619, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !486}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !495, file: !4, line: 152, baseType: !623, size: 64, align: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!501, !486, !626, !506}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !495, file: !4, line: 155, baseType: !628, size: 64, align: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!626, !486}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !488, file: !4, line: 103, baseType: !360, size: 64, align: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !488, file: !4, line: 104, baseType: !633, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !634, line: 77, baseType: !635)
!634 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !634, line: 77, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !488, file: !4, line: 105, baseType: !633, size: 64, align: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !488, file: !4, line: 106, baseType: !360, size: 64, align: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !488, file: !4, line: 107, baseType: !594, size: 32, align: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !488, file: !4, line: 109, baseType: !502, size: 64, align: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !488, file: !4, line: 110, baseType: !642, size: 64, align: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !644, line: 39, baseType: !645)
!644 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !644, line: 41, size: 192, align: 64, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !645, file: !644, line: 43, baseType: !360, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !645, file: !644, line: 44, baseType: !502, size: 64, align: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !645, file: !644, line: 45, baseType: !502, size: 64, align: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !488, file: !4, line: 111, baseType: !642, size: 64, align: 64, offset: 576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !488, file: !4, line: 112, baseType: !642, size: 64, align: 64, offset: 640)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !488, file: !4, line: 113, baseType: !653, size: 48, align: 8, offset: 704)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 48, align: 8, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 6)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !488, file: !4, line: 117, baseType: !594, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !488, file: !4, line: 118, baseType: !594, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !488, file: !4, line: 119, baseType: !594, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !488, file: !4, line: 120, baseType: !594, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !488, file: !4, line: 121, baseType: !594, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !488, file: !4, line: 122, baseType: !594, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !488, file: !4, line: 124, baseType: !402, size: 64, align: 64, offset: 768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !488, file: !4, line: 125, baseType: !402, size: 64, align: 64, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !451, file: !454, line: 38, baseType: !389, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !451, file: !454, line: 39, baseType: !389, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !451, file: !454, line: 40, baseType: !389, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !451, file: !454, line: 41, baseType: !389, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !451, file: !454, line: 42, baseType: !389, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !451, file: !454, line: 43, baseType: !389, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !451, file: !454, line: 44, baseType: !389, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !451, file: !454, line: 45, baseType: !389, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !451, file: !454, line: 46, baseType: !381, size: 64, align: 64, offset: 1792)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !451, file: !454, line: 47, baseType: !381, size: 64, align: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !441, file: !445, line: 9, baseType: !675, size: 64, align: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !676, line: 75, baseType: !677)
!676 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !678, line: 139, baseType: !404)
!678 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!679 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !441, file: !445, line: 10, baseType: !675, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !441, file: !445, line: 12, baseType: !381, size: 64, align: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !441, file: !445, line: 13, baseType: !381, size: 64, align: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !441, file: !445, line: 15, baseType: !389, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !441, file: !445, line: 16, baseType: !389, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !441, file: !445, line: 17, baseType: !389, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !441, file: !445, line: 18, baseType: !389, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !441, file: !445, line: 19, baseType: !389, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !441, file: !445, line: 21, baseType: !688, size: 64, align: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !429, line: 102, baseType: !690)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !429, line: 102, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !441, file: !445, line: 22, baseType: !373, size: 32, align: 32, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !441, file: !445, line: 25, baseType: !693, size: 128, align: 64, offset: 640)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 128, align: 64, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 2)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !441, file: !445, line: 26, baseType: !373, size: 32, align: 32, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !441, file: !445, line: 27, baseType: !373, size: 32, align: 32, offset: 800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !441, file: !445, line: 29, baseType: !699, size: 64, align: 64, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !429, line: 103, baseType: !701)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !429, line: 103, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !441, file: !445, line: 30, baseType: !418, size: 64, align: 64, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !441, file: !445, line: 32, baseType: !381, size: 64, align: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !441, file: !445, line: 33, baseType: !381, size: 64, align: 64, offset: 1024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !441, file: !445, line: 34, baseType: !381, size: 64, align: 64, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !441, file: !445, line: 35, baseType: !389, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !441, file: !445, line: 36, baseType: !389, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !441, file: !445, line: 37, baseType: !389, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !441, file: !445, line: 38, baseType: !389, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !441, file: !445, line: 40, baseType: !711, size: 128, align: 64, offset: 1216)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !362, line: 504, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !362, line: 506, size: 128, align: 64, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !712, file: !362, line: 508, baseType: !403, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !712, file: !362, line: 509, baseType: !403, size: 64, align: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !441, file: !445, line: 41, baseType: !675, size: 64, align: 64, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !441, file: !445, line: 42, baseType: !373, size: 32, align: 32, offset: 1408)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !441, file: !445, line: 44, baseType: !603, size: 64, align: 64, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !441, file: !445, line: 45, baseType: !603, size: 64, align: 64, offset: 1536)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !441, file: !445, line: 53, baseType: !721, size: 64, align: 64, offset: 1600)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !439, !364, !373}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !441, file: !445, line: 55, baseType: !725, size: 64, align: 64, offset: 1664)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!373, !439, !363}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !441, file: !445, line: 57, baseType: !729, size: 64, align: 64, offset: 1728)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!373, !439, !364}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !441, file: !445, line: 60, baseType: !733, size: 64, align: 64, offset: 1792)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!364, !439}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !441, file: !445, line: 62, baseType: !737, size: 64, align: 64, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !439, !364, !364, !373}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !441, file: !445, line: 65, baseType: !741, size: 64, align: 64, offset: 1920)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!383, !439, !364, !364}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !441, file: !445, line: 69, baseType: !745, size: 64, align: 64, offset: 1984)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!427, !439, !364}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !441, file: !445, line: 70, baseType: !749, size: 64, align: 64, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !439, !364}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !429, line: 110, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !429, line: 110, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !441, file: !445, line: 71, baseType: !756, size: 64, align: 64, offset: 2112)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!373, !364, !364}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !441, file: !445, line: 73, baseType: !756, size: 64, align: 64, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !430, file: !434, line: 9, baseType: !381, size: 64, align: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !434, line: 10, baseType: !381, size: 64, align: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !430, file: !434, line: 11, baseType: !675, size: 64, align: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !430, file: !434, line: 12, baseType: !373, size: 32, align: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !430, file: !434, line: 13, baseType: !381, size: 64, align: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !430, file: !434, line: 15, baseType: !766, size: 64, align: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !429, line: 108, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !772, line: 5, size: 704, align: 64, elements: !773)
!772 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !434, line: 3, baseType: !373, size: 32, align: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !771, file: !434, line: 4, baseType: !373, size: 32, align: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !771, file: !434, line: 5, baseType: !418, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !771, file: !434, line: 7, baseType: !359, size: 64, align: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !771, file: !434, line: 8, baseType: !439, size: 64, align: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !771, file: !434, line: 9, baseType: !381, size: 64, align: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !434, line: 10, baseType: !381, size: 64, align: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !771, file: !434, line: 11, baseType: !675, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !771, file: !434, line: 12, baseType: !373, size: 32, align: 32, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !771, file: !434, line: 13, baseType: !381, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !771, file: !434, line: 15, baseType: !766, size: 64, align: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !771, file: !434, line: 17, baseType: !786, size: 64, align: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!364, !769}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !430, file: !434, line: 17, baseType: !786, size: 64, align: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !430, file: !791, line: 5, baseType: !381, size: 64, align: 64, offset: 704)
!791 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!792 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !430, file: !791, line: 6, baseType: !381, size: 64, align: 64, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !430, file: !791, line: 7, baseType: !675, size: 64, align: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !430, file: !791, line: 9, baseType: !418, size: 64, align: 64, offset: 896)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !430, file: !791, line: 10, baseType: !796, size: 64, align: 64, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !429, line: 111, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !799, line: 13, size: 576, align: 64, elements: !800)
!799 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!800 = !{!801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !819, !820}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !798, file: !802, line: 3, baseType: !373, size: 32, align: 32)
!802 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!803 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !798, file: !802, line: 4, baseType: !373, size: 32, align: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !798, file: !802, line: 6, baseType: !675, size: 64, align: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !798, file: !802, line: 8, baseType: !381, size: 64, align: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !798, file: !802, line: 9, baseType: !381, size: 64, align: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !798, file: !802, line: 10, baseType: !381, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !798, file: !802, line: 11, baseType: !373, size: 32, align: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !798, file: !802, line: 14, baseType: !389, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !798, file: !802, line: 15, baseType: !389, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !798, file: !802, line: 18, baseType: !389, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !798, file: !802, line: 19, baseType: !389, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !798, file: !802, line: 20, baseType: !389, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !798, file: !802, line: 21, baseType: !389, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !798, file: !802, line: 22, baseType: !816, size: 64, align: 8, offset: 360)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, align: 8, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !798, file: !802, line: 26, baseType: !359, size: 64, align: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !802, line: 28, baseType: !796, size: 64, align: 64, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !430, file: !791, line: 12, baseType: !389, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !430, file: !791, line: 13, baseType: !381, size: 64, align: 64, offset: 1088)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !430, file: !791, line: 14, baseType: !373, size: 32, align: 32, offset: 1152)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !430, file: !791, line: 15, baseType: !381, size: 64, align: 64, offset: 1216)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !430, file: !791, line: 17, baseType: !389, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !430, file: !791, line: 18, baseType: !389, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !430, file: !791, line: 19, baseType: !389, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !430, file: !791, line: 20, baseType: !389, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !430, file: !791, line: 22, baseType: !389, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !430, file: !791, line: 23, baseType: !389, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !430, file: !791, line: 24, baseType: !389, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !430, file: !791, line: 25, baseType: !389, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !430, file: !791, line: 26, baseType: !389, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !430, file: !791, line: 31, baseType: !835, size: 64, align: 64, offset: 1344)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!381, !427}
!838 = distinct !DIGlobalVariable(name: "never_hilight_level", scope: !0, file: !411, line: 41, type: !373, isLocal: true, isDefinition: true, variable: i32* @never_hilight_level)
!839 = distinct !DIGlobalVariable(name: "default_hilight_level", scope: !0, file: !411, line: 41, type: !373, isLocal: true, isDefinition: true, variable: i32* @default_hilight_level)
!840 = distinct !DIGlobalVariable(name: "hilights", scope: !0, file: !411, line: 42, type: !603, isLocal: false, isDefinition: true, variable: %struct._GSList** @hilights)
!841 = !{i32 2, !"Dwarf Version", i32 4}
!842 = !{i32 2, !"Debug Info Version", i32 3}
!843 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!844 = distinct !DISubprogram(name: "hilight_create", scope: !411, file: !411, line: 129, type: !845, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !374}
!847 = !{}
!848 = !DILocalVariable(name: "rec", arg: 1, scope: !844, file: !411, line: 129, type: !374)
!849 = !DIExpression()
!850 = !DILocation(line: 129, column: 34, scope: !844)
!851 = !DILocation(line: 131, column: 19, scope: !852)
!852 = distinct !DILexicalBlock(scope: !844, file: !411, line: 131, column: 6)
!853 = !DILocation(line: 131, column: 29, scope: !852)
!854 = !DILocation(line: 131, column: 6, scope: !852)
!855 = !DILocation(line: 131, column: 34, scope: !852)
!856 = !DILocation(line: 131, column: 6, scope: !844)
!857 = !DILocation(line: 132, column: 25, scope: !858)
!858 = distinct !DILexicalBlock(scope: !852, file: !411, line: 131, column: 42)
!859 = !DILocation(line: 132, column: 3, scope: !858)
!860 = !DILocation(line: 133, column: 29, scope: !858)
!861 = !DILocation(line: 133, column: 39, scope: !858)
!862 = !DILocation(line: 133, column: 14, scope: !858)
!863 = !DILocation(line: 133, column: 12, scope: !858)
!864 = !DILocation(line: 134, column: 2, scope: !858)
!865 = !DILocation(line: 136, column: 28, scope: !844)
!866 = !DILocation(line: 136, column: 38, scope: !844)
!867 = !DILocation(line: 136, column: 13, scope: !844)
!868 = !DILocation(line: 136, column: 11, scope: !844)
!869 = !DILocation(line: 137, column: 21, scope: !844)
!870 = !DILocation(line: 137, column: 2, scope: !844)
!871 = !DILocation(line: 139, column: 19, scope: !844)
!872 = !DILocation(line: 139, column: 2, scope: !844)
!873 = !DILocation(line: 141, column: 36, scope: !844)
!874 = !DILocation(line: 141, column: 2, scope: !844)
!875 = !DILocation(line: 142, column: 1, scope: !844)
!876 = distinct !DISubprogram(name: "hilight_remove_config", scope: !411, file: !411, line: 91, type: !845, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!877 = !DILocalVariable(name: "rec", arg: 1, scope: !876, file: !411, line: 91, type: !374)
!878 = !DILocation(line: 91, column: 48, scope: !876)
!879 = !DILocalVariable(name: "node", scope: !876, file: !411, line: 93, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !67, line: 17, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !67, line: 20, size: 192, align: 64, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !882, file: !67, line: 21, baseType: !373, size: 32, align: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !882, file: !67, line: 22, baseType: !381, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !882, file: !67, line: 23, baseType: !359, size: 64, align: 64, offset: 128)
!887 = !DILocation(line: 93, column: 15, scope: !876)
!888 = !DILocation(line: 95, column: 2, scope: !876)
!889 = distinct !{!889, !888}
!890 = !DILocation(line: 95, column: 10, scope: !891)
!891 = !DILexicalBlockFile(scope: !892, file: !411, discriminator: 1)
!892 = distinct !DILexicalBlock(scope: !893, file: !411, line: 95, column: 10)
!893 = distinct !DILexicalBlock(scope: !876, file: !411, line: 95, column: 4)
!894 = !DILocation(line: 95, column: 14, scope: !891)
!895 = !DILocation(line: 95, column: 5, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !411, discriminator: 2)
!897 = distinct !DILexicalBlock(scope: !892, file: !411, line: 95, column: 3)
!898 = !DILocation(line: 95, column: 14, scope: !899)
!899 = !DILexicalBlockFile(scope: !900, file: !411, discriminator: 3)
!900 = distinct !DILexicalBlock(scope: !892, file: !411, line: 95, column: 12)
!901 = !DILocation(line: 95, column: 98, scope: !899)
!902 = !DILocation(line: 95, column: 109, scope: !903)
!903 = !DILexicalBlockFile(scope: !893, file: !411, discriminator: 4)
!904 = !DILocation(line: 97, column: 30, scope: !876)
!905 = !DILocation(line: 97, column: 9, scope: !876)
!906 = !DILocation(line: 97, column: 7, scope: !876)
!907 = !DILocation(line: 98, column: 6, scope: !908)
!908 = distinct !DILexicalBlock(scope: !876, file: !411, line: 98, column: 6)
!909 = !DILocation(line: 98, column: 11, scope: !908)
!910 = !DILocation(line: 98, column: 6, scope: !876)
!911 = !DILocation(line: 98, column: 43, scope: !912)
!912 = !DILexicalBlockFile(scope: !908, file: !411, discriminator: 1)
!913 = !DILocation(line: 98, column: 55, scope: !912)
!914 = !DILocation(line: 98, column: 75, scope: !912)
!915 = !DILocation(line: 98, column: 85, scope: !912)
!916 = !DILocation(line: 98, column: 61, scope: !912)
!917 = !DILocation(line: 98, column: 19, scope: !918)
!918 = !DILexicalBlockFile(scope: !912, file: !411, discriminator: 2)
!919 = !DILocation(line: 98, column: 19, scope: !912)
!920 = !DILocation(line: 99, column: 1, scope: !876)
!921 = distinct !DISubprogram(name: "hilight_add_config", scope: !411, file: !411, line: 63, type: !845, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!922 = !DILocalVariable(name: "rec", arg: 1, scope: !921, file: !411, line: 63, type: !374)
!923 = !DILocation(line: 63, column: 45, scope: !921)
!924 = !DILocalVariable(name: "node", scope: !921, file: !411, line: 65, type: !880)
!925 = !DILocation(line: 65, column: 15, scope: !921)
!926 = !DILocation(line: 67, column: 2, scope: !921)
!927 = distinct !{!927, !926}
!928 = !DILocation(line: 67, column: 10, scope: !929)
!929 = !DILexicalBlockFile(scope: !930, file: !411, discriminator: 1)
!930 = distinct !DILexicalBlock(scope: !931, file: !411, line: 67, column: 10)
!931 = distinct !DILexicalBlock(scope: !921, file: !411, line: 67, column: 4)
!932 = !DILocation(line: 67, column: 14, scope: !929)
!933 = !DILocation(line: 67, column: 5, scope: !934)
!934 = !DILexicalBlockFile(scope: !935, file: !411, discriminator: 2)
!935 = distinct !DILexicalBlock(scope: !930, file: !411, line: 67, column: 3)
!936 = !DILocation(line: 67, column: 14, scope: !937)
!937 = !DILexicalBlockFile(scope: !938, file: !411, discriminator: 3)
!938 = distinct !DILexicalBlock(scope: !930, file: !411, line: 67, column: 12)
!939 = !DILocation(line: 67, column: 98, scope: !937)
!940 = !DILocation(line: 67, column: 109, scope: !941)
!941 = !DILexicalBlockFile(scope: !931, file: !411, discriminator: 4)
!942 = !DILocation(line: 69, column: 30, scope: !921)
!943 = !DILocation(line: 69, column: 9, scope: !921)
!944 = !DILocation(line: 69, column: 7, scope: !921)
!945 = !DILocation(line: 70, column: 29, scope: !921)
!946 = !DILocation(line: 70, column: 41, scope: !921)
!947 = !DILocation(line: 70, column: 9, scope: !921)
!948 = !DILocation(line: 70, column: 7, scope: !921)
!949 = !DILocation(line: 72, column: 22, scope: !921)
!950 = !DILocation(line: 72, column: 34, scope: !921)
!951 = !DILocation(line: 72, column: 48, scope: !921)
!952 = !DILocation(line: 72, column: 53, scope: !921)
!953 = !DILocation(line: 72, column: 2, scope: !921)
!954 = !DILocation(line: 73, column: 6, scope: !955)
!955 = distinct !DILexicalBlock(scope: !921, file: !411, line: 73, column: 6)
!956 = !DILocation(line: 73, column: 11, scope: !955)
!957 = !DILocation(line: 73, column: 17, scope: !955)
!958 = !DILocation(line: 73, column: 6, scope: !921)
!959 = !DILocation(line: 73, column: 42, scope: !960)
!960 = !DILexicalBlockFile(scope: !955, file: !411, discriminator: 1)
!961 = !DILocation(line: 73, column: 54, scope: !960)
!962 = !DILocation(line: 73, column: 69, scope: !960)
!963 = !DILocation(line: 73, column: 74, scope: !960)
!964 = !DILocation(line: 73, column: 22, scope: !960)
!965 = !DILocation(line: 74, column: 6, scope: !966)
!966 = distinct !DILexicalBlock(scope: !921, file: !411, line: 74, column: 6)
!967 = !DILocation(line: 74, column: 11, scope: !966)
!968 = !DILocation(line: 74, column: 6, scope: !921)
!969 = !DILocation(line: 74, column: 38, scope: !970)
!970 = !DILexicalBlockFile(scope: !966, file: !411, discriminator: 1)
!971 = !DILocation(line: 74, column: 50, scope: !970)
!972 = !DILocation(line: 74, column: 65, scope: !970)
!973 = !DILocation(line: 74, column: 70, scope: !970)
!974 = !DILocation(line: 74, column: 18, scope: !970)
!975 = !DILocation(line: 75, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !921, file: !411, line: 75, column: 6)
!977 = !DILocation(line: 75, column: 11, scope: !976)
!978 = !DILocation(line: 75, column: 6, scope: !921)
!979 = !DILocation(line: 75, column: 42, scope: !980)
!980 = !DILexicalBlockFile(scope: !976, file: !411, discriminator: 1)
!981 = !DILocation(line: 75, column: 54, scope: !980)
!982 = !DILocation(line: 75, column: 73, scope: !980)
!983 = !DILocation(line: 75, column: 78, scope: !980)
!984 = !DILocation(line: 75, column: 22, scope: !980)
!985 = !DILocation(line: 76, column: 6, scope: !986)
!986 = distinct !DILexicalBlock(scope: !921, file: !411, line: 76, column: 6)
!987 = !DILocation(line: 76, column: 11, scope: !986)
!988 = !DILocation(line: 76, column: 20, scope: !986)
!989 = !DILocation(line: 76, column: 6, scope: !921)
!990 = !DILocation(line: 76, column: 45, scope: !991)
!991 = !DILexicalBlockFile(scope: !986, file: !411, discriminator: 1)
!992 = !DILocation(line: 76, column: 57, scope: !991)
!993 = !DILocation(line: 76, column: 75, scope: !991)
!994 = !DILocation(line: 76, column: 80, scope: !991)
!995 = !DILocation(line: 76, column: 25, scope: !991)
!996 = !DILocation(line: 77, column: 23, scope: !921)
!997 = !DILocation(line: 77, column: 35, scope: !921)
!998 = !DILocation(line: 77, column: 49, scope: !921)
!999 = !DILocation(line: 77, column: 54, scope: !921)
!1000 = !DILocation(line: 77, column: 2, scope: !921)
!1001 = !DILocation(line: 78, column: 23, scope: !921)
!1002 = !DILocation(line: 78, column: 35, scope: !921)
!1003 = !DILocation(line: 78, column: 49, scope: !921)
!1004 = !DILocation(line: 78, column: 54, scope: !921)
!1005 = !DILocation(line: 78, column: 2, scope: !921)
!1006 = !DILocation(line: 79, column: 6, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !921, file: !411, line: 79, column: 6)
!1008 = !DILocation(line: 79, column: 11, scope: !1007)
!1009 = !DILocation(line: 79, column: 6, scope: !921)
!1010 = !DILocation(line: 79, column: 42, scope: !1011)
!1011 = !DILexicalBlockFile(scope: !1007, file: !411, discriminator: 1)
!1012 = !DILocation(line: 79, column: 54, scope: !1011)
!1013 = !DILocation(line: 79, column: 21, scope: !1011)
!1014 = !DILocation(line: 80, column: 6, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !921, file: !411, line: 80, column: 6)
!1016 = !DILocation(line: 80, column: 11, scope: !1015)
!1017 = !DILocation(line: 80, column: 6, scope: !921)
!1018 = !DILocation(line: 80, column: 42, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !1015, file: !411, discriminator: 1)
!1020 = !DILocation(line: 80, column: 54, scope: !1019)
!1021 = !DILocation(line: 80, column: 21, scope: !1019)
!1022 = !DILocation(line: 81, column: 6, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !921, file: !411, line: 81, column: 6)
!1024 = !DILocation(line: 81, column: 11, scope: !1023)
!1025 = !DILocation(line: 81, column: 6, scope: !921)
!1026 = !DILocation(line: 81, column: 40, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1023, file: !411, discriminator: 1)
!1028 = !DILocation(line: 81, column: 52, scope: !1027)
!1029 = !DILocation(line: 81, column: 19, scope: !1027)
!1030 = !DILocation(line: 82, column: 6, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !921, file: !411, line: 82, column: 6)
!1032 = !DILocation(line: 82, column: 11, scope: !1031)
!1033 = !DILocation(line: 82, column: 6, scope: !921)
!1034 = !DILocation(line: 82, column: 48, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1031, file: !411, discriminator: 1)
!1036 = !DILocation(line: 82, column: 60, scope: !1035)
!1037 = !DILocation(line: 82, column: 27, scope: !1035)
!1038 = !DILocation(line: 83, column: 6, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !921, file: !411, line: 83, column: 6)
!1040 = !DILocation(line: 83, column: 11, scope: !1039)
!1041 = !DILocation(line: 83, column: 6, scope: !921)
!1042 = !DILocation(line: 83, column: 42, scope: !1043)
!1043 = !DILexicalBlockFile(scope: !1039, file: !411, discriminator: 1)
!1044 = !DILocation(line: 83, column: 54, scope: !1043)
!1045 = !DILocation(line: 83, column: 73, scope: !1043)
!1046 = !DILocation(line: 83, column: 78, scope: !1043)
!1047 = !DILocation(line: 83, column: 22, scope: !1043)
!1048 = !DILocation(line: 85, column: 6, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !921, file: !411, line: 85, column: 6)
!1050 = !DILocation(line: 85, column: 11, scope: !1049)
!1051 = !DILocation(line: 85, column: 20, scope: !1049)
!1052 = !DILocation(line: 85, column: 27, scope: !1049)
!1053 = !DILocation(line: 85, column: 31, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !1049, file: !411, discriminator: 1)
!1055 = !DILocation(line: 85, column: 36, scope: !1054)
!1056 = !DILocation(line: 85, column: 30, scope: !1054)
!1057 = !DILocation(line: 85, column: 45, scope: !1054)
!1058 = !DILocation(line: 85, column: 6, scope: !1054)
!1059 = !DILocation(line: 86, column: 30, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1049, file: !411, line: 85, column: 54)
!1061 = !DILocation(line: 86, column: 42, scope: !1060)
!1062 = !DILocation(line: 86, column: 10, scope: !1060)
!1063 = !DILocation(line: 86, column: 8, scope: !1060)
!1064 = !DILocation(line: 87, column: 24, scope: !1060)
!1065 = !DILocation(line: 87, column: 36, scope: !1060)
!1066 = !DILocation(line: 87, column: 42, scope: !1060)
!1067 = !DILocation(line: 87, column: 47, scope: !1060)
!1068 = !DILocation(line: 87, column: 3, scope: !1060)
!1069 = !DILocation(line: 88, column: 2, scope: !1060)
!1070 = !DILocation(line: 89, column: 1, scope: !921)
!1071 = distinct !DISubprogram(name: "hilight_init_rec", scope: !411, file: !411, line: 121, type: !845, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!1072 = !DILocalVariable(name: "rec", arg: 1, scope: !1071, file: !411, line: 121, type: !374)
!1073 = !DILocation(line: 121, column: 43, scope: !1071)
!1074 = !DILocation(line: 123, column: 6, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !411, line: 123, column: 6)
!1076 = !DILocation(line: 123, column: 11, scope: !1075)
!1077 = !DILocation(line: 123, column: 16, scope: !1075)
!1078 = !DILocation(line: 123, column: 6, scope: !1071)
!1079 = !DILocation(line: 124, column: 17, scope: !1075)
!1080 = !DILocation(line: 124, column: 22, scope: !1075)
!1081 = !DILocation(line: 124, column: 3, scope: !1075)
!1082 = !DILocation(line: 126, column: 26, scope: !1071)
!1083 = !DILocation(line: 126, column: 31, scope: !1071)
!1084 = !DILocation(line: 126, column: 14, scope: !1071)
!1085 = !DILocation(line: 126, column: 2, scope: !1071)
!1086 = !DILocation(line: 126, column: 7, scope: !1071)
!1087 = !DILocation(line: 126, column: 12, scope: !1071)
!1088 = !DILocation(line: 127, column: 1, scope: !1071)
!1089 = distinct !DISubprogram(name: "hilight_remove", scope: !411, file: !411, line: 144, type: !845, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!1090 = !DILocalVariable(name: "rec", arg: 1, scope: !1089, file: !411, line: 144, type: !374)
!1091 = !DILocation(line: 144, column: 34, scope: !1089)
!1092 = !DILocation(line: 146, column: 2, scope: !1089)
!1093 = distinct !{!1093, !1092}
!1094 = !DILocation(line: 146, column: 10, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1096, file: !411, discriminator: 1)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !411, line: 146, column: 10)
!1097 = distinct !DILexicalBlock(scope: !1089, file: !411, line: 146, column: 4)
!1098 = !DILocation(line: 146, column: 14, scope: !1095)
!1099 = !DILocation(line: 146, column: 5, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1101, file: !411, discriminator: 2)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !411, line: 146, column: 3)
!1102 = !DILocation(line: 146, column: 14, scope: !1103)
!1103 = !DILexicalBlockFile(scope: !1104, file: !411, discriminator: 3)
!1104 = distinct !DILexicalBlock(scope: !1096, file: !411, line: 146, column: 12)
!1105 = !DILocation(line: 146, column: 98, scope: !1103)
!1106 = !DILocation(line: 146, column: 109, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1097, file: !411, discriminator: 4)
!1108 = !DILocation(line: 148, column: 24, scope: !1089)
!1109 = !DILocation(line: 148, column: 2, scope: !1089)
!1110 = !DILocation(line: 149, column: 28, scope: !1089)
!1111 = !DILocation(line: 149, column: 38, scope: !1089)
!1112 = !DILocation(line: 149, column: 13, scope: !1089)
!1113 = !DILocation(line: 149, column: 11, scope: !1089)
!1114 = !DILocation(line: 151, column: 38, scope: !1089)
!1115 = !DILocation(line: 151, column: 2, scope: !1089)
!1116 = !DILocation(line: 152, column: 18, scope: !1089)
!1117 = !DILocation(line: 152, column: 2, scope: !1089)
!1118 = !DILocation(line: 153, column: 1, scope: !1089)
!1119 = !DILocation(line: 153, column: 1, scope: !1120)
!1120 = !DILexicalBlockFile(scope: !1089, file: !411, discriminator: 1)
!1121 = distinct !DISubprogram(name: "hilight_destroy", scope: !411, file: !411, line: 101, type: !845, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!1122 = !DILocalVariable(name: "rec", arg: 1, scope: !1121, file: !411, line: 101, type: !374)
!1123 = !DILocation(line: 101, column: 42, scope: !1121)
!1124 = !DILocation(line: 103, column: 2, scope: !1121)
!1125 = distinct !{!1125, !1124}
!1126 = !DILocation(line: 103, column: 10, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1128, file: !411, discriminator: 1)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !411, line: 103, column: 10)
!1129 = distinct !DILexicalBlock(scope: !1121, file: !411, line: 103, column: 4)
!1130 = !DILocation(line: 103, column: 14, scope: !1127)
!1131 = !DILocation(line: 103, column: 5, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !411, discriminator: 2)
!1133 = distinct !DILexicalBlock(scope: !1128, file: !411, line: 103, column: 3)
!1134 = !DILocation(line: 103, column: 14, scope: !1135)
!1135 = !DILexicalBlockFile(scope: !1136, file: !411, discriminator: 3)
!1136 = distinct !DILexicalBlock(scope: !1128, file: !411, line: 103, column: 12)
!1137 = !DILocation(line: 103, column: 98, scope: !1135)
!1138 = !DILocation(line: 103, column: 109, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1129, file: !411, discriminator: 4)
!1140 = !DILocation(line: 105, column: 6, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1121, file: !411, line: 105, column: 6)
!1142 = !DILocation(line: 105, column: 11, scope: !1141)
!1143 = !DILocation(line: 105, column: 16, scope: !1141)
!1144 = !DILocation(line: 105, column: 6, scope: !1121)
!1145 = !DILocation(line: 105, column: 38, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1141, file: !411, discriminator: 1)
!1147 = !DILocation(line: 105, column: 43, scope: !1146)
!1148 = !DILocation(line: 105, column: 24, scope: !1146)
!1149 = !DILocation(line: 106, column: 6, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1121, file: !411, line: 106, column: 6)
!1151 = !DILocation(line: 106, column: 11, scope: !1150)
!1152 = !DILocation(line: 106, column: 20, scope: !1150)
!1153 = !DILocation(line: 106, column: 6, scope: !1121)
!1154 = !DILocation(line: 106, column: 39, scope: !1155)
!1155 = !DILexicalBlockFile(scope: !1150, file: !411, discriminator: 1)
!1156 = !DILocation(line: 106, column: 44, scope: !1155)
!1157 = !DILocation(line: 106, column: 28, scope: !1155)
!1158 = !DILocation(line: 107, column: 9, scope: !1121)
!1159 = !DILocation(line: 107, column: 14, scope: !1121)
!1160 = !DILocation(line: 107, column: 2, scope: !1121)
!1161 = !DILocation(line: 108, column: 9, scope: !1121)
!1162 = !DILocation(line: 108, column: 14, scope: !1121)
!1163 = !DILocation(line: 108, column: 2, scope: !1121)
!1164 = !DILocation(line: 109, column: 9, scope: !1121)
!1165 = !DILocation(line: 109, column: 14, scope: !1121)
!1166 = !DILocation(line: 109, column: 2, scope: !1121)
!1167 = !DILocation(line: 110, column: 9, scope: !1121)
!1168 = !DILocation(line: 110, column: 14, scope: !1121)
!1169 = !DILocation(line: 110, column: 2, scope: !1121)
!1170 = !DILocation(line: 111, column: 9, scope: !1121)
!1171 = !DILocation(line: 111, column: 2, scope: !1121)
!1172 = !DILocation(line: 112, column: 1, scope: !1121)
!1173 = !DILocation(line: 112, column: 1, scope: !1174)
!1174 = !DILexicalBlockFile(scope: !1121, file: !411, discriminator: 1)
!1175 = distinct !DISubprogram(name: "hilight_match", scope: !411, file: !411, line: 239, type: !1176, isLocal: false, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!374, !439, !364, !364, !364, !373, !364, !1178, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!1179 = !DILocalVariable(name: "server", arg: 1, scope: !1175, file: !411, line: 239, type: !439)
!1180 = !DILocation(line: 239, column: 40, scope: !1175)
!1181 = !DILocalVariable(name: "channel", arg: 2, scope: !1175, file: !411, line: 239, type: !364)
!1182 = !DILocation(line: 239, column: 60, scope: !1175)
!1183 = !DILocalVariable(name: "nick", arg: 3, scope: !1175, file: !411, line: 240, type: !364)
!1184 = !DILocation(line: 240, column: 19, scope: !1175)
!1185 = !DILocalVariable(name: "address", arg: 4, scope: !1175, file: !411, line: 240, type: !364)
!1186 = !DILocation(line: 240, column: 37, scope: !1175)
!1187 = !DILocalVariable(name: "level", arg: 5, scope: !1175, file: !411, line: 241, type: !373)
!1188 = !DILocation(line: 241, column: 11, scope: !1175)
!1189 = !DILocalVariable(name: "str", arg: 6, scope: !1175, file: !411, line: 241, type: !364)
!1190 = !DILocation(line: 241, column: 30, scope: !1175)
!1191 = !DILocalVariable(name: "match_beg", arg: 7, scope: !1175, file: !411, line: 242, type: !1178)
!1192 = !DILocation(line: 242, column: 33, scope: !1175)
!1193 = !DILocalVariable(name: "match_end", arg: 8, scope: !1175, file: !411, line: 242, type: !1178)
!1194 = !DILocation(line: 242, column: 49, scope: !1175)
!1195 = !DILocalVariable(name: "tmp", scope: !1175, file: !411, line: 244, type: !603)
!1196 = !DILocation(line: 244, column: 10, scope: !1175)
!1197 = !DILocalVariable(name: "chanrec", scope: !1175, file: !411, line: 245, type: !427)
!1198 = !DILocation(line: 245, column: 22, scope: !1175)
!1199 = !DILocalVariable(name: "nickrec", scope: !1175, file: !411, line: 246, type: !796)
!1200 = !DILocation(line: 246, column: 12, scope: !1175)
!1201 = !DILocation(line: 248, column: 2, scope: !1175)
!1202 = distinct !{!1202, !1201}
!1203 = !DILocation(line: 248, column: 10, scope: !1204)
!1204 = !DILexicalBlockFile(scope: !1205, file: !411, discriminator: 1)
!1205 = distinct !DILexicalBlock(scope: !1206, file: !411, line: 248, column: 10)
!1206 = distinct !DILexicalBlock(scope: !1175, file: !411, line: 248, column: 4)
!1207 = !DILocation(line: 248, column: 14, scope: !1204)
!1208 = !DILocation(line: 248, column: 5, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1210, file: !411, discriminator: 2)
!1210 = distinct !DILexicalBlock(scope: !1205, file: !411, line: 248, column: 3)
!1211 = !DILocation(line: 248, column: 14, scope: !1212)
!1212 = !DILexicalBlockFile(scope: !1213, file: !411, discriminator: 3)
!1213 = distinct !DILexicalBlock(scope: !1205, file: !411, line: 248, column: 12)
!1214 = !DILocation(line: 248, column: 98, scope: !1212)
!1215 = !DILocation(line: 248, column: 7, scope: !1216)
!1216 = !DILexicalBlockFile(scope: !1206, file: !411, discriminator: 4)
!1217 = !DILocation(line: 250, column: 7, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1175, file: !411, line: 250, column: 6)
!1219 = !DILocation(line: 250, column: 29, scope: !1218)
!1220 = !DILocation(line: 250, column: 27, scope: !1218)
!1221 = !DILocation(line: 250, column: 39, scope: !1218)
!1222 = !DILocation(line: 250, column: 36, scope: !1218)
!1223 = !DILocation(line: 250, column: 6, scope: !1175)
!1224 = !DILocation(line: 251, column: 3, scope: !1218)
!1225 = !DILocation(line: 253, column: 6, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1175, file: !411, line: 253, column: 6)
!1227 = !DILocation(line: 253, column: 11, scope: !1226)
!1228 = !DILocation(line: 253, column: 6, scope: !1175)
!1229 = !DILocation(line: 255, column: 26, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1226, file: !411, line: 253, column: 19)
!1231 = !DILocation(line: 255, column: 34, scope: !1230)
!1232 = !DILocation(line: 255, column: 13, scope: !1230)
!1233 = !DILocation(line: 255, column: 11, scope: !1230)
!1234 = !DILocation(line: 256, column: 13, scope: !1230)
!1235 = !DILocation(line: 256, column: 21, scope: !1230)
!1236 = !DILocation(line: 256, column: 13, scope: !1237)
!1237 = !DILexicalBlockFile(scope: !1230, file: !411, discriminator: 1)
!1238 = !DILocation(line: 257, column: 18, scope: !1230)
!1239 = !DILocation(line: 257, column: 27, scope: !1230)
!1240 = !DILocation(line: 257, column: 4, scope: !1230)
!1241 = !DILocation(line: 256, column: 13, scope: !1242)
!1242 = !DILexicalBlockFile(scope: !1230, file: !411, discriminator: 2)
!1243 = !DILocation(line: 256, column: 13, scope: !1244)
!1244 = !DILexicalBlockFile(scope: !1230, file: !411, discriminator: 3)
!1245 = !DILocation(line: 256, column: 11, scope: !1244)
!1246 = !DILocation(line: 258, column: 7, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1230, file: !411, line: 258, column: 7)
!1248 = !DILocation(line: 258, column: 15, scope: !1247)
!1249 = !DILocation(line: 258, column: 7, scope: !1230)
!1250 = !DILocalVariable(name: "rec", scope: !1251, file: !411, line: 259, type: !374)
!1251 = distinct !DILexicalBlock(scope: !1247, file: !411, line: 258, column: 23)
!1252 = !DILocation(line: 259, column: 38, scope: !1251)
!1253 = !DILocation(line: 261, column: 8, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1251, file: !411, line: 261, column: 8)
!1255 = !DILocation(line: 261, column: 17, scope: !1254)
!1256 = !DILocation(line: 261, column: 22, scope: !1254)
!1257 = !DILocation(line: 261, column: 8, scope: !1251)
!1258 = !DILocation(line: 262, column: 23, scope: !1254)
!1259 = !DILocation(line: 262, column: 32, scope: !1254)
!1260 = !DILocation(line: 262, column: 41, scope: !1254)
!1261 = !DILocation(line: 262, column: 5, scope: !1254)
!1262 = !DILocation(line: 264, column: 31, scope: !1251)
!1263 = !DILocation(line: 264, column: 43, scope: !1251)
!1264 = !DILocation(line: 264, column: 50, scope: !1251)
!1265 = !DILocation(line: 264, column: 10, scope: !1251)
!1266 = !DILocation(line: 264, column: 8, scope: !1251)
!1267 = !DILocation(line: 265, column: 8, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1251, file: !411, line: 265, column: 8)
!1269 = !DILocation(line: 265, column: 12, scope: !1268)
!1270 = !DILocation(line: 265, column: 19, scope: !1268)
!1271 = !DILocation(line: 265, column: 23, scope: !1272)
!1272 = !DILexicalBlockFile(scope: !1268, file: !411, discriminator: 1)
!1273 = !DILocation(line: 265, column: 34, scope: !1272)
!1274 = !DILocation(line: 265, column: 40, scope: !1272)
!1275 = !DILocation(line: 265, column: 46, scope: !1272)
!1276 = !DILocation(line: 265, column: 33, scope: !1272)
!1277 = !DILocation(line: 265, column: 53, scope: !1278)
!1278 = !DILexicalBlockFile(scope: !1268, file: !411, discriminator: 2)
!1279 = !DILocation(line: 265, column: 58, scope: !1278)
!1280 = !DILocation(line: 265, column: 33, scope: !1278)
!1281 = !DILocation(line: 265, column: 66, scope: !1282)
!1282 = !DILexicalBlockFile(scope: !1268, file: !411, discriminator: 3)
!1283 = !DILocation(line: 265, column: 33, scope: !1282)
!1284 = !DILocation(line: 265, column: 33, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1268, file: !411, discriminator: 4)
!1286 = !DILocation(line: 265, column: 29, scope: !1285)
!1287 = !DILocation(line: 265, column: 8, scope: !1285)
!1288 = !DILocation(line: 266, column: 12, scope: !1268)
!1289 = !DILocation(line: 266, column: 5, scope: !1268)
!1290 = !DILocation(line: 267, column: 3, scope: !1251)
!1291 = !DILocation(line: 268, column: 2, scope: !1230)
!1292 = !DILocation(line: 270, column: 13, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1175, file: !411, line: 270, column: 2)
!1294 = !DILocation(line: 270, column: 11, scope: !1293)
!1295 = !DILocation(line: 270, column: 7, scope: !1293)
!1296 = !DILocation(line: 270, column: 23, scope: !1297)
!1297 = !DILexicalBlockFile(scope: !1298, file: !411, discriminator: 1)
!1298 = distinct !DILexicalBlock(scope: !1293, file: !411, line: 270, column: 2)
!1299 = !DILocation(line: 270, column: 27, scope: !1297)
!1300 = !DILocation(line: 270, column: 2, scope: !1297)
!1301 = !DILocalVariable(name: "rec", scope: !1302, file: !411, line: 271, type: !374)
!1302 = distinct !DILexicalBlock(scope: !1298, file: !411, line: 270, column: 52)
!1303 = !DILocation(line: 271, column: 16, scope: !1302)
!1304 = !DILocation(line: 271, column: 22, scope: !1302)
!1305 = !DILocation(line: 271, column: 27, scope: !1302)
!1306 = !DILocation(line: 273, column: 8, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1302, file: !411, line: 273, column: 7)
!1308 = !DILocation(line: 273, column: 13, scope: !1307)
!1309 = !DILocation(line: 273, column: 22, scope: !1307)
!1310 = !DILocation(line: 273, column: 26, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1307, file: !411, discriminator: 1)
!1312 = !DILocation(line: 273, column: 37, scope: !1311)
!1313 = !DILocation(line: 273, column: 43, scope: !1311)
!1314 = !DILocation(line: 273, column: 49, scope: !1311)
!1315 = !DILocation(line: 273, column: 36, scope: !1311)
!1316 = !DILocation(line: 273, column: 56, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1307, file: !411, discriminator: 2)
!1318 = !DILocation(line: 273, column: 61, scope: !1317)
!1319 = !DILocation(line: 273, column: 36, scope: !1317)
!1320 = !DILocation(line: 273, column: 69, scope: !1321)
!1321 = !DILexicalBlockFile(scope: !1307, file: !411, discriminator: 3)
!1322 = !DILocation(line: 273, column: 36, scope: !1321)
!1323 = !DILocation(line: 273, column: 36, scope: !1324)
!1324 = !DILexicalBlockFile(scope: !1307, file: !411, discriminator: 4)
!1325 = !DILocation(line: 273, column: 32, scope: !1324)
!1326 = !DILocation(line: 273, column: 94, scope: !1324)
!1327 = !DILocation(line: 274, column: 6, scope: !1307)
!1328 = !DILocation(line: 274, column: 12, scope: !1307)
!1329 = !DILocation(line: 274, column: 21, scope: !1307)
!1330 = !DILocation(line: 274, column: 3, scope: !1307)
!1331 = !DILocation(line: 274, column: 8, scope: !1311)
!1332 = !DILocation(line: 274, column: 17, scope: !1311)
!1333 = !DILocation(line: 274, column: 3, scope: !1311)
!1334 = !DILocation(line: 274, column: 21, scope: !1317)
!1335 = !DILocation(line: 274, column: 27, scope: !1317)
!1336 = !DILocation(line: 274, column: 38, scope: !1317)
!1337 = !DILocation(line: 274, column: 6, scope: !1317)
!1338 = !DILocation(line: 274, column: 48, scope: !1317)
!1339 = !DILocation(line: 274, column: 56, scope: !1317)
!1340 = !DILocation(line: 275, column: 5, scope: !1307)
!1341 = !DILocation(line: 275, column: 10, scope: !1307)
!1342 = !DILocation(line: 275, column: 20, scope: !1307)
!1343 = !DILocation(line: 275, column: 27, scope: !1307)
!1344 = !DILocation(line: 276, column: 6, scope: !1307)
!1345 = !DILocation(line: 276, column: 13, scope: !1307)
!1346 = !DILocation(line: 276, column: 20, scope: !1307)
!1347 = !DILocation(line: 276, column: 42, scope: !1311)
!1348 = !DILocation(line: 276, column: 47, scope: !1311)
!1349 = !DILocation(line: 276, column: 58, scope: !1311)
!1350 = !DILocation(line: 276, column: 66, scope: !1311)
!1351 = !DILocation(line: 276, column: 23, scope: !1311)
!1352 = !DILocation(line: 276, column: 71, scope: !1311)
!1353 = !DILocation(line: 276, column: 78, scope: !1311)
!1354 = !DILocation(line: 277, column: 23, scope: !1307)
!1355 = !DILocation(line: 277, column: 28, scope: !1307)
!1356 = !DILocation(line: 277, column: 33, scope: !1307)
!1357 = !DILocation(line: 277, column: 44, scope: !1307)
!1358 = !DILocation(line: 277, column: 4, scope: !1307)
!1359 = !DILocation(line: 273, column: 7, scope: !1360)
!1360 = !DILexicalBlockFile(scope: !1302, file: !411, discriminator: 5)
!1361 = !DILocation(line: 278, column: 11, scope: !1307)
!1362 = !DILocation(line: 278, column: 4, scope: !1307)
!1363 = !DILocation(line: 279, column: 2, scope: !1302)
!1364 = !DILocation(line: 270, column: 41, scope: !1365)
!1365 = !DILexicalBlockFile(scope: !1298, file: !411, discriminator: 2)
!1366 = !DILocation(line: 270, column: 46, scope: !1365)
!1367 = !DILocation(line: 270, column: 39, scope: !1365)
!1368 = !DILocation(line: 270, column: 2, scope: !1365)
!1369 = distinct !{!1369, !1370}
!1370 = !DILocation(line: 270, column: 2, scope: !1175)
!1371 = !DILocation(line: 281, column: 2, scope: !1175)
!1372 = !DILocation(line: 282, column: 1, scope: !1175)
!1373 = distinct !DISubprogram(name: "hilight_match_text", scope: !411, file: !411, line: 193, type: !1374, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !847)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!562, !374, !364, !1178, !1178}
!1376 = !DILocalVariable(name: "rec", arg: 1, scope: !1373, file: !411, line: 193, type: !374)
!1377 = !DILocation(line: 193, column: 49, scope: !1373)
!1378 = !DILocalVariable(name: "text", arg: 2, scope: !1373, file: !411, line: 193, type: !364)
!1379 = !DILocation(line: 193, column: 66, scope: !1373)
!1380 = !DILocalVariable(name: "match_beg", arg: 3, scope: !1373, file: !411, line: 194, type: !1178)
!1381 = !DILocation(line: 194, column: 12, scope: !1373)
!1382 = !DILocalVariable(name: "match_end", arg: 4, scope: !1373, file: !411, line: 194, type: !1178)
!1383 = !DILocation(line: 194, column: 28, scope: !1373)
!1384 = !DILocalVariable(name: "ret", scope: !1373, file: !411, line: 196, type: !562)
!1385 = !DILocation(line: 196, column: 11, scope: !1373)
!1386 = !DILocation(line: 198, column: 6, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1373, file: !411, line: 198, column: 6)
!1388 = !DILocation(line: 198, column: 11, scope: !1387)
!1389 = !DILocation(line: 198, column: 6, scope: !1373)
!1390 = !DILocation(line: 199, column: 7, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1392, file: !411, line: 199, column: 7)
!1392 = distinct !DILexicalBlock(scope: !1387, file: !411, line: 198, column: 19)
!1393 = !DILocation(line: 199, column: 12, scope: !1391)
!1394 = !DILocation(line: 199, column: 17, scope: !1391)
!1395 = !DILocation(line: 199, column: 7, scope: !1392)
!1396 = !DILocalVariable(name: "match", scope: !1397, file: !411, line: 200, type: !1398)
!1397 = distinct !DILexicalBlock(scope: !1391, file: !411, line: 199, column: 25)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatchInfo", file: !398, line: 10, baseType: !1400)
!1400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MatchInfo", file: !398, line: 10, flags: DIFlagFwdDecl)
!1401 = !DILocation(line: 200, column: 15, scope: !1397)
!1402 = !DILocation(line: 201, column: 18, scope: !1397)
!1403 = !DILocation(line: 201, column: 23, scope: !1397)
!1404 = !DILocation(line: 201, column: 29, scope: !1397)
!1405 = !DILocation(line: 201, column: 4, scope: !1397)
!1406 = !DILocation(line: 203, column: 29, scope: !1407)
!1407 = distinct !DILexicalBlock(scope: !1397, file: !411, line: 203, column: 8)
!1408 = !DILocation(line: 203, column: 8, scope: !1407)
!1409 = !DILocation(line: 203, column: 8, scope: !1397)
!1410 = !DILocation(line: 204, column: 34, scope: !1407)
!1411 = !DILocation(line: 204, column: 44, scope: !1407)
!1412 = !DILocation(line: 204, column: 55, scope: !1407)
!1413 = !DILocation(line: 204, column: 11, scope: !1407)
!1414 = !DILocation(line: 204, column: 9, scope: !1407)
!1415 = !DILocation(line: 204, column: 5, scope: !1407)
!1416 = !DILocation(line: 206, column: 22, scope: !1397)
!1417 = !DILocation(line: 206, column: 4, scope: !1397)
!1418 = !DILocation(line: 207, column: 3, scope: !1397)
!1419 = !DILocation(line: 208, column: 2, scope: !1392)
!1420 = !DILocalVariable(name: "match", scope: !1421, file: !411, line: 209, type: !381)
!1421 = distinct !DILexicalBlock(scope: !1387, file: !411, line: 208, column: 9)
!1422 = !DILocation(line: 209, column: 9, scope: !1421)
!1423 = !DILocation(line: 211, column: 7, scope: !1424)
!1424 = distinct !DILexicalBlock(scope: !1421, file: !411, line: 211, column: 7)
!1425 = !DILocation(line: 211, column: 12, scope: !1424)
!1426 = !DILocation(line: 211, column: 7, scope: !1421)
!1427 = !DILocation(line: 212, column: 12, scope: !1428)
!1428 = distinct !DILexicalBlock(scope: !1424, file: !411, line: 211, column: 28)
!1429 = !DILocation(line: 212, column: 17, scope: !1428)
!1430 = !DILocation(line: 213, column: 17, scope: !1428)
!1431 = !DILocation(line: 213, column: 23, scope: !1428)
!1432 = !DILocation(line: 213, column: 28, scope: !1428)
!1433 = !DILocation(line: 213, column: 5, scope: !1428)
!1434 = !DILocation(line: 212, column: 12, scope: !1435)
!1435 = !DILexicalBlockFile(scope: !1428, file: !411, discriminator: 1)
!1436 = !DILocation(line: 214, column: 12, scope: !1428)
!1437 = !DILocation(line: 214, column: 18, scope: !1428)
!1438 = !DILocation(line: 214, column: 23, scope: !1428)
!1439 = !DILocation(line: 214, column: 5, scope: !1428)
!1440 = !DILocation(line: 212, column: 12, scope: !1441)
!1441 = !DILexicalBlockFile(scope: !1428, file: !411, discriminator: 2)
!1442 = !DILocation(line: 212, column: 12, scope: !1443)
!1443 = !DILexicalBlockFile(scope: !1428, file: !411, discriminator: 3)
!1444 = !DILocation(line: 212, column: 10, scope: !1443)
!1445 = !DILocation(line: 215, column: 3, scope: !1428)
!1446 = !DILocation(line: 216, column: 12, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1424, file: !411, line: 215, column: 10)
!1448 = !DILocation(line: 216, column: 17, scope: !1447)
!1449 = !DILocation(line: 217, column: 18, scope: !1447)
!1450 = !DILocation(line: 217, column: 24, scope: !1447)
!1451 = !DILocation(line: 217, column: 29, scope: !1447)
!1452 = !DILocation(line: 217, column: 5, scope: !1447)
!1453 = !DILocation(line: 216, column: 12, scope: !1454)
!1454 = !DILexicalBlockFile(scope: !1447, file: !411, discriminator: 1)
!1455 = !DILocation(line: 218, column: 13, scope: !1447)
!1456 = !DILocation(line: 218, column: 19, scope: !1447)
!1457 = !DILocation(line: 218, column: 24, scope: !1447)
!1458 = !DILocation(line: 218, column: 5, scope: !1447)
!1459 = !DILocation(line: 216, column: 12, scope: !1460)
!1460 = !DILexicalBlockFile(scope: !1447, file: !411, discriminator: 2)
!1461 = !DILocation(line: 216, column: 12, scope: !1462)
!1462 = !DILexicalBlockFile(scope: !1447, file: !411, discriminator: 3)
!1463 = !DILocation(line: 216, column: 10, scope: !1462)
