; ModuleID = './line276-fe-dcc-chat.o.i'
source_filename = "./line276-fe-dcc-chat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.CHAT_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i8*, %struct._NET_SENDBUF_REC*, i8 }

!73 = !DIEnumerator(name: "IRCTXT_OWN_DCC_ACTION_QUERY", value: 4)
!74 = !DIEnumerator(name: "IRCTXT_OWN_DCC_CTCP", value: 5)
!75 = !DIEnumerator(name: "IRCTXT_DCC_MSG", value: 6)
!76 = !DIEnumerator(name: "IRCTXT_ACTION_DCC", value: 7)
!77 = !DIEnumerator(name: "IRCTXT_ACTION_DCC_QUERY", value: 8)
!78 = !DIEnumerator(name: "IRCTXT_OWN_DCC_QUERY", value: 9)
!79 = !DIEnumerator(name: "IRCTXT_DCC_MSG_QUERY", value: 10)
!80 = !DIEnumerator(name: "IRCTXT_DCC_CTCP", value: 11)
!81 = !DIEnumerator(name: "IRCTXT_DCC_CHAT", value: 12)
!82 = !DIEnumerator(name: "IRCTXT_DCC_CHAT_CHANNEL", value: 13)
!83 = !DIEnumerator(name: "IRCTXT_DCC_CHAT_NOT_FOUND", value: 14)
!84 = !DIEnumerator(name: "IRCTXT_DCC_CHAT_CONNECTED", value: 15)
!85 = !DIEnumerator(name: "IRCTXT_DCC_CHAT_DISCONNECTED", value: 16)
!86 = !DIEnumerator(name: "IRCTXT_DCC_SEND", value: 17)
!87 = !DIEnumerator(name: "IRCTXT_DCC_SEND_CHANNEL", value: 18)
!88 = !DIEnumerator(name: "IRCTXT_DCC_SEND_EXISTS", value: 19)
!89 = !DIEnumerator(name: "IRCTXT_DCC_SEND_NO_ROUTE", value: 20)
!90 = !DIEnumerator(name: "IRCTXT_DCC_SEND_NOT_FOUND", value: 21)
!91 = !DIEnumerator(name: "IRCTXT_DCC_SEND_FILE_OPEN_ERROR", value: 22)
!92 = !DIEnumerator(name: "IRCTXT_DCC_SEND_CONNECTED", value: 23)
!93 = !DIEnumerator(name: "IRCTXT_DCC_SEND_COMPLETE", value: 24)
!94 = !DIEnumerator(name: "IRCTXT_DCC_SEND_ABORTED", value: 25)
!95 = !DIEnumerator(name: "IRCTXT_DCC_GET_NOT_FOUND", value: 26)
!96 = !DIEnumerator(name: "IRCTXT_DCC_GET_CONNECTED", value: 27)
!97 = !DIEnumerator(name: "IRCTXT_DCC_GET_COMPLETE", value: 28)
!98 = !DIEnumerator(name: "IRCTXT_DCC_GET_ABORTED", value: 29)
!99 = !DIEnumerator(name: "IRCTXT_DCC_GET_WRITE_ERROR", value: 30)
!100 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_CTCP", value: 31)
!101 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_REPLY", value: 32)
!102 = !DIEnumerator(name: "IRCTXT_DCC_UNKNOWN_TYPE", value: 33)
!103 = !DIEnumerator(name: "IRCTXT_DCC_INVALID_CTCP", value: 34)
!104 = !DIEnumerator(name: "IRCTXT_DCC_CONNECT_ERROR", value: 35)
!105 = !DIEnumerator(name: "IRCTXT_DCC_CANT_CREATE", value: 36)
!106 = !DIEnumerator(name: "IRCTXT_DCC_REJECTED", value: 37)
!107 = !DIEnumerator(name: "IRCTXT_DCC_REQUEST_SEND", value: 38)
!108 = !DIEnumerator(name: "IRCTXT_DCC_CLOSE", value: 39)
!109 = !DIEnumerator(name: "IRCTXT_DCC_LOWPORT", value: 40)
!110 = !DIEnumerator(name: "IRCTXT_DCC_LIST_HEADER", value: 41)
!111 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_CHAT", value: 42)
!112 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_FILE", value: 43)
!113 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_QUEUED_SEND", value: 44)
!114 = !DIEnumerator(name: "IRCTXT_DCC_LIST_FOOTER", value: 45)
!115 = !DIEnumerator(name: "IRCTXT_DCC_LIST_LINE_SERVER", value: 46)
!116 = !DIEnumerator(name: "IRCTXT_DCC_SERVER_STARTED", value: 47)
!117 = !DIEnumerator(name: "IRCTXT_DCC_SERVER_CLOSED", value: 48)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 25, size: 32, align: 32, elements: !120)
!119 = !DIFile(filename: "../../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!121 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!122 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!123 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!124 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!125 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!126 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!127 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!128 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!129 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!130 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!131 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!132 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!133 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!134 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!135 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!136 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!137 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!138 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!139 = !{!140, !147, !148, !499, !261, !587, !626, !866, !304, !489}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !141, line: 9, baseType: !142)
!141 = !DIFile(filename: "../../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !145, !145, !145, !145, !145, !145}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !150, line: 9, baseType: !151)
!150 = !DIFile(filename: "../../../../src/irc/dcc/dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !152, line: 12, size: 1792, align: 64, elements: !153)
!152 = !DIFile(filename: "../../../../src/irc/dcc/dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!153 = !{!154, !157, !158, !164, !840, !841, !842, !843, !844, !845, !846, !847, !851, !852, !853, !854, !855, !856, !857, !859, !860, !861, !862, !863, !864, !865}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !155, line: 1, baseType: !156, size: 32, align: 32)
!155 = !DIFile(filename: "../../../../src/irc/dcc/dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!156 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !151, file: !155, line: 2, baseType: !156, size: 32, align: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !151, file: !155, line: 3, baseType: !159, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !160, line: 75, baseType: !161)
!160 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !162, line: 139, baseType: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!163 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !151, file: !155, line: 5, baseType: !165, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !167, line: 6, baseType: !168)
!167 = !DIFile(filename: "../../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !169, line: 42, size: 39168, align: 64, elements: !170)
!169 = !DIFile(filename: "../../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!170 = !{!171, !173, !174, !175, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !461, !462, !466, !467, !468, !472, !477, !478, !479, !480, !481, !482, !483, !484, !491, !492, !493, !494, !495, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !837, !839}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !172, line: 3, baseType: !156, size: 32, align: 32)
!172 = !DIFile(filename: "../../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !168, file: !172, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !168, file: !172, line: 6, baseType: !156, size: 32, align: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !168, file: !172, line: 8, baseType: !176, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !167, line: 5, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !169, line: 24, size: 2496, align: 64, elements: !179)
!179 = !{!180, !182, !183, !184, !187, !188, !189, !190, !191, !193, !194, !195, !196, !197, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !178, file: !181, line: 3, baseType: !156, size: 32, align: 32)
!181 = !DIFile(filename: "../../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!182 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !178, file: !181, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !178, file: !181, line: 6, baseType: !156, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !178, file: !181, line: 9, baseType: !185, size: 64, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !178, file: !181, line: 10, baseType: !156, size: 32, align: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !178, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !178, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !178, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !178, file: !181, line: 13, baseType: !192, size: 16, align: 16, offset: 448)
!192 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !178, file: !181, line: 14, baseType: !185, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !178, file: !181, line: 15, baseType: !185, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !178, file: !181, line: 16, baseType: !156, size: 32, align: 32, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !178, file: !181, line: 17, baseType: !185, size: 64, align: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !178, file: !181, line: 19, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !200, line: 99, baseType: !201)
!200 = !DIFile(filename: "../../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !202, line: 22, size: 160, align: 32, elements: !203)
!202 = !DIFile(filename: "../../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !201, file: !202, line: 23, baseType: !192, size: 16, align: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !201, file: !202, line: 24, baseType: !206, size: 128, align: 32, offset: 32)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !207, line: 211, size: 128, align: 32, elements: !208)
!207 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !206, file: !207, line: 220, baseType: !210, size: 128, align: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !206, file: !207, line: 213, size: 128, align: 32, elements: !211)
!211 = !{!212, !219, !224}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !210, file: !207, line: 215, baseType: !213, size: 128, align: 8)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, align: 8, elements: !217)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !215, line: 48, baseType: !216)
!215 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!217 = !{!218}
!218 = !DISubrange(count: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !210, file: !207, line: 217, baseType: !220, size: 128, align: 16)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, align: 16, elements: !222)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !215, line: 49, baseType: !192)
!222 = !{!223}
!223 = !DISubrange(count: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !210, file: !207, line: 218, baseType: !225, size: 128, align: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 128, align: 32, elements: !228)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !215, line: 51, baseType: !227)
!227 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !178, file: !181, line: 19, baseType: !198, size: 64, align: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !178, file: !181, line: 21, baseType: !185, size: 64, align: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !178, file: !181, line: 22, baseType: !185, size: 64, align: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !178, file: !181, line: 23, baseType: !185, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !178, file: !181, line: 24, baseType: !185, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !178, file: !181, line: 26, baseType: !185, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !178, file: !181, line: 27, baseType: !185, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !178, file: !181, line: 28, baseType: !185, size: 64, align: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !178, file: !181, line: 29, baseType: !185, size: 64, align: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !178, file: !181, line: 30, baseType: !185, size: 64, align: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !178, file: !181, line: 31, baseType: !185, size: 64, align: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !178, file: !181, line: 32, baseType: !185, size: 64, align: 64, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !178, file: !181, line: 33, baseType: !185, size: 64, align: 64, offset: 1600)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !178, file: !181, line: 35, baseType: !244, size: 64, align: 64, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !247)
!247 = !{!248, !251, !393, !394, !399, !400, !401, !402, !403, !412, !413, !414, !418, !419, !420, !421, !422, !423, !424, !425}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !246, file: !4, line: 100, baseType: !249, size: 32, align: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !250, line: 49, baseType: !156)
!250 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !246, file: !4, line: 101, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !255)
!255 = !{!256, !279, !285, !291, !295, !380, !384, !389}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !254, file: !4, line: 133, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !244, !261, !263, !266, !267}
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !250, line: 46, baseType: !186)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !264, line: 66, baseType: !265)
!264 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!265 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !270, line: 42, baseType: !271)
!270 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !270, line: 44, size: 128, align: 64, elements: !272)
!272 = !{!273, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !271, file: !270, line: 46, baseType: !274, size: 32, align: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !275, line: 36, baseType: !276)
!275 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !264, line: 45, baseType: !227)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !271, file: !270, line: 47, baseType: !249, size: 32, align: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !271, file: !270, line: 48, baseType: !261, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !254, file: !4, line: 138, baseType: !280, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!260, !244, !283, !263, !266, !267}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !254, file: !4, line: 143, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!260, !244, !289, !290, !267}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !264, line: 51, baseType: !163)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !254, file: !4, line: 147, baseType: !292, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!260, !244, !267}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !254, file: !4, line: 149, baseType: !296, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!299, !244, !379}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !302)
!302 = !{!303, !305, !326, !355, !357, !361, !362, !363, !364, !372, !373, !374, !375}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !301, file: !16, line: 174, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !250, line: 77, baseType: !147)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !301, file: !16, line: 175, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !309)
!309 = !{!310, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !308, file: !16, line: 198, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !304}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !308, file: !16, line: 199, baseType: !311, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !16, line: 200, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !304, !299, !319, !325}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!324, !304}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !250, line: 50, baseType: !249)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !301, file: !16, line: 177, baseType: !327, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !331)
!331 = !{!332, !337, !341, !345, !349, !350}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !330, file: !16, line: 216, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!324, !299, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !330, file: !16, line: 218, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!324, !299}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !330, file: !16, line: 219, baseType: !342, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!324, !299, !320, !304}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !330, file: !16, line: 222, baseType: !346, size: 64, align: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !299}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !330, file: !16, line: 226, baseType: !320, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !330, file: !16, line: 227, baseType: !351, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !301, file: !16, line: 178, baseType: !356, size: 32, align: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !250, line: 55, baseType: !227)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !301, file: !16, line: 180, baseType: !358, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !360)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !301, file: !16, line: 182, baseType: !249, size: 32, align: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !16, line: 183, baseType: !356, size: 32, align: 32, offset: 352)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !301, file: !16, line: 184, baseType: !356, size: 32, align: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !301, file: !16, line: 186, baseType: !365, size: 64, align: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !367, line: 37, baseType: !368)
!367 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !367, line: 39, size: 128, align: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !367, line: 41, baseType: !304, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !367, line: 42, baseType: !365, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !16, line: 188, baseType: !299, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !16, line: 189, baseType: !299, size: 64, align: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !16, line: 191, baseType: !185, size: 64, align: 64, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !301, file: !16, line: 193, baseType: !376, size: 64, align: 64, offset: 704)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !254, file: !4, line: 151, baseType: !381, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !244}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !254, file: !4, line: 152, baseType: !385, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!260, !244, !388, !267}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !254, file: !4, line: 155, baseType: !390, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!388, !244}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !246, file: !4, line: 103, baseType: !261, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !246, file: !4, line: 104, baseType: !395, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !396, line: 77, baseType: !397)
!396 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !396, line: 77, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !246, file: !4, line: 105, baseType: !395, size: 64, align: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !246, file: !4, line: 106, baseType: !261, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !246, file: !4, line: 107, baseType: !356, size: 32, align: 32, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !246, file: !4, line: 109, baseType: !263, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !246, file: !4, line: 110, baseType: !404, size: 64, align: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !406, line: 39, baseType: !407)
!406 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !406, line: 41, size: 192, align: 64, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !407, file: !406, line: 43, baseType: !261, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !407, file: !406, line: 44, baseType: !263, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !407, file: !406, line: 45, baseType: !263, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !246, file: !4, line: 111, baseType: !404, size: 64, align: 64, offset: 576)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !246, file: !4, line: 112, baseType: !404, size: 64, align: 64, offset: 640)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !246, file: !4, line: 113, baseType: !415, size: 48, align: 8, offset: 704)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 48, align: 8, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 6)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !246, file: !4, line: 117, baseType: !356, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !246, file: !4, line: 118, baseType: !356, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !246, file: !4, line: 119, baseType: !356, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !246, file: !4, line: 120, baseType: !356, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !246, file: !4, line: 121, baseType: !356, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !246, file: !4, line: 122, baseType: !356, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !246, file: !4, line: 124, baseType: !304, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !246, file: !4, line: 125, baseType: !304, size: 64, align: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !178, file: !181, line: 38, baseType: !227, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !178, file: !181, line: 39, baseType: !227, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !178, file: !181, line: 40, baseType: !227, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !178, file: !181, line: 41, baseType: !227, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !178, file: !181, line: 42, baseType: !227, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !178, file: !181, line: 43, baseType: !227, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !178, file: !181, line: 44, baseType: !227, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !178, file: !181, line: 45, baseType: !227, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !178, file: !181, line: 46, baseType: !185, size: 64, align: 64, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !178, file: !181, line: 47, baseType: !185, size: 64, align: 64, offset: 1856)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !178, file: !169, line: 27, baseType: !185, size: 64, align: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !178, file: !169, line: 28, baseType: !185, size: 64, align: 64, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !178, file: !169, line: 30, baseType: !156, size: 32, align: 32, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !178, file: !169, line: 31, baseType: !185, size: 64, align: 64, offset: 2112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !178, file: !169, line: 32, baseType: !185, size: 64, align: 64, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !178, file: !169, line: 34, baseType: !156, size: 32, align: 32, offset: 2240)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !178, file: !169, line: 35, baseType: !156, size: 32, align: 32, offset: 2272)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !178, file: !169, line: 36, baseType: !156, size: 32, align: 32, offset: 2304)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !178, file: !169, line: 38, baseType: !156, size: 32, align: 32, offset: 2336)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !178, file: !169, line: 38, baseType: !156, size: 32, align: 32, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !178, file: !169, line: 38, baseType: !156, size: 32, align: 32, offset: 2400)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !178, file: !169, line: 38, baseType: !156, size: 32, align: 32, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !168, file: !172, line: 9, baseType: !159, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !168, file: !172, line: 10, baseType: !159, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !168, file: !172, line: 12, baseType: !185, size: 64, align: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !168, file: !172, line: 13, baseType: !185, size: 64, align: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !168, file: !172, line: 15, baseType: !227, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !168, file: !172, line: 16, baseType: !227, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !168, file: !172, line: 17, baseType: !227, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !168, file: !172, line: 18, baseType: !227, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !168, file: !172, line: 19, baseType: !227, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !168, file: !172, line: 21, baseType: !458, size: 64, align: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !200, line: 102, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !200, line: 102, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !168, file: !172, line: 22, baseType: !156, size: 32, align: 32, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !168, file: !172, line: 25, baseType: !463, size: 128, align: 64, offset: 640)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 128, align: 64, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 2)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !168, file: !172, line: 26, baseType: !156, size: 32, align: 32, offset: 768)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !168, file: !172, line: 27, baseType: !156, size: 32, align: 32, offset: 800)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !168, file: !172, line: 29, baseType: !469, size: 64, align: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !200, line: 103, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !200, line: 103, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !168, file: !172, line: 30, baseType: !473, size: 64, align: 64, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !475, line: 37, baseType: !476)
!475 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !475, line: 37, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !168, file: !172, line: 32, baseType: !185, size: 64, align: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !168, file: !172, line: 33, baseType: !185, size: 64, align: 64, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !168, file: !172, line: 34, baseType: !185, size: 64, align: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !168, file: !172, line: 35, baseType: !227, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !168, file: !172, line: 36, baseType: !227, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !168, file: !172, line: 37, baseType: !227, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !168, file: !172, line: 38, baseType: !227, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !168, file: !172, line: 40, baseType: !485, size: 128, align: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !250, line: 504, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !250, line: 506, size: 128, align: 64, elements: !487)
!487 = !{!488, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !486, file: !250, line: 508, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !250, line: 48, baseType: !163)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !486, file: !250, line: 509, baseType: !489, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !168, file: !172, line: 41, baseType: !159, size: 64, align: 64, offset: 1344)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !168, file: !172, line: 42, baseType: !156, size: 32, align: 32, offset: 1408)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !168, file: !172, line: 44, baseType: !365, size: 64, align: 64, offset: 1472)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !168, file: !172, line: 45, baseType: !365, size: 64, align: 64, offset: 1536)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !168, file: !172, line: 53, baseType: !496, size: 64, align: 64, offset: 1600)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499, !587, !156}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !200, line: 107, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !502, line: 30, size: 2240, align: 64, elements: !503)
!502 = !DIFile(filename: "../../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!503 = !{!504, !505, !506, !507, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !583, !589, !593, !597, !602, !693, !720, !724}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !172, line: 3, baseType: !156, size: 32, align: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !501, file: !172, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !501, file: !172, line: 6, baseType: !156, size: 32, align: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !501, file: !172, line: 8, baseType: !508, size: 64, align: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !200, line: 113, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !502, line: 25, size: 1920, align: 64, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !510, file: !181, line: 3, baseType: !156, size: 32, align: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !510, file: !181, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !510, file: !181, line: 6, baseType: !156, size: 32, align: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !510, file: !181, line: 9, baseType: !185, size: 64, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !510, file: !181, line: 10, baseType: !156, size: 32, align: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !510, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !510, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !510, file: !181, line: 11, baseType: !185, size: 64, align: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !510, file: !181, line: 13, baseType: !192, size: 16, align: 16, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !510, file: !181, line: 14, baseType: !185, size: 64, align: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !510, file: !181, line: 15, baseType: !185, size: 64, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !510, file: !181, line: 16, baseType: !156, size: 32, align: 32, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !510, file: !181, line: 17, baseType: !185, size: 64, align: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !510, file: !181, line: 19, baseType: !198, size: 64, align: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !510, file: !181, line: 19, baseType: !198, size: 64, align: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !510, file: !181, line: 21, baseType: !185, size: 64, align: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !510, file: !181, line: 22, baseType: !185, size: 64, align: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !510, file: !181, line: 23, baseType: !185, size: 64, align: 64, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !510, file: !181, line: 24, baseType: !185, size: 64, align: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !510, file: !181, line: 26, baseType: !185, size: 64, align: 64, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !510, file: !181, line: 27, baseType: !185, size: 64, align: 64, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !510, file: !181, line: 28, baseType: !185, size: 64, align: 64, offset: 1280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !510, file: !181, line: 29, baseType: !185, size: 64, align: 64, offset: 1344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !510, file: !181, line: 30, baseType: !185, size: 64, align: 64, offset: 1408)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !510, file: !181, line: 31, baseType: !185, size: 64, align: 64, offset: 1472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !510, file: !181, line: 32, baseType: !185, size: 64, align: 64, offset: 1536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !510, file: !181, line: 33, baseType: !185, size: 64, align: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !510, file: !181, line: 35, baseType: !244, size: 64, align: 64, offset: 1664)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !510, file: !181, line: 38, baseType: !227, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !510, file: !181, line: 39, baseType: !227, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !510, file: !181, line: 40, baseType: !227, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !510, file: !181, line: 41, baseType: !227, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !510, file: !181, line: 42, baseType: !227, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !510, file: !181, line: 43, baseType: !227, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !510, file: !181, line: 44, baseType: !227, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !510, file: !181, line: 45, baseType: !227, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !510, file: !181, line: 46, baseType: !185, size: 64, align: 64, offset: 1792)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !510, file: !181, line: 47, baseType: !185, size: 64, align: 64, offset: 1856)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !501, file: !172, line: 9, baseType: !159, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !501, file: !172, line: 10, baseType: !159, size: 64, align: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !501, file: !172, line: 12, baseType: !185, size: 64, align: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !501, file: !172, line: 13, baseType: !185, size: 64, align: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !501, file: !172, line: 15, baseType: !227, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !501, file: !172, line: 16, baseType: !227, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !501, file: !172, line: 17, baseType: !227, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !501, file: !172, line: 18, baseType: !227, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !501, file: !172, line: 19, baseType: !227, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !501, file: !172, line: 21, baseType: !458, size: 64, align: 64, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !501, file: !172, line: 22, baseType: !156, size: 32, align: 32, offset: 576)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !501, file: !172, line: 25, baseType: !463, size: 128, align: 64, offset: 640)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !501, file: !172, line: 26, baseType: !156, size: 32, align: 32, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !501, file: !172, line: 27, baseType: !156, size: 32, align: 32, offset: 800)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !501, file: !172, line: 29, baseType: !469, size: 64, align: 64, offset: 832)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !501, file: !172, line: 30, baseType: !473, size: 64, align: 64, offset: 896)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !501, file: !172, line: 32, baseType: !185, size: 64, align: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !501, file: !172, line: 33, baseType: !185, size: 64, align: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !501, file: !172, line: 34, baseType: !185, size: 64, align: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !501, file: !172, line: 35, baseType: !227, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !501, file: !172, line: 36, baseType: !227, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !501, file: !172, line: 37, baseType: !227, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !501, file: !172, line: 38, baseType: !227, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !501, file: !172, line: 40, baseType: !485, size: 128, align: 64, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !501, file: !172, line: 41, baseType: !159, size: 64, align: 64, offset: 1344)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !501, file: !172, line: 42, baseType: !156, size: 32, align: 32, offset: 1408)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !501, file: !172, line: 44, baseType: !365, size: 64, align: 64, offset: 1472)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !501, file: !172, line: 45, baseType: !365, size: 64, align: 64, offset: 1536)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !501, file: !172, line: 53, baseType: !496, size: 64, align: 64, offset: 1600)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !501, file: !172, line: 55, baseType: !580, size: 64, align: 64, offset: 1664)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!156, !499, !186}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !501, file: !172, line: 57, baseType: !584, size: 64, align: 64, offset: 1728)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!156, !499, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !501, file: !172, line: 60, baseType: !590, size: 64, align: 64, offset: 1792)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!587, !499}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !501, file: !172, line: 62, baseType: !594, size: 64, align: 64, offset: 1856)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !499, !587, !587, !156}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !501, file: !172, line: 65, baseType: !598, size: 64, align: 64, offset: 1920)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!601, !499, !587, !587}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !501, file: !172, line: 69, baseType: !603, size: 64, align: 64, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !499, !587}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !200, line: 109, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !609, line: 15, size: 1408, align: 64, elements: !610)
!609 = !DIFile(filename: "../../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!610 = !{!611, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !646, !647, !649, !650, !651, !652, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !612, line: 3, baseType: !156, size: 32, align: 32)
!612 = !DIFile(filename: "../../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !608, file: !612, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !608, file: !612, line: 5, baseType: !473, size: 64, align: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !608, file: !612, line: 7, baseType: !147, size: 64, align: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !608, file: !612, line: 8, baseType: !499, size: 64, align: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !608, file: !612, line: 9, baseType: !185, size: 64, align: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !612, line: 10, baseType: !185, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !608, file: !612, line: 11, baseType: !159, size: 64, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !608, file: !612, line: 12, baseType: !156, size: 32, align: 32, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !608, file: !612, line: 13, baseType: !185, size: 64, align: 64, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !608, file: !612, line: 15, baseType: !623, size: 64, align: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !200, line: 108, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !629, line: 5, size: 704, align: 64, elements: !630)
!629 = !DIFile(filename: "../../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !612, line: 3, baseType: !156, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !628, file: !612, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !628, file: !612, line: 5, baseType: !473, size: 64, align: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !628, file: !612, line: 7, baseType: !147, size: 64, align: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !628, file: !612, line: 8, baseType: !499, size: 64, align: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !628, file: !612, line: 9, baseType: !185, size: 64, align: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !612, line: 10, baseType: !185, size: 64, align: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !628, file: !612, line: 11, baseType: !159, size: 64, align: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !628, file: !612, line: 12, baseType: !156, size: 32, align: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !628, file: !612, line: 13, baseType: !185, size: 64, align: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !628, file: !612, line: 15, baseType: !623, size: 64, align: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !628, file: !612, line: 17, baseType: !643, size: 64, align: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!587, !626}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !608, file: !612, line: 17, baseType: !643, size: 64, align: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !608, file: !648, line: 5, baseType: !185, size: 64, align: 64, offset: 704)
!648 = !DIFile(filename: "../../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !608, file: !648, line: 6, baseType: !185, size: 64, align: 64, offset: 768)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !608, file: !648, line: 7, baseType: !159, size: 64, align: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !608, file: !648, line: 9, baseType: !473, size: 64, align: 64, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !608, file: !648, line: 10, baseType: !653, size: 64, align: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !200, line: 111, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !656, line: 13, size: 576, align: 64, elements: !657)
!656 = !DIFile(filename: "../../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!657 = !{!658, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !674, !675}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !659, line: 3, baseType: !156, size: 32, align: 32)
!659 = !DIFile(filename: "../../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!660 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !655, file: !659, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !655, file: !659, line: 6, baseType: !159, size: 64, align: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !655, file: !659, line: 8, baseType: !185, size: 64, align: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !655, file: !659, line: 9, baseType: !185, size: 64, align: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !655, file: !659, line: 10, baseType: !185, size: 64, align: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !655, file: !659, line: 11, baseType: !156, size: 32, align: 32, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !655, file: !659, line: 14, baseType: !227, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !655, file: !659, line: 15, baseType: !227, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !655, file: !659, line: 18, baseType: !227, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !655, file: !659, line: 19, baseType: !227, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !655, file: !659, line: 20, baseType: !227, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !655, file: !659, line: 21, baseType: !227, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !655, file: !659, line: 22, baseType: !673, size: 64, align: 8, offset: 360)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 64, align: 8, elements: !222)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !655, file: !659, line: 26, baseType: !147, size: 64, align: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !659, line: 28, baseType: !653, size: 64, align: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !608, file: !648, line: 12, baseType: !227, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !608, file: !648, line: 13, baseType: !185, size: 64, align: 64, offset: 1088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !608, file: !648, line: 14, baseType: !156, size: 32, align: 32, offset: 1152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !608, file: !648, line: 15, baseType: !185, size: 64, align: 64, offset: 1216)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !608, file: !648, line: 17, baseType: !227, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !608, file: !648, line: 18, baseType: !227, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !608, file: !648, line: 19, baseType: !227, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !608, file: !648, line: 20, baseType: !227, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !608, file: !648, line: 22, baseType: !227, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !608, file: !648, line: 23, baseType: !227, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !608, file: !648, line: 24, baseType: !227, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !608, file: !648, line: 25, baseType: !227, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !608, file: !648, line: 26, baseType: !227, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !608, file: !648, line: 31, baseType: !690, size: 64, align: 64, offset: 1344)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!185, !606}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !501, file: !172, line: 70, baseType: !694, size: 64, align: 64, offset: 2048)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !499, !587}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !200, line: 110, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !700, line: 15, size: 960, align: 64, elements: !701)
!700 = !DIFile(filename: "../../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !716, !717, !718, !719}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !612, line: 3, baseType: !156, size: 32, align: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !699, file: !612, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !699, file: !612, line: 5, baseType: !473, size: 64, align: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !699, file: !612, line: 7, baseType: !147, size: 64, align: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !699, file: !612, line: 8, baseType: !499, size: 64, align: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !699, file: !612, line: 9, baseType: !185, size: 64, align: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !612, line: 10, baseType: !185, size: 64, align: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !699, file: !612, line: 11, baseType: !159, size: 64, align: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !699, file: !612, line: 12, baseType: !156, size: 32, align: 32, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !699, file: !612, line: 13, baseType: !185, size: 64, align: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !699, file: !612, line: 15, baseType: !623, size: 64, align: 64, offset: 576)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !699, file: !612, line: 17, baseType: !643, size: 64, align: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !699, file: !715, line: 5, baseType: !185, size: 64, align: 64, offset: 704)
!715 = !DIFile(filename: "../../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !699, file: !715, line: 6, baseType: !185, size: 64, align: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !699, file: !715, line: 7, baseType: !159, size: 64, align: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !699, file: !715, line: 9, baseType: !227, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !699, file: !715, line: 11, baseType: !227, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !501, file: !172, line: 71, baseType: !721, size: 64, align: 64, offset: 2112)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!156, !587, !587}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !501, file: !172, line: 73, baseType: !721, size: 64, align: 64, offset: 2176)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !168, file: !172, line: 55, baseType: !580, size: 64, align: 64, offset: 1664)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !168, file: !172, line: 57, baseType: !584, size: 64, align: 64, offset: 1728)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !168, file: !172, line: 60, baseType: !590, size: 64, align: 64, offset: 1792)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !168, file: !172, line: 62, baseType: !594, size: 64, align: 64, offset: 1856)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !168, file: !172, line: 65, baseType: !598, size: 64, align: 64, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !168, file: !172, line: 69, baseType: !603, size: 64, align: 64, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !168, file: !172, line: 70, baseType: !694, size: 64, align: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !168, file: !172, line: 71, baseType: !721, size: 64, align: 64, offset: 2112)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !168, file: !172, line: 73, baseType: !721, size: 64, align: 64, offset: 2176)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !168, file: !169, line: 46, baseType: !365, size: 64, align: 64, offset: 2240)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !168, file: !169, line: 47, baseType: !365, size: 64, align: 64, offset: 2304)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !168, file: !169, line: 48, baseType: !737, size: 64, align: 64, offset: 2368)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !167, line: 8, baseType: !739)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !167, line: 8, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !168, file: !169, line: 49, baseType: !365, size: 64, align: 64, offset: 2432)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !168, file: !169, line: 51, baseType: !185, size: 64, align: 64, offset: 2496)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !168, file: !169, line: 53, baseType: !185, size: 64, align: 64, offset: 2560)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !168, file: !169, line: 54, baseType: !185, size: 64, align: 64, offset: 2624)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !168, file: !169, line: 55, baseType: !185, size: 64, align: 64, offset: 2688)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !168, file: !169, line: 56, baseType: !185, size: 64, align: 64, offset: 2752)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !168, file: !169, line: 57, baseType: !156, size: 32, align: 32, offset: 2816)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !168, file: !169, line: 59, baseType: !227, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !168, file: !169, line: 60, baseType: !227, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !168, file: !169, line: 62, baseType: !227, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !168, file: !169, line: 63, baseType: !227, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !168, file: !169, line: 64, baseType: !227, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !168, file: !169, line: 65, baseType: !227, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !168, file: !169, line: 66, baseType: !227, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !168, file: !169, line: 67, baseType: !227, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !168, file: !169, line: 68, baseType: !227, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !168, file: !169, line: 69, baseType: !227, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !168, file: !169, line: 70, baseType: !227, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !168, file: !169, line: 71, baseType: !227, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !168, file: !169, line: 72, baseType: !227, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !168, file: !169, line: 74, baseType: !156, size: 32, align: 32, offset: 2880)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !168, file: !169, line: 75, baseType: !156, size: 32, align: 32, offset: 2912)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !168, file: !169, line: 76, baseType: !156, size: 32, align: 32, offset: 2944)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !168, file: !169, line: 77, baseType: !156, size: 32, align: 32, offset: 2976)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !168, file: !169, line: 79, baseType: !473, size: 64, align: 64, offset: 3008)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !168, file: !169, line: 80, baseType: !365, size: 64, align: 64, offset: 3072)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !168, file: !169, line: 81, baseType: !365, size: 64, align: 64, offset: 3136)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !168, file: !169, line: 83, baseType: !404, size: 64, align: 64, offset: 3200)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !168, file: !169, line: 84, baseType: !356, size: 32, align: 32, offset: 3264)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !168, file: !169, line: 87, baseType: !156, size: 32, align: 32, offset: 3296)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !168, file: !169, line: 91, baseType: !365, size: 64, align: 64, offset: 3328)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !168, file: !169, line: 92, baseType: !485, size: 128, align: 64, offset: 3392)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !168, file: !169, line: 93, baseType: !485, size: 128, align: 64, offset: 3520)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !168, file: !169, line: 95, baseType: !156, size: 32, align: 32, offset: 3648)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !168, file: !169, line: 96, baseType: !156, size: 32, align: 32, offset: 3680)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !168, file: !169, line: 97, baseType: !156, size: 32, align: 32, offset: 3712)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !168, file: !169, line: 100, baseType: !365, size: 64, align: 64, offset: 3776)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !168, file: !169, line: 103, baseType: !365, size: 64, align: 64, offset: 3840)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !168, file: !169, line: 106, baseType: !365, size: 64, align: 64, offset: 3904)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !168, file: !169, line: 108, baseType: !473, size: 64, align: 64, offset: 3968)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !168, file: !169, line: 109, baseType: !365, size: 64, align: 64, offset: 4032)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !168, file: !169, line: 111, baseType: !365, size: 64, align: 64, offset: 4096)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !168, file: !169, line: 114, baseType: !147, size: 64, align: 64, offset: 4160)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !168, file: !169, line: 116, baseType: !473, size: 64, align: 64, offset: 4224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !168, file: !169, line: 117, baseType: !785, size: 32768, align: 64, offset: 4288)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 32768, align: 64, elements: !835)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !787, line: 10, size: 128, align: 64, elements: !788)
!787 = !DIFile(filename: "../../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!788 = !{!789, !834}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !786, file: !787, line: 11, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !787, line: 7, baseType: !792)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !794, !587, !186, !186, !185, !404}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !167, line: 7, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !797, line: 15, size: 1600, align: 64, elements: !798)
!797 = !DIFile(filename: "../../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !796, file: !612, line: 3, baseType: !156, size: 32, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !796, file: !612, line: 4, baseType: !156, size: 32, align: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !796, file: !612, line: 5, baseType: !473, size: 64, align: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !796, file: !612, line: 7, baseType: !147, size: 64, align: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !796, file: !612, line: 8, baseType: !165, size: 64, align: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !796, file: !612, line: 9, baseType: !185, size: 64, align: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !612, line: 10, baseType: !185, size: 64, align: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !796, file: !612, line: 11, baseType: !159, size: 64, align: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !796, file: !612, line: 12, baseType: !156, size: 32, align: 32, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !796, file: !612, line: 13, baseType: !185, size: 64, align: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !796, file: !612, line: 15, baseType: !623, size: 64, align: 64, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !796, file: !612, line: 17, baseType: !643, size: 64, align: 64, offset: 640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !796, file: !648, line: 5, baseType: !185, size: 64, align: 64, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !796, file: !648, line: 6, baseType: !185, size: 64, align: 64, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !796, file: !648, line: 7, baseType: !159, size: 64, align: 64, offset: 832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !796, file: !648, line: 9, baseType: !473, size: 64, align: 64, offset: 896)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !796, file: !648, line: 10, baseType: !653, size: 64, align: 64, offset: 960)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !796, file: !648, line: 12, baseType: !227, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !796, file: !648, line: 13, baseType: !185, size: 64, align: 64, offset: 1088)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !796, file: !648, line: 14, baseType: !156, size: 32, align: 32, offset: 1152)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !796, file: !648, line: 15, baseType: !185, size: 64, align: 64, offset: 1216)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !796, file: !648, line: 17, baseType: !227, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !796, file: !648, line: 18, baseType: !227, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !796, file: !648, line: 19, baseType: !227, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !796, file: !648, line: 20, baseType: !227, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !796, file: !648, line: 22, baseType: !227, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !796, file: !648, line: 23, baseType: !227, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !796, file: !648, line: 24, baseType: !227, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !796, file: !648, line: 25, baseType: !227, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !796, file: !648, line: 26, baseType: !227, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !796, file: !648, line: 31, baseType: !690, size: 64, align: 64, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !796, file: !797, line: 18, baseType: !365, size: 64, align: 64, offset: 1408)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !796, file: !797, line: 20, baseType: !159, size: 64, align: 64, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !796, file: !797, line: 21, baseType: !156, size: 32, align: 32, offset: 1536)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !796, file: !797, line: 22, baseType: !156, size: 32, align: 32, offset: 1568)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !786, file: !787, line: 12, baseType: !186, size: 8, align: 8, offset: 64)
!835 = !{!836}
!836 = !DISubrange(count: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !168, file: !169, line: 118, baseType: !838, size: 2048, align: 8, offset: 37056)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 2048, align: 8, elements: !835)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !168, file: !169, line: 120, baseType: !721, size: 64, align: 64, offset: 39104)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !151, file: !155, line: 6, baseType: !185, size: 64, align: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !151, file: !155, line: 7, baseType: !185, size: 64, align: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !151, file: !155, line: 8, baseType: !185, size: 64, align: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !151, file: !155, line: 10, baseType: !148, size: 64, align: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !151, file: !155, line: 11, baseType: !185, size: 64, align: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !151, file: !155, line: 12, baseType: !185, size: 64, align: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !151, file: !155, line: 14, baseType: !199, size: 160, align: 32, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !151, file: !155, line: 15, baseType: !848, size: 368, align: 8, offset: 736)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 368, align: 8, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 46)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !151, file: !155, line: 16, baseType: !156, size: 32, align: 32, offset: 1120)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !151, file: !155, line: 18, baseType: !244, size: 64, align: 64, offset: 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !151, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1216)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !151, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1248)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !151, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !151, file: !155, line: 20, baseType: !159, size: 64, align: 64, offset: 1344)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !151, file: !155, line: 21, baseType: !858, size: 64, align: 64, offset: 1408)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !200, line: 49, baseType: !265)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !151, file: !155, line: 23, baseType: !156, size: 32, align: 32, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !151, file: !155, line: 25, baseType: !227, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !151, file: !155, line: 27, baseType: !473, size: 64, align: 64, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 15, baseType: !185, size: 64, align: 64, offset: 1600)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !151, file: !152, line: 16, baseType: !458, size: 64, align: 64, offset: 1664)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !151, file: !152, line: 18, baseType: !227, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !151, file: !152, line: 19, baseType: !227, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !150, line: 13, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 11, size: 1600, align: 64, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !155, line: 1, baseType: !156, size: 32, align: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !868, file: !155, line: 2, baseType: !156, size: 32, align: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !868, file: !155, line: 3, baseType: !159, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !868, file: !155, line: 5, baseType: !165, size: 64, align: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !868, file: !155, line: 6, baseType: !185, size: 64, align: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !868, file: !155, line: 7, baseType: !185, size: 64, align: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !868, file: !155, line: 8, baseType: !185, size: 64, align: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !868, file: !155, line: 10, baseType: !148, size: 64, align: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !868, file: !155, line: 11, baseType: !185, size: 64, align: 64, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !868, file: !155, line: 12, baseType: !185, size: 64, align: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !868, file: !155, line: 14, baseType: !199, size: 160, align: 32, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !868, file: !155, line: 15, baseType: !848, size: 368, align: 8, offset: 736)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !868, file: !155, line: 16, baseType: !156, size: 32, align: 32, offset: 1120)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !868, file: !155, line: 18, baseType: !244, size: 64, align: 64, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !868, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !868, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1248)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !868, file: !155, line: 19, baseType: !156, size: 32, align: 32, offset: 1280)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !868, file: !155, line: 20, baseType: !159, size: 64, align: 64, offset: 1344)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !868, file: !155, line: 21, baseType: !858, size: 64, align: 64, offset: 1408)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !868, file: !155, line: 23, baseType: !156, size: 32, align: 32, offset: 1472)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !868, file: !155, line: 25, baseType: !227, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !868, file: !155, line: 27, baseType: !473, size: 64, align: 64, offset: 1536)
!892 = !{i32 2, !"Dwarf Version", i32 4}
!893 = !{i32 2, !"Debug Info Version", i32 3}
!894 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
