; ModuleID = './line266-windows-layout.o.i'
source_filename = "./line266-windows-layout.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!255 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!256 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!257 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!258 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!259 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!260 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!261 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!262 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!263 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!264 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!265 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!266 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!267 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!268 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!269 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!270 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!271 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!272 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!273 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!274 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!275 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 69, size: 32, align: 32, elements: !278)
!277 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!278 = !{!279, !280, !281, !282}
!279 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!280 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!281 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!282 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 77, size: 32, align: 32, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!286 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!287 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 31, size: 32, align: 32, elements: !290)
!289 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!290 = !{!291, !292, !293, !294, !295, !296}
!291 = !DIEnumerator(name: "G_IO_IN", value: 1)
!292 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!293 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!294 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!295 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!296 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 84, size: 32, align: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!300 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!301 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!302 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!303 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!304 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!305 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!306 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!307 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 4, size: 32, align: 32, elements: !310)
!309 = !DIFile(filename: "../../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!310 = !{!311, !312, !313, !314, !315}
!311 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!312 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!313 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!314 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!315 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!316 = !{!317, !323, !324, !331, !413, !640, !686, !667}
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !318, line: 88, baseType: !319)
!318 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322, !322}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !318, line: 77, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !325, line: 9, baseType: !326)
!325 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329, !329, !329, !329, !329, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !333, line: 110, baseType: !334)
!333 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !335, line: 15, size: 960, align: 64, elements: !336)
!335 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!336 = !{!337, !340, !341, !346, !347, !742, !743, !744, !745, !746, !747, !748, !749, !751, !752, !753, !754}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !338, line: 3, baseType: !339, size: 32, align: 32)
!338 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!339 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !334, file: !338, line: 4, baseType: !339, size: 32, align: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !334, file: !338, line: 5, baseType: !342, size: 64, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !344, line: 37, baseType: !345)
!344 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !344, line: 37, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !334, file: !338, line: 7, baseType: !323, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !334, file: !338, line: 8, baseType: !348, size: 64, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !333, line: 107, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !351, line: 30, size: 2240, align: 64, elements: !352)
!351 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !{!353, !355, !356, !357, !589, !594, !595, !596, !597, !598, !599, !600, !601, !602, !606, !607, !611, !612, !613, !617, !618, !619, !620, !621, !622, !623, !624, !625, !632, !633, !634, !635, !636, !642, !646, !650, !654, !658, !663, !733, !737, !741}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !354, line: 3, baseType: !339, size: 32, align: 32)
!354 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !350, file: !354, line: 4, baseType: !339, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !350, file: !354, line: 6, baseType: !339, size: 32, align: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !350, file: !354, line: 8, baseType: !358, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !333, line: 113, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !351, line: 25, size: 1920, align: 64, elements: !361)
!361 = !{!362, !364, !365, !366, !369, !370, !371, !372, !373, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !360, file: !363, line: 3, baseType: !339, size: 32, align: 32)
!363 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !360, file: !363, line: 4, baseType: !339, size: 32, align: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !360, file: !363, line: 6, baseType: !339, size: 32, align: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !360, file: !363, line: 9, baseType: !367, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !360, file: !363, line: 10, baseType: !339, size: 32, align: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !360, file: !363, line: 11, baseType: !367, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !360, file: !363, line: 11, baseType: !367, size: 64, align: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !360, file: !363, line: 11, baseType: !367, size: 64, align: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !360, file: !363, line: 13, baseType: !374, size: 16, align: 16, offset: 448)
!374 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !360, file: !363, line: 14, baseType: !367, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !360, file: !363, line: 15, baseType: !367, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !360, file: !363, line: 16, baseType: !339, size: 32, align: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !360, file: !363, line: 17, baseType: !367, size: 64, align: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !360, file: !363, line: 19, baseType: !380, size: 64, align: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !333, line: 99, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !333, line: 99, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !360, file: !363, line: 19, baseType: !380, size: 64, align: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !360, file: !363, line: 21, baseType: !367, size: 64, align: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !360, file: !363, line: 22, baseType: !367, size: 64, align: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !360, file: !363, line: 23, baseType: !367, size: 64, align: 64, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !360, file: !363, line: 24, baseType: !367, size: 64, align: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !360, file: !363, line: 26, baseType: !367, size: 64, align: 64, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !360, file: !363, line: 27, baseType: !367, size: 64, align: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !360, file: !363, line: 28, baseType: !367, size: 64, align: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !360, file: !363, line: 29, baseType: !367, size: 64, align: 64, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !360, file: !363, line: 30, baseType: !367, size: 64, align: 64, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !360, file: !363, line: 31, baseType: !367, size: 64, align: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !360, file: !363, line: 32, baseType: !367, size: 64, align: 64, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !360, file: !363, line: 33, baseType: !367, size: 64, align: 64, offset: 1600)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !360, file: !363, line: 35, baseType: !397, size: 64, align: 64, offset: 1664)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !277, line: 41, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !277, line: 97, size: 896, align: 64, elements: !400)
!400 = !{!401, !403, !546, !547, !552, !553, !554, !555, !556, !565, !566, !567, !571, !572, !573, !574, !575, !576, !577, !578}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !399, file: !277, line: 100, baseType: !402, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !318, line: 49, baseType: !339)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !399, file: !277, line: 101, baseType: !404, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !277, line: 42, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !277, line: 131, size: 512, align: 64, elements: !407)
!407 = !{!408, !432, !438, !445, !449, !533, !537, !542}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !406, file: !277, line: 133, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !397, !413, !415, !418, !419}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !277, line: 75, baseType: !276)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !318, line: 46, baseType: !368)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !416, line: 66, baseType: !417)
!416 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!417 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !422, line: 42, baseType: !423)
!422 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !422, line: 44, size: 128, align: 64, elements: !424)
!424 = !{!425, !430, !431}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !423, file: !422, line: 46, baseType: !426, size: 32, align: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !427, line: 36, baseType: !428)
!427 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !416, line: 45, baseType: !429)
!429 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !423, file: !422, line: 47, baseType: !402, size: 32, align: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !423, file: !422, line: 48, baseType: !413, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !406, file: !277, line: 138, baseType: !433, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!412, !397, !436, !415, !418, !419}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !406, file: !277, line: 143, baseType: !439, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!412, !397, !442, !444, !419}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !416, line: 51, baseType: !443)
!443 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !277, line: 82, baseType: !283)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !406, file: !277, line: 147, baseType: !446, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!412, !397, !419}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !406, file: !277, line: 149, baseType: !450, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!453, !397, !532}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !289, line: 64, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !289, line: 171, size: 768, align: 64, elements: !456)
!456 = !{!457, !458, !479, !508, !510, !514, !515, !516, !517, !525, !526, !527, !528}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !455, file: !289, line: 174, baseType: !322, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !455, file: !289, line: 175, baseType: !459, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !289, line: 77, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !289, line: 196, size: 192, align: 64, elements: !462)
!462 = !{!463, !467, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !461, file: !289, line: 198, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !322}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !461, file: !289, line: 199, baseType: !464, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !461, file: !289, line: 200, baseType: !469, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !322, !453, !472, !478}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !289, line: 155, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !322}
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !318, line: 50, baseType: !402)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !455, file: !289, line: 177, baseType: !480, size: 64, align: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !289, line: 130, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !289, line: 214, size: 384, align: 64, elements: !484)
!484 = !{!485, !490, !494, !498, !502, !503}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !483, file: !289, line: 216, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!477, !453, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !483, file: !289, line: 218, baseType: !491, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!477, !453}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !483, file: !289, line: 219, baseType: !495, size: 64, align: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{!477, !453, !473, !322}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !483, file: !289, line: 222, baseType: !499, size: 64, align: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !453}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !483, file: !289, line: 226, baseType: !473, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !483, file: !289, line: 227, baseType: !504, size: 64, align: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !289, line: 212, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !455, file: !289, line: 178, baseType: !509, size: 32, align: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !318, line: 55, baseType: !429)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !455, file: !289, line: 180, baseType: !511, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !289, line: 48, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !289, line: 48, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !455, file: !289, line: 182, baseType: !402, size: 32, align: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !289, line: 183, baseType: !509, size: 32, align: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !455, file: !289, line: 184, baseType: !509, size: 32, align: 32, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !455, file: !289, line: 186, baseType: !518, size: 64, align: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !520, line: 37, baseType: !521)
!520 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !520, line: 39, size: 128, align: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !521, file: !520, line: 41, baseType: !322, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !520, line: 42, baseType: !518, size: 64, align: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !455, file: !289, line: 188, baseType: !453, size: 64, align: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !289, line: 189, baseType: !453, size: 64, align: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !289, line: 191, baseType: !367, size: 64, align: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !455, file: !289, line: 193, baseType: !529, size: 64, align: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !289, line: 65, baseType: !531)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !289, line: 65, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !289, line: 39, baseType: !288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !406, file: !277, line: 151, baseType: !534, size: 64, align: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !397}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !406, file: !277, line: 152, baseType: !538, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!412, !397, !541, !419}
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !277, line: 95, baseType: !297)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !406, file: !277, line: 155, baseType: !543, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!541, !397}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !399, file: !277, line: 103, baseType: !413, size: 64, align: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !399, file: !277, line: 104, baseType: !548, size: 64, align: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !549, line: 77, baseType: !550)
!549 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !549, line: 77, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !399, file: !277, line: 105, baseType: !548, size: 64, align: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !399, file: !277, line: 106, baseType: !413, size: 64, align: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !399, file: !277, line: 107, baseType: !509, size: 32, align: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !399, file: !277, line: 109, baseType: !415, size: 64, align: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !399, file: !277, line: 110, baseType: !557, size: 64, align: 64, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !559, line: 39, baseType: !560)
!559 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !559, line: 41, size: 192, align: 64, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !560, file: !559, line: 43, baseType: !413, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !560, file: !559, line: 44, baseType: !415, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !560, file: !559, line: 45, baseType: !415, size: 64, align: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !399, file: !277, line: 111, baseType: !557, size: 64, align: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !399, file: !277, line: 112, baseType: !557, size: 64, align: 64, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !399, file: !277, line: 113, baseType: !568, size: 48, align: 8, offset: 704)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 48, align: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 6)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !399, file: !277, line: 117, baseType: !509, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !399, file: !277, line: 118, baseType: !509, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !399, file: !277, line: 119, baseType: !509, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !399, file: !277, line: 120, baseType: !509, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !399, file: !277, line: 121, baseType: !509, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !399, file: !277, line: 122, baseType: !509, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !399, file: !277, line: 124, baseType: !322, size: 64, align: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !399, file: !277, line: 125, baseType: !322, size: 64, align: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !360, file: !363, line: 38, baseType: !429, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !360, file: !363, line: 39, baseType: !429, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !360, file: !363, line: 40, baseType: !429, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !360, file: !363, line: 41, baseType: !429, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !360, file: !363, line: 42, baseType: !429, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !360, file: !363, line: 43, baseType: !429, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !360, file: !363, line: 44, baseType: !429, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !360, file: !363, line: 45, baseType: !429, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !360, file: !363, line: 46, baseType: !367, size: 64, align: 64, offset: 1792)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !360, file: !363, line: 47, baseType: !367, size: 64, align: 64, offset: 1856)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !350, file: !354, line: 9, baseType: !590, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !591, line: 75, baseType: !592)
!591 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !593, line: 139, baseType: !443)
!593 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!594 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !350, file: !354, line: 10, baseType: !590, size: 64, align: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !350, file: !354, line: 12, baseType: !367, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !350, file: !354, line: 13, baseType: !367, size: 64, align: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !350, file: !354, line: 15, baseType: !429, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !350, file: !354, line: 16, baseType: !429, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !350, file: !354, line: 17, baseType: !429, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !350, file: !354, line: 18, baseType: !429, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !350, file: !354, line: 19, baseType: !429, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !350, file: !354, line: 21, baseType: !603, size: 64, align: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !333, line: 102, baseType: !605)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !333, line: 102, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !350, file: !354, line: 22, baseType: !339, size: 32, align: 32, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !350, file: !354, line: 25, baseType: !608, size: 128, align: 64, offset: 640)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 128, align: 64, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 2)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !350, file: !354, line: 26, baseType: !339, size: 32, align: 32, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !350, file: !354, line: 27, baseType: !339, size: 32, align: 32, offset: 800)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !350, file: !354, line: 29, baseType: !614, size: 64, align: 64, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !333, line: 103, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !333, line: 103, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !350, file: !354, line: 30, baseType: !342, size: 64, align: 64, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !350, file: !354, line: 32, baseType: !367, size: 64, align: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !350, file: !354, line: 33, baseType: !367, size: 64, align: 64, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !350, file: !354, line: 34, baseType: !367, size: 64, align: 64, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !350, file: !354, line: 35, baseType: !429, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !350, file: !354, line: 36, baseType: !429, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !350, file: !354, line: 37, baseType: !429, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !350, file: !354, line: 38, baseType: !429, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !350, file: !354, line: 40, baseType: !626, size: 128, align: 64, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !318, line: 504, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !318, line: 506, size: 128, align: 64, elements: !628)
!628 = !{!629, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !627, file: !318, line: 508, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !318, line: 48, baseType: !443)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !627, file: !318, line: 509, baseType: !630, size: 64, align: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !350, file: !354, line: 41, baseType: !590, size: 64, align: 64, offset: 1344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !350, file: !354, line: 42, baseType: !339, size: 32, align: 32, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !350, file: !354, line: 44, baseType: !518, size: 64, align: 64, offset: 1472)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !350, file: !354, line: 45, baseType: !518, size: 64, align: 64, offset: 1536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !350, file: !354, line: 53, baseType: !637, size: 64, align: 64, offset: 1600)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !348, !640, !339}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !350, file: !354, line: 55, baseType: !643, size: 64, align: 64, offset: 1664)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!339, !348, !368}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !350, file: !354, line: 57, baseType: !647, size: 64, align: 64, offset: 1728)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!339, !348, !640}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !350, file: !354, line: 60, baseType: !651, size: 64, align: 64, offset: 1792)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!640, !348}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !350, file: !354, line: 62, baseType: !655, size: 64, align: 64, offset: 1856)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !348, !640, !640, !339}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !350, file: !354, line: 65, baseType: !659, size: 64, align: 64, offset: 1920)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!662, !348, !640, !640}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !350, file: !354, line: 69, baseType: !664, size: 64, align: 64, offset: 1984)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !348, !640}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !333, line: 109, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !670, line: 15, size: 1408, align: 64, elements: !671)
!670 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !706, !707, !709, !710, !711, !712, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !338, line: 3, baseType: !339, size: 32, align: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !669, file: !338, line: 4, baseType: !339, size: 32, align: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !669, file: !338, line: 5, baseType: !342, size: 64, align: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !669, file: !338, line: 7, baseType: !323, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !669, file: !338, line: 8, baseType: !348, size: 64, align: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !669, file: !338, line: 9, baseType: !367, size: 64, align: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !338, line: 10, baseType: !367, size: 64, align: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !669, file: !338, line: 11, baseType: !590, size: 64, align: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !669, file: !338, line: 12, baseType: !339, size: 32, align: 32, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !669, file: !338, line: 13, baseType: !367, size: 64, align: 64, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !669, file: !338, line: 15, baseType: !683, size: 64, align: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !333, line: 108, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !689, line: 5, size: 704, align: 64, elements: !690)
!689 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !338, line: 3, baseType: !339, size: 32, align: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !688, file: !338, line: 4, baseType: !339, size: 32, align: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !688, file: !338, line: 5, baseType: !342, size: 64, align: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !688, file: !338, line: 7, baseType: !323, size: 64, align: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !688, file: !338, line: 8, baseType: !348, size: 64, align: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !688, file: !338, line: 9, baseType: !367, size: 64, align: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !688, file: !338, line: 10, baseType: !367, size: 64, align: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !688, file: !338, line: 11, baseType: !590, size: 64, align: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !688, file: !338, line: 12, baseType: !339, size: 32, align: 32, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !688, file: !338, line: 13, baseType: !367, size: 64, align: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !688, file: !338, line: 15, baseType: !683, size: 64, align: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !688, file: !338, line: 17, baseType: !703, size: 64, align: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!640, !686}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !669, file: !338, line: 17, baseType: !703, size: 64, align: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !669, file: !708, line: 5, baseType: !367, size: 64, align: 64, offset: 704)
!708 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !669, file: !708, line: 6, baseType: !367, size: 64, align: 64, offset: 768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !669, file: !708, line: 7, baseType: !590, size: 64, align: 64, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !669, file: !708, line: 9, baseType: !342, size: 64, align: 64, offset: 896)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !669, file: !708, line: 10, baseType: !713, size: 64, align: 64, offset: 960)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !333, line: 111, baseType: !715)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !333, line: 111, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !669, file: !708, line: 12, baseType: !429, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !669, file: !708, line: 13, baseType: !367, size: 64, align: 64, offset: 1088)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !669, file: !708, line: 14, baseType: !339, size: 32, align: 32, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !669, file: !708, line: 15, baseType: !367, size: 64, align: 64, offset: 1216)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !669, file: !708, line: 17, baseType: !429, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !669, file: !708, line: 18, baseType: !429, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !669, file: !708, line: 19, baseType: !429, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !669, file: !708, line: 20, baseType: !429, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !669, file: !708, line: 22, baseType: !429, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !669, file: !708, line: 23, baseType: !429, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !669, file: !708, line: 24, baseType: !429, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !669, file: !708, line: 25, baseType: !429, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !669, file: !708, line: 26, baseType: !429, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !669, file: !708, line: 31, baseType: !730, size: 64, align: 64, offset: 1344)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!367, !667}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !350, file: !354, line: 70, baseType: !734, size: 64, align: 64, offset: 2048)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!331, !348, !640}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !350, file: !354, line: 71, baseType: !738, size: 64, align: 64, offset: 2112)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!339, !640, !640}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !350, file: !354, line: 73, baseType: !738, size: 64, align: 64, offset: 2176)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !334, file: !338, line: 9, baseType: !367, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !338, line: 10, baseType: !367, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !334, file: !338, line: 11, baseType: !590, size: 64, align: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !334, file: !338, line: 12, baseType: !339, size: 32, align: 32, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !334, file: !338, line: 13, baseType: !367, size: 64, align: 64, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !334, file: !338, line: 15, baseType: !683, size: 64, align: 64, offset: 576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !334, file: !338, line: 17, baseType: !703, size: 64, align: 64, offset: 640)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !334, file: !750, line: 5, baseType: !367, size: 64, align: 64, offset: 704)
!750 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!751 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !334, file: !750, line: 6, baseType: !367, size: 64, align: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !334, file: !750, line: 7, baseType: !590, size: 64, align: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !334, file: !750, line: 9, baseType: !429, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !334, file: !750, line: 11, baseType: !429, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!755 = !{!756}
!756 = distinct !DIGlobalVariable(name: "restore_win", scope: !0, file: !757, line: 39, type: !758, isLocal: true, isDefinition: true, variable: %struct._WINDOW_REC** @restore_win)
!757 = !DIFile(filename: "windows-layout.c", directory: "/home/lichi/Desktop/irssi/task1")
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !333, line: 117, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !761, line: 28, size: 1280, align: 64, elements: !762)
!761 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !796, !797, !798, !799, !800, !801, !802, !803}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !760, file: !761, line: 29, baseType: !339, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !761, line: 30, baseType: !367, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !760, file: !761, line: 32, baseType: !339, size: 32, align: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !760, file: !761, line: 32, baseType: !339, size: 32, align: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !760, file: !761, line: 34, baseType: !518, size: 64, align: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !760, file: !761, line: 35, baseType: !686, size: 64, align: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !760, file: !761, line: 36, baseType: !348, size: 64, align: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !760, file: !761, line: 37, baseType: !348, size: 64, align: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !760, file: !761, line: 38, baseType: !367, size: 64, align: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !760, file: !761, line: 40, baseType: !339, size: 32, align: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !760, file: !761, line: 41, baseType: !518, size: 64, align: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !760, file: !761, line: 43, baseType: !429, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !760, file: !761, line: 44, baseType: !429, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !760, file: !761, line: 45, baseType: !429, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !760, file: !761, line: 48, baseType: !778, size: 64, align: 64, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !780, line: 14, baseType: !781)
!780 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !780, line: 6, size: 256, align: 64, elements: !782)
!782 = !{!783, !784, !793, !794, !795}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !780, line: 7, baseType: !367, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !781, file: !780, line: 9, baseType: !785, size: 64, align: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !787, line: 37, baseType: !788)
!787 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !787, line: 39, size: 192, align: 64, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !788, file: !787, line: 41, baseType: !322, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !787, line: 42, baseType: !785, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !788, file: !787, line: 43, baseType: !785, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !781, file: !780, line: 10, baseType: !339, size: 32, align: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !781, file: !780, line: 12, baseType: !339, size: 32, align: 32, offset: 160)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !781, file: !780, line: 13, baseType: !339, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !760, file: !761, line: 49, baseType: !367, size: 64, align: 64, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !760, file: !761, line: 51, baseType: !339, size: 32, align: 32, offset: 832)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !760, file: !761, line: 52, baseType: !367, size: 64, align: 64, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !760, file: !761, line: 54, baseType: !590, size: 64, align: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !760, file: !761, line: 55, baseType: !590, size: 64, align: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !760, file: !761, line: 57, baseType: !367, size: 64, align: 64, offset: 1088)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !760, file: !761, line: 58, baseType: !323, size: 64, align: 64, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !760, file: !761, line: 60, baseType: !323, size: 64, align: 64, offset: 1216)
!804 = !{i32 2, !"Dwarf Version", i32 4}
!805 = !{i32 2, !"Debug Info Version", i32 3}
!806 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!807 = distinct !DISubprogram(name: "windows_layout_restore", scope: !757, file: !757, line: 112, type: !506, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!808 = !{}
!809 = !DILocation(line: 114, column: 2, scope: !807)
!810 = !DILocation(line: 115, column: 1, scope: !807)
!811 = distinct !DISubprogram(name: "windows_layout_save", scope: !757, file: !757, line: 231, type: !506, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!812 = !DILocalVariable(name: "node", scope: !811, file: !757, line: 233, type: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !309, line: 17, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !309, line: 20, size: 192, align: 64, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !815, file: !309, line: 21, baseType: !339, size: 32, align: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !815, file: !309, line: 22, baseType: !367, size: 64, align: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !815, file: !309, line: 23, baseType: !323, size: 64, align: 64, offset: 128)
!820 = !DIExpression()
!821 = !DILocation(line: 233, column: 15, scope: !811)
!822 = !DILocalVariable(name: "sorted", scope: !811, file: !757, line: 234, type: !518)
!823 = !DILocation(line: 234, column: 10, scope: !811)
!824 = !DILocation(line: 236, column: 17, scope: !811)
!825 = !DILocation(line: 236, column: 2, scope: !811)
!826 = !DILocation(line: 237, column: 30, scope: !811)
!827 = !DILocation(line: 237, column: 9, scope: !811)
!828 = !DILocation(line: 237, column: 7, scope: !811)
!829 = !DILocation(line: 239, column: 11, scope: !811)
!830 = !DILocation(line: 239, column: 9, scope: !811)
!831 = !DILocation(line: 240, column: 18, scope: !811)
!832 = !DILocation(line: 240, column: 47, scope: !811)
!833 = !DILocation(line: 240, column: 2, scope: !811)
!834 = !DILocation(line: 241, column: 15, scope: !811)
!835 = !DILocation(line: 241, column: 2, scope: !811)
!836 = !DILocation(line: 242, column: 2, scope: !811)
!837 = !DILocation(line: 244, column: 2, scope: !811)
!838 = !DILocation(line: 246, column: 1, scope: !811)
!839 = distinct !DISubprogram(name: "window_save", scope: !757, file: !757, line: 194, type: !840, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !758, !813}
!842 = !DILocalVariable(name: "window", arg: 1, scope: !839, file: !757, line: 194, type: !758)
!843 = !DILocation(line: 194, column: 37, scope: !839)
!844 = !DILocalVariable(name: "node", arg: 2, scope: !839, file: !757, line: 194, type: !813)
!845 = !DILocation(line: 194, column: 58, scope: !839)
!846 = !DILocalVariable(name: "refnum", scope: !839, file: !757, line: 196, type: !847)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 96, align: 8, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 12)
!850 = !DILocation(line: 196, column: 7, scope: !839)
!851 = !DILocation(line: 198, column: 20, scope: !839)
!852 = !DILocation(line: 198, column: 50, scope: !839)
!853 = !DILocation(line: 198, column: 58, scope: !839)
!854 = !DILocation(line: 198, column: 9, scope: !839)
!855 = !DILocation(line: 199, column: 29, scope: !839)
!856 = !DILocation(line: 199, column: 41, scope: !839)
!857 = !DILocation(line: 199, column: 47, scope: !839)
!858 = !DILocation(line: 199, column: 9, scope: !839)
!859 = !DILocation(line: 199, column: 7, scope: !839)
!860 = !DILocation(line: 201, column: 6, scope: !861)
!861 = distinct !DILexicalBlock(scope: !839, file: !757, line: 201, column: 6)
!862 = !DILocation(line: 201, column: 14, scope: !861)
!863 = !DILocation(line: 201, column: 6, scope: !839)
!864 = !DILocation(line: 202, column: 24, scope: !861)
!865 = !DILocation(line: 202, column: 36, scope: !861)
!866 = !DILocation(line: 202, column: 3, scope: !861)
!867 = !DILocation(line: 204, column: 6, scope: !868)
!868 = distinct !DILexicalBlock(scope: !839, file: !757, line: 204, column: 6)
!869 = !DILocation(line: 204, column: 14, scope: !868)
!870 = !DILocation(line: 204, column: 6, scope: !839)
!871 = !DILocation(line: 205, column: 24, scope: !868)
!872 = !DILocation(line: 205, column: 36, scope: !868)
!873 = !DILocation(line: 205, column: 3, scope: !868)
!874 = !DILocation(line: 207, column: 6, scope: !875)
!875 = distinct !DILexicalBlock(scope: !839, file: !757, line: 207, column: 6)
!876 = !DILocation(line: 207, column: 14, scope: !875)
!877 = !DILocation(line: 207, column: 19, scope: !875)
!878 = !DILocation(line: 207, column: 6, scope: !839)
!879 = !DILocation(line: 208, column: 23, scope: !875)
!880 = !DILocation(line: 208, column: 35, scope: !875)
!881 = !DILocation(line: 208, column: 49, scope: !875)
!882 = !DILocation(line: 208, column: 57, scope: !875)
!883 = !DILocation(line: 208, column: 3, scope: !875)
!884 = !DILocation(line: 210, column: 6, scope: !885)
!885 = distinct !DILexicalBlock(scope: !839, file: !757, line: 210, column: 6)
!886 = !DILocation(line: 210, column: 14, scope: !885)
!887 = !DILocation(line: 210, column: 27, scope: !885)
!888 = !DILocation(line: 210, column: 6, scope: !839)
!889 = !DILocation(line: 211, column: 23, scope: !885)
!890 = !DILocation(line: 211, column: 35, scope: !885)
!891 = !DILocation(line: 211, column: 57, scope: !885)
!892 = !DILocation(line: 211, column: 65, scope: !885)
!893 = !DILocation(line: 211, column: 3, scope: !885)
!894 = !DILocation(line: 213, column: 6, scope: !895)
!895 = distinct !DILexicalBlock(scope: !839, file: !757, line: 213, column: 6)
!896 = !DILocation(line: 213, column: 14, scope: !895)
!897 = !DILocation(line: 213, column: 24, scope: !895)
!898 = !DILocation(line: 213, column: 6, scope: !839)
!899 = !DILocation(line: 214, column: 23, scope: !895)
!900 = !DILocation(line: 214, column: 35, scope: !895)
!901 = !DILocation(line: 214, column: 54, scope: !895)
!902 = !DILocation(line: 214, column: 62, scope: !895)
!903 = !DILocation(line: 214, column: 3, scope: !895)
!904 = !DILocation(line: 215, column: 6, scope: !905)
!905 = distinct !DILexicalBlock(scope: !839, file: !757, line: 215, column: 6)
!906 = !DILocation(line: 215, column: 14, scope: !905)
!907 = !DILocation(line: 215, column: 20, scope: !905)
!908 = !DILocation(line: 215, column: 6, scope: !839)
!909 = !DILocalVariable(name: "level", scope: !910, file: !757, line: 216, type: !367)
!910 = distinct !DILexicalBlock(scope: !905, file: !757, line: 215, column: 26)
!911 = !DILocation(line: 216, column: 23, scope: !910)
!912 = !DILocation(line: 216, column: 42, scope: !910)
!913 = !DILocation(line: 216, column: 50, scope: !910)
!914 = !DILocation(line: 216, column: 31, scope: !910)
!915 = !DILocation(line: 217, column: 23, scope: !910)
!916 = !DILocation(line: 217, column: 35, scope: !910)
!917 = !DILocation(line: 217, column: 50, scope: !910)
!918 = !DILocation(line: 217, column: 3, scope: !910)
!919 = !DILocation(line: 218, column: 10, scope: !910)
!920 = !DILocation(line: 218, column: 3, scope: !910)
!921 = !DILocation(line: 219, column: 2, scope: !910)
!922 = !DILocation(line: 220, column: 6, scope: !923)
!923 = distinct !DILexicalBlock(scope: !839, file: !757, line: 220, column: 6)
!924 = !DILocation(line: 220, column: 14, scope: !923)
!925 = !DILocation(line: 220, column: 25, scope: !923)
!926 = !DILocation(line: 220, column: 6, scope: !839)
!927 = !DILocation(line: 221, column: 23, scope: !923)
!928 = !DILocation(line: 221, column: 35, scope: !923)
!929 = !DILocation(line: 221, column: 50, scope: !923)
!930 = !DILocation(line: 221, column: 58, scope: !923)
!931 = !DILocation(line: 221, column: 3, scope: !923)
!932 = !DILocation(line: 223, column: 2, scope: !839)
!933 = !DILocation(line: 223, column: 9, scope: !934)
!934 = !DILexicalBlockFile(scope: !839, file: !757, discriminator: 1)
!935 = !DILocation(line: 223, column: 17, scope: !934)
!936 = !DILocation(line: 223, column: 29, scope: !934)
!937 = !DILocation(line: 223, column: 2, scope: !934)
!938 = !DILocation(line: 224, column: 23, scope: !839)
!939 = !DILocation(line: 224, column: 31, scope: !839)
!940 = !DILocation(line: 224, column: 39, scope: !839)
!941 = !DILocation(line: 224, column: 52, scope: !839)
!942 = !DILocation(line: 224, column: 3, scope: !839)
!943 = !DILocation(line: 223, column: 2, scope: !944)
!944 = !DILexicalBlockFile(scope: !839, file: !757, discriminator: 2)
!945 = distinct !{!945, !932}
!946 = !DILocation(line: 225, column: 6, scope: !947)
!947 = distinct !DILexicalBlock(scope: !839, file: !757, line: 225, column: 6)
!948 = !DILocation(line: 225, column: 14, scope: !947)
!949 = !DILocation(line: 225, column: 20, scope: !947)
!950 = !DILocation(line: 225, column: 6, scope: !839)
!951 = !DILocation(line: 226, column: 21, scope: !947)
!952 = !DILocation(line: 226, column: 29, scope: !947)
!953 = !DILocation(line: 226, column: 3, scope: !947)
!954 = !DILocation(line: 228, column: 39, scope: !839)
!955 = !DILocation(line: 228, column: 47, scope: !839)
!956 = !DILocation(line: 228, column: 2, scope: !839)
!957 = !DILocation(line: 229, column: 1, scope: !839)
!958 = distinct !DISubprogram(name: "windows_layout_reset", scope: !757, file: !757, line: 248, type: !506, isLocal: false, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!959 = !DILocalVariable(name: "tmp", scope: !958, file: !757, line: 250, type: !518)
!960 = !DILocation(line: 250, column: 10, scope: !958)
!961 = !DILocation(line: 252, column: 13, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !757, line: 252, column: 2)
!963 = !DILocation(line: 252, column: 11, scope: !962)
!964 = !DILocation(line: 252, column: 7, scope: !962)
!965 = !DILocation(line: 252, column: 22, scope: !966)
!966 = !DILexicalBlockFile(scope: !967, file: !757, discriminator: 1)
!967 = distinct !DILexicalBlock(scope: !962, file: !757, line: 252, column: 2)
!968 = !DILocation(line: 252, column: 26, scope: !966)
!969 = !DILocation(line: 252, column: 2, scope: !966)
!970 = !DILocalVariable(name: "window", scope: !971, file: !757, line: 253, type: !758)
!971 = distinct !DILexicalBlock(scope: !967, file: !757, line: 252, column: 51)
!972 = !DILocation(line: 253, column: 15, scope: !971)
!973 = !DILocation(line: 253, column: 24, scope: !971)
!974 = !DILocation(line: 253, column: 29, scope: !971)
!975 = !DILocation(line: 254, column: 3, scope: !971)
!976 = !DILocation(line: 254, column: 10, scope: !977)
!977 = !DILexicalBlockFile(scope: !971, file: !757, discriminator: 1)
!978 = !DILocation(line: 254, column: 18, scope: !977)
!979 = !DILocation(line: 254, column: 30, scope: !977)
!980 = !DILocation(line: 254, column: 3, scope: !977)
!981 = !DILocation(line: 255, column: 24, scope: !971)
!982 = !DILocation(line: 255, column: 32, scope: !971)
!983 = !DILocation(line: 255, column: 40, scope: !971)
!984 = !DILocation(line: 255, column: 53, scope: !971)
!985 = !DILocation(line: 255, column: 4, scope: !971)
!986 = !DILocation(line: 254, column: 3, scope: !987)
!987 = !DILexicalBlockFile(scope: !971, file: !757, discriminator: 2)
!988 = distinct !{!988, !975}
!989 = !DILocation(line: 256, column: 2, scope: !971)
!990 = !DILocation(line: 252, column: 40, scope: !991)
!991 = !DILexicalBlockFile(scope: !967, file: !757, discriminator: 2)
!992 = !DILocation(line: 252, column: 45, scope: !991)
!993 = !DILocation(line: 252, column: 38, scope: !991)
!994 = !DILocation(line: 252, column: 2, scope: !991)
!995 = distinct !{!995, !996}
!996 = !DILocation(line: 252, column: 2, scope: !958)
!997 = !DILocation(line: 258, column: 17, scope: !958)
!998 = !DILocation(line: 258, column: 2, scope: !958)
!999 = !DILocation(line: 259, column: 2, scope: !958)
!1000 = !DILocation(line: 261, column: 2, scope: !958)
!1001 = !DILocation(line: 263, column: 1, scope: !958)
!1002 = distinct !DISubprogram(name: "windows_layout_init", scope: !757, file: !757, line: 265, type: !506, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1003 = !DILocation(line: 267, column: 2, scope: !1002)
!1004 = !DILocation(line: 268, column: 2, scope: !1002)
!1005 = !DILocation(line: 269, column: 2, scope: !1002)
!1006 = !DILocation(line: 270, column: 1, scope: !1002)
!1007 = distinct !DISubprogram(name: "sig_layout_restore_item", scope: !757, file: !757, line: 48, type: !1008, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !758, !640, !813}
!1010 = !DILocalVariable(name: "window", arg: 1, scope: !1007, file: !757, line: 48, type: !758)
!1011 = !DILocation(line: 48, column: 49, scope: !1007)
!1012 = !DILocalVariable(name: "type", arg: 2, scope: !1007, file: !757, line: 48, type: !640)
!1013 = !DILocation(line: 48, column: 69, scope: !1007)
!1014 = !DILocalVariable(name: "node", arg: 3, scope: !1007, file: !757, line: 49, type: !813)
!1015 = !DILocation(line: 49, column: 22, scope: !1007)
!1016 = !DILocalVariable(name: "name", scope: !1007, file: !757, line: 51, type: !367)
!1017 = !DILocation(line: 51, column: 8, scope: !1007)
!1018 = !DILocalVariable(name: "tag", scope: !1007, file: !757, line: 51, type: !367)
!1019 = !DILocation(line: 51, column: 15, scope: !1007)
!1020 = !DILocalVariable(name: "chat_type", scope: !1007, file: !757, line: 51, type: !367)
!1021 = !DILocation(line: 51, column: 21, scope: !1007)
!1022 = !DILocation(line: 53, column: 34, scope: !1007)
!1023 = !DILocation(line: 53, column: 14, scope: !1007)
!1024 = !DILocation(line: 53, column: 12, scope: !1007)
!1025 = !DILocation(line: 54, column: 29, scope: !1007)
!1026 = !DILocation(line: 54, column: 9, scope: !1007)
!1027 = !DILocation(line: 54, column: 7, scope: !1007)
!1028 = !DILocation(line: 55, column: 28, scope: !1007)
!1029 = !DILocation(line: 55, column: 8, scope: !1007)
!1030 = !DILocation(line: 55, column: 6, scope: !1007)
!1031 = !DILocation(line: 57, column: 6, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1007, file: !757, line: 57, column: 6)
!1033 = !DILocation(line: 57, column: 11, scope: !1032)
!1034 = !DILocation(line: 57, column: 18, scope: !1032)
!1035 = !DILocation(line: 57, column: 21, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !1032, file: !757, discriminator: 1)
!1037 = !DILocation(line: 57, column: 25, scope: !1036)
!1038 = !DILocation(line: 57, column: 6, scope: !1036)
!1039 = !DILocation(line: 58, column: 3, scope: !1032)
!1040 = !DILocation(line: 60, column: 25, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1007, file: !757, line: 60, column: 6)
!1042 = !DILocation(line: 60, column: 6, scope: !1041)
!1043 = !DILocation(line: 60, column: 42, scope: !1041)
!1044 = !DILocation(line: 60, column: 6, scope: !1007)
!1045 = !DILocalVariable(name: "rec", scope: !1046, file: !757, line: 62, type: !1047)
!1046 = distinct !DILexicalBlock(scope: !1041, file: !757, line: 60, column: 48)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_BIND_REC", file: !761, line: 26, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !761, line: 22, size: 192, align: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !1049, file: !761, line: 23, baseType: !367, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1049, file: !761, line: 24, baseType: !367, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !1049, file: !761, line: 25, baseType: !429, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!1054 = !DILocation(line: 62, column: 20, scope: !1046)
!1055 = !DILocation(line: 62, column: 42, scope: !1046)
!1056 = !DILocation(line: 62, column: 50, scope: !1046)
!1057 = !DILocation(line: 62, column: 55, scope: !1046)
!1058 = !DILocation(line: 62, column: 26, scope: !1046)
!1059 = !DILocation(line: 63, column: 17, scope: !1046)
!1060 = !DILocation(line: 63, column: 22, scope: !1046)
!1061 = !DILocation(line: 63, column: 29, scope: !1046)
!1062 = !DILocation(line: 64, column: 2, scope: !1046)
!1063 = !DILocation(line: 64, column: 32, scope: !1064)
!1064 = !DILexicalBlockFile(scope: !1065, file: !757, discriminator: 1)
!1065 = distinct !DILexicalBlock(scope: !1041, file: !757, line: 64, column: 13)
!1066 = !DILocation(line: 64, column: 13, scope: !1064)
!1067 = !DILocation(line: 64, column: 47, scope: !1064)
!1068 = !DILocation(line: 64, column: 52, scope: !1064)
!1069 = !DILocation(line: 64, column: 55, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1065, file: !757, discriminator: 2)
!1071 = !DILocation(line: 64, column: 65, scope: !1070)
!1072 = !DILocation(line: 64, column: 13, scope: !1070)
!1073 = !DILocalVariable(name: "protocol", scope: !1074, file: !757, line: 65, type: !1075)
!1074 = distinct !DILexicalBlock(scope: !1065, file: !757, line: 64, column: 73)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_PROTOCOL_REC", file: !333, line: 105, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHAT_PROTOCOL_REC", file: !1078, line: 4, size: 832, align: 64, elements: !1079)
!1078 = !DIFile(filename: "../../../src/core/chat-protocols.h", directory: "/home/lichi/Desktop/irssi/task1")
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1093, !1100, !1107, !1111, !1115, !1119, !1123, !1127}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1077, file: !1078, line: 5, baseType: !339, size: 32, align: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "not_initialized", scope: !1077, file: !1078, line: 7, baseType: !429, size: 1, align: 32, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "case_insensitive", scope: !1077, file: !1078, line: 8, baseType: !429, size: 1, align: 32, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1077, file: !1078, line: 10, baseType: !367, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fullname", scope: !1077, file: !1078, line: 11, baseType: !367, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !1077, file: !1078, line: 12, baseType: !367, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "create_chatnet", scope: !1077, file: !1078, line: 14, baseType: !1087, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHATNET_REC", file: !333, line: 106, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHATNET_REC", file: !333, line: 106, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_setup", scope: !1077, file: !1078, line: 15, baseType: !1094, size: 64, align: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !333, line: 114, baseType: !1099)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !333, line: 114, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "create_channel_setup", scope: !1077, file: !1078, line: 16, baseType: !1101, size: 64, align: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_SETUP_REC", file: !333, line: 115, baseType: !1106)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_SETUP_REC", file: !333, line: 115, flags: DIFlagFwdDecl)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "create_server_connect", scope: !1077, file: !1078, line: 17, baseType: !1108, size: 64, align: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!358}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_server_connect", scope: !1077, file: !1078, line: 18, baseType: !1112, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !358}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "server_init_connect", scope: !1077, file: !1078, line: 20, baseType: !1116, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!348, !358}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "server_connect", scope: !1077, file: !1078, line: 21, baseType: !1120, size: 64, align: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !348}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "channel_create", scope: !1077, file: !1078, line: 22, baseType: !1124, size: 64, align: 64, offset: 704)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!667, !348, !640, !640, !339}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "query_create", scope: !1077, file: !1078, line: 24, baseType: !1128, size: 64, align: 64, offset: 768)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!331, !640, !640, !339}
!1131 = !DILocation(line: 65, column: 22, scope: !1074)
!1132 = !DILocation(line: 67, column: 3, scope: !1074)
!1133 = !DILocation(line: 70, column: 31, scope: !1074)
!1134 = !DILocation(line: 70, column: 29, scope: !1074)
!1135 = !DILocation(line: 72, column: 33, scope: !1074)
!1136 = !DILocation(line: 72, column: 14, scope: !1074)
!1137 = !DILocation(line: 72, column: 12, scope: !1074)
!1138 = !DILocation(line: 73, column: 7, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1074, file: !757, line: 73, column: 7)
!1140 = !DILocation(line: 73, column: 16, scope: !1139)
!1141 = !DILocation(line: 73, column: 7, scope: !1074)
!1142 = !DILocation(line: 74, column: 20, scope: !1139)
!1143 = !DILocation(line: 74, column: 28, scope: !1139)
!1144 = !DILocation(line: 74, column: 33, scope: !1139)
!1145 = !DILocation(line: 74, column: 4, scope: !1139)
!1146 = !DILocation(line: 75, column: 12, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1139, file: !757, line: 75, column: 12)
!1148 = !DILocation(line: 75, column: 22, scope: !1147)
!1149 = !DILocation(line: 75, column: 35, scope: !1147)
!1150 = !DILocation(line: 75, column: 12, scope: !1139)
!1151 = !DILocation(line: 76, column: 4, scope: !1147)
!1152 = !DILocation(line: 76, column: 14, scope: !1147)
!1153 = !DILocation(line: 76, column: 27, scope: !1147)
!1154 = !DILocation(line: 76, column: 32, scope: !1147)
!1155 = !DILocalVariable(name: "query", scope: !1156, file: !757, line: 78, type: !331)
!1156 = distinct !DILexicalBlock(scope: !1147, file: !757, line: 77, column: 8)
!1157 = !DILocation(line: 78, column: 15, scope: !1156)
!1158 = !DILocation(line: 80, column: 27, scope: !1156)
!1159 = !DILocation(line: 80, column: 13, scope: !1156)
!1160 = !DILocation(line: 80, column: 10, scope: !1156)
!1161 = !DILocation(line: 81, column: 44, scope: !1156)
!1162 = !DILocation(line: 81, column: 23, scope: !1156)
!1163 = !DILocation(line: 81, column: 4, scope: !1156)
!1164 = !DILocation(line: 81, column: 11, scope: !1156)
!1165 = !DILocation(line: 81, column: 21, scope: !1156)
!1166 = !DILocation(line: 82, column: 27, scope: !1156)
!1167 = !DILocation(line: 82, column: 18, scope: !1156)
!1168 = !DILocation(line: 82, column: 4, scope: !1156)
!1169 = !DILocation(line: 82, column: 11, scope: !1156)
!1170 = !DILocation(line: 82, column: 16, scope: !1156)
!1171 = !DILocation(line: 83, column: 33, scope: !1156)
!1172 = !DILocation(line: 83, column: 24, scope: !1156)
!1173 = !DILocation(line: 83, column: 4, scope: !1156)
!1174 = !DILocation(line: 83, column: 11, scope: !1156)
!1175 = !DILocation(line: 83, column: 22, scope: !1156)
!1176 = !DILocation(line: 84, column: 15, scope: !1156)
!1177 = !DILocation(line: 84, column: 4, scope: !1156)
!1178 = !DILocation(line: 87, column: 3, scope: !1074)
!1179 = !DILocation(line: 89, column: 2, scope: !1074)
!1180 = !DILocation(line: 90, column: 1, scope: !1007)
!1181 = distinct !DISubprogram(name: "sig_layout_restore", scope: !757, file: !757, line: 117, type: !506, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !808)
!1182 = !DILocalVariable(name: "window", scope: !1181, file: !757, line: 119, type: !758)
!1183 = !DILocation(line: 119, column: 14, scope: !1181)
!1184 = !DILocalVariable(name: "node", scope: !1181, file: !757, line: 120, type: !813)
!1185 = !DILocation(line: 120, column: 15, scope: !1181)
!1186 = !DILocalVariable(name: "tmp", scope: !1181, file: !757, line: 121, type: !518)
!1187 = !DILocation(line: 121, column: 10, scope: !1181)
!1188 = !DILocation(line: 123, column: 30, scope: !1181)
!1189 = !DILocation(line: 123, column: 9, scope: !1181)
