; ModuleID = './line105-bans.o.i'
source_filename = "./line105-bans.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._IRC_SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)*, %struct._GSList*, i64, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !68, globals: !700)
!1 = !DIFile(filename: "line105-bans.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 25, size: 32, align: 32, elements: !49)
!48 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!50 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!51 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!52 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!53 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!54 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!55 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!56 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!57 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!58 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!59 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!60 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!61 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!62 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!63 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!64 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!65 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!66 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!67 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!68 = !{!69, !501, !154, !482, !85, !77, !692, !87, !394, !199, !384, !699, !106}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !73, line: 15, size: 1600, align: 64, elements: !74)
!73 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !{!75, !78, !79, !84, !86, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !76, line: 3, baseType: !77, size: 32, align: 32)
!76 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !72, file: !76, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !72, file: !76, line: 5, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !82, line: 37, baseType: !83)
!82 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !82, line: 37, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !72, file: !76, line: 7, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !72, file: !76, line: 8, baseType: !87, size: 64, align: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !71, line: 6, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !90, line: 42, size: 39168, align: 64, elements: !91)
!90 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !{!92, !94, !95, !96, !343, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !365, !366, !367, !371, !372, !373, !374, !375, !376, !377, !378, !379, !386, !387, !388, !389, !390, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !659, !661}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !93, line: 3, baseType: !77, size: 32, align: 32)
!93 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !89, file: !93, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !89, file: !93, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !89, file: !93, line: 8, baseType: !97, size: 64, align: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !71, line: 5, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !90, line: 24, size: 2496, align: 64, elements: !100)
!100 = !{!101, !103, !104, !105, !108, !109, !110, !111, !112, !114, !115, !116, !117, !118, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !102, line: 3, baseType: !77, size: 32, align: 32)
!102 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !99, file: !102, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !99, file: !102, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !99, file: !102, line: 9, baseType: !106, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !99, file: !102, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !99, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !99, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !99, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !99, file: !102, line: 13, baseType: !113, size: 16, align: 16, offset: 448)
!113 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !99, file: !102, line: 14, baseType: !106, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !99, file: !102, line: 15, baseType: !106, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !99, file: !102, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !99, file: !102, line: 17, baseType: !106, size: 64, align: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !99, file: !102, line: 19, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !121, line: 99, baseType: !122)
!121 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !121, line: 99, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !99, file: !102, line: 19, baseType: !119, size: 64, align: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !99, file: !102, line: 21, baseType: !106, size: 64, align: 64, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !99, file: !102, line: 22, baseType: !106, size: 64, align: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !99, file: !102, line: 23, baseType: !106, size: 64, align: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !99, file: !102, line: 24, baseType: !106, size: 64, align: 64, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !99, file: !102, line: 26, baseType: !106, size: 64, align: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !99, file: !102, line: 27, baseType: !106, size: 64, align: 64, offset: 1216)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !99, file: !102, line: 28, baseType: !106, size: 64, align: 64, offset: 1280)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !99, file: !102, line: 29, baseType: !106, size: 64, align: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !99, file: !102, line: 30, baseType: !106, size: 64, align: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !99, file: !102, line: 31, baseType: !106, size: 64, align: 64, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !99, file: !102, line: 32, baseType: !106, size: 64, align: 64, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !99, file: !102, line: 33, baseType: !106, size: 64, align: 64, offset: 1600)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !99, file: !102, line: 35, baseType: !137, size: 64, align: 64, offset: 1664)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !140)
!140 = !{!141, !144, !288, !289, !294, !295, !296, !297, !298, !307, !308, !309, !313, !314, !315, !316, !317, !318, !319, !320}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !139, file: !4, line: 100, baseType: !142, size: 32, align: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !143, line: 49, baseType: !77)
!143 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !139, file: !4, line: 101, baseType: !145, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !148)
!148 = !{!149, !173, !179, !186, !190, !275, !279, !284}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !147, file: !4, line: 133, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !137, !154, !156, !159, !160}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !143, line: 46, baseType: !107)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !157, line: 66, baseType: !158)
!157 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!158 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !163, line: 42, baseType: !164)
!163 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !163, line: 44, size: 128, align: 64, elements: !165)
!165 = !{!166, !171, !172}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !164, file: !163, line: 46, baseType: !167, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !168, line: 36, baseType: !169)
!168 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !157, line: 45, baseType: !170)
!170 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !164, file: !163, line: 47, baseType: !142, size: 32, align: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !164, file: !163, line: 48, baseType: !154, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !147, file: !4, line: 138, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!153, !137, !177, !156, !159, !160}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !147, file: !4, line: 143, baseType: !180, size: 64, align: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!153, !137, !183, !185, !160}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !157, line: 51, baseType: !184)
!184 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !147, file: !4, line: 147, baseType: !187, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!153, !137, !160}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !147, file: !4, line: 149, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !137, !274}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !197)
!197 = !{!198, !200, !221, !250, !252, !256, !257, !258, !259, !267, !268, !269, !270}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !196, file: !16, line: 174, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !143, line: 77, baseType: !85)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !196, file: !16, line: 175, baseType: !201, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !204)
!204 = !{!205, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !203, file: !16, line: 198, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !199}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !203, file: !16, line: 199, baseType: !206, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !203, file: !16, line: 200, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !199, !194, !214, !220}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !199}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !143, line: 50, baseType: !142)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !196, file: !16, line: 177, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !226)
!226 = !{!227, !232, !236, !240, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !225, file: !16, line: 216, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!219, !194, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !225, file: !16, line: 218, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!219, !194}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !225, file: !16, line: 219, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!219, !194, !215, !199}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !225, file: !16, line: 222, baseType: !241, size: 64, align: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !194}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !225, file: !16, line: 226, baseType: !215, size: 64, align: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !225, file: !16, line: 227, baseType: !246, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !196, file: !16, line: 178, baseType: !251, size: 32, align: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !143, line: 55, baseType: !170)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !196, file: !16, line: 180, baseType: !253, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !196, file: !16, line: 182, baseType: !142, size: 32, align: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !16, line: 183, baseType: !251, size: 32, align: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !196, file: !16, line: 184, baseType: !251, size: 32, align: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !196, file: !16, line: 186, baseType: !260, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !262, line: 37, baseType: !263)
!262 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !262, line: 39, size: 128, align: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !262, line: 41, baseType: !199, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !262, line: 42, baseType: !260, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !196, file: !16, line: 188, baseType: !194, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !16, line: 189, baseType: !194, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !16, line: 191, baseType: !106, size: 64, align: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !196, file: !16, line: 193, baseType: !271, size: 64, align: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !273)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !147, file: !4, line: 151, baseType: !276, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !137}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !147, file: !4, line: 152, baseType: !280, size: 64, align: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!153, !137, !283, !160}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !147, file: !4, line: 155, baseType: !285, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!283, !137}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !139, file: !4, line: 103, baseType: !154, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !139, file: !4, line: 104, baseType: !290, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !291, line: 77, baseType: !292)
!291 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !291, line: 77, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !139, file: !4, line: 105, baseType: !290, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !139, file: !4, line: 106, baseType: !154, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !139, file: !4, line: 107, baseType: !251, size: 32, align: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !139, file: !4, line: 109, baseType: !156, size: 64, align: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !139, file: !4, line: 110, baseType: !299, size: 64, align: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !301, line: 39, baseType: !302)
!301 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !301, line: 41, size: 192, align: 64, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !302, file: !301, line: 43, baseType: !154, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !302, file: !301, line: 44, baseType: !156, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !302, file: !301, line: 45, baseType: !156, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !139, file: !4, line: 111, baseType: !299, size: 64, align: 64, offset: 576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !139, file: !4, line: 112, baseType: !299, size: 64, align: 64, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !139, file: !4, line: 113, baseType: !310, size: 48, align: 8, offset: 704)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 48, align: 8, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 6)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !139, file: !4, line: 117, baseType: !251, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !139, file: !4, line: 118, baseType: !251, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !139, file: !4, line: 119, baseType: !251, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !139, file: !4, line: 120, baseType: !251, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !139, file: !4, line: 121, baseType: !251, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !139, file: !4, line: 122, baseType: !251, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !139, file: !4, line: 124, baseType: !199, size: 64, align: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !139, file: !4, line: 125, baseType: !199, size: 64, align: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !99, file: !102, line: 38, baseType: !170, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !99, file: !102, line: 39, baseType: !170, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !99, file: !102, line: 40, baseType: !170, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !99, file: !102, line: 41, baseType: !170, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !99, file: !102, line: 42, baseType: !170, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !99, file: !102, line: 43, baseType: !170, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !99, file: !102, line: 44, baseType: !170, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !99, file: !102, line: 45, baseType: !170, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !99, file: !102, line: 46, baseType: !106, size: 64, align: 64, offset: 1792)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !99, file: !102, line: 47, baseType: !106, size: 64, align: 64, offset: 1856)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !99, file: !90, line: 27, baseType: !106, size: 64, align: 64, offset: 1920)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !99, file: !90, line: 28, baseType: !106, size: 64, align: 64, offset: 1984)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !99, file: !90, line: 30, baseType: !77, size: 32, align: 32, offset: 2048)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !99, file: !90, line: 31, baseType: !106, size: 64, align: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !99, file: !90, line: 32, baseType: !106, size: 64, align: 64, offset: 2176)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !99, file: !90, line: 34, baseType: !77, size: 32, align: 32, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !99, file: !90, line: 35, baseType: !77, size: 32, align: 32, offset: 2272)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !99, file: !90, line: 36, baseType: !77, size: 32, align: 32, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !99, file: !90, line: 38, baseType: !77, size: 32, align: 32, offset: 2336)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !99, file: !90, line: 38, baseType: !77, size: 32, align: 32, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !99, file: !90, line: 38, baseType: !77, size: 32, align: 32, offset: 2400)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !99, file: !90, line: 38, baseType: !77, size: 32, align: 32, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !89, file: !93, line: 9, baseType: !344, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !345, line: 75, baseType: !346)
!345 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !347, line: 139, baseType: !184)
!347 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !89, file: !93, line: 10, baseType: !344, size: 64, align: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !89, file: !93, line: 12, baseType: !106, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !89, file: !93, line: 13, baseType: !106, size: 64, align: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !89, file: !93, line: 15, baseType: !170, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !89, file: !93, line: 16, baseType: !170, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !89, file: !93, line: 17, baseType: !170, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !89, file: !93, line: 18, baseType: !170, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !89, file: !93, line: 19, baseType: !170, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !89, file: !93, line: 21, baseType: !357, size: 64, align: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !121, line: 102, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !121, line: 102, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !89, file: !93, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !89, file: !93, line: 25, baseType: !362, size: 128, align: 64, offset: 640)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, align: 64, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !89, file: !93, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !89, file: !93, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !89, file: !93, line: 29, baseType: !368, size: 64, align: 64, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !121, line: 103, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !121, line: 103, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !89, file: !93, line: 30, baseType: !80, size: 64, align: 64, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !89, file: !93, line: 32, baseType: !106, size: 64, align: 64, offset: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !89, file: !93, line: 33, baseType: !106, size: 64, align: 64, offset: 1024)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !89, file: !93, line: 34, baseType: !106, size: 64, align: 64, offset: 1088)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !89, file: !93, line: 35, baseType: !170, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !89, file: !93, line: 36, baseType: !170, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !89, file: !93, line: 37, baseType: !170, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !89, file: !93, line: 38, baseType: !170, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !89, file: !93, line: 40, baseType: !380, size: 128, align: 64, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !143, line: 504, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !143, line: 506, size: 128, align: 64, elements: !382)
!382 = !{!383, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !381, file: !143, line: 508, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !143, line: 48, baseType: !184)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !381, file: !143, line: 509, baseType: !384, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !89, file: !93, line: 41, baseType: !344, size: 64, align: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !89, file: !93, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !89, file: !93, line: 44, baseType: !260, size: 64, align: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !89, file: !93, line: 45, baseType: !260, size: 64, align: 64, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !89, file: !93, line: 53, baseType: !391, size: 64, align: 64, offset: 1600)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394, !482, !77}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !121, line: 107, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !397, line: 30, size: 2240, align: 64, elements: !398)
!397 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!398 = !{!399, !400, !401, !402, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !478, !484, !488, !492, !497, !575, !582, !586}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !396, file: !93, line: 3, baseType: !77, size: 32, align: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !396, file: !93, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !396, file: !93, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !396, file: !93, line: 8, baseType: !403, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !121, line: 113, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !397, line: 25, size: 1920, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !102, line: 3, baseType: !77, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !405, file: !102, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !405, file: !102, line: 6, baseType: !77, size: 32, align: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !405, file: !102, line: 9, baseType: !106, size: 64, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !405, file: !102, line: 10, baseType: !77, size: 32, align: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !405, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !405, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !405, file: !102, line: 11, baseType: !106, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !405, file: !102, line: 13, baseType: !113, size: 16, align: 16, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !405, file: !102, line: 14, baseType: !106, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !405, file: !102, line: 15, baseType: !106, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !405, file: !102, line: 16, baseType: !77, size: 32, align: 32, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !405, file: !102, line: 17, baseType: !106, size: 64, align: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !405, file: !102, line: 19, baseType: !119, size: 64, align: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !405, file: !102, line: 19, baseType: !119, size: 64, align: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !405, file: !102, line: 21, baseType: !106, size: 64, align: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !405, file: !102, line: 22, baseType: !106, size: 64, align: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !405, file: !102, line: 23, baseType: !106, size: 64, align: 64, offset: 1024)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !405, file: !102, line: 24, baseType: !106, size: 64, align: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !405, file: !102, line: 26, baseType: !106, size: 64, align: 64, offset: 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !405, file: !102, line: 27, baseType: !106, size: 64, align: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !405, file: !102, line: 28, baseType: !106, size: 64, align: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !405, file: !102, line: 29, baseType: !106, size: 64, align: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !405, file: !102, line: 30, baseType: !106, size: 64, align: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !405, file: !102, line: 31, baseType: !106, size: 64, align: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !405, file: !102, line: 32, baseType: !106, size: 64, align: 64, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !405, file: !102, line: 33, baseType: !106, size: 64, align: 64, offset: 1600)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !405, file: !102, line: 35, baseType: !137, size: 64, align: 64, offset: 1664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !405, file: !102, line: 38, baseType: !170, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !405, file: !102, line: 39, baseType: !170, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !405, file: !102, line: 40, baseType: !170, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !405, file: !102, line: 41, baseType: !170, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !405, file: !102, line: 42, baseType: !170, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !405, file: !102, line: 43, baseType: !170, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !405, file: !102, line: 44, baseType: !170, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !405, file: !102, line: 45, baseType: !170, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !405, file: !102, line: 46, baseType: !106, size: 64, align: 64, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !405, file: !102, line: 47, baseType: !106, size: 64, align: 64, offset: 1856)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !396, file: !93, line: 9, baseType: !344, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !396, file: !93, line: 10, baseType: !344, size: 64, align: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !396, file: !93, line: 12, baseType: !106, size: 64, align: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !396, file: !93, line: 13, baseType: !106, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !396, file: !93, line: 15, baseType: !170, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !396, file: !93, line: 16, baseType: !170, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !396, file: !93, line: 17, baseType: !170, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !396, file: !93, line: 18, baseType: !170, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !396, file: !93, line: 19, baseType: !170, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !396, file: !93, line: 21, baseType: !357, size: 64, align: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !396, file: !93, line: 22, baseType: !77, size: 32, align: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !396, file: !93, line: 25, baseType: !362, size: 128, align: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !396, file: !93, line: 26, baseType: !77, size: 32, align: 32, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !396, file: !93, line: 27, baseType: !77, size: 32, align: 32, offset: 800)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !396, file: !93, line: 29, baseType: !368, size: 64, align: 64, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !396, file: !93, line: 30, baseType: !80, size: 64, align: 64, offset: 896)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !396, file: !93, line: 32, baseType: !106, size: 64, align: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !396, file: !93, line: 33, baseType: !106, size: 64, align: 64, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !396, file: !93, line: 34, baseType: !106, size: 64, align: 64, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !396, file: !93, line: 35, baseType: !170, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !396, file: !93, line: 36, baseType: !170, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !396, file: !93, line: 37, baseType: !170, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !396, file: !93, line: 38, baseType: !170, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !396, file: !93, line: 40, baseType: !380, size: 128, align: 64, offset: 1216)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !396, file: !93, line: 41, baseType: !344, size: 64, align: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !396, file: !93, line: 42, baseType: !77, size: 32, align: 32, offset: 1408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !396, file: !93, line: 44, baseType: !260, size: 64, align: 64, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !396, file: !93, line: 45, baseType: !260, size: 64, align: 64, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !396, file: !93, line: 53, baseType: !391, size: 64, align: 64, offset: 1600)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !396, file: !93, line: 55, baseType: !475, size: 64, align: 64, offset: 1664)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!77, !394, !107}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !396, file: !93, line: 57, baseType: !479, size: 64, align: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!77, !394, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !396, file: !93, line: 60, baseType: !485, size: 64, align: 64, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!482, !394}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !396, file: !93, line: 62, baseType: !489, size: 64, align: 64, offset: 1856)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !394, !482, !482, !77}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !396, file: !93, line: 65, baseType: !493, size: 64, align: 64, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !394, !482, !482}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !396, file: !93, line: 69, baseType: !498, size: 64, align: 64, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !394, !482}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !121, line: 109, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !504, line: 15, size: 1408, align: 64, elements: !505)
!504 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !523, !527, !529, !530, !531, !532, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !76, line: 3, baseType: !77, size: 32, align: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !503, file: !76, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !503, file: !76, line: 5, baseType: !80, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !503, file: !76, line: 7, baseType: !85, size: 64, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !503, file: !76, line: 8, baseType: !394, size: 64, align: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !503, file: !76, line: 9, baseType: !106, size: 64, align: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !503, file: !76, line: 10, baseType: !106, size: 64, align: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !503, file: !76, line: 11, baseType: !344, size: 64, align: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !503, file: !76, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !503, file: !76, line: 13, baseType: !106, size: 64, align: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !503, file: !76, line: 15, baseType: !517, size: 64, align: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !121, line: 108, baseType: !522)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !121, line: 108, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !503, file: !76, line: 17, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!482, !520}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !503, file: !528, line: 5, baseType: !106, size: 64, align: 64, offset: 704)
!528 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!529 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !503, file: !528, line: 6, baseType: !106, size: 64, align: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !503, file: !528, line: 7, baseType: !344, size: 64, align: 64, offset: 832)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !503, file: !528, line: 9, baseType: !80, size: 64, align: 64, offset: 896)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !503, file: !528, line: 10, baseType: !533, size: 64, align: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !121, line: 111, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !536, line: 13, size: 576, align: 64, elements: !537)
!536 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!537 = !{!538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !556, !557}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !539, line: 3, baseType: !77, size: 32, align: 32)
!539 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!540 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !535, file: !539, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !535, file: !539, line: 6, baseType: !344, size: 64, align: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !535, file: !539, line: 8, baseType: !106, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !535, file: !539, line: 9, baseType: !106, size: 64, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !535, file: !539, line: 10, baseType: !106, size: 64, align: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !535, file: !539, line: 11, baseType: !77, size: 32, align: 32, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !535, file: !539, line: 14, baseType: !170, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !535, file: !539, line: 15, baseType: !170, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !535, file: !539, line: 18, baseType: !170, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !535, file: !539, line: 19, baseType: !170, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !535, file: !539, line: 20, baseType: !170, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !535, file: !539, line: 21, baseType: !170, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !535, file: !539, line: 22, baseType: !553, size: 64, align: 8, offset: 360)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 64, align: 8, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !535, file: !539, line: 26, baseType: !85, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !539, line: 28, baseType: !533, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !503, file: !528, line: 12, baseType: !170, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !503, file: !528, line: 13, baseType: !106, size: 64, align: 64, offset: 1088)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !503, file: !528, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !503, file: !528, line: 15, baseType: !106, size: 64, align: 64, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !503, file: !528, line: 17, baseType: !170, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !503, file: !528, line: 18, baseType: !170, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !503, file: !528, line: 19, baseType: !170, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !503, file: !528, line: 20, baseType: !170, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !503, file: !528, line: 22, baseType: !170, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !503, file: !528, line: 23, baseType: !170, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !503, file: !528, line: 24, baseType: !170, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !503, file: !528, line: 25, baseType: !170, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !503, file: !528, line: 26, baseType: !170, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !503, file: !528, line: 31, baseType: !572, size: 64, align: 64, offset: 1344)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!106, !501}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !396, file: !93, line: 70, baseType: !576, size: 64, align: 64, offset: 2048)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !394, !482}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !121, line: 110, baseType: !581)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !121, line: 110, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !396, file: !93, line: 71, baseType: !583, size: 64, align: 64, offset: 2112)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!77, !482, !482}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !396, file: !93, line: 73, baseType: !583, size: 64, align: 64, offset: 2176)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !89, file: !93, line: 55, baseType: !475, size: 64, align: 64, offset: 1664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !89, file: !93, line: 57, baseType: !479, size: 64, align: 64, offset: 1728)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !89, file: !93, line: 60, baseType: !485, size: 64, align: 64, offset: 1792)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !89, file: !93, line: 62, baseType: !489, size: 64, align: 64, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !89, file: !93, line: 65, baseType: !493, size: 64, align: 64, offset: 1920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !89, file: !93, line: 69, baseType: !498, size: 64, align: 64, offset: 1984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !89, file: !93, line: 70, baseType: !576, size: 64, align: 64, offset: 2048)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !89, file: !93, line: 71, baseType: !583, size: 64, align: 64, offset: 2112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !89, file: !93, line: 73, baseType: !583, size: 64, align: 64, offset: 2176)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !89, file: !90, line: 46, baseType: !260, size: 64, align: 64, offset: 2240)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !89, file: !90, line: 47, baseType: !260, size: 64, align: 64, offset: 2304)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !89, file: !90, line: 48, baseType: !599, size: 64, align: 64, offset: 2368)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !71, line: 8, baseType: !601)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !71, line: 8, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !89, file: !90, line: 49, baseType: !260, size: 64, align: 64, offset: 2432)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !89, file: !90, line: 51, baseType: !106, size: 64, align: 64, offset: 2496)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !89, file: !90, line: 53, baseType: !106, size: 64, align: 64, offset: 2560)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !89, file: !90, line: 54, baseType: !106, size: 64, align: 64, offset: 2624)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !89, file: !90, line: 55, baseType: !106, size: 64, align: 64, offset: 2688)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !89, file: !90, line: 56, baseType: !106, size: 64, align: 64, offset: 2752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !89, file: !90, line: 57, baseType: !77, size: 32, align: 32, offset: 2816)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !89, file: !90, line: 59, baseType: !170, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !89, file: !90, line: 60, baseType: !170, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !89, file: !90, line: 62, baseType: !170, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !89, file: !90, line: 63, baseType: !170, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !89, file: !90, line: 64, baseType: !170, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !89, file: !90, line: 65, baseType: !170, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !89, file: !90, line: 66, baseType: !170, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !89, file: !90, line: 67, baseType: !170, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !89, file: !90, line: 68, baseType: !170, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !89, file: !90, line: 69, baseType: !170, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !89, file: !90, line: 70, baseType: !170, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !89, file: !90, line: 71, baseType: !170, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !89, file: !90, line: 72, baseType: !170, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !89, file: !90, line: 74, baseType: !77, size: 32, align: 32, offset: 2880)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !89, file: !90, line: 75, baseType: !77, size: 32, align: 32, offset: 2912)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !89, file: !90, line: 76, baseType: !77, size: 32, align: 32, offset: 2944)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !89, file: !90, line: 77, baseType: !77, size: 32, align: 32, offset: 2976)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !89, file: !90, line: 79, baseType: !80, size: 64, align: 64, offset: 3008)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !89, file: !90, line: 80, baseType: !260, size: 64, align: 64, offset: 3072)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !89, file: !90, line: 81, baseType: !260, size: 64, align: 64, offset: 3136)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !89, file: !90, line: 83, baseType: !299, size: 64, align: 64, offset: 3200)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !89, file: !90, line: 84, baseType: !251, size: 32, align: 32, offset: 3264)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !89, file: !90, line: 87, baseType: !77, size: 32, align: 32, offset: 3296)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !89, file: !90, line: 91, baseType: !260, size: 64, align: 64, offset: 3328)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !89, file: !90, line: 92, baseType: !380, size: 128, align: 64, offset: 3392)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !89, file: !90, line: 93, baseType: !380, size: 128, align: 64, offset: 3520)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !89, file: !90, line: 95, baseType: !77, size: 32, align: 32, offset: 3648)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !89, file: !90, line: 96, baseType: !77, size: 32, align: 32, offset: 3680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !89, file: !90, line: 97, baseType: !77, size: 32, align: 32, offset: 3712)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !89, file: !90, line: 100, baseType: !260, size: 64, align: 64, offset: 3776)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !89, file: !90, line: 103, baseType: !260, size: 64, align: 64, offset: 3840)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !89, file: !90, line: 106, baseType: !260, size: 64, align: 64, offset: 3904)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !89, file: !90, line: 108, baseType: !80, size: 64, align: 64, offset: 3968)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !89, file: !90, line: 109, baseType: !260, size: 64, align: 64, offset: 4032)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !89, file: !90, line: 111, baseType: !260, size: 64, align: 64, offset: 4096)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !89, file: !90, line: 114, baseType: !85, size: 64, align: 64, offset: 4160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !89, file: !90, line: 116, baseType: !80, size: 64, align: 64, offset: 4224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !89, file: !90, line: 117, baseType: !647, size: 32768, align: 64, offset: 4288)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 32768, align: 64, elements: !657)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !649, line: 10, size: 128, align: 64, elements: !650)
!649 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!650 = !{!651, !656}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !648, file: !649, line: 11, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !649, line: 7, baseType: !654)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !69, !482, !107, !107, !106, !299}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !648, file: !649, line: 12, baseType: !107, size: 8, align: 8, offset: 64)
!657 = !{!658}
!658 = !DISubrange(count: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !89, file: !90, line: 118, baseType: !660, size: 2048, align: 8, offset: 37056)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 2048, align: 8, elements: !657)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !89, file: !90, line: 120, baseType: !583, size: 64, align: 64, offset: 39104)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !72, file: !76, line: 9, baseType: !106, size: 64, align: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !76, line: 10, baseType: !106, size: 64, align: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !72, file: !76, line: 11, baseType: !344, size: 64, align: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !72, file: !76, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !72, file: !76, line: 13, baseType: !106, size: 64, align: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !72, file: !76, line: 15, baseType: !517, size: 64, align: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !72, file: !76, line: 17, baseType: !524, size: 64, align: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !72, file: !528, line: 5, baseType: !106, size: 64, align: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !72, file: !528, line: 6, baseType: !106, size: 64, align: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !72, file: !528, line: 7, baseType: !344, size: 64, align: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !72, file: !528, line: 9, baseType: !80, size: 64, align: 64, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !72, file: !528, line: 10, baseType: !533, size: 64, align: 64, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !72, file: !528, line: 12, baseType: !170, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !72, file: !528, line: 13, baseType: !106, size: 64, align: 64, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !72, file: !528, line: 14, baseType: !77, size: 32, align: 32, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !72, file: !528, line: 15, baseType: !106, size: 64, align: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !72, file: !528, line: 17, baseType: !170, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !72, file: !528, line: 18, baseType: !170, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !72, file: !528, line: 19, baseType: !170, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !72, file: !528, line: 20, baseType: !170, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !72, file: !528, line: 22, baseType: !170, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !72, file: !528, line: 23, baseType: !170, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !72, file: !528, line: 24, baseType: !170, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !72, file: !528, line: 25, baseType: !170, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !72, file: !528, line: 26, baseType: !170, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !72, file: !528, line: 31, baseType: !572, size: 64, align: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !72, file: !73, line: 18, baseType: !260, size: 64, align: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !72, file: !73, line: 20, baseType: !344, size: 64, align: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !72, file: !73, line: 21, baseType: !77, size: 32, align: 32, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !72, file: !73, line: 22, baseType: !77, size: 32, align: 32, offset: 1568)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !693, line: 9, baseType: !694)
!693 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !697, !697, !697, !697, !697, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!699 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!700 = !{!701, !703}
!701 = distinct !DIGlobalVariable(name: "default_ban_type_str", scope: !0, file: !702, line: 41, type: !106, isLocal: true, isDefinition: true, variable: i8** @default_ban_type_str)
!702 = !DIFile(filename: "bans.c", directory: "/home/lichi/Desktop/irssi/task1")
!703 = distinct !DIGlobalVariable(name: "default_ban_type", scope: !0, file: !702, line: 42, type: !77, isLocal: true, isDefinition: true, variable: i32* @default_ban_type)
!704 = !{i32 2, !"Dwarf Version", i32 4}
!705 = !{i32 2, !"Debug Info Version", i32 3}
!706 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!707 = distinct !DISubprogram(name: "ban_get_mask", scope: !702, file: !702, line: 44, type: !708, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!106, !69, !482, !77}
!710 = !{}
!711 = !DILocalVariable(name: "channel", arg: 1, scope: !707, file: !702, line: 44, type: !69)
!712 = !DIExpression()
!713 = !DILocation(line: 44, column: 37, scope: !707)
!714 = !DILocalVariable(name: "nick", arg: 2, scope: !707, file: !702, line: 44, type: !482)
!715 = !DILocation(line: 44, column: 58, scope: !707)
!716 = !DILocalVariable(name: "ban_type", arg: 3, scope: !707, file: !702, line: 44, type: !77)
!717 = !DILocation(line: 44, column: 68, scope: !707)
!718 = !DILocalVariable(name: "rec", scope: !707, file: !702, line: 46, type: !533)
!719 = !DILocation(line: 46, column: 12, scope: !707)
!720 = !DILocalVariable(name: "str", scope: !707, file: !702, line: 47, type: !106)
!721 = !DILocation(line: 47, column: 8, scope: !707)
!722 = !DILocalVariable(name: "user", scope: !707, file: !702, line: 47, type: !106)
!723 = !DILocation(line: 47, column: 14, scope: !707)
!724 = !DILocalVariable(name: "host", scope: !707, file: !702, line: 47, type: !106)
!725 = !DILocation(line: 47, column: 21, scope: !707)
!726 = !DILocalVariable(name: "size", scope: !707, file: !702, line: 48, type: !77)
!727 = !DILocation(line: 48, column: 13, scope: !707)
!728 = !DILocation(line: 50, column: 2, scope: !707)
!729 = distinct !{!729, !728}
!730 = !DILocation(line: 50, column: 99, scope: !731)
!731 = !DILexicalBlockFile(scope: !732, file: !702, discriminator: 1)
!732 = distinct !DILexicalBlock(scope: !733, file: !702, line: 50, column: 10)
!733 = distinct !DILexicalBlock(scope: !707, file: !702, line: 50, column: 4)
!734 = !DILocation(line: 50, column: 74, scope: !731)
!735 = !DILocation(line: 50, column: 58, scope: !731)
!736 = !DILocation(line: 50, column: 57, scope: !731)
!737 = !DILocation(line: 50, column: 32, scope: !738)
!738 = !DILexicalBlockFile(scope: !731, file: !702, discriminator: 7)
!739 = !DILocation(line: 50, column: 12, scope: !731)
!740 = !DILocation(line: 50, column: 10, scope: !731)
!741 = !DILocation(line: 50, column: 11, scope: !742)
!742 = !DILexicalBlockFile(scope: !732, file: !702, discriminator: 2)
!743 = !DILocation(line: 50, column: 10, scope: !744)
!744 = !DILexicalBlockFile(scope: !733, file: !702, discriminator: 3)
!745 = !DILocation(line: 50, column: 30, scope: !746)
!746 = !DILexicalBlockFile(scope: !747, file: !702, discriminator: 4)
!747 = distinct !DILexicalBlock(scope: !732, file: !702, line: 50, column: 28)
!748 = !DILocation(line: 50, column: 39, scope: !749)
!749 = !DILexicalBlockFile(scope: !750, file: !702, discriminator: 5)
!750 = distinct !DILexicalBlock(scope: !732, file: !702, line: 50, column: 37)
!751 = !DILocation(line: 50, column: 135, scope: !749)
!752 = !DILocation(line: 50, column: 7, scope: !753)
!753 = !DILexicalBlockFile(scope: !733, file: !702, discriminator: 6)
!754 = !DILocation(line: 51, column: 2, scope: !707)
!755 = distinct !{!755, !754}
!756 = !DILocation(line: 51, column: 10, scope: !757)
!757 = !DILexicalBlockFile(scope: !758, file: !702, discriminator: 1)
!758 = distinct !DILexicalBlock(scope: !759, file: !702, line: 51, column: 10)
!759 = distinct !DILexicalBlock(scope: !707, file: !702, line: 51, column: 4)
!760 = !DILocation(line: 51, column: 15, scope: !757)
!761 = !DILocation(line: 51, column: 5, scope: !762)
!762 = !DILexicalBlockFile(scope: !763, file: !702, discriminator: 2)
!763 = distinct !DILexicalBlock(scope: !758, file: !702, line: 51, column: 3)
!764 = !DILocation(line: 51, column: 14, scope: !765)
!765 = !DILexicalBlockFile(scope: !766, file: !702, discriminator: 3)
!766 = distinct !DILexicalBlock(scope: !758, file: !702, line: 51, column: 12)
!767 = !DILocation(line: 51, column: 99, scope: !765)
!768 = !DILocation(line: 51, column: 7, scope: !769)
!769 = !DILexicalBlockFile(scope: !759, file: !702, discriminator: 4)
!770 = !DILocation(line: 53, column: 64, scope: !707)
!771 = !DILocation(line: 53, column: 39, scope: !707)
!772 = !DILocation(line: 53, column: 23, scope: !707)
!773 = !DILocation(line: 53, column: 56, scope: !707)
!774 = !DILocation(line: 53, column: 8, scope: !775)
!775 = !DILexicalBlockFile(scope: !707, file: !702, discriminator: 1)
!776 = !DILocation(line: 53, column: 6, scope: !707)
!777 = !DILocation(line: 54, column: 6, scope: !778)
!778 = distinct !DILexicalBlock(scope: !707, file: !702, line: 54, column: 6)
!779 = !DILocation(line: 54, column: 10, scope: !778)
!780 = !DILocation(line: 54, column: 6, scope: !707)
!781 = !DILocation(line: 54, column: 18, scope: !782)
!782 = !DILexicalBlockFile(scope: !778, file: !702, discriminator: 1)
!783 = !DILocation(line: 55, column: 6, scope: !784)
!784 = distinct !DILexicalBlock(scope: !707, file: !702, line: 55, column: 6)
!785 = !DILocation(line: 55, column: 11, scope: !784)
!786 = !DILocation(line: 55, column: 16, scope: !784)
!787 = !DILocation(line: 55, column: 6, scope: !707)
!788 = !DILocation(line: 56, column: 96, scope: !789)
!789 = distinct !DILexicalBlock(scope: !784, file: !702, line: 55, column: 24)
!790 = !DILocation(line: 56, column: 105, scope: !789)
!791 = !DILocation(line: 56, column: 111, scope: !789)
!792 = !DILocation(line: 56, column: 3, scope: !789)
!793 = !DILocation(line: 57, column: 36, scope: !789)
!794 = !DILocation(line: 57, column: 10, scope: !789)
!795 = !DILocation(line: 57, column: 3, scope: !789)
!796 = !DILocation(line: 60, column: 6, scope: !797)
!797 = distinct !DILexicalBlock(scope: !707, file: !702, line: 60, column: 6)
!798 = !DILocation(line: 60, column: 15, scope: !797)
!799 = !DILocation(line: 60, column: 6, scope: !707)
!800 = !DILocation(line: 61, column: 14, scope: !797)
!801 = !DILocation(line: 61, column: 12, scope: !797)
!802 = !DILocation(line: 61, column: 3, scope: !797)
!803 = !DILocation(line: 63, column: 21, scope: !707)
!804 = !DILocation(line: 63, column: 27, scope: !707)
!805 = !DILocation(line: 63, column: 32, scope: !707)
!806 = !DILocation(line: 63, column: 38, scope: !707)
!807 = !DILocation(line: 63, column: 8, scope: !707)
!808 = !DILocation(line: 63, column: 6, scope: !707)
!809 = !DILocation(line: 69, column: 16, scope: !707)
!810 = !DILocation(line: 69, column: 9, scope: !707)
!811 = !DILocation(line: 69, column: 7, scope: !707)
!812 = !DILocation(line: 70, column: 6, scope: !813)
!813 = distinct !DILexicalBlock(scope: !707, file: !702, line: 70, column: 6)
!814 = !DILocation(line: 70, column: 11, scope: !813)
!815 = !DILocation(line: 70, column: 6, scope: !707)
!816 = !DILocation(line: 70, column: 26, scope: !817)
!817 = !DILexicalBlockFile(scope: !813, file: !702, discriminator: 1)
!818 = !DILocation(line: 70, column: 19, scope: !817)
!819 = !DILocation(line: 72, column: 16, scope: !707)
!820 = !DILocation(line: 72, column: 9, scope: !707)
!821 = !DILocation(line: 72, column: 7, scope: !707)
!822 = !DILocation(line: 73, column: 6, scope: !823)
!823 = distinct !DILexicalBlock(scope: !707, file: !702, line: 73, column: 6)
!824 = !DILocation(line: 73, column: 11, scope: !823)
!825 = !DILocation(line: 73, column: 6, scope: !707)
!826 = !DILocation(line: 73, column: 26, scope: !827)
!827 = !DILexicalBlockFile(scope: !823, file: !702, discriminator: 1)
!828 = !DILocation(line: 73, column: 19, scope: !827)
!829 = !DILocation(line: 75, column: 23, scope: !707)
!830 = !DILocation(line: 75, column: 28, scope: !707)
!831 = !DILocation(line: 75, column: 27, scope: !707)
!832 = !DILocation(line: 75, column: 16, scope: !707)
!833 = !DILocation(line: 75, column: 14, scope: !707)
!834 = !DILocation(line: 76, column: 6, scope: !835)
!835 = distinct !DILexicalBlock(scope: !707, file: !702, line: 76, column: 6)
!836 = !DILocation(line: 76, column: 11, scope: !835)
!837 = !DILocation(line: 76, column: 6, scope: !707)
!838 = !DILocation(line: 78, column: 3, scope: !839)
!839 = distinct !DILexicalBlock(scope: !835, file: !702, line: 76, column: 18)
!840 = distinct !{!840, !838}
!841 = !DILocation(line: 78, column: 18, scope: !842)
!842 = !DILexicalBlockFile(scope: !843, file: !702, discriminator: 1)
!843 = distinct !DILexicalBlock(scope: !839, file: !702, line: 78, column: 6)
!844 = !DILocation(line: 78, column: 22, scope: !842)
!845 = !DILocation(line: 78, column: 28, scope: !842)
!846 = !DILocation(line: 78, column: 34, scope: !842)
!847 = !DILocation(line: 78, column: 38, scope: !842)
!848 = !DILocation(line: 78, column: 32, scope: !842)
!849 = !DILocation(line: 78, column: 52, scope: !842)
!850 = !DILocation(line: 78, column: 58, scope: !842)
!851 = !DILocation(line: 78, column: 62, scope: !842)
!852 = !DILocation(line: 78, column: 56, scope: !842)
!853 = !DILocation(line: 78, column: 45, scope: !842)
!854 = !DILocation(line: 78, column: 66, scope: !842)
!855 = !DILocation(line: 78, column: 8, scope: !856)
!856 = !DILexicalBlockFile(scope: !842, file: !702, discriminator: 2)
!857 = !DILocation(line: 78, column: 72, scope: !842)
!858 = !DILocation(line: 79, column: 2, scope: !839)
!859 = !DILocation(line: 80, column: 9, scope: !707)
!860 = !DILocation(line: 80, column: 2, scope: !707)
!861 = !DILocation(line: 81, column: 1, scope: !707)
!862 = distinct !DISubprogram(name: "ban_get_masks", scope: !702, file: !702, line: 83, type: !708, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !710)
!863 = !DILocalVariable(name: "channel", arg: 1, scope: !862, file: !702, line: 83, type: !69)
!864 = !DILocation(line: 83, column: 38, scope: !862)
!865 = !DILocalVariable(name: "nicks", arg: 2, scope: !862, file: !702, line: 83, type: !482)
!866 = !DILocation(line: 83, column: 59, scope: !862)
!867 = !DILocalVariable(name: "ban_type", arg: 3, scope: !862, file: !702, line: 83, type: !77)
!868 = !DILocation(line: 83, column: 70, scope: !862)
!869 = !DILocalVariable(name: "str", scope: !862, file: !702, line: 85, type: !299)
!870 = !DILocation(line: 85, column: 11, scope: !862)
!871 = !DILocalVariable(name: "ban", scope: !862, file: !702, line: 86, type: !496)
!872 = !DILocation(line: 86, column: 9, scope: !862)
!873 = !DILocalVariable(name: "banlist", scope: !862, file: !702, line: 86, type: !496)
!874 = !DILocation(line: 86, column: 16, scope: !862)
!875 = !DILocalVariable(name: "realban", scope: !862, file: !702, line: 86, type: !106)
!876 = !DILocation(line: 86, column: 26, scope: !862)
!877 = !DILocalVariable(name: "ret", scope: !862, file: !702, line: 86, type: !106)
!878 = !DILocation(line: 86, column: 36, scope: !862)
!879 = !DILocation(line: 88, column: 8, scope: !862)
!880 = !DILocation(line: 88, column: 6, scope: !862)
!881 = !DILocation(line: 89, column: 23, scope: !862)
!882 = !DILocation(line: 89, column: 12, scope: !862)
!883 = !DILocation(line: 89, column: 10, scope: !862)
!884 = !DILocation(line: 90, column: 13, scope: !885)
!885 = distinct !DILexicalBlock(scope: !862, file: !702, line: 90, column: 2)
!886 = !DILocation(line: 90, column: 11, scope: !885)
!887 = !DILocation(line: 90, column: 7, scope: !885)
!888 = !DILocation(line: 90, column: 23, scope: !889)
!889 = !DILexicalBlockFile(scope: !890, file: !702, discriminator: 1)
!890 = distinct !DILexicalBlock(scope: !885, file: !702, line: 90, column: 2)
!891 = !DILocation(line: 90, column: 22, scope: !889)
!892 = !DILocation(line: 90, column: 27, scope: !889)
!893 = !DILocation(line: 90, column: 2, scope: !889)
!894 = !DILocation(line: 91, column: 9, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !702, line: 91, column: 7)
!896 = distinct !DILexicalBlock(scope: !890, file: !702, line: 90, column: 42)
!897 = !DILocation(line: 91, column: 8, scope: !895)
!898 = !DILocation(line: 91, column: 7, scope: !895)
!899 = !DILocation(line: 91, column: 13, scope: !895)
!900 = !DILocation(line: 91, column: 20, scope: !895)
!901 = !DILocation(line: 91, column: 31, scope: !902)
!902 = !DILexicalBlockFile(scope: !895, file: !702, discriminator: 1)
!903 = !DILocation(line: 91, column: 30, scope: !902)
!904 = !DILocation(line: 91, column: 23, scope: !902)
!905 = !DILocation(line: 91, column: 41, scope: !902)
!906 = !DILocation(line: 91, column: 7, scope: !902)
!907 = !DILocation(line: 93, column: 27, scope: !908)
!908 = distinct !DILexicalBlock(scope: !895, file: !702, line: 91, column: 49)
!909 = !DILocation(line: 93, column: 40, scope: !908)
!910 = !DILocation(line: 93, column: 39, scope: !908)
!911 = !DILocation(line: 93, column: 4, scope: !908)
!912 = !DILocation(line: 94, column: 4, scope: !908)
!913 = !DILocation(line: 98, column: 26, scope: !896)
!914 = !DILocation(line: 98, column: 36, scope: !896)
!915 = !DILocation(line: 98, column: 35, scope: !896)
!916 = !DILocation(line: 98, column: 41, scope: !896)
!917 = !DILocation(line: 98, column: 13, scope: !896)
!918 = !DILocation(line: 98, column: 11, scope: !896)
!919 = !DILocation(line: 99, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !896, file: !702, line: 99, column: 7)
!921 = !DILocation(line: 99, column: 15, scope: !920)
!922 = !DILocation(line: 99, column: 7, scope: !896)
!923 = !DILocation(line: 100, column: 27, scope: !924)
!924 = distinct !DILexicalBlock(scope: !920, file: !702, line: 99, column: 23)
!925 = !DILocation(line: 100, column: 39, scope: !924)
!926 = !DILocation(line: 100, column: 4, scope: !924)
!927 = !DILocation(line: 101, column: 11, scope: !924)
!928 = !DILocation(line: 101, column: 4, scope: !924)
!929 = !DILocation(line: 102, column: 3, scope: !924)
!930 = !DILocation(line: 103, column: 2, scope: !896)
!931 = !DILocation(line: 90, column: 38, scope: !932)
!932 = !DILexicalBlockFile(scope: !890, file: !702, discriminator: 2)
!933 = !DILocation(line: 90, column: 2, scope: !932)
!934 = distinct !{!934, !935}
!935 = !DILocation(line: 90, column: 2, scope: !862)
!936 = !DILocation(line: 104, column: 13, scope: !862)
!937 = !DILocation(line: 104, column: 2, scope: !862)
!938 = !DILocation(line: 106, column: 6, scope: !939)
!939 = distinct !DILexicalBlock(scope: !862, file: !702, line: 106, column: 6)
!940 = !DILocation(line: 106, column: 11, scope: !939)
!941 = !DILocation(line: 106, column: 15, scope: !939)
!942 = !DILocation(line: 106, column: 6, scope: !862)
!943 = !DILocation(line: 107, column: 21, scope: !939)
!944 = !DILocation(line: 107, column: 26, scope: !939)
!945 = !DILocation(line: 107, column: 31, scope: !939)
!946 = !DILocation(line: 107, column: 34, scope: !939)
!947 = !DILocation(line: 107, column: 3, scope: !939)
!948 = !DILocation(line: 109, column: 8, scope: !862)
!949 = !DILocation(line: 109, column: 13, scope: !862)
!950 = !DILocation(line: 109, column: 6, scope: !862)
!951 = !DILocation(line: 110, column: 16, scope: !862)
!952 = !DILocation(line: 110, column: 2, scope: !862)
!953 = !DILocation(line: 111, column: 16, scope: !862)
!954 = !DILocation(line: 111, column: 9, scope: !862)
!955 = distinct !DISubprogram(name: "ban_set", scope: !702, file: !702, line: 114, type: !956, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !710)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !69, !482, !77}
!958 = !DILocalVariable(name: "channel", arg: 1, scope: !955, file: !702, line: 114, type: !69)
!959 = !DILocation(line: 114, column: 31, scope: !955)
!960 = !DILocalVariable(name: "bans", arg: 2, scope: !955, file: !702, line: 114, type: !482)
