; ModuleID = './line372-terminfo-core.o.i'
source_filename = "./line372-terminfo-core.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._TERM_REC = type { void (%struct._TERM_REC*, i32, i32)*, void (%struct._TERM_REC*, i32, i32, i32, i32)*, {}*, void (%struct._TERM_REC*, i32, i32, i32)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*, i8, i32)*, {}*, {}*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, void (%struct._TERM_REC*)*, {}*, {}*, {}*, void (%struct._TERM_REC*)*, [1024 x i8], [1024 x i8], %struct._IO_FILE*, %struct._IO_FILE*, %struct.termios, %struct.termios, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8**, i8**, i8*, i8*, i8*, i8*, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.TERMINFO_REC = type { i8*, i8*, i32, i32 }
%struct._GString = type { i8*, i64, i64 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !193)
!1 = !DIFile(filename: "line372-terminfo-core.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !5, !8, !186, !188, !191, !192, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_REC", file: !10, line: 24, baseType: !11)
!10 = !DIFile(filename: "terminfo-core.h", directory: "/home/lichi/Desktop/irssi/task1")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_REC", file: !10, line: 26, size: 21504, align: 64, elements: !12)
!12 = !{!13, !18, !22, !26, !30, !34, !35, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !53, !54, !114, !115, !135, !136, !137, !138, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "move", scope: !11, file: !10, line: 28, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !8, !17, !17}
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "move_relative", scope: !11, file: !10, line: 29, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !8, !17, !17, !17, !17}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "set_cursor_visible", scope: !11, file: !10, line: 30, baseType: !23, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !8, !17}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !11, file: !10, line: 31, baseType: !27, size: 64, align: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !8, !17, !17, !17}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !11, file: !10, line: 33, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !8}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "clrtoeol", scope: !11, file: !10, line: 34, baseType: !31, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !11, file: !10, line: 35, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !8, !7, !17}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "set_fg", scope: !11, file: !10, line: 37, baseType: !23, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "set_bg", scope: !11, file: !10, line: 38, baseType: !23, size: 64, align: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "set_normal", scope: !11, file: !10, line: 39, baseType: !31, size: 64, align: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "set_blink", scope: !11, file: !10, line: 40, baseType: !31, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "set_bold", scope: !11, file: !10, line: 41, baseType: !31, size: 64, align: 64, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "set_reverse", scope: !11, file: !10, line: 42, baseType: !31, size: 64, align: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "set_uline", scope: !11, file: !10, line: 43, baseType: !23, size: 64, align: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "set_standout", scope: !11, file: !10, line: 44, baseType: !23, size: 64, align: 64, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "set_italic", scope: !11, file: !10, line: 45, baseType: !23, size: 64, align: 64, offset: 960)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "beep", scope: !11, file: !10, line: 47, baseType: !31, size: 64, align: 64, offset: 1024)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "buffer1", scope: !11, file: !10, line: 50, baseType: !50, size: 8192, align: 8, offset: 1088)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, align: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1024)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "buffer2", scope: !11, file: !10, line: 50, baseType: !50, size: 8192, align: 8, offset: 9280)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !11, file: !10, line: 52, baseType: !55, size: 64, align: 64, offset: 17472)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !57, line: 48, baseType: !58)
!57 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 241, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !81, !82, !83, !84, !88, !90, !92, !96, !99, !101, !102, !103, !104, !105, !109, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 242, baseType: !17, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 247, baseType: !6, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 248, baseType: !6, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 249, baseType: !6, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 250, baseType: !6, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 251, baseType: !6, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 252, baseType: !6, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 253, baseType: !6, size: 64, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 254, baseType: !6, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 256, baseType: !6, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 257, baseType: !6, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 258, baseType: !6, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 260, baseType: !74, size: 64, align: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 156, size: 192, align: 64, elements: !76)
!76 = !{!77, !78, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !75, file: !59, line: 157, baseType: !74, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !75, file: !59, line: 158, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !75, file: !59, line: 162, baseType: !17, size: 32, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 262, baseType: !79, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 264, baseType: !17, size: 32, align: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 268, baseType: !17, size: 32, align: 32, offset: 928)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 270, baseType: !85, size: 64, align: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !86, line: 131, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 274, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 275, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 276, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 280, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 150, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 289, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !86, line: 132, baseType: !87)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 297, baseType: !4, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 298, baseType: !4, size: 64, align: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 299, baseType: !4, size: 64, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 300, baseType: !4, size: 64, align: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 302, baseType: !106, size: 64, align: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 216, baseType: !108)
!107 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 303, baseType: !17, size: 32, align: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 305, baseType: !111, size: 160, align: 8, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !11, file: !10, line: 52, baseType: !55, size: 64, align: 64, offset: 17536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tio", scope: !11, file: !10, line: 53, baseType: !116, size: 480, align: 32, offset: 17600)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !117, line: 28, size: 480, align: 32, elements: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/termios.h", directory: "/home/lichi/Desktop/irssi/task1")
!118 = !{!119, !122, !123, !124, !125, !128, !132, !134}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !116, file: !117, line: 30, baseType: !120, size: 32, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !117, line: 25, baseType: !121)
!121 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !116, file: !117, line: 31, baseType: !120, size: 32, align: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !116, file: !117, line: 32, baseType: !120, size: 32, align: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !116, file: !117, line: 33, baseType: !120, size: 32, align: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !116, file: !117, line: 34, baseType: !126, size: 8, align: 8, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !117, line: 23, baseType: !127)
!127 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !116, file: !117, line: 35, baseType: !129, size: 256, align: 8, offset: 136)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !116, file: !117, line: 36, baseType: !133, size: 32, align: 32, offset: 416)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !117, line: 24, baseType: !121)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !116, file: !117, line: 37, baseType: !133, size: 32, align: 32, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "old_tio", scope: !11, file: !10, line: 53, baseType: !116, size: 480, align: 32, offset: 18080)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !11, file: !10, line: 56, baseType: !17, size: 32, align: 32, offset: 18560)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !11, file: !10, line: 56, baseType: !17, size: 32, align: 32, offset: 18592)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smcup", scope: !11, file: !10, line: 59, baseType: !139, size: 64, align: 64, offset: 18624)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmcup", scope: !11, file: !10, line: 59, baseType: !139, size: 64, align: 64, offset: 18688)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cup", scope: !11, file: !10, line: 59, baseType: !139, size: 64, align: 64, offset: 18752)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TI_hpa", scope: !11, file: !10, line: 60, baseType: !139, size: 64, align: 64, offset: 18816)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "TI_vpa", scope: !11, file: !10, line: 60, baseType: !139, size: 64, align: 64, offset: 18880)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cub1", scope: !11, file: !10, line: 60, baseType: !139, size: 64, align: 64, offset: 18944)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cuf1", scope: !11, file: !10, line: 60, baseType: !139, size: 64, align: 64, offset: 19008)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "TI_civis", scope: !11, file: !10, line: 61, baseType: !139, size: 64, align: 64, offset: 19072)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "TI_cnorm", scope: !11, file: !10, line: 61, baseType: !139, size: 64, align: 64, offset: 19136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "TI_csr", scope: !11, file: !10, line: 64, baseType: !139, size: 64, align: 64, offset: 19200)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "TI_wind", scope: !11, file: !10, line: 64, baseType: !139, size: 64, align: 64, offset: 19264)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ri", scope: !11, file: !10, line: 65, baseType: !139, size: 64, align: 64, offset: 19328)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rin", scope: !11, file: !10, line: 65, baseType: !139, size: 64, align: 64, offset: 19392)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ind", scope: !11, file: !10, line: 65, baseType: !139, size: 64, align: 64, offset: 19456)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "TI_indn", scope: !11, file: !10, line: 65, baseType: !139, size: 64, align: 64, offset: 19520)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "TI_il", scope: !11, file: !10, line: 66, baseType: !139, size: 64, align: 64, offset: 19584)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TI_il1", scope: !11, file: !10, line: 66, baseType: !139, size: 64, align: 64, offset: 19648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "TI_dl", scope: !11, file: !10, line: 66, baseType: !139, size: 64, align: 64, offset: 19712)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "TI_dl1", scope: !11, file: !10, line: 66, baseType: !139, size: 64, align: 64, offset: 19776)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "TI_clear", scope: !11, file: !10, line: 69, baseType: !139, size: 64, align: 64, offset: 19840)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ed", scope: !11, file: !10, line: 69, baseType: !139, size: 64, align: 64, offset: 19904)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "TI_el", scope: !11, file: !10, line: 72, baseType: !139, size: 64, align: 64, offset: 19968)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rep", scope: !11, file: !10, line: 75, baseType: !139, size: 64, align: 64, offset: 20032)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "TI_colors", scope: !11, file: !10, line: 78, baseType: !17, size: 32, align: 32, offset: 20096)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "TI_sgr0", scope: !11, file: !10, line: 79, baseType: !139, size: 64, align: 64, offset: 20160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smul", scope: !11, file: !10, line: 80, baseType: !139, size: 64, align: 64, offset: 20224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmul", scope: !11, file: !10, line: 80, baseType: !139, size: 64, align: 64, offset: 20288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smso", scope: !11, file: !10, line: 81, baseType: !139, size: 64, align: 64, offset: 20352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmso", scope: !11, file: !10, line: 81, baseType: !139, size: 64, align: 64, offset: 20416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "TI_sitm", scope: !11, file: !10, line: 82, baseType: !139, size: 64, align: 64, offset: 20480)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "TI_ritm", scope: !11, file: !10, line: 82, baseType: !139, size: 64, align: 64, offset: 20544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bold", scope: !11, file: !10, line: 83, baseType: !139, size: 64, align: 64, offset: 20608)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "TI_blink", scope: !11, file: !10, line: 83, baseType: !139, size: 64, align: 64, offset: 20672)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rev", scope: !11, file: !10, line: 83, baseType: !139, size: 64, align: 64, offset: 20736)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setaf", scope: !11, file: !10, line: 84, baseType: !139, size: 64, align: 64, offset: 20800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setab", scope: !11, file: !10, line: 84, baseType: !139, size: 64, align: 64, offset: 20864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setf", scope: !11, file: !10, line: 84, baseType: !139, size: 64, align: 64, offset: 20928)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "TI_setb", scope: !11, file: !10, line: 84, baseType: !139, size: 64, align: 64, offset: 20992)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "TI_fg", scope: !11, file: !10, line: 87, baseType: !5, size: 64, align: 64, offset: 21056)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bg", scope: !11, file: !10, line: 87, baseType: !5, size: 64, align: 64, offset: 21120)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "TI_normal", scope: !11, file: !10, line: 87, baseType: !6, size: 64, align: 64, offset: 21184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "TI_bel", scope: !11, file: !10, line: 90, baseType: !6, size: 64, align: 64, offset: 21248)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "TI_smkx", scope: !11, file: !10, line: 93, baseType: !139, size: 64, align: 64, offset: 21312)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "TI_rmkx", scope: !11, file: !10, line: 94, baseType: !139, size: 64, align: 64, offset: 21376)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "appkey_enabled", scope: !11, file: !10, line: 97, baseType: !17, size: 32, align: 32, offset: 21440)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bracketed_paste_enabled", scope: !11, file: !10, line: 98, baseType: !17, size: 32, align: 32, offset: 21472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !187, line: 77, baseType: !4)
!187 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !190, line: 38, baseType: !127)
!190 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !187, line: 48, baseType: !87)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!193 = !{!194, !200, !201}
!194 = distinct !DIGlobalVariable(name: "ansitab", scope: !195, file: !196, line: 450, type: !197, isLocal: true, isDefinition: true, variable: [16 x i8]* @terminfo_setup_colors.ansitab)
!195 = distinct !DISubprogram(name: "terminfo_setup_colors", scope: !196, file: !196, line: 448, type: !24, isLocal: false, isDefinition: true, scopeLine: 449, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!196 = !DIFile(filename: "terminfo-core.c", directory: "/home/lichi/Desktop/irssi/task1")
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 16)
!200 = distinct !DIGlobalVariable(name: "current_term", scope: !0, file: !196, line: 39, type: !8, isLocal: false, isDefinition: true, variable: %struct._TERM_REC** @current_term)
!201 = distinct !DIGlobalVariable(name: "tcaps", scope: !0, file: !196, line: 42, type: !202, isLocal: true, isDefinition: true, variable: [43 x %struct.TERMINFO_REC]* @tcaps)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 8256, align: 64, elements: !210)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERMINFO_REC", file: !196, line: 37, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 32, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ti_name", scope: !204, file: !196, line: 33, baseType: !139, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tc_name", scope: !204, file: !196, line: 34, baseType: !139, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !196, line: 35, baseType: !17, size: 32, align: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !204, file: !196, line: 36, baseType: !121, size: 32, align: 32, offset: 160)
!210 = !{!211}
!211 = !DISubrange(count: 43)
!212 = !{i32 2, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!215 = !DILocalVariable(name: "term", arg: 1, scope: !195, file: !196, line: 448, type: !8)
!216 = !DIExpression()
!217 = !DILocation(line: 448, column: 38, scope: !195)
!218 = !DILocalVariable(name: "force", arg: 2, scope: !195, file: !196, line: 448, type: !17)
!219 = !DILocation(line: 448, column: 48, scope: !195)
!220 = !DILocalVariable(name: "i", scope: !195, file: !196, line: 454, type: !121)
!221 = !DILocation(line: 454, column: 15, scope: !195)
!222 = !DILocalVariable(name: "color", scope: !195, file: !196, line: 454, type: !121)
!223 = !DILocation(line: 454, column: 18, scope: !195)
!224 = !DILocation(line: 456, column: 25, scope: !195)
!225 = !DILocation(line: 456, column: 2, scope: !195)
!226 = !DILocation(line: 458, column: 6, scope: !227)
!227 = distinct !DILexicalBlock(scope: !195, file: !196, line: 458, column: 6)
!228 = !DILocation(line: 458, column: 12, scope: !227)
!229 = !DILocation(line: 458, column: 15, scope: !230)
!230 = !DILexicalBlockFile(scope: !227, file: !196, discriminator: 1)
!231 = !DILocation(line: 458, column: 21, scope: !230)
!232 = !DILocation(line: 458, column: 29, scope: !230)
!233 = !DILocation(line: 458, column: 36, scope: !230)
!234 = !DILocation(line: 458, column: 39, scope: !235)
!235 = !DILexicalBlockFile(scope: !227, file: !196, discriminator: 2)
!236 = !DILocation(line: 458, column: 45, scope: !235)
!237 = !DILocation(line: 458, column: 54, scope: !235)
!238 = !DILocation(line: 458, column: 6, scope: !235)
!239 = !DILocation(line: 459, column: 3, scope: !227)
!240 = !DILocation(line: 459, column: 9, scope: !227)
!241 = !DILocation(line: 459, column: 19, scope: !227)
!242 = !DILocation(line: 461, column: 7, scope: !243)
!243 = distinct !DILexicalBlock(scope: !195, file: !196, line: 461, column: 6)
!244 = !DILocation(line: 461, column: 13, scope: !243)
!245 = !DILocation(line: 461, column: 21, scope: !243)
!246 = !DILocation(line: 461, column: 24, scope: !247)
!247 = !DILexicalBlockFile(scope: !243, file: !196, discriminator: 1)
!248 = !DILocation(line: 461, column: 30, scope: !247)
!249 = !DILocation(line: 461, column: 39, scope: !247)
!250 = !DILocation(line: 461, column: 42, scope: !251)
!251 = !DILexicalBlockFile(scope: !243, file: !196, discriminator: 2)
!252 = !DILocation(line: 461, column: 49, scope: !251)
!253 = !DILocation(line: 462, column: 7, scope: !243)
!254 = !DILocation(line: 462, column: 13, scope: !243)
!255 = !DILocation(line: 462, column: 23, scope: !243)
!256 = !DILocation(line: 461, column: 6, scope: !257)
!257 = !DILexicalBlockFile(scope: !195, file: !196, discriminator: 3)
!258 = !DILocation(line: 463, column: 43, scope: !259)
!259 = distinct !DILexicalBlock(scope: !243, file: !196, line: 462, column: 28)
!260 = !DILocation(line: 463, column: 49, scope: !259)
!261 = !DILocation(line: 463, column: 42, scope: !259)
!262 = !DILocation(line: 463, column: 29, scope: !259)
!263 = !DILocation(line: 463, column: 18, scope: !259)
!264 = !DILocation(line: 463, column: 3, scope: !259)
!265 = !DILocation(line: 463, column: 9, scope: !259)
!266 = !DILocation(line: 463, column: 15, scope: !259)
!267 = !DILocation(line: 464, column: 43, scope: !259)
!268 = !DILocation(line: 464, column: 49, scope: !259)
!269 = !DILocation(line: 464, column: 42, scope: !259)
!270 = !DILocation(line: 464, column: 29, scope: !259)
!271 = !DILocation(line: 464, column: 18, scope: !259)
!272 = !DILocation(line: 464, column: 3, scope: !259)
!273 = !DILocation(line: 464, column: 9, scope: !259)
!274 = !DILocation(line: 464, column: 15, scope: !259)
!275 = !DILocation(line: 465, column: 3, scope: !259)
!276 = !DILocation(line: 465, column: 9, scope: !259)
!277 = !DILocation(line: 465, column: 16, scope: !259)
!278 = !DILocation(line: 466, column: 3, scope: !259)
!279 = !DILocation(line: 466, column: 9, scope: !259)
!280 = !DILocation(line: 466, column: 16, scope: !259)
!281 = !DILocation(line: 467, column: 2, scope: !259)
!282 = !DILocation(line: 469, column: 3, scope: !283)
!283 = distinct !DILexicalBlock(scope: !243, file: !196, line: 467, column: 9)
!284 = !DILocation(line: 469, column: 9, scope: !283)
!285 = !DILocation(line: 469, column: 19, scope: !283)
!286 = !DILocation(line: 470, column: 18, scope: !283)
!287 = !DILocation(line: 470, column: 24, scope: !283)
!288 = !DILocation(line: 470, column: 31, scope: !283)
!289 = !DILocation(line: 470, column: 3, scope: !283)
!290 = !DILocation(line: 470, column: 9, scope: !283)
!291 = !DILocation(line: 470, column: 16, scope: !283)
!292 = !DILocation(line: 473, column: 6, scope: !293)
!293 = distinct !DILexicalBlock(scope: !195, file: !196, line: 473, column: 6)
!294 = !DILocation(line: 473, column: 12, scope: !293)
!295 = !DILocation(line: 473, column: 6, scope: !195)
!296 = !DILocation(line: 474, column: 10, scope: !297)
!297 = distinct !DILexicalBlock(scope: !298, file: !196, line: 474, column: 3)
!298 = distinct !DILexicalBlock(scope: !293, file: !196, line: 473, column: 22)
!299 = !DILocation(line: 474, column: 8, scope: !297)
!300 = !DILocation(line: 474, column: 15, scope: !301)
!301 = !DILexicalBlockFile(scope: !302, file: !196, discriminator: 1)
!302 = distinct !DILexicalBlock(scope: !297, file: !196, line: 474, column: 3)
!303 = !DILocation(line: 474, column: 19, scope: !301)
!304 = !DILocation(line: 474, column: 25, scope: !301)
!305 = !DILocation(line: 474, column: 17, scope: !301)
!306 = !DILocation(line: 474, column: 3, scope: !301)
!307 = !DILocation(line: 475, column: 12, scope: !308)
!308 = distinct !DILexicalBlock(scope: !302, file: !196, line: 474, column: 41)
!309 = !DILocation(line: 475, column: 14, scope: !308)
!310 = !DILocation(line: 475, column: 29, scope: !311)
!311 = !DILexicalBlockFile(scope: !308, file: !196, discriminator: 1)
!312 = !DILocation(line: 475, column: 21, scope: !311)
!313 = !DILocation(line: 475, column: 12, scope: !311)
!314 = !DILocation(line: 475, column: 34, scope: !315)
!315 = !DILexicalBlockFile(scope: !308, file: !196, discriminator: 2)
!316 = !DILocation(line: 475, column: 12, scope: !315)
!317 = !DILocation(line: 475, column: 12, scope: !318)
!318 = !DILexicalBlockFile(scope: !308, file: !196, discriminator: 3)
!319 = !DILocation(line: 475, column: 10, scope: !318)
!320 = !DILocation(line: 476, column: 36, scope: !308)
!321 = !DILocation(line: 476, column: 42, scope: !308)
!322 = !DILocation(line: 476, column: 52, scope: !308)
!323 = !DILocation(line: 476, column: 30, scope: !308)
!324 = !DILocation(line: 476, column: 21, scope: !311)
!325 = !DILocation(line: 476, column: 16, scope: !308)
!326 = !DILocation(line: 476, column: 4, scope: !308)
!327 = !DILocation(line: 476, column: 10, scope: !308)
!328 = !DILocation(line: 476, column: 19, scope: !308)
!329 = !DILocation(line: 477, column: 3, scope: !308)
!330 = !DILocation(line: 474, column: 37, scope: !331)
!331 = !DILexicalBlockFile(scope: !302, file: !196, discriminator: 2)
!332 = !DILocation(line: 474, column: 3, scope: !331)
!333 = distinct !{!333, !334}
!334 = !DILocation(line: 474, column: 3, scope: !298)
!335 = !DILocation(line: 478, column: 2, scope: !298)
!336 = !DILocation(line: 478, column: 13, scope: !337)
!337 = !DILexicalBlockFile(scope: !338, file: !196, discriminator: 1)
!338 = distinct !DILexicalBlock(scope: !293, file: !196, line: 478, column: 13)
!339 = !DILocation(line: 478, column: 19, scope: !337)
!340 = !DILocation(line: 479, column: 10, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !196, line: 479, column: 3)
!342 = distinct !DILexicalBlock(scope: !338, file: !196, line: 478, column: 28)
!343 = !DILocation(line: 479, column: 8, scope: !341)
!344 = !DILocation(line: 479, column: 15, scope: !345)
!345 = !DILexicalBlockFile(scope: !346, file: !196, discriminator: 1)
!346 = distinct !DILexicalBlock(scope: !341, file: !196, line: 479, column: 3)
!347 = !DILocation(line: 479, column: 19, scope: !345)
!348 = !DILocation(line: 479, column: 25, scope: !345)
!349 = !DILocation(line: 479, column: 17, scope: !345)
!350 = !DILocation(line: 479, column: 3, scope: !345)
!351 = !DILocation(line: 480, column: 57, scope: !346)
!352 = !DILocation(line: 480, column: 63, scope: !346)
!353 = !DILocation(line: 480, column: 72, scope: !346)
!354 = !DILocation(line: 480, column: 51, scope: !346)
!355 = !DILocation(line: 480, column: 42, scope: !345)
!356 = !DILocation(line: 480, column: 37, scope: !346)
!357 = !DILocation(line: 480, column: 25, scope: !346)
!358 = !DILocation(line: 480, column: 31, scope: !346)
!359 = !DILocation(line: 480, column: 40, scope: !346)
!360 = !DILocation(line: 479, column: 37, scope: !361)
!361 = !DILexicalBlockFile(scope: !346, file: !196, discriminator: 2)
!362 = !DILocation(line: 479, column: 3, scope: !361)
!363 = distinct !{!363, !364}
!364 = !DILocation(line: 479, column: 3, scope: !342)
!365 = !DILocation(line: 481, column: 2, scope: !342)
!366 = !DILocation(line: 481, column: 13, scope: !367)
!367 = !DILexicalBlockFile(scope: !368, file: !196, discriminator: 1)
!368 = distinct !DILexicalBlock(scope: !338, file: !196, line: 481, column: 13)
!369 = !DILocation(line: 482, column: 10, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !196, line: 482, column: 3)
!371 = distinct !DILexicalBlock(scope: !368, file: !196, line: 481, column: 20)
!372 = !DILocation(line: 482, column: 8, scope: !370)
!373 = !DILocation(line: 482, column: 15, scope: !374)
!374 = !DILexicalBlockFile(scope: !375, file: !196, discriminator: 1)
!375 = distinct !DILexicalBlock(scope: !370, file: !196, line: 482, column: 3)
!376 = !DILocation(line: 482, column: 17, scope: !374)
!377 = !DILocation(line: 482, column: 3, scope: !374)
!378 = !DILocation(line: 483, column: 81, scope: !375)
!379 = !DILocation(line: 483, column: 73, scope: !375)
!380 = !DILocation(line: 483, column: 72, scope: !375)
!381 = !DILocation(line: 483, column: 42, scope: !375)
!382 = !DILocation(line: 483, column: 37, scope: !375)
!383 = !DILocation(line: 483, column: 25, scope: !375)
!384 = !DILocation(line: 483, column: 31, scope: !375)
!385 = !DILocation(line: 483, column: 40, scope: !375)
!386 = !DILocation(line: 482, column: 23, scope: !387)
!387 = !DILexicalBlockFile(scope: !375, file: !196, discriminator: 2)
!388 = !DILocation(line: 482, column: 3, scope: !387)
!389 = distinct !{!389, !390}
!390 = !DILocation(line: 482, column: 3, scope: !371)
!391 = !DILocation(line: 484, column: 2, scope: !371)
!392 = !DILocation(line: 486, column: 6, scope: !393)
!393 = distinct !DILexicalBlock(scope: !195, file: !196, line: 486, column: 6)
!394 = !DILocation(line: 486, column: 12, scope: !393)
!395 = !DILocation(line: 486, column: 6, scope: !195)
!396 = !DILocation(line: 487, column: 10, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !196, line: 487, column: 3)
!398 = distinct !DILexicalBlock(scope: !393, file: !196, line: 486, column: 22)
!399 = !DILocation(line: 487, column: 8, scope: !397)
!400 = !DILocation(line: 487, column: 15, scope: !401)
!401 = !DILexicalBlockFile(scope: !402, file: !196, discriminator: 1)
!402 = distinct !DILexicalBlock(scope: !397, file: !196, line: 487, column: 3)
!403 = !DILocation(line: 487, column: 19, scope: !401)
!404 = !DILocation(line: 487, column: 25, scope: !401)
!405 = !DILocation(line: 487, column: 17, scope: !401)
!406 = !DILocation(line: 487, column: 3, scope: !401)
!407 = !DILocation(line: 488, column: 12, scope: !408)
!408 = distinct !DILexicalBlock(scope: !402, file: !196, line: 487, column: 41)
!409 = !DILocation(line: 488, column: 14, scope: !408)
!410 = !DILocation(line: 488, column: 29, scope: !411)
!411 = !DILexicalBlockFile(scope: !408, file: !196, discriminator: 1)
!412 = !DILocation(line: 488, column: 21, scope: !411)
!413 = !DILocation(line: 488, column: 12, scope: !411)
!414 = !DILocation(line: 488, column: 34, scope: !415)
!415 = !DILexicalBlockFile(scope: !408, file: !196, discriminator: 2)
!416 = !DILocation(line: 488, column: 12, scope: !415)
!417 = !DILocation(line: 488, column: 12, scope: !418)
!418 = !DILexicalBlockFile(scope: !408, file: !196, discriminator: 3)
!419 = !DILocation(line: 488, column: 10, scope: !418)
!420 = !DILocation(line: 489, column: 36, scope: !408)
!421 = !DILocation(line: 489, column: 42, scope: !408)
!422 = !DILocation(line: 489, column: 52, scope: !408)
!423 = !DILocation(line: 489, column: 30, scope: !408)
!424 = !DILocation(line: 489, column: 21, scope: !411)
!425 = !DILocation(line: 489, column: 16, scope: !408)
!426 = !DILocation(line: 489, column: 4, scope: !408)
!427 = !DILocation(line: 489, column: 10, scope: !408)
!428 = !DILocation(line: 489, column: 19, scope: !408)
!429 = !DILocation(line: 490, column: 3, scope: !408)
!430 = !DILocation(line: 487, column: 37, scope: !431)
!431 = !DILexicalBlockFile(scope: !402, file: !196, discriminator: 2)
!432 = !DILocation(line: 487, column: 3, scope: !431)
!433 = distinct !{!433, !434}
!434 = !DILocation(line: 487, column: 3, scope: !398)
!435 = !DILocation(line: 491, column: 2, scope: !398)
!436 = !DILocation(line: 491, column: 13, scope: !437)
!437 = !DILexicalBlockFile(scope: !438, file: !196, discriminator: 1)
!438 = distinct !DILexicalBlock(scope: !393, file: !196, line: 491, column: 13)
!439 = !DILocation(line: 491, column: 19, scope: !437)
!440 = !DILocation(line: 492, column: 10, scope: !441)
!441 = distinct !DILexicalBlock(scope: !442, file: !196, line: 492, column: 3)
!442 = distinct !DILexicalBlock(scope: !438, file: !196, line: 491, column: 28)
!443 = !DILocation(line: 492, column: 8, scope: !441)
!444 = !DILocation(line: 492, column: 15, scope: !445)
!445 = !DILexicalBlockFile(scope: !446, file: !196, discriminator: 1)
!446 = distinct !DILexicalBlock(scope: !441, file: !196, line: 492, column: 3)
!447 = !DILocation(line: 492, column: 19, scope: !445)
!448 = !DILocation(line: 492, column: 25, scope: !445)
!449 = !DILocation(line: 492, column: 17, scope: !445)
!450 = !DILocation(line: 492, column: 3, scope: !445)
!451 = !DILocation(line: 493, column: 57, scope: !446)
!452 = !DILocation(line: 493, column: 63, scope: !446)
!453 = !DILocation(line: 493, column: 72, scope: !446)
!454 = !DILocation(line: 493, column: 51, scope: !446)
!455 = !DILocation(line: 493, column: 42, scope: !445)
!456 = !DILocation(line: 493, column: 37, scope: !446)
!457 = !DILocation(line: 493, column: 25, scope: !446)
!458 = !DILocation(line: 493, column: 31, scope: !446)
!459 = !DILocation(line: 493, column: 40, scope: !446)
!460 = !DILocation(line: 492, column: 37, scope: !461)
!461 = !DILexicalBlockFile(scope: !446, file: !196, discriminator: 2)
!462 = !DILocation(line: 492, column: 3, scope: !461)
!463 = distinct !{!463, !464}
!464 = !DILocation(line: 492, column: 3, scope: !442)
!465 = !DILocation(line: 494, column: 2, scope: !442)
!466 = !DILocation(line: 494, column: 13, scope: !467)
!467 = !DILexicalBlockFile(scope: !468, file: !196, discriminator: 1)
!468 = distinct !DILexicalBlock(scope: !438, file: !196, line: 494, column: 13)
!469 = !DILocation(line: 495, column: 10, scope: !470)
!470 = distinct !DILexicalBlock(scope: !471, file: !196, line: 495, column: 3)
!471 = distinct !DILexicalBlock(scope: !468, file: !196, line: 494, column: 20)
!472 = !DILocation(line: 495, column: 8, scope: !470)
!473 = !DILocation(line: 495, column: 15, scope: !474)
!474 = !DILexicalBlockFile(scope: !475, file: !196, discriminator: 1)
!475 = distinct !DILexicalBlock(scope: !470, file: !196, line: 495, column: 3)
!476 = !DILocation(line: 495, column: 17, scope: !474)
!477 = !DILocation(line: 495, column: 3, scope: !474)
!478 = !DILocation(line: 496, column: 81, scope: !475)
!479 = !DILocation(line: 496, column: 73, scope: !475)
!480 = !DILocation(line: 496, column: 72, scope: !475)
!481 = !DILocation(line: 496, column: 42, scope: !475)
!482 = !DILocation(line: 496, column: 37, scope: !475)
!483 = !DILocation(line: 496, column: 25, scope: !475)
!484 = !DILocation(line: 496, column: 31, scope: !475)
!485 = !DILocation(line: 496, column: 40, scope: !475)
!486 = !DILocation(line: 495, column: 23, scope: !487)
!487 = !DILexicalBlockFile(scope: !475, file: !196, discriminator: 2)
!488 = !DILocation(line: 495, column: 3, scope: !487)
!489 = distinct !{!489, !490}
!490 = !DILocation(line: 495, column: 3, scope: !471)
!491 = !DILocation(line: 497, column: 2, scope: !471)
!492 = !DILocation(line: 498, column: 1, scope: !195)
!493 = distinct !DISubprogram(name: "terminfo_colors_deinit", scope: !196, file: !196, line: 431, type: !32, isLocal: true, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!494 = !DILocalVariable(name: "term", arg: 1, scope: !493, file: !196, line: 431, type: !8)
!495 = !DILocation(line: 431, column: 46, scope: !493)
!496 = !DILocalVariable(name: "i", scope: !493, file: !196, line: 433, type: !17)
!497 = !DILocation(line: 433, column: 6, scope: !493)
!498 = !DILocation(line: 435, column: 7, scope: !499)
!499 = distinct !DILexicalBlock(scope: !493, file: !196, line: 435, column: 6)
!500 = !DILocation(line: 435, column: 13, scope: !499)
!501 = !DILocation(line: 435, column: 19, scope: !499)
!502 = !DILocation(line: 435, column: 6, scope: !493)
!503 = !DILocation(line: 436, column: 10, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !196, line: 436, column: 3)
!505 = distinct !DILexicalBlock(scope: !499, file: !196, line: 435, column: 8)
!506 = !DILocation(line: 436, column: 8, scope: !504)
!507 = !DILocation(line: 436, column: 15, scope: !508)
!508 = !DILexicalBlockFile(scope: !509, file: !196, discriminator: 1)
!509 = distinct !DILexicalBlock(scope: !504, file: !196, line: 436, column: 3)
!510 = !DILocation(line: 436, column: 19, scope: !508)
!511 = !DILocation(line: 436, column: 25, scope: !508)
!512 = !DILocation(line: 436, column: 17, scope: !508)
!513 = !DILocation(line: 436, column: 3, scope: !508)
!514 = !DILocation(line: 437, column: 23, scope: !515)
!515 = distinct !DILexicalBlock(scope: !509, file: !196, line: 436, column: 41)
!516 = !DILocation(line: 437, column: 11, scope: !515)
!517 = !DILocation(line: 437, column: 17, scope: !515)
!518 = !DILocation(line: 437, column: 4, scope: !515)
!519 = !DILocation(line: 438, column: 23, scope: !515)
!520 = !DILocation(line: 438, column: 11, scope: !515)
!521 = !DILocation(line: 438, column: 17, scope: !515)
!522 = !DILocation(line: 438, column: 4, scope: !515)
!523 = !DILocation(line: 439, column: 3, scope: !515)
!524 = !DILocation(line: 436, column: 37, scope: !525)
!525 = !DILexicalBlockFile(scope: !509, file: !196, discriminator: 2)
!526 = !DILocation(line: 436, column: 3, scope: !525)
!527 = distinct !{!527, !528}
!528 = !DILocation(line: 436, column: 3, scope: !505)
!529 = !DILocation(line: 441, column: 3, scope: !505)
!530 = distinct !{!530, !529}
!531 = !DILocation(line: 441, column: 12, scope: !532)
!532 = !DILexicalBlockFile(scope: !533, file: !196, discriminator: 1)
!533 = distinct !DILexicalBlock(scope: !534, file: !196, line: 441, column: 12)
!534 = distinct !DILexicalBlock(scope: !505, file: !196, line: 441, column: 6)
!535 = !DILocation(line: 441, column: 18, scope: !532)
!536 = !DILocation(line: 441, column: 34, scope: !537)
!537 = !DILexicalBlockFile(scope: !538, file: !196, discriminator: 2)
!538 = distinct !DILexicalBlock(scope: !533, file: !196, line: 441, column: 25)
!539 = !DILocation(line: 441, column: 40, scope: !537)
!540 = !DILocation(line: 441, column: 27, scope: !537)
!541 = !DILocation(line: 441, column: 49, scope: !537)
!542 = !DILocation(line: 441, column: 55, scope: !537)
!543 = !DILocation(line: 441, column: 62, scope: !537)
!544 = !DILocation(line: 441, column: 4, scope: !537)
!545 = !DILocation(line: 441, column: 6, scope: !546)
!546 = !DILexicalBlockFile(scope: !534, file: !196, discriminator: 3)
!547 = !DILocation(line: 442, column: 3, scope: !505)
!548 = distinct !{!548, !547}
!549 = !DILocation(line: 442, column: 12, scope: !550)
!550 = !DILexicalBlockFile(scope: !551, file: !196, discriminator: 1)
!551 = distinct !DILexicalBlock(scope: !552, file: !196, line: 442, column: 12)
!552 = distinct !DILexicalBlock(scope: !505, file: !196, line: 442, column: 6)
!553 = !DILocation(line: 442, column: 18, scope: !550)
!554 = !DILocation(line: 442, column: 34, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !196, discriminator: 2)
!556 = distinct !DILexicalBlock(scope: !551, file: !196, line: 442, column: 25)
!557 = !DILocation(line: 442, column: 40, scope: !555)
!558 = !DILocation(line: 442, column: 27, scope: !555)
!559 = !DILocation(line: 442, column: 49, scope: !555)
!560 = !DILocation(line: 442, column: 55, scope: !555)
!561 = !DILocation(line: 442, column: 62, scope: !555)
!562 = !DILocation(line: 442, column: 4, scope: !555)
!563 = !DILocation(line: 442, column: 6, scope: !564)
!564 = !DILexicalBlockFile(scope: !552, file: !196, discriminator: 3)
!565 = !DILocation(line: 443, column: 2, scope: !505)
!566 = !DILocation(line: 444, column: 1, scope: !493)
!567 = distinct !DISubprogram(name: "_set_fg", scope: !196, file: !196, line: 363, type: !24, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!568 = !DILocalVariable(name: "term", arg: 1, scope: !567, file: !196, line: 363, type: !8)
!569 = !DILocation(line: 363, column: 31, scope: !567)
!570 = !DILocalVariable(name: "color", arg: 2, scope: !567, file: !196, line: 363, type: !17)
!571 = !DILocation(line: 363, column: 41, scope: !567)
!572 = !DILocation(line: 365, column: 35, scope: !567)
!573 = !DILocation(line: 365, column: 41, scope: !567)
!574 = !DILocation(line: 365, column: 26, scope: !567)
!575 = !DILocation(line: 365, column: 14, scope: !567)
!576 = !DILocation(line: 365, column: 20, scope: !567)
!577 = !DILocation(line: 365, column: 8, scope: !578)
!578 = !DILexicalBlockFile(scope: !567, file: !196, discriminator: 1)
!579 = !DILocation(line: 365, column: 2, scope: !580)
!580 = !DILexicalBlockFile(scope: !567, file: !196, discriminator: 2)
!581 = !DILocation(line: 366, column: 1, scope: !567)
!582 = distinct !DISubprogram(name: "_set_bg", scope: !196, file: !196, line: 369, type: !24, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!583 = !DILocalVariable(name: "term", arg: 1, scope: !582, file: !196, line: 369, type: !8)
!584 = !DILocation(line: 369, column: 31, scope: !582)
!585 = !DILocalVariable(name: "color", arg: 2, scope: !582, file: !196, line: 369, type: !17)
!586 = !DILocation(line: 369, column: 41, scope: !582)
!587 = !DILocation(line: 371, column: 35, scope: !582)
!588 = !DILocation(line: 371, column: 41, scope: !582)
!589 = !DILocation(line: 371, column: 26, scope: !582)
!590 = !DILocation(line: 371, column: 14, scope: !582)
!591 = !DILocation(line: 371, column: 20, scope: !582)
!592 = !DILocation(line: 371, column: 8, scope: !593)
!593 = !DILexicalBlockFile(scope: !582, file: !196, discriminator: 1)
!594 = !DILocation(line: 371, column: 2, scope: !595)
!595 = !DILexicalBlockFile(scope: !582, file: !196, discriminator: 2)
!596 = !DILocation(line: 372, column: 1, scope: !582)
!597 = distinct !DISubprogram(name: "_ignore_parm", scope: !196, file: !196, line: 384, type: !24, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!598 = !DILocalVariable(name: "term", arg: 1, scope: !597, file: !196, line: 384, type: !8)
!599 = !DILocation(line: 384, column: 36, scope: !597)
!600 = !DILocalVariable(name: "param", arg: 2, scope: !597, file: !196, line: 384, type: !17)
!601 = !DILocation(line: 384, column: 46, scope: !597)
!602 = !DILocation(line: 386, column: 1, scope: !597)
!603 = distinct !DISubprogram(name: "terminfo_cont", scope: !196, file: !196, line: 534, type: !32, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!604 = !DILocalVariable(name: "term", arg: 1, scope: !603, file: !196, line: 534, type: !8)
!605 = !DILocation(line: 534, column: 30, scope: !603)
!606 = !DILocation(line: 536, column: 6, scope: !607)
!607 = distinct !DILexicalBlock(scope: !603, file: !196, line: 536, column: 6)
!608 = !DILocation(line: 536, column: 12, scope: !607)
!609 = !DILocation(line: 536, column: 6, scope: !603)
!610 = !DILocation(line: 537, column: 15, scope: !607)
!611 = !DILocation(line: 537, column: 21, scope: !607)
!612 = !DILocation(line: 537, column: 9, scope: !607)
!613 = !DILocation(line: 537, column: 3, scope: !614)
!614 = !DILexicalBlockFile(scope: !607, file: !196, discriminator: 1)
!615 = !DILocation(line: 537, column: 3, scope: !607)
!616 = !DILocation(line: 539, column: 6, scope: !617)
!617 = distinct !DILexicalBlock(scope: !603, file: !196, line: 539, column: 6)
!618 = !DILocation(line: 539, column: 12, scope: !617)
!619 = !DILocation(line: 539, column: 6, scope: !603)
!620 = !DILocation(line: 540, column: 28, scope: !617)
!621 = !DILocation(line: 540, column: 3, scope: !617)
!622 = !DILocation(line: 542, column: 6, scope: !623)
!623 = distinct !DILexicalBlock(scope: !603, file: !196, line: 542, column: 6)
!624 = !DILocation(line: 542, column: 12, scope: !623)
!625 = !DILocation(line: 542, column: 6, scope: !603)
!626 = !DILocation(line: 543, column: 3, scope: !623)
!627 = !DILocation(line: 545, column: 29, scope: !603)
!628 = !DILocation(line: 545, column: 9, scope: !603)
!629 = !DILocation(line: 546, column: 1, scope: !603)
!630 = distinct !DISubprogram(name: "term_putchar", scope: !196, file: !196, line: 10, type: !631, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!631 = !DISubroutineType(types: !632)
!632 = !{!17, !17}
!633 = !DILocalVariable(name: "c", arg: 1, scope: !630, file: !196, line: 10, type: !17)
!634 = !DILocation(line: 10, column: 36, scope: !630)
!635 = !DILocation(line: 12, column: 22, scope: !630)
!636 = !DILocation(line: 12, column: 25, scope: !630)
!637 = !DILocation(line: 12, column: 39, scope: !630)
!638 = !DILocation(line: 12, column: 16, scope: !630)
!639 = !DILocation(line: 12, column: 9, scope: !630)
!640 = distinct !DISubprogram(name: "terminfo_set_appkey_mode", scope: !196, file: !196, line: 388, type: !24, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!641 = !DILocalVariable(name: "term", arg: 1, scope: !640, file: !196, line: 388, type: !8)
!642 = !DILocation(line: 388, column: 48, scope: !640)
!643 = !DILocalVariable(name: "set", arg: 2, scope: !640, file: !196, line: 388, type: !17)
!644 = !DILocation(line: 388, column: 58, scope: !640)
!645 = !DILocation(line: 390, column: 6, scope: !646)
!646 = distinct !DILexicalBlock(scope: !640, file: !196, line: 390, column: 6)
!647 = !DILocation(line: 390, column: 12, scope: !646)
!648 = !DILocation(line: 390, column: 20, scope: !646)
!649 = !DILocation(line: 390, column: 23, scope: !650)
!650 = !DILexicalBlockFile(scope: !646, file: !196, discriminator: 1)
!651 = !DILocation(line: 390, column: 29, scope: !650)
!652 = !DILocation(line: 390, column: 6, scope: !650)
!653 = !DILocation(line: 391, column: 15, scope: !646)
!654 = !DILocation(line: 391, column: 21, scope: !650)
!655 = !DILocation(line: 391, column: 27, scope: !650)
!656 = !DILocation(line: 391, column: 15, scope: !650)
!657 = !DILocation(line: 391, column: 37, scope: !658)
!658 = !DILexicalBlockFile(scope: !646, file: !196, discriminator: 2)
!659 = !DILocation(line: 391, column: 43, scope: !658)
!660 = !DILocation(line: 391, column: 15, scope: !658)
!661 = !DILocation(line: 391, column: 15, scope: !662)
!662 = !DILexicalBlockFile(scope: !646, file: !196, discriminator: 3)
!663 = !DILocation(line: 391, column: 9, scope: !662)
!664 = !DILocation(line: 391, column: 3, scope: !665)
!665 = !DILexicalBlockFile(scope: !662, file: !196, discriminator: 4)
!666 = !DILocation(line: 391, column: 3, scope: !662)
!667 = !DILocation(line: 392, column: 1, scope: !640)
!668 = distinct !DISubprogram(name: "term_dec_set_bracketed_paste_mode", scope: !196, file: !196, line: 394, type: !669, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !17}
!671 = !DILocalVariable(name: "enable", arg: 1, scope: !668, file: !196, line: 394, type: !17)
!672 = !DILocation(line: 394, column: 51, scope: !668)
!673 = !DILocation(line: 396, column: 6, scope: !674)
!674 = distinct !DILexicalBlock(scope: !668, file: !196, line: 396, column: 6)
!675 = !DILocation(line: 396, column: 6, scope: !668)
!676 = !DILocation(line: 397, column: 3, scope: !674)
!677 = !DILocation(line: 399, column: 3, scope: !674)
!678 = !DILocation(line: 400, column: 1, scope: !668)
!679 = distinct !DISubprogram(name: "terminfo_input_init", scope: !196, file: !196, line: 524, type: !32, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!680 = !DILocalVariable(name: "term", arg: 1, scope: !679, file: !196, line: 524, type: !8)
!681 = !DILocation(line: 524, column: 43, scope: !679)
!682 = !DILocation(line: 526, column: 26, scope: !679)
!683 = !DILocation(line: 526, column: 32, scope: !679)
!684 = !DILocation(line: 526, column: 19, scope: !679)
!685 = !DILocation(line: 526, column: 48, scope: !679)
!686 = !DILocation(line: 526, column: 54, scope: !679)
!687 = !DILocation(line: 526, column: 9, scope: !688)
!688 = !DILexicalBlockFile(scope: !679, file: !196, discriminator: 1)
!689 = !DILocation(line: 527, column: 1, scope: !679)
!690 = distinct !DISubprogram(name: "terminfo_stop", scope: !196, file: !196, line: 548, type: !32, isLocal: false, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!691 = !DILocalVariable(name: "term", arg: 1, scope: !690, file: !196, line: 548, type: !8)
!692 = !DILocation(line: 548, column: 30, scope: !690)
!693 = !DILocation(line: 551, column: 2, scope: !690)
!694 = !DILocation(line: 551, column: 16, scope: !690)
!695 = !DILocation(line: 551, column: 27, scope: !690)
!696 = !DILocation(line: 553, column: 2, scope: !690)
!697 = !DILocation(line: 553, column: 16, scope: !690)
!698 = !DILocation(line: 553, column: 21, scope: !690)
!699 = !DILocation(line: 553, column: 38, scope: !690)
!700 = !DILocation(line: 553, column: 44, scope: !690)
!701 = !DILocation(line: 553, column: 50, scope: !690)
!702 = !DILocation(line: 555, column: 6, scope: !703)
!703 = distinct !DILexicalBlock(scope: !690, file: !196, line: 555, column: 6)
!704 = !DILocation(line: 555, column: 12, scope: !703)
!705 = !DILocation(line: 555, column: 6, scope: !690)
!706 = !DILocation(line: 556, column: 3, scope: !703)
!707 = !DILocation(line: 559, column: 6, scope: !708)
!708 = distinct !DILexicalBlock(scope: !690, file: !196, line: 559, column: 6)
!709 = !DILocation(line: 559, column: 12, scope: !708)
!710 = !DILocation(line: 559, column: 6, scope: !690)
!711 = !DILocation(line: 560, column: 15, scope: !708)
!712 = !DILocation(line: 560, column: 21, scope: !708)
!713 = !DILocation(line: 560, column: 9, scope: !708)
!714 = !DILocation(line: 560, column: 3, scope: !715)
!715 = !DILexicalBlockFile(scope: !708, file: !196, discriminator: 1)
!716 = !DILocation(line: 560, column: 3, scope: !708)
!717 = !DILocation(line: 562, column: 6, scope: !718)
!718 = distinct !DILexicalBlock(scope: !690, file: !196, line: 562, column: 6)
!719 = !DILocation(line: 562, column: 12, scope: !718)
!720 = !DILocation(line: 562, column: 6, scope: !690)
!721 = !DILocation(line: 563, column: 28, scope: !718)
!722 = !DILocation(line: 563, column: 3, scope: !718)
!723 = !DILocation(line: 566, column: 24, scope: !690)
!724 = !DILocation(line: 566, column: 2, scope: !690)
!725 = !DILocation(line: 567, column: 16, scope: !690)
!726 = !DILocation(line: 567, column: 22, scope: !690)
!727 = !DILocation(line: 567, column: 9, scope: !690)
!728 = !DILocation(line: 568, column: 1, scope: !690)
!729 = distinct !DISubprogram(name: "terminfo_input_deinit", scope: !196, file: !196, line: 529, type: !32, isLocal: true, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!730 = !DILocalVariable(name: "term", arg: 1, scope: !729, file: !196, line: 529, type: !8)
!731 = !DILocation(line: 529, column: 45, scope: !729)
!732 = !DILocation(line: 531, column: 26, scope: !729)
!733 = !DILocation(line: 531, column: 32, scope: !729)
!734 = !DILocation(line: 531, column: 19, scope: !729)
!735 = !DILocation(line: 531, column: 48, scope: !729)
!736 = !DILocation(line: 531, column: 54, scope: !729)
!737 = !DILocation(line: 531, column: 9, scope: !738)
!738 = !DILexicalBlockFile(scope: !729, file: !196, discriminator: 1)
!739 = !DILocation(line: 532, column: 1, scope: !729)
!740 = distinct !DISubprogram(name: "term_set_appkey_mode", scope: !196, file: !196, line: 681, type: !669, isLocal: false, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!741 = !DILocalVariable(name: "enable", arg: 1, scope: !740, file: !196, line: 681, type: !17)
!742 = !DILocation(line: 681, column: 31, scope: !740)
!743 = !DILocation(line: 683, column: 6, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !196, line: 683, column: 6)
!745 = !DILocation(line: 683, column: 20, scope: !744)
!746 = !DILocation(line: 683, column: 38, scope: !744)
!747 = !DILocation(line: 683, column: 35, scope: !744)
!748 = !DILocation(line: 683, column: 6, scope: !740)
!749 = !DILocation(line: 684, column: 3, scope: !744)
!750 = !DILocation(line: 686, column: 33, scope: !740)
!751 = !DILocation(line: 686, column: 2, scope: !740)
!752 = !DILocation(line: 686, column: 16, scope: !740)
!753 = !DILocation(line: 686, column: 31, scope: !740)
!754 = !DILocation(line: 687, column: 27, scope: !740)
!755 = !DILocation(line: 687, column: 41, scope: !740)
!756 = !DILocation(line: 687, column: 2, scope: !740)
!757 = !DILocation(line: 688, column: 1, scope: !740)
!758 = !DILocation(line: 688, column: 1, scope: !759)
!759 = !DILexicalBlockFile(scope: !740, file: !196, discriminator: 1)
!760 = distinct !DISubprogram(name: "term_set_bracketed_paste_mode", scope: !196, file: !196, line: 690, type: !669, isLocal: false, isDefinition: true, scopeLine: 691, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!761 = !DILocalVariable(name: "enable", arg: 1, scope: !760, file: !196, line: 690, type: !17)
!762 = !DILocation(line: 690, column: 40, scope: !760)
!763 = !DILocation(line: 692, column: 6, scope: !764)
!764 = distinct !DILexicalBlock(scope: !760, file: !196, line: 692, column: 6)
!765 = !DILocation(line: 692, column: 20, scope: !764)
!766 = !DILocation(line: 692, column: 47, scope: !764)
!767 = !DILocation(line: 692, column: 44, scope: !764)
!768 = !DILocation(line: 692, column: 6, scope: !760)
!769 = !DILocation(line: 693, column: 3, scope: !764)
!770 = !DILocation(line: 695, column: 42, scope: !760)
!771 = !DILocation(line: 695, column: 2, scope: !760)
!772 = !DILocation(line: 695, column: 16, scope: !760)
!773 = !DILocation(line: 695, column: 40, scope: !760)
!774 = !DILocation(line: 696, column: 36, scope: !760)
!775 = !DILocation(line: 696, column: 2, scope: !760)
!776 = !DILocation(line: 697, column: 1, scope: !760)
!777 = !DILocation(line: 697, column: 1, scope: !778)
!778 = !DILexicalBlockFile(scope: !760, file: !196, discriminator: 1)
!779 = distinct !DISubprogram(name: "terminfo_core_init", scope: !196, file: !196, line: 699, type: !780, isLocal: false, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!780 = !DISubroutineType(types: !781)
!781 = !{!8, !55, !55}
!782 = !DILocalVariable(name: "in", arg: 1, scope: !779, file: !196, line: 699, type: !55)
!783 = !DILocation(line: 699, column: 36, scope: !779)
!784 = !DILocalVariable(name: "out", arg: 2, scope: !779, file: !196, line: 699, type: !55)
!785 = !DILocation(line: 699, column: 46, scope: !779)
!786 = !DILocalVariable(name: "old_term", scope: !779, file: !196, line: 701, type: !8)
!787 = !DILocation(line: 701, column: 12, scope: !779)
!788 = !DILocalVariable(name: "term", scope: !779, file: !196, line: 701, type: !8)
!789 = !DILocation(line: 701, column: 23, scope: !779)
!790 = !DILocation(line: 703, column: 20, scope: !779)
!791 = !DILocation(line: 703, column: 18, scope: !779)
!792 = !DILocation(line: 704, column: 38, scope: !779)
!793 = !DILocation(line: 704, column: 25, scope: !779)
!794 = !DILocation(line: 704, column: 22, scope: !779)
!795 = !DILocation(line: 704, column: 15, scope: !779)
!796 = !DILocation(line: 706, column: 13, scope: !779)
!797 = !DILocation(line: 706, column: 2, scope: !779)
!798 = !DILocation(line: 706, column: 8, scope: !779)
!799 = !DILocation(line: 706, column: 11, scope: !779)
!800 = !DILocation(line: 707, column: 14, scope: !779)
!801 = !DILocation(line: 707, column: 2, scope: !779)
!802 = !DILocation(line: 707, column: 8, scope: !779)
!803 = !DILocation(line: 707, column: 12, scope: !779)
!804 = !DILocation(line: 709, column: 18, scope: !805)
!805 = distinct !DILexicalBlock(scope: !779, file: !196, line: 709, column: 6)
!806 = !DILocation(line: 709, column: 7, scope: !805)
!807 = !DILocation(line: 709, column: 6, scope: !779)
!808 = !DILocation(line: 710, column: 10, scope: !809)
!809 = distinct !DILexicalBlock(scope: !805, file: !196, line: 709, column: 25)
!810 = !DILocation(line: 710, column: 3, scope: !809)
!811 = !DILocation(line: 711, column: 22, scope: !809)
!812 = !DILocation(line: 712, column: 2, scope: !809)
!813 = !DILocation(line: 714, column: 17, scope: !779)
!814 = !DILocation(line: 714, column: 15, scope: !779)
!815 = !DILocation(line: 715, column: 16, scope: !779)
!816 = !DILocation(line: 715, column: 9, scope: !779)
!817 = distinct !DISubprogram(name: "term_setup", scope: !196, file: !196, line: 570, type: !818, isLocal: true, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!818 = !DISubroutineType(types: !819)
!819 = !{!17, !8}
!820 = !DILocalVariable(name: "term", arg: 1, scope: !817, file: !196, line: 570, type: !8)
!821 = !DILocation(line: 570, column: 33, scope: !817)
!822 = !DILocalVariable(name: "str", scope: !817, file: !196, line: 572, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !825, line: 39, baseType: !826)
!825 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !825, line: 41, size: 192, align: 64, elements: !827)
!827 = !{!828, !831, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !826, file: !825, line: 43, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !187, line: 46, baseType: !7)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !826, file: !825, line: 44, baseType: !832, size: 64, align: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !190, line: 66, baseType: !108)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !826, file: !825, line: 45, baseType: !832, size: 64, align: 64, offset: 128)
!834 = !DILocation(line: 572, column: 11, scope: !817)
!835 = !DILocalVariable(name: "err", scope: !817, file: !196, line: 573, type: !17)
!836 = !DILocation(line: 573, column: 6, scope: !817)
!837 = !DILocalVariable(name: "term_env", scope: !817, file: !196, line: 574, type: !6)
!838 = !DILocation(line: 574, column: 15, scope: !817)
!839 = !DILocation(line: 576, column: 13, scope: !817)
!840 = !DILocation(line: 576, column: 11, scope: !817)
!841 = !DILocation(line: 577, column: 6, scope: !842)
!842 = distinct !DILexicalBlock(scope: !817, file: !196, line: 577, column: 6)
!843 = !DILocation(line: 577, column: 15, scope: !842)
!844 = !DILocation(line: 577, column: 6, scope: !817)
!845 = !DILocation(line: 578, column: 10, scope: !846)
!846 = distinct !DILexicalBlock(scope: !842, file: !196, line: 577, column: 23)
!847 = !DILocation(line: 578, column: 3, scope: !846)
!848 = !DILocation(line: 579, column: 17, scope: !846)
!849 = !DILocation(line: 582, column: 16, scope: !850)
!850 = distinct !DILexicalBlock(scope: !817, file: !196, line: 582, column: 6)
!851 = !DILocation(line: 582, column: 6, scope: !850)
!852 = !DILocation(line: 582, column: 35, scope: !850)
!853 = !DILocation(line: 582, column: 6, scope: !817)
!854 = !DILocation(line: 583, column: 10, scope: !855)
!855 = distinct !DILexicalBlock(scope: !850, file: !196, line: 582, column: 41)
!856 = !DILocation(line: 583, column: 58, scope: !855)
!857 = !DILocation(line: 583, column: 68, scope: !855)
!858 = !DILocation(line: 583, column: 3, scope: !855)
!859 = !DILocation(line: 584, column: 3, scope: !855)
!860 = !DILocation(line: 587, column: 32, scope: !817)
!861 = !DILocation(line: 587, column: 9, scope: !817)
!862 = !DILocation(line: 590, column: 6, scope: !863)
!863 = distinct !DILexicalBlock(scope: !817, file: !196, line: 590, column: 6)
!864 = !DILocation(line: 590, column: 12, scope: !863)
!865 = !DILocation(line: 590, column: 6, scope: !817)
!866 = !DILocation(line: 591, column: 3, scope: !863)
!867 = !DILocation(line: 591, column: 9, scope: !863)
!868 = !DILocation(line: 591, column: 14, scope: !863)
!869 = !DILocation(line: 592, column: 11, scope: !870)
!870 = distinct !DILexicalBlock(scope: !863, file: !196, line: 592, column: 11)
!871 = !DILocation(line: 592, column: 17, scope: !870)
!872 = !DILocation(line: 592, column: 24, scope: !870)
!873 = !DILocation(line: 592, column: 27, scope: !874)
!874 = !DILexicalBlockFile(scope: !870, file: !196, discriminator: 1)
!875 = !DILocation(line: 592, column: 33, scope: !874)
!876 = !DILocation(line: 592, column: 11, scope: !874)
!877 = !DILocation(line: 593, column: 3, scope: !870)
!878 = !DILocation(line: 593, column: 9, scope: !870)
!879 = !DILocation(line: 593, column: 14, scope: !870)
!880 = !DILocation(line: 595, column: 24, scope: !881)
!881 = distinct !DILexicalBlock(scope: !870, file: !196, line: 594, column: 7)
!882 = !DILocation(line: 595, column: 17, scope: !881)
!883 = !DILocation(line: 596, column: 3, scope: !881)
!884 = !DILocation(line: 598, column: 2, scope: !817)
!885 = !DILocation(line: 598, column: 8, scope: !817)
!886 = !DILocation(line: 598, column: 22, scope: !817)
!887 = !DILocation(line: 599, column: 29, scope: !817)
!888 = !DILocation(line: 599, column: 35, scope: !817)
!889 = !DILocation(line: 599, column: 44, scope: !817)
!890 = !DILocation(line: 599, column: 47, scope: !891)
!891 = !DILexicalBlockFile(scope: !817, file: !196, discriminator: 1)
!892 = !DILocation(line: 599, column: 53, scope: !891)
!893 = !DILocation(line: 599, column: 44, scope: !891)
!894 = !DILocation(line: 599, column: 29, scope: !895)
!895 = !DILexicalBlockFile(scope: !817, file: !196, discriminator: 2)
!896 = !DILocation(line: 599, column: 2, scope: !895)
!897 = !DILocation(line: 599, column: 8, scope: !895)
!898 = !DILocation(line: 599, column: 27, scope: !895)
