; ModuleID = './line63-nicklist.o.i'
source_filename = "./line63-nicklist.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50)
!1 = !DIFile(filename: "line63-nicklist.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256)
!39 = !DIEnumerator(name: "_ISlower", value: 512)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!43 = !DIEnumerator(name: "_ISspace", value: 8192)
!44 = !DIEnumerator(name: "_ISprint", value: 16384)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768)
!46 = !DIEnumerator(name: "_ISblank", value: 1)
!47 = !DIEnumerator(name: "_IScntrl", value: 2)
!48 = !DIEnumerator(name: "_ISpunct", value: 4)
!49 = !DIEnumerator(name: "_ISalnum", value: 8)
!50 = !{!51, !52, !56, !58, !466, !75, !66, !470, !100, !471, !478, !483}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !60, line: 109, baseType: !61)
!60 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !62, line: 15, size: 1408, align: 64, elements: !63)
!62 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !{!64, !67, !68, !73, !74, !402, !403, !404, !405, !406, !407, !414, !418, !420, !421, !422, !423, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !65, line: 3, baseType: !66, size: 32, align: 32)
!65 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !61, file: !65, line: 4, baseType: !66, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !61, file: !65, line: 5, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !71, line: 37, baseType: !72)
!71 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !71, line: 37, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !61, file: !65, line: 7, baseType: !51, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !61, file: !65, line: 8, baseType: !75, size: 64, align: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !60, line: 107, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !78, line: 30, size: 2240, align: 64, elements: !79)
!78 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = !{!80, !82, !83, !84, !314, !319, !320, !321, !322, !323, !324, !325, !326, !327, !331, !332, !336, !337, !338, !342, !343, !344, !345, !346, !347, !348, !349, !350, !357, !358, !359, !360, !361, !365, !369, !373, !377, !381, !386, !390, !397, !401}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !81, line: 3, baseType: !66, size: 32, align: 32)
!81 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !77, file: !81, line: 4, baseType: !66, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !77, file: !81, line: 6, baseType: !66, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !77, file: !81, line: 8, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !60, line: 113, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !78, line: 25, size: 1920, align: 64, elements: !88)
!88 = !{!89, !91, !92, !93, !95, !96, !97, !98, !99, !101, !102, !103, !104, !105, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !90, line: 3, baseType: !66, size: 32, align: 32)
!90 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !87, file: !90, line: 4, baseType: !66, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !87, file: !90, line: 6, baseType: !66, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !87, file: !90, line: 9, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !87, file: !90, line: 10, baseType: !66, size: 32, align: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !87, file: !90, line: 13, baseType: !100, size: 16, align: 16, offset: 448)
!100 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !90, line: 14, baseType: !94, size: 64, align: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !87, file: !90, line: 15, baseType: !94, size: 64, align: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !87, file: !90, line: 16, baseType: !66, size: 32, align: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !87, file: !90, line: 17, baseType: !94, size: 64, align: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !87, file: !90, line: 19, baseType: !106, size: 64, align: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !60, line: 99, baseType: !108)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !60, line: 99, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !87, file: !90, line: 19, baseType: !106, size: 64, align: 64, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !87, file: !90, line: 21, baseType: !94, size: 64, align: 64, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !87, file: !90, line: 22, baseType: !94, size: 64, align: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !87, file: !90, line: 23, baseType: !94, size: 64, align: 64, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !87, file: !90, line: 24, baseType: !94, size: 64, align: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !87, file: !90, line: 26, baseType: !94, size: 64, align: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !87, file: !90, line: 27, baseType: !94, size: 64, align: 64, offset: 1216)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !87, file: !90, line: 28, baseType: !94, size: 64, align: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !87, file: !90, line: 29, baseType: !94, size: 64, align: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !87, file: !90, line: 30, baseType: !94, size: 64, align: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !87, file: !90, line: 31, baseType: !94, size: 64, align: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !87, file: !90, line: 32, baseType: !94, size: 64, align: 64, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !87, file: !90, line: 33, baseType: !94, size: 64, align: 64, offset: 1600)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !87, file: !90, line: 35, baseType: !123, size: 64, align: 64, offset: 1664)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !126)
!126 = !{!127, !129, !271, !272, !277, !278, !279, !280, !281, !290, !291, !292, !296, !297, !298, !299, !300, !301, !302, !303}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !125, file: !4, line: 100, baseType: !128, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !54, line: 49, baseType: !66)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !125, file: !4, line: 101, baseType: !130, size: 64, align: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !133)
!133 = !{!134, !156, !162, !169, !173, !258, !262, !267}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !132, file: !4, line: 133, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !123, !52, !139, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !140, line: 66, baseType: !141)
!140 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!141 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !146, line: 42, baseType: !147)
!146 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !146, line: 44, size: 128, align: 64, elements: !148)
!148 = !{!149, !154, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !147, file: !146, line: 46, baseType: !150, size: 32, align: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !151, line: 36, baseType: !152)
!151 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !140, line: 45, baseType: !153)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !147, file: !146, line: 47, baseType: !128, size: 32, align: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !147, file: !146, line: 48, baseType: !52, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !132, file: !4, line: 138, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!138, !123, !160, !139, !142, !143}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !132, file: !4, line: 143, baseType: !163, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!138, !123, !166, !168, !143}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !140, line: 51, baseType: !167)
!167 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !132, file: !4, line: 147, baseType: !170, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!138, !123, !143}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !132, file: !4, line: 149, baseType: !174, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!177, !123, !257}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !180)
!180 = !{!181, !183, !204, !233, !235, !239, !240, !241, !242, !250, !251, !252, !253}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !179, file: !16, line: 174, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !54, line: 77, baseType: !51)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !179, file: !16, line: 175, baseType: !184, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !187)
!187 = !{!188, !192, !193}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !186, file: !16, line: 198, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !182}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !186, file: !16, line: 199, baseType: !189, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !186, file: !16, line: 200, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !182, !177, !197, !203}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !182}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !54, line: 50, baseType: !128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !179, file: !16, line: 177, baseType: !205, size: 64, align: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !209)
!209 = !{!210, !215, !219, !223, !227, !228}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !208, file: !16, line: 216, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!202, !177, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !208, file: !16, line: 218, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!202, !177}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !208, file: !16, line: 219, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!202, !177, !198, !182}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !208, file: !16, line: 222, baseType: !224, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !177}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !208, file: !16, line: 226, baseType: !198, size: 64, align: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !208, file: !16, line: 227, baseType: !229, size: 64, align: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !179, file: !16, line: 178, baseType: !234, size: 32, align: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !54, line: 55, baseType: !153)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !179, file: !16, line: 180, baseType: !236, size: 64, align: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !179, file: !16, line: 182, baseType: !128, size: 32, align: 32, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !16, line: 183, baseType: !234, size: 32, align: 32, offset: 352)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !179, file: !16, line: 184, baseType: !234, size: 32, align: 32, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !179, file: !16, line: 186, baseType: !243, size: 64, align: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !245, line: 37, baseType: !246)
!245 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !245, line: 39, size: 128, align: 64, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !246, file: !245, line: 41, baseType: !182, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !246, file: !245, line: 42, baseType: !243, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !16, line: 188, baseType: !177, size: 64, align: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !16, line: 189, baseType: !177, size: 64, align: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !16, line: 191, baseType: !94, size: 64, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !179, file: !16, line: 193, baseType: !254, size: 64, align: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !132, file: !4, line: 151, baseType: !259, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !123}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !132, file: !4, line: 152, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!138, !123, !266, !143}
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !132, file: !4, line: 155, baseType: !268, size: 64, align: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!266, !123}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !125, file: !4, line: 103, baseType: !52, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !125, file: !4, line: 104, baseType: !273, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !274, line: 77, baseType: !275)
!274 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !274, line: 77, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !125, file: !4, line: 105, baseType: !273, size: 64, align: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !125, file: !4, line: 106, baseType: !52, size: 64, align: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !125, file: !4, line: 107, baseType: !234, size: 32, align: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !125, file: !4, line: 109, baseType: !139, size: 64, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !125, file: !4, line: 110, baseType: !282, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !284, line: 39, baseType: !285)
!284 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !284, line: 41, size: 192, align: 64, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !285, file: !284, line: 43, baseType: !52, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !285, file: !284, line: 44, baseType: !139, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !285, file: !284, line: 45, baseType: !139, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !125, file: !4, line: 111, baseType: !282, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !125, file: !4, line: 112, baseType: !282, size: 64, align: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !125, file: !4, line: 113, baseType: !293, size: 48, align: 8, offset: 704)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, align: 8, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 6)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !125, file: !4, line: 117, baseType: !234, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !125, file: !4, line: 118, baseType: !234, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !125, file: !4, line: 119, baseType: !234, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !125, file: !4, line: 120, baseType: !234, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !125, file: !4, line: 121, baseType: !234, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !125, file: !4, line: 122, baseType: !234, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !125, file: !4, line: 124, baseType: !182, size: 64, align: 64, offset: 768)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !125, file: !4, line: 125, baseType: !182, size: 64, align: 64, offset: 832)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !87, file: !90, line: 38, baseType: !153, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !87, file: !90, line: 39, baseType: !153, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !87, file: !90, line: 40, baseType: !153, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !87, file: !90, line: 41, baseType: !153, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !87, file: !90, line: 42, baseType: !153, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !87, file: !90, line: 43, baseType: !153, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !87, file: !90, line: 44, baseType: !153, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !87, file: !90, line: 45, baseType: !153, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !87, file: !90, line: 46, baseType: !94, size: 64, align: 64, offset: 1792)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !87, file: !90, line: 47, baseType: !94, size: 64, align: 64, offset: 1856)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !77, file: !81, line: 9, baseType: !315, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !316, line: 75, baseType: !317)
!316 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !318, line: 139, baseType: !167)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !77, file: !81, line: 10, baseType: !315, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !77, file: !81, line: 12, baseType: !94, size: 64, align: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !77, file: !81, line: 13, baseType: !94, size: 64, align: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !77, file: !81, line: 15, baseType: !153, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !77, file: !81, line: 16, baseType: !153, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !77, file: !81, line: 17, baseType: !153, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !77, file: !81, line: 18, baseType: !153, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !77, file: !81, line: 19, baseType: !153, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !77, file: !81, line: 21, baseType: !328, size: 64, align: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !60, line: 102, baseType: !330)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !60, line: 102, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !77, file: !81, line: 22, baseType: !66, size: 32, align: 32, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !77, file: !81, line: 25, baseType: !333, size: 128, align: 64, offset: 640)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, align: 64, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 2)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !77, file: !81, line: 26, baseType: !66, size: 32, align: 32, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !77, file: !81, line: 27, baseType: !66, size: 32, align: 32, offset: 800)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !77, file: !81, line: 29, baseType: !339, size: 64, align: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !60, line: 103, baseType: !341)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !60, line: 103, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !77, file: !81, line: 30, baseType: !69, size: 64, align: 64, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !81, line: 32, baseType: !94, size: 64, align: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !77, file: !81, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !77, file: !81, line: 34, baseType: !94, size: 64, align: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !77, file: !81, line: 35, baseType: !153, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !77, file: !81, line: 36, baseType: !153, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !77, file: !81, line: 37, baseType: !153, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !77, file: !81, line: 38, baseType: !153, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !77, file: !81, line: 40, baseType: !351, size: 128, align: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !54, line: 504, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !54, line: 506, size: 128, align: 64, elements: !353)
!353 = !{!354, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !352, file: !54, line: 508, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !54, line: 48, baseType: !167)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !352, file: !54, line: 509, baseType: !355, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !77, file: !81, line: 41, baseType: !315, size: 64, align: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !77, file: !81, line: 42, baseType: !66, size: 32, align: 32, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !77, file: !81, line: 44, baseType: !243, size: 64, align: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !77, file: !81, line: 45, baseType: !243, size: 64, align: 64, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !77, file: !81, line: 53, baseType: !362, size: 64, align: 64, offset: 1600)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !75, !56, !66}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !77, file: !81, line: 55, baseType: !366, size: 64, align: 64, offset: 1664)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!66, !75, !55}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !77, file: !81, line: 57, baseType: !370, size: 64, align: 64, offset: 1728)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!66, !75, !56}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !77, file: !81, line: 60, baseType: !374, size: 64, align: 64, offset: 1792)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!56, !75}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !77, file: !81, line: 62, baseType: !378, size: 64, align: 64, offset: 1856)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !75, !56, !56, !66}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !77, file: !81, line: 65, baseType: !382, size: 64, align: 64, offset: 1920)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !75, !56, !56}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !77, file: !81, line: 69, baseType: !387, size: 64, align: 64, offset: 1984)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!58, !75, !56}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !77, file: !81, line: 70, baseType: !391, size: 64, align: 64, offset: 2048)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !75, !56}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !60, line: 110, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !60, line: 110, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !77, file: !81, line: 71, baseType: !398, size: 64, align: 64, offset: 2112)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!66, !56, !56}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !77, file: !81, line: 73, baseType: !398, size: 64, align: 64, offset: 2176)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !61, file: !65, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !65, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !61, file: !65, line: 11, baseType: !315, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !61, file: !65, line: 12, baseType: !66, size: 32, align: 32, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !61, file: !65, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !61, file: !65, line: 15, baseType: !408, size: 64, align: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !60, line: 108, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !60, line: 108, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !61, file: !65, line: 17, baseType: !415, size: 64, align: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!56, !411}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !61, file: !419, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!419 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !61, file: !419, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !61, file: !419, line: 7, baseType: !315, size: 64, align: 64, offset: 832)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !61, file: !419, line: 9, baseType: !69, size: 64, align: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !61, file: !419, line: 10, baseType: !424, size: 64, align: 64, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !60, line: 111, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !427, line: 13, size: 576, align: 64, elements: !428)
!427 = !DIFile(filename: "nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!428 = !{!429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !447, !448}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !430, line: 3, baseType: !66, size: 32, align: 32)
!430 = !DIFile(filename: "nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !426, file: !430, line: 4, baseType: !66, size: 32, align: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !426, file: !430, line: 6, baseType: !315, size: 64, align: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !426, file: !430, line: 8, baseType: !94, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !426, file: !430, line: 9, baseType: !94, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !426, file: !430, line: 10, baseType: !94, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !426, file: !430, line: 11, baseType: !66, size: 32, align: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !426, file: !430, line: 14, baseType: !153, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !426, file: !430, line: 15, baseType: !153, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !426, file: !430, line: 18, baseType: !153, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !426, file: !430, line: 19, baseType: !153, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !426, file: !430, line: 20, baseType: !153, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !426, file: !430, line: 21, baseType: !153, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !426, file: !430, line: 22, baseType: !444, size: 64, align: 8, offset: 360)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, align: 8, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !426, file: !430, line: 26, baseType: !51, size: 64, align: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !430, line: 28, baseType: !424, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !61, file: !419, line: 12, baseType: !153, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !61, file: !419, line: 13, baseType: !94, size: 64, align: 64, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !61, file: !419, line: 14, baseType: !66, size: 32, align: 32, offset: 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !61, file: !419, line: 15, baseType: !94, size: 64, align: 64, offset: 1216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !61, file: !419, line: 17, baseType: !153, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !61, file: !419, line: 18, baseType: !153, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !61, file: !419, line: 19, baseType: !153, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !61, file: !419, line: 20, baseType: !153, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !61, file: !419, line: 22, baseType: !153, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !61, file: !419, line: 23, baseType: !153, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !61, file: !419, line: 24, baseType: !153, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !61, file: !419, line: 25, baseType: !153, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !61, file: !419, line: 26, baseType: !153, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !61, file: !419, line: 31, baseType: !463, size: 64, align: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!94, !58}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !54, line: 91, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !182, !182, !182}
!470 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !472, line: 9, baseType: !473)
!472 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !476, !476, !476, !476, !476, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !54, line: 90, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!234, !482}
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !54, line: 78, baseType: !476)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !54, line: 80, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!128, !482, !482}
!487 = !{i32 2, !"Dwarf Version", i32 4}
!488 = !{i32 2, !"Debug Info Version", i32 3}
!489 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!490 = distinct !DISubprogram(name: "nicklist_insert", scope: !491, file: !491, line: 80, type: !492, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!491 = !DIFile(filename: "nicklist.c", directory: "/home/lichi/Desktop/irssi/task1")
!492 = !DISubroutineType(types: !493)
!493 = !{null, !58, !424}
!494 = !{}
!495 = !DILocalVariable(name: "channel", arg: 1, scope: !490, file: !491, line: 80, type: !58)
!496 = !DIExpression()
!497 = !DILocation(line: 80, column: 35, scope: !490)
!498 = !DILocalVariable(name: "nick", arg: 2, scope: !490, file: !491, line: 80, type: !424)
!499 = !DILocation(line: 80, column: 54, scope: !490)
!500 = !DILocation(line: 84, column: 15, scope: !490)
!501 = !DILocation(line: 84, column: 2, scope: !490)
!502 = !DILocation(line: 84, column: 8, scope: !490)
!503 = !DILocation(line: 84, column: 13, scope: !490)
!504 = !DILocation(line: 85, column: 27, scope: !490)
!505 = !DILocation(line: 85, column: 36, scope: !490)
!506 = !DILocation(line: 85, column: 9, scope: !490)
!507 = !DILocation(line: 85, column: 15, scope: !490)
!508 = !DILocation(line: 85, column: 25, scope: !490)
!509 = !DILocation(line: 87, column: 23, scope: !490)
!510 = !DILocation(line: 87, column: 32, scope: !490)
!511 = !DILocation(line: 87, column: 9, scope: !490)
!512 = !DILocation(line: 88, column: 33, scope: !490)
!513 = !DILocation(line: 88, column: 42, scope: !490)
!514 = !DILocation(line: 88, column: 2, scope: !490)
!515 = !DILocation(line: 89, column: 1, scope: !490)
!516 = distinct !DISubprogram(name: "nick_hash_add", scope: !491, file: !491, line: 33, type: !492, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!517 = !DILocalVariable(name: "channel", arg: 1, scope: !516, file: !491, line: 33, type: !58)
!518 = !DILocation(line: 33, column: 40, scope: !516)
!519 = !DILocalVariable(name: "nick", arg: 2, scope: !516, file: !491, line: 33, type: !424)
!520 = !DILocation(line: 33, column: 59, scope: !516)
!521 = !DILocalVariable(name: "list", scope: !516, file: !491, line: 35, type: !424)
!522 = !DILocation(line: 35, column: 12, scope: !516)
!523 = !DILocation(line: 37, column: 2, scope: !516)
!524 = !DILocation(line: 37, column: 8, scope: !516)
!525 = !DILocation(line: 37, column: 13, scope: !516)
!526 = !DILocation(line: 39, column: 29, scope: !516)
!527 = !DILocation(line: 39, column: 38, scope: !516)
!528 = !DILocation(line: 39, column: 45, scope: !516)
!529 = !DILocation(line: 39, column: 51, scope: !516)
!530 = !DILocation(line: 39, column: 9, scope: !516)
!531 = !DILocation(line: 39, column: 7, scope: !516)
!532 = !DILocation(line: 40, column: 13, scope: !533)
!533 = distinct !DILexicalBlock(scope: !516, file: !491, line: 40, column: 13)
!534 = !DILocation(line: 40, column: 18, scope: !533)
!535 = !DILocation(line: 40, column: 13, scope: !516)
!536 = !DILocation(line: 41, column: 23, scope: !533)
!537 = !DILocation(line: 41, column: 32, scope: !533)
!538 = !DILocation(line: 41, column: 39, scope: !533)
!539 = !DILocation(line: 41, column: 45, scope: !533)
!540 = !DILocation(line: 41, column: 51, scope: !533)
!541 = !DILocation(line: 41, column: 3, scope: !533)
!542 = !DILocation(line: 44, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !533, file: !491, line: 42, column: 7)
!544 = !DILocation(line: 44, column: 10, scope: !545)
!545 = !DILexicalBlockFile(scope: !543, file: !491, discriminator: 1)
!546 = !DILocation(line: 44, column: 16, scope: !545)
!547 = !DILocation(line: 44, column: 21, scope: !545)
!548 = !DILocation(line: 44, column: 3, scope: !545)
!549 = !DILocation(line: 45, column: 11, scope: !543)
!550 = !DILocation(line: 45, column: 17, scope: !543)
!551 = !DILocation(line: 45, column: 9, scope: !543)
!552 = !DILocation(line: 44, column: 3, scope: !553)
!553 = !DILexicalBlockFile(scope: !543, file: !491, discriminator: 2)
!554 = distinct !{!554, !542}
!555 = !DILocation(line: 46, column: 16, scope: !543)
!556 = !DILocation(line: 46, column: 3, scope: !543)
!557 = !DILocation(line: 46, column: 9, scope: !543)
!558 = !DILocation(line: 46, column: 14, scope: !543)
!559 = !DILocation(line: 49, column: 6, scope: !560)
!560 = distinct !DILexicalBlock(scope: !516, file: !491, line: 49, column: 6)
!561 = !DILocation(line: 49, column: 14, scope: !560)
!562 = !DILocation(line: 49, column: 23, scope: !560)
!563 = !DILocation(line: 49, column: 11, scope: !560)
!564 = !DILocation(line: 49, column: 6, scope: !516)
!565 = !DILocation(line: 51, column: 20, scope: !566)
!566 = distinct !DILexicalBlock(scope: !560, file: !491, line: 49, column: 32)
!567 = !DILocation(line: 51, column: 29, scope: !566)
!568 = !DILocation(line: 51, column: 3, scope: !566)
!569 = !DILocation(line: 52, column: 2, scope: !566)
!570 = !DILocation(line: 53, column: 1, scope: !516)
!571 = distinct !DISubprogram(name: "nicklist_set_host", scope: !491, file: !491, line: 92, type: !572, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !58, !424, !56}
!574 = !DILocalVariable(name: "channel", arg: 1, scope: !571, file: !491, line: 92, type: !58)
!575 = !DILocation(line: 92, column: 37, scope: !571)
!576 = !DILocalVariable(name: "nick", arg: 2, scope: !571, file: !491, line: 92, type: !424)
!577 = !DILocation(line: 92, column: 56, scope: !571)
!578 = !DILocalVariable(name: "host", arg: 3, scope: !571, file: !491, line: 92, type: !56)
!579 = !DILocation(line: 92, column: 74, scope: !571)
!580 = !DILocation(line: 94, column: 9, scope: !571)
!581 = distinct !{!581, !580}
!582 = !DILocation(line: 94, column: 17, scope: !583)
!583 = !DILexicalBlockFile(scope: !584, file: !491, discriminator: 1)
!584 = distinct !DILexicalBlock(scope: !585, file: !491, line: 94, column: 17)
!585 = distinct !DILexicalBlock(scope: !571, file: !491, line: 94, column: 11)
!586 = !DILocation(line: 94, column: 25, scope: !583)
!587 = !DILocation(line: 94, column: 12, scope: !588)
!588 = !DILexicalBlockFile(scope: !589, file: !491, discriminator: 2)
!589 = distinct !DILexicalBlock(scope: !584, file: !491, line: 94, column: 10)
!590 = !DILocation(line: 94, column: 21, scope: !591)
!591 = !DILexicalBlockFile(scope: !592, file: !491, discriminator: 3)
!592 = distinct !DILexicalBlock(scope: !584, file: !491, line: 94, column: 19)
!593 = !DILocation(line: 94, column: 109, scope: !591)
!594 = !DILocation(line: 94, column: 120, scope: !595)
!595 = !DILexicalBlockFile(scope: !585, file: !491, discriminator: 4)
!596 = !DILocation(line: 95, column: 9, scope: !571)
!597 = distinct !{!597, !596}
!598 = !DILocation(line: 95, column: 17, scope: !599)
!599 = !DILexicalBlockFile(scope: !600, file: !491, discriminator: 1)
!600 = distinct !DILexicalBlock(scope: !601, file: !491, line: 95, column: 17)
!601 = distinct !DILexicalBlock(scope: !571, file: !491, line: 95, column: 11)
!602 = !DILocation(line: 95, column: 22, scope: !599)
!603 = !DILocation(line: 95, column: 12, scope: !604)
!604 = !DILexicalBlockFile(scope: !605, file: !491, discriminator: 2)
!605 = distinct !DILexicalBlock(scope: !600, file: !491, line: 95, column: 10)
!606 = !DILocation(line: 95, column: 21, scope: !607)
!607 = !DILexicalBlockFile(scope: !608, file: !491, discriminator: 3)
!608 = distinct !DILexicalBlock(scope: !600, file: !491, line: 95, column: 19)
!609 = !DILocation(line: 95, column: 106, scope: !607)
!610 = !DILocation(line: 95, column: 117, scope: !611)
!611 = !DILexicalBlockFile(scope: !601, file: !491, discriminator: 4)
!612 = !DILocation(line: 96, column: 2, scope: !571)
!613 = distinct !{!613, !612}
!614 = !DILocation(line: 96, column: 10, scope: !615)
!615 = !DILexicalBlockFile(scope: !616, file: !491, discriminator: 1)
!616 = distinct !DILexicalBlock(scope: !617, file: !491, line: 96, column: 10)
!617 = distinct !DILexicalBlock(scope: !571, file: !491, line: 96, column: 4)
!618 = !DILocation(line: 96, column: 15, scope: !615)
!619 = !DILocation(line: 96, column: 5, scope: !620)
!620 = !DILexicalBlockFile(scope: !621, file: !491, discriminator: 2)
!621 = distinct !DILexicalBlock(scope: !616, file: !491, line: 96, column: 3)
!622 = !DILocation(line: 96, column: 14, scope: !623)
!623 = !DILexicalBlockFile(scope: !624, file: !491, discriminator: 3)
!624 = distinct !DILexicalBlock(scope: !616, file: !491, line: 96, column: 12)
!625 = !DILocation(line: 96, column: 99, scope: !623)
!626 = !DILocation(line: 96, column: 110, scope: !627)
!627 = !DILexicalBlockFile(scope: !617, file: !491, discriminator: 4)
!628 = !DILocation(line: 98, column: 16, scope: !571)
!629 = !DILocation(line: 98, column: 22, scope: !571)
!630 = !DILocation(line: 98, column: 9, scope: !571)
!631 = !DILocation(line: 99, column: 24, scope: !571)
!632 = !DILocation(line: 99, column: 15, scope: !571)
!633 = !DILocation(line: 99, column: 2, scope: !571)
!634 = !DILocation(line: 99, column: 8, scope: !571)
!635 = !DILocation(line: 99, column: 13, scope: !571)
!636 = !DILocation(line: 101, column: 49, scope: !571)
!637 = !DILocation(line: 101, column: 58, scope: !571)
!638 = !DILocation(line: 101, column: 9, scope: !571)
!639 = !DILocation(line: 102, column: 1, scope: !571)
!640 = !DILocation(line: 102, column: 1, scope: !641)
!641 = !DILexicalBlockFile(scope: !571, file: !491, discriminator: 1)
!642 = distinct !DISubprogram(name: "nicklist_remove", scope: !491, file: !491, line: 119, type: !492, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!643 = !DILocalVariable(name: "channel", arg: 1, scope: !642, file: !491, line: 119, type: !58)
!644 = !DILocation(line: 119, column: 35, scope: !642)
!645 = !DILocalVariable(name: "nick", arg: 2, scope: !642, file: !491, line: 119, type: !424)
!646 = !DILocation(line: 119, column: 54, scope: !642)
!647 = !DILocation(line: 121, column: 2, scope: !642)
!648 = distinct !{!648, !647}
!649 = !DILocation(line: 121, column: 53, scope: !650)
!650 = !DILexicalBlockFile(scope: !651, file: !491, discriminator: 1)
!651 = distinct !DILexicalBlock(scope: !652, file: !491, line: 121, column: 10)
!652 = distinct !DILexicalBlock(scope: !642, file: !491, line: 121, column: 4)
!653 = !DILocation(line: 121, column: 28, scope: !650)
!654 = !DILocation(line: 121, column: 12, scope: !650)
!655 = !DILocation(line: 121, column: 10, scope: !650)
!656 = !DILocation(line: 121, column: 11, scope: !657)
!657 = !DILexicalBlockFile(scope: !651, file: !491, discriminator: 2)
!658 = !DILocation(line: 121, column: 10, scope: !659)
!659 = !DILexicalBlockFile(scope: !652, file: !491, discriminator: 3)
!660 = !DILocation(line: 121, column: 54, scope: !661)
!661 = !DILexicalBlockFile(scope: !662, file: !491, discriminator: 4)
!662 = distinct !DILexicalBlock(scope: !651, file: !491, line: 121, column: 52)
!663 = !DILocation(line: 121, column: 63, scope: !664)
!664 = !DILexicalBlockFile(scope: !665, file: !491, discriminator: 5)
!665 = distinct !DILexicalBlock(scope: !651, file: !491, line: 121, column: 61)
!666 = !DILocation(line: 121, column: 155, scope: !664)
!667 = !DILocation(line: 121, column: 166, scope: !668)
!668 = !DILexicalBlockFile(scope: !652, file: !491, discriminator: 6)
!669 = !DILocation(line: 122, column: 2, scope: !642)
!670 = distinct !{!670, !669}
!671 = !DILocation(line: 122, column: 10, scope: !672)
!672 = !DILexicalBlockFile(scope: !673, file: !491, discriminator: 1)
!673 = distinct !DILexicalBlock(scope: !674, file: !491, line: 122, column: 10)
!674 = distinct !DILexicalBlock(scope: !642, file: !491, line: 122, column: 4)
!675 = !DILocation(line: 122, column: 15, scope: !672)
!676 = !DILocation(line: 122, column: 5, scope: !677)
!677 = !DILexicalBlockFile(scope: !678, file: !491, discriminator: 2)
!678 = distinct !DILexicalBlock(scope: !673, file: !491, line: 122, column: 3)
!679 = !DILocation(line: 122, column: 14, scope: !680)
!680 = !DILexicalBlockFile(scope: !681, file: !491, discriminator: 3)
!681 = distinct !DILexicalBlock(scope: !673, file: !491, line: 122, column: 12)
!682 = !DILocation(line: 122, column: 99, scope: !680)
!683 = !DILocation(line: 122, column: 110, scope: !684)
!684 = !DILexicalBlockFile(scope: !674, file: !491, discriminator: 4)
!685 = !DILocation(line: 124, column: 26, scope: !642)
!686 = !DILocation(line: 124, column: 35, scope: !642)
!687 = !DILocation(line: 124, column: 9, scope: !642)
!688 = !DILocation(line: 125, column: 19, scope: !642)
!689 = !DILocation(line: 125, column: 28, scope: !642)
!690 = !DILocation(line: 125, column: 2, scope: !642)
!691 = !DILocation(line: 126, column: 1, scope: !642)
!692 = !DILocation(line: 126, column: 1, scope: !693)
!693 = !DILexicalBlockFile(scope: !642, file: !491, discriminator: 1)
!694 = distinct !DISubprogram(name: "nick_hash_remove", scope: !491, file: !491, line: 55, type: !492, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!695 = !DILocalVariable(name: "channel", arg: 1, scope: !694, file: !491, line: 55, type: !58)
!696 = !DILocation(line: 55, column: 43, scope: !694)
!697 = !DILocalVariable(name: "nick", arg: 2, scope: !694, file: !491, line: 55, type: !424)
!698 = !DILocation(line: 55, column: 62, scope: !694)
!699 = !DILocalVariable(name: "list", scope: !694, file: !491, line: 57, type: !424)
!700 = !DILocation(line: 57, column: 12, scope: !694)
!701 = !DILocalVariable(name: "newlist", scope: !694, file: !491, line: 57, type: !424)
!702 = !DILocation(line: 57, column: 19, scope: !694)
!703 = !DILocation(line: 59, column: 29, scope: !694)
!704 = !DILocation(line: 59, column: 38, scope: !694)
!705 = !DILocation(line: 59, column: 45, scope: !694)
!706 = !DILocation(line: 59, column: 51, scope: !694)
!707 = !DILocation(line: 59, column: 9, scope: !694)
!708 = !DILocation(line: 59, column: 7, scope: !694)
!709 = !DILocation(line: 60, column: 6, scope: !710)
!710 = distinct !DILexicalBlock(scope: !694, file: !491, line: 60, column: 6)
!711 = !DILocation(line: 60, column: 11, scope: !710)
!712 = !DILocation(line: 60, column: 6, scope: !694)
!713 = !DILocation(line: 61, column: 3, scope: !710)
!714 = !DILocation(line: 63, column: 6, scope: !715)
!715 = distinct !DILexicalBlock(scope: !694, file: !491, line: 63, column: 6)
!716 = !DILocation(line: 63, column: 14, scope: !715)
!717 = !DILocation(line: 63, column: 11, scope: !715)
!718 = !DILocation(line: 63, column: 6, scope: !694)
!719 = !DILocation(line: 64, column: 13, scope: !720)
!720 = distinct !DILexicalBlock(scope: !715, file: !491, line: 63, column: 20)
!721 = !DILocation(line: 64, column: 19, scope: !720)
!722 = !DILocation(line: 64, column: 11, scope: !720)
!723 = !DILocation(line: 65, column: 2, scope: !720)
!724 = !DILocation(line: 66, column: 13, scope: !725)
!725 = distinct !DILexicalBlock(scope: !715, file: !491, line: 65, column: 9)
!726 = !DILocation(line: 66, column: 11, scope: !725)
!727 = !DILocation(line: 67, column: 3, scope: !725)
!728 = !DILocation(line: 67, column: 10, scope: !729)
!729 = !DILexicalBlockFile(scope: !725, file: !491, discriminator: 1)
!730 = !DILocation(line: 67, column: 16, scope: !729)
!731 = !DILocation(line: 67, column: 24, scope: !729)
!732 = !DILocation(line: 67, column: 21, scope: !729)
!733 = !DILocation(line: 67, column: 3, scope: !729)
!734 = !DILocation(line: 68, column: 11, scope: !725)
!735 = !DILocation(line: 68, column: 17, scope: !725)
!736 = !DILocation(line: 68, column: 9, scope: !725)
!737 = !DILocation(line: 67, column: 3, scope: !738)
!738 = !DILexicalBlockFile(scope: !725, file: !491, discriminator: 2)
!739 = distinct !{!739, !727}
!740 = !DILocation(line: 69, column: 16, scope: !725)
!741 = !DILocation(line: 69, column: 22, scope: !725)
!742 = !DILocation(line: 69, column: 3, scope: !725)
!743 = !DILocation(line: 69, column: 9, scope: !725)
!744 = !DILocation(line: 69, column: 14, scope: !725)
!745 = !DILocation(line: 72, column: 22, scope: !694)
!746 = !DILocation(line: 72, column: 31, scope: !694)
!747 = !DILocation(line: 72, column: 38, scope: !694)
!748 = !DILocation(line: 72, column: 44, scope: !694)
!749 = !DILocation(line: 72, column: 2, scope: !694)
!750 = !DILocation(line: 73, column: 6, scope: !751)
!751 = distinct !DILexicalBlock(scope: !694, file: !491, line: 73, column: 6)
!752 = !DILocation(line: 73, column: 14, scope: !751)
!753 = !DILocation(line: 73, column: 6, scope: !694)
!754 = !DILocation(line: 74, column: 23, scope: !755)
!755 = distinct !DILexicalBlock(scope: !751, file: !491, line: 73, column: 22)
!756 = !DILocation(line: 74, column: 32, scope: !755)
!757 = !DILocation(line: 74, column: 39, scope: !755)
!758 = !DILocation(line: 74, column: 48, scope: !755)
!759 = !DILocation(line: 75, column: 9, scope: !755)
!760 = !DILocation(line: 74, column: 3, scope: !755)
!761 = !DILocation(line: 76, column: 2, scope: !755)
!762 = !DILocation(line: 77, column: 1, scope: !694)
!763 = distinct !DISubprogram(name: "nicklist_destroy", scope: !491, file: !491, line: 104, type: !492, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!764 = !DILocalVariable(name: "channel", arg: 1, scope: !763, file: !491, line: 104, type: !58)
!765 = !DILocation(line: 104, column: 43, scope: !763)
!766 = !DILocalVariable(name: "nick", arg: 2, scope: !763, file: !491, line: 104, type: !424)
!767 = !DILocation(line: 104, column: 62, scope: !763)
!768 = !DILocation(line: 106, column: 36, scope: !763)
!769 = !DILocation(line: 106, column: 45, scope: !763)
!770 = !DILocation(line: 106, column: 2, scope: !763)
!771 = !DILocation(line: 108, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !763, file: !491, line: 108, column: 6)
!773 = !DILocation(line: 108, column: 15, scope: !772)
!774 = !DILocation(line: 108, column: 26, scope: !772)
!775 = !DILocation(line: 108, column: 23, scope: !772)
!776 = !DILocation(line: 108, column: 6, scope: !763)
!777 = !DILocation(line: 109, column: 17, scope: !772)
!778 = !DILocation(line: 109, column: 26, scope: !772)
!779 = !DILocation(line: 109, column: 34, scope: !772)
!780 = !DILocation(line: 112, column: 9, scope: !763)
!781 = !DILocation(line: 112, column: 15, scope: !763)
!782 = !DILocation(line: 112, column: 2, scope: !763)
!783 = !DILocation(line: 113, column: 9, scope: !763)
!784 = !DILocation(line: 113, column: 15, scope: !763)
!785 = !DILocation(line: 113, column: 2, scope: !763)
!786 = !DILocation(line: 114, column: 9, scope: !763)
!787 = !DILocation(line: 114, column: 15, scope: !763)
!788 = !DILocation(line: 114, column: 2, scope: !763)
!789 = !DILocation(line: 115, column: 9, scope: !763)
!790 = !DILocation(line: 115, column: 2, scope: !763)
!791 = !DILocation(line: 116, column: 1, scope: !763)
!792 = distinct !DISubprogram(name: "nicklist_rename", scope: !491, file: !491, line: 157, type: !793, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !75, !56, !56}
!795 = !DILocalVariable(name: "server", arg: 1, scope: !792, file: !491, line: 157, type: !75)
!796 = !DILocation(line: 157, column: 34, scope: !792)
!797 = !DILocalVariable(name: "old_nick", arg: 2, scope: !792, file: !491, line: 157, type: !56)
!798 = !DILocation(line: 157, column: 54, scope: !792)
!799 = !DILocalVariable(name: "new_nick", arg: 3, scope: !792, file: !491, line: 158, type: !56)
!800 = !DILocation(line: 158, column: 20, scope: !792)
!801 = !DILocation(line: 160, column: 23, scope: !792)
!802 = !DILocation(line: 160, column: 36, scope: !792)
!803 = !DILocation(line: 160, column: 46, scope: !792)
!804 = !DILocation(line: 161, column: 27, scope: !792)
!805 = !DILocation(line: 161, column: 35, scope: !792)
!806 = !DILocation(line: 161, column: 9, scope: !792)
!807 = !DILocation(line: 160, column: 2, scope: !792)
!808 = !DILocation(line: 162, column: 1, scope: !792)
!809 = distinct !DISubprogram(name: "nicklist_rename_list", scope: !491, file: !491, line: 128, type: !810, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !75, !51, !56, !56, !243}
!812 = !DILocalVariable(name: "server", arg: 1, scope: !809, file: !491, line: 128, type: !75)
!813 = !DILocation(line: 128, column: 46, scope: !809)
!814 = !DILocalVariable(name: "new_nick_id", arg: 2, scope: !809, file: !491, line: 128, type: !51)
!815 = !DILocation(line: 128, column: 60, scope: !809)
!816 = !DILocalVariable(name: "old_nick", arg: 3, scope: !809, file: !491, line: 129, type: !56)
!817 = !DILocation(line: 129, column: 18, scope: !809)
!818 = !DILocalVariable(name: "new_nick", arg: 4, scope: !809, file: !491, line: 129, type: !56)
!819 = !DILocation(line: 129, column: 40, scope: !809)
!820 = !DILocalVariable(name: "nicks", arg: 5, scope: !809, file: !491, line: 130, type: !243)
!821 = !DILocation(line: 130, column: 14, scope: !809)
!822 = !DILocalVariable(name: "channel", scope: !809, file: !491, line: 132, type: !58)
!823 = !DILocation(line: 132, column: 15, scope: !809)
!824 = !DILocalVariable(name: "nickrec", scope: !809, file: !491, line: 133, type: !424)
!825 = !DILocation(line: 133, column: 12, scope: !809)
!826 = !DILocalVariable(name: "tmp", scope: !809, file: !491, line: 134, type: !243)
!827 = !DILocation(line: 134, column: 10, scope: !809)
!828 = !DILocation(line: 136, column: 13, scope: !829)
!829 = distinct !DILexicalBlock(scope: !809, file: !491, line: 136, column: 2)
!830 = !DILocation(line: 136, column: 11, scope: !829)
!831 = !DILocation(line: 136, column: 7, scope: !829)
!832 = !DILocation(line: 136, column: 20, scope: !833)
!833 = !DILexicalBlockFile(scope: !834, file: !491, discriminator: 1)
!834 = distinct !DILexicalBlock(scope: !829, file: !491, line: 136, column: 2)
!835 = !DILocation(line: 136, column: 24, scope: !833)
!836 = !DILocation(line: 136, column: 2, scope: !833)
!837 = !DILocation(line: 137, column: 13, scope: !838)
!838 = distinct !DILexicalBlock(scope: !834, file: !491, line: 136, column: 55)
!839 = !DILocation(line: 137, column: 18, scope: !838)
!840 = !DILocation(line: 137, column: 11, scope: !838)
!841 = !DILocation(line: 138, column: 13, scope: !838)
!842 = !DILocation(line: 138, column: 18, scope: !838)
!843 = !DILocation(line: 138, column: 24, scope: !838)
!844 = !DILocation(line: 138, column: 11, scope: !838)
!845 = !DILocation(line: 141, column: 34, scope: !838)
!846 = !DILocation(line: 141, column: 43, scope: !838)
!847 = !DILocation(line: 141, column: 17, scope: !838)
!848 = !DILocation(line: 143, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !838, file: !491, line: 143, column: 7)
!850 = !DILocation(line: 143, column: 19, scope: !849)
!851 = !DILocation(line: 143, column: 7, scope: !838)
!852 = !DILocation(line: 144, column: 25, scope: !849)
!853 = !DILocation(line: 144, column: 4, scope: !849)
!854 = !DILocation(line: 144, column: 13, scope: !849)
!855 = !DILocation(line: 144, column: 23, scope: !849)
!856 = !DILocation(line: 146, column: 10, scope: !838)
!857 = !DILocation(line: 146, column: 19, scope: !838)
!858 = !DILocation(line: 146, column: 3, scope: !838)
!859 = !DILocation(line: 147, column: 28, scope: !838)
!860 = !DILocation(line: 147, column: 19, scope: !838)
!861 = !DILocation(line: 147, column: 3, scope: !838)
!862 = !DILocation(line: 147, column: 12, scope: !838)
!863 = !DILocation(line: 147, column: 17, scope: !838)
!864 = !DILocation(line: 150, column: 31, scope: !838)
!865 = !DILocation(line: 150, column: 40, scope: !838)
!866 = !DILocation(line: 150, column: 17, scope: !838)
!867 = !DILocation(line: 152, column: 38, scope: !838)
!868 = !DILocation(line: 152, column: 47, scope: !838)
!869 = !DILocation(line: 152, column: 56, scope: !838)
!870 = !DILocation(line: 152, column: 3, scope: !838)
!871 = !DILocation(line: 153, column: 2, scope: !838)
!872 = !DILocation(line: 136, column: 38, scope: !873)
!873 = !DILexicalBlockFile(scope: !834, file: !491, discriminator: 2)
!874 = !DILocation(line: 136, column: 43, scope: !873)
!875 = !DILocation(line: 136, column: 49, scope: !873)
!876 = !DILocation(line: 136, column: 36, scope: !873)
!877 = !DILocation(line: 136, column: 2, scope: !873)
!878 = distinct !{!878, !879}
!879 = !DILocation(line: 136, column: 2, scope: !809)
!880 = !DILocation(line: 154, column: 15, scope: !809)
!881 = !DILocation(line: 154, column: 2, scope: !809)
!882 = !DILocation(line: 155, column: 1, scope: !809)
!883 = distinct !DISubprogram(name: "nicklist_get_same", scope: !491, file: !491, line: 289, type: !884, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!884 = !DISubroutineType(types: !885)
!885 = !{!243, !75, !56}
!886 = !DILocalVariable(name: "server", arg: 1, scope: !883, file: !491, line: 289, type: !75)
!887 = !DILocation(line: 289, column: 39, scope: !883)
!888 = !DILocalVariable(name: "nick", arg: 2, scope: !883, file: !491, line: 289, type: !56)
!889 = !DILocation(line: 289, column: 59, scope: !883)
!890 = !DILocalVariable(name: "tmp", scope: !883, file: !491, line: 291, type: !243)
!891 = !DILocation(line: 291, column: 10, scope: !883)
!892 = !DILocalVariable(name: "list", scope: !883, file: !491, line: 292, type: !243)
!893 = !DILocation(line: 292, column: 10, scope: !883)
!894 = !DILocation(line: 294, column: 2, scope: !883)
!895 = distinct !{!895, !894}
!896 = !DILocation(line: 294, column: 45, scope: !897)
!897 = !DILexicalBlockFile(scope: !898, file: !491, discriminator: 1)
!898 = distinct !DILexicalBlock(scope: !899, file: !491, line: 294, column: 10)
!899 = distinct !DILexicalBlock(scope: !883, file: !491, line: 294, column: 4)
!900 = !DILocation(line: 294, column: 27, scope: !897)
!901 = !DILocation(line: 294, column: 12, scope: !897)
!902 = !DILocation(line: 294, column: 10, scope: !897)
!903 = !DILocation(line: 294, column: 11, scope: !904)
!904 = !DILexicalBlockFile(scope: !898, file: !491, discriminator: 2)
!905 = !DILocation(line: 294, column: 10, scope: !906)
!906 = !DILexicalBlockFile(scope: !899, file: !491, discriminator: 3)
!907 = !DILocation(line: 294, column: 33, scope: !908)
!908 = !DILexicalBlockFile(scope: !909, file: !491, discriminator: 4)
!909 = distinct !DILexicalBlock(scope: !898, file: !491, line: 294, column: 31)
!910 = !DILocation(line: 294, column: 42, scope: !911)
!911 = !DILexicalBlockFile(scope: !912, file: !491, discriminator: 5)
!912 = distinct !DILexicalBlock(scope: !898, file: !491, line: 294, column: 40)
!913 = !DILocation(line: 294, column: 132, scope: !911)
!914 = !DILocation(line: 294, column: 7, scope: !915)
!915 = !DILexicalBlockFile(scope: !899, file: !491, discriminator: 6)
!916 = !DILocation(line: 296, column: 13, scope: !917)
!917 = distinct !DILexicalBlock(scope: !883, file: !491, line: 296, column: 2)
!918 = !DILocation(line: 296, column: 21, scope: !917)
!919 = !DILocation(line: 296, column: 11, scope: !917)
!920 = !DILocation(line: 296, column: 7, scope: !917)
!921 = !DILocation(line: 296, column: 31, scope: !922)
!922 = !DILexicalBlockFile(scope: !923, file: !491, discriminator: 1)
!923 = distinct !DILexicalBlock(scope: !917, file: !491, line: 296, column: 2)
!924 = !DILocation(line: 296, column: 35, scope: !922)
!925 = !DILocation(line: 296, column: 2, scope: !922)
!926 = !DILocalVariable(name: "nick_rec", scope: !927, file: !491, line: 297, type: !424)
!927 = distinct !DILexicalBlock(scope: !923, file: !491, line: 296, column: 60)
!928 = !DILocation(line: 297, column: 13, scope: !927)
!929 = !DILocalVariable(name: "channel", scope: !927, file: !491, line: 298, type: !58)
!930 = !DILocation(line: 298, column: 16, scope: !927)
!931 = !DILocation(line: 298, column: 26, scope: !927)
!932 = !DILocation(line: 298, column: 31, scope: !927)
!933 = !DILocation(line: 300, column: 39, scope: !934)
!934 = distinct !DILexicalBlock(scope: !927, file: !491, line: 300, column: 3)
!935 = !DILocation(line: 300, column: 48, scope: !934)
!936 = !DILocation(line: 300, column: 55, scope: !934)
!937 = !DILocation(line: 300, column: 19, scope: !934)
!938 = !DILocation(line: 300, column: 17, scope: !934)
!939 = !DILocation(line: 300, column: 8, scope: !934)
!940 = !DILocation(line: 301, column: 8, scope: !941)
!941 = distinct !DILexicalBlock(scope: !934, file: !491, line: 300, column: 3)
!942 = !DILocation(line: 301, column: 17, scope: !941)
!943 = !DILocation(line: 300, column: 3, scope: !944)
!944 = !DILexicalBlockFile(scope: !934, file: !491, discriminator: 1)
!945 = !DILocation(line: 303, column: 26, scope: !946)
!946 = distinct !DILexicalBlock(scope: !941, file: !491, line: 302, column: 35)
!947 = !DILocation(line: 303, column: 32, scope: !946)
!948 = !DILocation(line: 303, column: 11, scope: !946)
!949 = !DILocation(line: 303, column: 9, scope: !946)
!950 = !DILocation(line: 304, column: 26, scope: !946)
!951 = !DILocation(line: 304, column: 32, scope: !946)
!952 = !DILocation(line: 304, column: 11, scope: !946)
!953 = !DILocation(line: 304, column: 9, scope: !946)
!954 = !DILocation(line: 305, column: 3, scope: !946)
!955 = !DILocation(line: 302, column: 19, scope: !941)
!956 = !DILocation(line: 302, column: 29, scope: !941)
!957 = !DILocation(line: 302, column: 17, scope: !941)
!958 = !DILocation(line: 300, column: 3, scope: !959)
!959 = !DILexicalBlockFile(scope: !941, file: !491, discriminator: 2)
!960 = distinct !{!960, !961}
!961 = !DILocation(line: 300, column: 3, scope: !927)
!962 = !DILocation(line: 306, column: 2, scope: !927)
!963 = !DILocation(line: 296, column: 49, scope: !964)
!964 = !DILexicalBlockFile(scope: !923, file: !491, discriminator: 2)
!965 = !DILocation(line: 296, column: 54, scope: !964)
!966 = !DILocation(line: 296, column: 47, scope: !964)
!967 = !DILocation(line: 296, column: 2, scope: !964)
!968 = distinct !{!968, !969}
!969 = !DILocation(line: 296, column: 2, scope: !883)
!970 = !DILocation(line: 308, column: 9, scope: !883)
!971 = !DILocation(line: 308, column: 2, scope: !883)
!972 = !DILocation(line: 309, column: 1, scope: !883)
!973 = distinct !DISubprogram(name: "nicklist_rename_unique", scope: !491, file: !491, line: 164, type: !974, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !75, !51, !56, !51, !56}
!976 = !DILocalVariable(name: "server", arg: 1, scope: !973, file: !491, line: 164, type: !75)
!977 = !DILocation(line: 164, column: 41, scope: !973)
!978 = !DILocalVariable(name: "old_nick_id", arg: 2, scope: !973, file: !491, line: 165, type: !51)
!979 = !DILocation(line: 165, column: 14, scope: !973)
!980 = !DILocalVariable(name: "old_nick", arg: 3, scope: !973, file: !491, line: 165, type: !56)
!981 = !DILocation(line: 165, column: 39, scope: !973)
!982 = !DILocalVariable(name: "new_nick_id", arg: 4, scope: !973, file: !491, line: 166, type: !51)
!983 = !DILocation(line: 166, column: 14, scope: !973)
!984 = !DILocalVariable(name: "new_nick", arg: 5, scope: !973, file: !491, line: 166, type: !56)
!985 = !DILocation(line: 166, column: 39, scope: !973)
!986 = !DILocation(line: 168, column: 23, scope: !973)
!987 = !DILocation(line: 168, column: 31, scope: !973)
!988 = !DILocation(line: 168, column: 44, scope: !973)
!989 = !DILocation(line: 168, column: 54, scope: !973)
!990 = !DILocation(line: 169, column: 34, scope: !973)
!991 = !DILocation(line: 169, column: 42, scope: !973)
!992 = !DILocation(line: 169, column: 9, scope: !973)
!993 = !DILocation(line: 168, column: 2, scope: !973)
!994 = !DILocation(line: 170, column: 1, scope: !973)
!995 = distinct !DISubprogram(name: "nicklist_get_same_unique", scope: !491, file: !491, line: 331, type: !996, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!996 = !DISubroutineType(types: !997)
!997 = !{!243, !75, !51}
!998 = !DILocalVariable(name: "server", arg: 1, scope: !995, file: !491, line: 331, type: !75)
!999 = !DILocation(line: 331, column: 46, scope: !995)
!1000 = !DILocalVariable(name: "id", arg: 2, scope: !995, file: !491, line: 331, type: !51)
!1001 = !DILocation(line: 331, column: 60, scope: !995)
!1002 = !DILocalVariable(name: "rec", scope: !995, file: !491, line: 333, type: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICKLIST_GET_SAME_UNIQUE_REC", file: !491, line: 315, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !491, line: 311, size: 192, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1004, file: !491, line: 312, baseType: !58, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1004, file: !491, line: 313, baseType: !51, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1004, file: !491, line: 314, baseType: !243, size: 64, align: 64, offset: 128)
!1009 = !DILocation(line: 333, column: 31, scope: !995)
!1010 = !DILocalVariable(name: "tmp", scope: !995, file: !491, line: 334, type: !243)
!1011 = !DILocation(line: 334, column: 10, scope: !995)
!1012 = !DILocation(line: 336, column: 2, scope: !995)
!1013 = distinct !{!1013, !1012}
!1014 = !DILocation(line: 336, column: 45, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !1016, file: !491, discriminator: 1)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !491, line: 336, column: 10)
!1017 = distinct !DILexicalBlock(scope: !995, file: !491, line: 336, column: 4)
!1018 = !DILocation(line: 336, column: 27, scope: !1015)
!1019 = !DILocation(line: 336, column: 12, scope: !1015)
!1020 = !DILocation(line: 336, column: 10, scope: !1015)
!1021 = !DILocation(line: 336, column: 11, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1016, file: !491, discriminator: 2)
!1023 = !DILocation(line: 336, column: 10, scope: !1024)
!1024 = !DILexicalBlockFile(scope: !1017, file: !491, discriminator: 3)
!1025 = !DILocation(line: 336, column: 33, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1027, file: !491, discriminator: 4)
!1027 = distinct !DILexicalBlock(scope: !1016, file: !491, line: 336, column: 31)
!1028 = !DILocation(line: 336, column: 42, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1030, file: !491, discriminator: 5)
!1030 = distinct !DILexicalBlock(scope: !1016, file: !491, line: 336, column: 40)
!1031 = !DILocation(line: 336, column: 132, scope: !1029)
!1032 = !DILocation(line: 336, column: 7, scope: !1033)
!1033 = !DILexicalBlockFile(scope: !1017, file: !491, discriminator: 6)
!1034 = !DILocation(line: 337, column: 2, scope: !995)
!1035 = distinct !{!1035, !1034}
!1036 = !DILocation(line: 337, column: 10, scope: !1037)
!1037 = !DILexicalBlockFile(scope: !1038, file: !491, discriminator: 1)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !491, line: 337, column: 10)
!1039 = distinct !DILexicalBlock(scope: !995, file: !491, line: 337, column: 4)
!1040 = !DILocation(line: 337, column: 13, scope: !1037)
!1041 = !DILocation(line: 337, column: 5, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1043, file: !491, discriminator: 2)
!1043 = distinct !DILexicalBlock(scope: !1038, file: !491, line: 337, column: 3)
!1044 = !DILocation(line: 337, column: 14, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1046, file: !491, discriminator: 3)
!1046 = distinct !DILexicalBlock(scope: !1038, file: !491, line: 337, column: 12)
!1047 = !DILocation(line: 337, column: 97, scope: !1045)
!1048 = !DILocation(line: 337, column: 7, scope: !1049)
!1049 = !DILexicalBlockFile(scope: !1039, file: !491, discriminator: 4)
!1050 = !DILocation(line: 339, column: 18, scope: !995)
!1051 = !DILocation(line: 339, column: 13, scope: !995)
!1052 = !DILocation(line: 339, column: 16, scope: !995)
!1053 = !DILocation(line: 340, column: 6, scope: !995)
!1054 = !DILocation(line: 340, column: 11, scope: !995)
!1055 = !DILocation(line: 341, column: 13, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !995, file: !491, line: 341, column: 2)
!1057 = !DILocation(line: 341, column: 21, scope: !1056)
!1058 = !DILocation(line: 341, column: 11, scope: !1056)
!1059 = !DILocation(line: 341, column: 7, scope: !1056)
!1060 = !DILocation(line: 341, column: 31, scope: !1061)
!1061 = !DILexicalBlockFile(scope: !1062, file: !491, discriminator: 1)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !491, line: 341, column: 2)
!1063 = !DILocation(line: 341, column: 35, scope: !1061)
!1064 = !DILocation(line: 341, column: 2, scope: !1061)
!1065 = !DILocation(line: 342, column: 17, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !491, line: 341, column: 60)
!1067 = !DILocation(line: 342, column: 22, scope: !1066)
!1068 = !DILocation(line: 342, column: 7, scope: !1066)
!1069 = !DILocation(line: 342, column: 15, scope: !1066)
!1070 = !DILocation(line: 343, column: 28, scope: !1066)
!1071 = !DILocation(line: 343, column: 37, scope: !1066)
!1072 = !DILocation(line: 345, column: 10, scope: !1066)
!1073 = !DILocation(line: 343, column: 3, scope: !1066)
!1074 = !DILocation(line: 346, column: 2, scope: !1066)
!1075 = !DILocation(line: 341, column: 49, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !1062, file: !491, discriminator: 2)
!1077 = !DILocation(line: 341, column: 54, scope: !1076)
!1078 = !DILocation(line: 341, column: 47, scope: !1076)
!1079 = !DILocation(line: 341, column: 2, scope: !1076)
!1080 = distinct !{!1080, !1081}
!1081 = !DILocation(line: 341, column: 2, scope: !995)
!1082 = !DILocation(line: 347, column: 13, scope: !995)
!1083 = !DILocation(line: 347, column: 2, scope: !995)
!1084 = !DILocation(line: 348, column: 1, scope: !995)
!1085 = distinct !DISubprogram(name: "nicklist_find_multiple", scope: !491, file: !491, line: 190, type: !1086, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !494)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!243, !58, !56}
!1088 = !DILocalVariable(name: "channel", arg: 1, scope: !1085, file: !491, line: 190, type: !58)
!1089 = !DILocation(line: 190, column: 45, scope: !1085)
!1090 = !DILocalVariable(name: "mask", arg: 2, scope: !1085, file: !491, line: 190, type: !56)
!1091 = !DILocation(line: 190, column: 66, scope: !1085)
!1092 = !DILocalVariable(name: "nicks", scope: !1085, file: !491, line: 192, type: !243)
!1093 = !DILocation(line: 192, column: 10, scope: !1085)
!1094 = !DILocalVariable(name: "nick", scope: !1085, file: !491, line: 193, type: !424)
!1095 = !DILocation(line: 193, column: 12, scope: !1085)
!1096 = !DILocalVariable(name: "iter", scope: !1085, file: !491, line: 194, type: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTableIter", file: !71, line: 43, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTableIter", file: !71, line: 45, size: 320, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "dummy1", scope: !1098, file: !71, line: 48, baseType: !182, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "dummy2", scope: !1098, file: !71, line: 49, baseType: !182, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "dummy3", scope: !1098, file: !71, line: 50, baseType: !182, size: 64, align: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "dummy4", scope: !1098, file: !71, line: 51, baseType: !66, size: 32, align: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dummy5", scope: !1098, file: !71, line: 52, baseType: !202, size: 32, align: 32, offset: 224)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dummy6", scope: !1098, file: !71, line: 53, baseType: !182, size: 64, align: 64, offset: 256)
!1106 = !DILocation(line: 194, column: 17, scope: !1085)
!1107 = !DILocation(line: 196, column: 2, scope: !1085)
!1108 = distinct !{!1108, !1107}
!1109 = !DILocation(line: 196, column: 53, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1111, file: !491, discriminator: 1)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !491, line: 196, column: 10)
!1112 = distinct !DILexicalBlock(scope: !1085, file: !491, line: 196, column: 4)
!1113 = !DILocation(line: 196, column: 28, scope: !1110)
!1114 = !DILocation(line: 196, column: 12, scope: !1110)
!1115 = !DILocation(line: 196, column: 10, scope: !1110)
!1116 = !DILocation(line: 196, column: 11, scope: !1117)
!1117 = !DILexicalBlockFile(scope: !1111, file: !491, discriminator: 2)
!1118 = !DILocation(line: 196, column: 10, scope: !1119)
!1119 = !DILexicalBlockFile(scope: !1112, file: !491, discriminator: 3)
!1120 = !DILocation(line: 196, column: 54, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1122, file: !491, discriminator: 4)
!1122 = distinct !DILexicalBlock(scope: !1111, file: !491, line: 196, column: 52)
!1123 = !DILocation(line: 196, column: 63, scope: !1124)
!1124 = !DILexicalBlockFile(scope: !1125, file: !491, discriminator: 5)
!1125 = distinct !DILexicalBlock(scope: !1111, file: !491, line: 196, column: 61)
!1126 = !DILocation(line: 196, column: 155, scope: !1124)
!1127 = !DILocation(line: 196, column: 7, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1112, file: !491, discriminator: 6)
!1129 = !DILocation(line: 197, column: 2, scope: !1085)
!1130 = distinct !{!1130, !1129}
!1131 = !DILocation(line: 197, column: 10, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !491, discriminator: 1)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !491, line: 197, column: 10)
!1134 = distinct !DILexicalBlock(scope: !1085, file: !491, line: 197, column: 4)
!1135 = !DILocation(line: 197, column: 15, scope: !1132)
!1136 = !DILocation(line: 197, column: 5, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1138, file: !491, discriminator: 2)
!1138 = distinct !DILexicalBlock(scope: !1133, file: !491, line: 197, column: 3)
!1139 = !DILocation(line: 197, column: 14, scope: !1140)
!1140 = !DILexicalBlockFile(scope: !1141, file: !491, discriminator: 3)
!1141 = distinct !DILexicalBlock(scope: !1133, file: !491, line: 197, column: 12)
!1142 = !DILocation(line: 197, column: 99, scope: !1140)
!1143 = !DILocation(line: 197, column: 7, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1134, file: !491, discriminator: 4)
!1145 = !DILocation(line: 199, column: 8, scope: !1085)
!1146 = !DILocation(line: 201, column: 32, scope: !1085)
!1147 = !DILocation(line: 201, column: 41, scope: !1085)
!1148 = !DILocation(line: 201, column: 2, scope: !1085)
!1149 = !DILocation(line: 202, column: 2, scope: !1085)
!1150 = !DILocation(line: 202, column: 44, scope: !1151)
!1151 = !DILexicalBlockFile(scope: !1085, file: !491, discriminator: 1)
!1152 = !DILocation(line: 202, column: 9, scope: !1151)
!1153 = !DILocation(line: 202, column: 2, scope: !1151)
!1154 = !DILocation(line: 203, column: 3, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1085, file: !491, line: 202, column: 59)
!1156 = !DILocation(line: 203, column: 10, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1158, file: !491, discriminator: 1)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !491, line: 203, column: 3)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !491, line: 203, column: 3)
!1160 = !DILocation(line: 203, column: 15, scope: !1157)
!1161 = !DILocation(line: 203, column: 3, scope: !1157)
!1162 = !DILocation(line: 204, column: 27, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !491, line: 204, column: 8)
!1164 = distinct !DILexicalBlock(scope: !1158, file: !491, line: 203, column: 42)
!1165 = !DILocation(line: 204, column: 36, scope: !1163)
