; ModuleID = './line376-textbuffer-commands.o.i'
source_filename = "./line376-textbuffer-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!75 = !DIEnumerator(name: "TXT_LASTLOG_SEPARATOR", value: 6)
!76 = !DIEnumerator(name: "TXT_LASTLOG_DATE", value: 7)
!77 = !DIEnumerator(name: "TXT_FILL_2", value: 8)
!78 = !DIEnumerator(name: "TXT_REFNUM_NOT_FOUND", value: 9)
!79 = !DIEnumerator(name: "TXT_WINDOW_TOO_SMALL", value: 10)
!80 = !DIEnumerator(name: "TXT_CANT_HIDE_LAST", value: 11)
!81 = !DIEnumerator(name: "TXT_CANT_HIDE_STICKY_WINDOWS", value: 12)
!82 = !DIEnumerator(name: "TXT_CANT_SHOW_STICKY_WINDOWS", value: 13)
!83 = !DIEnumerator(name: "TXT_WINDOW_NOT_STICKY", value: 14)
!84 = !DIEnumerator(name: "TXT_WINDOW_SET_STICKY", value: 15)
!85 = !DIEnumerator(name: "TXT_WINDOW_UNSET_STICKY", value: 16)
!86 = !DIEnumerator(name: "TXT_WINDOW_INFO_STICKY", value: 17)
!87 = !DIEnumerator(name: "TXT_WINDOW_INFO_SCROLL", value: 18)
!88 = !DIEnumerator(name: "TXT_WINDOW_SCROLL", value: 19)
!89 = !DIEnumerator(name: "TXT_WINDOW_SCROLL_UNKNOWN", value: 20)
!90 = !DIEnumerator(name: "TXT_WINDOW_HIDELEVEL", value: 21)
!91 = !DIEnumerator(name: "TXT_FILL_3", value: 22)
!92 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_HEADER", value: 23)
!93 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_FOOTER", value: 24)
!94 = !DIEnumerator(name: "TXT_STATUSBAR_LIST", value: 25)
!95 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_NAME", value: 26)
!96 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_TYPE", value: 27)
!97 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_PLACEMENT", value: 28)
!98 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_POSITION", value: 29)
!99 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_VISIBLE", value: 30)
!100 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_HEADER", value: 31)
!101 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_FOOTER", value: 32)
!102 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_NAME", value: 33)
!103 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_FOUND", value: 34)
!104 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_ENABLED", value: 35)
!105 = !DIEnumerator(name: "TXT_STATUSBAR_ITEM_NOT_FOUND", value: 36)
!106 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_COMMAND", value: 37)
!107 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_TYPE", value: 38)
!108 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_PLACEMENT", value: 39)
!109 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_VISIBILITY", value: 40)
!110 = !DIEnumerator(name: "TXT_FILL_4", value: 41)
!111 = !DIEnumerator(name: "TXT_PASTE_WARNING", value: 42)
!112 = !DIEnumerator(name: "TXT_PASTE_PROMPT", value: 43)
!113 = !DIEnumerator(name: "TXT_FILL_5", value: 44)
!114 = !DIEnumerator(name: "TXT_IRSSI_BANNER", value: 45)
!115 = !DIEnumerator(name: "TXT_WELCOME_FIRSTTIME", value: 46)
!116 = !DIEnumerator(name: "TXT_WELCOME_INIT_SETTINGS", value: 47)
!117 = !DIEnumerator(name: "TXT_COUNT", value: 48)
!118 = !{!119, !126, !127, !131, !133, !152}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !120, line: 9, baseType: !121)
!120 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !124, !124, !124, !124, !124, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !129, line: 46, baseType: !130)
!129 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !135, line: 24, baseType: !136)
!135 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 13, size: 320, align: 64, elements: !137)
!137 = !{!138, !572, !654, !655, !656, !657, !658, !659}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !136, file: !135, line: 14, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !141, line: 34, baseType: !142)
!141 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 16, size: 704, align: 64, elements: !143)
!143 = !{!144, !551, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !142, file: !141, line: 17, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !147, line: 117, baseType: !148)
!147 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !149, line: 28, size: 1280, align: 64, elements: !150)
!149 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = !{!151, !153, !155, !156, !157, !166, !516, !517, !518, !519, !520, !521, !522, !523, !524, !543, !544, !545, !546, !547, !548, !549, !550}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !148, file: !149, line: 29, baseType: !152, size: 32, align: 32)
!152 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 30, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !148, file: !149, line: 32, baseType: !152, size: 32, align: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !148, file: !149, line: 32, baseType: !152, size: 32, align: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !148, file: !149, line: 34, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !160, line: 37, baseType: !161)
!160 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !160, line: 39, size: 128, align: 64, elements: !162)
!162 = !{!163, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !160, line: 41, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !129, line: 77, baseType: !126)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !160, line: 42, baseType: !158, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !148, file: !149, line: 35, baseType: !167, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !147, line: 108, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !170, line: 5, size: 704, align: 64, elements: !171)
!170 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = !{!172, !174, !175, !180, !181, !503, !504, !505, !506, !507, !508, !512}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !173, line: 3, baseType: !152, size: 32, align: 32)
!173 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !169, file: !173, line: 4, baseType: !152, size: 32, align: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !169, file: !173, line: 5, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !178, line: 37, baseType: !179)
!178 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !178, line: 37, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !169, file: !173, line: 7, baseType: !126, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !169, file: !173, line: 8, baseType: !182, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !147, line: 107, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !185, line: 30, size: 2240, align: 64, elements: !186)
!185 = !DIFile(filename: "../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!186 = !{!187, !189, !190, !191, !412, !417, !418, !419, !420, !421, !422, !423, !424, !425, !429, !430, !434, !435, !436, !440, !441, !442, !443, !444, !445, !446, !447, !448, !455, !456, !457, !458, !459, !463, !467, !471, !475, !479, !484, !491, !498, !502}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !188, line: 3, baseType: !152, size: 32, align: 32)
!188 = !DIFile(filename: "../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !184, file: !188, line: 4, baseType: !152, size: 32, align: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !184, file: !188, line: 6, baseType: !152, size: 32, align: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !184, file: !188, line: 8, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !147, line: 113, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !185, line: 25, size: 1920, align: 64, elements: !195)
!195 = !{!196, !198, !199, !200, !201, !202, !203, !204, !205, !207, !208, !209, !210, !211, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !197, line: 3, baseType: !152, size: 32, align: 32)
!197 = !DIFile(filename: "../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !194, file: !197, line: 4, baseType: !152, size: 32, align: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !194, file: !197, line: 6, baseType: !152, size: 32, align: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !194, file: !197, line: 9, baseType: !154, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !194, file: !197, line: 10, baseType: !152, size: 32, align: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !194, file: !197, line: 11, baseType: !154, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !194, file: !197, line: 11, baseType: !154, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !194, file: !197, line: 11, baseType: !154, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !194, file: !197, line: 13, baseType: !206, size: 16, align: 16, offset: 448)
!206 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !194, file: !197, line: 14, baseType: !154, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !194, file: !197, line: 15, baseType: !154, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !194, file: !197, line: 16, baseType: !152, size: 32, align: 32, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !194, file: !197, line: 17, baseType: !154, size: 64, align: 64, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !194, file: !197, line: 19, baseType: !212, size: 64, align: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !147, line: 99, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !147, line: 99, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !194, file: !197, line: 19, baseType: !212, size: 64, align: 64, offset: 832)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !194, file: !197, line: 21, baseType: !154, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !194, file: !197, line: 22, baseType: !154, size: 64, align: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !194, file: !197, line: 23, baseType: !154, size: 64, align: 64, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !194, file: !197, line: 24, baseType: !154, size: 64, align: 64, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !194, file: !197, line: 26, baseType: !154, size: 64, align: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !194, file: !197, line: 27, baseType: !154, size: 64, align: 64, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !194, file: !197, line: 28, baseType: !154, size: 64, align: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !194, file: !197, line: 29, baseType: !154, size: 64, align: 64, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !194, file: !197, line: 30, baseType: !154, size: 64, align: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !194, file: !197, line: 31, baseType: !154, size: 64, align: 64, offset: 1472)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !194, file: !197, line: 32, baseType: !154, size: 64, align: 64, offset: 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !194, file: !197, line: 33, baseType: !154, size: 64, align: 64, offset: 1600)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !194, file: !197, line: 35, baseType: !229, size: 64, align: 64, offset: 1664)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !232)
!232 = !{!233, !235, !369, !370, !375, !376, !377, !378, !379, !388, !389, !390, !394, !395, !396, !397, !398, !399, !400, !401}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !231, file: !4, line: 100, baseType: !234, size: 32, align: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !129, line: 49, baseType: !152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !231, file: !4, line: 101, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !239)
!239 = !{!240, !262, !268, !275, !279, !356, !360, !365}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !238, file: !4, line: 133, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !229, !127, !245, !248, !249}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !246, line: 66, baseType: !247)
!246 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!247 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !252, line: 42, baseType: !253)
!252 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !252, line: 44, size: 128, align: 64, elements: !254)
!254 = !{!255, !260, !261}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !253, file: !252, line: 46, baseType: !256, size: 32, align: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !257, line: 36, baseType: !258)
!257 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !246, line: 45, baseType: !259)
!259 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !253, file: !252, line: 47, baseType: !234, size: 32, align: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !253, file: !252, line: 48, baseType: !127, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !238, file: !4, line: 138, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!244, !229, !266, !245, !248, !249}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !238, file: !4, line: 143, baseType: !269, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!244, !229, !272, !274, !249}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !246, line: 51, baseType: !273)
!273 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !238, file: !4, line: 147, baseType: !276, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!244, !229, !249}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !238, file: !4, line: 149, baseType: !280, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !229, !355}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !286)
!286 = !{!287, !288, !309, !338, !340, !344, !345, !346, !347, !348, !349, !350, !351}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !285, file: !16, line: 174, baseType: !164, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !285, file: !16, line: 175, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !292)
!292 = !{!293, !297, !298}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !291, file: !16, line: 198, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !164}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !291, file: !16, line: 199, baseType: !294, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !291, file: !16, line: 200, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !164, !283, !302, !308}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !164}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !129, line: 50, baseType: !234)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !285, file: !16, line: 177, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !314)
!314 = !{!315, !320, !324, !328, !332, !333}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !313, file: !16, line: 216, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!307, !283, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !313, file: !16, line: 218, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!307, !283}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !313, file: !16, line: 219, baseType: !325, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!307, !283, !303, !164}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !313, file: !16, line: 222, baseType: !329, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !283}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !313, file: !16, line: 226, baseType: !303, size: 64, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !313, file: !16, line: 227, baseType: !334, size: 64, align: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !285, file: !16, line: 178, baseType: !339, size: 32, align: 32, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !129, line: 55, baseType: !259)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !285, file: !16, line: 180, baseType: !341, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !343)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !285, file: !16, line: 182, baseType: !234, size: 32, align: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !285, file: !16, line: 183, baseType: !339, size: 32, align: 32, offset: 352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !285, file: !16, line: 184, baseType: !339, size: 32, align: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !285, file: !16, line: 186, baseType: !158, size: 64, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !16, line: 188, baseType: !283, size: 64, align: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !16, line: 189, baseType: !283, size: 64, align: 64, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !16, line: 191, baseType: !154, size: 64, align: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !285, file: !16, line: 193, baseType: !352, size: 64, align: 64, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !354)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !238, file: !4, line: 151, baseType: !357, size: 64, align: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !229}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !238, file: !4, line: 152, baseType: !361, size: 64, align: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!244, !229, !364, !249}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !238, file: !4, line: 155, baseType: !366, size: 64, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!364, !229}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !231, file: !4, line: 103, baseType: !127, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !231, file: !4, line: 104, baseType: !371, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !372, line: 77, baseType: !373)
!372 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !372, line: 77, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !231, file: !4, line: 105, baseType: !371, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !231, file: !4, line: 106, baseType: !127, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !231, file: !4, line: 107, baseType: !339, size: 32, align: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !231, file: !4, line: 109, baseType: !245, size: 64, align: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !231, file: !4, line: 110, baseType: !380, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !382, line: 39, baseType: !383)
!382 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !382, line: 41, size: 192, align: 64, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !383, file: !382, line: 43, baseType: !127, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !383, file: !382, line: 44, baseType: !245, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !383, file: !382, line: 45, baseType: !245, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !231, file: !4, line: 111, baseType: !380, size: 64, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !231, file: !4, line: 112, baseType: !380, size: 64, align: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !231, file: !4, line: 113, baseType: !391, size: 48, align: 8, offset: 704)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 48, align: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 6)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !231, file: !4, line: 117, baseType: !339, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !231, file: !4, line: 118, baseType: !339, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !231, file: !4, line: 119, baseType: !339, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !231, file: !4, line: 120, baseType: !339, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !231, file: !4, line: 121, baseType: !339, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !231, file: !4, line: 122, baseType: !339, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !231, file: !4, line: 124, baseType: !164, size: 64, align: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !231, file: !4, line: 125, baseType: !164, size: 64, align: 64, offset: 832)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !194, file: !197, line: 38, baseType: !259, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !194, file: !197, line: 39, baseType: !259, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !194, file: !197, line: 40, baseType: !259, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !194, file: !197, line: 41, baseType: !259, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !194, file: !197, line: 42, baseType: !259, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !194, file: !197, line: 43, baseType: !259, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !194, file: !197, line: 44, baseType: !259, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !194, file: !197, line: 45, baseType: !259, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !194, file: !197, line: 46, baseType: !154, size: 64, align: 64, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !194, file: !197, line: 47, baseType: !154, size: 64, align: 64, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !184, file: !188, line: 9, baseType: !413, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !414, line: 75, baseType: !415)
!414 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !416, line: 139, baseType: !273)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !184, file: !188, line: 10, baseType: !413, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !184, file: !188, line: 12, baseType: !154, size: 64, align: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !184, file: !188, line: 13, baseType: !154, size: 64, align: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !184, file: !188, line: 15, baseType: !259, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !184, file: !188, line: 16, baseType: !259, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !184, file: !188, line: 17, baseType: !259, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !184, file: !188, line: 18, baseType: !259, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !184, file: !188, line: 19, baseType: !259, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !184, file: !188, line: 21, baseType: !426, size: 64, align: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !147, line: 102, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !147, line: 102, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !184, file: !188, line: 22, baseType: !152, size: 32, align: 32, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !184, file: !188, line: 25, baseType: !431, size: 128, align: 64, offset: 640)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, align: 64, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 2)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !184, file: !188, line: 26, baseType: !152, size: 32, align: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !184, file: !188, line: 27, baseType: !152, size: 32, align: 32, offset: 800)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !184, file: !188, line: 29, baseType: !437, size: 64, align: 64, offset: 832)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !147, line: 103, baseType: !439)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !147, line: 103, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !184, file: !188, line: 30, baseType: !176, size: 64, align: 64, offset: 896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !184, file: !188, line: 32, baseType: !154, size: 64, align: 64, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !184, file: !188, line: 33, baseType: !154, size: 64, align: 64, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !184, file: !188, line: 34, baseType: !154, size: 64, align: 64, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !184, file: !188, line: 35, baseType: !259, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !184, file: !188, line: 36, baseType: !259, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !184, file: !188, line: 37, baseType: !259, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !184, file: !188, line: 38, baseType: !259, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !184, file: !188, line: 40, baseType: !449, size: 128, align: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !129, line: 504, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !129, line: 506, size: 128, align: 64, elements: !451)
!451 = !{!452, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !450, file: !129, line: 508, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !129, line: 48, baseType: !273)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !450, file: !129, line: 509, baseType: !453, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !184, file: !188, line: 41, baseType: !413, size: 64, align: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !184, file: !188, line: 42, baseType: !152, size: 32, align: 32, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !184, file: !188, line: 44, baseType: !158, size: 64, align: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !184, file: !188, line: 45, baseType: !158, size: 64, align: 64, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !184, file: !188, line: 53, baseType: !460, size: 64, align: 64, offset: 1600)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !182, !131, !152}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !184, file: !188, line: 55, baseType: !464, size: 64, align: 64, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!152, !182, !130}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !184, file: !188, line: 57, baseType: !468, size: 64, align: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!152, !182, !131}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !184, file: !188, line: 60, baseType: !472, size: 64, align: 64, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!131, !182}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !184, file: !188, line: 62, baseType: !476, size: 64, align: 64, offset: 1856)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !182, !131, !131, !152}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !184, file: !188, line: 65, baseType: !480, size: 64, align: 64, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !182, !131, !131}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !184, file: !188, line: 69, baseType: !485, size: 64, align: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !182, !131}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !147, line: 109, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !147, line: 109, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !184, file: !188, line: 70, baseType: !492, size: 64, align: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !182, !131}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !147, line: 110, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !147, line: 110, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !184, file: !188, line: 71, baseType: !499, size: 64, align: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!152, !131, !131}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !184, file: !188, line: 73, baseType: !499, size: 64, align: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !169, file: !173, line: 9, baseType: !154, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !173, line: 10, baseType: !154, size: 64, align: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !169, file: !173, line: 11, baseType: !413, size: 64, align: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !169, file: !173, line: 12, baseType: !152, size: 32, align: 32, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !169, file: !173, line: 13, baseType: !154, size: 64, align: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !169, file: !173, line: 15, baseType: !509, size: 64, align: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !167}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !169, file: !173, line: 17, baseType: !513, size: 64, align: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!131, !167}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !148, file: !149, line: 36, baseType: !182, size: 64, align: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !148, file: !149, line: 37, baseType: !182, size: 64, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !148, file: !149, line: 38, baseType: !154, size: 64, align: 64, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !148, file: !149, line: 40, baseType: !152, size: 32, align: 32, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !148, file: !149, line: 41, baseType: !158, size: 64, align: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !148, file: !149, line: 43, baseType: !259, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !148, file: !149, line: 44, baseType: !259, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !148, file: !149, line: 45, baseType: !259, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !148, file: !149, line: 48, baseType: !525, size: 64, align: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !527, line: 14, baseType: !528)
!527 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 6, size: 256, align: 64, elements: !529)
!529 = !{!530, !531, !540, !541, !542}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !527, line: 7, baseType: !154, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !528, file: !527, line: 9, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !534, line: 37, baseType: !535)
!534 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !534, line: 39, size: 192, align: 64, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !534, line: 41, baseType: !164, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !534, line: 42, baseType: !532, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !535, file: !534, line: 43, baseType: !532, size: 64, align: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !528, file: !527, line: 10, baseType: !152, size: 32, align: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !528, file: !527, line: 12, baseType: !152, size: 32, align: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !528, file: !527, line: 13, baseType: !152, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !148, file: !149, line: 49, baseType: !154, size: 64, align: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !148, file: !149, line: 51, baseType: !152, size: 32, align: 32, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !148, file: !149, line: 52, baseType: !154, size: 64, align: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !148, file: !149, line: 54, baseType: !413, size: 64, align: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !148, file: !149, line: 55, baseType: !413, size: 64, align: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !148, file: !149, line: 57, baseType: !154, size: 64, align: 64, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !148, file: !149, line: 58, baseType: !126, size: 64, align: 64, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !148, file: !149, line: 60, baseType: !126, size: 64, align: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !142, file: !141, line: 19, baseType: !552, size: 64, align: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !554, line: 4, baseType: !555)
!554 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !554, line: 4, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !142, file: !141, line: 20, baseType: !152, size: 32, align: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !142, file: !141, line: 22, baseType: !152, size: 32, align: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !142, file: !141, line: 22, baseType: !152, size: 32, align: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !142, file: !141, line: 23, baseType: !152, size: 32, align: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !142, file: !141, line: 23, baseType: !152, size: 32, align: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !142, file: !141, line: 24, baseType: !152, size: 32, align: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !142, file: !141, line: 24, baseType: !152, size: 32, align: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !142, file: !141, line: 26, baseType: !158, size: 64, align: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !142, file: !141, line: 27, baseType: !152, size: 32, align: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !142, file: !141, line: 27, baseType: !152, size: 32, align: 32, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !142, file: !141, line: 28, baseType: !152, size: 32, align: 32, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !142, file: !141, line: 29, baseType: !152, size: 32, align: 32, offset: 544)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !142, file: !141, line: 29, baseType: !152, size: 32, align: 32, offset: 576)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !142, file: !141, line: 30, baseType: !152, size: 32, align: 32, offset: 608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !142, file: !141, line: 32, baseType: !259, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !142, file: !141, line: 33, baseType: !259, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !136, file: !135, line: 15, baseType: !573, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !575, line: 7, baseType: !576)
!575 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !575, line: 50, size: 960, align: 64, elements: !577)
!577 = !{!578, !619, !620, !621, !622, !623, !624, !629, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !576, file: !575, line: 51, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !581, line: 72, baseType: !582)
!581 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 60, size: 448, align: 64, elements: !583)
!583 = !{!584, !585, !602, !603, !604, !615, !616, !617, !618}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !582, file: !581, line: 61, baseType: !158, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !582, file: !581, line: 62, baseType: !586, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !581, line: 52, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !581, line: 34, size: 320, align: 64, elements: !589)
!589 = !{!590, !592, !593, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !588, file: !581, line: 48, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !581, line: 48, baseType: !591, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !588, file: !581, line: 50, baseType: !594, size: 64, align: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !588, file: !581, line: 51, baseType: !597, size: 128, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !581, line: 32, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 29, size: 128, align: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !598, file: !581, line: 30, baseType: !152, size: 32, align: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !598, file: !581, line: 31, baseType: !413, size: 64, align: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !582, file: !581, line: 63, baseType: !152, size: 32, align: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !582, file: !581, line: 65, baseType: !586, size: 64, align: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !582, file: !581, line: 66, baseType: !605, size: 64, align: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !581, line: 58, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 54, size: 131008, align: 32, elements: !608)
!608 = !{!609, !613, !614}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !607, file: !581, line: 55, baseType: !610, size: 130944, align: 8)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 130944, align: 8, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 16368)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !607, file: !581, line: 56, baseType: !152, size: 32, align: 32, offset: 130944)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !607, file: !581, line: 57, baseType: !152, size: 32, align: 32, offset: 130976)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !582, file: !581, line: 68, baseType: !152, size: 32, align: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !582, file: !581, line: 69, baseType: !152, size: 32, align: 32, offset: 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !582, file: !581, line: 70, baseType: !152, size: 32, align: 32, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !582, file: !581, line: 71, baseType: !259, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !576, file: !575, line: 53, baseType: !158, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !576, file: !575, line: 55, baseType: !552, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !576, file: !575, line: 56, baseType: !152, size: 32, align: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !576, file: !575, line: 56, baseType: !152, size: 32, align: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !576, file: !575, line: 58, baseType: !152, size: 32, align: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !576, file: !575, line: 59, baseType: !625, size: 64, align: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !575, line: 10, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!152, !573, !586, !152}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !576, file: !575, line: 61, baseType: !630, size: 64, align: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !575, line: 48, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 37, size: 192, align: 64, elements: !633)
!633 = !{!634, !635, !636, !637, !638}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !632, file: !575, line: 38, baseType: !152, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !632, file: !575, line: 39, baseType: !152, size: 32, align: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !632, file: !575, line: 41, baseType: !176, size: 64, align: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !632, file: !575, line: 45, baseType: !595, size: 8, align: 8, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !632, file: !575, line: 47, baseType: !152, size: 32, align: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !576, file: !575, line: 63, baseType: !152, size: 32, align: 32, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !576, file: !575, line: 66, baseType: !586, size: 64, align: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !576, file: !575, line: 68, baseType: !152, size: 32, align: 32, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !576, file: !575, line: 71, baseType: !586, size: 64, align: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !576, file: !575, line: 72, baseType: !152, size: 32, align: 32, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !576, file: !575, line: 76, baseType: !176, size: 64, align: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !576, file: !575, line: 79, baseType: !152, size: 32, align: 32, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !576, file: !575, line: 82, baseType: !152, size: 32, align: 32, offset: 864)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !576, file: !575, line: 84, baseType: !259, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !576, file: !575, line: 86, baseType: !259, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !576, file: !575, line: 88, baseType: !259, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !576, file: !575, line: 90, baseType: !259, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !576, file: !575, line: 92, baseType: !259, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !576, file: !575, line: 94, baseType: !259, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !576, file: !575, line: 96, baseType: !259, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !136, file: !135, line: 17, baseType: !259, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !136, file: !135, line: 18, baseType: !259, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !136, file: !135, line: 20, baseType: !259, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !136, file: !135, line: 21, baseType: !259, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !136, file: !135, line: 22, baseType: !586, size: 64, align: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !136, file: !135, line: 23, baseType: !413, size: 64, align: 64, offset: 256)
!660 = !{i32 2, !"Dwarf Version", i32 4}
!661 = !{i32 2, !"Debug Info Version", i32 3}
!662 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!663 = distinct !DISubprogram(name: "textbuffer_commands_init", scope: !664, file: !664, line: 376, type: !336, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!664 = !DIFile(filename: "textbuffer-commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!665 = !{}
!666 = !DILocation(line: 378, column: 2, scope: !663)
!667 = !DILocation(line: 379, column: 2, scope: !663)
!668 = !DILocation(line: 380, column: 2, scope: !663)
!669 = !DILocation(line: 381, column: 2, scope: !663)
!670 = !DILocation(line: 382, column: 2, scope: !663)
!671 = !DILocation(line: 383, column: 2, scope: !663)
!672 = !DILocation(line: 384, column: 2, scope: !663)
!673 = !DILocation(line: 385, column: 2, scope: !663)
!674 = !DILocation(line: 386, column: 2, scope: !663)
!675 = !DILocation(line: 387, column: 2, scope: !663)
!676 = !DILocation(line: 389, column: 2, scope: !663)
!677 = !DILocation(line: 390, column: 2, scope: !663)
!678 = !DILocation(line: 391, column: 2, scope: !663)
!679 = !DILocation(line: 393, column: 2, scope: !663)
!680 = !DILocation(line: 394, column: 1, scope: !663)
!681 = distinct !DISubprogram(name: "cmd_clear", scope: !664, file: !664, line: 34, type: !682, isLocal: true, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !131}
!684 = !DILocalVariable(name: "data", arg: 1, scope: !681, file: !664, line: 34, type: !131)
!685 = !DIExpression()
!686 = !DILocation(line: 34, column: 35, scope: !681)
!687 = !DILocalVariable(name: "window", scope: !681, file: !664, line: 36, type: !145)
!688 = !DILocation(line: 36, column: 14, scope: !681)
!689 = !DILocalVariable(name: "optlist", scope: !681, file: !664, line: 37, type: !176)
!690 = !DILocation(line: 37, column: 14, scope: !681)
!691 = !DILocalVariable(name: "refnum", scope: !681, file: !664, line: 38, type: !154)
!692 = !DILocation(line: 38, column: 8, scope: !681)
!693 = !DILocalVariable(name: "free_arg", scope: !681, file: !664, line: 39, type: !126)
!694 = !DILocation(line: 39, column: 8, scope: !681)
!695 = !DILocalVariable(name: "tmp", scope: !681, file: !664, line: 40, type: !158)
!696 = !DILocation(line: 40, column: 10, scope: !681)
!697 = !DILocation(line: 42, column: 2, scope: !681)
!698 = distinct !{!698, !697}
!699 = !DILocation(line: 42, column: 10, scope: !700)
!700 = !DILexicalBlockFile(scope: !701, file: !664, discriminator: 1)
!701 = distinct !DILexicalBlock(scope: !702, file: !664, line: 42, column: 10)
!702 = distinct !DILexicalBlock(scope: !681, file: !664, line: 42, column: 4)
!703 = !DILocation(line: 42, column: 15, scope: !700)
!704 = !DILocation(line: 42, column: 5, scope: !705)
!705 = !DILexicalBlockFile(scope: !706, file: !664, discriminator: 2)
!706 = distinct !DILexicalBlock(scope: !701, file: !664, line: 42, column: 3)
!707 = !DILocation(line: 42, column: 14, scope: !708)
!708 = !DILexicalBlockFile(scope: !709, file: !664, discriminator: 3)
!709 = distinct !DILexicalBlock(scope: !701, file: !664, line: 42, column: 12)
!710 = !DILocation(line: 42, column: 99, scope: !708)
!711 = !DILocation(line: 42, column: 110, scope: !712)
!712 = !DILexicalBlockFile(scope: !702, file: !664, discriminator: 4)
!713 = !DILocation(line: 44, column: 22, scope: !714)
!714 = distinct !DILexicalBlock(scope: !681, file: !664, line: 44, column: 6)
!715 = !DILocation(line: 44, column: 7, scope: !714)
!716 = !DILocation(line: 44, column: 6, scope: !681)
!717 = !DILocation(line: 45, column: 37, scope: !714)
!718 = !DILocation(line: 47, column: 26, scope: !719)
!719 = distinct !DILexicalBlock(scope: !681, file: !664, line: 47, column: 6)
!720 = !DILocation(line: 47, column: 6, scope: !719)
!721 = !DILocation(line: 47, column: 42, scope: !719)
!722 = !DILocation(line: 47, column: 6, scope: !681)
!723 = !DILocation(line: 49, column: 14, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !664, line: 49, column: 3)
!725 = distinct !DILexicalBlock(scope: !719, file: !664, line: 47, column: 50)
!726 = !DILocation(line: 49, column: 12, scope: !724)
!727 = !DILocation(line: 49, column: 8, scope: !724)
!728 = !DILocation(line: 49, column: 23, scope: !729)
!729 = !DILexicalBlockFile(scope: !730, file: !664, discriminator: 1)
!730 = distinct !DILexicalBlock(scope: !724, file: !664, line: 49, column: 3)
!731 = !DILocation(line: 49, column: 27, scope: !729)
!732 = !DILocation(line: 49, column: 3, scope: !729)
!733 = !DILocation(line: 50, column: 13, scope: !734)
!734 = distinct !DILexicalBlock(scope: !730, file: !664, line: 49, column: 52)
!735 = !DILocation(line: 50, column: 18, scope: !734)
!736 = !DILocation(line: 50, column: 11, scope: !734)
!737 = !DILocation(line: 51, column: 48, scope: !734)
!738 = !DILocation(line: 51, column: 57, scope: !734)
!739 = !DILocation(line: 51, column: 27, scope: !734)
!740 = !DILocation(line: 51, column: 69, scope: !734)
!741 = !DILocation(line: 51, column: 4, scope: !734)
!742 = !DILocation(line: 52, column: 3, scope: !734)
!743 = !DILocation(line: 49, column: 41, scope: !744)
!744 = !DILexicalBlockFile(scope: !730, file: !664, discriminator: 2)
!745 = !DILocation(line: 49, column: 46, scope: !744)
!746 = !DILocation(line: 49, column: 39, scope: !744)
!747 = !DILocation(line: 49, column: 3, scope: !744)
!748 = distinct !{!748, !749}
!749 = !DILocation(line: 49, column: 3, scope: !725)
!750 = !DILocation(line: 53, column: 2, scope: !725)
!751 = !DILocation(line: 53, column: 14, scope: !752)
!752 = !DILexicalBlockFile(scope: !753, file: !664, discriminator: 1)
!753 = distinct !DILexicalBlock(scope: !719, file: !664, line: 53, column: 13)
!754 = !DILocation(line: 53, column: 13, scope: !752)
!755 = !DILocation(line: 53, column: 21, scope: !752)
!756 = !DILocation(line: 55, column: 36, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !664, line: 53, column: 30)
!758 = !DILocation(line: 55, column: 31, scope: !757)
!759 = !DILocation(line: 55, column: 12, scope: !760)
!760 = !DILexicalBlockFile(scope: !757, file: !664, discriminator: 1)
!761 = !DILocation(line: 55, column: 10, scope: !757)
!762 = !DILocation(line: 56, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !757, file: !664, line: 56, column: 7)
!764 = !DILocation(line: 56, column: 14, scope: !763)
!765 = !DILocation(line: 56, column: 7, scope: !757)
!766 = !DILocation(line: 57, column: 48, scope: !763)
!767 = !DILocation(line: 57, column: 57, scope: !763)
!768 = !DILocation(line: 57, column: 27, scope: !763)
!769 = !DILocation(line: 57, column: 69, scope: !763)
!770 = !DILocation(line: 57, column: 4, scope: !763)
!771 = !DILocation(line: 58, column: 2, scope: !757)
!772 = !DILocation(line: 60, column: 47, scope: !773)
!773 = distinct !DILexicalBlock(scope: !753, file: !664, line: 58, column: 9)
!774 = !DILocation(line: 60, column: 60, scope: !773)
!775 = !DILocation(line: 60, column: 26, scope: !773)
!776 = !DILocation(line: 60, column: 72, scope: !773)
!777 = !DILocation(line: 60, column: 3, scope: !773)
!778 = !DILocation(line: 63, column: 18, scope: !681)
!779 = !DILocation(line: 63, column: 2, scope: !681)
!780 = !DILocation(line: 64, column: 1, scope: !681)
!781 = !DILocation(line: 64, column: 1, scope: !782)
!782 = !DILexicalBlockFile(scope: !681, file: !664, discriminator: 1)
!783 = distinct !DISubprogram(name: "cmd_window_scroll", scope: !664, file: !664, line: 66, type: !682, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!784 = !DILocalVariable(name: "data", arg: 1, scope: !783, file: !664, line: 66, type: !131)
!785 = !DILocation(line: 66, column: 43, scope: !783)
!786 = !DILocalVariable(name: "gui", scope: !783, file: !664, line: 68, type: !133)
!787 = !DILocation(line: 68, column: 18, scope: !783)
!788 = !DILocation(line: 70, column: 30, scope: !783)
!789 = !DILocation(line: 70, column: 43, scope: !783)
!790 = !DILocation(line: 70, column: 9, scope: !783)
!791 = !DILocation(line: 70, column: 6, scope: !783)
!792 = !DILocation(line: 71, column: 25, scope: !793)
!793 = distinct !DILexicalBlock(scope: !783, file: !664, line: 71, column: 6)
!794 = !DILocation(line: 71, column: 6, scope: !793)
!795 = !DILocation(line: 71, column: 42, scope: !793)
!796 = !DILocation(line: 71, column: 6, scope: !783)
!797 = !DILocation(line: 72, column: 17, scope: !798)
!798 = distinct !DILexicalBlock(scope: !793, file: !664, line: 71, column: 48)
!799 = !DILocation(line: 72, column: 22, scope: !798)
!800 = !DILocation(line: 72, column: 33, scope: !798)
!801 = !DILocation(line: 73, column: 2, scope: !798)
!802 = !DILocation(line: 73, column: 32, scope: !803)
!803 = !DILexicalBlockFile(scope: !804, file: !664, discriminator: 1)
!804 = distinct !DILexicalBlock(scope: !793, file: !664, line: 73, column: 13)
!805 = !DILocation(line: 73, column: 13, scope: !803)
!806 = !DILocation(line: 73, column: 44, scope: !803)
!807 = !DILocation(line: 74, column: 3, scope: !808)
!808 = distinct !DILexicalBlock(scope: !804, file: !664, line: 73, column: 50)
!809 = !DILocation(line: 74, column: 8, scope: !808)
!810 = !DILocation(line: 74, column: 19, scope: !808)
!811 = !DILocation(line: 75, column: 3, scope: !808)
!812 = !DILocation(line: 75, column: 8, scope: !808)
!813 = !DILocation(line: 75, column: 15, scope: !808)
!814 = !DILocation(line: 76, column: 2, scope: !808)
!815 = !DILocation(line: 76, column: 32, scope: !816)
!816 = !DILexicalBlockFile(scope: !817, file: !664, discriminator: 1)
!817 = distinct !DILexicalBlock(scope: !804, file: !664, line: 76, column: 13)
!818 = !DILocation(line: 76, column: 13, scope: !816)
!819 = !DILocation(line: 76, column: 45, scope: !816)
!820 = !DILocation(line: 77, column: 3, scope: !821)
!821 = distinct !DILexicalBlock(scope: !817, file: !664, line: 76, column: 51)
!822 = !DILocation(line: 77, column: 8, scope: !821)
!823 = !DILocation(line: 77, column: 19, scope: !821)
!824 = !DILocation(line: 78, column: 3, scope: !821)
!825 = !DILocation(line: 78, column: 8, scope: !821)
!826 = !DILocation(line: 78, column: 15, scope: !821)
!827 = !DILocation(line: 79, column: 2, scope: !821)
!828 = !DILocation(line: 79, column: 14, scope: !829)
!829 = !DILexicalBlockFile(scope: !830, file: !664, discriminator: 1)
!830 = distinct !DILexicalBlock(scope: !817, file: !664, line: 79, column: 13)
!831 = !DILocation(line: 79, column: 13, scope: !829)
!832 = !DILocation(line: 79, column: 19, scope: !829)
!833 = !DILocation(line: 80, column: 53, scope: !834)
!834 = distinct !DILexicalBlock(scope: !830, file: !664, line: 79, column: 28)
!835 = !DILocation(line: 80, column: 3, scope: !834)
!836 = !DILocation(line: 82, column: 17, scope: !834)
!837 = !DILocation(line: 85, column: 39, scope: !783)
!838 = !DILocation(line: 85, column: 94, scope: !783)
!839 = !DILocation(line: 85, column: 99, scope: !783)
!840 = !DILocation(line: 85, column: 93, scope: !783)
!841 = !DILocation(line: 85, column: 93, scope: !842)
!842 = !DILexicalBlockFile(scope: !783, file: !664, discriminator: 1)
!843 = !DILocation(line: 85, column: 124, scope: !844)
!844 = !DILexicalBlockFile(scope: !783, file: !664, discriminator: 2)
!845 = !DILocation(line: 85, column: 129, scope: !844)
!846 = !DILocation(line: 85, column: 93, scope: !844)
!847 = !DILocation(line: 85, column: 93, scope: !848)
!848 = !DILexicalBlockFile(scope: !783, file: !664, discriminator: 3)
!849 = !DILocation(line: 85, column: 2, scope: !848)
!850 = !DILocation(line: 88, column: 29, scope: !783)
!851 = !DILocation(line: 88, column: 34, scope: !783)
!852 = !DILocation(line: 88, column: 40, scope: !783)
!853 = !DILocation(line: 88, column: 45, scope: !783)
!854 = !DILocation(line: 89, column: 8, scope: !783)
!855 = !DILocation(line: 89, column: 13, scope: !783)
!856 = !DILocation(line: 88, column: 40, scope: !842)
!857 = !DILocation(line: 89, column: 22, scope: !842)
!858 = !DILocation(line: 88, column: 40, scope: !844)
!859 = !DILocation(line: 88, column: 40, scope: !848)
!860 = !DILocation(line: 88, column: 2, scope: !848)
!861 = !DILocation(line: 90, column: 1, scope: !783)
!862 = !DILocation(line: 90, column: 1, scope: !842)
!863 = distinct !DISubprogram(name: "cmd_window_hidelevel", scope: !664, file: !664, line: 93, type: !682, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!864 = !DILocalVariable(name: "data", arg: 1, scope: !863, file: !664, line: 93, type: !131)
!865 = !DILocation(line: 93, column: 46, scope: !863)
!866 = !DILocalVariable(name: "gui", scope: !863, file: !664, line: 95, type: !133)
!867 = !DILocation(line: 95, column: 18, scope: !863)
!868 = !DILocalVariable(name: "level", scope: !863, file: !664, line: 96, type: !154)
!869 = !DILocation(line: 96, column: 8, scope: !863)
!870 = !DILocation(line: 98, column: 2, scope: !863)
!871 = distinct !{!871, !870}
!872 = !DILocation(line: 98, column: 10, scope: !873)
!873 = !DILexicalBlockFile(scope: !874, file: !664, discriminator: 1)
!874 = distinct !DILexicalBlock(scope: !875, file: !664, line: 98, column: 10)
!875 = distinct !DILexicalBlock(scope: !863, file: !664, line: 98, column: 4)
!876 = !DILocation(line: 98, column: 15, scope: !873)
!877 = !DILocation(line: 98, column: 5, scope: !878)
!878 = !DILexicalBlockFile(scope: !879, file: !664, discriminator: 2)
!879 = distinct !DILexicalBlock(scope: !874, file: !664, line: 98, column: 3)
!880 = !DILocation(line: 98, column: 14, scope: !881)
!881 = !DILexicalBlockFile(scope: !882, file: !664, discriminator: 3)
!882 = distinct !DILexicalBlock(scope: !874, file: !664, line: 98, column: 12)
!883 = !DILocation(line: 98, column: 99, scope: !881)
!884 = !DILocation(line: 98, column: 110, scope: !885)
!885 = !DILexicalBlockFile(scope: !875, file: !664, discriminator: 4)
!886 = !DILocation(line: 100, column: 30, scope: !863)
!887 = !DILocation(line: 100, column: 43, scope: !863)
!888 = !DILocation(line: 100, column: 9, scope: !863)
!889 = !DILocation(line: 100, column: 6, scope: !863)
!890 = !DILocation(line: 101, column: 35, scope: !863)
!891 = !DILocation(line: 101, column: 40, scope: !863)
!892 = !DILocation(line: 102, column: 21, scope: !863)
!893 = !DILocation(line: 102, column: 26, scope: !863)
!894 = !DILocation(line: 102, column: 32, scope: !863)
!895 = !DILocation(line: 102, column: 46, scope: !863)
!896 = !DILocation(line: 102, column: 7, scope: !863)
!897 = !DILocation(line: 101, column: 2, scope: !863)
!898 = !DILocation(line: 103, column: 25, scope: !863)
!899 = !DILocation(line: 103, column: 30, scope: !863)
!900 = !DILocation(line: 103, column: 2, scope: !863)
!901 = !DILocation(line: 104, column: 10, scope: !863)
!902 = !DILocation(line: 104, column: 15, scope: !863)
!903 = !DILocation(line: 104, column: 21, scope: !863)
!904 = !DILocation(line: 104, column: 34, scope: !863)
!905 = !DILocation(line: 104, column: 41, scope: !906)
!906 = !DILexicalBlockFile(scope: !863, file: !664, discriminator: 1)
!907 = !DILocation(line: 104, column: 10, scope: !906)
!908 = !DILocation(line: 105, column: 14, scope: !863)
!909 = !DILocation(line: 105, column: 19, scope: !863)
!910 = !DILocation(line: 105, column: 25, scope: !863)
!911 = !DILocation(line: 105, column: 3, scope: !863)
!912 = !DILocation(line: 104, column: 10, scope: !913)
!913 = !DILexicalBlockFile(scope: !863, file: !664, discriminator: 2)
!914 = !DILocation(line: 104, column: 10, scope: !915)
!915 = !DILexicalBlockFile(scope: !863, file: !664, discriminator: 3)
!916 = !DILocation(line: 104, column: 8, scope: !915)
!917 = !DILocation(line: 106, column: 39, scope: !863)
!918 = !DILocation(line: 106, column: 96, scope: !863)
!919 = !DILocation(line: 106, column: 2, scope: !863)
!920 = !DILocation(line: 108, column: 9, scope: !863)
!921 = !DILocation(line: 108, column: 2, scope: !863)
!922 = !DILocation(line: 109, column: 1, scope: !863)
!923 = !DILocation(line: 109, column: 1, scope: !906)
!924 = distinct !DISubprogram(name: "cmd_scrollback", scope: !664, file: !664, line: 111, type: !925, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !131, !182, !167}
!927 = !DILocalVariable(name: "data", arg: 1, scope: !924, file: !664, line: 111, type: !131)
!928 = !DILocation(line: 111, column: 40, scope: !924)
!929 = !DILocalVariable(name: "server", arg: 2, scope: !924, file: !664, line: 111, type: !182)
!930 = !DILocation(line: 111, column: 58, scope: !924)
!931 = !DILocalVariable(name: "item", arg: 3, scope: !924, file: !664, line: 112, type: !167)
!932 = !DILocation(line: 112, column: 20, scope: !924)
!933 = !DILocation(line: 114, column: 31, scope: !924)
!934 = !DILocation(line: 114, column: 37, scope: !924)
!935 = !DILocation(line: 114, column: 45, scope: !924)
!936 = !DILocation(line: 114, column: 2, scope: !924)
!937 = !DILocation(line: 115, column: 1, scope: !924)
!938 = distinct !DISubprogram(name: "cmd_scrollback_clear", scope: !664, file: !664, line: 118, type: !682, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!939 = !DILocalVariable(name: "data", arg: 1, scope: !938, file: !664, line: 118, type: !131)
!940 = !DILocation(line: 118, column: 46, scope: !938)
!941 = !DILocalVariable(name: "window", scope: !938, file: !664, line: 120, type: !145)
!942 = !DILocation(line: 120, column: 14, scope: !938)
!943 = !DILocalVariable(name: "optlist", scope: !938, file: !664, line: 121, type: !176)
!944 = !DILocation(line: 121, column: 14, scope: !938)
!945 = !DILocalVariable(name: "refnum", scope: !938, file: !664, line: 122, type: !154)
!946 = !DILocation(line: 122, column: 8, scope: !938)
!947 = !DILocalVariable(name: "free_arg", scope: !938, file: !664, line: 123, type: !126)
!948 = !DILocation(line: 123, column: 8, scope: !938)
!949 = !DILocalVariable(name: "tmp", scope: !938, file: !664, line: 124, type: !158)
!950 = !DILocation(line: 124, column: 10, scope: !938)
!951 = !DILocation(line: 126, column: 2, scope: !938)
!952 = distinct !{!952, !951}
!953 = !DILocation(line: 126, column: 10, scope: !954)
!954 = !DILexicalBlockFile(scope: !955, file: !664, discriminator: 1)
!955 = distinct !DILexicalBlock(scope: !956, file: !664, line: 126, column: 10)
!956 = distinct !DILexicalBlock(scope: !938, file: !664, line: 126, column: 4)
!957 = !DILocation(line: 126, column: 15, scope: !954)
!958 = !DILocation(line: 126, column: 5, scope: !959)
!959 = !DILexicalBlockFile(scope: !960, file: !664, discriminator: 2)
!960 = distinct !DILexicalBlock(scope: !955, file: !664, line: 126, column: 3)
!961 = !DILocation(line: 126, column: 14, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !664, discriminator: 3)
!963 = distinct !DILexicalBlock(scope: !955, file: !664, line: 126, column: 12)
!964 = !DILocation(line: 126, column: 99, scope: !962)
!965 = !DILocation(line: 126, column: 110, scope: !966)
!966 = !DILexicalBlockFile(scope: !956, file: !664, discriminator: 4)
!967 = !DILocation(line: 128, column: 22, scope: !968)
!968 = distinct !DILexicalBlock(scope: !938, file: !664, line: 128, column: 6)
!969 = !DILocation(line: 128, column: 7, scope: !968)
!970 = !DILocation(line: 128, column: 6, scope: !938)
!971 = !DILocation(line: 129, column: 48, scope: !968)
!972 = !DILocation(line: 131, column: 26, scope: !973)
!973 = distinct !DILexicalBlock(scope: !938, file: !664, line: 131, column: 6)
!974 = !DILocation(line: 131, column: 6, scope: !973)
!975 = !DILocation(line: 131, column: 42, scope: !973)
!976 = !DILocation(line: 131, column: 6, scope: !938)
!977 = !DILocation(line: 133, column: 14, scope: !978)
!978 = distinct !DILexicalBlock(scope: !979, file: !664, line: 133, column: 3)
!979 = distinct !DILexicalBlock(scope: !973, file: !664, line: 131, column: 50)
!980 = !DILocation(line: 133, column: 12, scope: !978)
!981 = !DILocation(line: 133, column: 8, scope: !978)
!982 = !DILocation(line: 133, column: 23, scope: !983)
!983 = !DILexicalBlockFile(scope: !984, file: !664, discriminator: 1)
!984 = distinct !DILexicalBlock(scope: !978, file: !664, line: 133, column: 3)
!985 = !DILocation(line: 133, column: 27, scope: !983)
!986 = !DILocation(line: 133, column: 3, scope: !983)
!987 = !DILocation(line: 134, column: 13, scope: !988)
!988 = distinct !DILexicalBlock(scope: !984, file: !664, line: 133, column: 52)
!989 = !DILocation(line: 134, column: 18, scope: !988)
!990 = !DILocation(line: 134, column: 11, scope: !988)
!991 = !DILocation(line: 135, column: 59, scope: !988)
!992 = !DILocation(line: 135, column: 68, scope: !988)
!993 = !DILocation(line: 135, column: 38, scope: !988)
!994 = !DILocation(line: 135, column: 80, scope: !988)
!995 = !DILocation(line: 135, column: 4, scope: !988)
!996 = !DILocation(line: 136, column: 3, scope: !988)
!997 = !DILocation(line: 133, column: 41, scope: !998)
!998 = !DILexicalBlockFile(scope: !984, file: !664, discriminator: 2)
!999 = !DILocation(line: 133, column: 46, scope: !998)
!1000 = !DILocation(line: 133, column: 39, scope: !998)
!1001 = !DILocation(line: 133, column: 3, scope: !998)
!1002 = distinct !{!1002, !1003}
!1003 = !DILocation(line: 133, column: 3, scope: !979)
!1004 = !DILocation(line: 137, column: 2, scope: !979)
!1005 = !DILocation(line: 137, column: 14, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !1007, file: !664, discriminator: 1)
!1007 = distinct !DILexicalBlock(scope: !973, file: !664, line: 137, column: 13)
!1008 = !DILocation(line: 137, column: 13, scope: !1006)
!1009 = !DILocation(line: 137, column: 21, scope: !1006)
!1010 = !DILocation(line: 139, column: 36, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !664, line: 137, column: 30)
!1012 = !DILocation(line: 139, column: 31, scope: !1011)
!1013 = !DILocation(line: 139, column: 12, scope: !1014)
!1014 = !DILexicalBlockFile(scope: !1011, file: !664, discriminator: 1)
!1015 = !DILocation(line: 139, column: 10, scope: !1011)
!1016 = !DILocation(line: 140, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1011, file: !664, line: 140, column: 7)
!1018 = !DILocation(line: 140, column: 14, scope: !1017)
!1019 = !DILocation(line: 140, column: 7, scope: !1011)
!1020 = !DILocation(line: 141, column: 59, scope: !1017)
!1021 = !DILocation(line: 141, column: 68, scope: !1017)
!1022 = !DILocation(line: 141, column: 38, scope: !1017)
!1023 = !DILocation(line: 141, column: 80, scope: !1017)
!1024 = !DILocation(line: 141, column: 4, scope: !1017)
!1025 = !DILocation(line: 142, column: 2, scope: !1011)
!1026 = !DILocation(line: 144, column: 58, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1007, file: !664, line: 142, column: 9)
!1028 = !DILocation(line: 144, column: 71, scope: !1027)
!1029 = !DILocation(line: 144, column: 37, scope: !1027)
!1030 = !DILocation(line: 144, column: 83, scope: !1027)
!1031 = !DILocation(line: 144, column: 3, scope: !1027)
!1032 = !DILocation(line: 147, column: 18, scope: !938)
!1033 = !DILocation(line: 147, column: 2, scope: !938)
!1034 = !DILocation(line: 148, column: 1, scope: !938)
!1035 = !DILocation(line: 148, column: 1, scope: !1036)
!1036 = !DILexicalBlockFile(scope: !938, file: !664, discriminator: 1)
!1037 = distinct !DISubprogram(name: "cmd_scrollback_levelclear", scope: !664, file: !664, line: 151, type: !682, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!1038 = !DILocalVariable(name: "data", arg: 1, scope: !1037, file: !664, line: 151, type: !131)
!1039 = !DILocation(line: 151, column: 51, scope: !1037)
!1040 = !DILocalVariable(name: "window", scope: !1037, file: !664, line: 153, type: !145)
!1041 = !DILocation(line: 153, column: 14, scope: !1037)
!1042 = !DILocalVariable(name: "optlist", scope: !1037, file: !664, line: 154, type: !176)
!1043 = !DILocation(line: 154, column: 14, scope: !1037)
!1044 = !DILocalVariable(name: "refnum", scope: !1037, file: !664, line: 155, type: !154)
!1045 = !DILocation(line: 155, column: 8, scope: !1037)
!1046 = !DILocalVariable(name: "free_arg", scope: !1037, file: !664, line: 156, type: !126)
!1047 = !DILocation(line: 156, column: 8, scope: !1037)
!1048 = !DILocalVariable(name: "tmp", scope: !1037, file: !664, line: 157, type: !158)
!1049 = !DILocation(line: 157, column: 10, scope: !1037)
!1050 = !DILocalVariable(name: "level", scope: !1037, file: !664, line: 158, type: !152)
!1051 = !DILocation(line: 158, column: 6, scope: !1037)
!1052 = !DILocalVariable(name: "levelarg", scope: !1037, file: !664, line: 159, type: !154)
!1053 = !DILocation(line: 159, column: 8, scope: !1037)
!1054 = !DILocation(line: 161, column: 2, scope: !1037)
!1055 = distinct !{!1055, !1054}
!1056 = !DILocation(line: 161, column: 10, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !1058, file: !664, discriminator: 1)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !664, line: 161, column: 10)
!1059 = distinct !DILexicalBlock(scope: !1037, file: !664, line: 161, column: 4)
!1060 = !DILocation(line: 161, column: 15, scope: !1057)
!1061 = !DILocation(line: 161, column: 5, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1063, file: !664, discriminator: 2)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !664, line: 161, column: 3)
!1064 = !DILocation(line: 161, column: 14, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1066, file: !664, discriminator: 3)
!1066 = distinct !DILexicalBlock(scope: !1058, file: !664, line: 161, column: 12)
!1067 = !DILocation(line: 161, column: 99, scope: !1065)
!1068 = !DILocation(line: 161, column: 110, scope: !1069)
!1069 = !DILexicalBlockFile(scope: !1059, file: !664, discriminator: 4)
!1070 = !DILocation(line: 163, column: 22, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1037, file: !664, line: 163, column: 6)
!1072 = !DILocation(line: 163, column: 7, scope: !1071)
!1073 = !DILocation(line: 163, column: 6, scope: !1037)
!1074 = !DILocation(line: 164, column: 53, scope: !1071)
!1075 = !DILocation(line: 166, column: 33, scope: !1037)
!1076 = !DILocation(line: 166, column: 13, scope: !1037)
!1077 = !DILocation(line: 166, column: 11, scope: !1037)
!1078 = !DILocation(line: 167, column: 11, scope: !1037)
!1079 = !DILocation(line: 167, column: 20, scope: !1037)
!1080 = !DILocation(line: 167, column: 27, scope: !1037)
!1081 = !DILocation(line: 167, column: 31, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1037, file: !664, discriminator: 1)
!1083 = !DILocation(line: 167, column: 30, scope: !1082)
!1084 = !DILocation(line: 167, column: 40, scope: !1082)
!1085 = !DILocation(line: 167, column: 10, scope: !1082)
!1086 = !DILocation(line: 167, column: 10, scope: !1087)
!1087 = !DILexicalBlockFile(scope: !1037, file: !664, discriminator: 2)
!1088 = !DILocation(line: 168, column: 28, scope: !1037)
!1089 = !DILocation(line: 168, column: 14, scope: !1037)
!1090 = !DILocation(line: 168, column: 3, scope: !1082)
!1091 = !DILocation(line: 167, column: 10, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1037, file: !664, discriminator: 3)
!1093 = !DILocation(line: 167, column: 10, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1037, file: !664, discriminator: 4)
!1095 = !DILocation(line: 167, column: 8, scope: !1094)
!1096 = !DILocation(line: 169, column: 6, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1037, file: !664, line: 169, column: 6)
!1098 = !DILocation(line: 169, column: 12, scope: !1097)
!1099 = !DILocation(line: 169, column: 6, scope: !1037)
!1100 = !DILocation(line: 170, column: 19, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1097, file: !664, line: 169, column: 18)
!1102 = !DILocation(line: 170, column: 3, scope: !1101)
!1103 = !DILocation(line: 171, column: 3, scope: !1101)
!1104 = !DILocation(line: 174, column: 26, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1037, file: !664, line: 174, column: 6)
!1106 = !DILocation(line: 174, column: 6, scope: !1105)
!1107 = !DILocation(line: 174, column: 42, scope: !1105)
!1108 = !DILocation(line: 174, column: 6, scope: !1037)
!1109 = !DILocation(line: 176, column: 14, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !664, line: 176, column: 3)
!1111 = distinct !DILexicalBlock(scope: !1105, file: !664, line: 174, column: 50)
!1112 = !DILocation(line: 176, column: 12, scope: !1110)
!1113 = !DILocation(line: 176, column: 8, scope: !1110)
!1114 = !DILocation(line: 176, column: 23, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1116, file: !664, discriminator: 1)
!1116 = distinct !DILexicalBlock(scope: !1110, file: !664, line: 176, column: 3)
!1117 = !DILocation(line: 176, column: 27, scope: !1115)
!1118 = !DILocation(line: 176, column: 3, scope: !1115)
!1119 = !DILocation(line: 177, column: 13, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1116, file: !664, line: 176, column: 52)
!1121 = !DILocation(line: 177, column: 18, scope: !1120)
!1122 = !DILocation(line: 177, column: 11, scope: !1120)
!1123 = !DILocation(line: 178, column: 64, scope: !1120)
!1124 = !DILocation(line: 178, column: 73, scope: !1120)
!1125 = !DILocation(line: 178, column: 43, scope: !1120)
!1126 = !DILocation(line: 178, column: 85, scope: !1120)
!1127 = !DILocation(line: 178, column: 91, scope: !1120)
!1128 = !DILocation(line: 178, column: 4, scope: !1120)
!1129 = !DILocation(line: 179, column: 3, scope: !1120)
!1130 = !DILocation(line: 176, column: 41, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1116, file: !664, discriminator: 2)
!1132 = !DILocation(line: 176, column: 46, scope: !1131)
!1133 = !DILocation(line: 176, column: 39, scope: !1131)
!1134 = !DILocation(line: 176, column: 3, scope: !1131)
!1135 = distinct !{!1135, !1136}
!1136 = !DILocation(line: 176, column: 3, scope: !1111)
!1137 = !DILocation(line: 180, column: 2, scope: !1111)
!1138 = !DILocation(line: 180, column: 14, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1140, file: !664, discriminator: 1)
!1140 = distinct !DILexicalBlock(scope: !1105, file: !664, line: 180, column: 13)
!1141 = !DILocation(line: 180, column: 13, scope: !1139)
!1142 = !DILocation(line: 180, column: 21, scope: !1139)
!1143 = !DILocation(line: 182, column: 36, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1140, file: !664, line: 180, column: 30)
!1145 = !DILocation(line: 182, column: 31, scope: !1144)
!1146 = !DILocation(line: 182, column: 12, scope: !1147)
!1147 = !DILexicalBlockFile(scope: !1144, file: !664, discriminator: 1)
!1148 = !DILocation(line: 182, column: 10, scope: !1144)
!1149 = !DILocation(line: 183, column: 7, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1144, file: !664, line: 183, column: 7)
!1151 = !DILocation(line: 183, column: 14, scope: !1150)
!1152 = !DILocation(line: 183, column: 7, scope: !1144)
!1153 = !DILocation(line: 184, column: 64, scope: !1150)
!1154 = !DILocation(line: 184, column: 73, scope: !1150)
!1155 = !DILocation(line: 184, column: 43, scope: !1150)
!1156 = !DILocation(line: 184, column: 85, scope: !1150)
!1157 = !DILocation(line: 184, column: 91, scope: !1150)
!1158 = !DILocation(line: 184, column: 4, scope: !1150)
!1159 = !DILocation(line: 185, column: 2, scope: !1144)
!1160 = !DILocation(line: 187, column: 63, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1140, file: !664, line: 185, column: 9)
!1162 = !DILocation(line: 187, column: 76, scope: !1161)
!1163 = !DILocation(line: 187, column: 42, scope: !1161)
!1164 = !DILocation(line: 187, column: 88, scope: !1161)
!1165 = !DILocation(line: 187, column: 94, scope: !1161)
!1166 = !DILocation(line: 187, column: 3, scope: !1161)
!1167 = !DILocation(line: 190, column: 18, scope: !1037)
!1168 = !DILocation(line: 190, column: 2, scope: !1037)
!1169 = !DILocation(line: 191, column: 1, scope: !1037)
!1170 = !DILocation(line: 191, column: 1, scope: !1082)
!1171 = distinct !DISubprogram(name: "cmd_scrollback_goto", scope: !664, file: !664, line: 282, type: !682, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !665)
!1172 = !DILocalVariable(name: "data", arg: 1, scope: !1171, file: !664, line: 282, type: !131)
!1173 = !DILocation(line: 282, column: 45, scope: !1171)
!1174 = !DILocalVariable(name: "datearg", scope: !1171, file: !664, line: 284, type: !154)
!1175 = !DILocation(line: 284, column: 8, scope: !1171)
!1176 = !DILocalVariable(name: "timearg", scope: !1171, file: !664, line: 284, type: !154)
!1177 = !DILocation(line: 284, column: 18, scope: !1171)
!1178 = !DILocalVariable(name: "free_arg", scope: !1171, file: !664, line: 285, type: !126)
!1179 = !DILocation(line: 285, column: 8, scope: !1171)
!1180 = !DILocalVariable(name: "lines", scope: !1171, file: !664, line: 286, type: !152)
!1181 = !DILocation(line: 286, column: 6, scope: !1171)
!1182 = !DILocation(line: 288, column: 22, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1171, file: !664, line: 288, column: 6)
!1184 = !DILocation(line: 288, column: 7, scope: !1183)
!1185 = !DILocation(line: 288, column: 6, scope: !1171)
!1186 = !DILocation(line: 289, column: 3, scope: !1183)
!1187 = !DILocation(line: 291, column: 7, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1171, file: !664, line: 291, column: 6)
!1189 = !DILocation(line: 291, column: 6, scope: !1188)
!1190 = !DILocation(line: 291, column: 15, scope: !1188)
!1191 = !DILocation(line: 291, column: 23, scope: !1188)
