; ModuleID = './line131-irc-nicklist.o.i'
source_filename = "./line131-irc-nicklist.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._NICK_REC = type { i32, i32, i64, i8*, i8*, i8*, i32, i8, [8 x i8], i8*, %struct._NICK_REC* }
%struct._IRC_CHANNEL_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._IRC_SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)*, i8*, i8*, i64, %struct._GHashTable*, %struct._NICK_REC*, i8, i8*, i32, i8*, i16, i8* (%struct._CHANNEL_REC*)*, %struct._GSList*, i64, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !35)
!1 = !DIFile(filename: "line131-irc-nicklist.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !{!36, !468, !121, !449, !52, !500, !659, !361, !44, !666, !54}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !38, line: 7, baseType: !39)
!38 = !DIFile(filename: "irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !40, line: 15, size: 1600, align: 64, elements: !41)
!40 = !DIFile(filename: "irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!41 = !{!42, !45, !46, !51, !53, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !43, line: 3, baseType: !44, size: 32, align: 32)
!43 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !39, file: !43, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !39, file: !43, line: 5, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !49, line: 37, baseType: !50)
!49 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !49, line: 37, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !39, file: !43, line: 7, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !39, file: !43, line: 8, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !38, line: 6, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !57, line: 42, size: 39168, align: 64, elements: !58)
!57 = !DIFile(filename: "irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !{!59, !61, !62, !63, !310, !315, !316, !317, !318, !319, !320, !321, !322, !323, !327, !328, !332, !333, !334, !338, !339, !340, !341, !342, !343, !344, !345, !346, !353, !354, !355, !356, !357, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !626, !628}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !60, line: 3, baseType: !44, size: 32, align: 32)
!60 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !56, file: !60, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !56, file: !60, line: 6, baseType: !44, size: 32, align: 32, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !56, file: !60, line: 8, baseType: !64, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !38, line: 5, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !57, line: 24, size: 2496, align: 64, elements: !67)
!67 = !{!68, !70, !71, !72, !75, !76, !77, !78, !79, !81, !82, !83, !84, !85, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !69, line: 3, baseType: !44, size: 32, align: 32)
!69 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !66, file: !69, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !66, file: !69, line: 6, baseType: !44, size: 32, align: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !66, file: !69, line: 9, baseType: !73, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !66, file: !69, line: 10, baseType: !44, size: 32, align: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !66, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !66, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !66, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !66, file: !69, line: 13, baseType: !80, size: 16, align: 16, offset: 448)
!80 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !66, file: !69, line: 14, baseType: !73, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !66, file: !69, line: 15, baseType: !73, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !66, file: !69, line: 16, baseType: !44, size: 32, align: 32, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !66, file: !69, line: 17, baseType: !73, size: 64, align: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !66, file: !69, line: 19, baseType: !86, size: 64, align: 64, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !88, line: 99, baseType: !89)
!88 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !88, line: 99, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !66, file: !69, line: 19, baseType: !86, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !66, file: !69, line: 21, baseType: !73, size: 64, align: 64, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !66, file: !69, line: 22, baseType: !73, size: 64, align: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !66, file: !69, line: 23, baseType: !73, size: 64, align: 64, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !66, file: !69, line: 24, baseType: !73, size: 64, align: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !66, file: !69, line: 26, baseType: !73, size: 64, align: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !66, file: !69, line: 27, baseType: !73, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !66, file: !69, line: 28, baseType: !73, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !66, file: !69, line: 29, baseType: !73, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !66, file: !69, line: 30, baseType: !73, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !66, file: !69, line: 31, baseType: !73, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !66, file: !69, line: 32, baseType: !73, size: 64, align: 64, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !66, file: !69, line: 33, baseType: !73, size: 64, align: 64, offset: 1600)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !66, file: !69, line: 35, baseType: !104, size: 64, align: 64, offset: 1664)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !107)
!107 = !{!108, !111, !255, !256, !261, !262, !263, !264, !265, !274, !275, !276, !280, !281, !282, !283, !284, !285, !286, !287}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !106, file: !4, line: 100, baseType: !109, size: 32, align: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !110, line: 49, baseType: !44)
!110 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !106, file: !4, line: 101, baseType: !112, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !115)
!115 = !{!116, !140, !146, !153, !157, !242, !246, !251}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !114, file: !4, line: 133, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !104, !121, !123, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !110, line: 46, baseType: !74)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !124, line: 66, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !130, line: 42, baseType: !131)
!130 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !130, line: 44, size: 128, align: 64, elements: !132)
!132 = !{!133, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !131, file: !130, line: 46, baseType: !134, size: 32, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !135, line: 36, baseType: !136)
!135 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !124, line: 45, baseType: !137)
!137 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !131, file: !130, line: 47, baseType: !109, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !131, file: !130, line: 48, baseType: !121, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !114, file: !4, line: 138, baseType: !141, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!120, !104, !144, !123, !126, !127}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !114, file: !4, line: 143, baseType: !147, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!120, !104, !150, !152, !127}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !124, line: 51, baseType: !151)
!151 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !114, file: !4, line: 147, baseType: !154, size: 64, align: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!120, !104, !127}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !114, file: !4, line: 149, baseType: !158, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!161, !104, !241}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !164)
!164 = !{!165, !167, !188, !217, !219, !223, !224, !225, !226, !234, !235, !236, !237}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !163, file: !16, line: 174, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !110, line: 77, baseType: !52)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !163, file: !16, line: 175, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !171)
!171 = !{!172, !176, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !170, file: !16, line: 198, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !166}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !170, file: !16, line: 199, baseType: !173, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !170, file: !16, line: 200, baseType: !178, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !166, !161, !181, !187}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !166}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !110, line: 50, baseType: !109)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !163, file: !16, line: 177, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !193)
!193 = !{!194, !199, !203, !207, !211, !212}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !192, file: !16, line: 216, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!186, !161, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !192, file: !16, line: 218, baseType: !200, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!186, !161}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !192, file: !16, line: 219, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!186, !161, !182, !166}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !192, file: !16, line: 222, baseType: !208, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !161}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !192, file: !16, line: 226, baseType: !182, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !192, file: !16, line: 227, baseType: !213, size: 64, align: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{null}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !163, file: !16, line: 178, baseType: !218, size: 32, align: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !110, line: 55, baseType: !137)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !163, file: !16, line: 180, baseType: !220, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !163, file: !16, line: 182, baseType: !109, size: 32, align: 32, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !16, line: 183, baseType: !218, size: 32, align: 32, offset: 352)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !163, file: !16, line: 184, baseType: !218, size: 32, align: 32, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !163, file: !16, line: 186, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !229, line: 37, baseType: !230)
!229 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !229, line: 39, size: 128, align: 64, elements: !231)
!231 = !{!232, !233}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !229, line: 41, baseType: !166, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !229, line: 42, baseType: !227, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !163, file: !16, line: 188, baseType: !161, size: 64, align: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !16, line: 189, baseType: !161, size: 64, align: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !16, line: 191, baseType: !73, size: 64, align: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !163, file: !16, line: 193, baseType: !238, size: 64, align: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !114, file: !4, line: 151, baseType: !243, size: 64, align: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !104}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !114, file: !4, line: 152, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!120, !104, !250, !127}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !114, file: !4, line: 155, baseType: !252, size: 64, align: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!250, !104}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !106, file: !4, line: 103, baseType: !121, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !106, file: !4, line: 104, baseType: !257, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !258, line: 77, baseType: !259)
!258 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !258, line: 77, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !106, file: !4, line: 105, baseType: !257, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !106, file: !4, line: 106, baseType: !121, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !106, file: !4, line: 107, baseType: !218, size: 32, align: 32, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !106, file: !4, line: 109, baseType: !123, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !106, file: !4, line: 110, baseType: !266, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !268, line: 39, baseType: !269)
!268 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !268, line: 41, size: 192, align: 64, elements: !270)
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !269, file: !268, line: 43, baseType: !121, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !268, line: 44, baseType: !123, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !269, file: !268, line: 45, baseType: !123, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !106, file: !4, line: 111, baseType: !266, size: 64, align: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !106, file: !4, line: 112, baseType: !266, size: 64, align: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !106, file: !4, line: 113, baseType: !277, size: 48, align: 8, offset: 704)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 48, align: 8, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 6)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !106, file: !4, line: 117, baseType: !218, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !106, file: !4, line: 118, baseType: !218, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !106, file: !4, line: 119, baseType: !218, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !106, file: !4, line: 120, baseType: !218, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !106, file: !4, line: 121, baseType: !218, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !106, file: !4, line: 122, baseType: !218, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !106, file: !4, line: 124, baseType: !166, size: 64, align: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !106, file: !4, line: 125, baseType: !166, size: 64, align: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !66, file: !69, line: 38, baseType: !137, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !66, file: !69, line: 39, baseType: !137, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !66, file: !69, line: 40, baseType: !137, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !66, file: !69, line: 41, baseType: !137, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !66, file: !69, line: 42, baseType: !137, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !66, file: !69, line: 43, baseType: !137, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !66, file: !69, line: 44, baseType: !137, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !66, file: !69, line: 45, baseType: !137, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !66, file: !69, line: 46, baseType: !73, size: 64, align: 64, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !66, file: !69, line: 47, baseType: !73, size: 64, align: 64, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !66, file: !57, line: 27, baseType: !73, size: 64, align: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !66, file: !57, line: 28, baseType: !73, size: 64, align: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !66, file: !57, line: 30, baseType: !44, size: 32, align: 32, offset: 2048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !66, file: !57, line: 31, baseType: !73, size: 64, align: 64, offset: 2112)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !66, file: !57, line: 32, baseType: !73, size: 64, align: 64, offset: 2176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !66, file: !57, line: 34, baseType: !44, size: 32, align: 32, offset: 2240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !66, file: !57, line: 35, baseType: !44, size: 32, align: 32, offset: 2272)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !66, file: !57, line: 36, baseType: !44, size: 32, align: 32, offset: 2304)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !66, file: !57, line: 38, baseType: !44, size: 32, align: 32, offset: 2336)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !66, file: !57, line: 38, baseType: !44, size: 32, align: 32, offset: 2368)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !66, file: !57, line: 38, baseType: !44, size: 32, align: 32, offset: 2400)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !66, file: !57, line: 38, baseType: !44, size: 32, align: 32, offset: 2432)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !56, file: !60, line: 9, baseType: !311, size: 64, align: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !312, line: 75, baseType: !313)
!312 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !314, line: 139, baseType: !151)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !56, file: !60, line: 10, baseType: !311, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !56, file: !60, line: 12, baseType: !73, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !56, file: !60, line: 13, baseType: !73, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !56, file: !60, line: 15, baseType: !137, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !56, file: !60, line: 16, baseType: !137, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !56, file: !60, line: 17, baseType: !137, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !56, file: !60, line: 18, baseType: !137, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !56, file: !60, line: 19, baseType: !137, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !56, file: !60, line: 21, baseType: !324, size: 64, align: 64, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !88, line: 102, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !88, line: 102, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !56, file: !60, line: 22, baseType: !44, size: 32, align: 32, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !56, file: !60, line: 25, baseType: !329, size: 128, align: 64, offset: 640)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, align: 64, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !56, file: !60, line: 26, baseType: !44, size: 32, align: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !56, file: !60, line: 27, baseType: !44, size: 32, align: 32, offset: 800)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !56, file: !60, line: 29, baseType: !335, size: 64, align: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !88, line: 103, baseType: !337)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !88, line: 103, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !56, file: !60, line: 30, baseType: !47, size: 64, align: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !56, file: !60, line: 32, baseType: !73, size: 64, align: 64, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !56, file: !60, line: 33, baseType: !73, size: 64, align: 64, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !56, file: !60, line: 34, baseType: !73, size: 64, align: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !56, file: !60, line: 35, baseType: !137, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !56, file: !60, line: 36, baseType: !137, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !56, file: !60, line: 37, baseType: !137, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !56, file: !60, line: 38, baseType: !137, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !56, file: !60, line: 40, baseType: !347, size: 128, align: 64, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !110, line: 504, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !110, line: 506, size: 128, align: 64, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !348, file: !110, line: 508, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !110, line: 48, baseType: !151)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !348, file: !110, line: 509, baseType: !351, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !56, file: !60, line: 41, baseType: !311, size: 64, align: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !56, file: !60, line: 42, baseType: !44, size: 32, align: 32, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !56, file: !60, line: 44, baseType: !227, size: 64, align: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !56, file: !60, line: 45, baseType: !227, size: 64, align: 64, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !56, file: !60, line: 53, baseType: !358, size: 64, align: 64, offset: 1600)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361, !449, !44}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !88, line: 107, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !364, line: 30, size: 2240, align: 64, elements: !365)
!364 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!365 = !{!366, !367, !368, !369, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !445, !451, !455, !459, !464, !542, !549, !553}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !363, file: !60, line: 3, baseType: !44, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !363, file: !60, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !363, file: !60, line: 6, baseType: !44, size: 32, align: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !363, file: !60, line: 8, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !88, line: 113, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !364, line: 25, size: 1920, align: 64, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !69, line: 3, baseType: !44, size: 32, align: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !372, file: !69, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !372, file: !69, line: 6, baseType: !44, size: 32, align: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !372, file: !69, line: 9, baseType: !73, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !372, file: !69, line: 10, baseType: !44, size: 32, align: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !372, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !372, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !372, file: !69, line: 11, baseType: !73, size: 64, align: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !372, file: !69, line: 13, baseType: !80, size: 16, align: 16, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !372, file: !69, line: 14, baseType: !73, size: 64, align: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !372, file: !69, line: 15, baseType: !73, size: 64, align: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !372, file: !69, line: 16, baseType: !44, size: 32, align: 32, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !372, file: !69, line: 17, baseType: !73, size: 64, align: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !372, file: !69, line: 19, baseType: !86, size: 64, align: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !372, file: !69, line: 19, baseType: !86, size: 64, align: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !372, file: !69, line: 21, baseType: !73, size: 64, align: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !372, file: !69, line: 22, baseType: !73, size: 64, align: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !372, file: !69, line: 23, baseType: !73, size: 64, align: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !372, file: !69, line: 24, baseType: !73, size: 64, align: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !372, file: !69, line: 26, baseType: !73, size: 64, align: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !372, file: !69, line: 27, baseType: !73, size: 64, align: 64, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !372, file: !69, line: 28, baseType: !73, size: 64, align: 64, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !372, file: !69, line: 29, baseType: !73, size: 64, align: 64, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !372, file: !69, line: 30, baseType: !73, size: 64, align: 64, offset: 1408)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !372, file: !69, line: 31, baseType: !73, size: 64, align: 64, offset: 1472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !372, file: !69, line: 32, baseType: !73, size: 64, align: 64, offset: 1536)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !372, file: !69, line: 33, baseType: !73, size: 64, align: 64, offset: 1600)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !372, file: !69, line: 35, baseType: !104, size: 64, align: 64, offset: 1664)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !372, file: !69, line: 38, baseType: !137, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !372, file: !69, line: 39, baseType: !137, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !372, file: !69, line: 40, baseType: !137, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !372, file: !69, line: 41, baseType: !137, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !372, file: !69, line: 42, baseType: !137, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !372, file: !69, line: 43, baseType: !137, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !372, file: !69, line: 44, baseType: !137, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !372, file: !69, line: 45, baseType: !137, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !372, file: !69, line: 46, baseType: !73, size: 64, align: 64, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !372, file: !69, line: 47, baseType: !73, size: 64, align: 64, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !363, file: !60, line: 9, baseType: !311, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !363, file: !60, line: 10, baseType: !311, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !363, file: !60, line: 12, baseType: !73, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !363, file: !60, line: 13, baseType: !73, size: 64, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !363, file: !60, line: 15, baseType: !137, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !363, file: !60, line: 16, baseType: !137, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !363, file: !60, line: 17, baseType: !137, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !363, file: !60, line: 18, baseType: !137, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !363, file: !60, line: 19, baseType: !137, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !363, file: !60, line: 21, baseType: !324, size: 64, align: 64, offset: 512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !363, file: !60, line: 22, baseType: !44, size: 32, align: 32, offset: 576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !363, file: !60, line: 25, baseType: !329, size: 128, align: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !363, file: !60, line: 26, baseType: !44, size: 32, align: 32, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !363, file: !60, line: 27, baseType: !44, size: 32, align: 32, offset: 800)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !363, file: !60, line: 29, baseType: !335, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !363, file: !60, line: 30, baseType: !47, size: 64, align: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !363, file: !60, line: 32, baseType: !73, size: 64, align: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !363, file: !60, line: 33, baseType: !73, size: 64, align: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !363, file: !60, line: 34, baseType: !73, size: 64, align: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !363, file: !60, line: 35, baseType: !137, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !363, file: !60, line: 36, baseType: !137, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !363, file: !60, line: 37, baseType: !137, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !363, file: !60, line: 38, baseType: !137, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !363, file: !60, line: 40, baseType: !347, size: 128, align: 64, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !363, file: !60, line: 41, baseType: !311, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !363, file: !60, line: 42, baseType: !44, size: 32, align: 32, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !363, file: !60, line: 44, baseType: !227, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !363, file: !60, line: 45, baseType: !227, size: 64, align: 64, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !363, file: !60, line: 53, baseType: !358, size: 64, align: 64, offset: 1600)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !363, file: !60, line: 55, baseType: !442, size: 64, align: 64, offset: 1664)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!44, !361, !74}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !363, file: !60, line: 57, baseType: !446, size: 64, align: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!44, !361, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !363, file: !60, line: 60, baseType: !452, size: 64, align: 64, offset: 1792)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!449, !361}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !363, file: !60, line: 62, baseType: !456, size: 64, align: 64, offset: 1856)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !361, !449, !449, !44}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !363, file: !60, line: 65, baseType: !460, size: 64, align: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!463, !361, !449, !449}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !363, file: !60, line: 69, baseType: !465, size: 64, align: 64, offset: 1984)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !361, !449}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !88, line: 109, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !471, line: 15, size: 1408, align: 64, elements: !472)
!471 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !490, !494, !496, !497, !498, !499, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !43, line: 3, baseType: !44, size: 32, align: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !470, file: !43, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !470, file: !43, line: 5, baseType: !47, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !470, file: !43, line: 7, baseType: !52, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !470, file: !43, line: 8, baseType: !361, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !470, file: !43, line: 9, baseType: !73, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !470, file: !43, line: 10, baseType: !73, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !470, file: !43, line: 11, baseType: !311, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !470, file: !43, line: 12, baseType: !44, size: 32, align: 32, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !470, file: !43, line: 13, baseType: !73, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !470, file: !43, line: 15, baseType: !484, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !88, line: 108, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !88, line: 108, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !470, file: !43, line: 17, baseType: !491, size: 64, align: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!449, !487}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !470, file: !495, line: 5, baseType: !73, size: 64, align: 64, offset: 704)
!495 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !470, file: !495, line: 6, baseType: !73, size: 64, align: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !470, file: !495, line: 7, baseType: !311, size: 64, align: 64, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !470, file: !495, line: 9, baseType: !47, size: 64, align: 64, offset: 896)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !470, file: !495, line: 10, baseType: !500, size: 64, align: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !88, line: 111, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !503, line: 13, size: 576, align: 64, elements: !504)
!503 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!504 = !{!505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !523, !524}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !506, line: 3, baseType: !44, size: 32, align: 32)
!506 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!507 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !502, file: !506, line: 4, baseType: !44, size: 32, align: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !502, file: !506, line: 6, baseType: !311, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !502, file: !506, line: 8, baseType: !73, size: 64, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !502, file: !506, line: 9, baseType: !73, size: 64, align: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !502, file: !506, line: 10, baseType: !73, size: 64, align: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !502, file: !506, line: 11, baseType: !44, size: 32, align: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !502, file: !506, line: 14, baseType: !137, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !502, file: !506, line: 15, baseType: !137, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !502, file: !506, line: 18, baseType: !137, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !502, file: !506, line: 19, baseType: !137, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !502, file: !506, line: 20, baseType: !137, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !502, file: !506, line: 21, baseType: !137, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !502, file: !506, line: 22, baseType: !520, size: 64, align: 8, offset: 360)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, align: 8, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !502, file: !506, line: 26, baseType: !52, size: 64, align: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !506, line: 28, baseType: !500, size: 64, align: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !470, file: !495, line: 12, baseType: !137, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !495, line: 13, baseType: !73, size: 64, align: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !470, file: !495, line: 14, baseType: !44, size: 32, align: 32, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !470, file: !495, line: 15, baseType: !73, size: 64, align: 64, offset: 1216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !470, file: !495, line: 17, baseType: !137, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !470, file: !495, line: 18, baseType: !137, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !470, file: !495, line: 19, baseType: !137, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !470, file: !495, line: 20, baseType: !137, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !470, file: !495, line: 22, baseType: !137, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !470, file: !495, line: 23, baseType: !137, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !470, file: !495, line: 24, baseType: !137, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !470, file: !495, line: 25, baseType: !137, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !470, file: !495, line: 26, baseType: !137, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !470, file: !495, line: 31, baseType: !539, size: 64, align: 64, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!73, !468}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !363, file: !60, line: 70, baseType: !543, size: 64, align: 64, offset: 2048)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !361, !449}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !88, line: 110, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !88, line: 110, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !363, file: !60, line: 71, baseType: !550, size: 64, align: 64, offset: 2112)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!44, !449, !449}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !363, file: !60, line: 73, baseType: !550, size: 64, align: 64, offset: 2176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !56, file: !60, line: 55, baseType: !442, size: 64, align: 64, offset: 1664)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !56, file: !60, line: 57, baseType: !446, size: 64, align: 64, offset: 1728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !56, file: !60, line: 60, baseType: !452, size: 64, align: 64, offset: 1792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !56, file: !60, line: 62, baseType: !456, size: 64, align: 64, offset: 1856)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !56, file: !60, line: 65, baseType: !460, size: 64, align: 64, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !56, file: !60, line: 69, baseType: !465, size: 64, align: 64, offset: 1984)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !56, file: !60, line: 70, baseType: !543, size: 64, align: 64, offset: 2048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !56, file: !60, line: 71, baseType: !550, size: 64, align: 64, offset: 2112)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !56, file: !60, line: 73, baseType: !550, size: 64, align: 64, offset: 2176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !56, file: !57, line: 46, baseType: !227, size: 64, align: 64, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !56, file: !57, line: 47, baseType: !227, size: 64, align: 64, offset: 2304)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !56, file: !57, line: 48, baseType: !566, size: 64, align: 64, offset: 2368)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !38, line: 8, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !38, line: 8, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !56, file: !57, line: 49, baseType: !227, size: 64, align: 64, offset: 2432)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !56, file: !57, line: 51, baseType: !73, size: 64, align: 64, offset: 2496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !56, file: !57, line: 53, baseType: !73, size: 64, align: 64, offset: 2560)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !56, file: !57, line: 54, baseType: !73, size: 64, align: 64, offset: 2624)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !56, file: !57, line: 55, baseType: !73, size: 64, align: 64, offset: 2688)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !56, file: !57, line: 56, baseType: !73, size: 64, align: 64, offset: 2752)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !56, file: !57, line: 57, baseType: !44, size: 32, align: 32, offset: 2816)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !56, file: !57, line: 59, baseType: !137, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !56, file: !57, line: 60, baseType: !137, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !56, file: !57, line: 62, baseType: !137, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !56, file: !57, line: 63, baseType: !137, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !56, file: !57, line: 64, baseType: !137, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !56, file: !57, line: 65, baseType: !137, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !56, file: !57, line: 66, baseType: !137, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !56, file: !57, line: 67, baseType: !137, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !56, file: !57, line: 68, baseType: !137, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !56, file: !57, line: 69, baseType: !137, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !56, file: !57, line: 70, baseType: !137, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !56, file: !57, line: 71, baseType: !137, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !56, file: !57, line: 72, baseType: !137, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !56, file: !57, line: 74, baseType: !44, size: 32, align: 32, offset: 2880)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !56, file: !57, line: 75, baseType: !44, size: 32, align: 32, offset: 2912)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !56, file: !57, line: 76, baseType: !44, size: 32, align: 32, offset: 2944)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !56, file: !57, line: 77, baseType: !44, size: 32, align: 32, offset: 2976)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !56, file: !57, line: 79, baseType: !47, size: 64, align: 64, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !56, file: !57, line: 80, baseType: !227, size: 64, align: 64, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !56, file: !57, line: 81, baseType: !227, size: 64, align: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !56, file: !57, line: 83, baseType: !266, size: 64, align: 64, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !56, file: !57, line: 84, baseType: !218, size: 32, align: 32, offset: 3264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !56, file: !57, line: 87, baseType: !44, size: 32, align: 32, offset: 3296)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !56, file: !57, line: 91, baseType: !227, size: 64, align: 64, offset: 3328)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !56, file: !57, line: 92, baseType: !347, size: 128, align: 64, offset: 3392)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !56, file: !57, line: 93, baseType: !347, size: 128, align: 64, offset: 3520)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !56, file: !57, line: 95, baseType: !44, size: 32, align: 32, offset: 3648)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !56, file: !57, line: 96, baseType: !44, size: 32, align: 32, offset: 3680)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !56, file: !57, line: 97, baseType: !44, size: 32, align: 32, offset: 3712)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !56, file: !57, line: 100, baseType: !227, size: 64, align: 64, offset: 3776)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !56, file: !57, line: 103, baseType: !227, size: 64, align: 64, offset: 3840)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !56, file: !57, line: 106, baseType: !227, size: 64, align: 64, offset: 3904)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !56, file: !57, line: 108, baseType: !47, size: 64, align: 64, offset: 3968)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !56, file: !57, line: 109, baseType: !227, size: 64, align: 64, offset: 4032)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !56, file: !57, line: 111, baseType: !227, size: 64, align: 64, offset: 4096)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !56, file: !57, line: 114, baseType: !52, size: 64, align: 64, offset: 4160)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !56, file: !57, line: 116, baseType: !47, size: 64, align: 64, offset: 4224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !56, file: !57, line: 117, baseType: !614, size: 32768, align: 64, offset: 4288)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 32768, align: 64, elements: !624)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !616, line: 10, size: 128, align: 64, elements: !617)
!616 = !DIFile(filename: "modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!617 = !{!618, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !615, file: !616, line: 11, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !616, line: 7, baseType: !621)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !36, !449, !74, !74, !73, !266}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !615, file: !616, line: 12, baseType: !74, size: 8, align: 8, offset: 64)
!624 = !{!625}
!625 = !DISubrange(count: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !56, file: !57, line: 118, baseType: !627, size: 2048, align: 8, offset: 37056)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, align: 8, elements: !624)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !56, file: !57, line: 120, baseType: !550, size: 64, align: 64, offset: 39104)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !39, file: !43, line: 9, baseType: !73, size: 64, align: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !43, line: 10, baseType: !73, size: 64, align: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !39, file: !43, line: 11, baseType: !311, size: 64, align: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !39, file: !43, line: 12, baseType: !44, size: 32, align: 32, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !39, file: !43, line: 13, baseType: !73, size: 64, align: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !39, file: !43, line: 15, baseType: !484, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !39, file: !43, line: 17, baseType: !491, size: 64, align: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !39, file: !495, line: 5, baseType: !73, size: 64, align: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !39, file: !495, line: 6, baseType: !73, size: 64, align: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !39, file: !495, line: 7, baseType: !311, size: 64, align: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !39, file: !495, line: 9, baseType: !47, size: 64, align: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !39, file: !495, line: 10, baseType: !500, size: 64, align: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !39, file: !495, line: 12, baseType: !137, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !39, file: !495, line: 13, baseType: !73, size: 64, align: 64, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !39, file: !495, line: 14, baseType: !44, size: 32, align: 32, offset: 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !39, file: !495, line: 15, baseType: !73, size: 64, align: 64, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !39, file: !495, line: 17, baseType: !137, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !39, file: !495, line: 18, baseType: !137, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !39, file: !495, line: 19, baseType: !137, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !39, file: !495, line: 20, baseType: !137, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !39, file: !495, line: 22, baseType: !137, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !39, file: !495, line: 23, baseType: !137, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !39, file: !495, line: 24, baseType: !137, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !39, file: !495, line: 25, baseType: !137, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !39, file: !495, line: 26, baseType: !137, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !39, file: !495, line: 31, baseType: !539, size: 64, align: 64, offset: 1344)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !39, file: !40, line: 18, baseType: !227, size: 64, align: 64, offset: 1408)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !39, file: !40, line: 20, baseType: !311, size: 64, align: 64, offset: 1472)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !39, file: !40, line: 21, baseType: !44, size: 32, align: 32, offset: 1536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !39, file: !40, line: 22, baseType: !44, size: 32, align: 32, offset: 1568)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !660, line: 9, baseType: !661)
!660 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664, !664, !664, !664, !664, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!666 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!667 = !{i32 2, !"Dwarf Version", i32 4}
!668 = !{i32 2, !"Debug Info Version", i32 3}
!669 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!670 = distinct !DISubprogram(name: "irc_nicklist_insert", scope: !671, file: !671, line: 33, type: !672, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !674)
!671 = !DIFile(filename: "irc-nicklist.c", directory: "/home/lichi/Desktop/irssi/task1")
!672 = !DISubroutineType(types: !673)
!673 = !{!500, !36, !449, !44, !44, !44, !44, !449}
!674 = !{}
!675 = !DILocalVariable(name: "channel", arg: 1, scope: !670, file: !671, line: 33, type: !36)
!676 = !DIExpression()
!677 = !DILocation(line: 33, column: 48, scope: !670)
!678 = !DILocalVariable(name: "nick", arg: 2, scope: !670, file: !671, line: 33, type: !449)
!679 = !DILocation(line: 33, column: 69, scope: !670)
!680 = !DILocalVariable(name: "op", arg: 3, scope: !670, file: !671, line: 34, type: !44)
!681 = !DILocation(line: 34, column: 14, scope: !670)
!682 = !DILocalVariable(name: "halfop", arg: 4, scope: !670, file: !671, line: 34, type: !44)
!683 = !DILocation(line: 34, column: 22, scope: !670)
!684 = !DILocalVariable(name: "voice", arg: 5, scope: !670, file: !671, line: 34, type: !44)
!685 = !DILocation(line: 34, column: 34, scope: !670)
!686 = !DILocalVariable(name: "send_massjoin", arg: 6, scope: !670, file: !671, line: 34, type: !44)
!687 = !DILocation(line: 34, column: 45, scope: !670)
!688 = !DILocalVariable(name: "prefixes", arg: 7, scope: !670, file: !671, line: 35, type: !449)
!689 = !DILocation(line: 35, column: 22, scope: !670)
!690 = !DILocalVariable(name: "rec", scope: !670, file: !671, line: 37, type: !500)
!691 = !DILocation(line: 37, column: 12, scope: !670)
!692 = !DILocation(line: 39, column: 2, scope: !670)
!693 = distinct !{!693, !692}
!694 = !DILocation(line: 39, column: 99, scope: !695)
!695 = !DILexicalBlockFile(scope: !696, file: !671, discriminator: 1)
!696 = distinct !DILexicalBlock(scope: !697, file: !671, line: 39, column: 10)
!697 = distinct !DILexicalBlock(scope: !670, file: !671, line: 39, column: 4)
!698 = !DILocation(line: 39, column: 74, scope: !695)
!699 = !DILocation(line: 39, column: 58, scope: !695)
!700 = !DILocation(line: 39, column: 57, scope: !695)
!701 = !DILocation(line: 39, column: 32, scope: !702)
!702 = !DILexicalBlockFile(scope: !695, file: !671, discriminator: 7)
!703 = !DILocation(line: 39, column: 12, scope: !695)
!704 = !DILocation(line: 39, column: 10, scope: !695)
!705 = !DILocation(line: 39, column: 11, scope: !706)
!706 = !DILexicalBlockFile(scope: !696, file: !671, discriminator: 2)
!707 = !DILocation(line: 39, column: 10, scope: !708)
!708 = !DILexicalBlockFile(scope: !697, file: !671, discriminator: 3)
!709 = !DILocation(line: 39, column: 30, scope: !710)
!710 = !DILexicalBlockFile(scope: !711, file: !671, discriminator: 4)
!711 = distinct !DILexicalBlock(scope: !696, file: !671, line: 39, column: 28)
!712 = !DILocation(line: 39, column: 39, scope: !713)
!713 = !DILexicalBlockFile(scope: !714, file: !671, discriminator: 5)
!714 = distinct !DILexicalBlock(scope: !696, file: !671, line: 39, column: 37)
!715 = !DILocation(line: 39, column: 135, scope: !713)
