; ModuleID = './line352-gui-windows.o.i'
source_filename = "./line352-gui-windows.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type opaque
%struct.HISTORY_REC = type { i8*, %struct._GList*, i32, i32, i8 }
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct.MAIN_WINDOW_REC = type { %struct._WINDOW_REC*, %struct._TERM_WINDOW*, i32, i32, i32, i32, i32, i32, i32, %struct._GSList*, i32, i32, i32, i32, i32, i32, i8 }
%struct._TERM_WINDOW = type opaque
%struct.GUI_WINDOW_REC = type { %struct.MAIN_WINDOW_REC*, %struct._TEXT_BUFFER_VIEW_REC*, i8, %struct._LINE_REC*, i64 }
%struct._TEXT_BUFFER_VIEW_REC = type { %struct.TEXT_BUFFER_REC*, %struct._GSList*, %struct._TERM_WINDOW*, i32, i32, i32, i32 (%struct._TEXT_BUFFER_VIEW_REC*, %struct._LINE_REC*, i32)*, %struct.TEXT_BUFFER_CACHE_REC*, i32, %struct._LINE_REC*, i32, %struct._LINE_REC*, i32, %struct._GHashTable*, i32, i32, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !42, globals: !273)
!1 = !DIFile(filename: "line352-gui-windows.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_NONE", value: -1)
!7 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_DEFAULT", value: 0)
!8 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_HIDDEN", value: 1)
!9 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_SPLIT", value: 2)
!10 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_RSPLIT", value: 3)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 10, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!14 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!15 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!16 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!17 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!18 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!19 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!20 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!21 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!22 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!23 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!24 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!25 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!26 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!27 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!28 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!29 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!30 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!31 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!32 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!33 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!34 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!35 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!36 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!37 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!38 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!39 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!40 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!41 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!42 = !{!43, !76, !262, !115, !264, !271, !272}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !45, line: 24, baseType: !46)
!45 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 13, size: 320, align: 64, elements: !47)
!47 = !{!48, !174, !256, !257, !258, !259, !260, !261}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !46, file: !45, line: 14, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !51, line: 34, baseType: !52)
!51 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 16, size: 704, align: 64, elements: !53)
!53 = !{!54, !153, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !52, file: !51, line: 17, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !57, line: 117, baseType: !58)
!57 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !4, line: 28, size: 1280, align: 64, elements: !59)
!59 = !{!60, !62, !65, !66, !67, !78, !117, !118, !119, !120, !121, !122, !124, !125, !126, !145, !146, !147, !148, !149, !150, !151, !152}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !58, file: !4, line: 29, baseType: !61, size: 32, align: 32)
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !58, file: !4, line: 30, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !4, line: 32, baseType: !61, size: 32, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !58, file: !4, line: 32, baseType: !61, size: 32, align: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !58, file: !4, line: 34, baseType: !68, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !70, line: 37, baseType: !71)
!70 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !70, line: 39, size: 128, align: 64, elements: !72)
!72 = !{!73, !77}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !70, line: 41, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !75, line: 77, baseType: !76)
!75 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !70, line: 42, baseType: !68, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !58, file: !4, line: 35, baseType: !79, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !57, line: 108, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !82, line: 5, size: 704, align: 64, elements: !83)
!82 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = !{!84, !86, !87, !92, !93, !97, !98, !99, !105, !106, !107, !111}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !85, line: 3, baseType: !61, size: 32, align: 32)
!85 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!86 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !81, file: !85, line: 4, baseType: !61, size: 32, align: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !81, file: !85, line: 5, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !90, line: 37, baseType: !91)
!90 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !90, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !81, file: !85, line: 7, baseType: !76, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !81, file: !85, line: 8, baseType: !94, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !57, line: 107, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !57, line: 107, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !81, file: !85, line: 9, baseType: !63, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !85, line: 10, baseType: !63, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !81, file: !85, line: 11, baseType: !100, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !101, line: 75, baseType: !102)
!101 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !103, line: 139, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !81, file: !85, line: 12, baseType: !61, size: 32, align: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !81, file: !85, line: 13, baseType: !63, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !81, file: !85, line: 15, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !79}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !81, file: !85, line: 17, baseType: !112, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !79}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !58, file: !4, line: 36, baseType: !94, size: 64, align: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !58, file: !4, line: 37, baseType: !94, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !58, file: !4, line: 38, baseType: !63, size: 64, align: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !58, file: !4, line: 40, baseType: !61, size: 32, align: 32, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !58, file: !4, line: 41, baseType: !68, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !58, file: !4, line: 43, baseType: !123, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!123 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !58, file: !4, line: 44, baseType: !123, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !58, file: !4, line: 45, baseType: !123, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !58, file: !4, line: 48, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !129, line: 14, baseType: !130)
!129 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 6, size: 256, align: 64, elements: !131)
!131 = !{!132, !133, !142, !143, !144}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !129, line: 7, baseType: !63, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !130, file: !129, line: 9, baseType: !134, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !136, line: 37, baseType: !137)
!136 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !136, line: 39, size: 192, align: 64, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !136, line: 41, baseType: !74, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 42, baseType: !134, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !136, line: 43, baseType: !134, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !130, file: !129, line: 10, baseType: !61, size: 32, align: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !130, file: !129, line: 12, baseType: !61, size: 32, align: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !130, file: !129, line: 13, baseType: !61, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !58, file: !4, line: 49, baseType: !63, size: 64, align: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !58, file: !4, line: 51, baseType: !61, size: 32, align: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !58, file: !4, line: 52, baseType: !63, size: 64, align: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !58, file: !4, line: 54, baseType: !100, size: 64, align: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !58, file: !4, line: 55, baseType: !100, size: 64, align: 64, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !58, file: !4, line: 57, baseType: !63, size: 64, align: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !58, file: !4, line: 58, baseType: !76, size: 64, align: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !58, file: !4, line: 60, baseType: !76, size: 64, align: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !52, file: !51, line: 19, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !156, line: 4, baseType: !157)
!156 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !156, line: 4, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !52, file: !51, line: 20, baseType: !61, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !52, file: !51, line: 22, baseType: !61, size: 32, align: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !52, file: !51, line: 22, baseType: !61, size: 32, align: 32, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !52, file: !51, line: 23, baseType: !61, size: 32, align: 32, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !52, file: !51, line: 23, baseType: !61, size: 32, align: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !52, file: !51, line: 24, baseType: !61, size: 32, align: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !52, file: !51, line: 24, baseType: !61, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !52, file: !51, line: 26, baseType: !68, size: 64, align: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !52, file: !51, line: 27, baseType: !61, size: 32, align: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !52, file: !51, line: 27, baseType: !61, size: 32, align: 32, offset: 480)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !52, file: !51, line: 28, baseType: !61, size: 32, align: 32, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !52, file: !51, line: 29, baseType: !61, size: 32, align: 32, offset: 544)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !52, file: !51, line: 29, baseType: !61, size: 32, align: 32, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !52, file: !51, line: 30, baseType: !61, size: 32, align: 32, offset: 608)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !52, file: !51, line: 32, baseType: !123, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !52, file: !51, line: 33, baseType: !123, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !46, file: !45, line: 15, baseType: !175, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !177, line: 7, baseType: !178)
!177 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !177, line: 50, size: 960, align: 64, elements: !179)
!179 = !{!180, !221, !222, !223, !224, !225, !226, !231, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !178, file: !177, line: 51, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !183, line: 72, baseType: !184)
!183 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 60, size: 448, align: 64, elements: !185)
!185 = !{!186, !187, !204, !205, !206, !217, !218, !219, !220}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !184, file: !183, line: 61, baseType: !68, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !184, file: !183, line: 62, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !183, line: 52, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !183, line: 34, size: 320, align: 64, elements: !191)
!191 = !{!192, !194, !195, !198}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !183, line: 48, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !183, line: 48, baseType: !193, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !190, file: !183, line: 50, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !190, file: !183, line: 51, baseType: !199, size: 128, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !183, line: 32, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 29, size: 128, align: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !200, file: !183, line: 30, baseType: !61, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !200, file: !183, line: 31, baseType: !100, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !184, file: !183, line: 63, baseType: !61, size: 32, align: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !184, file: !183, line: 65, baseType: !188, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !184, file: !183, line: 66, baseType: !207, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !183, line: 58, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 54, size: 131008, align: 32, elements: !210)
!210 = !{!211, !215, !216}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !209, file: !183, line: 55, baseType: !212, size: 130944, align: 8)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 130944, align: 8, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 16368)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !209, file: !183, line: 56, baseType: !61, size: 32, align: 32, offset: 130944)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !209, file: !183, line: 57, baseType: !61, size: 32, align: 32, offset: 130976)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !184, file: !183, line: 68, baseType: !61, size: 32, align: 32, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !184, file: !183, line: 69, baseType: !61, size: 32, align: 32, offset: 352)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !184, file: !183, line: 70, baseType: !61, size: 32, align: 32, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !184, file: !183, line: 71, baseType: !123, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !178, file: !177, line: 53, baseType: !68, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !178, file: !177, line: 55, baseType: !154, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !178, file: !177, line: 56, baseType: !61, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !178, file: !177, line: 56, baseType: !61, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !178, file: !177, line: 58, baseType: !61, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !178, file: !177, line: 59, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !177, line: 10, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!61, !175, !188, !61}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !178, file: !177, line: 61, baseType: !232, size: 64, align: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !177, line: 48, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 37, size: 192, align: 64, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !234, file: !177, line: 38, baseType: !61, size: 32, align: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !234, file: !177, line: 39, baseType: !61, size: 32, align: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !234, file: !177, line: 41, baseType: !88, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !234, file: !177, line: 45, baseType: !197, size: 8, align: 8, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !234, file: !177, line: 47, baseType: !61, size: 32, align: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !178, file: !177, line: 63, baseType: !61, size: 32, align: 32, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !178, file: !177, line: 66, baseType: !188, size: 64, align: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !178, file: !177, line: 68, baseType: !61, size: 32, align: 32, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !178, file: !177, line: 71, baseType: !188, size: 64, align: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !178, file: !177, line: 72, baseType: !61, size: 32, align: 32, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !178, file: !177, line: 76, baseType: !88, size: 64, align: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !178, file: !177, line: 79, baseType: !61, size: 32, align: 32, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !178, file: !177, line: 82, baseType: !61, size: 32, align: 32, offset: 864)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !178, file: !177, line: 84, baseType: !123, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !178, file: !177, line: 86, baseType: !123, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !178, file: !177, line: 88, baseType: !123, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !178, file: !177, line: 90, baseType: !123, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !178, file: !177, line: 92, baseType: !123, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !178, file: !177, line: 94, baseType: !123, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !178, file: !177, line: 96, baseType: !123, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !46, file: !45, line: 17, baseType: !123, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !46, file: !45, line: 18, baseType: !123, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !46, file: !45, line: 20, baseType: !123, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !46, file: !45, line: 21, baseType: !123, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !46, file: !45, line: 22, baseType: !188, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !46, file: !45, line: 23, baseType: !100, size: 64, align: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !75, line: 46, baseType: !64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !265, line: 9, baseType: !266)
!265 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !269, !269, !269, !269, !269, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !75, line: 49, baseType: !61)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !75, line: 48, baseType: !104)
!273 = !{!274, !276}
!274 = distinct !DIGlobalVariable(name: "window_create_override", scope: !0, file: !275, line: 33, type: !61, isLocal: true, isDefinition: true, variable: i32* @window_create_override)
!275 = !DIFile(filename: "gui-windows.c", directory: "/home/lichi/Desktop/irssi/task1")
!276 = distinct !DIGlobalVariable(name: "wcwidth_impl", scope: !0, file: !275, line: 34, type: !61, isLocal: true, isDefinition: true, variable: i32* @wcwidth_impl)
!277 = !{i32 2, !"Dwarf Version", i32 4}
!278 = !{i32 2, !"Debug Info Version", i32 3}
!279 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!280 = distinct !DISubprogram(name: "gui_window_resize", scope: !275, file: !275, line: 127, type: !281, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !283)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !55, !61, !61}
!283 = !{}
!284 = !DILocalVariable(name: "window", arg: 1, scope: !280, file: !275, line: 127, type: !55)
!285 = !DIExpression()
!286 = !DILocation(line: 127, column: 36, scope: !280)
!287 = !DILocalVariable(name: "width", arg: 2, scope: !280, file: !275, line: 127, type: !61)
!288 = !DILocation(line: 127, column: 48, scope: !280)
!289 = !DILocalVariable(name: "height", arg: 3, scope: !280, file: !275, line: 127, type: !61)
!290 = !DILocation(line: 127, column: 59, scope: !280)
!291 = !DILocalVariable(name: "gui", scope: !280, file: !275, line: 129, type: !43)
!292 = !DILocation(line: 129, column: 18, scope: !280)
!293 = !DILocation(line: 131, column: 6, scope: !294)
!294 = distinct !DILexicalBlock(scope: !280, file: !275, line: 131, column: 6)
!295 = !DILocation(line: 131, column: 14, scope: !294)
!296 = !DILocation(line: 131, column: 23, scope: !294)
!297 = !DILocation(line: 131, column: 20, scope: !294)
!298 = !DILocation(line: 131, column: 29, scope: !294)
!299 = !DILocation(line: 131, column: 32, scope: !300)
!300 = !DILexicalBlockFile(scope: !294, file: !275, discriminator: 1)
!301 = !DILocation(line: 131, column: 40, scope: !300)
!302 = !DILocation(line: 131, column: 50, scope: !300)
!303 = !DILocation(line: 131, column: 47, scope: !300)
!304 = !DILocation(line: 131, column: 6, scope: !300)
!305 = !DILocation(line: 132, column: 17, scope: !294)
!306 = !DILocation(line: 134, column: 30, scope: !280)
!307 = !DILocation(line: 134, column: 39, scope: !280)
!308 = !DILocation(line: 134, column: 9, scope: !280)
!309 = !DILocation(line: 134, column: 6, scope: !280)
!310 = !DILocation(line: 136, column: 2, scope: !280)
!311 = !DILocation(line: 137, column: 32, scope: !280)
!312 = !DILocation(line: 137, column: 41, scope: !280)
!313 = !DILocation(line: 137, column: 11, scope: !280)
!314 = !DILocation(line: 137, column: 53, scope: !280)
!315 = !DILocation(line: 137, column: 62, scope: !280)
!316 = !DILocation(line: 137, column: 68, scope: !280)
!317 = !DILocation(line: 139, column: 25, scope: !280)
