; ModuleID = './line222-fe-exec.o.i'
source_filename = "./line222-fe-exec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, {}*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 10, size: 32, align: 32, elements: !58)
!57 = !DIFile(filename: "../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!59 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!60 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!61 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!62 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!63 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!64 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!65 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!66 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!67 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!68 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!69 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!70 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!71 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!72 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!73 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!74 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!75 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!76 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!77 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!78 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!79 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!80 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!81 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!82 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!83 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!84 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!85 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!86 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!87 = !{!88, !95, !96, !100, !102, !103, !105, !106, !478, !562, !650, !579, !497, !626, !494, !654, !469, !203, !659}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !89, line: 9, baseType: !90)
!89 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !93, !93, !93, !93, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !98, line: 46, baseType: !99)
!98 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !98, line: 77, baseType: !95)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !98, line: 48, baseType: !104)
!104 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !108, line: 109, baseType: !109)
!108 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !110, line: 15, size: 1408, align: 64, elements: !111)
!110 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!111 = !{!112, !115, !116, !121, !122, !529, !530, !531, !532, !533, !534, !535, !536, !538, !539, !540, !541, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !113, line: 3, baseType: !114, size: 32, align: 32)
!113 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!114 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !109, file: !113, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !109, file: !113, line: 5, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !119, line: 37, baseType: !120)
!119 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !119, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !109, file: !113, line: 7, baseType: !95, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !109, file: !113, line: 8, baseType: !123, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !108, line: 107, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !126, line: 30, size: 2240, align: 64, elements: !127)
!126 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !{!128, !130, !131, !132, !386, !391, !392, !393, !394, !395, !396, !397, !398, !399, !416, !417, !421, !422, !423, !427, !428, !429, !430, !431, !432, !433, !434, !435, !441, !442, !443, !444, !445, !449, !453, !457, !461, !465, !470, !474, !524, !528}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !129, line: 3, baseType: !114, size: 32, align: 32)
!129 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !125, file: !129, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !125, file: !129, line: 6, baseType: !114, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !125, file: !129, line: 8, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !108, line: 113, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !126, line: 25, size: 1920, align: 64, elements: !136)
!136 = !{!137, !139, !140, !141, !142, !143, !144, !145, !146, !148, !149, !150, !151, !152, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !138, line: 3, baseType: !114, size: 32, align: 32)
!138 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !135, file: !138, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !135, file: !138, line: 6, baseType: !114, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !135, file: !138, line: 9, baseType: !105, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !135, file: !138, line: 10, baseType: !114, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !135, file: !138, line: 11, baseType: !105, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !135, file: !138, line: 11, baseType: !105, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !135, file: !138, line: 11, baseType: !105, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !135, file: !138, line: 13, baseType: !147, size: 16, align: 16, offset: 448)
!147 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !135, file: !138, line: 14, baseType: !105, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !135, file: !138, line: 15, baseType: !105, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !135, file: !138, line: 16, baseType: !114, size: 32, align: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !135, file: !138, line: 17, baseType: !105, size: 64, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !135, file: !138, line: 19, baseType: !153, size: 64, align: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !108, line: 99, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !156, line: 22, size: 160, align: 32, elements: !157)
!156 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !155, file: !156, line: 23, baseType: !147, size: 16, align: 16)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !155, file: !156, line: 24, baseType: !160, size: 128, align: 32, offset: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !161, line: 211, size: 128, align: 32, elements: !162)
!161 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !160, file: !161, line: 220, baseType: !164, size: 128, align: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !161, line: 213, size: 128, align: 32, elements: !165)
!165 = !{!166, !173, !178}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !164, file: !161, line: 215, baseType: !167, size: 128, align: 8)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, align: 8, elements: !171)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!170 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!171 = !{!172}
!172 = !DISubrange(count: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !164, file: !161, line: 217, baseType: !174, size: 128, align: 16)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, align: 16, elements: !176)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !169, line: 49, baseType: !147)
!176 = !{!177}
!177 = !DISubrange(count: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !164, file: !161, line: 218, baseType: !179, size: 128, align: 32)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 128, align: 32, elements: !182)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !169, line: 51, baseType: !181)
!181 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!182 = !{!183}
!183 = !DISubrange(count: 4)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !135, file: !138, line: 19, baseType: !153, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !135, file: !138, line: 21, baseType: !105, size: 64, align: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !135, file: !138, line: 22, baseType: !105, size: 64, align: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !135, file: !138, line: 23, baseType: !105, size: 64, align: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !135, file: !138, line: 24, baseType: !105, size: 64, align: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !135, file: !138, line: 26, baseType: !105, size: 64, align: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !135, file: !138, line: 27, baseType: !105, size: 64, align: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !135, file: !138, line: 28, baseType: !105, size: 64, align: 64, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !135, file: !138, line: 29, baseType: !105, size: 64, align: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !135, file: !138, line: 30, baseType: !105, size: 64, align: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !135, file: !138, line: 31, baseType: !105, size: 64, align: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !135, file: !138, line: 32, baseType: !105, size: 64, align: 64, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !135, file: !138, line: 33, baseType: !105, size: 64, align: 64, offset: 1600)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !135, file: !138, line: 35, baseType: !198, size: 64, align: 64, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !201)
!201 = !{!202, !204, !343, !344, !349, !350, !351, !352, !353, !362, !363, !364, !368, !369, !370, !371, !372, !373, !374, !375}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !200, file: !4, line: 100, baseType: !203, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !98, line: 49, baseType: !114)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !200, file: !4, line: 101, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !208)
!208 = !{!209, !230, !236, !242, !246, !330, !334, !339}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !207, file: !4, line: 133, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !198, !96, !214, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !215, line: 66, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !221, line: 42, baseType: !222)
!221 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !221, line: 44, size: 128, align: 64, elements: !223)
!223 = !{!224, !228, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !222, file: !221, line: 46, baseType: !225, size: 32, align: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !226, line: 36, baseType: !227)
!226 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !215, line: 45, baseType: !181)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !222, file: !221, line: 47, baseType: !203, size: 32, align: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !222, file: !221, line: 48, baseType: !96, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !207, file: !4, line: 138, baseType: !231, size: 64, align: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!213, !198, !234, !214, !217, !218}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !207, file: !4, line: 143, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!213, !198, !240, !241, !218}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !215, line: 51, baseType: !104)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !207, file: !4, line: 147, baseType: !243, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!213, !198, !218}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !207, file: !4, line: 149, baseType: !247, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !198, !329}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !253)
!253 = !{!254, !255, !276, !305, !307, !311, !312, !313, !314, !322, !323, !324, !325}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !252, file: !16, line: 174, baseType: !102, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !252, file: !16, line: 175, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !259)
!259 = !{!260, !264, !265}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !258, file: !16, line: 198, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !102}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !258, file: !16, line: 199, baseType: !261, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !258, file: !16, line: 200, baseType: !266, size: 64, align: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !102, !250, !269, !275}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !102}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !98, line: 50, baseType: !203)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !252, file: !16, line: 177, baseType: !277, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !281)
!281 = !{!282, !287, !291, !295, !299, !300}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !280, file: !16, line: 216, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!274, !250, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !280, file: !16, line: 218, baseType: !288, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!274, !250}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !280, file: !16, line: 219, baseType: !292, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!274, !250, !270, !102}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !280, file: !16, line: 222, baseType: !296, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !250}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !280, file: !16, line: 226, baseType: !270, size: 64, align: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !280, file: !16, line: 227, baseType: !301, size: 64, align: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !252, file: !16, line: 178, baseType: !306, size: 32, align: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !98, line: 55, baseType: !181)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !252, file: !16, line: 180, baseType: !308, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !310)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !252, file: !16, line: 182, baseType: !203, size: 32, align: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !252, file: !16, line: 183, baseType: !306, size: 32, align: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !252, file: !16, line: 184, baseType: !306, size: 32, align: 32, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !252, file: !16, line: 186, baseType: !315, size: 64, align: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !317, line: 37, baseType: !318)
!317 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !317, line: 39, size: 128, align: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !317, line: 41, baseType: !102, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !317, line: 42, baseType: !315, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !252, file: !16, line: 188, baseType: !250, size: 64, align: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !16, line: 189, baseType: !250, size: 64, align: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !16, line: 191, baseType: !105, size: 64, align: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !252, file: !16, line: 193, baseType: !326, size: 64, align: 64, offset: 704)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !207, file: !4, line: 151, baseType: !331, size: 64, align: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !198}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !207, file: !4, line: 152, baseType: !335, size: 64, align: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!213, !198, !338, !218}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !207, file: !4, line: 155, baseType: !340, size: 64, align: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!338, !198}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !200, file: !4, line: 103, baseType: !96, size: 64, align: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !200, file: !4, line: 104, baseType: !345, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !346, line: 77, baseType: !347)
!346 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !346, line: 77, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !200, file: !4, line: 105, baseType: !345, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !200, file: !4, line: 106, baseType: !96, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !200, file: !4, line: 107, baseType: !306, size: 32, align: 32, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !200, file: !4, line: 109, baseType: !214, size: 64, align: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !200, file: !4, line: 110, baseType: !354, size: 64, align: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !356, line: 39, baseType: !357)
!356 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !356, line: 41, size: 192, align: 64, elements: !358)
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !357, file: !356, line: 43, baseType: !96, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !357, file: !356, line: 44, baseType: !214, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !357, file: !356, line: 45, baseType: !214, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !200, file: !4, line: 111, baseType: !354, size: 64, align: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !200, file: !4, line: 112, baseType: !354, size: 64, align: 64, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !200, file: !4, line: 113, baseType: !365, size: 48, align: 8, offset: 704)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, align: 8, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 6)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !200, file: !4, line: 117, baseType: !306, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !200, file: !4, line: 118, baseType: !306, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !200, file: !4, line: 119, baseType: !306, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !200, file: !4, line: 120, baseType: !306, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !200, file: !4, line: 121, baseType: !306, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !200, file: !4, line: 122, baseType: !306, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !200, file: !4, line: 124, baseType: !102, size: 64, align: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !200, file: !4, line: 125, baseType: !102, size: 64, align: 64, offset: 832)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !135, file: !138, line: 38, baseType: !181, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !135, file: !138, line: 39, baseType: !181, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !135, file: !138, line: 40, baseType: !181, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !135, file: !138, line: 41, baseType: !181, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !135, file: !138, line: 42, baseType: !181, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !135, file: !138, line: 43, baseType: !181, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !135, file: !138, line: 44, baseType: !181, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !135, file: !138, line: 45, baseType: !181, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !135, file: !138, line: 46, baseType: !105, size: 64, align: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !135, file: !138, line: 47, baseType: !105, size: 64, align: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !125, file: !129, line: 9, baseType: !387, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !388, line: 75, baseType: !389)
!388 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !390, line: 139, baseType: !104)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!391 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !125, file: !129, line: 10, baseType: !387, size: 64, align: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !125, file: !129, line: 12, baseType: !105, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !125, file: !129, line: 13, baseType: !105, size: 64, align: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !125, file: !129, line: 15, baseType: !181, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !125, file: !129, line: 16, baseType: !181, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !125, file: !129, line: 17, baseType: !181, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !125, file: !129, line: 18, baseType: !181, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !125, file: !129, line: 19, baseType: !181, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !125, file: !129, line: 21, baseType: !400, size: 64, align: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !108, line: 102, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !403, line: 7, size: 384, align: 64, elements: !404)
!403 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!404 = !{!405, !406, !410, !411, !412, !413, !414, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !402, file: !403, line: 8, baseType: !198, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !402, file: !403, line: 9, baseType: !407, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !108, line: 101, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !108, line: 101, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !402, file: !403, line: 11, baseType: !114, size: 32, align: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !402, file: !403, line: 12, baseType: !114, size: 32, align: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !402, file: !403, line: 13, baseType: !114, size: 32, align: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !402, file: !403, line: 14, baseType: !105, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !402, file: !403, line: 15, baseType: !114, size: 32, align: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !402, file: !403, line: 16, baseType: !181, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !125, file: !129, line: 22, baseType: !114, size: 32, align: 32, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !125, file: !129, line: 25, baseType: !418, size: 128, align: 64, offset: 640)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 128, align: 64, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 2)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !125, file: !129, line: 26, baseType: !114, size: 32, align: 32, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !125, file: !129, line: 27, baseType: !114, size: 32, align: 32, offset: 800)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !125, file: !129, line: 29, baseType: !424, size: 64, align: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !108, line: 103, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !108, line: 103, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !125, file: !129, line: 30, baseType: !117, size: 64, align: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !125, file: !129, line: 32, baseType: !105, size: 64, align: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !125, file: !129, line: 33, baseType: !105, size: 64, align: 64, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !125, file: !129, line: 34, baseType: !105, size: 64, align: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !125, file: !129, line: 35, baseType: !181, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !125, file: !129, line: 36, baseType: !181, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !125, file: !129, line: 37, baseType: !181, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !125, file: !129, line: 38, baseType: !181, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !125, file: !129, line: 40, baseType: !436, size: 128, align: 64, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !98, line: 504, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !98, line: 506, size: 128, align: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !437, file: !98, line: 508, baseType: !103, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !437, file: !98, line: 509, baseType: !103, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !125, file: !129, line: 41, baseType: !387, size: 64, align: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !125, file: !129, line: 42, baseType: !114, size: 32, align: 32, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !125, file: !129, line: 44, baseType: !315, size: 64, align: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !125, file: !129, line: 45, baseType: !315, size: 64, align: 64, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !125, file: !129, line: 53, baseType: !446, size: 64, align: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !123, !100, !114}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !125, file: !129, line: 55, baseType: !450, size: 64, align: 64, offset: 1664)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!114, !123, !99}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !125, file: !129, line: 57, baseType: !454, size: 64, align: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!114, !123, !100}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !125, file: !129, line: 60, baseType: !458, size: 64, align: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!100, !123}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !125, file: !129, line: 62, baseType: !462, size: 64, align: 64, offset: 1856)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !123, !100, !100, !114}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !125, file: !129, line: 65, baseType: !466, size: 64, align: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !123, !100, !100}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !125, file: !129, line: 69, baseType: !471, size: 64, align: 64, offset: 1984)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{!106, !123, !100}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !125, file: !129, line: 70, baseType: !475, size: 64, align: 64, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !123, !100}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !108, line: 110, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !481, line: 15, size: 960, align: 64, elements: !482)
!481 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !517, !518, !520, !521, !522, !523}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !113, line: 3, baseType: !114, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !480, file: !113, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !480, file: !113, line: 5, baseType: !117, size: 64, align: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !480, file: !113, line: 7, baseType: !95, size: 64, align: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !480, file: !113, line: 8, baseType: !123, size: 64, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !480, file: !113, line: 9, baseType: !105, size: 64, align: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !480, file: !113, line: 10, baseType: !105, size: 64, align: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !480, file: !113, line: 11, baseType: !387, size: 64, align: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !480, file: !113, line: 12, baseType: !114, size: 32, align: 32, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !480, file: !113, line: 13, baseType: !105, size: 64, align: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !480, file: !113, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !108, line: 108, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !500, line: 5, size: 704, align: 64, elements: !501)
!500 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !499, file: !113, line: 3, baseType: !114, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !499, file: !113, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !499, file: !113, line: 5, baseType: !117, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !499, file: !113, line: 7, baseType: !95, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !499, file: !113, line: 8, baseType: !123, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !499, file: !113, line: 9, baseType: !105, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !499, file: !113, line: 10, baseType: !105, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !499, file: !113, line: 11, baseType: !387, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !499, file: !113, line: 12, baseType: !114, size: 32, align: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !499, file: !113, line: 13, baseType: !105, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !499, file: !113, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !499, file: !113, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!100, !497}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !480, file: !113, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !480, file: !519, line: 5, baseType: !105, size: 64, align: 64, offset: 704)
!519 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !480, file: !519, line: 6, baseType: !105, size: 64, align: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !480, file: !519, line: 7, baseType: !387, size: 64, align: 64, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !480, file: !519, line: 9, baseType: !181, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !480, file: !519, line: 11, baseType: !181, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !125, file: !129, line: 71, baseType: !525, size: 64, align: 64, offset: 2112)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!114, !100, !100}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !125, file: !129, line: 73, baseType: !525, size: 64, align: 64, offset: 2176)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !109, file: !113, line: 9, baseType: !105, size: 64, align: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !113, line: 10, baseType: !105, size: 64, align: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !109, file: !113, line: 11, baseType: !387, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !109, file: !113, line: 12, baseType: !114, size: 32, align: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !109, file: !113, line: 13, baseType: !105, size: 64, align: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !109, file: !113, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !109, file: !113, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !109, file: !537, line: 5, baseType: !105, size: 64, align: 64, offset: 704)
!537 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !109, file: !537, line: 6, baseType: !105, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !109, file: !537, line: 7, baseType: !387, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !109, file: !537, line: 9, baseType: !117, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !109, file: !537, line: 10, baseType: !542, size: 64, align: 64, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !108, line: 111, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !108, line: 111, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !109, file: !537, line: 12, baseType: !181, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !109, file: !537, line: 13, baseType: !105, size: 64, align: 64, offset: 1088)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !109, file: !537, line: 14, baseType: !114, size: 32, align: 32, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !109, file: !537, line: 15, baseType: !105, size: 64, align: 64, offset: 1216)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !109, file: !537, line: 17, baseType: !181, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !109, file: !537, line: 18, baseType: !181, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !109, file: !537, line: 19, baseType: !181, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !109, file: !537, line: 20, baseType: !181, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !109, file: !537, line: 22, baseType: !181, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !109, file: !537, line: 23, baseType: !181, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !109, file: !537, line: 24, baseType: !181, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !109, file: !537, line: 25, baseType: !181, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !109, file: !537, line: 26, baseType: !181, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !109, file: !537, line: 31, baseType: !559, size: 64, align: 64, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!105, !106}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROCESS_REC", file: !564, line: 13, baseType: !565)
!564 = !DIFile(filename: "fe-exec.h", directory: "/home/lichi/Desktop/irssi/task1")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PROCESS_REC", file: !564, line: 22, size: 832, align: 64, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !625, !644, !645, !646, !647, !648, !649}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !565, file: !564, line: 23, baseType: !114, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !564, line: 24, baseType: !105, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !565, file: !564, line: 25, baseType: !105, size: 64, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !565, file: !564, line: 27, baseType: !114, size: 32, align: 32, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !565, file: !564, line: 28, baseType: !198, size: 64, align: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !565, file: !564, line: 29, baseType: !400, size: 64, align: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "databuf", scope: !565, file: !564, line: 30, baseType: !407, size: 64, align: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "read_tag", scope: !565, file: !564, line: 31, baseType: !114, size: 32, align: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !565, file: !564, line: 33, baseType: !114, size: 32, align: 32, offset: 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !565, file: !564, line: 34, baseType: !105, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "target_server", scope: !565, file: !564, line: 35, baseType: !105, size: 64, align: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "target_win", scope: !565, file: !564, line: 36, baseType: !579, size: 64, align: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !108, line: 117, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !582, line: 28, size: 1280, align: 64, elements: !583)
!582 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !617, !618, !619, !620, !621, !622, !623, !624}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !581, file: !582, line: 29, baseType: !114, size: 32, align: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !581, file: !582, line: 30, baseType: !105, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !581, file: !582, line: 32, baseType: !114, size: 32, align: 32, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !581, file: !582, line: 32, baseType: !114, size: 32, align: 32, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !581, file: !582, line: 34, baseType: !315, size: 64, align: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !581, file: !582, line: 35, baseType: !497, size: 64, align: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !581, file: !582, line: 36, baseType: !123, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !581, file: !582, line: 37, baseType: !123, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !581, file: !582, line: 38, baseType: !105, size: 64, align: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !581, file: !582, line: 40, baseType: !114, size: 32, align: 32, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !581, file: !582, line: 41, baseType: !315, size: 64, align: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !581, file: !582, line: 43, baseType: !181, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !581, file: !582, line: 44, baseType: !181, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !581, file: !582, line: 45, baseType: !181, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !581, file: !582, line: 48, baseType: !599, size: 64, align: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !601, line: 14, baseType: !602)
!601 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 6, size: 256, align: 64, elements: !603)
!603 = !{!604, !605, !614, !615, !616}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !601, line: 7, baseType: !105, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !602, file: !601, line: 9, baseType: !606, size: 64, align: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !608, line: 37, baseType: !609)
!608 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !608, line: 39, size: 192, align: 64, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !609, file: !608, line: 41, baseType: !102, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !608, line: 42, baseType: !606, size: 64, align: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !609, file: !608, line: 43, baseType: !606, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !602, file: !601, line: 10, baseType: !114, size: 32, align: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !602, file: !601, line: 12, baseType: !114, size: 32, align: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !602, file: !601, line: 13, baseType: !114, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !581, file: !582, line: 49, baseType: !105, size: 64, align: 64, offset: 768)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !581, file: !582, line: 51, baseType: !114, size: 32, align: 32, offset: 832)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !581, file: !582, line: 52, baseType: !105, size: 64, align: 64, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !581, file: !582, line: 54, baseType: !387, size: 64, align: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !581, file: !582, line: 55, baseType: !387, size: 64, align: 64, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !581, file: !582, line: 57, baseType: !105, size: 64, align: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !581, file: !582, line: 58, baseType: !95, size: 64, align: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !581, file: !582, line: 60, baseType: !95, size: 64, align: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "target_item", scope: !565, file: !564, line: 37, baseType: !626, size: 64, align: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXEC_WI_REC", file: !564, line: 20, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 16, size: 832, align: 64, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !113, line: 3, baseType: !114, size: 32, align: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !628, file: !113, line: 4, baseType: !114, size: 32, align: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !628, file: !113, line: 5, baseType: !117, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !628, file: !113, line: 7, baseType: !95, size: 64, align: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !628, file: !113, line: 8, baseType: !95, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !628, file: !113, line: 9, baseType: !105, size: 64, align: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !113, line: 10, baseType: !105, size: 64, align: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !628, file: !113, line: 11, baseType: !387, size: 64, align: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !628, file: !113, line: 12, baseType: !114, size: 32, align: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !628, file: !113, line: 13, baseType: !105, size: 64, align: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !628, file: !113, line: 15, baseType: !494, size: 64, align: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !628, file: !113, line: 17, baseType: !514, size: 64, align: 64, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !628, file: !564, line: 18, baseType: !562, size: 64, align: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !628, file: !564, line: 19, baseType: !181, size: 1, align: 32, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "shell", scope: !565, file: !564, line: 39, baseType: !181, size: 1, align: 32, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "notice", scope: !565, file: !564, line: 40, baseType: !181, size: 1, align: 32, offset: 769, flags: DIFlagBitField, extraData: i64 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !565, file: !564, line: 41, baseType: !181, size: 1, align: 32, offset: 770, flags: DIFlagBitField, extraData: i64 768)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !565, file: !564, line: 42, baseType: !181, size: 1, align: 32, offset: 771, flags: DIFlagBitField, extraData: i64 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "target_channel", scope: !565, file: !564, line: 43, baseType: !181, size: 1, align: 32, offset: 772, flags: DIFlagBitField, extraData: i64 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "target_nick", scope: !565, file: !564, line: 44, baseType: !181, size: 1, align: 32, offset: 773, flags: DIFlagBitField, extraData: i64 768)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !108, line: 60, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !95, !198, !114}
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !655, line: 85, baseType: !656)
!655 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !114}
!659 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!660 = !{!661, !663}
!661 = distinct !DIGlobalVariable(name: "processes", scope: !0, file: !662, line: 46, type: !315, isLocal: false, isDefinition: true, variable: %struct._GSList** @processes)
!662 = !DIFile(filename: "fe-exec.c", directory: "/home/lichi/Desktop/irssi/task1")
!663 = distinct !DIGlobalVariable(name: "signal_exec_input", scope: !0, file: !662, line: 47, type: !114, isLocal: true, isDefinition: true, variable: i32* @signal_exec_input)
!664 = !{i32 2, !"Dwarf Version", i32 4}
!665 = !{i32 2, !"Debug Info Version", i32 3}
!666 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!667 = distinct !DISubprogram(name: "fe_exec_init", scope: !662, file: !662, line: 652, type: !303, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !668)
!668 = !{}
!669 = !DILocation(line: 654, column: 2, scope: !667)
!670 = !DILocation(line: 655, column: 2, scope: !667)
!671 = !DILocation(line: 657, column: 29, scope: !667)
!672 = !DILocation(line: 657, column: 27, scope: !667)
!673 = !DILocation(line: 658, column: 9, scope: !667)
!674 = !DILocation(line: 659, column: 9, scope: !667)
!675 = !DILocation(line: 660, column: 9, scope: !667)
!676 = !DILocation(line: 661, column: 2, scope: !667)
!677 = !DILocation(line: 662, column: 1, scope: !667)
!678 = distinct !DISubprogram(name: "cmd_exec", scope: !662, file: !662, line: 541, type: !679, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !668)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !100, !123, !497}
!681 = !DILocalVariable(name: "data", arg: 1, scope: !678, file: !662, line: 541, type: !100)
!682 = !DIExpression()
!683 = !DILocation(line: 541, column: 34, scope: !678)
!684 = !DILocalVariable(name: "server", arg: 2, scope: !678, file: !662, line: 541, type: !123)
!685 = !DILocation(line: 541, column: 52, scope: !678)
!686 = !DILocalVariable(name: "item", arg: 3, scope: !678, file: !662, line: 541, type: !497)
!687 = !DILocation(line: 541, column: 73, scope: !678)
!688 = !DILocalVariable(name: "optlist", scope: !678, file: !662, line: 543, type: !117)
!689 = !DILocation(line: 543, column: 14, scope: !678)
!690 = !DILocalVariable(name: "args", scope: !678, file: !662, line: 544, type: !105)
!691 = !DILocation(line: 544, column: 15, scope: !678)
!692 = !DILocalVariable(name: "free_arg", scope: !678, file: !662, line: 545, type: !95)
!693 = !DILocation(line: 545, column: 8, scope: !678)
!694 = !DILocation(line: 547, column: 2, scope: !678)
!695 = distinct !{!695, !694}
!696 = !DILocation(line: 547, column: 10, scope: !697)
!697 = !DILexicalBlockFile(scope: !698, file: !662, discriminator: 1)
!698 = distinct !DILexicalBlock(scope: !699, file: !662, line: 547, column: 10)
!699 = distinct !DILexicalBlock(scope: !678, file: !662, line: 547, column: 4)
!700 = !DILocation(line: 547, column: 15, scope: !697)
!701 = !DILocation(line: 547, column: 5, scope: !702)
!702 = !DILexicalBlockFile(scope: !703, file: !662, discriminator: 2)
