; ModuleID = './line368-term.o.i'
source_filename = "./line368-term.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.winsize = type { i16, i16, i16, i16 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }

@resize_dirty = internal global i32 0, align 4
@term_width = common global i32 0, align 4
@term_height = common global i32 0, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !12)
!1 = !DIFile(filename: "line368-term.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !11}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !5, line: 9, baseType: !6)
!5 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !9, !9, !9, !9, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !{!13, !19, !20, !21, !22, !23, !24, !25}
!13 = distinct !DIGlobalVariable(name: "term_color256map", scope: !0, file: !14, line: 108, type: !15, isLocal: false, isDefinition: true, variable: [257 x i32]* @term_color256map)
!14 = !DIFile(filename: "term.c", directory: "/home/lichi/Desktop/irssi/task1")
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8224, align: 32, elements: !17)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !{!18}
!18 = !DISubrange(count: 257)
!19 = distinct !DIGlobalVariable(name: "term_width", scope: !0, file: !14, line: 37, type: !16, isLocal: false, isDefinition: true, variable: i32* @term_width)
!20 = distinct !DIGlobalVariable(name: "term_height", scope: !0, file: !14, line: 37, type: !16, isLocal: false, isDefinition: true, variable: i32* @term_height)
!21 = distinct !DIGlobalVariable(name: "term_use_colors", scope: !0, file: !14, line: 39, type: !16, isLocal: false, isDefinition: true, variable: i32* @term_use_colors)
!22 = distinct !DIGlobalVariable(name: "term_use_colors24", scope: !0, file: !14, line: 40, type: !16, isLocal: false, isDefinition: true, variable: i32* @term_use_colors24)
!23 = distinct !DIGlobalVariable(name: "term_type", scope: !0, file: !14, line: 41, type: !16, isLocal: false, isDefinition: true, variable: i32* @term_type)
!24 = distinct !DIGlobalVariable(name: "force_colors", scope: !0, file: !14, line: 43, type: !16, isLocal: true, isDefinition: true, variable: i32* @force_colors)
!25 = distinct !DIGlobalVariable(name: "resize_dirty", scope: !0, file: !14, line: 44, type: !16, isLocal: true, isDefinition: true, variable: i32* @resize_dirty)
!26 = !{i32 2, !"Dwarf Version", i32 4}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!29 = distinct !DISubprogram(name: "term_get_size", scope: !14, file: !14, line: 46, type: !30, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!30 = !DISubroutineType(types: !31)
!31 = !{!16, !32, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!33 = !DILocalVariable(name: "width", arg: 1, scope: !29, file: !14, line: 46, type: !32)
!34 = !DIExpression()
!35 = !DILocation(line: 46, column: 24, scope: !29)
!36 = !DILocalVariable(name: "height", arg: 2, scope: !29, file: !14, line: 46, type: !32)
!37 = !DILocation(line: 46, column: 36, scope: !29)
!38 = !DILocalVariable(name: "ws", scope: !29, file: !14, line: 49, type: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !40, line: 27, size: 64, align: 16, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/ioctl-types.h", directory: "/home/lichi/Desktop/irssi/task1")
!41 = !{!42, !44, !45, !46}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !39, file: !40, line: 29, baseType: !43, size: 16, align: 16)
!43 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !39, file: !40, line: 30, baseType: !43, size: 16, align: 16, offset: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !39, file: !40, line: 31, baseType: !43, size: 16, align: 16, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !39, file: !40, line: 32, baseType: !43, size: 16, align: 16, offset: 48)
!47 = !DILocation(line: 49, column: 17, scope: !29)
!48 = !DILocation(line: 52, column: 6, scope: !49)
!49 = distinct !DILexicalBlock(scope: !29, file: !14, line: 52, column: 6)
!50 = !DILocation(line: 52, column: 31, scope: !49)
!51 = !DILocation(line: 52, column: 6, scope: !29)
!52 = !DILocation(line: 53, column: 3, scope: !49)
!53 = !DILocation(line: 55, column: 9, scope: !54)
!54 = distinct !DILexicalBlock(scope: !29, file: !14, line: 55, column: 6)
!55 = !DILocation(line: 55, column: 6, scope: !54)
!56 = !DILocation(line: 55, column: 16, scope: !54)
!57 = !DILocation(line: 55, column: 21, scope: !54)
!58 = !DILocation(line: 55, column: 27, scope: !59)
!59 = !DILexicalBlockFile(scope: !54, file: !14, discriminator: 1)
!60 = !DILocation(line: 55, column: 24, scope: !59)
!61 = !DILocation(line: 55, column: 34, scope: !59)
!62 = !DILocation(line: 55, column: 6, scope: !59)
!63 = !DILocation(line: 56, column: 3, scope: !54)
!64 = !DILocation(line: 58, column: 14, scope: !29)
!65 = !DILocation(line: 58, column: 11, scope: !29)
!66 = !DILocation(line: 58, column: 3, scope: !29)
!67 = !DILocation(line: 58, column: 9, scope: !29)
!68 = !DILocation(line: 59, column: 22, scope: !29)
!69 = !DILocation(line: 59, column: 19, scope: !29)
!70 = !DILocation(line: 59, column: 10, scope: !29)
!71 = !DILocation(line: 59, column: 17, scope: !29)
!72 = !DILocation(line: 61, column: 7, scope: !73)
!73 = distinct !DILexicalBlock(scope: !29, file: !14, line: 61, column: 6)
!74 = !DILocation(line: 61, column: 6, scope: !73)
!75 = !DILocation(line: 61, column: 13, scope: !73)
!76 = !DILocation(line: 61, column: 6, scope: !29)
!77 = !DILocation(line: 62, column: 4, scope: !73)
!78 = !DILocation(line: 62, column: 10, scope: !73)
!79 = !DILocation(line: 62, column: 3, scope: !73)
!80 = !DILocation(line: 63, column: 7, scope: !81)
!81 = distinct !DILexicalBlock(scope: !29, file: !14, line: 63, column: 6)
!82 = !DILocation(line: 63, column: 6, scope: !81)
!83 = !DILocation(line: 63, column: 14, scope: !81)
!84 = !DILocation(line: 63, column: 6, scope: !29)
!85 = !DILocation(line: 64, column: 18, scope: !81)
!86 = !DILocation(line: 64, column: 25, scope: !81)
!87 = !DILocation(line: 64, column: 17, scope: !81)
!88 = !DILocation(line: 65, column: 2, scope: !29)
!89 = !DILocation(line: 69, column: 1, scope: !29)
!90 = distinct !DISubprogram(name: "term_resize_dirty", scope: !14, file: !14, line: 72, type: !91, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!91 = !DISubroutineType(types: !92)
!92 = !{null}
!93 = !DILocalVariable(name: "width", scope: !90, file: !14, line: 74, type: !16)
!94 = !DILocation(line: 74, column: 13, scope: !90)
!95 = !DILocalVariable(name: "height", scope: !90, file: !14, line: 74, type: !16)
!96 = !DILocation(line: 74, column: 20, scope: !90)
!97 = !DILocation(line: 76, column: 7, scope: !98)
!98 = distinct !DILexicalBlock(scope: !90, file: !14, line: 76, column: 6)
!99 = !DILocation(line: 76, column: 6, scope: !90)
!100 = !DILocation(line: 77, column: 3, scope: !98)
!101 = !DILocation(line: 79, column: 22, scope: !90)
!102 = !DILocation(line: 81, column: 7, scope: !103)
!103 = distinct !DILexicalBlock(scope: !90, file: !14, line: 81, column: 6)
!104 = !DILocation(line: 81, column: 6, scope: !90)
!105 = !DILocation(line: 82, column: 18, scope: !103)
!106 = !DILocation(line: 82, column: 9, scope: !103)
!107 = !DILocation(line: 82, column: 3, scope: !103)
!108 = !DILocation(line: 84, column: 14, scope: !90)
!109 = !DILocation(line: 84, column: 21, scope: !90)
!110 = !DILocation(line: 84, column: 2, scope: !90)
!111 = !DILocation(line: 85, column: 21, scope: !90)
!112 = !DILocation(line: 85, column: 33, scope: !90)
!113 = !DILocation(line: 85, column: 2, scope: !90)
!114 = !DILocation(line: 86, column: 20, scope: !90)
!115 = !DILocation(line: 86, column: 27, scope: !90)
!116 = !DILocation(line: 86, column: 2, scope: !90)
!117 = !DILocation(line: 87, column: 1, scope: !90)
!118 = !DILocation(line: 87, column: 1, scope: !119)
!119 = !DILexicalBlockFile(scope: !90, file: !14, discriminator: 1)
!120 = distinct !DISubprogram(name: "term_common_init", scope: !14, file: !14, line: 164, type: !91, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!121 = !DILocalVariable(name: "dummy", scope: !120, file: !14, line: 166, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!125 = !DILocation(line: 166, column: 14, scope: !120)
!126 = !DILocalVariable(name: "act", scope: !120, file: !14, line: 168, type: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !128, line: 24, size: 1216, align: 64, elements: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/lichi/Desktop/irssi/task1")
!129 = !{!130, !217, !227, !228}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !127, file: !128, line: 35, baseType: !131, size: 64, align: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !128, line: 28, size: 64, align: 64, elements: !132)
!132 = !{!133, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !131, file: !128, line: 31, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !135, line: 85, baseType: !136)
!135 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !16}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !131, file: !128, line: 33, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !16, !143, !11}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !145, line: 133, baseType: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/siginfo.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 62, size: 1024, align: 64, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !146, file: !145, line: 64, baseType: !16, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !146, file: !145, line: 65, baseType: !16, size: 32, align: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !146, file: !145, line: 67, baseType: !16, size: 32, align: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !146, file: !145, line: 132, baseType: !152, size: 896, align: 64, offset: 128)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !145, line: 69, size: 896, align: 64, elements: !153)
!153 = !{!154, !158, !167, !178, !184, !195, !206, !211}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !152, file: !145, line: 71, baseType: !155, size: 896, align: 32)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 896, align: 32, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 28)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !152, file: !145, line: 78, baseType: !159, size: 64, align: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 74, size: 64, align: 32, elements: !160)
!160 = !{!161, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !159, file: !145, line: 76, baseType: !162, size: 32, align: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !163, line: 133, baseType: !16)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !159, file: !145, line: 77, baseType: !165, size: 32, align: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !163, line: 125, baseType: !166)
!166 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !152, file: !145, line: 86, baseType: !168, size: 128, align: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 81, size: 128, align: 64, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !168, file: !145, line: 83, baseType: !16, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !168, file: !145, line: 84, baseType: !16, size: 32, align: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !168, file: !145, line: 85, baseType: !173, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !145, line: 36, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !145, line: 32, size: 64, align: 64, elements: !175)
!175 = !{!176, !177}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !174, file: !145, line: 34, baseType: !16, size: 32, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !174, file: !145, line: 35, baseType: !11, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !152, file: !145, line: 94, baseType: !179, size: 128, align: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 89, size: 128, align: 64, elements: !180)
!180 = !{!181, !182, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !179, file: !145, line: 91, baseType: !162, size: 32, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !179, file: !145, line: 92, baseType: !165, size: 32, align: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !179, file: !145, line: 93, baseType: !173, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !152, file: !145, line: 104, baseType: !185, size: 256, align: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 97, size: 256, align: 64, elements: !186)
!186 = !{!187, !188, !189, !190, !194}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !185, file: !145, line: 99, baseType: !162, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !185, file: !145, line: 100, baseType: !165, size: 32, align: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !185, file: !145, line: 101, baseType: !16, size: 32, align: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !185, file: !145, line: 102, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !145, line: 58, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !163, line: 135, baseType: !193)
!193 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !185, file: !145, line: 103, baseType: !191, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !152, file: !145, line: 116, baseType: !196, size: 256, align: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 107, size: 256, align: 64, elements: !197)
!197 = !{!198, !199, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !196, file: !145, line: 109, baseType: !11, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !196, file: !145, line: 110, baseType: !200, size: 16, align: 16, offset: 64)
!200 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_bnd", scope: !196, file: !145, line: 115, baseType: !202, size: 128, align: 64, offset: 128)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !196, file: !145, line: 111, size: 128, align: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !202, file: !145, line: 113, baseType: !11, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !202, file: !145, line: 114, baseType: !11, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !152, file: !145, line: 123, baseType: !207, size: 128, align: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 119, size: 128, align: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !207, file: !145, line: 121, baseType: !193, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !207, file: !145, line: 122, baseType: !16, size: 32, align: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !152, file: !145, line: 131, baseType: !212, size: 128, align: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !152, file: !145, line: 126, size: 128, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !212, file: !145, line: 128, baseType: !11, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !212, file: !145, line: 129, baseType: !16, size: 32, align: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !212, file: !145, line: 130, baseType: !166, size: 32, align: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !127, file: !128, line: 43, baseType: !218, size: 1024, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !219, line: 30, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigset.h", directory: "/home/lichi/Desktop/irssi/task1")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 27, size: 1024, align: 64, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !220, file: !219, line: 29, baseType: !223, size: 1024, align: 64)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 1024, align: 64, elements: !225)
!224 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!225 = !{!226}
!226 = !DISubrange(count: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !127, file: !128, line: 46, baseType: !16, size: 32, align: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !127, file: !128, line: 49, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!230 = !DILocation(line: 168, column: 19, scope: !120)
!231 = !DILocation(line: 170, column: 2, scope: !120)
!232 = !DILocation(line: 171, column: 2, scope: !120)
!233 = !DILocation(line: 172, column: 9, scope: !120)
!234 = !DILocation(line: 174, column: 15, scope: !120)
!235 = !DILocation(line: 175, column: 20, scope: !120)
!236 = !DILocation(line: 175, column: 38, scope: !120)
!237 = !DILocation(line: 175, column: 41, scope: !238)
!238 = !DILexicalBlockFile(scope: !120, file: !14, discriminator: 1)
!239 = !DILocation(line: 175, column: 38, scope: !238)
!240 = !DILocation(line: 175, column: 38, scope: !241)
!241 = !DILexicalBlockFile(scope: !120, file: !14, discriminator: 2)
!242 = !DILocation(line: 175, column: 18, scope: !241)
!243 = !DILocation(line: 180, column: 20, scope: !120)
!244 = !DILocation(line: 182, column: 9, scope: !120)
!245 = !DILocation(line: 184, column: 6, scope: !246)
!246 = distinct !DILexicalBlock(scope: !120, file: !14, line: 184, column: 6)
!247 = !DILocation(line: 184, column: 6, scope: !120)
!248 = !DILocation(line: 185, column: 13, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !14, line: 184, column: 29)
!250 = !DILocation(line: 186, column: 3, scope: !249)
!251 = !DILocation(line: 187, column: 2, scope: !249)
!252 = !DILocation(line: 189, column: 2, scope: !120)
!253 = !DILocation(line: 190, column: 2, scope: !120)
!254 = !DILocation(line: 191, column: 2, scope: !120)
!255 = !DILocation(line: 192, column: 2, scope: !120)
!256 = !DILocation(line: 195, column: 20, scope: !120)
!257 = !DILocation(line: 195, column: 2, scope: !120)
!258 = !DILocation(line: 196, column: 6, scope: !120)
!259 = !DILocation(line: 196, column: 15, scope: !120)
!260 = !DILocation(line: 197, column: 5, scope: !120)
!261 = !DILocation(line: 197, column: 25, scope: !120)
!262 = !DILocation(line: 197, column: 16, scope: !120)
!263 = !DILocation(line: 198, column: 2, scope: !120)
!264 = !DILocation(line: 200, column: 1, scope: !120)
!265 = distinct !DISubprogram(name: "read_settings", scope: !14, file: !14, line: 125, type: !91, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!266 = !DILocalVariable(name: "str", scope: !265, file: !14, line: 127, type: !122)
!267 = !DILocation(line: 127, column: 21, scope: !265)
!268 = !DILocalVariable(name: "old_colors", scope: !265, file: !14, line: 128, type: !16)
!269 = !DILocation(line: 128, column: 6, scope: !265)
!270 = !DILocation(line: 128, column: 19, scope: !265)
!271 = !DILocalVariable(name: "old_colors24", scope: !265, file: !14, line: 129, type: !16)
!272 = !DILocation(line: 129, column: 6, scope: !265)
!273 = !DILocation(line: 129, column: 21, scope: !265)
!274 = !DILocalVariable(name: "old_type", scope: !265, file: !14, line: 130, type: !16)
!275 = !DILocation(line: 130, column: 13, scope: !265)
!276 = !DILocation(line: 130, column: 24, scope: !265)
!277 = !DILocation(line: 133, column: 8, scope: !265)
!278 = !DILocation(line: 133, column: 6, scope: !265)
!279 = !DILocation(line: 134, column: 25, scope: !280)
!280 = distinct !DILexicalBlock(scope: !265, file: !14, line: 134, column: 6)
!281 = !DILocation(line: 134, column: 6, scope: !280)
!282 = !DILocation(line: 134, column: 39, scope: !280)
!283 = !DILocation(line: 134, column: 6, scope: !265)
!284 = !DILocation(line: 135, column: 13, scope: !280)
!285 = !DILocation(line: 135, column: 3, scope: !280)
!286 = !DILocation(line: 136, column: 30, scope: !287)
!287 = distinct !DILexicalBlock(scope: !280, file: !14, line: 136, column: 11)
!288 = !DILocation(line: 136, column: 11, scope: !287)
!289 = !DILocation(line: 136, column: 43, scope: !287)
!290 = !DILocation(line: 136, column: 11, scope: !280)
