; ModuleID = './line212-command-history.o.i'
source_filename = "./line212-command-history.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct.HISTORY_REC = type { i8*, %struct._GList*, i32, i32, i8 }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type opaque
%struct.HISTORY_ENTRY_REC = type { i8*, %struct.HISTORY_REC*, i64 }

@history_entries = internal global %struct._GList* null, align 8
@__func__.command_history_add = private unnamed_addr constant [20 x i8] c"command_history_add\00", align 1
@.str = private unnamed_addr constant [16 x i8] c"history != NULL\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"text != NULL\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"max_command_history\00", align 1
@histories = internal global %struct._GSList* null, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !133)
!1 = !DIFile(filename: "line212-command-history.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !5, !42, !11, !44, !52, !15, !56, !61, !65, !84, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_ENTRY_REC", file: !7, line: 20, baseType: !8)
!7 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 16, size: 192, align: 64, elements: !9)
!9 = !{!10, !14, !36}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !8, file: !7, line: 17, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !8, file: !7, line: 18, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !7, line: 14, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 6, size: 256, align: 64, elements: !18)
!18 = !{!19, !21, !32, !34, !35}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !7, line: 7, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !17, file: !7, line: 9, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !24, line: 37, baseType: !25)
!24 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !24, line: 39, size: 192, align: 64, elements: !26)
!26 = !{!27, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !24, line: 41, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !29, line: 77, baseType: !4)
!29 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !24, line: 42, baseType: !22, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !25, file: !24, line: 43, baseType: !22, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !17, file: !7, line: 10, baseType: !33, size: 32, align: 32, offset: 128)
!33 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !17, file: !7, line: 12, baseType: !33, size: 32, align: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !17, file: !7, line: 13, baseType: !33, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !8, file: !7, line: 19, baseType: !37, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !38, line: 75, baseType: !39)
!38 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 139, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !29, line: 46, baseType: !13)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !29, line: 80, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !49, !49}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !29, line: 49, baseType: !33)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !29, line: 78, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !29, line: 88, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !28, !28}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !57, line: 9, baseType: !58)
!57 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !50, !50, !50, !50, !50, !50}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "GDestroyNotify", file: !29, line: 87, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !28}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !67, line: 117, baseType: !68)
!67 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !69, line: 28, size: 1280, align: 64, elements: !70)
!69 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !{!71, !72, !73, !74, !75, !83, !115, !116, !117, !118, !119, !120, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !68, file: !69, line: 29, baseType: !33, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 30, baseType: !20, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !68, file: !69, line: 32, baseType: !33, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !68, file: !69, line: 32, baseType: !33, size: 32, align: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !68, file: !69, line: 34, baseType: !76, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !78, line: 37, baseType: !79)
!78 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !78, line: 39, size: 128, align: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !78, line: 41, baseType: !28, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !78, line: 42, baseType: !76, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !68, file: !69, line: 35, baseType: !84, size: 64, align: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !67, line: 108, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !87, line: 5, size: 704, align: 64, elements: !88)
!87 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!88 = !{!89, !91, !92, !97, !98, !102, !103, !104, !105, !106, !107, !111}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !90, line: 3, baseType: !33, size: 32, align: 32)
!90 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !86, file: !90, line: 4, baseType: !33, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !86, file: !90, line: 5, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !95, line: 37, baseType: !96)
!95 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !95, line: 37, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !86, file: !90, line: 7, baseType: !4, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !86, file: !90, line: 8, baseType: !99, size: 64, align: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !67, line: 107, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !67, line: 107, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !86, file: !90, line: 9, baseType: !20, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !90, line: 10, baseType: !20, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !86, file: !90, line: 11, baseType: !37, size: 64, align: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !86, file: !90, line: 12, baseType: !33, size: 32, align: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !86, file: !90, line: 13, baseType: !20, size: 64, align: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !86, file: !90, line: 15, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !84}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !86, file: !90, line: 17, baseType: !112, size: 64, align: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!11, !84}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !68, file: !69, line: 36, baseType: !99, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !68, file: !69, line: 37, baseType: !99, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !68, file: !69, line: 38, baseType: !20, size: 64, align: 64, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !68, file: !69, line: 40, baseType: !33, size: 32, align: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !68, file: !69, line: 41, baseType: !76, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !68, file: !69, line: 43, baseType: !121, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!121 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !68, file: !69, line: 44, baseType: !121, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !68, file: !69, line: 45, baseType: !121, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !68, file: !69, line: 48, baseType: !15, size: 64, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !68, file: !69, line: 49, baseType: !20, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !68, file: !69, line: 51, baseType: !33, size: 32, align: 32, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !68, file: !69, line: 52, baseType: !20, size: 64, align: 64, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !68, file: !69, line: 54, baseType: !37, size: 64, align: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !68, file: !69, line: 55, baseType: !37, size: 64, align: 64, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !68, file: !69, line: 57, baseType: !20, size: 64, align: 64, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !68, file: !69, line: 58, baseType: !4, size: 64, align: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !68, file: !69, line: 60, baseType: !4, size: 64, align: 64, offset: 1216)
!133 = !{!134, !136, !137, !138}
!134 = distinct !DIGlobalVariable(name: "history_entries", scope: !0, file: !135, line: 33, type: !22, isLocal: true, isDefinition: true, variable: %struct._GList** @history_entries)
!135 = !DIFile(filename: "command-history.c", directory: "/home/lichi/Desktop/irssi/task1")
!136 = distinct !DIGlobalVariable(name: "global_history", scope: !0, file: !135, line: 34, type: !15, isLocal: true, isDefinition: true, variable: %struct.HISTORY_REC** @global_history)
!137 = distinct !DIGlobalVariable(name: "window_history", scope: !0, file: !135, line: 35, type: !33, isLocal: true, isDefinition: true, variable: i32* @window_history)
!138 = distinct !DIGlobalVariable(name: "histories", scope: !0, file: !135, line: 36, type: !76, isLocal: true, isDefinition: true, variable: %struct._GSList** @histories)
!139 = !{i32 2, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!142 = distinct !DISubprogram(name: "command_history_list_last", scope: !135, file: !135, line: 56, type: !143, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!143 = !DISubroutineType(types: !144)
!144 = !{!22, !15}
!145 = !DILocalVariable(name: "history", arg: 1, scope: !142, file: !135, line: 56, type: !15)
!146 = !DIExpression()
!147 = !DILocation(line: 56, column: 47, scope: !142)
!148 = !DILocalVariable(name: "link", scope: !142, file: !135, line: 58, type: !22)
!149 = !DILocation(line: 58, column: 9, scope: !142)
!150 = !DILocation(line: 60, column: 21, scope: !142)
!151 = !DILocation(line: 60, column: 9, scope: !142)
!152 = !DILocation(line: 60, column: 7, scope: !142)
!153 = !DILocation(line: 61, column: 2, scope: !142)
!154 = !DILocation(line: 61, column: 9, scope: !155)
!155 = !DILexicalBlockFile(scope: !142, file: !135, discriminator: 1)
!156 = !DILocation(line: 61, column: 14, scope: !155)
!157 = !DILocation(line: 61, column: 21, scope: !155)
!158 = !DILocation(line: 61, column: 24, scope: !159)
!159 = !DILexicalBlockFile(scope: !142, file: !135, discriminator: 2)
!160 = !DILocation(line: 61, column: 32, scope: !159)
!161 = !DILocation(line: 61, column: 40, scope: !159)
!162 = !DILocation(line: 61, column: 65, scope: !163)
!163 = !DILexicalBlockFile(scope: !142, file: !135, discriminator: 3)
!164 = !DILocation(line: 61, column: 71, scope: !163)
!165 = !DILocation(line: 61, column: 44, scope: !163)
!166 = !DILocation(line: 61, column: 78, scope: !163)
!167 = !DILocation(line: 61, column: 89, scope: !163)
!168 = !DILocation(line: 61, column: 86, scope: !163)
!169 = !DILocation(line: 61, column: 2, scope: !170)
!170 = !DILexicalBlockFile(scope: !142, file: !135, discriminator: 4)
!171 = !DILocation(line: 62, column: 10, scope: !172)
!172 = distinct !DILexicalBlock(scope: !142, file: !135, line: 61, column: 98)
!173 = !DILocation(line: 62, column: 16, scope: !172)
!174 = !DILocation(line: 62, column: 8, scope: !172)
!175 = !DILocation(line: 61, column: 2, scope: !176)
!176 = !DILexicalBlockFile(scope: !142, file: !135, discriminator: 5)
!177 = distinct !{!177, !153}
!178 = !DILocation(line: 65, column: 9, scope: !142)
!179 = !DILocation(line: 65, column: 2, scope: !142)
!180 = distinct !DISubprogram(name: "command_history_list_first", scope: !135, file: !135, line: 68, type: !143, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!181 = !DILocalVariable(name: "history", arg: 1, scope: !180, file: !135, line: 68, type: !15)
!182 = !DILocation(line: 68, column: 48, scope: !180)
!183 = !DILocalVariable(name: "link", scope: !180, file: !135, line: 70, type: !22)
!184 = !DILocation(line: 70, column: 9, scope: !180)
!185 = !DILocation(line: 72, column: 9, scope: !180)
