; ModuleID = './line314-fe-events-numeric.o.i'
source_filename = "./line314-fe-events-numeric.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!374 = !DIEnumerator(name: "TXT_WINDOW_THEME_DEFAULT", value: 179)
!375 = !DIEnumerator(name: "TXT_WINDOW_THEME_CHANGED", value: 180)
!376 = !DIEnumerator(name: "TXT_WINDOW_THEME_REMOVED", value: 181)
!377 = !DIEnumerator(name: "TXT_FORMAT_TITLE", value: 182)
!378 = !DIEnumerator(name: "TXT_FORMAT_SUBTITLE", value: 183)
!379 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!380 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!381 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!382 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!383 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!384 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!385 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!386 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!387 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!388 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!389 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!390 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!391 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!392 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!393 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!394 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!395 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!396 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!397 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!398 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!399 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!400 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!401 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!402 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!403 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!404 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!405 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!406 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!407 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!408 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!409 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!410 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!411 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!412 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!413 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!414 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!415 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!416 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!417 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!418 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!419 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!420 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!421 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!422 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!423 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!424 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!425 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!426 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!427 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!428 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!429 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!430 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!431 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!432 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!433 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!434 = !{!435, !442, !443, !447, !449, !874, !769, !457, !559, !719}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !436, line: 9, baseType: !437)
!436 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440, !440, !440, !440, !440, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !445, line: 46, baseType: !446)
!445 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!446 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !451, line: 7, baseType: !452)
!451 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !453, line: 15, size: 1600, align: 64, elements: !454)
!453 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!454 = !{!455, !458, !459, !464, !465, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !456, line: 3, baseType: !457, size: 32, align: 32)
!456 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!457 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !452, file: !456, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !452, file: !456, line: 5, baseType: !460, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !462, line: 37, baseType: !463)
!462 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !462, line: 37, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !452, file: !456, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !452, file: !456, line: 8, baseType: !466, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !451, line: 6, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !469, line: 42, size: 39168, align: 64, elements: !470)
!469 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!470 = !{!471, !473, !474, !475, !718, !723, !724, !725, !726, !727, !728, !729, !730, !731, !735, !736, !740, !741, !742, !746, !747, !748, !749, !750, !751, !752, !753, !754, !761, !762, !763, !764, !765, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1046, !1048}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !472, line: 3, baseType: !457, size: 32, align: 32)
!472 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !468, file: !472, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !468, file: !472, line: 6, baseType: !457, size: 32, align: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !468, file: !472, line: 8, baseType: !476, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !451, line: 5, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !469, line: 24, size: 2496, align: 64, elements: !479)
!479 = !{!480, !482, !483, !484, !486, !487, !488, !489, !490, !492, !493, !494, !495, !496, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !481, line: 3, baseType: !457, size: 32, align: 32)
!481 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !478, file: !481, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !478, file: !481, line: 6, baseType: !457, size: 32, align: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !478, file: !481, line: 9, baseType: !485, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !478, file: !481, line: 10, baseType: !457, size: 32, align: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !478, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !478, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !478, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !478, file: !481, line: 13, baseType: !491, size: 16, align: 16, offset: 448)
!491 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !478, file: !481, line: 14, baseType: !485, size: 64, align: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !478, file: !481, line: 15, baseType: !485, size: 64, align: 64, offset: 576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !478, file: !481, line: 16, baseType: !457, size: 32, align: 32, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !478, file: !481, line: 17, baseType: !485, size: 64, align: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !478, file: !481, line: 19, baseType: !497, size: 64, align: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !499, line: 99, baseType: !500)
!499 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !499, line: 99, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !478, file: !481, line: 19, baseType: !497, size: 64, align: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !478, file: !481, line: 21, baseType: !485, size: 64, align: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !478, file: !481, line: 22, baseType: !485, size: 64, align: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !478, file: !481, line: 23, baseType: !485, size: 64, align: 64, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !478, file: !481, line: 24, baseType: !485, size: 64, align: 64, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !478, file: !481, line: 26, baseType: !485, size: 64, align: 64, offset: 1152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !478, file: !481, line: 27, baseType: !485, size: 64, align: 64, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !478, file: !481, line: 28, baseType: !485, size: 64, align: 64, offset: 1280)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !478, file: !481, line: 29, baseType: !485, size: 64, align: 64, offset: 1344)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !478, file: !481, line: 30, baseType: !485, size: 64, align: 64, offset: 1408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !478, file: !481, line: 31, baseType: !485, size: 64, align: 64, offset: 1472)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !478, file: !481, line: 32, baseType: !485, size: 64, align: 64, offset: 1536)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !478, file: !481, line: 33, baseType: !485, size: 64, align: 64, offset: 1600)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !478, file: !481, line: 35, baseType: !515, size: 64, align: 64, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !518)
!518 = !{!519, !521, !663, !664, !669, !670, !671, !672, !673, !682, !683, !684, !688, !689, !690, !691, !692, !693, !694, !695}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !517, file: !4, line: 100, baseType: !520, size: 32, align: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !445, line: 49, baseType: !457)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !517, file: !4, line: 101, baseType: !522, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !525)
!525 = !{!526, !548, !554, !561, !565, !650, !654, !659}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !524, file: !4, line: 133, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!530, !515, !443, !531, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !532, line: 66, baseType: !533)
!532 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!533 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !538, line: 42, baseType: !539)
!538 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !538, line: 44, size: 128, align: 64, elements: !540)
!540 = !{!541, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !539, file: !538, line: 46, baseType: !542, size: 32, align: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !543, line: 36, baseType: !544)
!543 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !532, line: 45, baseType: !545)
!545 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !539, file: !538, line: 47, baseType: !520, size: 32, align: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !539, file: !538, line: 48, baseType: !443, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !524, file: !4, line: 138, baseType: !549, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!530, !515, !552, !531, !534, !535}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !524, file: !4, line: 143, baseType: !555, size: 64, align: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!530, !515, !558, !560, !535}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !532, line: 51, baseType: !559)
!559 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !524, file: !4, line: 147, baseType: !562, size: 64, align: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!530, !515, !535}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !524, file: !4, line: 149, baseType: !566, size: 64, align: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!569, !515, !649}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !572)
!572 = !{!573, !575, !596, !625, !627, !631, !632, !633, !634, !642, !643, !644, !645}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !571, file: !16, line: 174, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !445, line: 77, baseType: !442)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !571, file: !16, line: 175, baseType: !576, size: 64, align: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !579)
!579 = !{!580, !584, !585}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !578, file: !16, line: 198, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !574}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !578, file: !16, line: 199, baseType: !581, size: 64, align: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !578, file: !16, line: 200, baseType: !586, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !574, !569, !589, !595}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !574}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !445, line: 50, baseType: !520)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !571, file: !16, line: 177, baseType: !597, size: 64, align: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !601)
!601 = !{!602, !607, !611, !615, !619, !620}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !600, file: !16, line: 216, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!594, !569, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !600, file: !16, line: 218, baseType: !608, size: 64, align: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!594, !569}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !600, file: !16, line: 219, baseType: !612, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!594, !569, !590, !574}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !600, file: !16, line: 222, baseType: !616, size: 64, align: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !569}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !600, file: !16, line: 226, baseType: !590, size: 64, align: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !600, file: !16, line: 227, baseType: !621, size: 64, align: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !571, file: !16, line: 178, baseType: !626, size: 32, align: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !445, line: 55, baseType: !545)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !571, file: !16, line: 180, baseType: !628, size: 64, align: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !571, file: !16, line: 182, baseType: !520, size: 32, align: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !571, file: !16, line: 183, baseType: !626, size: 32, align: 32, offset: 352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !571, file: !16, line: 184, baseType: !626, size: 32, align: 32, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !571, file: !16, line: 186, baseType: !635, size: 64, align: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !637, line: 37, baseType: !638)
!637 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !637, line: 39, size: 128, align: 64, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !638, file: !637, line: 41, baseType: !574, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !637, line: 42, baseType: !635, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !571, file: !16, line: 188, baseType: !569, size: 64, align: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !16, line: 189, baseType: !569, size: 64, align: 64, offset: 576)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !571, file: !16, line: 191, baseType: !485, size: 64, align: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !571, file: !16, line: 193, baseType: !646, size: 64, align: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !524, file: !4, line: 151, baseType: !651, size: 64, align: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !515}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !524, file: !4, line: 152, baseType: !655, size: 64, align: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{!530, !515, !658, !535}
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !524, file: !4, line: 155, baseType: !660, size: 64, align: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!658, !515}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !517, file: !4, line: 103, baseType: !443, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !517, file: !4, line: 104, baseType: !665, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !666, line: 77, baseType: !667)
!666 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !666, line: 77, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !517, file: !4, line: 105, baseType: !665, size: 64, align: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !517, file: !4, line: 106, baseType: !443, size: 64, align: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !517, file: !4, line: 107, baseType: !626, size: 32, align: 32, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !517, file: !4, line: 109, baseType: !531, size: 64, align: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !517, file: !4, line: 110, baseType: !674, size: 64, align: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !676, line: 39, baseType: !677)
!676 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !676, line: 41, size: 192, align: 64, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !677, file: !676, line: 43, baseType: !443, size: 64, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !677, file: !676, line: 44, baseType: !531, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !677, file: !676, line: 45, baseType: !531, size: 64, align: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !517, file: !4, line: 111, baseType: !674, size: 64, align: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !517, file: !4, line: 112, baseType: !674, size: 64, align: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !517, file: !4, line: 113, baseType: !685, size: 48, align: 8, offset: 704)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 48, align: 8, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 6)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !517, file: !4, line: 117, baseType: !626, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !517, file: !4, line: 118, baseType: !626, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !517, file: !4, line: 119, baseType: !626, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !517, file: !4, line: 120, baseType: !626, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !517, file: !4, line: 121, baseType: !626, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !517, file: !4, line: 122, baseType: !626, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !517, file: !4, line: 124, baseType: !574, size: 64, align: 64, offset: 768)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !517, file: !4, line: 125, baseType: !574, size: 64, align: 64, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !478, file: !481, line: 38, baseType: !545, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !478, file: !481, line: 39, baseType: !545, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !478, file: !481, line: 40, baseType: !545, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !478, file: !481, line: 41, baseType: !545, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !478, file: !481, line: 42, baseType: !545, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !478, file: !481, line: 43, baseType: !545, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !478, file: !481, line: 44, baseType: !545, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !478, file: !481, line: 45, baseType: !545, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !478, file: !481, line: 46, baseType: !485, size: 64, align: 64, offset: 1792)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !478, file: !481, line: 47, baseType: !485, size: 64, align: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !478, file: !469, line: 27, baseType: !485, size: 64, align: 64, offset: 1920)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !478, file: !469, line: 28, baseType: !485, size: 64, align: 64, offset: 1984)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !478, file: !469, line: 30, baseType: !457, size: 32, align: 32, offset: 2048)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !478, file: !469, line: 31, baseType: !485, size: 64, align: 64, offset: 2112)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !478, file: !469, line: 32, baseType: !485, size: 64, align: 64, offset: 2176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !478, file: !469, line: 34, baseType: !457, size: 32, align: 32, offset: 2240)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !478, file: !469, line: 35, baseType: !457, size: 32, align: 32, offset: 2272)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !478, file: !469, line: 36, baseType: !457, size: 32, align: 32, offset: 2304)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !478, file: !469, line: 38, baseType: !457, size: 32, align: 32, offset: 2336)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !478, file: !469, line: 38, baseType: !457, size: 32, align: 32, offset: 2368)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !478, file: !469, line: 38, baseType: !457, size: 32, align: 32, offset: 2400)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !478, file: !469, line: 38, baseType: !457, size: 32, align: 32, offset: 2432)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !468, file: !472, line: 9, baseType: !719, size: 64, align: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !720, line: 75, baseType: !721)
!720 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !722, line: 139, baseType: !559)
!722 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!723 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !468, file: !472, line: 10, baseType: !719, size: 64, align: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !468, file: !472, line: 12, baseType: !485, size: 64, align: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !468, file: !472, line: 13, baseType: !485, size: 64, align: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !468, file: !472, line: 15, baseType: !545, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !468, file: !472, line: 16, baseType: !545, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !468, file: !472, line: 17, baseType: !545, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !468, file: !472, line: 18, baseType: !545, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !468, file: !472, line: 19, baseType: !545, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !468, file: !472, line: 21, baseType: !732, size: 64, align: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !499, line: 102, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !499, line: 102, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !468, file: !472, line: 22, baseType: !457, size: 32, align: 32, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !468, file: !472, line: 25, baseType: !737, size: 128, align: 64, offset: 640)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 128, align: 64, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 2)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !468, file: !472, line: 26, baseType: !457, size: 32, align: 32, offset: 768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !468, file: !472, line: 27, baseType: !457, size: 32, align: 32, offset: 800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !468, file: !472, line: 29, baseType: !743, size: 64, align: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !499, line: 103, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !499, line: 103, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !468, file: !472, line: 30, baseType: !460, size: 64, align: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !468, file: !472, line: 32, baseType: !485, size: 64, align: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !468, file: !472, line: 33, baseType: !485, size: 64, align: 64, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !468, file: !472, line: 34, baseType: !485, size: 64, align: 64, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !468, file: !472, line: 35, baseType: !545, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !468, file: !472, line: 36, baseType: !545, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !468, file: !472, line: 37, baseType: !545, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !468, file: !472, line: 38, baseType: !545, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !468, file: !472, line: 40, baseType: !755, size: 128, align: 64, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !445, line: 504, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !445, line: 506, size: 128, align: 64, elements: !757)
!757 = !{!758, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !756, file: !445, line: 508, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !445, line: 48, baseType: !559)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !756, file: !445, line: 509, baseType: !759, size: 64, align: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !468, file: !472, line: 41, baseType: !719, size: 64, align: 64, offset: 1344)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !468, file: !472, line: 42, baseType: !457, size: 32, align: 32, offset: 1408)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !468, file: !472, line: 44, baseType: !635, size: 64, align: 64, offset: 1472)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !468, file: !472, line: 45, baseType: !635, size: 64, align: 64, offset: 1536)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !468, file: !472, line: 53, baseType: !766, size: 64, align: 64, offset: 1600)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !769, !447, !457}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !499, line: 107, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !772, line: 30, size: 2240, align: 64, elements: !773)
!772 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!773 = !{!774, !775, !776, !777, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !853, !857, !861, !865, !870, !962, !969, !973}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !472, line: 3, baseType: !457, size: 32, align: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !771, file: !472, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !771, file: !472, line: 6, baseType: !457, size: 32, align: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !771, file: !472, line: 8, baseType: !778, size: 64, align: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !499, line: 113, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !772, line: 25, size: 1920, align: 64, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !780, file: !481, line: 3, baseType: !457, size: 32, align: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !780, file: !481, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !780, file: !481, line: 6, baseType: !457, size: 32, align: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !780, file: !481, line: 9, baseType: !485, size: 64, align: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !780, file: !481, line: 10, baseType: !457, size: 32, align: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !780, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !780, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !780, file: !481, line: 11, baseType: !485, size: 64, align: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !780, file: !481, line: 13, baseType: !491, size: 16, align: 16, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !780, file: !481, line: 14, baseType: !485, size: 64, align: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !780, file: !481, line: 15, baseType: !485, size: 64, align: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !780, file: !481, line: 16, baseType: !457, size: 32, align: 32, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !780, file: !481, line: 17, baseType: !485, size: 64, align: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !780, file: !481, line: 19, baseType: !497, size: 64, align: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !780, file: !481, line: 19, baseType: !497, size: 64, align: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !780, file: !481, line: 21, baseType: !485, size: 64, align: 64, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !780, file: !481, line: 22, baseType: !485, size: 64, align: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !780, file: !481, line: 23, baseType: !485, size: 64, align: 64, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !780, file: !481, line: 24, baseType: !485, size: 64, align: 64, offset: 1088)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !780, file: !481, line: 26, baseType: !485, size: 64, align: 64, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !780, file: !481, line: 27, baseType: !485, size: 64, align: 64, offset: 1216)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !780, file: !481, line: 28, baseType: !485, size: 64, align: 64, offset: 1280)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !780, file: !481, line: 29, baseType: !485, size: 64, align: 64, offset: 1344)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !780, file: !481, line: 30, baseType: !485, size: 64, align: 64, offset: 1408)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !780, file: !481, line: 31, baseType: !485, size: 64, align: 64, offset: 1472)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !780, file: !481, line: 32, baseType: !485, size: 64, align: 64, offset: 1536)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !780, file: !481, line: 33, baseType: !485, size: 64, align: 64, offset: 1600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !780, file: !481, line: 35, baseType: !515, size: 64, align: 64, offset: 1664)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !780, file: !481, line: 38, baseType: !545, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !780, file: !481, line: 39, baseType: !545, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !780, file: !481, line: 40, baseType: !545, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !780, file: !481, line: 41, baseType: !545, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !780, file: !481, line: 42, baseType: !545, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !780, file: !481, line: 43, baseType: !545, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !780, file: !481, line: 44, baseType: !545, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !780, file: !481, line: 45, baseType: !545, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !780, file: !481, line: 46, baseType: !485, size: 64, align: 64, offset: 1792)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !780, file: !481, line: 47, baseType: !485, size: 64, align: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !771, file: !472, line: 9, baseType: !719, size: 64, align: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !771, file: !472, line: 10, baseType: !719, size: 64, align: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !771, file: !472, line: 12, baseType: !485, size: 64, align: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !771, file: !472, line: 13, baseType: !485, size: 64, align: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !771, file: !472, line: 15, baseType: !545, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !771, file: !472, line: 16, baseType: !545, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !771, file: !472, line: 17, baseType: !545, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !771, file: !472, line: 18, baseType: !545, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !771, file: !472, line: 19, baseType: !545, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !771, file: !472, line: 21, baseType: !732, size: 64, align: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !771, file: !472, line: 22, baseType: !457, size: 32, align: 32, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !771, file: !472, line: 25, baseType: !737, size: 128, align: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !771, file: !472, line: 26, baseType: !457, size: 32, align: 32, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !771, file: !472, line: 27, baseType: !457, size: 32, align: 32, offset: 800)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !771, file: !472, line: 29, baseType: !743, size: 64, align: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !771, file: !472, line: 30, baseType: !460, size: 64, align: 64, offset: 896)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !771, file: !472, line: 32, baseType: !485, size: 64, align: 64, offset: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !771, file: !472, line: 33, baseType: !485, size: 64, align: 64, offset: 1024)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !771, file: !472, line: 34, baseType: !485, size: 64, align: 64, offset: 1088)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !771, file: !472, line: 35, baseType: !545, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !771, file: !472, line: 36, baseType: !545, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !771, file: !472, line: 37, baseType: !545, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !771, file: !472, line: 38, baseType: !545, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !771, file: !472, line: 40, baseType: !755, size: 128, align: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !771, file: !472, line: 41, baseType: !719, size: 64, align: 64, offset: 1344)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !771, file: !472, line: 42, baseType: !457, size: 32, align: 32, offset: 1408)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !771, file: !472, line: 44, baseType: !635, size: 64, align: 64, offset: 1472)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !771, file: !472, line: 45, baseType: !635, size: 64, align: 64, offset: 1536)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !771, file: !472, line: 53, baseType: !766, size: 64, align: 64, offset: 1600)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !771, file: !472, line: 55, baseType: !850, size: 64, align: 64, offset: 1664)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64, align: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!457, !769, !446}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !771, file: !472, line: 57, baseType: !854, size: 64, align: 64, offset: 1728)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64, align: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!457, !769, !447}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !771, file: !472, line: 60, baseType: !858, size: 64, align: 64, offset: 1792)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!447, !769}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !771, file: !472, line: 62, baseType: !862, size: 64, align: 64, offset: 1856)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !769, !447, !447, !457}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !771, file: !472, line: 65, baseType: !866, size: 64, align: 64, offset: 1920)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!869, !769, !447, !447}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !771, file: !472, line: 69, baseType: !871, size: 64, align: 64, offset: 1984)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !769, !447}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !499, line: 109, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !877, line: 15, size: 1408, align: 64, elements: !878)
!877 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !913, !914, !916, !917, !918, !919, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !876, file: !456, line: 3, baseType: !457, size: 32, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !876, file: !456, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !876, file: !456, line: 5, baseType: !460, size: 64, align: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !876, file: !456, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !876, file: !456, line: 8, baseType: !769, size: 64, align: 64, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !876, file: !456, line: 9, baseType: !485, size: 64, align: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !456, line: 10, baseType: !485, size: 64, align: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !876, file: !456, line: 11, baseType: !719, size: 64, align: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !876, file: !456, line: 12, baseType: !457, size: 32, align: 32, offset: 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !876, file: !456, line: 13, baseType: !485, size: 64, align: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !876, file: !456, line: 15, baseType: !890, size: 64, align: 64, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !499, line: 108, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !896, line: 5, size: 704, align: 64, elements: !897)
!896 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !895, file: !456, line: 3, baseType: !457, size: 32, align: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !895, file: !456, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !895, file: !456, line: 5, baseType: !460, size: 64, align: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !895, file: !456, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !895, file: !456, line: 8, baseType: !769, size: 64, align: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !895, file: !456, line: 9, baseType: !485, size: 64, align: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !456, line: 10, baseType: !485, size: 64, align: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !895, file: !456, line: 11, baseType: !719, size: 64, align: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !895, file: !456, line: 12, baseType: !457, size: 32, align: 32, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !895, file: !456, line: 13, baseType: !485, size: 64, align: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !895, file: !456, line: 15, baseType: !890, size: 64, align: 64, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !895, file: !456, line: 17, baseType: !910, size: 64, align: 64, offset: 640)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!447, !893}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !876, file: !456, line: 17, baseType: !910, size: 64, align: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !876, file: !915, line: 5, baseType: !485, size: 64, align: 64, offset: 704)
!915 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!916 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !876, file: !915, line: 6, baseType: !485, size: 64, align: 64, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !876, file: !915, line: 7, baseType: !719, size: 64, align: 64, offset: 832)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !876, file: !915, line: 9, baseType: !460, size: 64, align: 64, offset: 896)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !876, file: !915, line: 10, baseType: !920, size: 64, align: 64, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !499, line: 111, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !923, line: 13, size: 576, align: 64, elements: !924)
!923 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!924 = !{!925, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !943, !944}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !922, file: !926, line: 3, baseType: !457, size: 32, align: 32)
!926 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!927 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !922, file: !926, line: 4, baseType: !457, size: 32, align: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !922, file: !926, line: 6, baseType: !719, size: 64, align: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !922, file: !926, line: 8, baseType: !485, size: 64, align: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !922, file: !926, line: 9, baseType: !485, size: 64, align: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !922, file: !926, line: 10, baseType: !485, size: 64, align: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !922, file: !926, line: 11, baseType: !457, size: 32, align: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !922, file: !926, line: 14, baseType: !545, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !922, file: !926, line: 15, baseType: !545, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !922, file: !926, line: 18, baseType: !545, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !922, file: !926, line: 19, baseType: !545, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !922, file: !926, line: 20, baseType: !545, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !922, file: !926, line: 21, baseType: !545, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !922, file: !926, line: 22, baseType: !940, size: 64, align: 8, offset: 360)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 64, align: 8, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !922, file: !926, line: 26, baseType: !442, size: 64, align: 64, offset: 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !926, line: 28, baseType: !920, size: 64, align: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !876, file: !915, line: 12, baseType: !545, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !876, file: !915, line: 13, baseType: !485, size: 64, align: 64, offset: 1088)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !876, file: !915, line: 14, baseType: !457, size: 32, align: 32, offset: 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !876, file: !915, line: 15, baseType: !485, size: 64, align: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !876, file: !915, line: 17, baseType: !545, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !876, file: !915, line: 18, baseType: !545, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !876, file: !915, line: 19, baseType: !545, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !876, file: !915, line: 20, baseType: !545, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !876, file: !915, line: 22, baseType: !545, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !876, file: !915, line: 23, baseType: !545, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !876, file: !915, line: 24, baseType: !545, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !876, file: !915, line: 25, baseType: !545, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !876, file: !915, line: 26, baseType: !545, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !876, file: !915, line: 31, baseType: !959, size: 64, align: 64, offset: 1344)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!485, !874}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !771, file: !472, line: 70, baseType: !963, size: 64, align: 64, offset: 2048)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !769, !447}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !499, line: 110, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !499, line: 110, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !771, file: !472, line: 71, baseType: !970, size: 64, align: 64, offset: 2112)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!457, !447, !447}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !771, file: !472, line: 73, baseType: !970, size: 64, align: 64, offset: 2176)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !468, file: !472, line: 55, baseType: !850, size: 64, align: 64, offset: 1664)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !468, file: !472, line: 57, baseType: !854, size: 64, align: 64, offset: 1728)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !468, file: !472, line: 60, baseType: !858, size: 64, align: 64, offset: 1792)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !468, file: !472, line: 62, baseType: !862, size: 64, align: 64, offset: 1856)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !468, file: !472, line: 65, baseType: !866, size: 64, align: 64, offset: 1920)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !468, file: !472, line: 69, baseType: !871, size: 64, align: 64, offset: 1984)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !468, file: !472, line: 70, baseType: !963, size: 64, align: 64, offset: 2048)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !468, file: !472, line: 71, baseType: !970, size: 64, align: 64, offset: 2112)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !468, file: !472, line: 73, baseType: !970, size: 64, align: 64, offset: 2176)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !468, file: !469, line: 46, baseType: !635, size: 64, align: 64, offset: 2240)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !468, file: !469, line: 47, baseType: !635, size: 64, align: 64, offset: 2304)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !468, file: !469, line: 48, baseType: !986, size: 64, align: 64, offset: 2368)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !451, line: 8, baseType: !988)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !451, line: 8, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !468, file: !469, line: 49, baseType: !635, size: 64, align: 64, offset: 2432)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !468, file: !469, line: 51, baseType: !485, size: 64, align: 64, offset: 2496)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !468, file: !469, line: 53, baseType: !485, size: 64, align: 64, offset: 2560)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !468, file: !469, line: 54, baseType: !485, size: 64, align: 64, offset: 2624)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !468, file: !469, line: 55, baseType: !485, size: 64, align: 64, offset: 2688)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !468, file: !469, line: 56, baseType: !485, size: 64, align: 64, offset: 2752)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !468, file: !469, line: 57, baseType: !457, size: 32, align: 32, offset: 2816)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !468, file: !469, line: 59, baseType: !545, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !468, file: !469, line: 60, baseType: !545, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !468, file: !469, line: 62, baseType: !545, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !468, file: !469, line: 63, baseType: !545, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !468, file: !469, line: 64, baseType: !545, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !468, file: !469, line: 65, baseType: !545, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !468, file: !469, line: 66, baseType: !545, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !468, file: !469, line: 67, baseType: !545, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !468, file: !469, line: 68, baseType: !545, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !468, file: !469, line: 69, baseType: !545, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !468, file: !469, line: 70, baseType: !545, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !468, file: !469, line: 71, baseType: !545, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !468, file: !469, line: 72, baseType: !545, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !468, file: !469, line: 74, baseType: !457, size: 32, align: 32, offset: 2880)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !468, file: !469, line: 75, baseType: !457, size: 32, align: 32, offset: 2912)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !468, file: !469, line: 76, baseType: !457, size: 32, align: 32, offset: 2944)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !468, file: !469, line: 77, baseType: !457, size: 32, align: 32, offset: 2976)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !468, file: !469, line: 79, baseType: !460, size: 64, align: 64, offset: 3008)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !468, file: !469, line: 80, baseType: !635, size: 64, align: 64, offset: 3072)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !468, file: !469, line: 81, baseType: !635, size: 64, align: 64, offset: 3136)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !468, file: !469, line: 83, baseType: !674, size: 64, align: 64, offset: 3200)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !468, file: !469, line: 84, baseType: !626, size: 32, align: 32, offset: 3264)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !468, file: !469, line: 87, baseType: !457, size: 32, align: 32, offset: 3296)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !468, file: !469, line: 91, baseType: !635, size: 64, align: 64, offset: 3328)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !468, file: !469, line: 92, baseType: !755, size: 128, align: 64, offset: 3392)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !468, file: !469, line: 93, baseType: !755, size: 128, align: 64, offset: 3520)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !468, file: !469, line: 95, baseType: !457, size: 32, align: 32, offset: 3648)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !468, file: !469, line: 96, baseType: !457, size: 32, align: 32, offset: 3680)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !468, file: !469, line: 97, baseType: !457, size: 32, align: 32, offset: 3712)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !468, file: !469, line: 100, baseType: !635, size: 64, align: 64, offset: 3776)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !468, file: !469, line: 103, baseType: !635, size: 64, align: 64, offset: 3840)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !468, file: !469, line: 106, baseType: !635, size: 64, align: 64, offset: 3904)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !468, file: !469, line: 108, baseType: !460, size: 64, align: 64, offset: 3968)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !468, file: !469, line: 109, baseType: !635, size: 64, align: 64, offset: 4032)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !468, file: !469, line: 111, baseType: !635, size: 64, align: 64, offset: 4096)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !468, file: !469, line: 114, baseType: !442, size: 64, align: 64, offset: 4160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !468, file: !469, line: 116, baseType: !460, size: 64, align: 64, offset: 4224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !468, file: !469, line: 117, baseType: !1034, size: 32768, align: 64, offset: 4288)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 32768, align: 64, elements: !1044)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !1036, line: 10, size: 128, align: 64, elements: !1037)
!1036 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!1037 = !{!1038, !1043}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1035, file: !1036, line: 11, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !1036, line: 7, baseType: !1041)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !449, !447, !446, !446, !485, !674}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1035, file: !1036, line: 12, baseType: !446, size: 8, align: 8, offset: 64)
!1044 = !{!1045}
!1045 = !DISubrange(count: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !468, file: !469, line: 118, baseType: !1047, size: 2048, align: 8, offset: 37056)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 2048, align: 8, elements: !1044)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !468, file: !469, line: 120, baseType: !970, size: 64, align: 64, offset: 39104)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !452, file: !456, line: 9, baseType: !485, size: 64, align: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !456, line: 10, baseType: !485, size: 64, align: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !452, file: !456, line: 11, baseType: !719, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !452, file: !456, line: 12, baseType: !457, size: 32, align: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !452, file: !456, line: 13, baseType: !485, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !452, file: !456, line: 15, baseType: !890, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !452, file: !456, line: 17, baseType: !910, size: 64, align: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !452, file: !915, line: 5, baseType: !485, size: 64, align: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !452, file: !915, line: 6, baseType: !485, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !452, file: !915, line: 7, baseType: !719, size: 64, align: 64, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !452, file: !915, line: 9, baseType: !460, size: 64, align: 64, offset: 896)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !452, file: !915, line: 10, baseType: !920, size: 64, align: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !452, file: !915, line: 12, baseType: !545, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !452, file: !915, line: 13, baseType: !485, size: 64, align: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !452, file: !915, line: 14, baseType: !457, size: 32, align: 32, offset: 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !452, file: !915, line: 15, baseType: !485, size: 64, align: 64, offset: 1216)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !452, file: !915, line: 17, baseType: !545, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !452, file: !915, line: 18, baseType: !545, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !452, file: !915, line: 19, baseType: !545, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !452, file: !915, line: 20, baseType: !545, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !452, file: !915, line: 22, baseType: !545, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !452, file: !915, line: 23, baseType: !545, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !452, file: !915, line: 24, baseType: !545, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !452, file: !915, line: 25, baseType: !545, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !452, file: !915, line: 26, baseType: !545, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !452, file: !915, line: 31, baseType: !959, size: 64, align: 64, offset: 1344)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !452, file: !453, line: 18, baseType: !635, size: 64, align: 64, offset: 1408)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !452, file: !453, line: 20, baseType: !719, size: 64, align: 64, offset: 1472)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !452, file: !453, line: 21, baseType: !457, size: 32, align: 32, offset: 1536)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !452, file: !453, line: 22, baseType: !457, size: 32, align: 32, offset: 1568)
!1079 = !{!1080, !1082}
!1080 = distinct !DIGlobalVariable(name: "last_away_nick", scope: !0, file: !1081, line: 42, type: !485, isLocal: true, isDefinition: true, variable: i8** @last_away_nick)
!1081 = !DIFile(filename: "fe-events-numeric.c", directory: "/home/lichi/Desktop/irssi/task1")
!1082 = distinct !DIGlobalVariable(name: "last_away_msg", scope: !0, file: !1081, line: 43, type: !485, isLocal: true, isDefinition: true, variable: i8** @last_away_msg)
!1083 = !{i32 2, !"Dwarf Version", i32 4}
!1084 = !{i32 2, !"Debug Info Version", i32 3}
!1085 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!1086 = distinct !DISubprogram(name: "fe_events_numeric_init", scope: !1081, file: !1081, line: 645, type: !623, isLocal: false, isDefinition: true, scopeLine: 646, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1087)
!1087 = !{}
!1088 = !DILocation(line: 647, column: 17, scope: !1086)
!1089 = !DILocation(line: 648, column: 16, scope: !1086)
!1090 = !DILocation(line: 650, column: 2, scope: !1086)
!1091 = !DILocation(line: 651, column: 2, scope: !1086)
!1092 = !DILocation(line: 652, column: 2, scope: !1086)
!1093 = !DILocation(line: 653, column: 2, scope: !1086)
!1094 = !DILocation(line: 654, column: 2, scope: !1086)
!1095 = !DILocation(line: 655, column: 2, scope: !1086)
!1096 = !DILocation(line: 656, column: 2, scope: !1086)
!1097 = !DILocation(line: 657, column: 2, scope: !1086)
!1098 = !DILocation(line: 658, column: 2, scope: !1086)
!1099 = !DILocation(line: 659, column: 2, scope: !1086)
!1100 = !DILocation(line: 660, column: 2, scope: !1086)
!1101 = !DILocation(line: 661, column: 2, scope: !1086)
!1102 = !DILocation(line: 662, column: 2, scope: !1086)
!1103 = !DILocation(line: 663, column: 2, scope: !1086)
!1104 = !DILocation(line: 664, column: 2, scope: !1086)
!1105 = !DILocation(line: 665, column: 2, scope: !1086)
!1106 = !DILocation(line: 666, column: 2, scope: !1086)
!1107 = !DILocation(line: 667, column: 2, scope: !1086)
!1108 = !DILocation(line: 668, column: 2, scope: !1086)
!1109 = !DILocation(line: 669, column: 2, scope: !1086)
!1110 = !DILocation(line: 670, column: 2, scope: !1086)
!1111 = !DILocation(line: 671, column: 2, scope: !1086)
!1112 = !DILocation(line: 672, column: 2, scope: !1086)
!1113 = !DILocation(line: 674, column: 2, scope: !1086)
!1114 = !DILocation(line: 675, column: 2, scope: !1086)
!1115 = !DILocation(line: 676, column: 2, scope: !1086)
!1116 = !DILocation(line: 677, column: 2, scope: !1086)
!1117 = !DILocation(line: 678, column: 2, scope: !1086)
!1118 = !DILocation(line: 679, column: 2, scope: !1086)
!1119 = !DILocation(line: 680, column: 2, scope: !1086)
!1120 = !DILocation(line: 681, column: 2, scope: !1086)
!1121 = !DILocation(line: 682, column: 2, scope: !1086)
!1122 = !DILocation(line: 683, column: 2, scope: !1086)
!1123 = !DILocation(line: 684, column: 2, scope: !1086)
!1124 = !DILocation(line: 685, column: 2, scope: !1086)
!1125 = !DILocation(line: 686, column: 2, scope: !1086)
!1126 = !DILocation(line: 687, column: 2, scope: !1086)
!1127 = !DILocation(line: 688, column: 2, scope: !1086)
!1128 = !DILocation(line: 689, column: 2, scope: !1086)
!1129 = !DILocation(line: 690, column: 2, scope: !1086)
!1130 = !DILocation(line: 691, column: 2, scope: !1086)
!1131 = !DILocation(line: 693, column: 9, scope: !1086)
!1132 = !DILocation(line: 698, column: 2, scope: !1086)
!1133 = !DILocation(line: 699, column: 2, scope: !1086)
!1134 = !DILocation(line: 700, column: 2, scope: !1086)
!1135 = !DILocation(line: 701, column: 2, scope: !1086)
!1136 = !DILocation(line: 702, column: 2, scope: !1086)
!1137 = !DILocation(line: 703, column: 2, scope: !1086)
!1138 = !DILocation(line: 704, column: 2, scope: !1086)
!1139 = !DILocation(line: 705, column: 2, scope: !1086)
!1140 = !DILocation(line: 706, column: 2, scope: !1086)
!1141 = !DILocation(line: 707, column: 2, scope: !1086)
!1142 = !DILocation(line: 708, column: 2, scope: !1086)
!1143 = !DILocation(line: 709, column: 2, scope: !1086)
!1144 = !DILocation(line: 710, column: 2, scope: !1086)
!1145 = !DILocation(line: 711, column: 2, scope: !1086)
!1146 = !DILocation(line: 712, column: 2, scope: !1086)
!1147 = !DILocation(line: 714, column: 2, scope: !1086)
!1148 = !DILocation(line: 715, column: 2, scope: !1086)
!1149 = !DILocation(line: 716, column: 2, scope: !1086)
!1150 = !DILocation(line: 717, column: 2, scope: !1086)
!1151 = !DILocation(line: 718, column: 2, scope: !1086)
!1152 = !DILocation(line: 719, column: 2, scope: !1086)
!1153 = !DILocation(line: 720, column: 2, scope: !1086)
!1154 = !DILocation(line: 721, column: 2, scope: !1086)
!1155 = !DILocation(line: 722, column: 2, scope: !1086)
!1156 = !DILocation(line: 723, column: 2, scope: !1086)
!1157 = !DILocation(line: 724, column: 2, scope: !1086)
!1158 = !DILocation(line: 725, column: 2, scope: !1086)
!1159 = !DILocation(line: 726, column: 2, scope: !1086)
!1160 = !DILocation(line: 727, column: 2, scope: !1086)
!1161 = !DILocation(line: 728, column: 2, scope: !1086)
!1162 = !DILocation(line: 729, column: 2, scope: !1086)
!1163 = !DILocation(line: 730, column: 2, scope: !1086)
!1164 = !DILocation(line: 731, column: 2, scope: !1086)
!1165 = !DILocation(line: 732, column: 2, scope: !1086)
!1166 = !DILocation(line: 733, column: 2, scope: !1086)
!1167 = !DILocation(line: 734, column: 2, scope: !1086)
!1168 = !DILocation(line: 735, column: 2, scope: !1086)
!1169 = !DILocation(line: 736, column: 1, scope: !1086)
!1170 = distinct !DISubprogram(name: "event_user_mode", scope: !1081, file: !1081, line: 45, type: !1171, isLocal: true, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1087)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !466, !447}
!1173 = !DILocalVariable(name: "server", arg: 1, scope: !1170, file: !1081, line: 45, type: !466)
!1174 = !DIExpression()
!1175 = !DILocation(line: 45, column: 45, scope: !1170)
!1176 = !DILocalVariable(name: "data", arg: 2, scope: !1170, file: !1081, line: 45, type: !447)
!1177 = !DILocation(line: 45, column: 65, scope: !1170)
!1178 = !DILocalVariable(name: "params", scope: !1170, file: !1081, line: 47, type: !485)
!1179 = !DILocation(line: 47, column: 8, scope: !1170)
!1180 = !DILocalVariable(name: "mode", scope: !1170, file: !1081, line: 47, type: !485)
!1181 = !DILocation(line: 47, column: 17, scope: !1170)
!1182 = !DILocation(line: 49, column: 2, scope: !1170)
!1183 = distinct !{!1183, !1182}
!1184 = !DILocation(line: 49, column: 10, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1186, file: !1081, discriminator: 1)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !1081, line: 49, column: 10)
!1187 = distinct !DILexicalBlock(scope: !1170, file: !1081, line: 49, column: 4)
!1188 = !DILocation(line: 49, column: 15, scope: !1185)
!1189 = !DILocation(line: 49, column: 5, scope: !1190)
!1190 = !DILexicalBlockFile(scope: !1191, file: !1081, discriminator: 2)
!1191 = distinct !DILexicalBlock(scope: !1186, file: !1081, line: 49, column: 3)
!1192 = !DILocation(line: 49, column: 14, scope: !1193)
!1193 = !DILexicalBlockFile(scope: !1194, file: !1081, discriminator: 3)
!1194 = distinct !DILexicalBlock(scope: !1186, file: !1081, line: 49, column: 12)
!1195 = !DILocation(line: 49, column: 99, scope: !1193)
!1196 = !DILocation(line: 49, column: 110, scope: !1197)
!1197 = !DILexicalBlockFile(scope: !1187, file: !1081, discriminator: 4)
!1198 = !DILocation(line: 50, column: 2, scope: !1170)
!1199 = distinct !{!1199, !1198}
!1200 = !DILocation(line: 50, column: 10, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1202, file: !1081, discriminator: 1)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !1081, line: 50, column: 10)
!1203 = distinct !DILexicalBlock(scope: !1170, file: !1081, line: 50, column: 4)
!1204 = !DILocation(line: 50, column: 17, scope: !1201)
!1205 = !DILocation(line: 50, column: 5, scope: !1206)
!1206 = !DILexicalBlockFile(scope: !1207, file: !1081, discriminator: 2)
!1207 = distinct !DILexicalBlock(scope: !1202, file: !1081, line: 50, column: 3)
!1208 = !DILocation(line: 50, column: 14, scope: !1209)
!1209 = !DILexicalBlockFile(scope: !1210, file: !1081, discriminator: 3)
!1210 = distinct !DILexicalBlock(scope: !1202, file: !1081, line: 50, column: 12)
!1211 = !DILocation(line: 50, column: 101, scope: !1209)
!1212 = !DILocation(line: 50, column: 112, scope: !1213)
!1213 = !DILexicalBlockFile(scope: !1203, file: !1081, discriminator: 4)
!1214 = !DILocation(line: 52, column: 28, scope: !1170)
!1215 = !DILocation(line: 52, column: 11, scope: !1170)
!1216 = !DILocation(line: 52, column: 9, scope: !1170)
!1217 = !DILocation(line: 53, column: 45, scope: !1170)
!1218 = !DILocation(line: 53, column: 54, scope: !1170)
!1219 = !DILocation(line: 53, column: 43, scope: !1170)
!1220 = !DILocation(line: 53, column: 9, scope: !1221)
!1221 = !DILexicalBlockFile(scope: !1170, file: !1081, discriminator: 1)
!1222 = !DILocation(line: 55, column: 9, scope: !1170)
!1223 = !DILocation(line: 55, column: 2, scope: !1170)
!1224 = !DILocation(line: 56, column: 1, scope: !1170)
!1225 = !DILocation(line: 56, column: 1, scope: !1221)
!1226 = distinct !DISubprogram(name: "event_ison", scope: !1081, file: !1081, line: 58, type: !1171, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1087)
!1227 = !DILocalVariable(name: "server", arg: 1, scope: !1226, file: !1081, line: 58, type: !466)
!1228 = !DILocation(line: 58, column: 40, scope: !1226)
!1229 = !DILocalVariable(name: "data", arg: 2, scope: !1226, file: !1081, line: 58, type: !447)
!1230 = !DILocation(line: 58, column: 60, scope: !1226)
!1231 = !DILocalVariable(name: "params", scope: !1226, file: !1081, line: 60, type: !485)
!1232 = !DILocation(line: 60, column: 8, scope: !1226)
!1233 = !DILocalVariable(name: "online", scope: !1226, file: !1081, line: 60, type: !485)
!1234 = !DILocation(line: 60, column: 17, scope: !1226)
!1235 = !DILocation(line: 62, column: 2, scope: !1226)
!1236 = distinct !{!1236, !1235}
!1237 = !DILocation(line: 62, column: 10, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1239, file: !1081, discriminator: 1)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !1081, line: 62, column: 10)
!1240 = distinct !DILexicalBlock(scope: !1226, file: !1081, line: 62, column: 4)
!1241 = !DILocation(line: 62, column: 15, scope: !1238)
!1242 = !DILocation(line: 62, column: 5, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1244, file: !1081, discriminator: 2)
!1244 = distinct !DILexicalBlock(scope: !1239, file: !1081, line: 62, column: 3)
!1245 = !DILocation(line: 62, column: 14, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1247, file: !1081, discriminator: 3)
!1247 = distinct !DILexicalBlock(scope: !1239, file: !1081, line: 62, column: 12)
!1248 = !DILocation(line: 62, column: 99, scope: !1246)
!1249 = !DILocation(line: 62, column: 110, scope: !1250)
!1250 = !DILexicalBlockFile(scope: !1240, file: !1081, discriminator: 4)
!1251 = !DILocation(line: 63, column: 2, scope: !1226)
!1252 = distinct !{!1252, !1251}
!1253 = !DILocation(line: 63, column: 10, scope: !1254)
!1254 = !DILexicalBlockFile(scope: !1255, file: !1081, discriminator: 1)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !1081, line: 63, column: 10)
!1256 = distinct !DILexicalBlock(scope: !1226, file: !1081, line: 63, column: 4)
!1257 = !DILocation(line: 63, column: 17, scope: !1254)
!1258 = !DILocation(line: 63, column: 5, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1260, file: !1081, discriminator: 2)
!1260 = distinct !DILexicalBlock(scope: !1255, file: !1081, line: 63, column: 3)
!1261 = !DILocation(line: 63, column: 14, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1263, file: !1081, discriminator: 3)
!1263 = distinct !DILexicalBlock(scope: !1255, file: !1081, line: 63, column: 12)
!1264 = !DILocation(line: 63, column: 101, scope: !1262)
!1265 = !DILocation(line: 63, column: 112, scope: !1266)
!1266 = !DILexicalBlockFile(scope: !1256, file: !1081, discriminator: 4)
!1267 = !DILocation(line: 65, column: 28, scope: !1226)
!1268 = !DILocation(line: 65, column: 11, scope: !1226)
!1269 = !DILocation(line: 65, column: 9, scope: !1226)
!1270 = !DILocation(line: 66, column: 38, scope: !1226)
!1271 = !DILocation(line: 66, column: 33, scope: !1226)
!1272 = !DILocation(line: 66, column: 2, scope: !1226)
!1273 = !DILocation(line: 67, column: 9, scope: !1226)
!1274 = !DILocation(line: 67, column: 2, scope: !1226)
!1275 = !DILocation(line: 68, column: 1, scope: !1226)
!1276 = !DILocation(line: 68, column: 1, scope: !1277)
!1277 = !DILexicalBlockFile(scope: !1226, file: !1081, discriminator: 1)
!1278 = distinct !DISubprogram(name: "event_names_list", scope: !1081, file: !1081, line: 70, type: !1171, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1087)
!1279 = !DILocalVariable(name: "server", arg: 1, scope: !1278, file: !1081, line: 70, type: !466)
!1280 = !DILocation(line: 70, column: 46, scope: !1278)
!1281 = !DILocalVariable(name: "data", arg: 2, scope: !1278, file: !1081, line: 70, type: !447)
!1282 = !DILocation(line: 70, column: 66, scope: !1278)
!1283 = !DILocalVariable(name: "chanrec", scope: !1278, file: !1081, line: 72, type: !449)
!1284 = !DILocation(line: 72, column: 19, scope: !1278)
!1285 = !DILocalVariable(name: "params", scope: !1278, file: !1081, line: 73, type: !485)
!1286 = !DILocation(line: 73, column: 8, scope: !1278)
