; ModuleID = './line360-mainwindows-layout.o.i'
source_filename = "./line360-mainwindows-layout.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50)
!1 = !DIFile(filename: "line360-mainwindows-layout.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !34, !42}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 10, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!6 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!7 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!8 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!9 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!10 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!11 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!12 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!13 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!14 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!15 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!16 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!17 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!18 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!19 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!20 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!21 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!22 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!23 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!24 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!25 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!26 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!27 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!28 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!29 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!30 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!31 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!32 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!33 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 4, size: 32, align: 32, elements: !36)
!35 = !DIFile(filename: "../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!38 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!39 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!40 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!41 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 14, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_NONE", value: -1)
!46 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_DEFAULT", value: 0)
!47 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_HIDDEN", value: 1)
!48 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_SPLIT", value: 2)
!49 = !DIEnumerator(name: "MAIN_WINDOW_TYPE_RSPLIT", value: 3)
!50 = !{!51, !58, !59, !277, !281, !90, !282, !283}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !52, line: 9, baseType: !53)
!52 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56, !56, !56, !56, !56, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !61, line: 24, baseType: !62)
!61 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !61, line: 13, size: 320, align: 64, elements: !63)
!63 = !{!64, !189, !271, !272, !273, !274, !275, !276}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !62, file: !61, line: 14, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !67, line: 34, baseType: !68)
!67 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 16, size: 704, align: 64, elements: !69)
!69 = !{!70, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !68, file: !67, line: 17, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !73, line: 117, baseType: !74)
!73 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !43, line: 28, size: 1280, align: 64, elements: !75)
!75 = !{!76, !78, !81, !82, !83, !93, !132, !133, !134, !135, !136, !137, !139, !140, !141, !160, !161, !162, !163, !164, !165, !166, !167}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !74, file: !43, line: 29, baseType: !77, size: 32, align: 32)
!77 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !43, line: 30, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !74, file: !43, line: 32, baseType: !77, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !74, file: !43, line: 32, baseType: !77, size: 32, align: 32, offset: 160)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !74, file: !43, line: 34, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !86, line: 37, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !86, line: 39, size: 128, align: 64, elements: !88)
!88 = !{!89, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !86, line: 41, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !91, line: 77, baseType: !58)
!91 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 42, baseType: !84, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !74, file: !43, line: 35, baseType: !94, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !73, line: 108, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !97, line: 5, size: 704, align: 64, elements: !98)
!97 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = !{!99, !101, !102, !107, !108, !112, !113, !114, !120, !121, !122, !126}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !100, line: 3, baseType: !77, size: 32, align: 32)
!100 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !96, file: !100, line: 4, baseType: !77, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !96, file: !100, line: 5, baseType: !103, size: 64, align: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !105, line: 37, baseType: !106)
!105 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !105, line: 37, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !96, file: !100, line: 7, baseType: !58, size: 64, align: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !96, file: !100, line: 8, baseType: !109, size: 64, align: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !73, line: 107, baseType: !111)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !73, line: 107, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !96, file: !100, line: 9, baseType: !79, size: 64, align: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !100, line: 10, baseType: !79, size: 64, align: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !96, file: !100, line: 11, baseType: !115, size: 64, align: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !116, line: 75, baseType: !117)
!116 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !118, line: 139, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!119 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !96, file: !100, line: 12, baseType: !77, size: 32, align: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !96, file: !100, line: 13, baseType: !79, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !96, file: !100, line: 15, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !94}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !96, file: !100, line: 17, baseType: !127, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !94}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !74, file: !43, line: 36, baseType: !109, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !74, file: !43, line: 37, baseType: !109, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !74, file: !43, line: 38, baseType: !79, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !74, file: !43, line: 40, baseType: !77, size: 32, align: 32, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !74, file: !43, line: 41, baseType: !84, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !74, file: !43, line: 43, baseType: !138, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !74, file: !43, line: 44, baseType: !138, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !74, file: !43, line: 45, baseType: !138, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !74, file: !43, line: 48, baseType: !142, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !144, line: 14, baseType: !145)
!144 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 6, size: 256, align: 64, elements: !146)
!146 = !{!147, !148, !157, !158, !159}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !144, line: 7, baseType: !79, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !145, file: !144, line: 9, baseType: !149, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !151, line: 37, baseType: !152)
!151 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !151, line: 39, size: 192, align: 64, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !151, line: 41, baseType: !90, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !151, line: 42, baseType: !149, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !151, line: 43, baseType: !149, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !145, file: !144, line: 10, baseType: !77, size: 32, align: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !145, file: !144, line: 12, baseType: !77, size: 32, align: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !145, file: !144, line: 13, baseType: !77, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !74, file: !43, line: 49, baseType: !79, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !74, file: !43, line: 51, baseType: !77, size: 32, align: 32, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !74, file: !43, line: 52, baseType: !79, size: 64, align: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !74, file: !43, line: 54, baseType: !115, size: 64, align: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !74, file: !43, line: 55, baseType: !115, size: 64, align: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !74, file: !43, line: 57, baseType: !79, size: 64, align: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !74, file: !43, line: 58, baseType: !58, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !74, file: !43, line: 60, baseType: !58, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !68, file: !67, line: 19, baseType: !169, size: 64, align: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !171, line: 4, baseType: !172)
!171 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !171, line: 4, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !68, file: !67, line: 20, baseType: !77, size: 32, align: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !68, file: !67, line: 22, baseType: !77, size: 32, align: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !68, file: !67, line: 22, baseType: !77, size: 32, align: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !68, file: !67, line: 23, baseType: !77, size: 32, align: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !68, file: !67, line: 23, baseType: !77, size: 32, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !68, file: !67, line: 24, baseType: !77, size: 32, align: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !68, file: !67, line: 24, baseType: !77, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !68, file: !67, line: 26, baseType: !84, size: 64, align: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !68, file: !67, line: 27, baseType: !77, size: 32, align: 32, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !68, file: !67, line: 27, baseType: !77, size: 32, align: 32, offset: 480)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !68, file: !67, line: 28, baseType: !77, size: 32, align: 32, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !68, file: !67, line: 29, baseType: !77, size: 32, align: 32, offset: 544)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !68, file: !67, line: 29, baseType: !77, size: 32, align: 32, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !68, file: !67, line: 30, baseType: !77, size: 32, align: 32, offset: 608)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !68, file: !67, line: 32, baseType: !138, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !68, file: !67, line: 33, baseType: !138, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !62, file: !61, line: 15, baseType: !190, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !192, line: 7, baseType: !193)
!192 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !192, line: 50, size: 960, align: 64, elements: !194)
!194 = !{!195, !236, !237, !238, !239, !240, !241, !246, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !193, file: !192, line: 51, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !198, line: 72, baseType: !199)
!198 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 60, size: 448, align: 64, elements: !200)
!200 = !{!201, !202, !219, !220, !221, !232, !233, !234, !235}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !199, file: !198, line: 61, baseType: !84, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !199, file: !198, line: 62, baseType: !203, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !198, line: 52, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !198, line: 34, size: 320, align: 64, elements: !206)
!206 = !{!207, !209, !210, !213}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !198, line: 48, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !198, line: 48, baseType: !208, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !205, file: !198, line: 50, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !205, file: !198, line: 51, baseType: !214, size: 128, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !198, line: 32, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 29, size: 128, align: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !215, file: !198, line: 30, baseType: !77, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !215, file: !198, line: 31, baseType: !115, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !199, file: !198, line: 63, baseType: !77, size: 32, align: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !199, file: !198, line: 65, baseType: !203, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !199, file: !198, line: 66, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !198, line: 58, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 54, size: 131008, align: 32, elements: !225)
!225 = !{!226, !230, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !224, file: !198, line: 55, baseType: !227, size: 130944, align: 8)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 130944, align: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 16368)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !224, file: !198, line: 56, baseType: !77, size: 32, align: 32, offset: 130944)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !224, file: !198, line: 57, baseType: !77, size: 32, align: 32, offset: 130976)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !199, file: !198, line: 68, baseType: !77, size: 32, align: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !199, file: !198, line: 69, baseType: !77, size: 32, align: 32, offset: 352)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !199, file: !198, line: 70, baseType: !77, size: 32, align: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !199, file: !198, line: 71, baseType: !138, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !193, file: !192, line: 53, baseType: !84, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !193, file: !192, line: 55, baseType: !169, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !193, file: !192, line: 56, baseType: !77, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !193, file: !192, line: 56, baseType: !77, size: 32, align: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !193, file: !192, line: 58, baseType: !77, size: 32, align: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !193, file: !192, line: 59, baseType: !242, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !192, line: 10, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!77, !190, !203, !77}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !193, file: !192, line: 61, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !192, line: 48, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 37, size: 192, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !249, file: !192, line: 38, baseType: !77, size: 32, align: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !249, file: !192, line: 39, baseType: !77, size: 32, align: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !249, file: !192, line: 41, baseType: !103, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !249, file: !192, line: 45, baseType: !212, size: 8, align: 8, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !249, file: !192, line: 47, baseType: !77, size: 32, align: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !193, file: !192, line: 63, baseType: !77, size: 32, align: 32, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !193, file: !192, line: 66, baseType: !203, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !193, file: !192, line: 68, baseType: !77, size: 32, align: 32, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !193, file: !192, line: 71, baseType: !203, size: 64, align: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !193, file: !192, line: 72, baseType: !77, size: 32, align: 32, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !193, file: !192, line: 76, baseType: !103, size: 64, align: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !193, file: !192, line: 79, baseType: !77, size: 32, align: 32, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !193, file: !192, line: 82, baseType: !77, size: 32, align: 32, offset: 864)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !193, file: !192, line: 84, baseType: !138, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !193, file: !192, line: 86, baseType: !138, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !193, file: !192, line: 88, baseType: !138, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !193, file: !192, line: 90, baseType: !138, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !193, file: !192, line: 92, baseType: !138, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !193, file: !192, line: 94, baseType: !138, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !193, file: !192, line: 96, baseType: !138, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !62, file: !61, line: 17, baseType: !138, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !62, file: !61, line: 18, baseType: !138, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !62, file: !61, line: 20, baseType: !138, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !62, file: !61, line: 21, baseType: !138, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !62, file: !61, line: 22, baseType: !203, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !62, file: !61, line: 23, baseType: !115, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !91, line: 88, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !90, !90}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !91, line: 48, baseType: !119)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !91, line: 80, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !288, !288}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !91, line: 49, baseType: !77)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !91, line: 78, baseType: !56)
!289 = !{i32 2, !"Dwarf Version", i32 4}
!290 = !{i32 2, !"Debug Info Version", i32 3}
!291 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!292 = distinct !DISubprogram(name: "mainwindows_layout_init", scope: !293, file: !293, line: 311, type: !294, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!293 = !DIFile(filename: "mainwindows-layout.c", directory: "/home/lichi/Desktop/irssi/task1")
!294 = !DISubroutineType(types: !295)
!295 = !{null}
!296 = !{}
!297 = !DILocation(line: 313, column: 2, scope: !292)
!298 = !DILocation(line: 314, column: 2, scope: !292)
!299 = !DILocation(line: 315, column: 2, scope: !292)
!300 = !DILocation(line: 316, column: 2, scope: !292)
!301 = !DILocation(line: 317, column: 2, scope: !292)
!302 = !DILocation(line: 318, column: 1, scope: !292)
!303 = distinct !DISubprogram(name: "sig_layout_window_save", scope: !293, file: !293, line: 32, type: !304, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !296)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !71, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !35, line: 17, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !35, line: 20, size: 192, align: 64, elements: !309)
!309 = !{!310, !311, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !35, line: 21, baseType: !77, size: 32, align: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !308, file: !35, line: 22, baseType: !79, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !35, line: 23, baseType: !58, size: 64, align: 64, offset: 128)
!313 = !DILocalVariable(name: "window", arg: 1, scope: !303, file: !293, line: 32, type: !71)
!314 = !DIExpression()
!315 = !DILocation(line: 32, column: 48, scope: !303)
!316 = !DILocalVariable(name: "node", arg: 2, scope: !303, file: !293, line: 32, type: !306)
!317 = !DILocation(line: 32, column: 69, scope: !303)
!318 = !DILocalVariable(name: "active", scope: !303, file: !293, line: 34, type: !71)
!319 = !DILocation(line: 34, column: 14, scope: !303)
!320 = !DILocalVariable(name: "gui", scope: !303, file: !293, line: 35, type: !59)
!321 = !DILocation(line: 35, column: 25, scope: !303)
!322 = !DILocation(line: 37, column: 37, scope: !303)
!323 = !DILocation(line: 37, column: 46, scope: !303)
!324 = !DILocation(line: 37, column: 16, scope: !303)
!325 = !DILocation(line: 37, column: 13, scope: !303)
!326 = !DILocation(line: 38, column: 6, scope: !327)
!327 = distinct !DILexicalBlock(scope: !303, file: !293, line: 38, column: 6)
!328 = !DILocation(line: 38, column: 11, scope: !327)
!329 = !DILocation(line: 38, column: 6, scope: !303)
!330 = !DILocation(line: 39, column: 24, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !293, line: 38, column: 19)
!332 = !DILocation(line: 39, column: 36, scope: !331)
!333 = !DILocation(line: 39, column: 3, scope: !331)
!334 = !DILocation(line: 40, column: 12, scope: !331)
!335 = !DILocation(line: 40, column: 17, scope: !331)
!336 = !DILocation(line: 40, column: 25, scope: !331)
!337 = !DILocation(line: 40, column: 10, scope: !331)
!338 = !DILocation(line: 41, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !331, file: !293, line: 41, column: 7)
!340 = !DILocation(line: 41, column: 17, scope: !339)
!341 = !DILocation(line: 41, column: 14, scope: !339)
!342 = !DILocation(line: 41, column: 7, scope: !331)
!343 = !DILocation(line: 42, column: 24, scope: !339)
!344 = !DILocation(line: 42, column: 36, scope: !339)
!345 = !DILocation(line: 42, column: 52, scope: !339)
!346 = !DILocation(line: 42, column: 60, scope: !339)
!347 = !DILocation(line: 42, column: 4, scope: !339)
!348 = !DILocation(line: 43, column: 2, scope: !331)
!349 = !DILocation(line: 45, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !303, file: !293, line: 45, column: 6)
!351 = !DILocation(line: 45, column: 11, scope: !350)
!352 = !DILocation(line: 45, column: 17, scope: !350)
!353 = !DILocation(line: 45, column: 30, scope: !350)
!354 = !DILocation(line: 45, column: 6, scope: !303)
!355 = !DILocalVariable(name: "level", scope: !356, file: !293, line: 46, type: !79)
!356 = distinct !DILexicalBlock(scope: !350, file: !293, line: 45, column: 50)
!357 = !DILocation(line: 46, column: 9, scope: !356)
!358 = !DILocation(line: 46, column: 28, scope: !356)
!359 = !DILocation(line: 46, column: 33, scope: !356)
!360 = !DILocation(line: 46, column: 39, scope: !356)
!361 = !DILocation(line: 46, column: 17, scope: !356)
!362 = !DILocation(line: 47, column: 23, scope: !356)
!363 = !DILocation(line: 47, column: 35, scope: !356)
!364 = !DILocation(line: 47, column: 54, scope: !356)
!365 = !DILocation(line: 47, column: 3, scope: !356)
!366 = !DILocation(line: 48, column: 10, scope: !356)
!367 = !DILocation(line: 48, column: 3, scope: !356)
!368 = !DILocation(line: 49, column: 2, scope: !356)
!369 = !DILocation(line: 51, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !303, file: !293, line: 51, column: 6)
!371 = !DILocation(line: 51, column: 11, scope: !370)
!372 = !DILocation(line: 51, column: 6, scope: !303)
!373 = !DILocation(line: 52, column: 38, scope: !370)
!374 = !DILocation(line: 52, column: 50, scope: !370)
!375 = !DILocation(line: 52, column: 66, scope: !370)
!376 = !DILocation(line: 52, column: 71, scope: !370)
!377 = !DILocation(line: 52, column: 17, scope: !370)
!378 = !DILocation(line: 53, column: 1, scope: !303)
