; ModuleID = './line356-mainwindows.o.i'
source_filename = "./line356-mainwindows.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.MAIN_WINDOW_REC = type { %struct._WINDOW_REC*, %struct._TERM_WINDOW*, i32, i32, i32, i32, i32, i32, i32, %struct._GSList*, i32, i32, i32, i32, i32, i32, i8 }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type opaque
%struct.HISTORY_REC = type { i8*, %struct._GList*, i32, i32, i8 }
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._TERM_WINDOW = type opaque
%struct.MAIN_WINDOW_BORDER_REC = type { i8*, %struct._TERM_WINDOW* }
%struct.GUI_WINDOW_REC = type { %struct.MAIN_WINDOW_REC*, %struct._TEXT_BUFFER_VIEW_REC*, i8, %struct._LINE_REC*, i64 }

!62 = !DIEnumerator(name: "TXT_CANT_SHOW_STICKY_WINDOWS", value: 13)
!63 = !DIEnumerator(name: "TXT_WINDOW_NOT_STICKY", value: 14)
!64 = !DIEnumerator(name: "TXT_WINDOW_SET_STICKY", value: 15)
!65 = !DIEnumerator(name: "TXT_WINDOW_UNSET_STICKY", value: 16)
!66 = !DIEnumerator(name: "TXT_WINDOW_INFO_STICKY", value: 17)
!67 = !DIEnumerator(name: "TXT_WINDOW_INFO_SCROLL", value: 18)
!68 = !DIEnumerator(name: "TXT_WINDOW_SCROLL", value: 19)
!69 = !DIEnumerator(name: "TXT_WINDOW_SCROLL_UNKNOWN", value: 20)
!70 = !DIEnumerator(name: "TXT_WINDOW_HIDELEVEL", value: 21)
!71 = !DIEnumerator(name: "TXT_FILL_3", value: 22)
!72 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_HEADER", value: 23)
!73 = !DIEnumerator(name: "TXT_STATUSBAR_LIST_FOOTER", value: 24)
!74 = !DIEnumerator(name: "TXT_STATUSBAR_LIST", value: 25)
!75 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_NAME", value: 26)
!76 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_TYPE", value: 27)
!77 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_PLACEMENT", value: 28)
!78 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_POSITION", value: 29)
!79 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_VISIBLE", value: 30)
!80 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_HEADER", value: 31)
!81 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_FOOTER", value: 32)
!82 = !DIEnumerator(name: "TXT_STATUSBAR_INFO_ITEM_NAME", value: 33)
!83 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_FOUND", value: 34)
!84 = !DIEnumerator(name: "TXT_STATUSBAR_NOT_ENABLED", value: 35)
!85 = !DIEnumerator(name: "TXT_STATUSBAR_ITEM_NOT_FOUND", value: 36)
!86 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_COMMAND", value: 37)
!87 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_TYPE", value: 38)
!88 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_PLACEMENT", value: 39)
!89 = !DIEnumerator(name: "TXT_STATUSBAR_UNKNOWN_VISIBILITY", value: 40)
!90 = !DIEnumerator(name: "TXT_FILL_4", value: 41)
!91 = !DIEnumerator(name: "TXT_PASTE_WARNING", value: 42)
!92 = !DIEnumerator(name: "TXT_PASTE_PROMPT", value: 43)
!93 = !DIEnumerator(name: "TXT_FILL_5", value: 44)
!94 = !DIEnumerator(name: "TXT_IRSSI_BANNER", value: 45)
!95 = !DIEnumerator(name: "TXT_WELCOME_FIRSTTIME", value: 46)
!96 = !DIEnumerator(name: "TXT_WELCOME_INIT_SETTINGS", value: 47)
!97 = !DIEnumerator(name: "TXT_COUNT", value: 48)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 25, size: 32, align: 32, elements: !100)
!99 = !DIFile(filename: "../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!101 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!102 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!103 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!104 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!105 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!106 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!107 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!108 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!109 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!110 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!111 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!112 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!113 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!114 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!115 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!116 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!117 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!118 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!119 = !{!120, !121, !127, !340, !193, !342, !350, !356, !361, !153, !362, !140, !275}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !123, line: 24, baseType: !124)
!123 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 13, size: 320, align: 64, elements: !125)
!125 = !{!126, !252, !334, !335, !336, !337, !338, !339}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !124, file: !123, line: 14, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !129, line: 34, baseType: !130)
!129 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 16, size: 704, align: 64, elements: !131)
!131 = !{!132, !231, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !130, file: !129, line: 17, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !135, line: 117, baseType: !136)
!135 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !137, line: 28, size: 1280, align: 64, elements: !138)
!137 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!138 = !{!139, !141, !144, !145, !146, !156, !195, !196, !197, !198, !199, !200, !202, !203, !204, !223, !224, !225, !226, !227, !228, !229, !230}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !136, file: !137, line: 29, baseType: !140, size: 32, align: 32)
!140 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 30, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !136, file: !137, line: 32, baseType: !140, size: 32, align: 32, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !136, file: !137, line: 32, baseType: !140, size: 32, align: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !136, file: !137, line: 34, baseType: !147, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !149, line: 37, baseType: !150)
!149 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !149, line: 39, size: 128, align: 64, elements: !151)
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !149, line: 41, baseType: !153, size: 64, align: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !154, line: 77, baseType: !120)
!154 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !149, line: 42, baseType: !147, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !136, file: !137, line: 35, baseType: !157, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !135, line: 108, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !160, line: 5, size: 704, align: 64, elements: !161)
!160 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!161 = !{!162, !164, !165, !170, !171, !175, !176, !177, !183, !184, !185, !189}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !163, line: 3, baseType: !140, size: 32, align: 32)
!163 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !159, file: !163, line: 4, baseType: !140, size: 32, align: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !159, file: !163, line: 5, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !168, line: 37, baseType: !169)
!168 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !168, line: 37, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !159, file: !163, line: 7, baseType: !120, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !159, file: !163, line: 8, baseType: !172, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !135, line: 107, baseType: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !135, line: 107, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !159, file: !163, line: 9, baseType: !142, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !163, line: 10, baseType: !142, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !159, file: !163, line: 11, baseType: !178, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !179, line: 75, baseType: !180)
!179 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !181, line: 139, baseType: !182)
!181 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!182 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !159, file: !163, line: 12, baseType: !140, size: 32, align: 32, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !159, file: !163, line: 13, baseType: !142, size: 64, align: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !159, file: !163, line: 15, baseType: !186, size: 64, align: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !157}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !159, file: !163, line: 17, baseType: !190, size: 64, align: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !157}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !136, file: !137, line: 36, baseType: !172, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !136, file: !137, line: 37, baseType: !172, size: 64, align: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !136, file: !137, line: 38, baseType: !142, size: 64, align: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !136, file: !137, line: 40, baseType: !140, size: 32, align: 32, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !136, file: !137, line: 41, baseType: !147, size: 64, align: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !136, file: !137, line: 43, baseType: !201, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!201 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !136, file: !137, line: 44, baseType: !201, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !136, file: !137, line: 45, baseType: !201, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !136, file: !137, line: 48, baseType: !205, size: 64, align: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !207, line: 14, baseType: !208)
!207 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !207, line: 6, size: 256, align: 64, elements: !209)
!209 = !{!210, !211, !220, !221, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !207, line: 7, baseType: !142, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !208, file: !207, line: 9, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !214, line: 37, baseType: !215)
!214 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !214, line: 39, size: 192, align: 64, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !214, line: 41, baseType: !153, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !214, line: 42, baseType: !212, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !214, line: 43, baseType: !212, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !208, file: !207, line: 10, baseType: !140, size: 32, align: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !208, file: !207, line: 12, baseType: !140, size: 32, align: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !208, file: !207, line: 13, baseType: !140, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !136, file: !137, line: 49, baseType: !142, size: 64, align: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !136, file: !137, line: 51, baseType: !140, size: 32, align: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !136, file: !137, line: 52, baseType: !142, size: 64, align: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !136, file: !137, line: 54, baseType: !178, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !136, file: !137, line: 55, baseType: !178, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !136, file: !137, line: 57, baseType: !142, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !136, file: !137, line: 58, baseType: !120, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !136, file: !137, line: 60, baseType: !120, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !130, file: !129, line: 19, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !234, line: 4, baseType: !235)
!234 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !234, line: 4, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !130, file: !129, line: 20, baseType: !140, size: 32, align: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !130, file: !129, line: 22, baseType: !140, size: 32, align: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !130, file: !129, line: 22, baseType: !140, size: 32, align: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !130, file: !129, line: 23, baseType: !140, size: 32, align: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !130, file: !129, line: 23, baseType: !140, size: 32, align: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !130, file: !129, line: 24, baseType: !140, size: 32, align: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !130, file: !129, line: 24, baseType: !140, size: 32, align: 32, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !130, file: !129, line: 26, baseType: !147, size: 64, align: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !130, file: !129, line: 27, baseType: !140, size: 32, align: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !130, file: !129, line: 27, baseType: !140, size: 32, align: 32, offset: 480)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !130, file: !129, line: 28, baseType: !140, size: 32, align: 32, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !130, file: !129, line: 29, baseType: !140, size: 32, align: 32, offset: 544)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !130, file: !129, line: 29, baseType: !140, size: 32, align: 32, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !130, file: !129, line: 30, baseType: !140, size: 32, align: 32, offset: 608)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !130, file: !129, line: 32, baseType: !201, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !130, file: !129, line: 33, baseType: !201, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !124, file: !123, line: 15, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !255, line: 7, baseType: !256)
!255 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !255, line: 50, size: 960, align: 64, elements: !257)
!257 = !{!258, !299, !300, !301, !302, !303, !304, !309, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !256, file: !255, line: 51, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !261, line: 72, baseType: !262)
!261 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 60, size: 448, align: 64, elements: !263)
!263 = !{!264, !265, !282, !283, !284, !295, !296, !297, !298}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !262, file: !261, line: 61, baseType: !147, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !262, file: !261, line: 62, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !261, line: 52, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !261, line: 34, size: 320, align: 64, elements: !269)
!269 = !{!270, !272, !273, !276}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !261, line: 48, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !261, line: 48, baseType: !271, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !268, file: !261, line: 50, baseType: !274, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !268, file: !261, line: 51, baseType: !277, size: 128, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !261, line: 32, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 29, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !278, file: !261, line: 30, baseType: !140, size: 32, align: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !278, file: !261, line: 31, baseType: !178, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !262, file: !261, line: 63, baseType: !140, size: 32, align: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !262, file: !261, line: 65, baseType: !266, size: 64, align: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !262, file: !261, line: 66, baseType: !285, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !261, line: 58, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 54, size: 131008, align: 32, elements: !288)
!288 = !{!289, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !287, file: !261, line: 55, baseType: !290, size: 130944, align: 8)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 130944, align: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 16368)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !287, file: !261, line: 56, baseType: !140, size: 32, align: 32, offset: 130944)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !287, file: !261, line: 57, baseType: !140, size: 32, align: 32, offset: 130976)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !262, file: !261, line: 68, baseType: !140, size: 32, align: 32, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !262, file: !261, line: 69, baseType: !140, size: 32, align: 32, offset: 352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !262, file: !261, line: 70, baseType: !140, size: 32, align: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !262, file: !261, line: 71, baseType: !201, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !256, file: !255, line: 53, baseType: !147, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !256, file: !255, line: 55, baseType: !232, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !256, file: !255, line: 56, baseType: !140, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !256, file: !255, line: 56, baseType: !140, size: 32, align: 32, offset: 224)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !256, file: !255, line: 58, baseType: !140, size: 32, align: 32, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !256, file: !255, line: 59, baseType: !305, size: 64, align: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !255, line: 10, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!140, !253, !266, !140}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !256, file: !255, line: 61, baseType: !310, size: 64, align: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !255, line: 48, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 37, size: 192, align: 64, elements: !313)
!313 = !{!314, !315, !316, !317, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !312, file: !255, line: 38, baseType: !140, size: 32, align: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !312, file: !255, line: 39, baseType: !140, size: 32, align: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !312, file: !255, line: 41, baseType: !166, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !312, file: !255, line: 45, baseType: !275, size: 8, align: 8, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !312, file: !255, line: 47, baseType: !140, size: 32, align: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !256, file: !255, line: 63, baseType: !140, size: 32, align: 32, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !256, file: !255, line: 66, baseType: !266, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !256, file: !255, line: 68, baseType: !140, size: 32, align: 32, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !256, file: !255, line: 71, baseType: !266, size: 64, align: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !256, file: !255, line: 72, baseType: !140, size: 32, align: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !256, file: !255, line: 76, baseType: !166, size: 64, align: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !256, file: !255, line: 79, baseType: !140, size: 32, align: 32, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !256, file: !255, line: 82, baseType: !140, size: 32, align: 32, offset: 864)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !256, file: !255, line: 84, baseType: !201, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !256, file: !255, line: 86, baseType: !201, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !256, file: !255, line: 88, baseType: !201, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !256, file: !255, line: 90, baseType: !201, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !256, file: !255, line: 92, baseType: !201, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !256, file: !255, line: 94, baseType: !201, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !256, file: !255, line: 96, baseType: !201, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !124, file: !123, line: 17, baseType: !201, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !124, file: !123, line: 18, baseType: !201, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !124, file: !123, line: 20, baseType: !201, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !124, file: !123, line: 21, baseType: !201, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !124, file: !123, line: 22, baseType: !266, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !124, file: !123, line: 23, baseType: !178, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !154, line: 46, baseType: !143)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !154, line: 80, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !347, !347}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !154, line: 49, baseType: !140)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !154, line: 78, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_BORDER_REC", file: !129, line: 39, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 36, size: 128, align: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !352, file: !129, line: 37, baseType: !142, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !352, file: !129, line: 38, baseType: !232, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !357, line: 9, baseType: !358)
!357 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !348, !348, !348, !348, !348, !348}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !154, line: 48, baseType: !182)
!363 = !{!364, !366, !367, !368, !369, !370, !371, !372, !373}
!364 = distinct !DIGlobalVariable(name: "mainwindows", scope: !0, file: !365, line: 35, type: !147, isLocal: false, isDefinition: true, variable: %struct._GSList** @mainwindows)
!365 = !DIFile(filename: "mainwindows.c", directory: "/home/lichi/Desktop/irssi/task1")
!366 = distinct !DIGlobalVariable(name: "active_mainwin", scope: !0, file: !365, line: 36, type: !127, isLocal: false, isDefinition: true, variable: %struct.MAIN_WINDOW_REC** @active_mainwin)
!367 = distinct !DIGlobalVariable(name: "clrtoeol_info", scope: !0, file: !365, line: 37, type: !350, isLocal: false, isDefinition: true, variable: %struct.MAIN_WINDOW_BORDER_REC** @clrtoeol_info)
!368 = distinct !DIGlobalVariable(name: "screen_reserved_top", scope: !0, file: !365, line: 39, type: !140, isLocal: false, isDefinition: true, variable: i32* @screen_reserved_top)
!369 = distinct !DIGlobalVariable(name: "screen_reserved_bottom", scope: !0, file: !365, line: 39, type: !140, isLocal: false, isDefinition: true, variable: i32* @screen_reserved_bottom)
!370 = distinct !DIGlobalVariable(name: "screen_reserved_left", scope: !0, file: !365, line: 40, type: !140, isLocal: false, isDefinition: true, variable: i32* @screen_reserved_left)
!371 = distinct !DIGlobalVariable(name: "screen_reserved_right", scope: !0, file: !365, line: 40, type: !140, isLocal: false, isDefinition: true, variable: i32* @screen_reserved_right)
!372 = distinct !DIGlobalVariable(name: "screen_width", scope: !0, file: !365, line: 41, type: !140, isLocal: true, isDefinition: true, variable: i32* @screen_width)
!373 = distinct !DIGlobalVariable(name: "screen_height", scope: !0, file: !365, line: 41, type: !140, isLocal: true, isDefinition: true, variable: i32* @screen_height)
!374 = !{i32 2, !"Dwarf Version", i32 4}
!375 = !{i32 2, !"Debug Info Version", i32 3}
!376 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!377 = distinct !DISubprogram(name: "mainwindow_change_active", scope: !365, file: !365, line: 159, type: !378, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !127, !133}
!380 = !{}
!381 = !DILocalVariable(name: "mainwin", arg: 1, scope: !377, file: !365, line: 159, type: !127)
!382 = !DIExpression()
!383 = !DILocation(line: 159, column: 48, scope: !377)
!384 = !DILocalVariable(name: "skip_window", arg: 2, scope: !377, file: !365, line: 160, type: !133)
!385 = !DILocation(line: 160, column: 22, scope: !377)
!386 = !DILocalVariable(name: "window", scope: !377, file: !365, line: 162, type: !133)
!387 = !DILocation(line: 162, column: 21, scope: !377)
!388 = !DILocalVariable(name: "other", scope: !377, file: !365, line: 162, type: !133)
!389 = !DILocation(line: 162, column: 30, scope: !377)
!390 = !DILocalVariable(name: "tmp", scope: !377, file: !365, line: 163, type: !147)
!391 = !DILocation(line: 163, column: 10, scope: !377)
!392 = !DILocation(line: 165, column: 9, scope: !377)
!393 = !DILocation(line: 165, column: 18, scope: !377)
!394 = !DILocation(line: 165, column: 25, scope: !377)
!395 = !DILocation(line: 166, column: 6, scope: !396)
!396 = distinct !DILexicalBlock(scope: !377, file: !365, line: 166, column: 6)
!397 = !DILocation(line: 166, column: 15, scope: !396)
!398 = !DILocation(line: 166, column: 6, scope: !377)
!399 = !DILocation(line: 168, column: 49, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !365, line: 166, column: 31)
!401 = !DILocation(line: 168, column: 23, scope: !400)
!402 = !DILocation(line: 168, column: 21, scope: !400)
!403 = !DILocation(line: 169, column: 26, scope: !400)
!404 = !DILocation(line: 169, column: 31, scope: !400)
!405 = !DILocation(line: 169, column: 24, scope: !400)
!406 = !DILocation(line: 170, column: 7, scope: !407)
!407 = distinct !DILexicalBlock(scope: !400, file: !365, line: 170, column: 7)
!408 = !DILocation(line: 170, column: 17, scope: !407)
!409 = !DILocation(line: 170, column: 14, scope: !407)
!410 = !DILocation(line: 170, column: 7, scope: !400)
!411 = !DILocation(line: 171, column: 13, scope: !412)
!412 = distinct !DILexicalBlock(scope: !407, file: !365, line: 170, column: 30)
!413 = !DILocation(line: 171, column: 18, scope: !412)
!414 = !DILocation(line: 171, column: 23, scope: !412)
!415 = !DILocation(line: 171, column: 13, scope: !416)
!416 = !DILexicalBlockFile(scope: !412, file: !365, discriminator: 1)
!417 = !DILocation(line: 172, column: 5, scope: !412)
!418 = !DILocation(line: 172, column: 10, scope: !412)
!419 = !DILocation(line: 172, column: 16, scope: !412)
!420 = !DILocation(line: 171, column: 13, scope: !421)
!421 = !DILexicalBlockFile(scope: !412, file: !365, discriminator: 2)
!422 = !DILocation(line: 171, column: 13, scope: !423)
!423 = !DILexicalBlockFile(scope: !412, file: !365, discriminator: 3)
!424 = !DILocation(line: 171, column: 11, scope: !423)
!425 = !DILocation(line: 173, column: 3, scope: !412)
!426 = !DILocation(line: 174, column: 30, scope: !400)
!427 = !DILocation(line: 174, column: 17, scope: !400)
!428 = !DILocation(line: 176, column: 7, scope: !429)
!429 = distinct !DILexicalBlock(scope: !400, file: !365, line: 176, column: 7)
!430 = !DILocation(line: 176, column: 14, scope: !429)
!431 = !DILocation(line: 176, column: 7, scope: !400)
!432 = !DILocation(line: 177, column: 22, scope: !433)
!433 = distinct !DILexicalBlock(scope: !429, file: !365, line: 176, column: 22)
!434 = !DILocation(line: 177, column: 4, scope: !433)
!435 = !DILocation(line: 178, column: 4, scope: !433)
!436 = !DILocation(line: 180, column: 2, scope: !400)
!437 = !DILocation(line: 182, column: 15, scope: !377)
!438 = !DILocation(line: 183, column: 13, scope: !439)
!439 = distinct !DILexicalBlock(scope: !377, file: !365, line: 183, column: 2)
!440 = !DILocation(line: 183, column: 11, scope: !439)
!441 = !DILocation(line: 183, column: 7, scope: !439)
!442 = !DILocation(line: 183, column: 22, scope: !443)
!443 = !DILexicalBlockFile(scope: !444, file: !365, discriminator: 1)
!444 = distinct !DILexicalBlock(scope: !439, file: !365, line: 183, column: 2)
!445 = !DILocation(line: 183, column: 26, scope: !443)
!446 = !DILocation(line: 183, column: 2, scope: !443)
!447 = !DILocalVariable(name: "rec", scope: !448, file: !365, line: 184, type: !133)
!448 = distinct !DILexicalBlock(scope: !444, file: !365, line: 183, column: 51)
!449 = !DILocation(line: 184, column: 15, scope: !448)
!450 = !DILocation(line: 184, column: 21, scope: !448)
!451 = !DILocation(line: 184, column: 26, scope: !448)
!452 = !DILocation(line: 186, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !448, file: !365, line: 186, column: 7)
!454 = !DILocation(line: 186, column: 14, scope: !453)
!455 = !DILocation(line: 186, column: 11, scope: !453)
!456 = !DILocation(line: 186, column: 7, scope: !448)
!457 = !DILocation(line: 187, column: 12, scope: !458)
!458 = distinct !DILexicalBlock(scope: !453, file: !365, line: 186, column: 27)
!459 = !DILocation(line: 187, column: 10, scope: !458)
!460 = !DILocation(line: 188, column: 4, scope: !458)
!461 = !DILocation(line: 190, column: 2, scope: !448)
!462 = !DILocation(line: 183, column: 40, scope: !463)
!463 = !DILexicalBlockFile(scope: !444, file: !365, discriminator: 2)
!464 = !DILocation(line: 183, column: 45, scope: !463)
!465 = !DILocation(line: 183, column: 38, scope: !463)
!466 = !DILocation(line: 183, column: 2, scope: !463)
!467 = distinct !{!467, !468}
!468 = !DILocation(line: 183, column: 2, scope: !377)
!469 = !DILocation(line: 192, column: 20, scope: !377)
!470 = !DILocation(line: 192, column: 2, scope: !377)
!471 = !DILocation(line: 193, column: 6, scope: !472)
!472 = distinct !DILexicalBlock(scope: !377, file: !365, line: 193, column: 6)
!473 = !DILocation(line: 193, column: 19, scope: !472)
!474 = !DILocation(line: 193, column: 24, scope: !472)
!475 = !DILocation(line: 193, column: 6, scope: !377)
!476 = !DILocation(line: 194, column: 22, scope: !472)
!477 = !DILocation(line: 194, column: 3, scope: !472)
!478 = !DILocation(line: 195, column: 1, scope: !377)
!479 = distinct !DISubprogram(name: "get_sticky_windows_sorted", scope: !365, file: !365, line: 142, type: !480, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!480 = !DISubroutineType(types: !481)
!481 = !{!147, !127}
!482 = !DILocalVariable(name: "mainwin", arg: 1, scope: !479, file: !365, line: 142, type: !127)
!483 = !DILocation(line: 142, column: 59, scope: !479)
!484 = !DILocalVariable(name: "tmp", scope: !479, file: !365, line: 144, type: !147)
!485 = !DILocation(line: 144, column: 10, scope: !479)
!486 = !DILocalVariable(name: "list", scope: !479, file: !365, line: 144, type: !147)
!487 = !DILocation(line: 144, column: 16, scope: !479)
!488 = !DILocation(line: 146, column: 14, scope: !479)
!489 = !DILocation(line: 147, column: 13, scope: !490)
!490 = distinct !DILexicalBlock(scope: !479, file: !365, line: 147, column: 2)
!491 = !DILocation(line: 147, column: 11, scope: !490)
!492 = !DILocation(line: 147, column: 7, scope: !490)
!493 = !DILocation(line: 147, column: 22, scope: !494)
!494 = !DILexicalBlockFile(scope: !495, file: !365, discriminator: 1)
!495 = distinct !DILexicalBlock(scope: !490, file: !365, line: 147, column: 2)
!496 = !DILocation(line: 147, column: 26, scope: !494)
!497 = !DILocation(line: 147, column: 2, scope: !494)
!498 = !DILocalVariable(name: "rec", scope: !499, file: !365, line: 148, type: !133)
!499 = distinct !DILexicalBlock(scope: !495, file: !365, line: 147, column: 51)
!500 = !DILocation(line: 148, column: 15, scope: !499)
!501 = !DILocation(line: 148, column: 21, scope: !499)
!502 = !DILocation(line: 148, column: 26, scope: !499)
!503 = !DILocation(line: 150, column: 29, scope: !504)
!504 = distinct !DILexicalBlock(scope: !499, file: !365, line: 150, column: 7)
!505 = !DILocation(line: 150, column: 35, scope: !504)
!506 = !DILocation(line: 150, column: 8, scope: !504)
!507 = !DILocation(line: 150, column: 47, scope: !504)
!508 = !DILocation(line: 150, column: 7, scope: !504)
!509 = !DILocation(line: 150, column: 54, scope: !504)
!510 = !DILocation(line: 150, column: 80, scope: !511)
!511 = !DILexicalBlockFile(scope: !504, file: !365, discriminator: 1)
!512 = !DILocation(line: 150, column: 86, scope: !511)
!513 = !DILocation(line: 150, column: 59, scope: !511)
!514 = !DILocation(line: 150, column: 98, scope: !511)
!515 = !DILocation(line: 150, column: 109, scope: !511)
!516 = !DILocation(line: 150, column: 106, scope: !511)
!517 = !DILocation(line: 150, column: 7, scope: !511)
!518 = !DILocation(line: 151, column: 33, scope: !519)
!519 = distinct !DILexicalBlock(scope: !504, file: !365, line: 150, column: 118)
!520 = !DILocation(line: 151, column: 39, scope: !519)
!521 = !DILocation(line: 151, column: 11, scope: !519)
!522 = !DILocation(line: 151, column: 9, scope: !519)
!523 = !DILocation(line: 153, column: 3, scope: !519)
!524 = !DILocation(line: 154, column: 2, scope: !499)
!525 = !DILocation(line: 147, column: 40, scope: !526)
!526 = !DILexicalBlockFile(scope: !495, file: !365, discriminator: 2)
!527 = !DILocation(line: 147, column: 45, scope: !526)
!528 = !DILocation(line: 147, column: 38, scope: !526)
!529 = !DILocation(line: 147, column: 2, scope: !526)
!530 = distinct !{!530, !531}
!531 = !DILocation(line: 147, column: 2, scope: !479)
!532 = !DILocation(line: 156, column: 16, scope: !479)
!533 = !DILocation(line: 156, column: 9, scope: !479)
!534 = distinct !DISubprogram(name: "mainwindow_destroy", scope: !365, file: !365, line: 523, type: !535, isLocal: false, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !127}
!537 = !DILocalVariable(name: "window", arg: 1, scope: !534, file: !365, line: 523, type: !127)
!538 = !DILocation(line: 523, column: 42, scope: !534)
!539 = !DILocation(line: 525, column: 2, scope: !534)
!540 = distinct !{!540, !539}
!541 = !DILocation(line: 525, column: 10, scope: !542)
!542 = !DILexicalBlockFile(scope: !543, file: !365, discriminator: 1)
!543 = distinct !DILexicalBlock(scope: !544, file: !365, line: 525, column: 10)
!544 = distinct !DILexicalBlock(scope: !534, file: !365, line: 525, column: 4)
!545 = !DILocation(line: 525, column: 17, scope: !542)
!546 = !DILocation(line: 525, column: 5, scope: !547)
!547 = !DILexicalBlockFile(scope: !548, file: !365, discriminator: 2)
!548 = distinct !DILexicalBlock(scope: !543, file: !365, line: 525, column: 3)
!549 = !DILocation(line: 525, column: 14, scope: !550)
!550 = !DILexicalBlockFile(scope: !551, file: !365, discriminator: 3)
!551 = distinct !DILexicalBlock(scope: !543, file: !365, line: 525, column: 12)
!552 = !DILocation(line: 525, column: 101, scope: !550)
!553 = !DILocation(line: 525, column: 112, scope: !554)
!554 = !DILexicalBlockFile(scope: !544, file: !365, discriminator: 4)
!555 = !DILocation(line: 527, column: 31, scope: !534)
!556 = !DILocation(line: 527, column: 44, scope: !534)
!557 = !DILocation(line: 527, column: 16, scope: !534)
!558 = !DILocation(line: 527, column: 14, scope: !534)
!559 = !DILocation(line: 528, column: 41, scope: !534)
!560 = !DILocation(line: 528, column: 2, scope: !534)
!561 = !DILocation(line: 530, column: 29, scope: !534)
!562 = !DILocation(line: 530, column: 37, scope: !534)
!563 = !DILocation(line: 530, column: 9, scope: !534)
!564 = !DILocation(line: 532, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !534, file: !365, line: 532, column: 6)
!566 = !DILocation(line: 532, column: 18, scope: !565)
!567 = !DILocation(line: 532, column: 6, scope: !534)
!568 = !DILocation(line: 533, column: 29, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !365, line: 532, column: 26)
!570 = !DILocation(line: 533, column: 3, scope: !569)
!571 = !DILocation(line: 534, column: 8, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !365, line: 534, column: 7)
!573 = !DILocation(line: 534, column: 7, scope: !569)
!574 = !DILocation(line: 535, column: 26, scope: !575)
!575 = distinct !DILexicalBlock(scope: !572, file: !365, line: 534, column: 18)
!576 = !DILocation(line: 535, column: 4, scope: !575)
!577 = !DILocation(line: 536, column: 4, scope: !575)
!578 = !DILocation(line: 537, column: 3, scope: !575)
!579 = !DILocation(line: 538, column: 2, scope: !569)
!580 = !DILocation(line: 540, column: 9, scope: !534)
!581 = !DILocation(line: 540, column: 2, scope: !534)
!582 = !DILocation(line: 542, column: 6, scope: !583)
!583 = distinct !DILexicalBlock(scope: !534, file: !365, line: 542, column: 6)
!584 = !DILocation(line: 542, column: 24, scope: !583)
!585 = !DILocation(line: 542, column: 21, scope: !583)
!586 = !DILocation(line: 542, column: 6, scope: !534)
!587 = !DILocation(line: 542, column: 47, scope: !588)
!588 = !DILexicalBlockFile(scope: !583, file: !365, discriminator: 1)
!589 = !DILocation(line: 542, column: 32, scope: !588)
!590 = !DILocation(line: 543, column: 1, scope: !534)
!591 = distinct !DISubprogram(name: "mainwindows_recreate", scope: !365, file: !365, line: 197, type: !592, isLocal: false, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!592 = !DISubroutineType(types: !593)
!593 = !{null}
!594 = !DILocalVariable(name: "tmp", scope: !591, file: !365, line: 199, type: !147)
!595 = !DILocation(line: 199, column: 10, scope: !591)
!596 = !DILocation(line: 201, column: 13, scope: !597)
!597 = distinct !DILexicalBlock(scope: !591, file: !365, line: 201, column: 2)
!598 = !DILocation(line: 201, column: 11, scope: !597)
!599 = !DILocation(line: 201, column: 7, scope: !597)
!600 = !DILocation(line: 201, column: 26, scope: !601)
!601 = !DILexicalBlockFile(scope: !602, file: !365, discriminator: 1)
!602 = distinct !DILexicalBlock(scope: !597, file: !365, line: 201, column: 2)
!603 = !DILocation(line: 201, column: 30, scope: !601)
!604 = !DILocation(line: 201, column: 2, scope: !601)
!605 = !DILocalVariable(name: "rec", scope: !606, file: !365, line: 202, type: !127)
!606 = distinct !DILexicalBlock(scope: !602, file: !365, line: 201, column: 55)
!607 = !DILocation(line: 202, column: 20, scope: !606)
!608 = !DILocation(line: 202, column: 26, scope: !606)
!609 = !DILocation(line: 202, column: 31, scope: !606)
!610 = !DILocation(line: 204, column: 41, scope: !606)
!611 = !DILocation(line: 204, column: 47, scope: !606)
!612 = !DILocation(line: 204, column: 63, scope: !606)
!613 = !DILocation(line: 204, column: 69, scope: !606)
!614 = !DILocation(line: 204, column: 60, scope: !606)
!615 = !DILocation(line: 204, column: 94, scope: !606)
!616 = !DILocation(line: 204, column: 100, scope: !606)
!617 = !DILocation(line: 204, column: 114, scope: !606)
!618 = !DILocation(line: 204, column: 120, scope: !606)
!619 = !DILocation(line: 204, column: 111, scope: !606)
!620 = !DILocation(line: 204, column: 142, scope: !606)
!621 = !DILocation(line: 204, column: 148, scope: !606)
!622 = !DILocation(line: 204, column: 157, scope: !606)
!623 = !DILocation(line: 204, column: 163, scope: !606)
!624 = !DILocation(line: 204, column: 154, scope: !606)
!625 = !DILocation(line: 204, column: 183, scope: !606)
!626 = !DILocation(line: 204, column: 189, scope: !606)
!627 = !DILocation(line: 204, column: 199, scope: !606)
!628 = !DILocation(line: 204, column: 205, scope: !606)
!629 = !DILocation(line: 204, column: 196, scope: !606)
!630 = !DILocation(line: 204, column: 21, scope: !606)
!631 = !DILocation(line: 204, column: 3, scope: !606)
!632 = !DILocation(line: 204, column: 8, scope: !606)
!633 = !DILocation(line: 204, column: 19, scope: !606)
!634 = !DILocation(line: 205, column: 17, scope: !606)
!635 = !DILocation(line: 205, column: 22, scope: !606)
!636 = !DILocation(line: 205, column: 28, scope: !606)
!637 = !DILocation(line: 206, column: 52, scope: !606)
!638 = !DILocation(line: 206, column: 57, scope: !606)
!639 = !DILocation(line: 206, column: 66, scope: !606)
!640 = !DILocation(line: 206, column: 31, scope: !606)
!641 = !DILocation(line: 206, column: 78, scope: !606)
!642 = !DILocation(line: 207, column: 9, scope: !606)
!643 = !DILocation(line: 207, column: 14, scope: !606)
!644 = !DILocation(line: 206, column: 3, scope: !606)
!645 = !DILocation(line: 208, column: 2, scope: !606)
!646 = !DILocation(line: 201, column: 44, scope: !647)
!647 = !DILexicalBlockFile(scope: !602, file: !365, discriminator: 2)
!648 = !DILocation(line: 201, column: 49, scope: !647)
!649 = !DILocation(line: 201, column: 42, scope: !647)
!650 = !DILocation(line: 201, column: 2, scope: !647)
!651 = distinct !{!651, !652}
!652 = !DILocation(line: 201, column: 2, scope: !591)
!653 = !DILocation(line: 209, column: 1, scope: !591)
!654 = distinct !DISubprogram(name: "mainwindow_create", scope: !365, file: !365, line: 211, type: !655, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!655 = !DISubroutineType(types: !656)
!656 = !{!127, !140}
!657 = !DILocalVariable(name: "right", arg: 1, scope: !654, file: !365, line: 211, type: !140)
!658 = !DILocation(line: 211, column: 40, scope: !654)
!659 = !DILocalVariable(name: "rec", scope: !654, file: !365, line: 213, type: !127)
!660 = !DILocation(line: 213, column: 19, scope: !654)
!661 = !DILocalVariable(name: "parent", scope: !654, file: !365, line: 213, type: !127)
!662 = !DILocation(line: 213, column: 25, scope: !654)
!663 = !DILocalVariable(name: "space", scope: !654, file: !365, line: 214, type: !140)
!664 = !DILocation(line: 214, column: 6, scope: !654)
!665 = !DILocation(line: 216, column: 29, scope: !654)
!666 = !DILocation(line: 216, column: 9, scope: !654)
!667 = !DILocation(line: 216, column: 6, scope: !654)
!668 = !DILocation(line: 217, column: 2, scope: !654)
!669 = !DILocation(line: 217, column: 7, scope: !654)
!670 = !DILocation(line: 217, column: 13, scope: !654)
!671 = !DILocation(line: 219, column: 6, scope: !672)
!672 = distinct !DILexicalBlock(scope: !654, file: !365, line: 219, column: 6)
!673 = !DILocation(line: 219, column: 18, scope: !672)
!674 = !DILocation(line: 219, column: 6, scope: !654)
!675 = !DILocation(line: 220, column: 20, scope: !676)
!676 = distinct !DILexicalBlock(scope: !672, file: !365, line: 219, column: 26)
!677 = !DILocation(line: 220, column: 18, scope: !676)
!678 = !DILocation(line: 222, column: 21, scope: !676)
!679 = !DILocation(line: 222, column: 3, scope: !676)
!680 = !DILocation(line: 222, column: 8, scope: !676)
!681 = !DILocation(line: 222, column: 19, scope: !676)
!682 = !DILocation(line: 223, column: 20, scope: !676)
!683 = !DILocation(line: 223, column: 31, scope: !676)
!684 = !DILocation(line: 223, column: 36, scope: !676)
!685 = !DILocation(line: 223, column: 34, scope: !676)
!686 = !DILocation(line: 223, column: 3, scope: !676)
!687 = !DILocation(line: 223, column: 8, scope: !676)
!688 = !DILocation(line: 223, column: 18, scope: !676)
!689 = !DILocation(line: 224, column: 17, scope: !676)
!690 = !DILocation(line: 224, column: 22, scope: !676)
!691 = !DILocation(line: 224, column: 32, scope: !676)
!692 = !DILocation(line: 224, column: 37, scope: !676)
!693 = !DILocation(line: 224, column: 31, scope: !676)
!694 = !DILocation(line: 224, column: 47, scope: !676)
!695 = !DILocation(line: 224, column: 3, scope: !676)
!696 = !DILocation(line: 224, column: 8, scope: !676)
!697 = !DILocation(line: 224, column: 15, scope: !676)
!698 = !DILocation(line: 225, column: 23, scope: !676)
!699 = !DILocation(line: 225, column: 3, scope: !676)
!700 = !DILocation(line: 225, column: 8, scope: !676)
!701 = !DILocation(line: 225, column: 21, scope: !676)
!702 = !DILocation(line: 226, column: 22, scope: !676)
!703 = !DILocation(line: 226, column: 34, scope: !676)
!704 = !DILocation(line: 226, column: 39, scope: !676)
!705 = !DILocation(line: 226, column: 37, scope: !676)
!706 = !DILocation(line: 226, column: 3, scope: !676)
!707 = !DILocation(line: 226, column: 8, scope: !676)
!708 = !DILocation(line: 226, column: 20, scope: !676)
!709 = !DILocation(line: 227, column: 16, scope: !676)
!710 = !DILocation(line: 227, column: 21, scope: !676)
!711 = !DILocation(line: 227, column: 33, scope: !676)
!712 = !DILocation(line: 227, column: 38, scope: !676)
!713 = !DILocation(line: 227, column: 32, scope: !676)
!714 = !DILocation(line: 227, column: 50, scope: !676)
!715 = !DILocation(line: 227, column: 3, scope: !676)
!716 = !DILocation(line: 227, column: 8, scope: !676)
!717 = !DILocation(line: 227, column: 14, scope: !676)
!718 = !DILocation(line: 228, column: 2, scope: !676)
!719 = !DILocation(line: 229, column: 35, scope: !720)
!720 = distinct !DILexicalBlock(scope: !672, file: !365, line: 228, column: 9)
!721 = !DILocation(line: 229, column: 48, scope: !720)
!722 = !DILocation(line: 229, column: 14, scope: !720)
!723 = !DILocation(line: 229, column: 60, scope: !720)
!724 = !DILocation(line: 229, column: 10, scope: !720)
!725 = !DILocation(line: 231, column: 8, scope: !726)
!726 = distinct !DILexicalBlock(scope: !720, file: !365, line: 231, column: 7)
!727 = !DILocation(line: 231, column: 7, scope: !720)
!728 = !DILocalVariable(name: "tmp", scope: !729, file: !365, line: 232, type: !147)
!729 = distinct !DILexicalBlock(scope: !726, file: !365, line: 231, column: 15)
!730 = !DILocation(line: 232, column: 12, scope: !729)
!731 = !DILocalVariable(name: "line", scope: !729, file: !365, line: 232, type: !147)
!732 = !DILocation(line: 232, column: 18, scope: !729)
!733 = !DILocation(line: 233, column: 10, scope: !734)
!734 = distinct !DILexicalBlock(scope: !729, file: !365, line: 233, column: 8)
!735 = !DILocation(line: 233, column: 19, scope: !734)
!736 = !DILocation(line: 233, column: 27, scope: !734)
!737 = !DILocation(line: 233, column: 36, scope: !734)
!738 = !DILocation(line: 233, column: 25, scope: !734)
!739 = !DILocation(line: 233, column: 53, scope: !734)
!740 = !DILocation(line: 233, column: 8, scope: !729)
!741 = !DILocation(line: 235, column: 14, scope: !734)
!742 = !DILocation(line: 235, column: 12, scope: !734)
!743 = !DILocation(line: 235, column: 5, scope: !734)
!744 = !DILocation(line: 236, column: 8, scope: !745)
!745 = distinct !DILexicalBlock(scope: !729, file: !365, line: 236, column: 8)
!746 = !DILocation(line: 236, column: 15, scope: !745)
!747 = !DILocation(line: 236, column: 8, scope: !729)
!748 = !DILocation(line: 237, column: 5, scope: !745)
!749 = !DILocation(line: 239, column: 12, scope: !729)
!750 = !DILocation(line: 239, column: 20, scope: !729)
!751 = !DILocation(line: 239, column: 27, scope: !729)
!752 = !DILocation(line: 239, column: 10, scope: !729)
!753 = !DILocation(line: 240, column: 22, scope: !729)
!754 = !DILocation(line: 240, column: 30, scope: !729)
!755 = !DILocation(line: 240, column: 4, scope: !729)
!756 = !DILocation(line: 240, column: 9, scope: !729)
!757 = !DILocation(line: 240, column: 20, scope: !729)
!758 = !DILocation(line: 241, column: 21, scope: !729)
!759 = !DILocation(line: 241, column: 26, scope: !729)
!760 = !DILocation(line: 241, column: 39, scope: !729)
!761 = !DILocation(line: 241, column: 37, scope: !729)
!762 = !DILocation(line: 241, column: 4, scope: !729)
!763 = !DILocation(line: 241, column: 9, scope: !729)
!764 = !DILocation(line: 241, column: 19, scope: !729)
!765 = !DILocation(line: 242, column: 18, scope: !729)
!766 = !DILocation(line: 242, column: 23, scope: !729)
!767 = !DILocation(line: 242, column: 33, scope: !729)
!768 = !DILocation(line: 242, column: 38, scope: !729)
!769 = !DILocation(line: 242, column: 32, scope: !729)
!770 = !DILocation(line: 242, column: 48, scope: !729)
!771 = !DILocation(line: 242, column: 4, scope: !729)
!772 = !DILocation(line: 242, column: 9, scope: !729)
!773 = !DILocation(line: 242, column: 16, scope: !729)
!774 = !DILocation(line: 243, column: 24, scope: !729)
!775 = !DILocation(line: 243, column: 4, scope: !729)
!776 = !DILocation(line: 243, column: 9, scope: !729)
!777 = !DILocation(line: 243, column: 22, scope: !729)
!778 = !DILocation(line: 244, column: 23, scope: !729)
!779 = !DILocation(line: 244, column: 35, scope: !729)
!780 = !DILocation(line: 244, column: 40, scope: !729)
!781 = !DILocation(line: 244, column: 38, scope: !729)
!782 = !DILocation(line: 244, column: 4, scope: !729)
!783 = !DILocation(line: 244, column: 9, scope: !729)
!784 = !DILocation(line: 244, column: 21, scope: !729)
!785 = !DILocation(line: 245, column: 17, scope: !729)
!786 = !DILocation(line: 245, column: 22, scope: !729)
!787 = !DILocation(line: 245, column: 34, scope: !729)
!788 = !DILocation(line: 245, column: 39, scope: !729)
!789 = !DILocation(line: 245, column: 33, scope: !729)
!790 = !DILocation(line: 245, column: 51, scope: !729)
!791 = !DILocation(line: 245, column: 4, scope: !729)
!792 = !DILocation(line: 245, column: 9, scope: !729)
!793 = !DILocation(line: 245, column: 15, scope: !729)
!794 = !DILocation(line: 247, column: 32, scope: !729)
!795 = !DILocation(line: 247, column: 11, scope: !729)
!796 = !DILocation(line: 247, column: 9, scope: !729)
!797 = !DILocation(line: 248, column: 15, scope: !798)
!798 = distinct !DILexicalBlock(scope: !729, file: !365, line: 248, column: 4)
!799 = !DILocation(line: 248, column: 13, scope: !798)
!800 = !DILocation(line: 248, column: 9, scope: !798)
!801 = !DILocation(line: 248, column: 21, scope: !802)
!802 = !DILexicalBlockFile(scope: !803, file: !365, discriminator: 1)
!803 = distinct !DILexicalBlock(scope: !798, file: !365, line: 248, column: 4)
!804 = !DILocation(line: 248, column: 25, scope: !802)
!805 = !DILocation(line: 248, column: 4, scope: !802)
!806 = !DILocalVariable(name: "rec", scope: !807, file: !365, line: 249, type: !127)
!807 = distinct !DILexicalBlock(scope: !803, file: !365, line: 248, column: 50)
!808 = !DILocation(line: 249, column: 22, scope: !807)
!809 = !DILocation(line: 249, column: 28, scope: !807)
!810 = !DILocation(line: 249, column: 33, scope: !807)
!811 = !DILocation(line: 250, column: 24, scope: !807)
!812 = !DILocation(line: 250, column: 29, scope: !807)
!813 = !DILocation(line: 250, column: 5, scope: !807)
!814 = !DILocation(line: 250, column: 10, scope: !807)
!815 = !DILocation(line: 250, column: 21, scope: !807)
!816 = !DILocation(line: 251, column: 23, scope: !807)
!817 = !DILocation(line: 251, column: 32, scope: !807)
!818 = !DILocation(line: 251, column: 31, scope: !807)
!819 = !DILocation(line: 251, column: 37, scope: !807)
!820 = !DILocation(line: 251, column: 5, scope: !807)
!821 = !DILocation(line: 252, column: 4, scope: !807)
!822 = !DILocation(line: 248, column: 39, scope: !823)
!823 = !DILexicalBlockFile(scope: !803, file: !365, discriminator: 2)
!824 = !DILocation(line: 248, column: 44, scope: !823)
!825 = !DILocation(line: 248, column: 37, scope: !823)
!826 = !DILocation(line: 248, column: 4, scope: !823)
!827 = distinct !{!827, !828}
!828 = !DILocation(line: 248, column: 4, scope: !729)
!829 = !DILocation(line: 253, column: 17, scope: !729)
!830 = !DILocation(line: 253, column: 4, scope: !729)
!831 = !DILocation(line: 254, column: 3, scope: !729)
!832 = !DILocation(line: 255, column: 10, scope: !833)
!833 = distinct !DILexicalBlock(scope: !834, file: !365, line: 255, column: 8)
!834 = distinct !DILexicalBlock(scope: !726, file: !365, line: 254, column: 10)
!835 = !DILocation(line: 255, column: 19, scope: !833)
!836 = !DILocation(line: 255, column: 26, scope: !833)
!837 = !DILocation(line: 255, column: 35, scope: !833)
!838 = !DILocation(line: 255, column: 24, scope: !833)
!839 = !DILocation(line: 255, column: 54, scope: !833)
!840 = !DILocation(line: 255, column: 8, scope: !834)
!841 = !DILocation(line: 257, column: 14, scope: !833)
!842 = !DILocation(line: 257, column: 12, scope: !833)
!843 = !DILocation(line: 257, column: 5, scope: !833)
!844 = !DILocation(line: 258, column: 8, scope: !845)
!845 = distinct !DILexicalBlock(scope: !834, file: !365, line: 258, column: 8)
!846 = !DILocation(line: 258, column: 15, scope: !845)
!847 = !DILocation(line: 258, column: 8, scope: !834)
!848 = !DILocation(line: 259, column: 5, scope: !845)
!849 = !DILocation(line: 261, column: 12, scope: !834)
!850 = !DILocation(line: 261, column: 20, scope: !834)
!851 = !DILocation(line: 261, column: 26, scope: !834)
!852 = !DILocation(line: 261, column: 10, scope: !834)
!853 = !DILocation(line: 262, column: 22, scope: !834)
!854 = !DILocation(line: 262, column: 30, scope: !834)
!855 = !DILocation(line: 262, column: 4, scope: !834)
!856 = !DILocation(line: 262, column: 9, scope: !834)
!857 = !DILocation(line: 262, column: 20, scope: !834)
!858 = !DILocation(line: 263, column: 21, scope: !834)
!859 = !DILocation(line: 263, column: 29, scope: !834)
!860 = !DILocation(line: 263, column: 4, scope: !834)
!861 = !DILocation(line: 263, column: 9, scope: !834)
!862 = !DILocation(line: 263, column: 19, scope: !834)
!863 = !DILocation(line: 264, column: 18, scope: !834)
!864 = !DILocation(line: 264, column: 26, scope: !834)
!865 = !DILocation(line: 264, column: 4, scope: !834)
!866 = !DILocation(line: 264, column: 9, scope: !834)
!867 = !DILocation(line: 264, column: 16, scope: !834)
!868 = !DILocation(line: 265, column: 24, scope: !834)
!869 = !DILocation(line: 265, column: 32, scope: !834)
!870 = !DILocation(line: 265, column: 46, scope: !834)
!871 = !DILocation(line: 265, column: 44, scope: !834)
!872 = !DILocation(line: 265, column: 52, scope: !834)
!873 = !DILocation(line: 265, column: 4, scope: !834)
!874 = !DILocation(line: 265, column: 9, scope: !834)
!875 = !DILocation(line: 265, column: 22, scope: !834)
!876 = !DILocation(line: 266, column: 23, scope: !834)
!877 = !DILocation(line: 266, column: 31, scope: !834)
!878 = !DILocation(line: 266, column: 4, scope: !834)
!879 = !DILocation(line: 266, column: 9, scope: !834)
!880 = !DILocation(line: 266, column: 21, scope: !834)
!881 = !DILocation(line: 267, column: 17, scope: !834)
!882 = !DILocation(line: 267, column: 22, scope: !834)
!883 = !DILocation(line: 267, column: 34, scope: !834)
!884 = !DILocation(line: 267, column: 39, scope: !834)
!885 = !DILocation(line: 267, column: 33, scope: !834)
!886 = !DILocation(line: 267, column: 51, scope: !834)
!887 = !DILocation(line: 267, column: 4, scope: !834)
!888 = !DILocation(line: 267, column: 9, scope: !834)
!889 = !DILocation(line: 267, column: 15, scope: !834)
!890 = !DILocation(line: 269, column: 27, scope: !834)
!891 = !DILocation(line: 269, column: 32, scope: !834)
!892 = !DILocation(line: 269, column: 4, scope: !834)
!893 = !DILocation(line: 269, column: 12, scope: !834)
!894 = !DILocation(line: 269, column: 24, scope: !834)
!895 = !DILocation(line: 270, column: 22, scope: !834)
!896 = !DILocation(line: 270, column: 31, scope: !834)
!897 = !DILocation(line: 270, column: 30, scope: !834)
!898 = !DILocation(line: 270, column: 36, scope: !834)
!899 = !DILocation(line: 270, column: 4, scope: !834)
!900 = !DILocation(line: 274, column: 40, scope: !654)
!901 = !DILocation(line: 274, column: 46, scope: !654)
!902 = !DILocation(line: 274, column: 62, scope: !654)
!903 = !DILocation(line: 274, column: 68, scope: !654)
!904 = !DILocation(line: 274, column: 59, scope: !654)
!905 = !DILocation(line: 274, column: 93, scope: !654)
!906 = !DILocation(line: 274, column: 99, scope: !654)
!907 = !DILocation(line: 274, column: 113, scope: !654)
!908 = !DILocation(line: 274, column: 119, scope: !654)
!909 = !DILocation(line: 274, column: 110, scope: !654)
!910 = !DILocation(line: 274, column: 141, scope: !654)
!911 = !DILocation(line: 274, column: 147, scope: !654)
!912 = !DILocation(line: 274, column: 156, scope: !654)
!913 = !DILocation(line: 274, column: 162, scope: !654)
!914 = !DILocation(line: 274, column: 153, scope: !654)
!915 = !DILocation(line: 274, column: 182, scope: !654)
!916 = !DILocation(line: 274, column: 188, scope: !654)
!917 = !DILocation(line: 274, column: 198, scope: !654)
!918 = !DILocation(line: 274, column: 204, scope: !654)
!919 = !DILocation(line: 274, column: 195, scope: !654)
!920 = !DILocation(line: 274, column: 20, scope: !654)
!921 = !DILocation(line: 274, column: 2, scope: !654)
!922 = !DILocation(line: 274, column: 7, scope: !654)
!923 = !DILocation(line: 274, column: 18, scope: !654)
!924 = !DILocation(line: 275, column: 2, scope: !654)
!925 = !DILocation(line: 277, column: 31, scope: !654)
!926 = !DILocation(line: 277, column: 44, scope: !654)
!927 = !DILocation(line: 277, column: 16, scope: !654)
!928 = !DILocation(line: 277, column: 14, scope: !654)
!929 = !DILocation(line: 278, column: 39, scope: !654)
!930 = !DILocation(line: 278, column: 2, scope: !654)
!931 = !DILocation(line: 279, column: 9, scope: !654)
!932 = !DILocation(line: 279, column: 2, scope: !654)
!933 = !DILocation(line: 280, column: 1, scope: !654)
!934 = distinct !DISubprogram(name: "mainwindows_get_line", scope: !365, file: !365, line: 424, type: !480, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!935 = !DILocalVariable(name: "rec", arg: 1, scope: !934, file: !365, line: 424, type: !127)
!936 = !DILocation(line: 424, column: 47, scope: !934)
!937 = !DILocalVariable(name: "win", scope: !934, file: !365, line: 426, type: !127)
!938 = !DILocation(line: 426, column: 19, scope: !934)
!939 = !DILocalVariable(name: "list", scope: !934, file: !365, line: 427, type: !147)
!940 = !DILocation(line: 427, column: 10, scope: !934)
!941 = !DILocation(line: 429, column: 7, scope: !934)
!942 = !DILocation(line: 431, column: 35, scope: !943)
!943 = distinct !DILexicalBlock(scope: !934, file: !365, line: 431, column: 2)
!944 = !DILocation(line: 431, column: 13, scope: !943)
!945 = !DILocation(line: 431, column: 11, scope: !943)
!946 = !DILocation(line: 431, column: 7, scope: !943)
!947 = !DILocation(line: 432, column: 7, scope: !948)
!948 = distinct !DILexicalBlock(scope: !943, file: !365, line: 431, column: 2)
!949 = !DILocation(line: 432, column: 11, scope: !948)
!950 = !DILocation(line: 431, column: 2, scope: !951)
!951 = !DILexicalBlockFile(scope: !943, file: !365, discriminator: 1)
!952 = !DILocation(line: 434, column: 25, scope: !953)
!953 = distinct !DILexicalBlock(scope: !948, file: !365, line: 433, column: 46)
!954 = !DILocation(line: 434, column: 31, scope: !953)
!955 = !DILocation(line: 434, column: 10, scope: !953)
!956 = !DILocation(line: 434, column: 8, scope: !953)
!957 = !DILocation(line: 435, column: 2, scope: !953)
!958 = !DILocation(line: 433, column: 35, scope: !948)
!959 = !DILocation(line: 433, column: 13, scope: !948)
!960 = !DILocation(line: 433, column: 11, scope: !948)
!961 = !DILocation(line: 431, column: 2, scope: !962)
!962 = !DILexicalBlockFile(scope: !948, file: !365, discriminator: 2)
!963 = distinct !{!963, !964}
!964 = !DILocation(line: 431, column: 2, scope: !934)
!965 = !DILocation(line: 437, column: 6, scope: !966)
!966 = distinct !DILexicalBlock(scope: !934, file: !365, line: 437, column: 6)
!967 = !DILocation(line: 437, column: 10, scope: !966)
!968 = !DILocation(line: 437, column: 6, scope: !934)
!969 = !DILocation(line: 438, column: 25, scope: !966)
!970 = !DILocation(line: 438, column: 31, scope: !966)
!971 = !DILocation(line: 438, column: 10, scope: !966)
!972 = !DILocation(line: 438, column: 8, scope: !966)
!973 = !DILocation(line: 438, column: 3, scope: !966)
!974 = !DILocation(line: 440, column: 36, scope: !975)
!975 = distinct !DILexicalBlock(scope: !934, file: !365, line: 440, column: 2)
!976 = !DILocation(line: 440, column: 13, scope: !975)
!977 = !DILocation(line: 440, column: 11, scope: !975)
!978 = !DILocation(line: 440, column: 7, scope: !975)
!979 = !DILocation(line: 441, column: 7, scope: !980)
!980 = distinct !DILexicalBlock(scope: !975, file: !365, line: 440, column: 2)
!981 = !DILocation(line: 441, column: 11, scope: !980)
!982 = !DILocation(line: 440, column: 2, scope: !983)
!983 = !DILexicalBlockFile(scope: !975, file: !365, discriminator: 1)
!984 = !DILocation(line: 443, column: 25, scope: !985)
!985 = distinct !DILexicalBlock(scope: !980, file: !365, line: 442, column: 47)
!986 = !DILocation(line: 443, column: 31, scope: !985)
!987 = !DILocation(line: 443, column: 10, scope: !985)
!988 = !DILocation(line: 443, column: 8, scope: !985)
!989 = !DILocation(line: 444, column: 2, scope: !985)
!990 = !DILocation(line: 442, column: 36, scope: !980)
!991 = !DILocation(line: 442, column: 13, scope: !980)
!992 = !DILocation(line: 442, column: 11, scope: !980)
!993 = !DILocation(line: 440, column: 2, scope: !994)
!994 = !DILexicalBlockFile(scope: !980, file: !365, discriminator: 2)
!995 = distinct !{!995, !996}
!996 = !DILocation(line: 440, column: 2, scope: !934)
!997 = !DILocation(line: 446, column: 9, scope: !934)
!998 = !DILocation(line: 446, column: 2, scope: !934)
!999 = distinct !DISubprogram(name: "mainwindow_resize", scope: !365, file: !365, line: 125, type: !1000, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, !127, !140, !140}
!1002 = !DILocalVariable(name: "window", arg: 1, scope: !999, file: !365, line: 125, type: !127)
!1003 = !DILocation(line: 125, column: 48, scope: !999)
!1004 = !DILocalVariable(name: "xdiff", arg: 2, scope: !999, file: !365, line: 125, type: !140)
!1005 = !DILocation(line: 125, column: 60, scope: !999)
!1006 = !DILocalVariable(name: "ydiff", arg: 3, scope: !999, file: !365, line: 125, type: !140)
!1007 = !DILocation(line: 125, column: 71, scope: !999)
!1008 = !DILocalVariable(name: "height", scope: !999, file: !365, line: 127, type: !140)
!1009 = !DILocation(line: 127, column: 6, scope: !999)
!1010 = !DILocalVariable(name: "width", scope: !999, file: !365, line: 127, type: !140)
!1011 = !DILocation(line: 127, column: 14, scope: !999)
!1012 = !DILocation(line: 128, column: 6, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !999, file: !365, line: 128, column: 6)
!1014 = !DILocation(line: 128, column: 15, scope: !1013)
!1015 = !DILocation(line: 128, column: 19, scope: !1016)
!1016 = !DILexicalBlockFile(scope: !1013, file: !365, discriminator: 1)
!1017 = !DILocation(line: 128, column: 25, scope: !1016)
!1018 = !DILocation(line: 128, column: 30, scope: !1016)
!1019 = !DILocation(line: 128, column: 33, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !1013, file: !365, discriminator: 2)
!1021 = !DILocation(line: 128, column: 39, scope: !1020)
!1022 = !DILocation(line: 128, column: 6, scope: !1020)
!1023 = !DILocation(line: 129, column: 3, scope: !1013)
!1024 = !DILocation(line: 131, column: 11, scope: !999)
!1025 = !DILocation(line: 131, column: 19, scope: !999)
!1026 = !DILocation(line: 131, column: 28, scope: !999)
!1027 = !DILocation(line: 131, column: 26, scope: !999)
!1028 = !DILocation(line: 131, column: 9, scope: !999)
!1029 = !DILocation(line: 132, column: 10, scope: !999)
!1030 = !DILocation(line: 132, column: 18, scope: !999)
!1031 = !DILocation(line: 132, column: 26, scope: !999)
!1032 = !DILocation(line: 132, column: 24, scope: !999)
!1033 = !DILocation(line: 132, column: 8, scope: !999)
!1034 = !DILocation(line: 133, column: 18, scope: !999)
!1035 = !DILocation(line: 133, column: 26, scope: !999)
!1036 = !DILocation(line: 133, column: 38, scope: !999)
!1037 = !DILocation(line: 133, column: 46, scope: !999)
!1038 = !DILocation(line: 133, column: 37, scope: !999)
!1039 = !DILocation(line: 133, column: 58, scope: !999)
!1040 = !DILocation(line: 133, column: 2, scope: !999)
!1041 = !DILocation(line: 133, column: 10, scope: !999)
!1042 = !DILocation(line: 133, column: 16, scope: !999)
!1043 = !DILocation(line: 134, column: 19, scope: !999)
!1044 = !DILocation(line: 134, column: 27, scope: !999)
!1045 = !DILocation(line: 134, column: 37, scope: !999)
!1046 = !DILocation(line: 134, column: 45, scope: !999)
!1047 = !DILocation(line: 134, column: 36, scope: !999)
!1048 = !DILocation(line: 134, column: 55, scope: !999)
!1049 = !DILocation(line: 134, column: 2, scope: !999)
!1050 = !DILocation(line: 134, column: 10, scope: !999)
!1051 = !DILocation(line: 134, column: 17, scope: !999)
!1052 = !DILocation(line: 135, column: 6, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !999, file: !365, line: 135, column: 6)
!1054 = !DILocation(line: 135, column: 16, scope: !1053)
!1055 = !DILocation(line: 135, column: 24, scope: !1053)
!1056 = !DILocation(line: 135, column: 13, scope: !1053)
!1057 = !DILocation(line: 135, column: 31, scope: !1053)
!1058 = !DILocation(line: 135, column: 34, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1053, file: !365, discriminator: 1)
!1060 = !DILocation(line: 135, column: 43, scope: !1059)
!1061 = !DILocation(line: 135, column: 51, scope: !1059)
!1062 = !DILocation(line: 135, column: 40, scope: !1059)
!1063 = !DILocation(line: 135, column: 6, scope: !1059)
!1064 = !DILocation(line: 136, column: 101, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1053, file: !365, line: 135, column: 58)
!1066 = !DILocation(line: 136, column: 109, scope: !1065)
!1067 = !DILocation(line: 136, column: 117, scope: !1065)
!1068 = !DILocation(line: 136, column: 124, scope: !1065)
!1069 = !DILocation(line: 136, column: 131, scope: !1065)
!1070 = !DILocation(line: 136, column: 139, scope: !1065)
!1071 = !DILocation(line: 136, column: 147, scope: !1065)
!1072 = !DILocation(line: 136, column: 3, scope: !1065)
!1073 = !DILocation(line: 138, column: 2, scope: !1065)
!1074 = !DILocation(line: 139, column: 2, scope: !999)
!1075 = !DILocation(line: 139, column: 10, scope: !999)
!1076 = !DILocation(line: 139, column: 21, scope: !999)
!1077 = !DILocation(line: 140, column: 1, scope: !999)
!1078 = !DILocation(line: 140, column: 1, scope: !1079)
!1079 = !DILexicalBlockFile(scope: !999, file: !365, discriminator: 1)
!1080 = distinct !DISubprogram(name: "find_window_with_room_right", scope: !365, file: !365, line: 77, type: !1081, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!127}
!1083 = !DILocalVariable(name: "biggest_rec", scope: !1080, file: !365, line: 79, type: !127)
!1084 = !DILocation(line: 79, column: 19, scope: !1080)
!1085 = !DILocalVariable(name: "tmp", scope: !1080, file: !365, line: 80, type: !147)
!1086 = !DILocation(line: 80, column: 10, scope: !1080)
!1087 = !DILocalVariable(name: "space", scope: !1080, file: !365, line: 81, type: !140)
!1088 = !DILocation(line: 81, column: 6, scope: !1080)
!1089 = !DILocalVariable(name: "biggest", scope: !1080, file: !365, line: 81, type: !140)
!1090 = !DILocation(line: 81, column: 13, scope: !1080)
!1091 = !DILocation(line: 83, column: 10, scope: !1080)
!1092 = !DILocation(line: 83, column: 27, scope: !1080)
!1093 = !DILocation(line: 84, column: 13, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1080, file: !365, line: 84, column: 2)
!1095 = !DILocation(line: 84, column: 11, scope: !1094)
!1096 = !DILocation(line: 84, column: 7, scope: !1094)
!1097 = !DILocation(line: 84, column: 26, scope: !1098)
!1098 = !DILexicalBlockFile(scope: !1099, file: !365, discriminator: 1)
!1099 = distinct !DILexicalBlock(scope: !1094, file: !365, line: 84, column: 2)
!1100 = !DILocation(line: 84, column: 30, scope: !1098)
!1101 = !DILocation(line: 84, column: 2, scope: !1098)
!1102 = !DILocalVariable(name: "rec", scope: !1103, file: !365, line: 85, type: !127)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !365, line: 84, column: 55)
!1104 = !DILocation(line: 85, column: 20, scope: !1103)
!1105 = !DILocation(line: 85, column: 26, scope: !1103)
!1106 = !DILocation(line: 85, column: 31, scope: !1103)
!1107 = !DILocation(line: 87, column: 13, scope: !1103)
!1108 = !DILocation(line: 87, column: 19, scope: !1103)
!1109 = !DILocation(line: 87, column: 26, scope: !1103)
!1110 = !DILocation(line: 87, column: 32, scope: !1103)
!1111 = !DILocation(line: 87, column: 24, scope: !1103)
!1112 = !DILocation(line: 87, column: 9, scope: !1103)
!1113 = !DILocation(line: 88, column: 7, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1103, file: !365, line: 88, column: 7)
!1115 = !DILocation(line: 88, column: 13, scope: !1114)
!1116 = !DILocation(line: 88, column: 23, scope: !1114)
!1117 = !DILocation(line: 88, column: 26, scope: !1118)
!1118 = !DILexicalBlockFile(scope: !1114, file: !365, discriminator: 1)
!1119 = !DILocation(line: 88, column: 34, scope: !1118)
!1120 = !DILocation(line: 88, column: 32, scope: !1118)
!1121 = !DILocation(line: 88, column: 7, scope: !1118)
!1122 = !DILocation(line: 89, column: 14, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1114, file: !365, line: 88, column: 43)
!1124 = !DILocation(line: 89, column: 12, scope: !1123)
!1125 = !DILocation(line: 90, column: 18, scope: !1123)
!1126 = !DILocation(line: 90, column: 16, scope: !1123)
!1127 = !DILocation(line: 91, column: 3, scope: !1123)
!1128 = !DILocation(line: 92, column: 2, scope: !1103)
!1129 = !DILocation(line: 84, column: 44, scope: !1130)
!1130 = !DILexicalBlockFile(scope: !1099, file: !365, discriminator: 2)
!1131 = !DILocation(line: 84, column: 49, scope: !1130)
!1132 = !DILocation(line: 84, column: 42, scope: !1130)
!1133 = !DILocation(line: 84, column: 2, scope: !1130)
!1134 = distinct !{!1134, !1135}
!1135 = !DILocation(line: 84, column: 2, scope: !1080)
!1136 = !DILocation(line: 94, column: 9, scope: !1080)
!1137 = !DILocation(line: 94, column: 2, scope: !1080)
!1138 = distinct !DISubprogram(name: "mainwindows_find_left", scope: !365, file: !365, line: 370, type: !1139, isLocal: true, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!127, !127, !140}
!1141 = !DILocalVariable(name: "window", arg: 1, scope: !1138, file: !365, line: 370, type: !127)
!1142 = !DILocation(line: 370, column: 64, scope: !1138)
!1143 = !DILocalVariable(name: "find_last", arg: 2, scope: !1138, file: !365, line: 370, type: !140)
!1144 = !DILocation(line: 370, column: 76, scope: !1138)
!1145 = !DILocalVariable(name: "first_line", scope: !1138, file: !365, line: 372, type: !140)
!1146 = !DILocation(line: 372, column: 6, scope: !1138)
!1147 = !DILocalVariable(name: "last_line", scope: !1138, file: !365, line: 372, type: !140)
!1148 = !DILocation(line: 372, column: 18, scope: !1138)
!1149 = !DILocalVariable(name: "first_column", scope: !1138, file: !365, line: 372, type: !140)
!1150 = !DILocation(line: 372, column: 29, scope: !1138)
!1151 = !DILocalVariable(name: "best", scope: !1138, file: !365, line: 373, type: !127)
!1152 = !DILocation(line: 373, column: 19, scope: !1138)
!1153 = !DILocalVariable(name: "tmp", scope: !1138, file: !365, line: 374, type: !147)
!1154 = !DILocation(line: 374, column: 10, scope: !1138)
!1155 = !DILocation(line: 376, column: 6, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1138, file: !365, line: 376, column: 6)
!1157 = !DILocation(line: 376, column: 13, scope: !1156)
!1158 = !DILocation(line: 376, column: 6, scope: !1138)
!1159 = !DILocation(line: 377, column: 16, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1156, file: !365, line: 376, column: 21)
!1161 = !DILocation(line: 377, column: 24, scope: !1160)
!1162 = !DILocation(line: 377, column: 14, scope: !1160)
!1163 = !DILocation(line: 378, column: 15, scope: !1160)
!1164 = !DILocation(line: 378, column: 23, scope: !1160)
!1165 = !DILocation(line: 378, column: 13, scope: !1160)
!1166 = !DILocation(line: 379, column: 18, scope: !1160)
!1167 = !DILocation(line: 379, column: 26, scope: !1160)
!1168 = !DILocation(line: 379, column: 16, scope: !1160)
!1169 = !DILocation(line: 380, column: 2, scope: !1160)
!1170 = !DILocation(line: 381, column: 28, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1156, file: !365, line: 380, column: 9)
!1172 = !DILocation(line: 381, column: 26, scope: !1171)
!1173 = !DILocation(line: 381, column: 14, scope: !1171)
!1174 = !DILocation(line: 382, column: 18, scope: !1171)
!1175 = !DILocation(line: 382, column: 16, scope: !1171)
!1176 = !DILocation(line: 385, column: 6, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1138, file: !365, line: 385, column: 6)
!1178 = !DILocation(line: 385, column: 6, scope: !1138)
!1179 = !DILocation(line: 386, column: 18, scope: !1177)
!1180 = !DILocation(line: 386, column: 16, scope: !1177)
!1181 = !DILocation(line: 386, column: 3, scope: !1177)
!1182 = !DILocation(line: 388, column: 7, scope: !1138)
!1183 = !DILocation(line: 389, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1138, file: !365, line: 389, column: 2)
!1185 = !DILocation(line: 389, column: 11, scope: !1184)
!1186 = !DILocation(line: 389, column: 7, scope: !1184)
!1187 = !DILocation(line: 389, column: 26, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1189, file: !365, discriminator: 1)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !365, line: 389, column: 2)
!1190 = !DILocation(line: 389, column: 30, scope: !1188)
!1191 = !DILocation(line: 389, column: 2, scope: !1188)
!1192 = !DILocalVariable(name: "rec", scope: !1193, file: !365, line: 390, type: !127)
!1193 = distinct !DILexicalBlock(scope: !1189, file: !365, line: 389, column: 55)
!1194 = !DILocation(line: 390, column: 20, scope: !1193)
!1195 = !DILocation(line: 390, column: 26, scope: !1193)
!1196 = !DILocation(line: 390, column: 31, scope: !1193)
!1197 = !DILocation(line: 392, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1193, file: !365, line: 392, column: 7)
!1199 = !DILocation(line: 392, column: 12, scope: !1198)
!1200 = !DILocation(line: 392, column: 26, scope: !1198)
!1201 = !DILocation(line: 392, column: 23, scope: !1198)
!1202 = !DILocation(line: 392, column: 37, scope: !1198)
!1203 = !DILocation(line: 393, column: 7, scope: !1198)
!1204 = !DILocation(line: 393, column: 12, scope: !1198)
!1205 = !DILocation(line: 393, column: 25, scope: !1198)
!1206 = !DILocation(line: 393, column: 22, scope: !1198)
!1207 = !DILocation(line: 393, column: 35, scope: !1198)
!1208 = !DILocation(line: 394, column: 7, scope: !1198)
!1209 = !DILocation(line: 394, column: 12, scope: !1198)
!1210 = !DILocation(line: 394, column: 26, scope: !1198)
!1211 = !DILocation(line: 394, column: 24, scope: !1198)
!1212 = !DILocation(line: 394, column: 39, scope: !1198)
!1213 = !DILocation(line: 395, column: 8, scope: !1198)
!1214 = !DILocation(line: 395, column: 13, scope: !1198)
!1215 = !DILocation(line: 395, column: 20, scope: !1198)
!1216 = !DILocation(line: 395, column: 23, scope: !1217)
!1217 = !DILexicalBlockFile(scope: !1198, file: !365, discriminator: 1)
!1218 = !DILocation(line: 395, column: 28, scope: !1217)
!1219 = !DILocation(line: 395, column: 42, scope: !1217)
!1220 = !DILocation(line: 395, column: 48, scope: !1217)
!1221 = !DILocation(line: 395, column: 40, scope: !1217)
!1222 = !DILocation(line: 392, column: 7, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1193, file: !365, discriminator: 1)
!1224 = !DILocation(line: 396, column: 11, scope: !1198)
!1225 = !DILocation(line: 396, column: 9, scope: !1198)
!1226 = !DILocation(line: 396, column: 4, scope: !1198)
!1227 = !DILocation(line: 397, column: 2, scope: !1193)
!1228 = !DILocation(line: 389, column: 44, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1189, file: !365, discriminator: 2)
!1230 = !DILocation(line: 389, column: 49, scope: !1229)
!1231 = !DILocation(line: 389, column: 42, scope: !1229)
!1232 = !DILocation(line: 389, column: 2, scope: !1229)
!1233 = distinct !{!1233, !1234}
!1234 = !DILocation(line: 389, column: 2, scope: !1138)
!1235 = !DILocation(line: 399, column: 9, scope: !1138)
!1236 = !DILocation(line: 399, column: 2, scope: !1138)
!1237 = distinct !DISubprogram(name: "mainwindows_find_right", scope: !365, file: !365, line: 305, type: !1139, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1238 = !DILocalVariable(name: "window", arg: 1, scope: !1237, file: !365, line: 305, type: !127)
!1239 = !DILocation(line: 305, column: 65, scope: !1237)
!1240 = !DILocalVariable(name: "find_first", arg: 2, scope: !1237, file: !365, line: 305, type: !140)
!1241 = !DILocation(line: 305, column: 77, scope: !1237)
!1242 = !DILocalVariable(name: "first_line", scope: !1237, file: !365, line: 307, type: !140)
!1243 = !DILocation(line: 307, column: 6, scope: !1237)
!1244 = !DILocalVariable(name: "last_line", scope: !1237, file: !365, line: 307, type: !140)
!1245 = !DILocation(line: 307, column: 18, scope: !1237)
!1246 = !DILocalVariable(name: "last_column", scope: !1237, file: !365, line: 307, type: !140)
!1247 = !DILocation(line: 307, column: 29, scope: !1237)
!1248 = !DILocalVariable(name: "best", scope: !1237, file: !365, line: 308, type: !127)
!1249 = !DILocation(line: 308, column: 19, scope: !1237)
!1250 = !DILocalVariable(name: "tmp", scope: !1237, file: !365, line: 309, type: !147)
!1251 = !DILocation(line: 309, column: 10, scope: !1237)
!1252 = !DILocation(line: 311, column: 6, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1237, file: !365, line: 311, column: 6)
!1254 = !DILocation(line: 311, column: 13, scope: !1253)
!1255 = !DILocation(line: 311, column: 6, scope: !1237)
!1256 = !DILocation(line: 312, column: 16, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1253, file: !365, line: 311, column: 21)
!1258 = !DILocation(line: 312, column: 24, scope: !1257)
!1259 = !DILocation(line: 312, column: 14, scope: !1257)
!1260 = !DILocation(line: 313, column: 15, scope: !1257)
!1261 = !DILocation(line: 313, column: 23, scope: !1257)
!1262 = !DILocation(line: 313, column: 13, scope: !1257)
!1263 = !DILocation(line: 314, column: 17, scope: !1257)
!1264 = !DILocation(line: 314, column: 25, scope: !1257)
!1265 = !DILocation(line: 314, column: 15, scope: !1257)
!1266 = !DILocation(line: 315, column: 2, scope: !1257)
!1267 = !DILocation(line: 316, column: 40, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1253, file: !365, line: 315, column: 9)
!1269 = !DILocation(line: 316, column: 26, scope: !1268)
!1270 = !DILocation(line: 316, column: 14, scope: !1268)
!1271 = !DILocation(line: 319, column: 6, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1237, file: !365, line: 319, column: 6)
!1273 = !DILocation(line: 319, column: 6, scope: !1237)
!1274 = !DILocation(line: 320, column: 15, scope: !1272)
!1275 = !DILocation(line: 320, column: 3, scope: !1272)
!1276 = !DILocation(line: 322, column: 7, scope: !1237)
!1277 = !DILocation(line: 323, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1237, file: !365, line: 323, column: 2)
!1279 = !DILocation(line: 323, column: 11, scope: !1278)
!1280 = !DILocation(line: 323, column: 7, scope: !1278)
!1281 = !DILocation(line: 323, column: 26, scope: !1282)
!1282 = !DILexicalBlockFile(scope: !1283, file: !365, discriminator: 1)
!1283 = distinct !DILexicalBlock(scope: !1278, file: !365, line: 323, column: 2)
!1284 = !DILocation(line: 323, column: 30, scope: !1282)
!1285 = !DILocation(line: 323, column: 2, scope: !1282)
!1286 = !DILocalVariable(name: "rec", scope: !1287, file: !365, line: 324, type: !127)
!1287 = distinct !DILexicalBlock(scope: !1283, file: !365, line: 323, column: 55)
!1288 = !DILocation(line: 324, column: 20, scope: !1287)
!1289 = !DILocation(line: 324, column: 26, scope: !1287)
!1290 = !DILocation(line: 324, column: 31, scope: !1287)
!1291 = !DILocation(line: 326, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1287, file: !365, line: 326, column: 7)
!1293 = !DILocation(line: 326, column: 12, scope: !1292)
!1294 = !DILocation(line: 326, column: 26, scope: !1292)
!1295 = !DILocation(line: 326, column: 23, scope: !1292)
!1296 = !DILocation(line: 326, column: 37, scope: !1292)
!1297 = !DILocation(line: 327, column: 7, scope: !1292)
!1298 = !DILocation(line: 327, column: 12, scope: !1292)
!1299 = !DILocation(line: 327, column: 25, scope: !1292)
!1300 = !DILocation(line: 327, column: 22, scope: !1292)
!1301 = !DILocation(line: 327, column: 35, scope: !1292)
!1302 = !DILocation(line: 328, column: 7, scope: !1292)
!1303 = !DILocation(line: 328, column: 12, scope: !1292)
!1304 = !DILocation(line: 328, column: 27, scope: !1292)
!1305 = !DILocation(line: 328, column: 25, scope: !1292)
!1306 = !DILocation(line: 328, column: 39, scope: !1292)
!1307 = !DILocation(line: 329, column: 8, scope: !1292)
!1308 = !DILocation(line: 329, column: 13, scope: !1292)
!1309 = !DILocation(line: 329, column: 20, scope: !1292)
!1310 = !DILocation(line: 329, column: 23, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1292, file: !365, discriminator: 1)
!1312 = !DILocation(line: 329, column: 28, scope: !1311)
!1313 = !DILocation(line: 329, column: 43, scope: !1311)
!1314 = !DILocation(line: 329, column: 49, scope: !1311)
!1315 = !DILocation(line: 329, column: 41, scope: !1311)
!1316 = !DILocation(line: 326, column: 7, scope: !1317)
!1317 = !DILexicalBlockFile(scope: !1287, file: !365, discriminator: 1)
!1318 = !DILocation(line: 330, column: 11, scope: !1292)
!1319 = !DILocation(line: 330, column: 9, scope: !1292)
!1320 = !DILocation(line: 330, column: 4, scope: !1292)
!1321 = !DILocation(line: 331, column: 2, scope: !1287)
!1322 = !DILocation(line: 323, column: 44, scope: !1323)
!1323 = !DILexicalBlockFile(scope: !1283, file: !365, discriminator: 2)
!1324 = !DILocation(line: 323, column: 49, scope: !1323)
!1325 = !DILocation(line: 323, column: 42, scope: !1323)
!1326 = !DILocation(line: 323, column: 2, scope: !1323)
!1327 = distinct !{!1327, !1328}
!1328 = !DILocation(line: 323, column: 2, scope: !1237)
!1329 = !DILocation(line: 333, column: 9, scope: !1237)
!1330 = !DILocation(line: 333, column: 2, scope: !1237)
!1331 = distinct !DISubprogram(name: "gui_windows_remove_parent", scope: !365, file: !365, line: 509, type: !535, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1332 = !DILocalVariable(name: "window", arg: 1, scope: !1331, file: !365, line: 509, type: !127)
!1333 = !DILocation(line: 509, column: 56, scope: !1331)
!1334 = !DILocalVariable(name: "new_parent", scope: !1331, file: !365, line: 511, type: !127)
!1335 = !DILocation(line: 511, column: 26, scope: !1331)
!1336 = !DILocalVariable(name: "tmp", scope: !1331, file: !365, line: 512, type: !147)
!1337 = !DILocation(line: 512, column: 10, scope: !1331)
!1338 = !DILocation(line: 514, column: 22, scope: !1331)
!1339 = !DILocation(line: 514, column: 35, scope: !1331)
!1340 = !DILocation(line: 514, column: 20, scope: !1331)
!1341 = !DILocation(line: 515, column: 13, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1331, file: !365, line: 515, column: 2)
!1343 = !DILocation(line: 515, column: 11, scope: !1342)
!1344 = !DILocation(line: 515, column: 7, scope: !1342)
!1345 = !DILocation(line: 515, column: 22, scope: !1346)
!1346 = !DILexicalBlockFile(scope: !1347, file: !365, discriminator: 1)
!1347 = distinct !DILexicalBlock(scope: !1342, file: !365, line: 515, column: 2)
!1348 = !DILocation(line: 515, column: 26, scope: !1346)
!1349 = !DILocation(line: 515, column: 2, scope: !1346)
!1350 = !DILocalVariable(name: "rec", scope: !1351, file: !365, line: 516, type: !133)
!1351 = distinct !DILexicalBlock(scope: !1347, file: !365, line: 515, column: 51)
!1352 = !DILocation(line: 516, column: 15, scope: !1351)
!1353 = !DILocation(line: 516, column: 21, scope: !1351)
!1354 = !DILocation(line: 516, column: 26, scope: !1351)
!1355 = !DILocation(line: 518, column: 7, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !365, line: 518, column: 7)
!1357 = !DILocation(line: 518, column: 12, scope: !1356)
!1358 = !DILocation(line: 518, column: 21, scope: !1356)
!1359 = !DILocation(line: 518, column: 28, scope: !1356)
!1360 = !DILocation(line: 518, column: 54, scope: !1361)
!1361 = !DILexicalBlockFile(scope: !1356, file: !365, discriminator: 1)
!1362 = !DILocation(line: 518, column: 60, scope: !1361)
!1363 = !DILocation(line: 518, column: 33, scope: !1361)
!1364 = !DILocation(line: 518, column: 72, scope: !1361)
!1365 = !DILocation(line: 518, column: 83, scope: !1361)
!1366 = !DILocation(line: 518, column: 80, scope: !1361)
!1367 = !DILocation(line: 518, column: 7, scope: !1361)
!1368 = !DILocation(line: 519, column: 45, scope: !1356)
!1369 = !DILocation(line: 519, column: 50, scope: !1356)
!1370 = !DILocation(line: 519, column: 25, scope: !1356)
!1371 = !DILocation(line: 520, column: 2, scope: !1351)
!1372 = !DILocation(line: 515, column: 40, scope: !1373)
!1373 = !DILexicalBlockFile(scope: !1347, file: !365, discriminator: 2)
!1374 = !DILocation(line: 515, column: 45, scope: !1373)
!1375 = !DILocation(line: 515, column: 38, scope: !1373)
!1376 = !DILocation(line: 515, column: 2, scope: !1373)
!1377 = distinct !{!1377, !1378}
!1378 = !DILocation(line: 515, column: 2, scope: !1331)
!1379 = !DILocation(line: 521, column: 1, scope: !1331)
!1380 = distinct !DISubprogram(name: "mainwindows_add_space", scope: !365, file: !365, line: 450, type: !535, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !380)
!1381 = !DILocalVariable(name: "destroy_win", arg: 1, scope: !1380, file: !365, line: 450, type: !127)
!1382 = !DILocation(line: 450, column: 52, scope: !1380)
!1383 = !DILocalVariable(name: "rec", scope: !1380, file: !365, line: 452, type: !127)
!1384 = !DILocation(line: 452, column: 19, scope: !1380)
!1385 = !DILocalVariable(name: "size", scope: !1380, file: !365, line: 453, type: !140)
!1386 = !DILocation(line: 453, column: 6, scope: !1380)
!1387 = !DILocalVariable(name: "rsize", scope: !1380, file: !365, line: 453, type: !140)
!1388 = !DILocation(line: 453, column: 12, scope: !1380)
!1389 = !DILocation(line: 455, column: 6, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1380, file: !365, line: 455, column: 6)
!1391 = !DILocation(line: 455, column: 19, scope: !1390)
!1392 = !DILocation(line: 455, column: 31, scope: !1390)
!1393 = !DILocation(line: 455, column: 44, scope: !1390)
!1394 = !DILocation(line: 455, column: 29, scope: !1390)
!1395 = !DILocation(line: 455, column: 6, scope: !1380)
!1396 = !DILocation(line: 456, column: 3, scope: !1390)
!1397 = !DILocation(line: 458, column: 6, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1380, file: !365, line: 458, column: 6)
!1399 = !DILocation(line: 458, column: 19, scope: !1398)
!1400 = !DILocation(line: 458, column: 33, scope: !1398)
!1401 = !DILocation(line: 458, column: 46, scope: !1398)
!1402 = !DILocation(line: 458, column: 31, scope: !1398)
!1403 = !DILocation(line: 458, column: 6, scope: !1380)
!1404 = !DILocation(line: 459, column: 3, scope: !1398)
!1405 = !DILocation(line: 461, column: 10, scope: !1380)
!1406 = !DILocation(line: 461, column: 23, scope: !1380)
!1407 = !DILocation(line: 461, column: 35, scope: !1380)
!1408 = !DILocation(line: 461, column: 48, scope: !1380)
!1409 = !DILocation(line: 461, column: 34, scope: !1380)
!1410 = !DILocation(line: 461, column: 60, scope: !1380)
!1411 = !DILocation(line: 461, column: 8, scope: !1380)
!1412 = !DILocation(line: 462, column: 30, scope: !1380)
!1413 = !DILocation(line: 462, column: 8, scope: !1380)
!1414 = !DILocation(line: 462, column: 6, scope: !1380)
!1415 = !DILocation(line: 463, column: 6, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1380, file: !365, line: 463, column: 6)
!1417 = !DILocation(line: 463, column: 10, scope: !1416)
!1418 = !DILocation(line: 463, column: 6, scope: !1380)
!1419 = !DILocation(line: 464, column: 22, scope: !1420)
!1420 = distinct !DILexicalBlock(scope: !1416, file: !365, line: 463, column: 18)
!1421 = !DILocation(line: 464, column: 35, scope: !1420)
!1422 = !DILocation(line: 464, column: 3, scope: !1420)
!1423 = !DILocation(line: 464, column: 8, scope: !1420)
