; ModuleID = './line164-dcc.o.i'
source_filename = "./line164-dcc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }

!39 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!40 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!41 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!42 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!43 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!44 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!45 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!46 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!47 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!48 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!49 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!50 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!51 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!52 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!53 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!54 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!55 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!56 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!57 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!58 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!59 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!60 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!61 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!62 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!63 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!64 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!65 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !67, line: 25, size: 32, align: 32, elements: !68)
!67 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!69 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!70 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!71 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!72 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!73 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!74 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!75 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!76 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!77 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!78 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!79 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!80 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!81 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!82 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!83 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!84 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!85 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!86 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!87 = !{!88, !89, !93, !95, !96, !99, !107, !114, !129, !448, !106, !438}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!95 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !97, line: 45, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !106}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !91, line: 50, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !91, line: 49, baseType: !105)
!105 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !91, line: 77, baseType: !88)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !108, line: 9, baseType: !109)
!108 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !112, !112, !112, !112, !112, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_DCC_REC", file: !116, line: 24, baseType: !117)
!116 = !DIFile(filename: "dcc-server.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SERVER_DCC_REC", file: !116, line: 12, size: 1728, align: 64, elements: !118)
!118 = !{!119, !121, !122, !128, !753, !754, !755, !756, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !120, line: 1, baseType: !105, size: 32, align: 32)
!120 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!121 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !117, file: !120, line: 2, baseType: !105, size: 32, align: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !117, file: !120, line: 3, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !124, line: 75, baseType: !125)
!124 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !126, line: 139, baseType: !127)
!126 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !117, file: !120, line: 5, baseType: !129, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !131, line: 6, baseType: !132)
!131 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !133, line: 42, size: 39168, align: 64, elements: !134)
!133 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!134 = !{!135, !137, !138, !139, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !410, !411, !415, !416, !417, !421, !426, !427, !428, !429, !430, !431, !432, !433, !440, !441, !442, !443, !444, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !750, !752}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !136, line: 3, baseType: !105, size: 32, align: 32)
!136 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !132, file: !136, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !132, file: !136, line: 6, baseType: !105, size: 32, align: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !132, file: !136, line: 8, baseType: !140, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !131, line: 5, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !133, line: 24, size: 2496, align: 64, elements: !143)
!143 = !{!144, !146, !147, !148, !150, !151, !152, !153, !154, !156, !157, !158, !159, !160, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !145, line: 3, baseType: !105, size: 32, align: 32)
!145 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !142, file: !145, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !142, file: !145, line: 6, baseType: !105, size: 32, align: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !142, file: !145, line: 9, baseType: !149, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !142, file: !145, line: 10, baseType: !105, size: 32, align: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !142, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !142, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !142, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !142, file: !145, line: 13, baseType: !155, size: 16, align: 16, offset: 448)
!155 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !142, file: !145, line: 14, baseType: !149, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !142, file: !145, line: 15, baseType: !149, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !142, file: !145, line: 16, baseType: !105, size: 32, align: 32, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !142, file: !145, line: 17, baseType: !149, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !142, file: !145, line: 19, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !163, line: 99, baseType: !164)
!163 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !165, line: 22, size: 160, align: 32, elements: !166)
!165 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !164, file: !165, line: 23, baseType: !155, size: 16, align: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !164, file: !165, line: 24, baseType: !169, size: 128, align: 32, offset: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !170, line: 211, size: 128, align: 32, elements: !171)
!170 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !169, file: !170, line: 220, baseType: !173, size: 128, align: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !170, line: 213, size: 128, align: 32, elements: !174)
!174 = !{!175, !182, !187}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !173, file: !170, line: 215, baseType: !176, size: 128, align: 8)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, align: 8, elements: !180)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !178, line: 48, baseType: !179)
!178 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!179 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !173, file: !170, line: 217, baseType: !183, size: 128, align: 16)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, align: 16, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !178, line: 49, baseType: !155)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !173, file: !170, line: 218, baseType: !188, size: 128, align: 32)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 128, align: 32, elements: !190)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !178, line: 51, baseType: !98)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !142, file: !145, line: 19, baseType: !161, size: 64, align: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !142, file: !145, line: 21, baseType: !149, size: 64, align: 64, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !142, file: !145, line: 22, baseType: !149, size: 64, align: 64, offset: 960)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !142, file: !145, line: 23, baseType: !149, size: 64, align: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !142, file: !145, line: 24, baseType: !149, size: 64, align: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !142, file: !145, line: 26, baseType: !149, size: 64, align: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !142, file: !145, line: 27, baseType: !149, size: 64, align: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !142, file: !145, line: 28, baseType: !149, size: 64, align: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !142, file: !145, line: 29, baseType: !149, size: 64, align: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !142, file: !145, line: 30, baseType: !149, size: 64, align: 64, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !142, file: !145, line: 31, baseType: !149, size: 64, align: 64, offset: 1472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !142, file: !145, line: 32, baseType: !149, size: 64, align: 64, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !142, file: !145, line: 33, baseType: !149, size: 64, align: 64, offset: 1600)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !142, file: !145, line: 35, baseType: !206, size: 64, align: 64, offset: 1664)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !209)
!209 = !{!210, !211, !342, !343, !348, !349, !350, !351, !352, !361, !362, !363, !367, !368, !369, !370, !371, !372, !373, !374}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !208, file: !4, line: 100, baseType: !104, size: 32, align: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !208, file: !4, line: 101, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !215)
!215 = !{!216, !234, !240, !246, !250, !329, !333, !338}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !214, file: !4, line: 133, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !206, !89, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !97, line: 66, baseType: !95)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !226, line: 42, baseType: !227)
!226 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !226, line: 44, size: 128, align: 64, elements: !228)
!228 = !{!229, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !227, file: !226, line: 46, baseType: !230, size: 32, align: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !231, line: 36, baseType: !96)
!231 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!232 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !227, file: !226, line: 47, baseType: !104, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !227, file: !226, line: 48, baseType: !89, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !214, file: !4, line: 138, baseType: !235, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!220, !206, !238, !221, !222, !223}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !214, file: !4, line: 143, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!220, !206, !244, !245, !223}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !97, line: 51, baseType: !127)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !214, file: !4, line: 147, baseType: !247, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!220, !206, !223}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !214, file: !4, line: 149, baseType: !251, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!254, !206, !328}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !257)
!257 = !{!258, !259, !275, !304, !306, !310, !311, !312, !313, !321, !322, !323, !324}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !256, file: !16, line: 174, baseType: !106, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !256, file: !16, line: 175, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !263)
!263 = !{!264, !268, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !262, file: !16, line: 198, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !106}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !262, file: !16, line: 199, baseType: !265, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !262, file: !16, line: 200, baseType: !270, size: 64, align: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !106, !254, !273, !274}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !256, file: !16, line: 177, baseType: !276, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !280)
!280 = !{!281, !286, !290, !294, !298, !299}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !279, file: !16, line: 216, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!103, !254, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !279, file: !16, line: 218, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!103, !254}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !279, file: !16, line: 219, baseType: !291, size: 64, align: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!103, !254, !99, !106}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !279, file: !16, line: 222, baseType: !295, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !254}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !279, file: !16, line: 226, baseType: !99, size: 64, align: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !279, file: !16, line: 227, baseType: !300, size: 64, align: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !256, file: !16, line: 178, baseType: !305, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !91, line: 55, baseType: !98)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !256, file: !16, line: 180, baseType: !307, size: 64, align: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !309)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !256, file: !16, line: 182, baseType: !104, size: 32, align: 32, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !16, line: 183, baseType: !305, size: 32, align: 32, offset: 352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !256, file: !16, line: 184, baseType: !305, size: 32, align: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !256, file: !16, line: 186, baseType: !314, size: 64, align: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !316, line: 37, baseType: !317)
!316 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !316, line: 39, size: 128, align: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !316, line: 41, baseType: !106, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !316, line: 42, baseType: !314, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !16, line: 188, baseType: !254, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !16, line: 189, baseType: !254, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !256, file: !16, line: 191, baseType: !149, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !256, file: !16, line: 193, baseType: !325, size: 64, align: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !327)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !214, file: !4, line: 151, baseType: !330, size: 64, align: 64, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !206}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !214, file: !4, line: 152, baseType: !334, size: 64, align: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!220, !206, !337, !223}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !214, file: !4, line: 155, baseType: !339, size: 64, align: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!337, !206}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !208, file: !4, line: 103, baseType: !89, size: 64, align: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !208, file: !4, line: 104, baseType: !344, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !345, line: 77, baseType: !346)
!345 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !345, line: 77, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !208, file: !4, line: 105, baseType: !344, size: 64, align: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !208, file: !4, line: 106, baseType: !89, size: 64, align: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !208, file: !4, line: 107, baseType: !305, size: 32, align: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !208, file: !4, line: 109, baseType: !221, size: 64, align: 64, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !208, file: !4, line: 110, baseType: !353, size: 64, align: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !355, line: 39, baseType: !356)
!355 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !355, line: 41, size: 192, align: 64, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !356, file: !355, line: 43, baseType: !89, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !356, file: !355, line: 44, baseType: !221, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !356, file: !355, line: 45, baseType: !221, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !208, file: !4, line: 111, baseType: !353, size: 64, align: 64, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !208, file: !4, line: 112, baseType: !353, size: 64, align: 64, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !208, file: !4, line: 113, baseType: !364, size: 48, align: 8, offset: 704)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 48, align: 8, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 6)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !208, file: !4, line: 117, baseType: !305, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !208, file: !4, line: 118, baseType: !305, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !208, file: !4, line: 119, baseType: !305, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !208, file: !4, line: 120, baseType: !305, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !208, file: !4, line: 121, baseType: !305, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !208, file: !4, line: 122, baseType: !305, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !208, file: !4, line: 124, baseType: !106, size: 64, align: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !208, file: !4, line: 125, baseType: !106, size: 64, align: 64, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !142, file: !145, line: 38, baseType: !98, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !142, file: !145, line: 39, baseType: !98, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !142, file: !145, line: 40, baseType: !98, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !142, file: !145, line: 41, baseType: !98, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !142, file: !145, line: 42, baseType: !98, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !142, file: !145, line: 43, baseType: !98, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !142, file: !145, line: 44, baseType: !98, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !142, file: !145, line: 45, baseType: !98, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !142, file: !145, line: 46, baseType: !149, size: 64, align: 64, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !142, file: !145, line: 47, baseType: !149, size: 64, align: 64, offset: 1856)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !142, file: !133, line: 27, baseType: !149, size: 64, align: 64, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !142, file: !133, line: 28, baseType: !149, size: 64, align: 64, offset: 1984)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !142, file: !133, line: 30, baseType: !105, size: 32, align: 32, offset: 2048)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !142, file: !133, line: 31, baseType: !149, size: 64, align: 64, offset: 2112)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !142, file: !133, line: 32, baseType: !149, size: 64, align: 64, offset: 2176)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !142, file: !133, line: 34, baseType: !105, size: 32, align: 32, offset: 2240)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !142, file: !133, line: 35, baseType: !105, size: 32, align: 32, offset: 2272)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !142, file: !133, line: 36, baseType: !105, size: 32, align: 32, offset: 2304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !142, file: !133, line: 38, baseType: !105, size: 32, align: 32, offset: 2336)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !142, file: !133, line: 38, baseType: !105, size: 32, align: 32, offset: 2368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !142, file: !133, line: 38, baseType: !105, size: 32, align: 32, offset: 2400)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !142, file: !133, line: 38, baseType: !105, size: 32, align: 32, offset: 2432)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !132, file: !136, line: 9, baseType: !123, size: 64, align: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !132, file: !136, line: 10, baseType: !123, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !132, file: !136, line: 12, baseType: !149, size: 64, align: 64, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !132, file: !136, line: 13, baseType: !149, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !132, file: !136, line: 15, baseType: !98, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !132, file: !136, line: 16, baseType: !98, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !132, file: !136, line: 17, baseType: !98, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !132, file: !136, line: 18, baseType: !98, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !132, file: !136, line: 19, baseType: !98, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !132, file: !136, line: 21, baseType: !407, size: 64, align: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !163, line: 102, baseType: !409)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !163, line: 102, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !132, file: !136, line: 22, baseType: !105, size: 32, align: 32, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !132, file: !136, line: 25, baseType: !412, size: 128, align: 64, offset: 640)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 128, align: 64, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !132, file: !136, line: 26, baseType: !105, size: 32, align: 32, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !132, file: !136, line: 27, baseType: !105, size: 32, align: 32, offset: 800)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !132, file: !136, line: 29, baseType: !418, size: 64, align: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !163, line: 103, baseType: !420)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !163, line: 103, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !132, file: !136, line: 30, baseType: !422, size: 64, align: 64, offset: 896)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !424, line: 37, baseType: !425)
!424 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !424, line: 37, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !132, file: !136, line: 32, baseType: !149, size: 64, align: 64, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !132, file: !136, line: 33, baseType: !149, size: 64, align: 64, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !132, file: !136, line: 34, baseType: !149, size: 64, align: 64, offset: 1088)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !132, file: !136, line: 35, baseType: !98, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !132, file: !136, line: 36, baseType: !98, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !132, file: !136, line: 37, baseType: !98, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !132, file: !136, line: 38, baseType: !98, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !132, file: !136, line: 40, baseType: !434, size: 128, align: 64, offset: 1216)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !91, line: 504, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !91, line: 506, size: 128, align: 64, elements: !436)
!436 = !{!437, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !435, file: !91, line: 508, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !91, line: 48, baseType: !127)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !435, file: !91, line: 509, baseType: !438, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !132, file: !136, line: 41, baseType: !123, size: 64, align: 64, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !132, file: !136, line: 42, baseType: !105, size: 32, align: 32, offset: 1408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !132, file: !136, line: 44, baseType: !314, size: 64, align: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !132, file: !136, line: 45, baseType: !314, size: 64, align: 64, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !132, file: !136, line: 53, baseType: !445, size: 64, align: 64, offset: 1600)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448, !93, !105}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !163, line: 107, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !451, line: 30, size: 2240, align: 64, elements: !452)
!451 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!452 = !{!453, !454, !455, !456, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !532, !536, !540, !544, !549, !626, !633, !637}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !136, line: 3, baseType: !105, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !450, file: !136, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !450, file: !136, line: 6, baseType: !105, size: 32, align: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !450, file: !136, line: 8, baseType: !457, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !163, line: 113, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !451, line: 25, size: 1920, align: 64, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !459, file: !145, line: 3, baseType: !105, size: 32, align: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !459, file: !145, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !459, file: !145, line: 6, baseType: !105, size: 32, align: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !459, file: !145, line: 9, baseType: !149, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !459, file: !145, line: 10, baseType: !105, size: 32, align: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !459, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !459, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !459, file: !145, line: 11, baseType: !149, size: 64, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !459, file: !145, line: 13, baseType: !155, size: 16, align: 16, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !459, file: !145, line: 14, baseType: !149, size: 64, align: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !459, file: !145, line: 15, baseType: !149, size: 64, align: 64, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !459, file: !145, line: 16, baseType: !105, size: 32, align: 32, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !459, file: !145, line: 17, baseType: !149, size: 64, align: 64, offset: 704)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !459, file: !145, line: 19, baseType: !161, size: 64, align: 64, offset: 768)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !459, file: !145, line: 19, baseType: !161, size: 64, align: 64, offset: 832)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !459, file: !145, line: 21, baseType: !149, size: 64, align: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !459, file: !145, line: 22, baseType: !149, size: 64, align: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !459, file: !145, line: 23, baseType: !149, size: 64, align: 64, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !459, file: !145, line: 24, baseType: !149, size: 64, align: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !459, file: !145, line: 26, baseType: !149, size: 64, align: 64, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !459, file: !145, line: 27, baseType: !149, size: 64, align: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !459, file: !145, line: 28, baseType: !149, size: 64, align: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !459, file: !145, line: 29, baseType: !149, size: 64, align: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !459, file: !145, line: 30, baseType: !149, size: 64, align: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !459, file: !145, line: 31, baseType: !149, size: 64, align: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !459, file: !145, line: 32, baseType: !149, size: 64, align: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !459, file: !145, line: 33, baseType: !149, size: 64, align: 64, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !459, file: !145, line: 35, baseType: !206, size: 64, align: 64, offset: 1664)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !459, file: !145, line: 38, baseType: !98, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !459, file: !145, line: 39, baseType: !98, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !459, file: !145, line: 40, baseType: !98, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !459, file: !145, line: 41, baseType: !98, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !459, file: !145, line: 42, baseType: !98, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !459, file: !145, line: 43, baseType: !98, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !459, file: !145, line: 44, baseType: !98, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !459, file: !145, line: 45, baseType: !98, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !459, file: !145, line: 46, baseType: !149, size: 64, align: 64, offset: 1792)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !459, file: !145, line: 47, baseType: !149, size: 64, align: 64, offset: 1856)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !450, file: !136, line: 9, baseType: !123, size: 64, align: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !450, file: !136, line: 10, baseType: !123, size: 64, align: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !450, file: !136, line: 12, baseType: !149, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !450, file: !136, line: 13, baseType: !149, size: 64, align: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !450, file: !136, line: 15, baseType: !98, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !450, file: !136, line: 16, baseType: !98, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !450, file: !136, line: 17, baseType: !98, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !450, file: !136, line: 18, baseType: !98, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !450, file: !136, line: 19, baseType: !98, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !450, file: !136, line: 21, baseType: !407, size: 64, align: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !450, file: !136, line: 22, baseType: !105, size: 32, align: 32, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !450, file: !136, line: 25, baseType: !412, size: 128, align: 64, offset: 640)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !450, file: !136, line: 26, baseType: !105, size: 32, align: 32, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !450, file: !136, line: 27, baseType: !105, size: 32, align: 32, offset: 800)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !450, file: !136, line: 29, baseType: !418, size: 64, align: 64, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !450, file: !136, line: 30, baseType: !422, size: 64, align: 64, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !450, file: !136, line: 32, baseType: !149, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !450, file: !136, line: 33, baseType: !149, size: 64, align: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !450, file: !136, line: 34, baseType: !149, size: 64, align: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !450, file: !136, line: 35, baseType: !98, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !450, file: !136, line: 36, baseType: !98, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !450, file: !136, line: 37, baseType: !98, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !450, file: !136, line: 38, baseType: !98, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !450, file: !136, line: 40, baseType: !434, size: 128, align: 64, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !450, file: !136, line: 41, baseType: !123, size: 64, align: 64, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !450, file: !136, line: 42, baseType: !105, size: 32, align: 32, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !450, file: !136, line: 44, baseType: !314, size: 64, align: 64, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !450, file: !136, line: 45, baseType: !314, size: 64, align: 64, offset: 1536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !450, file: !136, line: 53, baseType: !445, size: 64, align: 64, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !450, file: !136, line: 55, baseType: !529, size: 64, align: 64, offset: 1664)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!105, !448, !92}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !450, file: !136, line: 57, baseType: !533, size: 64, align: 64, offset: 1728)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!105, !448, !93}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !450, file: !136, line: 60, baseType: !537, size: 64, align: 64, offset: 1792)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!93, !448}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !450, file: !136, line: 62, baseType: !541, size: 64, align: 64, offset: 1856)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !448, !93, !93, !105}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !450, file: !136, line: 65, baseType: !545, size: 64, align: 64, offset: 1920)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !448, !93, !93}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !450, file: !136, line: 69, baseType: !550, size: 64, align: 64, offset: 1984)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !448, !93}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !163, line: 109, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !556, line: 15, size: 1408, align: 64, elements: !557)
!556 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!557 = !{!558, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !576, !580, !582, !583, !584, !585, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !559, line: 3, baseType: !105, size: 32, align: 32)
!559 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !555, file: !559, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !555, file: !559, line: 5, baseType: !422, size: 64, align: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !555, file: !559, line: 7, baseType: !88, size: 64, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !555, file: !559, line: 8, baseType: !448, size: 64, align: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !555, file: !559, line: 9, baseType: !149, size: 64, align: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !559, line: 10, baseType: !149, size: 64, align: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !555, file: !559, line: 11, baseType: !123, size: 64, align: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !555, file: !559, line: 12, baseType: !105, size: 32, align: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !555, file: !559, line: 13, baseType: !149, size: 64, align: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !555, file: !559, line: 15, baseType: !570, size: 64, align: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !163, line: 108, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !163, line: 108, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !555, file: !559, line: 17, baseType: !577, size: 64, align: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!93, !573}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !555, file: !581, line: 5, baseType: !149, size: 64, align: 64, offset: 704)
!581 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!582 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !555, file: !581, line: 6, baseType: !149, size: 64, align: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !555, file: !581, line: 7, baseType: !123, size: 64, align: 64, offset: 832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !555, file: !581, line: 9, baseType: !422, size: 64, align: 64, offset: 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !555, file: !581, line: 10, baseType: !586, size: 64, align: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !163, line: 111, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !589, line: 13, size: 576, align: 64, elements: !590)
!589 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!590 = !{!591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !607, !608}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !592, line: 3, baseType: !105, size: 32, align: 32)
!592 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!593 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !588, file: !592, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !588, file: !592, line: 6, baseType: !123, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !588, file: !592, line: 8, baseType: !149, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !588, file: !592, line: 9, baseType: !149, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !588, file: !592, line: 10, baseType: !149, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !588, file: !592, line: 11, baseType: !105, size: 32, align: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !588, file: !592, line: 14, baseType: !98, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !588, file: !592, line: 15, baseType: !98, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !588, file: !592, line: 18, baseType: !98, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !588, file: !592, line: 19, baseType: !98, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !588, file: !592, line: 20, baseType: !98, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !588, file: !592, line: 21, baseType: !98, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !588, file: !592, line: 22, baseType: !606, size: 64, align: 8, offset: 360)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, align: 8, elements: !185)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !588, file: !592, line: 26, baseType: !88, size: 64, align: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !592, line: 28, baseType: !586, size: 64, align: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !555, file: !581, line: 12, baseType: !98, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !555, file: !581, line: 13, baseType: !149, size: 64, align: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !555, file: !581, line: 14, baseType: !105, size: 32, align: 32, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !555, file: !581, line: 15, baseType: !149, size: 64, align: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !555, file: !581, line: 17, baseType: !98, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !555, file: !581, line: 18, baseType: !98, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !555, file: !581, line: 19, baseType: !98, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !555, file: !581, line: 20, baseType: !98, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !555, file: !581, line: 22, baseType: !98, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !555, file: !581, line: 23, baseType: !98, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !555, file: !581, line: 24, baseType: !98, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !555, file: !581, line: 25, baseType: !98, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !555, file: !581, line: 26, baseType: !98, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !555, file: !581, line: 31, baseType: !623, size: 64, align: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!149, !553}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !450, file: !136, line: 70, baseType: !627, size: 64, align: 64, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!630, !448, !93}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !163, line: 110, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !163, line: 110, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !450, file: !136, line: 71, baseType: !634, size: 64, align: 64, offset: 2112)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!105, !93, !93}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !450, file: !136, line: 73, baseType: !634, size: 64, align: 64, offset: 2176)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !132, file: !136, line: 55, baseType: !529, size: 64, align: 64, offset: 1664)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !132, file: !136, line: 57, baseType: !533, size: 64, align: 64, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !132, file: !136, line: 60, baseType: !537, size: 64, align: 64, offset: 1792)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !132, file: !136, line: 62, baseType: !541, size: 64, align: 64, offset: 1856)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !132, file: !136, line: 65, baseType: !545, size: 64, align: 64, offset: 1920)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !132, file: !136, line: 69, baseType: !550, size: 64, align: 64, offset: 1984)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !132, file: !136, line: 70, baseType: !627, size: 64, align: 64, offset: 2048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !132, file: !136, line: 71, baseType: !634, size: 64, align: 64, offset: 2112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !132, file: !136, line: 73, baseType: !634, size: 64, align: 64, offset: 2176)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !132, file: !133, line: 46, baseType: !314, size: 64, align: 64, offset: 2240)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !132, file: !133, line: 47, baseType: !314, size: 64, align: 64, offset: 2304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !132, file: !133, line: 48, baseType: !650, size: 64, align: 64, offset: 2368)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !131, line: 8, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !131, line: 8, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !132, file: !133, line: 49, baseType: !314, size: 64, align: 64, offset: 2432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !132, file: !133, line: 51, baseType: !149, size: 64, align: 64, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !132, file: !133, line: 53, baseType: !149, size: 64, align: 64, offset: 2560)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !132, file: !133, line: 54, baseType: !149, size: 64, align: 64, offset: 2624)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !132, file: !133, line: 55, baseType: !149, size: 64, align: 64, offset: 2688)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !132, file: !133, line: 56, baseType: !149, size: 64, align: 64, offset: 2752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !132, file: !133, line: 57, baseType: !105, size: 32, align: 32, offset: 2816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !132, file: !133, line: 59, baseType: !98, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !132, file: !133, line: 60, baseType: !98, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !132, file: !133, line: 62, baseType: !98, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !132, file: !133, line: 63, baseType: !98, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !132, file: !133, line: 64, baseType: !98, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !132, file: !133, line: 65, baseType: !98, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !132, file: !133, line: 66, baseType: !98, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !132, file: !133, line: 67, baseType: !98, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !132, file: !133, line: 68, baseType: !98, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !132, file: !133, line: 69, baseType: !98, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !132, file: !133, line: 70, baseType: !98, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !132, file: !133, line: 71, baseType: !98, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !132, file: !133, line: 72, baseType: !98, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !132, file: !133, line: 74, baseType: !105, size: 32, align: 32, offset: 2880)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !132, file: !133, line: 75, baseType: !105, size: 32, align: 32, offset: 2912)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !132, file: !133, line: 76, baseType: !105, size: 32, align: 32, offset: 2944)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !132, file: !133, line: 77, baseType: !105, size: 32, align: 32, offset: 2976)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !132, file: !133, line: 79, baseType: !422, size: 64, align: 64, offset: 3008)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !132, file: !133, line: 80, baseType: !314, size: 64, align: 64, offset: 3072)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !132, file: !133, line: 81, baseType: !314, size: 64, align: 64, offset: 3136)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !132, file: !133, line: 83, baseType: !353, size: 64, align: 64, offset: 3200)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !132, file: !133, line: 84, baseType: !305, size: 32, align: 32, offset: 3264)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !132, file: !133, line: 87, baseType: !105, size: 32, align: 32, offset: 3296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !132, file: !133, line: 91, baseType: !314, size: 64, align: 64, offset: 3328)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !132, file: !133, line: 92, baseType: !434, size: 128, align: 64, offset: 3392)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !132, file: !133, line: 93, baseType: !434, size: 128, align: 64, offset: 3520)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !132, file: !133, line: 95, baseType: !105, size: 32, align: 32, offset: 3648)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !132, file: !133, line: 96, baseType: !105, size: 32, align: 32, offset: 3680)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !132, file: !133, line: 97, baseType: !105, size: 32, align: 32, offset: 3712)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !132, file: !133, line: 100, baseType: !314, size: 64, align: 64, offset: 3776)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !132, file: !133, line: 103, baseType: !314, size: 64, align: 64, offset: 3840)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !132, file: !133, line: 106, baseType: !314, size: 64, align: 64, offset: 3904)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !132, file: !133, line: 108, baseType: !422, size: 64, align: 64, offset: 3968)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !132, file: !133, line: 109, baseType: !314, size: 64, align: 64, offset: 4032)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !132, file: !133, line: 111, baseType: !314, size: 64, align: 64, offset: 4096)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !132, file: !133, line: 114, baseType: !88, size: 64, align: 64, offset: 4160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !132, file: !133, line: 116, baseType: !422, size: 64, align: 64, offset: 4224)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !132, file: !133, line: 117, baseType: !698, size: 32768, align: 64, offset: 4288)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 32768, align: 64, elements: !748)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !700, line: 10, size: 128, align: 64, elements: !701)
!700 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!701 = !{!702, !747}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !699, file: !700, line: 11, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !700, line: 7, baseType: !705)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !707, !93, !92, !92, !149, !353}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !131, line: 7, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !710, line: 15, size: 1600, align: 64, elements: !711)
!710 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !559, line: 3, baseType: !105, size: 32, align: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !709, file: !559, line: 4, baseType: !105, size: 32, align: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !709, file: !559, line: 5, baseType: !422, size: 64, align: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !709, file: !559, line: 7, baseType: !88, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !709, file: !559, line: 8, baseType: !129, size: 64, align: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !709, file: !559, line: 9, baseType: !149, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !709, file: !559, line: 10, baseType: !149, size: 64, align: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !709, file: !559, line: 11, baseType: !123, size: 64, align: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !709, file: !559, line: 12, baseType: !105, size: 32, align: 32, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !709, file: !559, line: 13, baseType: !149, size: 64, align: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !709, file: !559, line: 15, baseType: !570, size: 64, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !709, file: !559, line: 17, baseType: !577, size: 64, align: 64, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !709, file: !581, line: 5, baseType: !149, size: 64, align: 64, offset: 704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !709, file: !581, line: 6, baseType: !149, size: 64, align: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !709, file: !581, line: 7, baseType: !123, size: 64, align: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !709, file: !581, line: 9, baseType: !422, size: 64, align: 64, offset: 896)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !709, file: !581, line: 10, baseType: !586, size: 64, align: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !709, file: !581, line: 12, baseType: !98, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !709, file: !581, line: 13, baseType: !149, size: 64, align: 64, offset: 1088)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !709, file: !581, line: 14, baseType: !105, size: 32, align: 32, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !709, file: !581, line: 15, baseType: !149, size: 64, align: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !709, file: !581, line: 17, baseType: !98, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !709, file: !581, line: 18, baseType: !98, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !709, file: !581, line: 19, baseType: !98, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !709, file: !581, line: 20, baseType: !98, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !709, file: !581, line: 22, baseType: !98, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !709, file: !581, line: 23, baseType: !98, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !709, file: !581, line: 24, baseType: !98, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !709, file: !581, line: 25, baseType: !98, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !709, file: !581, line: 26, baseType: !98, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !709, file: !581, line: 31, baseType: !623, size: 64, align: 64, offset: 1344)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !709, file: !710, line: 18, baseType: !314, size: 64, align: 64, offset: 1408)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !709, file: !710, line: 20, baseType: !123, size: 64, align: 64, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !709, file: !710, line: 21, baseType: !105, size: 32, align: 32, offset: 1536)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !709, file: !710, line: 22, baseType: !105, size: 32, align: 32, offset: 1568)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !699, file: !700, line: 12, baseType: !92, size: 8, align: 8, offset: 64)
!748 = !{!749}
!749 = !DISubrange(count: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !132, file: !133, line: 118, baseType: !751, size: 2048, align: 8, offset: 37056)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 2048, align: 8, elements: !748)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !132, file: !133, line: 120, baseType: !634, size: 64, align: 64, offset: 39104)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !117, file: !120, line: 6, baseType: !149, size: 64, align: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !117, file: !120, line: 7, baseType: !149, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !117, file: !120, line: 8, baseType: !149, size: 64, align: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !117, file: !120, line: 10, baseType: !757, size: 64, align: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !759, line: 9, baseType: !760)
!759 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !761, line: 12, size: 1792, align: 64, elements: !762)
!761 = !DIFile(filename: "dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !778, !779, !780, !781, !782, !783, !784, !786, !787, !788, !789, !790, !791, !792}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !760, file: !120, line: 1, baseType: !105, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !760, file: !120, line: 2, baseType: !105, size: 32, align: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !760, file: !120, line: 3, baseType: !123, size: 64, align: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !760, file: !120, line: 5, baseType: !129, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !760, file: !120, line: 6, baseType: !149, size: 64, align: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !760, file: !120, line: 7, baseType: !149, size: 64, align: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !760, file: !120, line: 8, baseType: !149, size: 64, align: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !760, file: !120, line: 10, baseType: !757, size: 64, align: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !760, file: !120, line: 11, baseType: !149, size: 64, align: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !760, file: !120, line: 12, baseType: !149, size: 64, align: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !760, file: !120, line: 14, baseType: !162, size: 160, align: 32, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !760, file: !120, line: 15, baseType: !775, size: 368, align: 8, offset: 736)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 368, align: 8, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 46)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !760, file: !120, line: 16, baseType: !105, size: 32, align: 32, offset: 1120)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !760, file: !120, line: 18, baseType: !206, size: 64, align: 64, offset: 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !760, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !760, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !760, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !760, file: !120, line: 20, baseType: !123, size: 64, align: 64, offset: 1344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !760, file: !120, line: 21, baseType: !785, size: 64, align: 64, offset: 1408)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !163, line: 49, baseType: !95)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !760, file: !120, line: 23, baseType: !105, size: 32, align: 32, offset: 1472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !760, file: !120, line: 25, baseType: !98, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !760, file: !120, line: 27, baseType: !422, size: 64, align: 64, offset: 1536)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !760, file: !761, line: 15, baseType: !149, size: 64, align: 64, offset: 1600)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !760, file: !761, line: 16, baseType: !407, size: 64, align: 64, offset: 1664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !760, file: !761, line: 18, baseType: !98, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !760, file: !761, line: 19, baseType: !98, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !117, file: !120, line: 11, baseType: !149, size: 64, align: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !117, file: !120, line: 12, baseType: !149, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !117, file: !120, line: 14, baseType: !162, size: 160, align: 32, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !117, file: !120, line: 15, baseType: !775, size: 368, align: 8, offset: 736)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !117, file: !120, line: 16, baseType: !105, size: 32, align: 32, offset: 1120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !117, file: !120, line: 18, baseType: !206, size: 64, align: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !117, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !117, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !117, file: !120, line: 19, baseType: !105, size: 32, align: 32, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !117, file: !120, line: 20, baseType: !123, size: 64, align: 64, offset: 1344)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !117, file: !120, line: 21, baseType: !785, size: 64, align: 64, offset: 1408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !117, file: !120, line: 23, baseType: !105, size: 32, align: 32, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !117, file: !120, line: 25, baseType: !98, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !117, file: !120, line: 27, baseType: !422, size: 64, align: 64, offset: 1536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !117, file: !116, line: 14, baseType: !407, size: 64, align: 64, offset: 1600)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "accept_send", scope: !117, file: !116, line: 16, baseType: !98, size: 1, align: 32, offset: 1664, flags: DIFlagBitField, extraData: i64 1664)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "accept_chat", scope: !117, file: !116, line: 17, baseType: !98, size: 1, align: 32, offset: 1665, flags: DIFlagBitField, extraData: i64 1664)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "accept_fserve", scope: !117, file: !116, line: 18, baseType: !98, size: 1, align: 32, offset: 1666, flags: DIFlagBitField, extraData: i64 1664)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "connection_established", scope: !117, file: !116, line: 19, baseType: !98, size: 1, align: 32, offset: 1667, flags: DIFlagBitField, extraData: i64 1664)
!812 = !{!813, !815, !816}
!813 = distinct !DIGlobalVariable(name: "dcc_conns", scope: !0, file: !814, line: 44, type: !314, isLocal: false, isDefinition: true, variable: %struct._GSList** @dcc_conns)
!814 = !DIFile(filename: "dcc.c", directory: "/home/lichi/Desktop/irssi/task1")
!815 = distinct !DIGlobalVariable(name: "dcc_types", scope: !0, file: !814, line: 46, type: !314, isLocal: true, isDefinition: true, variable: %struct._GSList** @dcc_types)
!816 = distinct !DIGlobalVariable(name: "dcc_timeouttag", scope: !0, file: !814, line: 47, type: !105, isLocal: true, isDefinition: true, variable: i32* @dcc_timeouttag)
!817 = !{i32 2, !"Dwarf Version", i32 4}
!818 = !{i32 2, !"Debug Info Version", i32 3}
!819 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!820 = distinct !DISubprogram(name: "dcc_register_type", scope: !814, file: !814, line: 49, type: !821, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !93}
!823 = !{}
!824 = !DILocalVariable(name: "type", arg: 1, scope: !820, file: !814, line: 49, type: !93)
!825 = !DIExpression()
!826 = !DILocation(line: 49, column: 36, scope: !820)
!827 = !DILocation(line: 51, column: 36, scope: !820)
!828 = !DILocation(line: 51, column: 56, scope: !820)
!829 = !DILocation(line: 51, column: 47, scope: !820)
!830 = !DILocation(line: 51, column: 21, scope: !831)
!831 = !DILexicalBlockFile(scope: !820, file: !814, discriminator: 1)
!832 = !DILocation(line: 51, column: 19, scope: !820)
!833 = !DILocation(line: 52, column: 1, scope: !820)
!834 = distinct !DISubprogram(name: "dcc_unregister_type", scope: !814, file: !814, line: 54, type: !821, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !823)
!835 = !DILocalVariable(name: "type", arg: 1, scope: !834, file: !814, line: 54, type: !93)
!836 = !DILocation(line: 54, column: 38, scope: !834)
!837 = !DILocalVariable(name: "pos", scope: !834, file: !814, line: 56, type: !314)
!838 = !DILocation(line: 56, column: 10, scope: !834)
!839 = !DILocation(line: 58, column: 27, scope: !834)
!840 = !DILocation(line: 58, column: 38, scope: !834)
!841 = !DILocation(line: 58, column: 8, scope: !834)
!842 = !DILocation(line: 58, column: 6, scope: !834)
!843 = !DILocation(line: 59, column: 6, scope: !844)
!844 = distinct !DILexicalBlock(scope: !834, file: !814, line: 59, column: 6)
!845 = !DILocation(line: 59, column: 10, scope: !844)
!846 = !DILocation(line: 59, column: 6, scope: !834)
!847 = !DILocalVariable(name: "tmp", scope: !848, file: !814, line: 60, type: !88)
!848 = distinct !DILexicalBlock(scope: !844, file: !814, line: 59, column: 18)
!849 = !DILocation(line: 60, column: 9, scope: !848)
!850 = !DILocation(line: 60, column: 15, scope: !848)
!851 = !DILocation(line: 60, column: 20, scope: !848)
!852 = !DILocation(line: 61, column: 30, scope: !848)
!853 = !DILocation(line: 61, column: 41, scope: !848)
!854 = !DILocation(line: 61, column: 46, scope: !848)
!855 = !DILocation(line: 61, column: 15, scope: !848)
!856 = !DILocation(line: 61, column: 13, scope: !848)
!857 = !DILocation(line: 62, column: 10, scope: !848)
!858 = !DILocation(line: 62, column: 3, scope: !848)
!859 = !DILocation(line: 63, column: 2, scope: !848)
!860 = !DILocation(line: 64, column: 1, scope: !834)
!861 = distinct !DISubprogram(name: "dcc_str2type", scope: !814, file: !814, line: 66, type: !862, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !823)
!862 = !DISubroutineType(types: !863)
!863 = !{!105, !93}
!864 = !DILocalVariable(name: "str", arg: 1, scope: !861, file: !814, line: 66, type: !93)
!865 = !DILocation(line: 66, column: 30, scope: !861)
!866 = !DILocation(line: 68, column: 25, scope: !867)
!867 = distinct !DILexicalBlock(scope: !861, file: !814, line: 68, column: 6)
!868 = !DILocation(line: 68, column: 36, scope: !867)
!869 = !DILocation(line: 68, column: 6, scope: !867)
!870 = !DILocation(line: 68, column: 41, scope: !867)
!871 = !DILocation(line: 68, column: 6, scope: !861)
!872 = !DILocation(line: 69, column: 3, scope: !867)
!873 = !DILocation(line: 71, column: 46, scope: !861)
!874 = !DILocation(line: 71, column: 16, scope: !861)
!875 = !DILocation(line: 71, column: 9, scope: !861)
!876 = !DILocation(line: 72, column: 1, scope: !861)
