; ModuleID = './line83-settings.o.i'
source_filename = "./line83-settings.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!68 = !DIEnumerator(name: "G_IO_IN", value: 1)
!69 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!70 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!71 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!72 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!73 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 84, size: 32, align: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84}
!76 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!77 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!78 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!79 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!80 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!81 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!82 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!83 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!84 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 4, size: 32, align: 32, elements: !87)
!86 = !DIFile(filename: "../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !{!88, !89, !90, !91, !92}
!88 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!89 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!90 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!91 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!92 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!93 = !{!94, !95, !99, !101, !110, !114, !109, !119, !121, !130, !134, !138, !143, !147, !167, !125}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHRFunc", file: !102, line: 39, baseType: !103)
!102 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!106, !109, !109, !109}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !97, line: 50, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !97, line: 49, baseType: !108)
!108 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !97, line: 77, baseType: !94)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !97, line: 91, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !109, !109, !109}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !115, line: 85, baseType: !116)
!115 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !108}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !97, line: 48, baseType: !120)
!120 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !97, line: 90, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !97, line: 55, baseType: !126)
!126 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !97, line: 78, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !97, line: 80, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!107, !127, !127}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !66, line: 155, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!106, !109}
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !139, line: 9, baseType: !140)
!139 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !128, !128, !128, !128, !128, !128}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !97, line: 88, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !109, !109}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "SETTINGS_REC", file: !4, line: 31, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 21, size: 512, align: 64, elements: !150)
!150 = !{!151, !152, !154, !155, !156, !158, !165}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !149, file: !4, line: 22, baseType: !108, size: 32, align: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !149, file: !4, line: 24, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !149, file: !4, line: 25, baseType: !153, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !149, file: !4, line: 26, baseType: !153, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !4, line: 28, baseType: !157, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "SettingType", file: !4, line: 13, baseType: !3)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !149, file: !4, line: 29, baseType: !159, size: 128, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "SettingValue", file: !4, line: 19, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 15, size: 128, align: 64, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !160, file: !4, line: 16, baseType: !153, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !160, file: !4, line: 17, baseType: !108, size: 32, align: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "v_bool", scope: !160, file: !4, line: 18, baseType: !126, size: 1, align: 32, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "choices", scope: !149, file: !4, line: 30, baseType: !166, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !97, line: 54, baseType: !168)
!168 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!169 = !{!170, !172, !454, !455, !456, !457, !458, !459, !460, !461, !466, !467, !468}
!170 = distinct !DIGlobalVariable(name: "default_config", scope: !0, file: !171, line: 1, type: !99, isLocal: false, isDefinition: true, variable: i8** @default_config)
!171 = !DIFile(filename: "../../default-config.h", directory: "/home/lichi/Desktop/irssi/task1")
!172 = distinct !DIGlobalVariable(name: "mainconfig", scope: !0, file: !173, line: 36, type: !174, isLocal: false, isDefinition: true, variable: %struct._CONFIG_REC** @mainconfig)
!173 = !DIFile(filename: "settings.c", directory: "/home/lichi/Desktop/irssi/task1")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !86, line: 18, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !86, line: 49, size: 576, align: 64, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !190, !194, !195, !284, !452, !453}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !176, file: !86, line: 50, baseType: !153, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !176, file: !86, line: 51, baseType: !108, size: 32, align: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !176, file: !86, line: 52, baseType: !108, size: 32, align: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !176, file: !86, line: 54, baseType: !153, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !176, file: !86, line: 55, baseType: !183, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !86, line: 17, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !86, line: 20, size: 192, align: 64, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !86, line: 21, baseType: !108, size: 32, align: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !86, line: 22, baseType: !153, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !185, file: !86, line: 23, baseType: !94, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !176, file: !86, line: 56, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !102, line: 37, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !102, line: 37, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !176, file: !86, line: 57, baseType: !191, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !176, file: !86, line: 59, baseType: !196, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !27, line: 37, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !27, line: 169, size: 1152, align: 64, elements: !199)
!199 = !{!200, !201, !202, !203, !206, !211, !243, !245, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !198, file: !27, line: 172, baseType: !109, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !198, file: !27, line: 173, baseType: !125, size: 32, align: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !198, file: !27, line: 176, baseType: !125, size: 32, align: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !198, file: !27, line: 179, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !198, file: !27, line: 182, baseType: !207, size: 64, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !209, line: 36, baseType: !210)
!209 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !209, line: 36, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !198, file: !27, line: 185, baseType: !212, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !27, line: 38, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !27, line: 127, size: 320, align: 64, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !214, file: !27, line: 131, baseType: !95, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !214, file: !27, line: 132, baseType: !95, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !214, file: !27, line: 133, baseType: !95, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !214, file: !27, line: 134, baseType: !95, size: 64, align: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !214, file: !27, line: 138, baseType: !125, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !214, file: !27, line: 143, baseType: !125, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !214, file: !27, line: 144, baseType: !125, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !214, file: !27, line: 145, baseType: !125, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !214, file: !27, line: 146, baseType: !125, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !214, file: !27, line: 147, baseType: !125, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !214, file: !27, line: 148, baseType: !125, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !214, file: !27, line: 149, baseType: !125, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !214, file: !27, line: 150, baseType: !125, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !214, file: !27, line: 151, baseType: !125, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !214, file: !27, line: 152, baseType: !125, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !214, file: !27, line: 153, baseType: !125, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !214, file: !27, line: 154, baseType: !125, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !214, file: !27, line: 155, baseType: !125, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !214, file: !27, line: 156, baseType: !125, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !214, file: !27, line: 157, baseType: !125, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !214, file: !27, line: 158, baseType: !125, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !214, file: !27, line: 159, baseType: !125, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !214, file: !27, line: 160, baseType: !125, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !214, file: !27, line: 161, baseType: !125, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !214, file: !27, line: 162, baseType: !125, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !214, file: !27, line: 163, baseType: !125, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !214, file: !27, line: 166, baseType: !125, size: 32, align: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !198, file: !27, line: 188, baseType: !244, size: 32, align: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !27, line: 109, baseType: !26)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !27, line: 189, baseType: !246, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !27, line: 39, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !27, line: 111, size: 64, align: 64, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !257, !260, !261, !262, !263, !266}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !247, file: !27, line: 113, baseType: !109, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !247, file: !27, line: 114, baseType: !95, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !247, file: !27, line: 115, baseType: !167, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !247, file: !27, line: 116, baseType: !167, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !247, file: !27, line: 117, baseType: !167, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !247, file: !27, line: 118, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !256, line: 52, baseType: !168)
!256 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !247, file: !27, line: 119, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !97, line: 58, baseType: !259)
!259 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !247, file: !27, line: 120, baseType: !167, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !247, file: !27, line: 121, baseType: !95, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !247, file: !27, line: 122, baseType: !95, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !247, file: !27, line: 123, baseType: !264, size: 8, align: 8)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !97, line: 52, baseType: !265)
!265 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !247, file: !27, line: 124, baseType: !125, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !198, file: !27, line: 190, baseType: !125, size: 32, align: 32, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !198, file: !27, line: 191, baseType: !125, size: 32, align: 32, offset: 480)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !198, file: !27, line: 194, baseType: !244, size: 32, align: 32, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !198, file: !27, line: 195, baseType: !246, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !198, file: !27, line: 196, baseType: !125, size: 32, align: 32, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !198, file: !27, line: 197, baseType: !125, size: 32, align: 32, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !198, file: !27, line: 201, baseType: !191, size: 64, align: 64, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !198, file: !27, line: 202, baseType: !107, size: 32, align: 32, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !198, file: !27, line: 203, baseType: !204, size: 64, align: 64, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !198, file: !27, line: 204, baseType: !204, size: 64, align: 64, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !198, file: !27, line: 205, baseType: !95, size: 64, align: 64, offset: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !198, file: !27, line: 206, baseType: !125, size: 32, align: 32, offset: 1024)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !198, file: !27, line: 210, baseType: !280, size: 64, align: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !27, line: 41, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !196, !95, !106}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !176, file: !86, line: 62, baseType: !285, size: 64, align: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !54, line: 41, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !54, line: 97, size: 896, align: 64, elements: !288)
!288 = !{!289, !290, !419, !420, !425, !426, !427, !428, !429, !438, !439, !440, !444, !445, !446, !447, !448, !449, !450, !451}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !287, file: !54, line: 100, baseType: !107, size: 32, align: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !287, file: !54, line: 101, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !54, line: 42, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !54, line: 131, size: 512, align: 64, elements: !294)
!294 = !{!295, !314, !318, !324, !328, !406, !410, !415}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !293, file: !54, line: 133, baseType: !296, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!299, !285, !95, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !54, line: 75, baseType: !53)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !256, line: 66, baseType: !168)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !305, line: 42, baseType: !306)
!305 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !305, line: 44, size: 128, align: 64, elements: !307)
!307 = !{!308, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !306, file: !305, line: 46, baseType: !309, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !310, line: 36, baseType: !311)
!310 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !256, line: 45, baseType: !126)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !306, file: !305, line: 47, baseType: !107, size: 32, align: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !306, file: !305, line: 48, baseType: !95, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !293, file: !54, line: 138, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!299, !285, !204, !300, !301, !302}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !293, file: !54, line: 143, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!299, !285, !322, !323, !302}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !256, line: 51, baseType: !120)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !54, line: 82, baseType: !60)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !293, file: !54, line: 147, baseType: !325, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!299, !285, !302}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !293, file: !54, line: 149, baseType: !329, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!332, !285, !405}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !66, line: 64, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !66, line: 171, size: 768, align: 64, elements: !335)
!335 = !{!336, !337, !353, !382, !383, !387, !388, !389, !390, !398, !399, !400, !401}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !334, file: !66, line: 174, baseType: !109, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !334, file: !66, line: 175, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !66, line: 77, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !66, line: 196, size: 192, align: 64, elements: !341)
!341 = !{!342, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !340, file: !66, line: 198, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !109}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !340, file: !66, line: 199, baseType: !343, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !340, file: !66, line: 200, baseType: !348, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !109, !332, !351, !352}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !334, file: !66, line: 177, baseType: !354, size: 64, align: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !66, line: 130, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !66, line: 214, size: 384, align: 64, elements: !358)
!358 = !{!359, !364, !368, !372, !376, !377}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !357, file: !66, line: 216, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!106, !332, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !357, file: !66, line: 218, baseType: !365, size: 64, align: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!106, !332}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !357, file: !66, line: 219, baseType: !369, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!106, !332, !134, !109}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !357, file: !66, line: 222, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !332}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !357, file: !66, line: 226, baseType: !134, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !357, file: !66, line: 227, baseType: !378, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !66, line: 212, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !334, file: !66, line: 178, baseType: !125, size: 32, align: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !334, file: !66, line: 180, baseType: !384, size: 64, align: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !66, line: 48, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !66, line: 48, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !334, file: !66, line: 182, baseType: !107, size: 32, align: 32, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !66, line: 183, baseType: !125, size: 32, align: 32, offset: 352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !334, file: !66, line: 184, baseType: !125, size: 32, align: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !334, file: !66, line: 186, baseType: !391, size: 64, align: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !393, line: 37, baseType: !394)
!393 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !393, line: 39, size: 128, align: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !394, file: !393, line: 41, baseType: !109, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !393, line: 42, baseType: !391, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !66, line: 188, baseType: !332, size: 64, align: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !66, line: 189, baseType: !332, size: 64, align: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !66, line: 191, baseType: !153, size: 64, align: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !334, file: !66, line: 193, baseType: !402, size: 64, align: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !66, line: 65, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !66, line: 65, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !66, line: 39, baseType: !65)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !293, file: !54, line: 151, baseType: !407, size: 64, align: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !285}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !293, file: !54, line: 152, baseType: !411, size: 64, align: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!299, !285, !414, !302}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !54, line: 95, baseType: !74)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !293, file: !54, line: 155, baseType: !416, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!414, !285}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !287, file: !54, line: 103, baseType: !95, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !287, file: !54, line: 104, baseType: !421, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !422, line: 77, baseType: !423)
!422 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !422, line: 77, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !287, file: !54, line: 105, baseType: !421, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !287, file: !54, line: 106, baseType: !95, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !287, file: !54, line: 107, baseType: !125, size: 32, align: 32, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !287, file: !54, line: 109, baseType: !300, size: 64, align: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !287, file: !54, line: 110, baseType: !430, size: 64, align: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !432, line: 39, baseType: !433)
!432 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !432, line: 41, size: 192, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !433, file: !432, line: 43, baseType: !95, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !433, file: !432, line: 44, baseType: !300, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !433, file: !432, line: 45, baseType: !300, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !287, file: !54, line: 111, baseType: !430, size: 64, align: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !287, file: !54, line: 112, baseType: !430, size: 64, align: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !287, file: !54, line: 113, baseType: !441, size: 48, align: 8, offset: 704)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, align: 8, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 6)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !287, file: !54, line: 117, baseType: !125, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !287, file: !54, line: 118, baseType: !125, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !287, file: !54, line: 119, baseType: !125, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !287, file: !54, line: 120, baseType: !125, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !287, file: !54, line: 121, baseType: !125, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !287, file: !54, line: 122, baseType: !125, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !287, file: !54, line: 124, baseType: !109, size: 64, align: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !287, file: !54, line: 125, baseType: !109, size: 64, align: 64, offset: 832)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !176, file: !86, line: 63, baseType: !108, size: 32, align: 32, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !176, file: !86, line: 64, baseType: !108, size: 32, align: 32, offset: 544)
!454 = distinct !DIGlobalVariable(name: "last_errors", scope: !0, file: !173, line: 38, type: !430, isLocal: true, isDefinition: true, variable: %struct._GString** @last_errors)
!455 = distinct !DIGlobalVariable(name: "last_invalid_modules", scope: !0, file: !173, line: 39, type: !391, isLocal: true, isDefinition: true, variable: %struct._GSList** @last_invalid_modules)
!456 = distinct !DIGlobalVariable(name: "fe_initialized", scope: !0, file: !173, line: 40, type: !108, isLocal: true, isDefinition: true, variable: i32* @fe_initialized)
!457 = distinct !DIGlobalVariable(name: "config_changed", scope: !0, file: !173, line: 41, type: !108, isLocal: true, isDefinition: true, variable: i32* @config_changed)
!458 = distinct !DIGlobalVariable(name: "settings", scope: !0, file: !173, line: 44, type: !191, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @settings)
!459 = distinct !DIGlobalVariable(name: "timeout_tag", scope: !0, file: !173, line: 45, type: !108, isLocal: true, isDefinition: true, variable: i32* @timeout_tag)
!460 = distinct !DIGlobalVariable(name: "config_last_modifycounter", scope: !0, file: !173, line: 47, type: !108, isLocal: true, isDefinition: true, variable: i32* @config_last_modifycounter)
!461 = distinct !DIGlobalVariable(name: "config_last_mtime", scope: !0, file: !173, line: 48, type: !462, isLocal: true, isDefinition: true, variable: i64* @config_last_mtime)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !463, line: 75, baseType: !464)
!463 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !465, line: 139, baseType: !120)
!465 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!466 = distinct !DIGlobalVariable(name: "config_last_size", scope: !0, file: !173, line: 49, type: !120, isLocal: true, isDefinition: true, variable: i64* @config_last_size)
!467 = distinct !DIGlobalVariable(name: "config_last_checksum", scope: !0, file: !173, line: 50, type: !126, isLocal: true, isDefinition: true, variable: i32* @config_last_checksum)
!468 = distinct !DIGlobalVariable(name: "user_settings_changed", scope: !0, file: !173, line: 42, type: !126, isLocal: true, isDefinition: true, variable: i32* @user_settings_changed)
!469 = !{i32 2, !"Dwarf Version", i32 4}
!470 = !{i32 2, !"Debug Info Version", i32 3}
!471 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!472 = distinct !DISubprogram(name: "settings_get_str", scope: !173, file: !173, line: 87, type: !473, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!99, !99}
!475 = !{}
!476 = !DILocalVariable(name: "key", arg: 1, scope: !472, file: !173, line: 87, type: !99)
!477 = !DIExpression()
!478 = !DILocation(line: 87, column: 42, scope: !472)
!479 = !DILocation(line: 89, column: 31, scope: !472)
!480 = !DILocation(line: 89, column: 9, scope: !472)
!481 = !DILocation(line: 89, column: 2, scope: !472)
!482 = distinct !DISubprogram(name: "settings_get_str_type", scope: !173, file: !173, line: 72, type: !483, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!483 = !DISubroutineType(types: !484)
!484 = !{!99, !99, !157}
!485 = !DILocalVariable(name: "key", arg: 1, scope: !482, file: !173, line: 72, type: !99)
!486 = !DILocation(line: 72, column: 35, scope: !482)
!487 = !DILocalVariable(name: "type", arg: 2, scope: !482, file: !173, line: 72, type: !157)
!488 = !DILocation(line: 72, column: 52, scope: !482)
!489 = !DILocalVariable(name: "rec", scope: !482, file: !173, line: 74, type: !147)
!490 = !DILocation(line: 74, column: 16, scope: !482)
!491 = !DILocalVariable(name: "node", scope: !482, file: !173, line: 75, type: !183)
!492 = !DILocation(line: 75, column: 15, scope: !482)
!493 = !DILocation(line: 77, column: 21, scope: !482)
!494 = !DILocation(line: 77, column: 26, scope: !482)
!495 = !DILocation(line: 77, column: 8, scope: !482)
!496 = !DILocation(line: 77, column: 6, scope: !482)
!497 = !DILocation(line: 78, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !482, file: !173, line: 78, column: 6)
!499 = !DILocation(line: 78, column: 10, scope: !498)
!500 = !DILocation(line: 78, column: 6, scope: !482)
!501 = !DILocation(line: 78, column: 18, scope: !502)
!502 = !DILexicalBlockFile(scope: !498, file: !173, discriminator: 1)
!503 = !DILocation(line: 80, column: 30, scope: !482)
!504 = !DILocation(line: 80, column: 9, scope: !482)
!505 = !DILocation(line: 80, column: 7, scope: !482)
!506 = !DILocation(line: 81, column: 9, scope: !482)
!507 = !DILocation(line: 81, column: 14, scope: !482)
!508 = !DILocation(line: 81, column: 9, scope: !509)
!509 = !DILexicalBlockFile(scope: !482, file: !173, discriminator: 1)
!510 = !DILocation(line: 81, column: 50, scope: !511)
!511 = !DILexicalBlockFile(scope: !482, file: !173, discriminator: 2)
!512 = !DILocation(line: 81, column: 62, scope: !511)
!513 = !DILocation(line: 81, column: 68, scope: !511)
!514 = !DILocation(line: 81, column: 73, scope: !511)
!515 = !DILocation(line: 81, column: 30, scope: !511)
!516 = !DILocation(line: 81, column: 9, scope: !511)
!517 = !DILocation(line: 81, column: 9, scope: !518)
!518 = !DILexicalBlockFile(scope: !482, file: !173, discriminator: 3)
!519 = !DILocation(line: 81, column: 7, scope: !518)
!520 = !DILocation(line: 83, column: 9, scope: !482)
!521 = !DILocation(line: 83, column: 14, scope: !482)
!522 = !DILocation(line: 83, column: 23, scope: !509)
!523 = !DILocation(line: 83, column: 28, scope: !509)
!524 = !DILocation(line: 83, column: 42, scope: !509)
!525 = !DILocation(line: 83, column: 9, scope: !509)
!526 = !DILocation(line: 84, column: 23, scope: !482)
!527 = !DILocation(line: 84, column: 29, scope: !482)
!528 = !DILocation(line: 84, column: 34, scope: !482)
!529 = !DILocation(line: 84, column: 39, scope: !482)
!530 = !DILocation(line: 84, column: 53, scope: !482)
!531 = !DILocation(line: 84, column: 3, scope: !482)
!532 = !DILocation(line: 83, column: 9, scope: !511)
!533 = !DILocation(line: 83, column: 9, scope: !518)
!534 = !DILocation(line: 83, column: 2, scope: !518)
!535 = !DILocation(line: 85, column: 1, scope: !482)
!536 = distinct !DISubprogram(name: "settings_get_int", scope: !173, file: !173, line: 92, type: !537, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!537 = !DISubroutineType(types: !538)
!538 = !{!108, !99}
!539 = !DILocalVariable(name: "key", arg: 1, scope: !536, file: !173, line: 92, type: !99)
!540 = !DILocation(line: 92, column: 34, scope: !536)
!541 = !DILocalVariable(name: "rec", scope: !536, file: !173, line: 94, type: !147)
!542 = !DILocation(line: 94, column: 16, scope: !536)
!543 = !DILocalVariable(name: "node", scope: !536, file: !173, line: 95, type: !183)
!544 = !DILocation(line: 95, column: 15, scope: !536)
!545 = !DILocation(line: 97, column: 21, scope: !536)
!546 = !DILocation(line: 97, column: 8, scope: !536)
!547 = !DILocation(line: 97, column: 6, scope: !536)
!548 = !DILocation(line: 98, column: 6, scope: !549)
!549 = distinct !DILexicalBlock(scope: !536, file: !173, line: 98, column: 6)
!550 = !DILocation(line: 98, column: 10, scope: !549)
!551 = !DILocation(line: 98, column: 6, scope: !536)
!552 = !DILocation(line: 98, column: 18, scope: !553)
!553 = !DILexicalBlockFile(scope: !549, file: !173, discriminator: 1)
!554 = !DILocation(line: 100, column: 30, scope: !536)
!555 = !DILocation(line: 100, column: 9, scope: !536)
!556 = !DILocation(line: 100, column: 7, scope: !536)
!557 = !DILocation(line: 101, column: 9, scope: !536)
!558 = !DILocation(line: 101, column: 14, scope: !536)
!559 = !DILocation(line: 101, column: 9, scope: !560)
!560 = !DILexicalBlockFile(scope: !536, file: !173, discriminator: 1)
!561 = !DILocation(line: 101, column: 50, scope: !562)
!562 = !DILexicalBlockFile(scope: !536, file: !173, discriminator: 2)
!563 = !DILocation(line: 101, column: 62, scope: !562)
!564 = !DILocation(line: 101, column: 68, scope: !562)
!565 = !DILocation(line: 101, column: 73, scope: !562)
!566 = !DILocation(line: 101, column: 30, scope: !562)
!567 = !DILocation(line: 101, column: 9, scope: !562)
!568 = !DILocation(line: 101, column: 9, scope: !569)
!569 = !DILexicalBlockFile(scope: !536, file: !173, discriminator: 3)
!570 = !DILocation(line: 101, column: 7, scope: !569)
!571 = !DILocation(line: 103, column: 9, scope: !536)
!572 = !DILocation(line: 103, column: 14, scope: !536)
!573 = !DILocation(line: 103, column: 23, scope: !560)
!574 = !DILocation(line: 103, column: 28, scope: !560)
!575 = !DILocation(line: 103, column: 42, scope: !560)
!576 = !DILocation(line: 103, column: 9, scope: !560)
!577 = !DILocation(line: 104, column: 23, scope: !536)
!578 = !DILocation(line: 104, column: 29, scope: !536)
!579 = !DILocation(line: 104, column: 34, scope: !536)
!580 = !DILocation(line: 104, column: 39, scope: !536)
!581 = !DILocation(line: 104, column: 53, scope: !536)
!582 = !DILocation(line: 104, column: 3, scope: !536)
!583 = !DILocation(line: 103, column: 9, scope: !562)
!584 = !DILocation(line: 103, column: 9, scope: !569)
!585 = !DILocation(line: 103, column: 2, scope: !569)
!586 = !DILocation(line: 105, column: 1, scope: !536)
!587 = distinct !DISubprogram(name: "settings_get", scope: !173, file: !173, line: 52, type: !588, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!588 = !DISubroutineType(types: !589)
!589 = !{!147, !99, !157}
!590 = !DILocalVariable(name: "key", arg: 1, scope: !587, file: !173, line: 52, type: !99)
!591 = !DILocation(line: 52, column: 47, scope: !587)
!592 = !DILocalVariable(name: "type", arg: 2, scope: !587, file: !173, line: 52, type: !157)
!593 = !DILocation(line: 52, column: 64, scope: !587)
!594 = !DILocalVariable(name: "rec", scope: !587, file: !173, line: 54, type: !147)
!595 = !DILocation(line: 54, column: 16, scope: !587)
!596 = !DILocation(line: 56, column: 2, scope: !587)
!597 = distinct !{!597, !596}
!598 = !DILocation(line: 56, column: 10, scope: !599)
!599 = !DILexicalBlockFile(scope: !600, file: !173, discriminator: 1)
!600 = distinct !DILexicalBlock(scope: !601, file: !173, line: 56, column: 10)
!601 = distinct !DILexicalBlock(scope: !587, file: !173, line: 56, column: 4)
!602 = !DILocation(line: 56, column: 14, scope: !599)
!603 = !DILocation(line: 56, column: 5, scope: !604)
!604 = !DILexicalBlockFile(scope: !605, file: !173, discriminator: 2)
!605 = distinct !DILexicalBlock(scope: !600, file: !173, line: 56, column: 3)
!606 = !DILocation(line: 56, column: 14, scope: !607)
!607 = !DILexicalBlockFile(scope: !608, file: !173, discriminator: 3)
!608 = distinct !DILexicalBlock(scope: !600, file: !173, line: 56, column: 12)
!609 = !DILocation(line: 56, column: 98, scope: !607)
!610 = !DILocation(line: 56, column: 7, scope: !611)
!611 = !DILexicalBlockFile(scope: !601, file: !173, discriminator: 4)
!612 = !DILocation(line: 58, column: 28, scope: !587)
!613 = !DILocation(line: 58, column: 38, scope: !587)
!614 = !DILocation(line: 58, column: 8, scope: !587)
!615 = !DILocation(line: 58, column: 6, scope: !587)
!616 = !DILocation(line: 59, column: 6, scope: !617)
!617 = distinct !DILexicalBlock(scope: !587, file: !173, line: 59, column: 6)
!618 = !DILocation(line: 59, column: 10, scope: !617)
!619 = !DILocation(line: 59, column: 6, scope: !587)
!620 = !DILocation(line: 60, column: 77, scope: !621)
!621 = distinct !DILexicalBlock(scope: !617, file: !173, line: 59, column: 18)
!622 = !DILocation(line: 60, column: 3, scope: !621)
!623 = !DILocation(line: 61, column: 3, scope: !621)
!624 = !DILocation(line: 63, column: 6, scope: !625)
!625 = distinct !DILexicalBlock(scope: !587, file: !173, line: 63, column: 6)
!626 = !DILocation(line: 63, column: 11, scope: !625)
!627 = !DILocation(line: 63, column: 31, scope: !625)
!628 = !DILocation(line: 63, column: 34, scope: !629)
!629 = !DILexicalBlockFile(scope: !625, file: !173, discriminator: 1)
!630 = !DILocation(line: 63, column: 39, scope: !629)
!631 = !DILocation(line: 63, column: 47, scope: !629)
!632 = !DILocation(line: 63, column: 44, scope: !629)
!633 = !DILocation(line: 63, column: 6, scope: !629)
!634 = !DILocation(line: 64, column: 80, scope: !635)
!635 = distinct !DILexicalBlock(scope: !625, file: !173, line: 63, column: 53)
!636 = !DILocation(line: 64, column: 3, scope: !635)
!637 = !DILocation(line: 65, column: 3, scope: !635)
!638 = !DILocation(line: 68, column: 9, scope: !587)
!639 = !DILocation(line: 68, column: 2, scope: !587)
!640 = !DILocation(line: 69, column: 1, scope: !587)
!641 = distinct !DISubprogram(name: "settings_get_bool", scope: !173, file: !173, line: 107, type: !537, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!642 = !DILocalVariable(name: "key", arg: 1, scope: !641, file: !173, line: 107, type: !99)
!643 = !DILocation(line: 107, column: 35, scope: !641)
!644 = !DILocalVariable(name: "rec", scope: !641, file: !173, line: 109, type: !147)
!645 = !DILocation(line: 109, column: 16, scope: !641)
!646 = !DILocalVariable(name: "node", scope: !641, file: !173, line: 110, type: !183)
!647 = !DILocation(line: 110, column: 15, scope: !641)
!648 = !DILocation(line: 112, column: 21, scope: !641)
!649 = !DILocation(line: 112, column: 8, scope: !641)
!650 = !DILocation(line: 112, column: 6, scope: !641)
!651 = !DILocation(line: 113, column: 6, scope: !652)
!652 = distinct !DILexicalBlock(scope: !641, file: !173, line: 113, column: 6)
!653 = !DILocation(line: 113, column: 10, scope: !652)
!654 = !DILocation(line: 113, column: 6, scope: !641)
!655 = !DILocation(line: 113, column: 18, scope: !656)
!656 = !DILexicalBlockFile(scope: !652, file: !173, discriminator: 1)
!657 = !DILocation(line: 115, column: 30, scope: !641)
!658 = !DILocation(line: 115, column: 9, scope: !641)
!659 = !DILocation(line: 115, column: 7, scope: !641)
!660 = !DILocation(line: 116, column: 9, scope: !641)
!661 = !DILocation(line: 116, column: 14, scope: !641)
!662 = !DILocation(line: 116, column: 9, scope: !663)
!663 = !DILexicalBlockFile(scope: !641, file: !173, discriminator: 1)
!664 = !DILocation(line: 116, column: 50, scope: !665)
!665 = !DILexicalBlockFile(scope: !641, file: !173, discriminator: 2)
!666 = !DILocation(line: 116, column: 62, scope: !665)
!667 = !DILocation(line: 116, column: 68, scope: !665)
!668 = !DILocation(line: 116, column: 73, scope: !665)
!669 = !DILocation(line: 116, column: 30, scope: !665)
!670 = !DILocation(line: 116, column: 9, scope: !665)
!671 = !DILocation(line: 116, column: 9, scope: !672)
!672 = !DILexicalBlockFile(scope: !641, file: !173, discriminator: 3)
!673 = !DILocation(line: 116, column: 7, scope: !672)
!674 = !DILocation(line: 118, column: 9, scope: !641)
!675 = !DILocation(line: 118, column: 14, scope: !641)
!676 = !DILocation(line: 118, column: 23, scope: !663)
!677 = !DILocation(line: 118, column: 28, scope: !663)
!678 = !DILocation(line: 118, column: 42, scope: !663)
!679 = !DILocation(line: 118, column: 9, scope: !663)
!680 = !DILocation(line: 119, column: 24, scope: !641)
!681 = !DILocation(line: 119, column: 30, scope: !641)
!682 = !DILocation(line: 119, column: 35, scope: !641)
!683 = !DILocation(line: 119, column: 40, scope: !641)
!684 = !DILocation(line: 119, column: 54, scope: !641)
!685 = !DILocation(line: 119, column: 3, scope: !641)
!686 = !DILocation(line: 118, column: 9, scope: !665)
!687 = !DILocation(line: 118, column: 9, scope: !672)
!688 = !DILocation(line: 118, column: 2, scope: !672)
!689 = !DILocation(line: 120, column: 1, scope: !641)
!690 = distinct !DISubprogram(name: "settings_get_time", scope: !173, file: !173, line: 122, type: !537, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!691 = !DILocalVariable(name: "key", arg: 1, scope: !690, file: !173, line: 122, type: !99)
!692 = !DILocation(line: 122, column: 35, scope: !690)
!693 = !DILocalVariable(name: "str", scope: !690, file: !173, line: 124, type: !99)
!694 = !DILocation(line: 124, column: 14, scope: !690)
!695 = !DILocalVariable(name: "msecs", scope: !690, file: !173, line: 125, type: !108)
!696 = !DILocation(line: 125, column: 6, scope: !690)
!697 = !DILocation(line: 127, column: 30, scope: !690)
!698 = !DILocation(line: 127, column: 8, scope: !690)
!699 = !DILocation(line: 127, column: 6, scope: !690)
!700 = !DILocation(line: 128, column: 6, scope: !701)
!701 = distinct !DILexicalBlock(scope: !690, file: !173, line: 128, column: 6)
!702 = !DILocation(line: 128, column: 10, scope: !701)
!703 = !DILocation(line: 128, column: 17, scope: !701)
!704 = !DILocation(line: 128, column: 41, scope: !705)
!705 = !DILexicalBlockFile(scope: !701, file: !173, discriminator: 1)
!706 = !DILocation(line: 128, column: 21, scope: !705)
!707 = !DILocation(line: 128, column: 6, scope: !705)
!708 = !DILocation(line: 129, column: 90, scope: !701)
!709 = !DILocation(line: 129, column: 95, scope: !701)
!710 = !DILocation(line: 129, column: 3, scope: !701)
!711 = !DILocation(line: 130, column: 9, scope: !690)
!712 = !DILocation(line: 130, column: 13, scope: !690)
!713 = !DILocation(line: 130, column: 9, scope: !714)
!714 = !DILexicalBlockFile(scope: !690, file: !173, discriminator: 1)
!715 = !DILocation(line: 130, column: 26, scope: !716)
!716 = !DILexicalBlockFile(scope: !690, file: !173, discriminator: 2)
!717 = !DILocation(line: 130, column: 9, scope: !716)
!718 = !DILocation(line: 130, column: 9, scope: !719)
!719 = !DILexicalBlockFile(scope: !690, file: !173, discriminator: 3)
!720 = !DILocation(line: 130, column: 2, scope: !719)
!721 = distinct !DISubprogram(name: "settings_get_level", scope: !173, file: !173, line: 133, type: !537, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!722 = !DILocalVariable(name: "key", arg: 1, scope: !721, file: !173, line: 133, type: !99)
!723 = !DILocation(line: 133, column: 36, scope: !721)
!724 = !DILocalVariable(name: "str", scope: !721, file: !173, line: 135, type: !99)
!725 = !DILocation(line: 135, column: 14, scope: !721)
!726 = !DILocation(line: 137, column: 30, scope: !721)
!727 = !DILocation(line: 137, column: 8, scope: !721)
!728 = !DILocation(line: 137, column: 6, scope: !721)
!729 = !DILocation(line: 138, column: 9, scope: !721)
!730 = !DILocation(line: 138, column: 13, scope: !721)
!731 = !DILocation(line: 138, column: 9, scope: !732)
!732 = !DILexicalBlockFile(scope: !721, file: !173, discriminator: 1)
!733 = !DILocation(line: 138, column: 37, scope: !734)
!734 = !DILexicalBlockFile(scope: !721, file: !173, discriminator: 2)
!735 = !DILocation(line: 138, column: 26, scope: !734)
!736 = !DILocation(line: 138, column: 9, scope: !734)
!737 = !DILocation(line: 138, column: 9, scope: !738)
!738 = !DILexicalBlockFile(scope: !721, file: !173, discriminator: 3)
!739 = !DILocation(line: 138, column: 2, scope: !738)
!740 = distinct !DISubprogram(name: "settings_get_size", scope: !173, file: !173, line: 141, type: !537, isLocal: false, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!741 = !DILocalVariable(name: "key", arg: 1, scope: !740, file: !173, line: 141, type: !99)
!742 = !DILocation(line: 141, column: 35, scope: !740)
!743 = !DILocalVariable(name: "str", scope: !740, file: !173, line: 143, type: !99)
!744 = !DILocation(line: 143, column: 14, scope: !740)
!745 = !DILocalVariable(name: "bytes", scope: !740, file: !173, line: 144, type: !108)
!746 = !DILocation(line: 144, column: 6, scope: !740)
!747 = !DILocation(line: 146, column: 30, scope: !740)
!748 = !DILocation(line: 146, column: 8, scope: !740)
!749 = !DILocation(line: 146, column: 6, scope: !740)
!750 = !DILocation(line: 147, column: 6, scope: !751)
!751 = distinct !DILexicalBlock(scope: !740, file: !173, line: 147, column: 6)
!752 = !DILocation(line: 147, column: 10, scope: !751)
!753 = !DILocation(line: 147, column: 17, scope: !751)
!754 = !DILocation(line: 147, column: 32, scope: !755)
!755 = !DILexicalBlockFile(scope: !751, file: !173, discriminator: 1)
!756 = !DILocation(line: 147, column: 21, scope: !755)
!757 = !DILocation(line: 147, column: 6, scope: !755)
!758 = !DILocation(line: 148, column: 90, scope: !751)
!759 = !DILocation(line: 148, column: 95, scope: !751)
!760 = !DILocation(line: 148, column: 3, scope: !751)
!761 = !DILocation(line: 149, column: 9, scope: !740)
!762 = !DILocation(line: 149, column: 13, scope: !740)
!763 = !DILocation(line: 149, column: 9, scope: !764)
!764 = !DILexicalBlockFile(scope: !740, file: !173, discriminator: 1)
!765 = !DILocation(line: 149, column: 26, scope: !766)
!766 = !DILexicalBlockFile(scope: !740, file: !173, discriminator: 2)
!767 = !DILocation(line: 149, column: 9, scope: !766)
!768 = !DILocation(line: 149, column: 9, scope: !769)
!769 = !DILexicalBlockFile(scope: !740, file: !173, discriminator: 3)
!770 = !DILocation(line: 149, column: 2, scope: !769)
!771 = distinct !DISubprogram(name: "settings_get_choice", scope: !173, file: !173, line: 152, type: !537, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!772 = !DILocalVariable(name: "key", arg: 1, scope: !771, file: !173, line: 152, type: !99)
!773 = !DILocation(line: 152, column: 37, scope: !771)
!774 = !DILocalVariable(name: "rec", scope: !771, file: !173, line: 154, type: !147)
!775 = !DILocation(line: 154, column: 16, scope: !771)
!776 = !DILocalVariable(name: "node", scope: !771, file: !173, line: 155, type: !183)
!777 = !DILocation(line: 155, column: 15, scope: !771)
!778 = !DILocalVariable(name: "str", scope: !771, file: !173, line: 156, type: !153)
!779 = !DILocation(line: 156, column: 8, scope: !771)
!780 = !DILocalVariable(name: "index", scope: !771, file: !173, line: 157, type: !108)
!781 = !DILocation(line: 157, column: 6, scope: !771)
!782 = !DILocation(line: 159, column: 21, scope: !771)
!783 = !DILocation(line: 159, column: 8, scope: !771)
!784 = !DILocation(line: 159, column: 6, scope: !771)
!785 = !DILocation(line: 160, column: 6, scope: !786)
!786 = distinct !DILexicalBlock(scope: !771, file: !173, line: 160, column: 6)
!787 = !DILocation(line: 160, column: 10, scope: !786)
!788 = !DILocation(line: 160, column: 6, scope: !771)
!789 = !DILocation(line: 160, column: 18, scope: !790)
!790 = !DILexicalBlockFile(scope: !786, file: !173, discriminator: 1)
!791 = !DILocation(line: 162, column: 30, scope: !771)
!792 = !DILocation(line: 162, column: 9, scope: !771)
!793 = !DILocation(line: 162, column: 7, scope: !771)
!794 = !DILocation(line: 163, column: 9, scope: !771)
!795 = !DILocation(line: 163, column: 14, scope: !771)
!796 = !DILocation(line: 163, column: 9, scope: !797)
!797 = !DILexicalBlockFile(scope: !771, file: !173, discriminator: 1)
!798 = !DILocation(line: 163, column: 50, scope: !799)
!799 = !DILexicalBlockFile(scope: !771, file: !173, discriminator: 2)
!800 = !DILocation(line: 163, column: 62, scope: !799)
!801 = !DILocation(line: 163, column: 68, scope: !799)
!802 = !DILocation(line: 163, column: 73, scope: !799)
!803 = !DILocation(line: 163, column: 30, scope: !799)
!804 = !DILocation(line: 163, column: 9, scope: !799)
!805 = !DILocation(line: 163, column: 9, scope: !806)
!806 = !DILexicalBlockFile(scope: !771, file: !173, discriminator: 3)
!807 = !DILocation(line: 163, column: 7, scope: !806)
!808 = !DILocation(line: 165, column: 8, scope: !771)
!809 = !DILocation(line: 165, column: 13, scope: !771)
!810 = !DILocation(line: 165, column: 22, scope: !797)
!811 = !DILocation(line: 165, column: 27, scope: !797)
!812 = !DILocation(line: 165, column: 41, scope: !797)
!813 = !DILocation(line: 165, column: 8, scope: !797)
!814 = !DILocation(line: 166, column: 23, scope: !771)
!815 = !DILocation(line: 166, column: 29, scope: !771)
!816 = !DILocation(line: 166, column: 34, scope: !771)
!817 = !DILocation(line: 166, column: 39, scope: !771)
!818 = !DILocation(line: 166, column: 53, scope: !771)
!819 = !DILocation(line: 166, column: 3, scope: !771)
!820 = !DILocation(line: 165, column: 8, scope: !799)
!821 = !DILocation(line: 165, column: 8, scope: !806)
!822 = !DILocation(line: 165, column: 6, scope: !806)
!823 = !DILocation(line: 168, column: 6, scope: !824)
!824 = distinct !DILexicalBlock(scope: !771, file: !173, line: 168, column: 6)
!825 = !DILocation(line: 168, column: 10, scope: !824)
!826 = !DILocation(line: 168, column: 17, scope: !824)
!827 = !DILocation(line: 168, column: 43, scope: !828)
!828 = !DILexicalBlockFile(scope: !824, file: !173, discriminator: 1)
!829 = !DILocation(line: 168, column: 48, scope: !828)
!830 = !DILocation(line: 168, column: 57, scope: !828)
!831 = !DILocation(line: 168, column: 29, scope: !828)
!832 = !DILocation(line: 168, column: 27, scope: !828)
!833 = !DILocation(line: 168, column: 63, scope: !828)
!834 = !DILocation(line: 168, column: 6, scope: !828)
!835 = !DILocation(line: 169, column: 10, scope: !824)
!836 = !DILocation(line: 169, column: 15, scope: !824)
!837 = !DILocation(line: 169, column: 29, scope: !824)
!838 = !DILocation(line: 169, column: 3, scope: !824)
!839 = !DILocation(line: 171, column: 9, scope: !771)
!840 = !DILocation(line: 171, column: 2, scope: !771)
!841 = !DILocation(line: 172, column: 1, scope: !771)
!842 = distinct !DISubprogram(name: "settings_get_print", scope: !173, file: !173, line: 174, type: !843, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!843 = !DISubroutineType(types: !844)
!844 = !{!153, !147}
!845 = !DILocalVariable(name: "rec", arg: 1, scope: !842, file: !173, line: 174, type: !147)
!846 = !DILocation(line: 174, column: 40, scope: !842)
!847 = !DILocalVariable(name: "value", scope: !842, file: !173, line: 176, type: !153)
!848 = !DILocation(line: 176, column: 8, scope: !842)
!849 = !DILocation(line: 178, column: 9, scope: !842)
!850 = !DILocation(line: 178, column: 14, scope: !842)
!851 = !DILocation(line: 178, column: 2, scope: !842)
!852 = !DILocation(line: 180, column: 53, scope: !853)
!853 = distinct !DILexicalBlock(scope: !842, file: !173, line: 178, column: 20)
!854 = !DILocation(line: 180, column: 58, scope: !853)
!855 = !DILocation(line: 180, column: 33, scope: !853)
!856 = !DILocation(line: 180, column: 20, scope: !853)
!857 = !DILocation(line: 180, column: 25, scope: !853)
!858 = !DILocation(line: 180, column: 11, scope: !859)
!859 = !DILexicalBlockFile(scope: !853, file: !173, discriminator: 1)
!860 = !DILocation(line: 180, column: 9, scope: !853)
!861 = !DILocation(line: 181, column: 3, scope: !853)
!862 = !DILocation(line: 183, column: 38, scope: !853)
!863 = !DILocation(line: 183, column: 43, scope: !853)
!864 = !DILocation(line: 183, column: 20, scope: !853)
!865 = !DILocation(line: 183, column: 11, scope: !859)
!866 = !DILocation(line: 183, column: 9, scope: !853)
!867 = !DILocation(line: 184, column: 3, scope: !853)
!868 = !DILocation(line: 186, column: 50, scope: !853)
!869 = !DILocation(line: 186, column: 55, scope: !853)
!870 = !DILocation(line: 186, column: 33, scope: !853)
!871 = !DILocation(line: 186, column: 11, scope: !859)
!872 = !DILocation(line: 186, column: 9, scope: !853)
!873 = !DILocation(line: 187, column: 3, scope: !853)
!874 = !DILocation(line: 193, column: 37, scope: !853)
!875 = !DILocation(line: 193, column: 42, scope: !853)
!876 = !DILocation(line: 193, column: 20, scope: !853)
!877 = !DILocation(line: 193, column: 11, scope: !859)
!878 = !DILocation(line: 193, column: 9, scope: !853)
!879 = !DILocation(line: 194, column: 3, scope: !853)
!880 = !DILocation(line: 196, column: 9, scope: !842)
!881 = !DILocation(line: 196, column: 2, scope: !842)
!882 = distinct !DISubprogram(name: "settings_add_str_module", scope: !173, file: !173, line: 249, type: !883, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !99, !99, !99, !99}
!885 = !DILocalVariable(name: "module", arg: 1, scope: !882, file: !173, line: 249, type: !99)
!886 = !DILocation(line: 249, column: 42, scope: !882)
!887 = !DILocalVariable(name: "section", arg: 2, scope: !882, file: !173, line: 249, type: !99)
!888 = !DILocation(line: 249, column: 62, scope: !882)
!889 = !DILocalVariable(name: "key", arg: 3, scope: !882, file: !173, line: 250, type: !99)
!890 = !DILocation(line: 250, column: 21, scope: !882)
!891 = !DILocalVariable(name: "def", arg: 4, scope: !882, file: !173, line: 250, type: !99)
!892 = !DILocation(line: 250, column: 38, scope: !882)
!893 = !DILocalVariable(name: "default_value", scope: !882, file: !173, line: 252, type: !159)
!894 = !DILocation(line: 252, column: 15, scope: !882)
!895 = !DILocation(line: 254, column: 2, scope: !882)
!896 = !DILocation(line: 255, column: 36, scope: !882)
!897 = !DILocation(line: 255, column: 27, scope: !882)
!898 = !DILocation(line: 255, column: 16, scope: !882)
!899 = !DILocation(line: 255, column: 25, scope: !882)
!900 = !DILocation(line: 256, column: 15, scope: !882)
!901 = !DILocation(line: 256, column: 23, scope: !882)
!902 = !DILocation(line: 256, column: 32, scope: !882)
!903 = !DILocation(line: 256, column: 2, scope: !882)
!904 = !DILocation(line: 257, column: 1, scope: !882)
!905 = distinct !DISubprogram(name: "settings_add", scope: !173, file: !173, line: 199, type: !906, isLocal: true, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!906 = !DISubroutineType(types: !907)
!907 = !{null, !99, !99, !99, !157, !908, !99}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!910 = !DILocalVariable(name: "module", arg: 1, scope: !905, file: !173, line: 199, type: !99)
!911 = !DILocation(line: 199, column: 38, scope: !905)
!912 = !DILocalVariable(name: "section", arg: 2, scope: !905, file: !173, line: 199, type: !99)
!913 = !DILocation(line: 199, column: 58, scope: !905)
!914 = !DILocalVariable(name: "key", arg: 3, scope: !905, file: !173, line: 200, type: !99)
!915 = !DILocation(line: 200, column: 17, scope: !905)
!916 = !DILocalVariable(name: "type", arg: 4, scope: !905, file: !173, line: 200, type: !157)
!917 = !DILocation(line: 200, column: 34, scope: !905)
!918 = !DILocalVariable(name: "default_value", arg: 5, scope: !905, file: !173, line: 201, type: !908)
!919 = !DILocation(line: 201, column: 25, scope: !905)
!920 = !DILocalVariable(name: "choices", arg: 6, scope: !905, file: !173, line: 202, type: !99)
!921 = !DILocation(line: 202, column: 17, scope: !905)
!922 = !DILocalVariable(name: "rec", scope: !905, file: !173, line: 204, type: !147)
!923 = !DILocation(line: 204, column: 16, scope: !905)
!924 = !DILocalVariable(name: "choices_vec", scope: !905, file: !173, line: 205, type: !166)
!925 = !DILocation(line: 205, column: 9, scope: !905)
!926 = !DILocation(line: 207, column: 2, scope: !905)
!927 = distinct !{!927, !926}
!928 = !DILocation(line: 207, column: 10, scope: !929)
!929 = !DILexicalBlockFile(scope: !930, file: !173, discriminator: 1)
!930 = distinct !DILexicalBlock(scope: !931, file: !173, line: 207, column: 10)
!931 = distinct !DILexicalBlock(scope: !905, file: !173, line: 207, column: 4)
!932 = !DILocation(line: 207, column: 14, scope: !929)
!933 = !DILocation(line: 207, column: 5, scope: !934)
!934 = !DILexicalBlockFile(scope: !935, file: !173, discriminator: 2)
!935 = distinct !DILexicalBlock(scope: !930, file: !173, line: 207, column: 3)
!936 = !DILocation(line: 207, column: 14, scope: !937)
!937 = !DILexicalBlockFile(scope: !938, file: !173, discriminator: 3)
!938 = distinct !DILexicalBlock(scope: !930, file: !173, line: 207, column: 12)
!939 = !DILocation(line: 207, column: 98, scope: !937)
!940 = !DILocation(line: 207, column: 109, scope: !941)
!941 = !DILexicalBlockFile(scope: !931, file: !173, discriminator: 4)
!942 = !DILocation(line: 208, column: 2, scope: !905)
!943 = distinct !{!943, !942}
!944 = !DILocation(line: 208, column: 10, scope: !945)
!945 = !DILexicalBlockFile(scope: !946, file: !173, discriminator: 1)
!946 = distinct !DILexicalBlock(scope: !947, file: !173, line: 208, column: 10)
!947 = distinct !DILexicalBlock(scope: !905, file: !173, line: 208, column: 4)
!948 = !DILocation(line: 208, column: 18, scope: !945)
!949 = !DILocation(line: 208, column: 5, scope: !950)
!950 = !DILexicalBlockFile(scope: !951, file: !173, discriminator: 2)
!951 = distinct !DILexicalBlock(scope: !946, file: !173, line: 208, column: 3)
!952 = !DILocation(line: 208, column: 14, scope: !953)
!953 = !DILexicalBlockFile(scope: !954, file: !173, discriminator: 3)
!954 = distinct !DILexicalBlock(scope: !946, file: !173, line: 208, column: 12)
!955 = !DILocation(line: 208, column: 102, scope: !953)
!956 = !DILocation(line: 208, column: 113, scope: !957)
!957 = !DILexicalBlockFile(scope: !947, file: !173, discriminator: 4)
!958 = !DILocation(line: 210, column: 6, scope: !959)
!959 = distinct !DILexicalBlock(scope: !905, file: !173, line: 210, column: 6)
!960 = !DILocation(line: 210, column: 11, scope: !959)
!961 = !DILocation(line: 210, column: 6, scope: !905)
!962 = !DILocation(line: 211, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !964, file: !173, line: 211, column: 7)
!964 = distinct !DILexicalBlock(scope: !959, file: !173, line: 210, column: 35)
!965 = !DILocation(line: 211, column: 15, scope: !963)
!966 = !DILocation(line: 211, column: 7, scope: !964)
!967 = !DILocation(line: 212, column: 93, scope: !968)
!968 = distinct !DILexicalBlock(scope: !963, file: !173, line: 211, column: 23)
!969 = !DILocation(line: 212, column: 4, scope: !968)
!970 = !DILocation(line: 213, column: 4, scope: !968)
!971 = !DILocation(line: 216, column: 28, scope: !964)
!972 = !DILocation(line: 216, column: 17, scope: !964)
!973 = !DILocation(line: 216, column: 15, scope: !964)
!974 = !DILocation(line: 219, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !964, file: !173, line: 219, column: 7)
!976 = !DILocation(line: 219, column: 22, scope: !975)
!977 = !DILocation(line: 219, column: 28, scope: !975)
!978 = !DILocation(line: 219, column: 32, scope: !975)
!979 = !DILocation(line: 219, column: 35, scope: !980)
!980 = !DILexicalBlockFile(scope: !975, file: !173, discriminator: 1)
!981 = !DILocation(line: 219, column: 50, scope: !980)
!982 = !DILocation(line: 219, column: 73, scope: !980)
!983 = !DILocation(line: 219, column: 59, scope: !980)
!984 = !DILocation(line: 219, column: 56, scope: !980)
!985 = !DILocation(line: 219, column: 7, scope: !980)
!986 = !DILocation(line: 220, column: 107, scope: !987)
!987 = distinct !DILexicalBlock(scope: !975, file: !173, line: 219, column: 87)
!988 = !DILocation(line: 220, column: 4, scope: !987)
!989 = !DILocation(line: 221, column: 15, scope: !987)
!990 = !DILocation(line: 221, column: 4, scope: !987)
!991 = !DILocation(line: 222, column: 4, scope: !987)
!992 = !DILocation(line: 224, column: 2, scope: !964)
!993 = !DILocation(line: 226, column: 28, scope: !905)
!994 = !DILocation(line: 226, column: 38, scope: !905)
!995 = !DILocation(line: 226, column: 8, scope: !905)
!996 = !DILocation(line: 226, column: 6, scope: !905)
!997 = !DILocation(line: 227, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !905, file: !173, line: 227, column: 6)
!999 = !DILocation(line: 227, column: 10, scope: !998)
!1000 = !DILocation(line: 227, column: 6, scope: !905)
!1001 = !DILocation(line: 229, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !173, line: 229, column: 7)
!1003 = distinct !DILexicalBlock(scope: !998, file: !173, line: 227, column: 18)
!1004 = !DILocation(line: 229, column: 12, scope: !1002)
!1005 = !DILocation(line: 229, column: 20, scope: !1002)
!1006 = !DILocation(line: 229, column: 17, scope: !1002)
!1007 = !DILocation(line: 229, column: 7, scope: !1003)
!1008 = !DILocation(line: 230, column: 117, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1002, file: !173, line: 229, column: 26)
!1010 = !DILocation(line: 230, column: 4, scope: !1009)
!1011 = !DILocation(line: 232, column: 4, scope: !1009)
!1012 = !DILocation(line: 234, column: 3, scope: !1003)
!1013 = !DILocation(line: 234, column: 8, scope: !1003)
!1014 = !DILocation(line: 234, column: 16, scope: !1003)
!1015 = !DILocation(line: 235, column: 2, scope: !1003)
!1016 = !DILocation(line: 236, column: 27, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !998, file: !173, line: 235, column: 9)
!1018 = !DILocation(line: 236, column: 10, scope: !1017)
!1019 = !DILocation(line: 236, column: 7, scope: !1017)
!1020 = !DILocation(line: 237, column: 3, scope: !1017)
!1021 = !DILocation(line: 237, column: 8, scope: !1017)
!1022 = !DILocation(line: 237, column: 17, scope: !1017)
!1023 = !DILocation(line: 238, column: 26, scope: !1017)
!1024 = !DILocation(line: 238, column: 17, scope: !1017)
!1025 = !DILocation(line: 238, column: 3, scope: !1017)
!1026 = !DILocation(line: 238, column: 8, scope: !1017)
!1027 = !DILocation(line: 238, column: 15, scope: !1017)
!1028 = !DILocation(line: 239, column: 23, scope: !1017)
!1029 = !DILocation(line: 239, column: 14, scope: !1017)
!1030 = !DILocation(line: 239, column: 3, scope: !1017)
!1031 = !DILocation(line: 239, column: 8, scope: !1017)
!1032 = !DILocation(line: 239, column: 12, scope: !1017)
!1033 = !DILocation(line: 240, column: 27, scope: !1017)
!1034 = !DILocation(line: 240, column: 18, scope: !1017)
!1035 = !DILocation(line: 240, column: 3, scope: !1017)
!1036 = !DILocation(line: 240, column: 8, scope: !1017)
!1037 = !DILocation(line: 240, column: 16, scope: !1017)
!1038 = !DILocation(line: 241, column: 29, scope: !1017)
!1039 = !DILocation(line: 241, column: 17, scope: !1017)
!1040 = !DILocation(line: 241, column: 22, scope: !1017)
!1041 = !DILocation(line: 241, column: 27, scope: !1017)
!1042 = !DILocation(line: 243, column: 3, scope: !1017)
!1043 = !DILocation(line: 243, column: 8, scope: !1017)
!1044 = !DILocation(line: 243, column: 25, scope: !1017)
!1045 = !DILocation(line: 243, column: 24, scope: !1017)
!1046 = !DILocation(line: 244, column: 18, scope: !1017)
!1047 = !DILocation(line: 244, column: 3, scope: !1017)
!1048 = !DILocation(line: 244, column: 8, scope: !1017)
!1049 = !DILocation(line: 244, column: 16, scope: !1017)
!1050 = !DILocation(line: 245, column: 23, scope: !1017)
!1051 = !DILocation(line: 245, column: 33, scope: !1017)
!1052 = !DILocation(line: 245, column: 38, scope: !1017)
!1053 = !DILocation(line: 245, column: 43, scope: !1017)
!1054 = !DILocation(line: 245, column: 3, scope: !1017)
!1055 = !DILocation(line: 247, column: 1, scope: !905)
!1056 = distinct !DISubprogram(name: "settings_add_choice_module", scope: !173, file: !173, line: 259, type: !1057, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !99, !99, !99, !108, !99}
!1059 = !DILocalVariable(name: "module", arg: 1, scope: !1056, file: !173, line: 259, type: !99)
!1060 = !DILocation(line: 259, column: 45, scope: !1056)
!1061 = !DILocalVariable(name: "section", arg: 2, scope: !1056, file: !173, line: 259, type: !99)
!1062 = !DILocation(line: 259, column: 65, scope: !1056)
!1063 = !DILocalVariable(name: "key", arg: 3, scope: !1056, file: !173, line: 260, type: !99)
!1064 = !DILocation(line: 260, column: 17, scope: !1056)
!1065 = !DILocalVariable(name: "def", arg: 4, scope: !1056, file: !173, line: 260, type: !108)
!1066 = !DILocation(line: 260, column: 26, scope: !1056)
!1067 = !DILocalVariable(name: "choices", arg: 5, scope: !1056, file: !173, line: 260, type: !99)
!1068 = !DILocation(line: 260, column: 43, scope: !1056)
!1069 = !DILocalVariable(name: "default_value", scope: !1056, file: !173, line: 262, type: !159)
!1070 = !DILocation(line: 262, column: 15, scope: !1056)
!1071 = !DILocation(line: 264, column: 2, scope: !1056)
!1072 = !DILocation(line: 265, column: 24, scope: !1056)
!1073 = !DILocation(line: 265, column: 16, scope: !1056)
!1074 = !DILocation(line: 265, column: 22, scope: !1056)
!1075 = !DILocation(line: 266, column: 15, scope: !1056)
!1076 = !DILocation(line: 266, column: 23, scope: !1056)
!1077 = !DILocation(line: 266, column: 32, scope: !1056)
!1078 = !DILocation(line: 266, column: 74, scope: !1056)
!1079 = !DILocation(line: 266, column: 2, scope: !1056)
!1080 = !DILocation(line: 267, column: 1, scope: !1056)
!1081 = distinct !DISubprogram(name: "settings_add_int_module", scope: !173, file: !173, line: 269, type: !1082, isLocal: false, isDefinition: true, scopeLine: 271, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !99, !99, !99, !108}
!1084 = !DILocalVariable(name: "module", arg: 1, scope: !1081, file: !173, line: 269, type: !99)
!1085 = !DILocation(line: 269, column: 42, scope: !1081)
!1086 = !DILocalVariable(name: "section", arg: 2, scope: !1081, file: !173, line: 269, type: !99)
!1087 = !DILocation(line: 269, column: 62, scope: !1081)
!1088 = !DILocalVariable(name: "key", arg: 3, scope: !1081, file: !173, line: 270, type: !99)
!1089 = !DILocation(line: 270, column: 21, scope: !1081)
!1090 = !DILocalVariable(name: "def", arg: 4, scope: !1081, file: !173, line: 270, type: !108)
!1091 = !DILocation(line: 270, column: 30, scope: !1081)
!1092 = !DILocalVariable(name: "default_value", scope: !1081, file: !173, line: 272, type: !159)
!1093 = !DILocation(line: 272, column: 15, scope: !1081)
!1094 = !DILocation(line: 274, column: 2, scope: !1081)
!1095 = !DILocation(line: 275, column: 31, scope: !1081)
!1096 = !DILocation(line: 275, column: 23, scope: !1081)
!1097 = !DILocation(line: 275, column: 29, scope: !1081)
!1098 = !DILocation(line: 276, column: 15, scope: !1081)
!1099 = !DILocation(line: 276, column: 23, scope: !1081)
!1100 = !DILocation(line: 276, column: 32, scope: !1081)
!1101 = !DILocation(line: 276, column: 2, scope: !1081)
!1102 = !DILocation(line: 277, column: 1, scope: !1081)
!1103 = distinct !DISubprogram(name: "settings_add_bool_module", scope: !173, file: !173, line: 279, type: !1082, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1104 = !DILocalVariable(name: "module", arg: 1, scope: !1103, file: !173, line: 279, type: !99)
!1105 = !DILocation(line: 279, column: 43, scope: !1103)
!1106 = !DILocalVariable(name: "section", arg: 2, scope: !1103, file: !173, line: 279, type: !99)
!1107 = !DILocation(line: 279, column: 63, scope: !1103)
!1108 = !DILocalVariable(name: "key", arg: 3, scope: !1103, file: !173, line: 280, type: !99)
!1109 = !DILocation(line: 280, column: 22, scope: !1103)
!1110 = !DILocalVariable(name: "def", arg: 4, scope: !1103, file: !173, line: 280, type: !108)
!1111 = !DILocation(line: 280, column: 31, scope: !1103)
!1112 = !DILocalVariable(name: "default_value", scope: !1103, file: !173, line: 282, type: !159)
!1113 = !DILocation(line: 282, column: 15, scope: !1103)
!1114 = !DILocation(line: 284, column: 2, scope: !1103)
!1115 = !DILocation(line: 285, column: 32, scope: !1103)
!1116 = !DILocation(line: 285, column: 23, scope: !1103)
!1117 = !DILocation(line: 285, column: 30, scope: !1103)
!1118 = !DILocation(line: 286, column: 15, scope: !1103)
!1119 = !DILocation(line: 286, column: 23, scope: !1103)
!1120 = !DILocation(line: 286, column: 32, scope: !1103)
!1121 = !DILocation(line: 286, column: 2, scope: !1103)
!1122 = !DILocation(line: 287, column: 1, scope: !1103)
!1123 = distinct !DISubprogram(name: "settings_add_time_module", scope: !173, file: !173, line: 289, type: !883, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1124 = !DILocalVariable(name: "module", arg: 1, scope: !1123, file: !173, line: 289, type: !99)
!1125 = !DILocation(line: 289, column: 43, scope: !1123)
!1126 = !DILocalVariable(name: "section", arg: 2, scope: !1123, file: !173, line: 289, type: !99)
!1127 = !DILocation(line: 289, column: 63, scope: !1123)
!1128 = !DILocalVariable(name: "key", arg: 3, scope: !1123, file: !173, line: 290, type: !99)
!1129 = !DILocation(line: 290, column: 22, scope: !1123)
!1130 = !DILocalVariable(name: "def", arg: 4, scope: !1123, file: !173, line: 290, type: !99)
!1131 = !DILocation(line: 290, column: 39, scope: !1123)
!1132 = !DILocalVariable(name: "default_value", scope: !1123, file: !173, line: 292, type: !159)
!1133 = !DILocation(line: 292, column: 15, scope: !1123)
!1134 = !DILocation(line: 294, column: 2, scope: !1123)
!1135 = !DILocation(line: 295, column: 36, scope: !1123)
!1136 = !DILocation(line: 295, column: 27, scope: !1123)
!1137 = !DILocation(line: 295, column: 16, scope: !1123)
!1138 = !DILocation(line: 295, column: 25, scope: !1123)
!1139 = !DILocation(line: 296, column: 15, scope: !1123)
!1140 = !DILocation(line: 296, column: 23, scope: !1123)
!1141 = !DILocation(line: 296, column: 32, scope: !1123)
!1142 = !DILocation(line: 296, column: 2, scope: !1123)
!1143 = !DILocation(line: 297, column: 1, scope: !1123)
!1144 = distinct !DISubprogram(name: "settings_add_level_module", scope: !173, file: !173, line: 299, type: !883, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1145 = !DILocalVariable(name: "module", arg: 1, scope: !1144, file: !173, line: 299, type: !99)
!1146 = !DILocation(line: 299, column: 44, scope: !1144)
!1147 = !DILocalVariable(name: "section", arg: 2, scope: !1144, file: !173, line: 299, type: !99)
!1148 = !DILocation(line: 299, column: 64, scope: !1144)
!1149 = !DILocalVariable(name: "key", arg: 3, scope: !1144, file: !173, line: 300, type: !99)
!1150 = !DILocation(line: 300, column: 23, scope: !1144)
!1151 = !DILocalVariable(name: "def", arg: 4, scope: !1144, file: !173, line: 300, type: !99)
!1152 = !DILocation(line: 300, column: 40, scope: !1144)
!1153 = !DILocalVariable(name: "default_value", scope: !1144, file: !173, line: 302, type: !159)
!1154 = !DILocation(line: 302, column: 15, scope: !1144)
!1155 = !DILocation(line: 304, column: 2, scope: !1144)
!1156 = !DILocation(line: 305, column: 36, scope: !1144)
!1157 = !DILocation(line: 305, column: 27, scope: !1144)
!1158 = !DILocation(line: 305, column: 16, scope: !1144)
!1159 = !DILocation(line: 305, column: 25, scope: !1144)
!1160 = !DILocation(line: 306, column: 15, scope: !1144)
!1161 = !DILocation(line: 306, column: 23, scope: !1144)
!1162 = !DILocation(line: 306, column: 32, scope: !1144)
!1163 = !DILocation(line: 306, column: 2, scope: !1144)
!1164 = !DILocation(line: 307, column: 1, scope: !1144)
!1165 = distinct !DISubprogram(name: "settings_add_size_module", scope: !173, file: !173, line: 309, type: !883, isLocal: false, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1166 = !DILocalVariable(name: "module", arg: 1, scope: !1165, file: !173, line: 309, type: !99)
!1167 = !DILocation(line: 309, column: 43, scope: !1165)
!1168 = !DILocalVariable(name: "section", arg: 2, scope: !1165, file: !173, line: 309, type: !99)
!1169 = !DILocation(line: 309, column: 63, scope: !1165)
!1170 = !DILocalVariable(name: "key", arg: 3, scope: !1165, file: !173, line: 310, type: !99)
!1171 = !DILocation(line: 310, column: 22, scope: !1165)
!1172 = !DILocalVariable(name: "def", arg: 4, scope: !1165, file: !173, line: 310, type: !99)
!1173 = !DILocation(line: 310, column: 39, scope: !1165)
!1174 = !DILocalVariable(name: "default_value", scope: !1165, file: !173, line: 312, type: !159)
!1175 = !DILocation(line: 312, column: 15, scope: !1165)
!1176 = !DILocation(line: 314, column: 2, scope: !1165)
!1177 = !DILocation(line: 315, column: 36, scope: !1165)
!1178 = !DILocation(line: 315, column: 27, scope: !1165)
!1179 = !DILocation(line: 315, column: 16, scope: !1165)
!1180 = !DILocation(line: 315, column: 25, scope: !1165)
!1181 = !DILocation(line: 316, column: 15, scope: !1165)
!1182 = !DILocation(line: 316, column: 23, scope: !1165)
!1183 = !DILocation(line: 316, column: 32, scope: !1165)
!1184 = !DILocation(line: 316, column: 2, scope: !1165)
!1185 = !DILocation(line: 317, column: 1, scope: !1165)
!1186 = distinct !DISubprogram(name: "settings_remove", scope: !173, file: !173, line: 341, type: !1187, isLocal: false, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !99}
!1189 = !DILocalVariable(name: "key", arg: 1, scope: !1186, file: !173, line: 341, type: !99)
!1190 = !DILocation(line: 341, column: 34, scope: !1186)
!1191 = !DILocalVariable(name: "rec", scope: !1186, file: !173, line: 343, type: !147)
!1192 = !DILocation(line: 343, column: 16, scope: !1186)
!1193 = !DILocation(line: 345, column: 2, scope: !1186)
!1194 = distinct !{!1194, !1193}
!1195 = !DILocation(line: 345, column: 10, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1197, file: !173, discriminator: 1)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !173, line: 345, column: 10)
!1198 = distinct !DILexicalBlock(scope: !1186, file: !173, line: 345, column: 4)
!1199 = !DILocation(line: 345, column: 14, scope: !1196)
!1200 = !DILocation(line: 345, column: 5, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1202, file: !173, discriminator: 2)
!1202 = distinct !DILexicalBlock(scope: !1197, file: !173, line: 345, column: 3)
!1203 = !DILocation(line: 345, column: 14, scope: !1204)
!1204 = !DILexicalBlockFile(scope: !1205, file: !173, discriminator: 3)
!1205 = distinct !DILexicalBlock(scope: !1197, file: !173, line: 345, column: 12)
!1206 = !DILocation(line: 345, column: 98, scope: !1204)
!1207 = !DILocation(line: 345, column: 109, scope: !1208)
!1208 = !DILexicalBlockFile(scope: !1198, file: !173, discriminator: 4)
!1209 = !DILocation(line: 347, column: 28, scope: !1186)
!1210 = !DILocation(line: 347, column: 38, scope: !1186)
!1211 = !DILocation(line: 347, column: 8, scope: !1186)
!1212 = !DILocation(line: 347, column: 6, scope: !1186)
!1213 = !DILocation(line: 348, column: 6, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1186, file: !173, line: 348, column: 6)
!1215 = !DILocation(line: 348, column: 10, scope: !1214)
!1216 = !DILocation(line: 348, column: 6, scope: !1186)
!1217 = !DILocation(line: 349, column: 18, scope: !1214)
!1218 = !DILocation(line: 349, column: 3, scope: !1214)
!1219 = !DILocation(line: 350, column: 1, scope: !1186)
!1220 = distinct !DISubprogram(name: "settings_unref", scope: !173, file: !173, line: 332, type: !1221, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !147, !108}
!1223 = !DILocalVariable(name: "rec", arg: 1, scope: !1220, file: !173, line: 332, type: !147)
!1224 = !DILocation(line: 332, column: 42, scope: !1220)
!1225 = !DILocalVariable(name: "remove_hash", arg: 2, scope: !1220, file: !173, line: 332, type: !108)
!1226 = !DILocation(line: 332, column: 51, scope: !1220)
!1227 = !DILocation(line: 334, column: 8, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1220, file: !173, line: 334, column: 6)
!1229 = !DILocation(line: 334, column: 13, scope: !1228)
!1230 = !DILocation(line: 334, column: 6, scope: !1228)
!1231 = !DILocation(line: 334, column: 22, scope: !1228)
!1232 = !DILocation(line: 334, column: 6, scope: !1220)
!1233 = !DILocation(line: 335, column: 7, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !173, line: 335, column: 7)
!1235 = distinct !DILexicalBlock(scope: !1228, file: !173, line: 334, column: 28)
!1236 = !DILocation(line: 335, column: 7, scope: !1235)
!1237 = !DILocation(line: 336, column: 24, scope: !1234)
!1238 = !DILocation(line: 336, column: 34, scope: !1234)
!1239 = !DILocation(line: 336, column: 39, scope: !1234)
!1240 = !DILocation(line: 336, column: 4, scope: !1234)
!1241 = !DILocation(line: 337, column: 20, scope: !1235)
!1242 = !DILocation(line: 337, column: 3, scope: !1235)
!1243 = !DILocation(line: 338, column: 2, scope: !1235)
!1244 = !DILocation(line: 339, column: 1, scope: !1220)
!1245 = distinct !DISubprogram(name: "settings_remove_module", scope: !173, file: !173, line: 363, type: !1187, isLocal: false, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1246 = !DILocalVariable(name: "module", arg: 1, scope: !1245, file: !173, line: 363, type: !99)
!1247 = !DILocation(line: 363, column: 41, scope: !1245)
!1248 = !DILocation(line: 365, column: 30, scope: !1245)
!1249 = !DILocation(line: 367, column: 18, scope: !1245)
!1250 = !DILocation(line: 365, column: 2, scope: !1245)
!1251 = !DILocation(line: 368, column: 1, scope: !1245)
!1252 = distinct !DISubprogram(name: "settings_remove_hash", scope: !173, file: !173, line: 352, type: !1253, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!108, !99, !147, !99}
!1255 = !DILocalVariable(name: "key", arg: 1, scope: !1252, file: !173, line: 352, type: !99)
!1256 = !DILocation(line: 352, column: 45, scope: !1252)
!1257 = !DILocalVariable(name: "rec", arg: 2, scope: !1252, file: !173, line: 352, type: !147)
!1258 = !DILocation(line: 352, column: 64, scope: !1252)
!1259 = !DILocalVariable(name: "module", arg: 3, scope: !1252, file: !173, line: 353, type: !99)
!1260 = !DILocation(line: 353, column: 17, scope: !1252)
!1261 = !DILocation(line: 355, column: 16, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1252, file: !173, line: 355, column: 6)
!1263 = !DILocation(line: 355, column: 21, scope: !1262)
!1264 = !DILocation(line: 355, column: 29, scope: !1262)
!1265 = !DILocation(line: 355, column: 6, scope: !1262)
!1266 = !DILocation(line: 355, column: 37, scope: !1262)
!1267 = !DILocation(line: 355, column: 6, scope: !1252)
!1268 = !DILocation(line: 356, column: 18, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1262, file: !173, line: 355, column: 43)
!1270 = !DILocation(line: 356, column: 3, scope: !1269)
!1271 = !DILocation(line: 357, column: 17, scope: !1269)
!1272 = !DILocation(line: 360, column: 9, scope: !1252)
!1273 = !DILocation(line: 361, column: 1, scope: !1252)
!1274 = distinct !DISubprogram(name: "settings_set_choice", scope: !173, file: !173, line: 387, type: !1275, isLocal: false, isDefinition: true, scopeLine: 388, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!106, !99, !99}
!1277 = !DILocalVariable(name: "key", arg: 1, scope: !1274, file: !173, line: 387, type: !99)
!1278 = !DILocation(line: 387, column: 42, scope: !1274)
!1279 = !DILocalVariable(name: "value", arg: 2, scope: !1274, file: !173, line: 387, type: !99)
!1280 = !DILocation(line: 387, column: 59, scope: !1274)
!1281 = !DILocalVariable(name: "rec", scope: !1274, file: !173, line: 389, type: !147)
!1282 = !DILocation(line: 389, column: 16, scope: !1274)
!1283 = !DILocation(line: 391, column: 28, scope: !1274)
!1284 = !DILocation(line: 391, column: 8, scope: !1274)
!1285 = !DILocation(line: 391, column: 6, scope: !1274)
!1286 = !DILocation(line: 393, column: 6, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1274, file: !173, line: 393, column: 6)
!1288 = !DILocation(line: 393, column: 10, scope: !1287)
!1289 = !DILocation(line: 393, column: 17, scope: !1287)
!1290 = !DILocation(line: 393, column: 34, scope: !1291)
!1291 = !DILexicalBlockFile(scope: !1287, file: !173, discriminator: 1)
!1292 = !DILocation(line: 393, column: 39, scope: !1291)
!1293 = !DILocation(line: 393, column: 48, scope: !1291)
!1294 = !DILocation(line: 393, column: 20, scope: !1291)
!1295 = !DILocation(line: 393, column: 55, scope: !1291)
!1296 = !DILocation(line: 393, column: 6, scope: !1291)
!1297 = !DILocation(line: 394, column: 3, scope: !1287)
!1298 = !DILocation(line: 396, column: 19, scope: !1274)
!1299 = !DILocation(line: 396, column: 24, scope: !1274)
!1300 = !DILocation(line: 396, column: 2, scope: !1274)
!1301 = !DILocation(line: 398, column: 2, scope: !1274)
!1302 = !DILocation(line: 399, column: 1, scope: !1274)
!1303 = distinct !DISubprogram(name: "settings_get_record", scope: !173, file: !173, line: 461, type: !1304, isLocal: false, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !475)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!147, !99}
!1306 = !DILocalVariable(name: "key", arg: 1, scope: !1303, file: !173, line: 461, type: !99)
!1307 = !DILocation(line: 461, column: 47, scope: !1303)
!1308 = !DILocation(line: 463, column: 2, scope: !1303)
!1309 = distinct !{!1309, !1308}
!1310 = !DILocation(line: 463, column: 10, scope: !1311)
!1311 = !DILexicalBlockFile(scope: !1312, file: !173, discriminator: 1)
!1312 = distinct !DILexicalBlock(scope: !1313, file: !173, line: 463, column: 10)
!1313 = distinct !DILexicalBlock(scope: !1303, file: !173, line: 463, column: 4)
