; ModuleID = './line166-dcc-chat.o.i'
source_filename = "./line166-dcc-chat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56)
!1 = !DIFile(filename: "line166-dcc-chat.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !775, !214, !170, !510, !422, !606, !801, !213, !412, !74, !808, !549, !65, !125}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !59, line: 9, baseType: !60)
!59 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !61, line: 12, size: 1792, align: 64, elements: !62)
!61 = !DIFile(filename: "dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!62 = !{!63, !66, !67, !73, !749, !750, !751, !752, !753, !754, !755, !756, !760, !761, !762, !763, !764, !765, !766, !768, !769, !770, !771, !772, !773, !774}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !64, line: 1, baseType: !65, size: 32, align: 32)
!64 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !60, file: !64, line: 2, baseType: !65, size: 32, align: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !60, file: !64, line: 3, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !69, line: 75, baseType: !70)
!69 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !71, line: 139, baseType: !72)
!71 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !60, file: !64, line: 5, baseType: !74, size: 64, align: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !76, line: 6, baseType: !77)
!76 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !78, line: 42, size: 39168, align: 64, elements: !79)
!78 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = !{!80, !82, !83, !84, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !384, !385, !389, !390, !391, !395, !400, !401, !402, !403, !404, !405, !406, !407, !414, !415, !416, !417, !418, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !746, !748}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !81, line: 3, baseType: !65, size: 32, align: 32)
!81 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !77, file: !81, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !77, file: !81, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !77, file: !81, line: 8, baseType: !85, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !76, line: 5, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !78, line: 24, size: 2496, align: 64, elements: !88)
!88 = !{!89, !91, !92, !93, !96, !97, !98, !99, !100, !102, !103, !104, !105, !106, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !90, line: 3, baseType: !65, size: 32, align: 32)
!90 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !87, file: !90, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !87, file: !90, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !87, file: !90, line: 9, baseType: !94, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !87, file: !90, line: 10, baseType: !65, size: 32, align: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !87, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !87, file: !90, line: 13, baseType: !101, size: 16, align: 16, offset: 448)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !87, file: !90, line: 14, baseType: !94, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !87, file: !90, line: 15, baseType: !94, size: 64, align: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !87, file: !90, line: 16, baseType: !65, size: 32, align: 32, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !87, file: !90, line: 17, baseType: !94, size: 64, align: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !87, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !109, line: 99, baseType: !110)
!109 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !111, line: 22, size: 160, align: 32, elements: !112)
!111 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !110, file: !111, line: 23, baseType: !101, size: 16, align: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !110, file: !111, line: 24, baseType: !115, size: 128, align: 32, offset: 32)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !116, line: 211, size: 128, align: 32, elements: !117)
!116 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !115, file: !116, line: 220, baseType: !119, size: 128, align: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !115, file: !116, line: 213, size: 128, align: 32, elements: !120)
!120 = !{!121, !128, !133}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !119, file: !116, line: 215, baseType: !122, size: 128, align: 8)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, align: 8, elements: !126)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !124, line: 48, baseType: !125)
!124 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !119, file: !116, line: 217, baseType: !129, size: 128, align: 16)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, align: 16, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !124, line: 49, baseType: !101)
!131 = !{!132}
!132 = !DISubrange(count: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !119, file: !116, line: 218, baseType: !134, size: 128, align: 32)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, align: 32, elements: !137)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !124, line: 51, baseType: !136)
!136 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!137 = !{!138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !87, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !87, file: !90, line: 21, baseType: !94, size: 64, align: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !87, file: !90, line: 22, baseType: !94, size: 64, align: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !87, file: !90, line: 23, baseType: !94, size: 64, align: 64, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !87, file: !90, line: 24, baseType: !94, size: 64, align: 64, offset: 1088)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !87, file: !90, line: 26, baseType: !94, size: 64, align: 64, offset: 1152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !87, file: !90, line: 27, baseType: !94, size: 64, align: 64, offset: 1216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !87, file: !90, line: 28, baseType: !94, size: 64, align: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !87, file: !90, line: 29, baseType: !94, size: 64, align: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !87, file: !90, line: 30, baseType: !94, size: 64, align: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !87, file: !90, line: 31, baseType: !94, size: 64, align: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !87, file: !90, line: 32, baseType: !94, size: 64, align: 64, offset: 1536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !87, file: !90, line: 33, baseType: !94, size: 64, align: 64, offset: 1600)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !87, file: !90, line: 35, baseType: !153, size: 64, align: 64, offset: 1664)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !156)
!156 = !{!157, !160, !303, !304, !309, !310, !311, !312, !313, !322, !323, !324, !328, !329, !330, !331, !332, !333, !334, !335}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !155, file: !4, line: 100, baseType: !158, size: 32, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !159, line: 49, baseType: !65)
!159 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !155, file: !4, line: 101, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !164)
!164 = !{!165, !188, !194, !200, !204, !290, !294, !299}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !163, file: !4, line: 133, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !153, !170, !172, !175, !176}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !159, line: 46, baseType: !95)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !173, line: 66, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!174 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !179, line: 42, baseType: !180)
!179 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !179, line: 44, size: 128, align: 64, elements: !181)
!181 = !{!182, !186, !187}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !180, file: !179, line: 46, baseType: !183, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !184, line: 36, baseType: !185)
!184 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !173, line: 45, baseType: !136)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !180, file: !179, line: 47, baseType: !158, size: 32, align: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !180, file: !179, line: 48, baseType: !170, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !163, file: !4, line: 138, baseType: !189, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!169, !153, !192, !172, !175, !176}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !163, file: !4, line: 143, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!169, !153, !198, !199, !176}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !173, line: 51, baseType: !72)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !163, file: !4, line: 147, baseType: !201, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!169, !153, !176}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !163, file: !4, line: 149, baseType: !205, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !153, !289}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !211)
!211 = !{!212, !215, !236, !265, !267, !271, !272, !273, !274, !282, !283, !284, !285}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !210, file: !16, line: 174, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !159, line: 77, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !210, file: !16, line: 175, baseType: !216, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !219)
!219 = !{!220, !224, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !218, file: !16, line: 198, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !213}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !218, file: !16, line: 199, baseType: !221, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !218, file: !16, line: 200, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !213, !208, !229, !235}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !213}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !159, line: 50, baseType: !158)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !210, file: !16, line: 177, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !241)
!241 = !{!242, !247, !251, !255, !259, !260}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !240, file: !16, line: 216, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!234, !208, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !240, file: !16, line: 218, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!234, !208}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !240, file: !16, line: 219, baseType: !252, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!234, !208, !230, !213}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !240, file: !16, line: 222, baseType: !256, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !208}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !240, file: !16, line: 226, baseType: !230, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !240, file: !16, line: 227, baseType: !261, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !210, file: !16, line: 178, baseType: !266, size: 32, align: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !159, line: 55, baseType: !136)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !210, file: !16, line: 180, baseType: !268, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !270)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !210, file: !16, line: 182, baseType: !158, size: 32, align: 32, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !16, line: 183, baseType: !266, size: 32, align: 32, offset: 352)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !210, file: !16, line: 184, baseType: !266, size: 32, align: 32, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !210, file: !16, line: 186, baseType: !275, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !277, line: 37, baseType: !278)
!277 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !277, line: 39, size: 128, align: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !277, line: 41, baseType: !213, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !277, line: 42, baseType: !275, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !16, line: 188, baseType: !208, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !16, line: 189, baseType: !208, size: 64, align: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !16, line: 191, baseType: !94, size: 64, align: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !210, file: !16, line: 193, baseType: !286, size: 64, align: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !163, file: !4, line: 151, baseType: !291, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !153}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !163, file: !4, line: 152, baseType: !295, size: 64, align: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!169, !153, !298, !176}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !163, file: !4, line: 155, baseType: !300, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!298, !153}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !155, file: !4, line: 103, baseType: !170, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !155, file: !4, line: 104, baseType: !305, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !306, line: 77, baseType: !307)
!306 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !306, line: 77, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !155, file: !4, line: 105, baseType: !305, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !155, file: !4, line: 106, baseType: !170, size: 64, align: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !155, file: !4, line: 107, baseType: !266, size: 32, align: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !155, file: !4, line: 109, baseType: !172, size: 64, align: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !155, file: !4, line: 110, baseType: !314, size: 64, align: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !316, line: 39, baseType: !317)
!316 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !316, line: 41, size: 192, align: 64, elements: !318)
!318 = !{!319, !320, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !317, file: !316, line: 43, baseType: !170, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !317, file: !316, line: 44, baseType: !172, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !317, file: !316, line: 45, baseType: !172, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !155, file: !4, line: 111, baseType: !314, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !155, file: !4, line: 112, baseType: !314, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !155, file: !4, line: 113, baseType: !325, size: 48, align: 8, offset: 704)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 48, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 6)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !155, file: !4, line: 117, baseType: !266, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !155, file: !4, line: 118, baseType: !266, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !155, file: !4, line: 119, baseType: !266, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !155, file: !4, line: 120, baseType: !266, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !155, file: !4, line: 121, baseType: !266, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !155, file: !4, line: 122, baseType: !266, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !155, file: !4, line: 124, baseType: !213, size: 64, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !155, file: !4, line: 125, baseType: !213, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !87, file: !90, line: 38, baseType: !136, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !87, file: !90, line: 39, baseType: !136, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !87, file: !90, line: 40, baseType: !136, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !87, file: !90, line: 41, baseType: !136, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !87, file: !90, line: 42, baseType: !136, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !87, file: !90, line: 43, baseType: !136, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !87, file: !90, line: 44, baseType: !136, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !87, file: !90, line: 45, baseType: !136, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !87, file: !90, line: 46, baseType: !94, size: 64, align: 64, offset: 1792)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !87, file: !90, line: 47, baseType: !94, size: 64, align: 64, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !87, file: !78, line: 27, baseType: !94, size: 64, align: 64, offset: 1920)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !87, file: !78, line: 28, baseType: !94, size: 64, align: 64, offset: 1984)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !87, file: !78, line: 30, baseType: !65, size: 32, align: 32, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !87, file: !78, line: 31, baseType: !94, size: 64, align: 64, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !87, file: !78, line: 32, baseType: !94, size: 64, align: 64, offset: 2176)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !87, file: !78, line: 34, baseType: !65, size: 32, align: 32, offset: 2240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !87, file: !78, line: 35, baseType: !65, size: 32, align: 32, offset: 2272)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !87, file: !78, line: 36, baseType: !65, size: 32, align: 32, offset: 2304)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !87, file: !78, line: 38, baseType: !65, size: 32, align: 32, offset: 2336)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !87, file: !78, line: 38, baseType: !65, size: 32, align: 32, offset: 2368)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !87, file: !78, line: 38, baseType: !65, size: 32, align: 32, offset: 2400)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !87, file: !78, line: 38, baseType: !65, size: 32, align: 32, offset: 2432)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !77, file: !81, line: 9, baseType: !68, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !77, file: !81, line: 10, baseType: !68, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !77, file: !81, line: 12, baseType: !94, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !77, file: !81, line: 13, baseType: !94, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !77, file: !81, line: 15, baseType: !136, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !77, file: !81, line: 16, baseType: !136, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !77, file: !81, line: 17, baseType: !136, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !77, file: !81, line: 18, baseType: !136, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !77, file: !81, line: 19, baseType: !136, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !77, file: !81, line: 21, baseType: !368, size: 64, align: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !109, line: 102, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !371, line: 7, size: 384, align: 64, elements: !372)
!371 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!372 = !{!373, !374, !378, !379, !380, !381, !382, !383}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !370, file: !371, line: 8, baseType: !153, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !370, file: !371, line: 9, baseType: !375, size: 64, align: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !109, line: 101, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !109, line: 101, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !370, file: !371, line: 11, baseType: !65, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !370, file: !371, line: 12, baseType: !65, size: 32, align: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !370, file: !371, line: 13, baseType: !65, size: 32, align: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !370, file: !371, line: 14, baseType: !94, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !370, file: !371, line: 15, baseType: !65, size: 32, align: 32, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !370, file: !371, line: 16, baseType: !136, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !77, file: !81, line: 22, baseType: !65, size: 32, align: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !77, file: !81, line: 25, baseType: !386, size: 128, align: 64, offset: 640)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, align: 64, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 2)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !77, file: !81, line: 26, baseType: !65, size: 32, align: 32, offset: 768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !77, file: !81, line: 27, baseType: !65, size: 32, align: 32, offset: 800)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !77, file: !81, line: 29, baseType: !392, size: 64, align: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !109, line: 103, baseType: !394)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !109, line: 103, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !77, file: !81, line: 30, baseType: !396, size: 64, align: 64, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !398, line: 37, baseType: !399)
!398 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !398, line: 37, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !81, line: 32, baseType: !94, size: 64, align: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !77, file: !81, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !77, file: !81, line: 34, baseType: !94, size: 64, align: 64, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !77, file: !81, line: 35, baseType: !136, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !77, file: !81, line: 36, baseType: !136, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !77, file: !81, line: 37, baseType: !136, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !77, file: !81, line: 38, baseType: !136, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !77, file: !81, line: 40, baseType: !408, size: 128, align: 64, offset: 1216)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !159, line: 504, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !159, line: 506, size: 128, align: 64, elements: !410)
!410 = !{!411, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !409, file: !159, line: 508, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !159, line: 48, baseType: !72)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !409, file: !159, line: 509, baseType: !412, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !77, file: !81, line: 41, baseType: !68, size: 64, align: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !77, file: !81, line: 42, baseType: !65, size: 32, align: 32, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !77, file: !81, line: 44, baseType: !275, size: 64, align: 64, offset: 1472)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !77, file: !81, line: 45, baseType: !275, size: 64, align: 64, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !77, file: !81, line: 53, baseType: !419, size: 64, align: 64, offset: 1600)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422, !510, !65}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !109, line: 107, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !425, line: 30, size: 2240, align: 64, elements: !426)
!425 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!426 = !{!427, !428, !429, !430, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !506, !512, !516, !520, !525, !602, !629, !633}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !81, line: 3, baseType: !65, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !424, file: !81, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !424, file: !81, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !424, file: !81, line: 8, baseType: !431, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !109, line: 113, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !425, line: 25, size: 1920, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !90, line: 3, baseType: !65, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !433, file: !90, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !433, file: !90, line: 6, baseType: !65, size: 32, align: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !433, file: !90, line: 9, baseType: !94, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !433, file: !90, line: 10, baseType: !65, size: 32, align: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !433, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !433, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !433, file: !90, line: 11, baseType: !94, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !433, file: !90, line: 13, baseType: !101, size: 16, align: 16, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !433, file: !90, line: 14, baseType: !94, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !433, file: !90, line: 15, baseType: !94, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !433, file: !90, line: 16, baseType: !65, size: 32, align: 32, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !433, file: !90, line: 17, baseType: !94, size: 64, align: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !433, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !433, file: !90, line: 19, baseType: !107, size: 64, align: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !433, file: !90, line: 21, baseType: !94, size: 64, align: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !433, file: !90, line: 22, baseType: !94, size: 64, align: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !433, file: !90, line: 23, baseType: !94, size: 64, align: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !433, file: !90, line: 24, baseType: !94, size: 64, align: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !433, file: !90, line: 26, baseType: !94, size: 64, align: 64, offset: 1152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !433, file: !90, line: 27, baseType: !94, size: 64, align: 64, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !433, file: !90, line: 28, baseType: !94, size: 64, align: 64, offset: 1280)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !433, file: !90, line: 29, baseType: !94, size: 64, align: 64, offset: 1344)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !433, file: !90, line: 30, baseType: !94, size: 64, align: 64, offset: 1408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !433, file: !90, line: 31, baseType: !94, size: 64, align: 64, offset: 1472)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !433, file: !90, line: 32, baseType: !94, size: 64, align: 64, offset: 1536)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !433, file: !90, line: 33, baseType: !94, size: 64, align: 64, offset: 1600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !433, file: !90, line: 35, baseType: !153, size: 64, align: 64, offset: 1664)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !433, file: !90, line: 38, baseType: !136, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !433, file: !90, line: 39, baseType: !136, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !433, file: !90, line: 40, baseType: !136, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !433, file: !90, line: 41, baseType: !136, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !433, file: !90, line: 42, baseType: !136, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !433, file: !90, line: 43, baseType: !136, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !433, file: !90, line: 44, baseType: !136, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !433, file: !90, line: 45, baseType: !136, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !433, file: !90, line: 46, baseType: !94, size: 64, align: 64, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !433, file: !90, line: 47, baseType: !94, size: 64, align: 64, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !424, file: !81, line: 9, baseType: !68, size: 64, align: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !424, file: !81, line: 10, baseType: !68, size: 64, align: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !424, file: !81, line: 12, baseType: !94, size: 64, align: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !424, file: !81, line: 13, baseType: !94, size: 64, align: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !424, file: !81, line: 15, baseType: !136, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !424, file: !81, line: 16, baseType: !136, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !424, file: !81, line: 17, baseType: !136, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !424, file: !81, line: 18, baseType: !136, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !424, file: !81, line: 19, baseType: !136, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !424, file: !81, line: 21, baseType: !368, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !424, file: !81, line: 22, baseType: !65, size: 32, align: 32, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !424, file: !81, line: 25, baseType: !386, size: 128, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !424, file: !81, line: 26, baseType: !65, size: 32, align: 32, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !424, file: !81, line: 27, baseType: !65, size: 32, align: 32, offset: 800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !424, file: !81, line: 29, baseType: !392, size: 64, align: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !424, file: !81, line: 30, baseType: !396, size: 64, align: 64, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !424, file: !81, line: 32, baseType: !94, size: 64, align: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !424, file: !81, line: 33, baseType: !94, size: 64, align: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !424, file: !81, line: 34, baseType: !94, size: 64, align: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !424, file: !81, line: 35, baseType: !136, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !424, file: !81, line: 36, baseType: !136, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !424, file: !81, line: 37, baseType: !136, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !424, file: !81, line: 38, baseType: !136, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !424, file: !81, line: 40, baseType: !408, size: 128, align: 64, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !424, file: !81, line: 41, baseType: !68, size: 64, align: 64, offset: 1344)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !424, file: !81, line: 42, baseType: !65, size: 32, align: 32, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !424, file: !81, line: 44, baseType: !275, size: 64, align: 64, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !424, file: !81, line: 45, baseType: !275, size: 64, align: 64, offset: 1536)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !424, file: !81, line: 53, baseType: !419, size: 64, align: 64, offset: 1600)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !424, file: !81, line: 55, baseType: !503, size: 64, align: 64, offset: 1664)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!65, !422, !95}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !424, file: !81, line: 57, baseType: !507, size: 64, align: 64, offset: 1728)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!65, !422, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !424, file: !81, line: 60, baseType: !513, size: 64, align: 64, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!510, !422}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !424, file: !81, line: 62, baseType: !517, size: 64, align: 64, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !422, !510, !510, !65}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !424, file: !81, line: 65, baseType: !521, size: 64, align: 64, offset: 1920)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!524, !422, !510, !510}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !424, file: !81, line: 69, baseType: !526, size: 64, align: 64, offset: 1984)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!529, !422, !510}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !109, line: 109, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !532, line: 15, size: 1408, align: 64, elements: !533)
!532 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!533 = !{!534, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !552, !556, !558, !559, !560, !561, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !535, line: 3, baseType: !65, size: 32, align: 32)
!535 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !531, file: !535, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !531, file: !535, line: 5, baseType: !396, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !531, file: !535, line: 7, baseType: !214, size: 64, align: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !531, file: !535, line: 8, baseType: !422, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !531, file: !535, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !535, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !531, file: !535, line: 11, baseType: !68, size: 64, align: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !531, file: !535, line: 12, baseType: !65, size: 32, align: 32, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !531, file: !535, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !531, file: !535, line: 15, baseType: !546, size: 64, align: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !109, line: 108, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !109, line: 108, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !531, file: !535, line: 17, baseType: !553, size: 64, align: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!510, !549}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !531, file: !557, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!557 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!558 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !531, file: !557, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !531, file: !557, line: 7, baseType: !68, size: 64, align: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !531, file: !557, line: 9, baseType: !396, size: 64, align: 64, offset: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !531, file: !557, line: 10, baseType: !562, size: 64, align: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !109, line: 111, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !565, line: 13, size: 576, align: 64, elements: !566)
!565 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!566 = !{!567, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !584}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !568, line: 3, baseType: !65, size: 32, align: 32)
!568 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!569 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !564, file: !568, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !564, file: !568, line: 6, baseType: !68, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !564, file: !568, line: 8, baseType: !94, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !564, file: !568, line: 9, baseType: !94, size: 64, align: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !564, file: !568, line: 10, baseType: !94, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !564, file: !568, line: 11, baseType: !65, size: 32, align: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !564, file: !568, line: 14, baseType: !136, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !564, file: !568, line: 15, baseType: !136, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !564, file: !568, line: 18, baseType: !136, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !564, file: !568, line: 19, baseType: !136, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !564, file: !568, line: 20, baseType: !136, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !564, file: !568, line: 21, baseType: !136, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !564, file: !568, line: 22, baseType: !582, size: 64, align: 8, offset: 360)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, align: 8, elements: !131)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !564, file: !568, line: 26, baseType: !214, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !568, line: 28, baseType: !562, size: 64, align: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !531, file: !557, line: 12, baseType: !136, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !531, file: !557, line: 13, baseType: !94, size: 64, align: 64, offset: 1088)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !531, file: !557, line: 14, baseType: !65, size: 32, align: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !531, file: !557, line: 15, baseType: !94, size: 64, align: 64, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !531, file: !557, line: 17, baseType: !136, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !531, file: !557, line: 18, baseType: !136, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !531, file: !557, line: 19, baseType: !136, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !531, file: !557, line: 20, baseType: !136, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !531, file: !557, line: 22, baseType: !136, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !531, file: !557, line: 23, baseType: !136, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !531, file: !557, line: 24, baseType: !136, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !531, file: !557, line: 25, baseType: !136, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !531, file: !557, line: 26, baseType: !136, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !531, file: !557, line: 31, baseType: !599, size: 64, align: 64, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!94, !529}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !424, file: !81, line: 70, baseType: !603, size: 64, align: 64, offset: 2048)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !422, !510}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !109, line: 110, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !609, line: 15, size: 960, align: 64, elements: !610)
!609 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !625, !626, !627, !628}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !535, line: 3, baseType: !65, size: 32, align: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !608, file: !535, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !608, file: !535, line: 5, baseType: !396, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !608, file: !535, line: 7, baseType: !214, size: 64, align: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !608, file: !535, line: 8, baseType: !422, size: 64, align: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !608, file: !535, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !608, file: !535, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !608, file: !535, line: 11, baseType: !68, size: 64, align: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !608, file: !535, line: 12, baseType: !65, size: 32, align: 32, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !608, file: !535, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !608, file: !535, line: 15, baseType: !546, size: 64, align: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !608, file: !535, line: 17, baseType: !553, size: 64, align: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !608, file: !624, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!624 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!625 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !608, file: !624, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !608, file: !624, line: 7, baseType: !68, size: 64, align: 64, offset: 832)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !608, file: !624, line: 9, baseType: !136, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !608, file: !624, line: 11, baseType: !136, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !424, file: !81, line: 71, baseType: !630, size: 64, align: 64, offset: 2112)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!65, !510, !510}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !424, file: !81, line: 73, baseType: !630, size: 64, align: 64, offset: 2176)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !77, file: !81, line: 55, baseType: !503, size: 64, align: 64, offset: 1664)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !77, file: !81, line: 57, baseType: !507, size: 64, align: 64, offset: 1728)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !77, file: !81, line: 60, baseType: !513, size: 64, align: 64, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !77, file: !81, line: 62, baseType: !517, size: 64, align: 64, offset: 1856)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !77, file: !81, line: 65, baseType: !521, size: 64, align: 64, offset: 1920)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !77, file: !81, line: 69, baseType: !526, size: 64, align: 64, offset: 1984)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !77, file: !81, line: 70, baseType: !603, size: 64, align: 64, offset: 2048)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !77, file: !81, line: 71, baseType: !630, size: 64, align: 64, offset: 2112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !77, file: !81, line: 73, baseType: !630, size: 64, align: 64, offset: 2176)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !77, file: !78, line: 46, baseType: !275, size: 64, align: 64, offset: 2240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !77, file: !78, line: 47, baseType: !275, size: 64, align: 64, offset: 2304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !77, file: !78, line: 48, baseType: !646, size: 64, align: 64, offset: 2368)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !76, line: 8, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !76, line: 8, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !77, file: !78, line: 49, baseType: !275, size: 64, align: 64, offset: 2432)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !77, file: !78, line: 51, baseType: !94, size: 64, align: 64, offset: 2496)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !77, file: !78, line: 53, baseType: !94, size: 64, align: 64, offset: 2560)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !77, file: !78, line: 54, baseType: !94, size: 64, align: 64, offset: 2624)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !77, file: !78, line: 55, baseType: !94, size: 64, align: 64, offset: 2688)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !77, file: !78, line: 56, baseType: !94, size: 64, align: 64, offset: 2752)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !77, file: !78, line: 57, baseType: !65, size: 32, align: 32, offset: 2816)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !77, file: !78, line: 59, baseType: !136, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !77, file: !78, line: 60, baseType: !136, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !77, file: !78, line: 62, baseType: !136, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !77, file: !78, line: 63, baseType: !136, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !77, file: !78, line: 64, baseType: !136, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !77, file: !78, line: 65, baseType: !136, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !77, file: !78, line: 66, baseType: !136, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !77, file: !78, line: 67, baseType: !136, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !77, file: !78, line: 68, baseType: !136, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !77, file: !78, line: 69, baseType: !136, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !77, file: !78, line: 70, baseType: !136, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !77, file: !78, line: 71, baseType: !136, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !77, file: !78, line: 72, baseType: !136, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !77, file: !78, line: 74, baseType: !65, size: 32, align: 32, offset: 2880)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !77, file: !78, line: 75, baseType: !65, size: 32, align: 32, offset: 2912)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !77, file: !78, line: 76, baseType: !65, size: 32, align: 32, offset: 2944)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !77, file: !78, line: 77, baseType: !65, size: 32, align: 32, offset: 2976)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !77, file: !78, line: 79, baseType: !396, size: 64, align: 64, offset: 3008)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !77, file: !78, line: 80, baseType: !275, size: 64, align: 64, offset: 3072)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !77, file: !78, line: 81, baseType: !275, size: 64, align: 64, offset: 3136)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !77, file: !78, line: 83, baseType: !314, size: 64, align: 64, offset: 3200)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !77, file: !78, line: 84, baseType: !266, size: 32, align: 32, offset: 3264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !77, file: !78, line: 87, baseType: !65, size: 32, align: 32, offset: 3296)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !77, file: !78, line: 91, baseType: !275, size: 64, align: 64, offset: 3328)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !77, file: !78, line: 92, baseType: !408, size: 128, align: 64, offset: 3392)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !77, file: !78, line: 93, baseType: !408, size: 128, align: 64, offset: 3520)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !77, file: !78, line: 95, baseType: !65, size: 32, align: 32, offset: 3648)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !77, file: !78, line: 96, baseType: !65, size: 32, align: 32, offset: 3680)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !77, file: !78, line: 97, baseType: !65, size: 32, align: 32, offset: 3712)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !77, file: !78, line: 100, baseType: !275, size: 64, align: 64, offset: 3776)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !77, file: !78, line: 103, baseType: !275, size: 64, align: 64, offset: 3840)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !77, file: !78, line: 106, baseType: !275, size: 64, align: 64, offset: 3904)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !77, file: !78, line: 108, baseType: !396, size: 64, align: 64, offset: 3968)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !77, file: !78, line: 109, baseType: !275, size: 64, align: 64, offset: 4032)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !77, file: !78, line: 111, baseType: !275, size: 64, align: 64, offset: 4096)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !77, file: !78, line: 114, baseType: !214, size: 64, align: 64, offset: 4160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !77, file: !78, line: 116, baseType: !396, size: 64, align: 64, offset: 4224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !77, file: !78, line: 117, baseType: !694, size: 32768, align: 64, offset: 4288)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 32768, align: 64, elements: !744)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !696, line: 10, size: 128, align: 64, elements: !697)
!696 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!697 = !{!698, !743}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !695, file: !696, line: 11, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !696, line: 7, baseType: !701)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !703, !510, !95, !95, !94, !314}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !76, line: 7, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !706, line: 15, size: 1600, align: 64, elements: !707)
!706 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !535, line: 3, baseType: !65, size: 32, align: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !705, file: !535, line: 4, baseType: !65, size: 32, align: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !705, file: !535, line: 5, baseType: !396, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !705, file: !535, line: 7, baseType: !214, size: 64, align: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !705, file: !535, line: 8, baseType: !74, size: 64, align: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !705, file: !535, line: 9, baseType: !94, size: 64, align: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !535, line: 10, baseType: !94, size: 64, align: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !705, file: !535, line: 11, baseType: !68, size: 64, align: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !705, file: !535, line: 12, baseType: !65, size: 32, align: 32, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !705, file: !535, line: 13, baseType: !94, size: 64, align: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !705, file: !535, line: 15, baseType: !546, size: 64, align: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !705, file: !535, line: 17, baseType: !553, size: 64, align: 64, offset: 640)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !705, file: !557, line: 5, baseType: !94, size: 64, align: 64, offset: 704)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !705, file: !557, line: 6, baseType: !94, size: 64, align: 64, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !705, file: !557, line: 7, baseType: !68, size: 64, align: 64, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !705, file: !557, line: 9, baseType: !396, size: 64, align: 64, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !705, file: !557, line: 10, baseType: !562, size: 64, align: 64, offset: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !705, file: !557, line: 12, baseType: !136, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !705, file: !557, line: 13, baseType: !94, size: 64, align: 64, offset: 1088)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !705, file: !557, line: 14, baseType: !65, size: 32, align: 32, offset: 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !705, file: !557, line: 15, baseType: !94, size: 64, align: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !705, file: !557, line: 17, baseType: !136, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !705, file: !557, line: 18, baseType: !136, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !705, file: !557, line: 19, baseType: !136, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !705, file: !557, line: 20, baseType: !136, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !705, file: !557, line: 22, baseType: !136, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !705, file: !557, line: 23, baseType: !136, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !705, file: !557, line: 24, baseType: !136, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !705, file: !557, line: 25, baseType: !136, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !705, file: !557, line: 26, baseType: !136, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !705, file: !557, line: 31, baseType: !599, size: 64, align: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !705, file: !706, line: 18, baseType: !275, size: 64, align: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !705, file: !706, line: 20, baseType: !68, size: 64, align: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !705, file: !706, line: 21, baseType: !65, size: 32, align: 32, offset: 1536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !705, file: !706, line: 22, baseType: !65, size: 32, align: 32, offset: 1568)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !695, file: !696, line: 12, baseType: !95, size: 8, align: 8, offset: 64)
!744 = !{!745}
!745 = !DISubrange(count: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !77, file: !78, line: 118, baseType: !747, size: 2048, align: 8, offset: 37056)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, align: 8, elements: !744)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !77, file: !78, line: 120, baseType: !630, size: 64, align: 64, offset: 39104)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !60, file: !64, line: 6, baseType: !94, size: 64, align: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !60, file: !64, line: 7, baseType: !94, size: 64, align: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !60, file: !64, line: 8, baseType: !94, size: 64, align: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !60, file: !64, line: 10, baseType: !57, size: 64, align: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !60, file: !64, line: 11, baseType: !94, size: 64, align: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !60, file: !64, line: 12, baseType: !94, size: 64, align: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !60, file: !64, line: 14, baseType: !108, size: 160, align: 32, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !60, file: !64, line: 15, baseType: !757, size: 368, align: 8, offset: 736)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 368, align: 8, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 46)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !60, file: !64, line: 16, baseType: !65, size: 32, align: 32, offset: 1120)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !60, file: !64, line: 18, baseType: !153, size: 64, align: 64, offset: 1152)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !60, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1216)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !60, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1248)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !60, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !60, file: !64, line: 20, baseType: !68, size: 64, align: 64, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !60, file: !64, line: 21, baseType: !767, size: 64, align: 64, offset: 1408)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !109, line: 49, baseType: !174)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !60, file: !64, line: 23, baseType: !65, size: 32, align: 32, offset: 1472)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !60, file: !64, line: 25, baseType: !136, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !60, file: !64, line: 27, baseType: !396, size: 64, align: 64, offset: 1536)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !61, line: 15, baseType: !94, size: 64, align: 64, offset: 1600)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !60, file: !61, line: 16, baseType: !368, size: 64, align: 64, offset: 1664)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !60, file: !61, line: 18, baseType: !136, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !60, file: !61, line: 19, baseType: !136, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !59, line: 13, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 11, size: 1600, align: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !64, line: 1, baseType: !65, size: 32, align: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !777, file: !64, line: 2, baseType: !65, size: 32, align: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !777, file: !64, line: 3, baseType: !68, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !777, file: !64, line: 5, baseType: !74, size: 64, align: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !777, file: !64, line: 6, baseType: !94, size: 64, align: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !777, file: !64, line: 7, baseType: !94, size: 64, align: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !777, file: !64, line: 8, baseType: !94, size: 64, align: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !777, file: !64, line: 10, baseType: !57, size: 64, align: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !777, file: !64, line: 11, baseType: !94, size: 64, align: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !777, file: !64, line: 12, baseType: !94, size: 64, align: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !777, file: !64, line: 14, baseType: !108, size: 160, align: 32, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !777, file: !64, line: 15, baseType: !757, size: 368, align: 8, offset: 736)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !777, file: !64, line: 16, baseType: !65, size: 32, align: 32, offset: 1120)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !777, file: !64, line: 18, baseType: !153, size: 64, align: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !777, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !777, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !777, file: !64, line: 19, baseType: !65, size: 32, align: 32, offset: 1280)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !777, file: !64, line: 20, baseType: !68, size: 64, align: 64, offset: 1344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !777, file: !64, line: 21, baseType: !767, size: 64, align: 64, offset: 1408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !777, file: !64, line: 23, baseType: !65, size: 32, align: 32, offset: 1472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !777, file: !64, line: 25, baseType: !136, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !777, file: !64, line: 27, baseType: !396, size: 64, align: 64, offset: 1536)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !802, line: 9, baseType: !803)
!802 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !806, !806, !806, !806, !806, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !109, line: 60, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !214, !153, !65}
!812 = !{i32 2, !"Dwarf Version", i32 4}
!813 = !{i32 2, !"Debug Info Version", i32 3}
!814 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!815 = distinct !DISubprogram(name: "dcc_chat_create", scope: !816, file: !816, line: 57, type: !817, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !819)
!816 = !DIFile(filename: "dcc-chat.c", directory: "/home/lichi/Desktop/irssi/task1")
!817 = !DISubroutineType(types: !818)
!818 = !{!57, !74, !57, !510, !510}
!819 = !{}
!820 = !DILocalVariable(name: "server", arg: 1, scope: !815, file: !816, line: 57, type: !74)
!821 = !DIExpression()
!822 = !DILocation(line: 57, column: 47, scope: !815)
