; ModuleID = './line244-fe-tls.o.i'
source_filename = "./line244-fe-tls.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._SERVER_REC = type opaque
%struct._TLS_REC = type { i8*, i8*, i64, i8*, i8*, i8*, i64, i8*, i8*, i8*, i8*, i8*, i64, %struct._GSList* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GString = type { i8*, i64, i64 }
%struct._TLS_CERT_ENTRY_REC = type { i8*, i8* }
%struct._TLS_CERT_REC = type { %struct._GSList*, %struct._GSList* }

@.str = private unnamed_addr constant [15 x i8] c"fe-common/core\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"lookandfeel\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"tls_verbose_connect\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"tls handshake finished\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"%s: %s, \00", align 1

; Function Attrs: nounwind uwtable
define void @fe_tls_init() #0 !dbg !288 {
  call void @settings_add_bool_module(i8* getelementptr inbounds ([15 x i8], [15 x i8]* @.str, i32 0, i32 0), i8* getelementptr inbounds ([12 x i8], [12 x i8]* @.str.1, i32 0, i32 0), i8* getelementptr inbounds ([20 x i8], [20 x i8]* @.str.2, i32 0, i32 0), i32 1), !dbg !293

!225 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!226 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!227 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!228 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!229 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!230 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!231 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!232 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!233 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!234 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!235 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!236 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!237 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!238 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!239 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!240 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!241 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!242 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!243 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!244 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!245 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!246 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!247 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!248 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!249 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!250 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!251 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!252 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!253 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!254 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!255 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!256 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!257 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!258 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!259 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!260 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!261 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!262 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!263 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!264 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!265 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!266 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!267 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!268 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!269 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!270 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!271 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!272 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!273 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!274 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!275 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!276 = !{!277, !284}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !278, line: 9, baseType: !279)
!278 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282, !282, !282, !282, !282, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!285 = !{i32 2, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!288 = distinct !DISubprogram(name: "fe_tls_init", scope: !289, file: !289, line: 84, type: !290, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !292)
!289 = !DIFile(filename: "fe-tls.c", directory: "/home/lichi/Desktop/irssi/task1")
!290 = !DISubroutineType(types: !291)
!291 = !{null}
!292 = !{}
!293 = !DILocation(line: 86, column: 2, scope: !288)
!294 = !DILocation(line: 88, column: 2, scope: !288)
!295 = !DILocation(line: 89, column: 1, scope: !288)
!296 = distinct !DISubprogram(name: "tls_handshake_finished", scope: !289, file: !289, line: 30, type: !297, isLocal: true, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !292)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299, !303}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !301, line: 107, baseType: !302)
!301 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !301, line: 107, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_REC", file: !305, line: 26, baseType: !306)
!305 = !DIFile(filename: "../../../src/core/tls.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_REC", file: !305, line: 30, size: 896, align: 64, elements: !307)
!307 = !{!308, !311, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !306, file: !305, line: 31, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !306, file: !305, line: 32, baseType: !309, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_size", scope: !306, file: !305, line: 33, baseType: !313, size: 64, align: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !314, line: 216, baseType: !315)
!314 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_algorithm", scope: !306, file: !305, line: 35, baseType: !309, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_fingerprint", scope: !306, file: !305, line: 36, baseType: !309, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_fingerprint_algorithm", scope: !306, file: !305, line: 37, baseType: !309, size: 64, align: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "public_key_size", scope: !306, file: !305, line: 38, baseType: !313, size: 64, align: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_fingerprint", scope: !306, file: !305, line: 40, baseType: !309, size: 64, align: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "certificate_fingerprint_algorithm", scope: !306, file: !305, line: 41, baseType: !309, size: 64, align: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "not_after", scope: !306, file: !305, line: 43, baseType: !309, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "not_before", scope: !306, file: !305, line: 44, baseType: !309, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ephemeral_key_algorithm", scope: !306, file: !305, line: 46, baseType: !309, size: 64, align: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ephemeral_key_size", scope: !306, file: !305, line: 47, baseType: !313, size: 64, align: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "certs", scope: !306, file: !305, line: 49, baseType: !327, size: 64, align: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !329, line: 37, baseType: !330)
!329 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !329, line: 39, size: 128, align: 64, elements: !331)
!331 = !{!332, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 41, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !334, line: 77, baseType: !284)
!334 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !329, line: 42, baseType: !327, size: 64, align: 64, offset: 64)
!336 = !DILocalVariable(name: "server", arg: 1, scope: !296, file: !289, line: 30, type: !299)
!337 = !DIExpression()
!338 = !DILocation(line: 30, column: 48, scope: !296)
!339 = !DILocalVariable(name: "tls", arg: 2, scope: !296, file: !289, line: 30, type: !303)
!340 = !DILocation(line: 30, column: 65, scope: !296)
!341 = !DILocalVariable(name: "certs", scope: !296, file: !289, line: 32, type: !327)
!342 = !DILocation(line: 32, column: 10, scope: !296)
!343 = !DILocalVariable(name: "subject", scope: !296, file: !289, line: 33, type: !327)
!344 = !DILocation(line: 33, column: 10, scope: !296)
!345 = !DILocalVariable(name: "issuer", scope: !296, file: !289, line: 34, type: !327)
!346 = !DILocation(line: 34, column: 10, scope: !296)
!347 = !DILocalVariable(name: "str", scope: !296, file: !289, line: 35, type: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !350, line: 39, baseType: !351)
!350 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !350, line: 41, size: 192, align: 64, elements: !352)
!352 = !{!353, !356, !359}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !351, file: !350, line: 43, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !334, line: 46, baseType: !310)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !351, file: !350, line: 44, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !358, line: 66, baseType: !315)
!358 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !351, file: !350, line: 45, baseType: !357, size: 64, align: 64, offset: 128)
!360 = !DILocation(line: 35, column: 11, scope: !296)
!361 = !DILocalVariable(name: "data", scope: !296, file: !289, line: 36, type: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_CERT_ENTRY_REC", file: !305, line: 28, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_CERT_ENTRY_REC", file: !305, line: 57, size: 128, align: 64, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !305, line: 58, baseType: !309, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !364, file: !305, line: 59, baseType: !309, size: 64, align: 64, offset: 64)
!368 = !DILocation(line: 36, column: 22, scope: !296)
!369 = !DILocation(line: 38, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !296, file: !289, line: 38, column: 6)
!371 = !DILocation(line: 38, column: 6, scope: !296)
!372 = !DILocation(line: 39, column: 3, scope: !370)
!373 = !DILocation(line: 41, column: 39, scope: !296)
!374 = !DILocation(line: 41, column: 2, scope: !296)
!375 = !DILocation(line: 43, column: 15, scope: !376)
!376 = distinct !DILexicalBlock(scope: !296, file: !289, line: 43, column: 2)
!377 = !DILocation(line: 43, column: 20, scope: !376)
!378 = !DILocation(line: 43, column: 13, scope: !376)
!379 = !DILocation(line: 43, column: 7, scope: !376)
!380 = !DILocation(line: 43, column: 27, scope: !381)
!381 = !DILexicalBlockFile(scope: !382, file: !289, discriminator: 1)
!382 = distinct !DILexicalBlock(scope: !376, file: !289, line: 43, column: 2)
!383 = !DILocation(line: 43, column: 33, scope: !381)
!384 = !DILocation(line: 43, column: 2, scope: !381)
!385 = !DILocalVariable(name: "tls_cert_rec", scope: !386, file: !289, line: 44, type: !387)
!386 = distinct !DILexicalBlock(scope: !382, file: !289, line: 43, column: 62)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "TLS_CERT_REC", file: !305, line: 27, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TLS_CERT_REC", file: !305, line: 52, size: 128, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "subject", scope: !389, file: !305, line: 53, baseType: !327, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "issuer", scope: !389, file: !305, line: 54, baseType: !327, size: 64, align: 64, offset: 64)
!393 = !DILocation(line: 44, column: 17, scope: !386)
!394 = !DILocation(line: 44, column: 32, scope: !386)
!395 = !DILocation(line: 44, column: 39, scope: !386)
!396 = !DILocation(line: 45, column: 9, scope: !386)
!397 = !DILocation(line: 45, column: 7, scope: !386)
!398 = !DILocation(line: 47, column: 18, scope: !399)
!399 = distinct !DILexicalBlock(scope: !386, file: !289, line: 47, column: 3)
!400 = !DILocation(line: 47, column: 32, scope: !399)
!401 = !DILocation(line: 47, column: 16, scope: !399)
!402 = !DILocation(line: 47, column: 8, scope: !399)
!403 = !DILocation(line: 47, column: 41, scope: !404)
!404 = !DILexicalBlockFile(scope: !405, file: !289, discriminator: 1)
!405 = distinct !DILexicalBlock(scope: !399, file: !289, line: 47, column: 3)
!406 = !DILocation(line: 47, column: 49, scope: !404)
!407 = !DILocation(line: 47, column: 3, scope: !404)
!408 = !DILocation(line: 48, column: 11, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !289, line: 47, column: 82)
!410 = !DILocation(line: 48, column: 20, scope: !409)
!411 = !DILocation(line: 48, column: 9, scope: !409)
!412 = !DILocation(line: 49, column: 27, scope: !409)
!413 = !DILocation(line: 49, column: 44, scope: !409)
!414 = !DILocation(line: 49, column: 50, scope: !409)
!415 = !DILocation(line: 49, column: 56, scope: !409)
!416 = !DILocation(line: 49, column: 62, scope: !409)
!417 = !DILocation(line: 49, column: 4, scope: !409)
!418 = !DILocation(line: 50, column: 3, scope: !409)
!419 = !DILocation(line: 47, column: 67, scope: !420)
!420 = !DILexicalBlockFile(scope: !405, file: !289, discriminator: 2)
!421 = !DILocation(line: 47, column: 76, scope: !420)
!422 = !DILocation(line: 47, column: 65, scope: !420)
!423 = !DILocation(line: 47, column: 3, scope: !420)
!424 = distinct !{!424, !425}
!425 = !DILocation(line: 47, column: 3, scope: !386)
!426 = !DILocation(line: 52, column: 7, scope: !427)
!427 = distinct !DILexicalBlock(scope: !386, file: !289, line: 52, column: 7)
!428 = !DILocation(line: 52, column: 12, scope: !427)
!429 = !DILocation(line: 52, column: 16, scope: !427)
!430 = !DILocation(line: 52, column: 7, scope: !386)
!431 = !DILocation(line: 53, column: 22, scope: !427)
!432 = !DILocation(line: 53, column: 27, scope: !427)
!433 = !DILocation(line: 53, column: 32, scope: !427)
!434 = !DILocation(line: 53, column: 36, scope: !427)
!435 = !DILocation(line: 53, column: 4, scope: !427)
!436 = !DILocation(line: 55, column: 40, scope: !386)
!437 = !DILocation(line: 55, column: 49, scope: !386)
!438 = !DILocation(line: 55, column: 54, scope: !386)
!439 = !DILocation(line: 55, column: 3, scope: !386)
!440 = !DILocation(line: 56, column: 17, scope: !386)
!441 = !DILocation(line: 56, column: 3, scope: !386)
!442 = !DILocation(line: 58, column: 9, scope: !386)
!443 = !DILocation(line: 58, column: 7, scope: !386)
!444 = !DILocation(line: 60, column: 17, scope: !445)
!445 = distinct !DILexicalBlock(scope: !386, file: !289, line: 60, column: 3)
!446 = !DILocation(line: 60, column: 31, scope: !445)
!447 = !DILocation(line: 60, column: 15, scope: !445)
!448 = !DILocation(line: 60, column: 8, scope: !445)
!449 = !DILocation(line: 60, column: 39, scope: !450)
!450 = !DILexicalBlockFile(scope: !451, file: !289, discriminator: 1)
!451 = distinct !DILexicalBlock(scope: !445, file: !289, line: 60, column: 3)
!452 = !DILocation(line: 60, column: 46, scope: !450)
!453 = !DILocation(line: 60, column: 3, scope: !450)
!454 = !DILocation(line: 61, column: 11, scope: !455)
!455 = distinct !DILexicalBlock(scope: !451, file: !289, line: 60, column: 77)
!456 = !DILocation(line: 61, column: 19, scope: !455)
!457 = !DILocation(line: 61, column: 9, scope: !455)
!458 = !DILocation(line: 62, column: 27, scope: !455)
!459 = !DILocation(line: 62, column: 44, scope: !455)
!460 = !DILocation(line: 62, column: 50, scope: !455)
