; ModuleID = './line362-statusbar.o.i'
source_filename = "./line362-statusbar.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct._GSList = type { i8*, %struct._GSList* }
%struct.STATUSBAR_GROUP_REC = type { i8*, %struct._GSList*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type opaque
%struct.HISTORY_REC = type { i8*, %struct._GList*, i32, i32, i8 }
%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct.MAIN_WINDOW_BORDER_REC = type { i8*, %struct._TERM_WINDOW* }
%struct._TERM_WINDOW = type opaque
%struct.MAIN_WINDOW_REC = type { %struct._WINDOW_REC*, %struct._TERM_WINDOW*, i32, i32, i32, i32, i32, i32, i32, %struct._GSList*, i32, i32, i32, i32, i32, i32, i8 }
%struct.SBAR_ITEM_REC = type { %struct.STATUSBAR_REC*, %struct.SBAR_ITEM_CONFIG_REC*, {}*, i32, i32, i32, i32, i32, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !316)
!1 = !DIFile(filename: "line362-statusbar.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{}
!3 = !{!4, !5, !24, !20, !28, !30, !32, !34, !167, !174, !189, !201, !202, !208, !212, !216, !217, !223}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_GROUP_REC", file: !7, line: 36, baseType: !8)
!7 = !DIFile(filename: "statusbar.h", directory: "/home/lichi/Desktop/irssi/task1")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 32, size: 192, align: 64, elements: !9)
!9 = !{!10, !13, !23}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !7, line: 33, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "config_bars", scope: !8, file: !7, line: 34, baseType: !14, size: 64, align: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !16, line: 37, baseType: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !16, line: 39, size: 128, align: 64, elements: !18)
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !16, line: 41, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !21, line: 77, baseType: !4)
!21 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !16, line: 42, baseType: !14, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "bars", scope: !8, file: !7, line: 35, baseType: !14, size: 64, align: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !21, line: 88, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{null, !20, !20}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !21, line: 48, baseType: !29)
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !21, line: 46, baseType: !12)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_REC", file: !7, line: 61, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 49, size: 448, align: 64, elements: !37)
!37 = !{!38, !39, !51, !162, !163, !164, !165, !166}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !36, file: !7, line: 50, baseType: !5, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !36, file: !7, line: 51, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_CONFIG_REC", file: !7, line: 47, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 38, size: 256, align: 64, elements: !43)
!43 = !{!44, !45, !47, !48, !49, !50}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !7, line: 39, baseType: !11, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !7, line: 41, baseType: !46, size: 32, align: 32, offset: 64)
!46 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "placement", scope: !42, file: !7, line: 42, baseType: !46, size: 32, align: 32, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !42, file: !7, line: 43, baseType: !46, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !42, file: !7, line: 44, baseType: !46, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !42, file: !7, line: 46, baseType: !14, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "parent_window", scope: !36, file: !7, line: 53, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !54, line: 34, baseType: !55)
!54 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 16, size: 704, align: 64, elements: !56)
!56 = !{!57, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !55, file: !54, line: 17, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !60, line: 117, baseType: !61)
!60 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !62, line: 28, size: 1280, align: 64, elements: !63)
!62 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!63 = !{!64, !65, !66, !67, !68, !69, !105, !106, !107, !108, !109, !110, !112, !113, !114, !133, !134, !135, !136, !137, !138, !139, !140}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !61, file: !62, line: 29, baseType: !46, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !62, line: 30, baseType: !11, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !61, file: !62, line: 32, baseType: !46, size: 32, align: 32, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !61, file: !62, line: 32, baseType: !46, size: 32, align: 32, offset: 160)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !61, file: !62, line: 34, baseType: !14, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !61, file: !62, line: 35, baseType: !70, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !60, line: 108, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !73, line: 5, size: 704, align: 64, elements: !74)
!73 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!74 = !{!75, !77, !78, !83, !84, !88, !89, !90, !95, !96, !97, !101}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !76, line: 3, baseType: !46, size: 32, align: 32)
!76 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !72, file: !76, line: 4, baseType: !46, size: 32, align: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !72, file: !76, line: 5, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !81, line: 37, baseType: !82)
!81 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !81, line: 37, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !72, file: !76, line: 7, baseType: !4, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !72, file: !76, line: 8, baseType: !85, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !60, line: 107, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !60, line: 107, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !72, file: !76, line: 9, baseType: !11, size: 64, align: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !76, line: 10, baseType: !11, size: 64, align: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !72, file: !76, line: 11, baseType: !91, size: 64, align: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !92, line: 75, baseType: !93)
!92 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !94, line: 139, baseType: !29)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !72, file: !76, line: 12, baseType: !46, size: 32, align: 32, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !72, file: !76, line: 13, baseType: !11, size: 64, align: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !72, file: !76, line: 15, baseType: !98, size: 64, align: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !70}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !72, file: !76, line: 17, baseType: !102, size: 64, align: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!32, !70}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !61, file: !62, line: 36, baseType: !85, size: 64, align: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !61, file: !62, line: 37, baseType: !85, size: 64, align: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !61, file: !62, line: 38, baseType: !11, size: 64, align: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !61, file: !62, line: 40, baseType: !46, size: 32, align: 32, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !61, file: !62, line: 41, baseType: !14, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !61, file: !62, line: 43, baseType: !111, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!111 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !61, file: !62, line: 44, baseType: !111, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !61, file: !62, line: 45, baseType: !111, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !61, file: !62, line: 48, baseType: !115, size: 64, align: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !117, line: 14, baseType: !118)
!117 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 6, size: 256, align: 64, elements: !119)
!119 = !{!120, !121, !130, !131, !132}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !117, line: 7, baseType: !11, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !118, file: !117, line: 9, baseType: !122, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !124, line: 37, baseType: !125)
!124 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !124, line: 39, size: 192, align: 64, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !124, line: 41, baseType: !20, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !124, line: 42, baseType: !122, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !124, line: 43, baseType: !122, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !118, file: !117, line: 10, baseType: !46, size: 32, align: 32, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !118, file: !117, line: 12, baseType: !46, size: 32, align: 32, offset: 160)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !118, file: !117, line: 13, baseType: !46, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !61, file: !62, line: 49, baseType: !11, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !61, file: !62, line: 51, baseType: !46, size: 32, align: 32, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !61, file: !62, line: 52, baseType: !11, size: 64, align: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !61, file: !62, line: 54, baseType: !91, size: 64, align: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !61, file: !62, line: 55, baseType: !91, size: 64, align: 64, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !61, file: !62, line: 57, baseType: !11, size: 64, align: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !61, file: !62, line: 58, baseType: !4, size: 64, align: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !61, file: !62, line: 60, baseType: !4, size: 64, align: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !55, file: !54, line: 19, baseType: !142, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !144, line: 4, baseType: !145)
!144 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !144, line: 4, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !55, file: !54, line: 20, baseType: !46, size: 32, align: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !55, file: !54, line: 22, baseType: !46, size: 32, align: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !55, file: !54, line: 22, baseType: !46, size: 32, align: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !55, file: !54, line: 23, baseType: !46, size: 32, align: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !55, file: !54, line: 23, baseType: !46, size: 32, align: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !55, file: !54, line: 24, baseType: !46, size: 32, align: 32, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !55, file: !54, line: 24, baseType: !46, size: 32, align: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !55, file: !54, line: 26, baseType: !14, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !55, file: !54, line: 27, baseType: !46, size: 32, align: 32, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !55, file: !54, line: 27, baseType: !46, size: 32, align: 32, offset: 480)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !55, file: !54, line: 28, baseType: !46, size: 32, align: 32, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !55, file: !54, line: 29, baseType: !46, size: 32, align: 32, offset: 544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !55, file: !54, line: 29, baseType: !46, size: 32, align: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !55, file: !54, line: 30, baseType: !46, size: 32, align: 32, offset: 608)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !55, file: !54, line: 32, baseType: !111, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !55, file: !54, line: 33, baseType: !111, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !36, file: !7, line: 54, baseType: !14, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !36, file: !7, line: 56, baseType: !11, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "real_ypos", scope: !36, file: !7, line: 57, baseType: !46, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !36, file: !7, line: 59, baseType: !111, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_xpos", scope: !36, file: !7, line: 60, baseType: !46, size: 32, align: 32, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !168, line: 9, baseType: !169)
!168 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172, !172, !172, !172, !172, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBAR_ITEM_REC", file: !7, line: 11, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBAR_ITEM_REC", file: !7, line: 71, size: 384, align: 64, elements: !177)
!177 = !{!178, !179, !188, !195, !196, !197, !198, !199, !200}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !176, file: !7, line: 72, baseType: !34, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !176, file: !7, line: 73, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBAR_ITEM_CONFIG_REC", file: !7, line: 69, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 63, size: 192, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !7, line: 64, baseType: !11, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !182, file: !7, line: 65, baseType: !11, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !182, file: !7, line: 67, baseType: !46, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "right_alignment", scope: !182, file: !7, line: 68, baseType: !111, size: 1, align: 32, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !176, file: !7, line: 74, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_FUNC", file: !190, line: 6, baseType: !191)
!190 = !DIFile(filename: "statusbar-item.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194, !46}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !176, file: !7, line: 77, baseType: !46, size: 32, align: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !176, file: !7, line: 77, baseType: !46, size: 32, align: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !176, file: !7, line: 80, baseType: !46, size: 32, align: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !176, file: !7, line: 80, baseType: !46, size: 32, align: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "current_size", scope: !176, file: !7, line: 82, baseType: !46, size: 32, align: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !176, file: !7, line: 83, baseType: !111, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !21, line: 49, baseType: !46)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !21, line: 90, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !21, line: 55, baseType: !111)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !21, line: 78, baseType: !172)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !21, line: 80, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!201, !207, !207}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !21, line: 91, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !20, !20, !20}
!216 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_BORDER_REC", file: !54, line: 39, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !54, line: 36, size: 128, align: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !219, file: !54, line: 37, baseType: !11, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !219, file: !54, line: 38, baseType: !142, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !225, line: 24, baseType: !226)
!225 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 13, size: 320, align: 64, elements: !227)
!227 = !{!228, !229, !310, !311, !312, !313, !314, !315}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !226, file: !225, line: 14, baseType: !52, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !226, file: !225, line: 15, baseType: !230, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !232, line: 7, baseType: !233)
!232 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !232, line: 50, size: 960, align: 64, elements: !234)
!234 = !{!235, !275, !276, !277, !278, !279, !280, !285, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !233, file: !232, line: 51, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !238, line: 72, baseType: !239)
!238 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 60, size: 448, align: 64, elements: !240)
!240 = !{!241, !242, !258, !259, !260, !271, !272, !273, !274}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !239, file: !238, line: 61, baseType: !14, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !239, file: !238, line: 62, baseType: !243, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !238, line: 52, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !238, line: 34, size: 320, align: 64, elements: !246)
!246 = !{!247, !249, !250, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !238, line: 48, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !238, line: 48, baseType: !248, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !245, file: !238, line: 50, baseType: !251, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !245, file: !238, line: 51, baseType: !253, size: 128, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !238, line: 32, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 29, size: 128, align: 64, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !254, file: !238, line: 30, baseType: !46, size: 32, align: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !254, file: !238, line: 31, baseType: !91, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !239, file: !238, line: 63, baseType: !46, size: 32, align: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !239, file: !238, line: 65, baseType: !243, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !239, file: !238, line: 66, baseType: !261, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !238, line: 58, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 54, size: 131008, align: 32, elements: !264)
!264 = !{!265, !269, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !263, file: !238, line: 55, baseType: !266, size: 130944, align: 8)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 130944, align: 8, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 16368)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !263, file: !238, line: 56, baseType: !46, size: 32, align: 32, offset: 130944)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !263, file: !238, line: 57, baseType: !46, size: 32, align: 32, offset: 130976)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !239, file: !238, line: 68, baseType: !46, size: 32, align: 32, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !239, file: !238, line: 69, baseType: !46, size: 32, align: 32, offset: 352)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !239, file: !238, line: 70, baseType: !46, size: 32, align: 32, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !239, file: !238, line: 71, baseType: !111, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !233, file: !232, line: 53, baseType: !14, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !233, file: !232, line: 55, baseType: !142, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !233, file: !232, line: 56, baseType: !46, size: 32, align: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !233, file: !232, line: 56, baseType: !46, size: 32, align: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !233, file: !232, line: 58, baseType: !46, size: 32, align: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !233, file: !232, line: 59, baseType: !281, size: 64, align: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !232, line: 10, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!46, !230, !243, !46}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !233, file: !232, line: 61, baseType: !286, size: 64, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !232, line: 48, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 37, size: 192, align: 64, elements: !289)
!289 = !{!290, !291, !292, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !288, file: !232, line: 38, baseType: !46, size: 32, align: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !288, file: !232, line: 39, baseType: !46, size: 32, align: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !288, file: !232, line: 41, baseType: !79, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !288, file: !232, line: 45, baseType: !216, size: 8, align: 8, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !288, file: !232, line: 47, baseType: !46, size: 32, align: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !233, file: !232, line: 63, baseType: !46, size: 32, align: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !233, file: !232, line: 66, baseType: !243, size: 64, align: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !233, file: !232, line: 68, baseType: !46, size: 32, align: 32, offset: 576)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !233, file: !232, line: 71, baseType: !243, size: 64, align: 64, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !233, file: !232, line: 72, baseType: !46, size: 32, align: 32, offset: 704)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !233, file: !232, line: 76, baseType: !79, size: 64, align: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !233, file: !232, line: 79, baseType: !46, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !233, file: !232, line: 82, baseType: !46, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !233, file: !232, line: 84, baseType: !111, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !233, file: !232, line: 86, baseType: !111, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !233, file: !232, line: 88, baseType: !111, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !233, file: !232, line: 90, baseType: !111, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !233, file: !232, line: 92, baseType: !111, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !233, file: !232, line: 94, baseType: !111, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !233, file: !232, line: 96, baseType: !111, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !226, file: !225, line: 17, baseType: !111, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !226, file: !225, line: 18, baseType: !111, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !226, file: !225, line: 20, baseType: !111, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !226, file: !225, line: 21, baseType: !111, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !226, file: !225, line: 22, baseType: !243, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !226, file: !225, line: 23, baseType: !91, size: 64, align: 64, offset: 256)
!316 = !{!317, !319, !320, !321, !322, !323, !324, !325}
!317 = distinct !DIGlobalVariable(name: "statusbar_groups", scope: !0, file: !318, line: 36, type: !14, isLocal: false, isDefinition: true, variable: %struct._GSList** @statusbar_groups)
!318 = !DIFile(filename: "statusbar.c", directory: "/home/lichi/Desktop/irssi/task1")
!319 = distinct !DIGlobalVariable(name: "active_statusbar_group", scope: !0, file: !318, line: 37, type: !5, isLocal: false, isDefinition: true, variable: %struct.STATUSBAR_GROUP_REC** @active_statusbar_group)
!320 = distinct !DIGlobalVariable(name: "sbar_item_defs", scope: !0, file: !318, line: 46, type: !79, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @sbar_item_defs)
!321 = distinct !DIGlobalVariable(name: "sbar_item_funcs", scope: !0, file: !318, line: 46, type: !79, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @sbar_item_funcs)
!322 = distinct !DIGlobalVariable(name: "sbar_signal_items", scope: !0, file: !318, line: 47, type: !79, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @sbar_signal_items)
!323 = distinct !DIGlobalVariable(name: "sbar_item_signals", scope: !0, file: !318, line: 47, type: !79, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @sbar_item_signals)
!324 = distinct !DIGlobalVariable(name: "named_sbar_items", scope: !0, file: !318, line: 48, type: !79, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @named_sbar_items)
!325 = distinct !DIGlobalVariable(name: "statusbar_need_recreate_items", scope: !0, file: !318, line: 49, type: !46, isLocal: true, isDefinition: true, variable: i32* @statusbar_need_recreate_items)
!326 = !{i32 2, !"Dwarf Version", i32 4}
!327 = !{i32 2, !"Debug Info Version", i32 3}
!328 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!329 = distinct !DISubprogram(name: "statusbar_item_register", scope: !318, file: !318, line: 51, type: !330, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !32, !32, !189}
!332 = !DILocalVariable(name: "name", arg: 1, scope: !329, file: !318, line: 51, type: !32)
!333 = !DIExpression()
!334 = !DILocation(line: 51, column: 42, scope: !329)
!335 = !DILocalVariable(name: "value", arg: 2, scope: !329, file: !318, line: 51, type: !32)
!336 = !DILocation(line: 51, column: 60, scope: !329)
!337 = !DILocalVariable(name: "func", arg: 3, scope: !329, file: !318, line: 52, type: !189)
!338 = !DILocation(line: 52, column: 24, scope: !329)
!339 = !DILocalVariable(name: "hkey", scope: !329, file: !318, line: 54, type: !20)
!340 = !DILocation(line: 54, column: 11, scope: !329)
!341 = !DILocalVariable(name: "hvalue", scope: !329, file: !318, line: 54, type: !20)
!342 = !DILocation(line: 54, column: 17, scope: !329)
!343 = !DILocation(line: 56, column: 32, scope: !329)
!344 = !DILocation(line: 57, column: 6, scope: !345)
!345 = distinct !DILexicalBlock(scope: !329, file: !318, line: 57, column: 6)
!346 = !DILocation(line: 57, column: 12, scope: !345)
!347 = !DILocation(line: 57, column: 6, scope: !329)
!348 = !DILocation(line: 58, column: 36, scope: !349)
!349 = distinct !DILexicalBlock(scope: !350, file: !318, line: 58, column: 7)
!350 = distinct !DILexicalBlock(scope: !345, file: !318, line: 57, column: 20)
!351 = !DILocation(line: 59, column: 8, scope: !349)
!352 = !DILocation(line: 58, column: 7, scope: !349)
!353 = !DILocation(line: 58, column: 7, scope: !350)
!354 = !DILocation(line: 60, column: 24, scope: !355)
!355 = distinct !DILexicalBlock(scope: !349, file: !318, line: 59, column: 31)
!356 = !DILocation(line: 60, column: 40, scope: !355)
!357 = !DILocation(line: 60, column: 4, scope: !355)
!358 = !DILocation(line: 61, column: 11, scope: !355)
!359 = !DILocation(line: 61, column: 4, scope: !355)
!360 = !DILocation(line: 62, column: 32, scope: !355)
!361 = !DILocation(line: 62, column: 25, scope: !355)
!362 = !DILocation(line: 63, column: 3, scope: !355)
!363 = !DILocation(line: 64, column: 23, scope: !350)
!364 = !DILocation(line: 65, column: 18, scope: !350)
!365 = !DILocation(line: 65, column: 9, scope: !350)
!366 = !DILocation(line: 65, column: 34, scope: !350)
!367 = !DILocation(line: 65, column: 25, scope: !368)
!368 = !DILexicalBlockFile(scope: !350, file: !318, discriminator: 1)
!369 = !DILocation(line: 64, column: 3, scope: !350)
!370 = !DILocation(line: 66, column: 2, scope: !350)
!371 = !DILocation(line: 68, column: 6, scope: !372)
!372 = distinct !DILexicalBlock(scope: !329, file: !318, line: 68, column: 6)
!373 = !DILocation(line: 68, column: 11, scope: !372)
!374 = !DILocation(line: 68, column: 6, scope: !329)
!375 = !DILocation(line: 69, column: 27, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !318, line: 69, column: 7)
!377 = distinct !DILexicalBlock(scope: !372, file: !318, line: 68, column: 19)
!378 = !DILocation(line: 69, column: 44, scope: !376)
!379 = !DILocation(line: 69, column: 7, scope: !376)
!380 = !DILocation(line: 69, column: 50, scope: !376)
!381 = !DILocation(line: 69, column: 7, scope: !377)
!382 = !DILocation(line: 70, column: 24, scope: !383)
!383 = distinct !DILexicalBlock(scope: !376, file: !318, line: 69, column: 58)
!384 = !DILocation(line: 71, column: 19, scope: !383)
!385 = !DILocation(line: 71, column: 10, scope: !383)
!386 = !DILocation(line: 71, column: 35, scope: !383)
!387 = !DILocation(line: 71, column: 26, scope: !383)
!388 = !DILocation(line: 70, column: 4, scope: !383)
!389 = !DILocation(line: 72, column: 3, scope: !383)
!390 = !DILocation(line: 73, column: 2, scope: !377)
!391 = !DILocation(line: 74, column: 1, scope: !329)
!392 = distinct !DISubprogram(name: "statusbar_item_unregister", scope: !318, file: !318, line: 76, type: !393, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !32}
!395 = !DILocalVariable(name: "name", arg: 1, scope: !392, file: !318, line: 76, type: !32)
!396 = !DILocation(line: 76, column: 44, scope: !392)
!397 = !DILocalVariable(name: "key", scope: !392, file: !318, line: 78, type: !20)
!398 = !DILocation(line: 78, column: 11, scope: !392)
!399 = !DILocalVariable(name: "value", scope: !392, file: !318, line: 78, type: !20)
!400 = !DILocation(line: 78, column: 16, scope: !392)
!401 = !DILocation(line: 80, column: 32, scope: !392)
!402 = !DILocation(line: 81, column: 35, scope: !403)
!403 = distinct !DILexicalBlock(scope: !392, file: !318, line: 81, column: 6)
!404 = !DILocation(line: 82, column: 7, scope: !403)
!405 = !DILocation(line: 81, column: 6, scope: !403)
!406 = !DILocation(line: 81, column: 6, scope: !392)
!407 = !DILocation(line: 83, column: 23, scope: !408)
!408 = distinct !DILexicalBlock(scope: !403, file: !318, line: 82, column: 28)
!409 = !DILocation(line: 83, column: 39, scope: !408)
!410 = !DILocation(line: 83, column: 3, scope: !408)
!411 = !DILocation(line: 84, column: 10, scope: !408)
!412 = !DILocation(line: 84, column: 3, scope: !408)
!413 = !DILocation(line: 85, column: 24, scope: !408)
!414 = !DILocation(line: 85, column: 17, scope: !408)
!415 = !DILocation(line: 86, column: 2, scope: !408)
!416 = !DILocation(line: 88, column: 35, scope: !417)
!417 = distinct !DILexicalBlock(scope: !392, file: !318, line: 88, column: 6)
!418 = !DILocation(line: 89, column: 7, scope: !417)
!419 = !DILocation(line: 88, column: 6, scope: !417)
!420 = !DILocation(line: 88, column: 6, scope: !392)
!421 = !DILocation(line: 90, column: 23, scope: !422)
!422 = distinct !DILexicalBlock(scope: !417, file: !318, line: 89, column: 28)
!423 = !DILocation(line: 90, column: 40, scope: !422)
!424 = !DILocation(line: 90, column: 3, scope: !422)
!425 = !DILocation(line: 91, column: 10, scope: !422)
!426 = !DILocation(line: 91, column: 3, scope: !422)
!427 = !DILocation(line: 92, column: 2, scope: !422)
!428 = !DILocation(line: 93, column: 1, scope: !392)
!429 = distinct !DISubprogram(name: "statusbar_item_set_size", scope: !318, file: !318, line: 95, type: !430, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !194, !46, !46}
!432 = !DILocalVariable(name: "item", arg: 1, scope: !429, file: !318, line: 95, type: !194)
!433 = !DILocation(line: 95, column: 52, scope: !429)
!434 = !DILocalVariable(name: "min_size", arg: 2, scope: !429, file: !318, line: 95, type: !46)
!435 = !DILocation(line: 95, column: 62, scope: !429)
!436 = !DILocalVariable(name: "max_size", arg: 3, scope: !429, file: !318, line: 95, type: !46)
!437 = !DILocation(line: 95, column: 76, scope: !429)
!438 = !DILocation(line: 97, column: 19, scope: !429)
!439 = !DILocation(line: 97, column: 2, scope: !429)
!440 = !DILocation(line: 97, column: 8, scope: !429)
!441 = !DILocation(line: 97, column: 17, scope: !429)
!442 = !DILocation(line: 98, column: 19, scope: !429)
!443 = !DILocation(line: 98, column: 2, scope: !429)
!444 = !DILocation(line: 98, column: 8, scope: !429)
!445 = !DILocation(line: 98, column: 17, scope: !429)
!446 = !DILocation(line: 99, column: 1, scope: !429)
!447 = distinct !DISubprogram(name: "statusbar_group_create", scope: !318, file: !318, line: 101, type: !448, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!448 = !DISubroutineType(types: !449)
!449 = !{!5, !32}
!450 = !DILocalVariable(name: "name", arg: 1, scope: !447, file: !318, line: 101, type: !32)
!451 = !DILocation(line: 101, column: 57, scope: !447)
!452 = !DILocalVariable(name: "rec", scope: !447, file: !318, line: 103, type: !5)
!453 = !DILocation(line: 103, column: 23, scope: !447)
!454 = !DILocation(line: 105, column: 33, scope: !447)
!455 = !DILocation(line: 105, column: 9, scope: !447)
!456 = !DILocation(line: 105, column: 6, scope: !447)
!457 = !DILocation(line: 106, column: 23, scope: !447)
!458 = !DILocation(line: 106, column: 14, scope: !447)
!459 = !DILocation(line: 106, column: 2, scope: !447)
!460 = !DILocation(line: 106, column: 7, scope: !447)
!461 = !DILocation(line: 106, column: 12, scope: !447)
!462 = !DILocation(line: 108, column: 43, scope: !447)
!463 = !DILocation(line: 108, column: 61, scope: !447)
!464 = !DILocation(line: 108, column: 28, scope: !447)
!465 = !DILocation(line: 108, column: 26, scope: !447)
!466 = !DILocation(line: 109, column: 9, scope: !447)
!467 = !DILocation(line: 109, column: 2, scope: !447)
!468 = distinct !DISubprogram(name: "statusbar_group_destroy", scope: !318, file: !318, line: 112, type: !469, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !5}
!471 = !DILocalVariable(name: "rec", arg: 1, scope: !468, file: !318, line: 112, type: !5)
!472 = !DILocation(line: 112, column: 51, scope: !468)
!473 = !DILocation(line: 114, column: 36, scope: !468)
!474 = !DILocation(line: 114, column: 54, scope: !468)
!475 = !DILocation(line: 114, column: 21, scope: !468)
!476 = !DILocation(line: 114, column: 19, scope: !468)
!477 = !DILocation(line: 116, column: 2, scope: !468)
!478 = !DILocation(line: 116, column: 9, scope: !479)
!479 = !DILexicalBlockFile(scope: !468, file: !318, discriminator: 1)
!480 = !DILocation(line: 116, column: 14, scope: !479)
!481 = !DILocation(line: 116, column: 19, scope: !479)
!482 = !DILocation(line: 116, column: 2, scope: !479)
!483 = !DILocation(line: 117, column: 21, scope: !468)
!484 = !DILocation(line: 117, column: 26, scope: !468)
!485 = !DILocation(line: 117, column: 32, scope: !468)
!486 = !DILocation(line: 117, column: 3, scope: !468)
!487 = !DILocation(line: 116, column: 2, scope: !488)
!488 = !DILexicalBlockFile(scope: !468, file: !318, discriminator: 2)
!489 = distinct !{!489, !477}
!490 = !DILocation(line: 118, column: 2, scope: !468)
!491 = !DILocation(line: 118, column: 9, scope: !479)
!492 = !DILocation(line: 118, column: 14, scope: !479)
!493 = !DILocation(line: 118, column: 26, scope: !479)
!494 = !DILocation(line: 118, column: 2, scope: !479)
!495 = !DILocation(line: 119, column: 42, scope: !468)
!496 = !DILocation(line: 119, column: 47, scope: !468)
!497 = !DILocation(line: 119, column: 52, scope: !468)
!498 = !DILocation(line: 119, column: 65, scope: !468)
!499 = !DILocation(line: 119, column: 17, scope: !468)
!500 = !DILocation(line: 118, column: 2, scope: !488)
!501 = distinct !{!501, !490}
!502 = !DILocation(line: 121, column: 16, scope: !468)
!503 = !DILocation(line: 121, column: 21, scope: !468)
!504 = !DILocation(line: 121, column: 9, scope: !468)
!505 = !DILocation(line: 122, column: 16, scope: !468)
!506 = !DILocation(line: 122, column: 9, scope: !468)
!507 = !DILocation(line: 123, column: 1, scope: !468)
!508 = distinct !DISubprogram(name: "statusbar_destroy", scope: !318, file: !318, line: 561, type: !509, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !34}
!511 = !DILocalVariable(name: "bar", arg: 1, scope: !508, file: !318, line: 561, type: !34)
!512 = !DILocation(line: 561, column: 39, scope: !508)
!513 = !DILocalVariable(name: "top", scope: !508, file: !318, line: 563, type: !46)
!514 = !DILocation(line: 563, column: 6, scope: !508)
!515 = !DILocation(line: 565, column: 2, scope: !508)
!516 = distinct !{!516, !515}
!517 = !DILocation(line: 565, column: 10, scope: !518)
!518 = !DILexicalBlockFile(scope: !519, file: !318, discriminator: 1)
!519 = distinct !DILexicalBlock(scope: !520, file: !318, line: 565, column: 10)
!520 = distinct !DILexicalBlock(scope: !508, file: !318, line: 565, column: 4)
!521 = !DILocation(line: 565, column: 14, scope: !518)
!522 = !DILocation(line: 565, column: 5, scope: !523)
!523 = !DILexicalBlockFile(scope: !524, file: !318, discriminator: 2)
!524 = distinct !DILexicalBlock(scope: !519, file: !318, line: 565, column: 3)
!525 = !DILocation(line: 565, column: 14, scope: !526)
!526 = !DILexicalBlockFile(scope: !527, file: !318, discriminator: 3)
!527 = distinct !DILexicalBlock(scope: !519, file: !318, line: 565, column: 12)
!528 = !DILocation(line: 565, column: 98, scope: !526)
!529 = !DILocation(line: 565, column: 109, scope: !530)
!530 = !DILexicalBlockFile(scope: !520, file: !318, discriminator: 4)
!531 = !DILocation(line: 567, column: 36, scope: !508)
!532 = !DILocation(line: 567, column: 41, scope: !508)
!533 = !DILocation(line: 567, column: 48, scope: !508)
!534 = !DILocation(line: 567, column: 54, scope: !508)
!535 = !DILocation(line: 567, column: 21, scope: !508)
!536 = !DILocation(line: 567, column: 2, scope: !508)
!537 = !DILocation(line: 567, column: 7, scope: !508)
!538 = !DILocation(line: 567, column: 14, scope: !508)
!539 = !DILocation(line: 567, column: 19, scope: !508)
!540 = !DILocation(line: 568, column: 6, scope: !541)
!541 = distinct !DILexicalBlock(scope: !508, file: !318, line: 568, column: 6)
!542 = !DILocation(line: 568, column: 11, scope: !541)
!543 = !DILocation(line: 568, column: 25, scope: !541)
!544 = !DILocation(line: 568, column: 6, scope: !508)
!545 = !DILocation(line: 570, column: 19, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !318, line: 568, column: 33)
!547 = !DILocation(line: 570, column: 24, scope: !546)
!548 = !DILocation(line: 570, column: 39, scope: !546)
!549 = !DILocation(line: 570, column: 51, scope: !546)
!550 = !DILocation(line: 570, column: 4, scope: !546)
!551 = !DILocation(line: 569, column: 3, scope: !546)
!552 = !DILocation(line: 569, column: 8, scope: !546)
!553 = !DILocation(line: 569, column: 23, scope: !546)
!554 = !DILocation(line: 569, column: 34, scope: !546)
!555 = !DILocation(line: 571, column: 2, scope: !546)
!556 = !DILocation(line: 573, column: 47, scope: !508)
!557 = !DILocation(line: 573, column: 9, scope: !508)
!558 = !DILocation(line: 575, column: 2, scope: !508)
!559 = !DILocation(line: 575, column: 9, scope: !560)
!560 = !DILexicalBlockFile(scope: !508, file: !318, discriminator: 1)
!561 = !DILocation(line: 575, column: 14, scope: !560)
!562 = !DILocation(line: 575, column: 20, scope: !560)
!563 = !DILocation(line: 575, column: 2, scope: !560)
!564 = !DILocation(line: 576, column: 26, scope: !508)
!565 = !DILocation(line: 576, column: 31, scope: !508)
!566 = !DILocation(line: 576, column: 38, scope: !508)
!567 = !DILocation(line: 576, column: 3, scope: !508)
!568 = !DILocation(line: 575, column: 2, scope: !569)
!569 = !DILexicalBlockFile(scope: !508, file: !318, discriminator: 2)
!570 = distinct !{!570, !558}
!571 = !DILocation(line: 578, column: 16, scope: !508)
!572 = !DILocation(line: 578, column: 21, scope: !508)
!573 = !DILocation(line: 578, column: 9, scope: !508)
!574 = !DILocation(line: 580, column: 6, scope: !575)
!575 = distinct !DILexicalBlock(scope: !508, file: !318, line: 580, column: 6)
!576 = !DILocation(line: 580, column: 11, scope: !575)
!577 = !DILocation(line: 580, column: 19, scope: !575)
!578 = !DILocation(line: 580, column: 24, scope: !575)
!579 = !DILocation(line: 580, column: 29, scope: !575)
!580 = !DILocation(line: 581, column: 6, scope: !575)
!581 = !DILocation(line: 581, column: 11, scope: !575)
!582 = !DILocation(line: 581, column: 25, scope: !575)
!583 = !DILocation(line: 580, column: 6, scope: !560)
!584 = !DILocation(line: 582, column: 26, scope: !575)
!585 = !DILocation(line: 582, column: 3, scope: !575)
!586 = !DILocation(line: 584, column: 8, scope: !508)
!587 = !DILocation(line: 584, column: 13, scope: !508)
!588 = !DILocation(line: 584, column: 21, scope: !508)
!589 = !DILocation(line: 584, column: 31, scope: !508)
!590 = !DILocation(line: 584, column: 6, scope: !508)
!591 = !DILocation(line: 585, column: 6, scope: !592)
!592 = distinct !DILexicalBlock(scope: !508, file: !318, line: 585, column: 6)
!593 = !DILocation(line: 585, column: 11, scope: !592)
!594 = !DILocation(line: 585, column: 19, scope: !592)
!595 = !DILocation(line: 585, column: 24, scope: !592)
!596 = !DILocation(line: 585, column: 6, scope: !508)
!597 = !DILocation(line: 587, column: 29, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !318, line: 585, column: 30)
!599 = !DILocation(line: 587, column: 44, scope: !598)
!600 = !DILocation(line: 587, column: 43, scope: !598)
!601 = !DILocation(line: 587, column: 3, scope: !598)
!602 = !DILocation(line: 588, column: 2, scope: !598)
!603 = !DILocation(line: 588, column: 13, scope: !604)
!604 = !DILexicalBlockFile(scope: !605, file: !318, discriminator: 1)
!605 = distinct !DILexicalBlock(scope: !592, file: !318, line: 588, column: 13)
!606 = !DILocation(line: 588, column: 18, scope: !604)
!607 = !DILocation(line: 588, column: 32, scope: !604)
!608 = !DILocation(line: 590, column: 34, scope: !609)
!609 = distinct !DILexicalBlock(scope: !605, file: !318, line: 588, column: 40)
!610 = !DILocation(line: 590, column: 39, scope: !609)
!611 = !DILocation(line: 591, column: 13, scope: !609)
!612 = !DILocation(line: 591, column: 28, scope: !609)
!613 = !DILocation(line: 591, column: 27, scope: !609)
!614 = !DILocation(line: 590, column: 3, scope: !609)
!615 = !DILocation(line: 592, column: 2, scope: !609)
!616 = !DILocation(line: 594, column: 9, scope: !508)
!617 = !DILocation(line: 594, column: 2, scope: !508)
!618 = !DILocation(line: 595, column: 1, scope: !508)
!619 = !DILocation(line: 595, column: 1, scope: !560)
!620 = distinct !DISubprogram(name: "statusbar_group_find", scope: !318, file: !318, line: 125, type: !448, isLocal: false, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!621 = !DILocalVariable(name: "name", arg: 1, scope: !620, file: !318, line: 125, type: !32)
!622 = !DILocation(line: 125, column: 55, scope: !620)
!623 = !DILocalVariable(name: "tmp", scope: !620, file: !318, line: 127, type: !14)
!624 = !DILocation(line: 127, column: 10, scope: !620)
!625 = !DILocation(line: 129, column: 13, scope: !626)
!626 = distinct !DILexicalBlock(scope: !620, file: !318, line: 129, column: 2)
!627 = !DILocation(line: 129, column: 11, scope: !626)
!628 = !DILocation(line: 129, column: 7, scope: !626)
!629 = !DILocation(line: 129, column: 31, scope: !630)
!630 = !DILexicalBlockFile(scope: !631, file: !318, discriminator: 1)
!631 = distinct !DILexicalBlock(scope: !626, file: !318, line: 129, column: 2)
!632 = !DILocation(line: 129, column: 35, scope: !630)
!633 = !DILocation(line: 129, column: 2, scope: !630)
!634 = !DILocalVariable(name: "rec", scope: !635, file: !318, line: 130, type: !5)
!635 = distinct !DILexicalBlock(scope: !631, file: !318, line: 129, column: 60)
!636 = !DILocation(line: 130, column: 24, scope: !635)
!637 = !DILocation(line: 130, column: 30, scope: !635)
!638 = !DILocation(line: 130, column: 35, scope: !635)
!639 = !DILocation(line: 132, column: 17, scope: !640)
!640 = distinct !DILexicalBlock(scope: !635, file: !318, line: 132, column: 7)
!641 = !DILocation(line: 132, column: 22, scope: !640)
!642 = !DILocation(line: 132, column: 28, scope: !640)
!643 = !DILocation(line: 132, column: 7, scope: !640)
!644 = !DILocation(line: 132, column: 34, scope: !640)
!645 = !DILocation(line: 132, column: 7, scope: !635)
!646 = !DILocation(line: 133, column: 32, scope: !640)
!647 = !DILocation(line: 133, column: 25, scope: !640)
!648 = !DILocation(line: 134, column: 2, scope: !635)
!649 = !DILocation(line: 129, column: 49, scope: !650)
!650 = !DILexicalBlockFile(scope: !631, file: !318, discriminator: 2)
!651 = !DILocation(line: 129, column: 54, scope: !650)
!652 = !DILocation(line: 129, column: 47, scope: !650)
!653 = !DILocation(line: 129, column: 2, scope: !650)
!654 = distinct !{!654, !655}
!655 = !DILocation(line: 129, column: 2, scope: !620)
!656 = !DILocation(line: 136, column: 9, scope: !620)
!657 = !DILocation(line: 137, column: 1, scope: !620)
!658 = distinct !DISubprogram(name: "statusbar_redraw", scope: !318, file: !318, line: 327, type: !659, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !34, !46}
!661 = !DILocalVariable(name: "bar", arg: 1, scope: !658, file: !318, line: 327, type: !34)
!662 = !DILocation(line: 327, column: 38, scope: !658)
!663 = !DILocalVariable(name: "force", arg: 2, scope: !658, file: !318, line: 327, type: !46)
!664 = !DILocation(line: 327, column: 47, scope: !658)
!665 = !DILocation(line: 329, column: 6, scope: !666)
!666 = distinct !DILexicalBlock(scope: !658, file: !318, line: 329, column: 6)
!667 = !DILocation(line: 329, column: 6, scope: !658)
!668 = !DILocation(line: 330, column: 3, scope: !666)
!669 = !DILocation(line: 332, column: 6, scope: !670)
!670 = distinct !DILexicalBlock(scope: !658, file: !318, line: 332, column: 6)
!671 = !DILocation(line: 332, column: 10, scope: !670)
!672 = !DILocation(line: 332, column: 6, scope: !658)
!673 = !DILocation(line: 333, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !675, file: !318, line: 333, column: 7)
!675 = distinct !DILexicalBlock(scope: !670, file: !318, line: 332, column: 18)
!676 = !DILocation(line: 333, column: 7, scope: !675)
!677 = !DILocation(line: 334, column: 4, scope: !678)
!678 = distinct !DILexicalBlock(scope: !674, file: !318, line: 333, column: 14)
!679 = !DILocation(line: 335, column: 4, scope: !678)
!680 = !DILocation(line: 335, column: 9, scope: !678)
!681 = !DILocation(line: 335, column: 15, scope: !678)
!682 = !DILocation(line: 336, column: 25, scope: !678)
!683 = !DILocation(line: 336, column: 30, scope: !678)
!684 = !DILocation(line: 336, column: 41, scope: !678)
!685 = !DILocation(line: 337, column: 3, scope: !678)
!686 = !DILocation(line: 338, column: 33, scope: !675)
!687 = !DILocation(line: 338, column: 3, scope: !675)
!688 = !DILocation(line: 339, column: 2, scope: !675)
!689 = !DILocation(line: 339, column: 13, scope: !690)
!690 = !DILexicalBlockFile(scope: !691, file: !318, discriminator: 1)
!691 = distinct !DILexicalBlock(scope: !670, file: !318, line: 339, column: 13)
!692 = !DILocation(line: 339, column: 36, scope: !690)
!693 = !DILocation(line: 340, column: 19, scope: !694)
!694 = distinct !DILexicalBlock(scope: !691, file: !318, line: 339, column: 44)
!695 = !DILocation(line: 340, column: 43, scope: !694)
!696 = !DILocation(line: 342, column: 26, scope: !694)
!697 = !DILocation(line: 342, column: 17, scope: !694)
!698 = !DILocation(line: 342, column: 6, scope: !694)
!699 = !DILocation(line: 340, column: 3, scope: !694)
!700 = !DILocation(line: 343, column: 2, scope: !694)
!701 = !DILocation(line: 344, column: 1, scope: !658)
!702 = distinct !DISubprogram(name: "statusbar_calc_item_positions", scope: !318, file: !318, line: 243, type: !509, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!703 = !DILocalVariable(name: "bar", arg: 1, scope: !702, file: !318, line: 243, type: !34)
!704 = !DILocation(line: 243, column: 58, scope: !702)
!705 = !DILocalVariable(name: "window", scope: !702, file: !318, line: 245, type: !58)
!706 = !DILocation(line: 245, column: 14, scope: !702)
!707 = !DILocalVariable(name: "old_active_win", scope: !702, file: !318, line: 246, type: !58)
!708 = !DILocation(line: 246, column: 14, scope: !702)
!709 = !DILocalVariable(name: "tmp", scope: !702, file: !318, line: 247, type: !14)
!710 = !DILocation(line: 247, column: 10, scope: !702)
!711 = !DILocalVariable(name: "right_items", scope: !702, file: !318, line: 247, type: !14)
!712 = !DILocation(line: 247, column: 16, scope: !702)
!713 = !DILocalVariable(name: "xpos", scope: !702, file: !318, line: 248, type: !46)
!714 = !DILocation(line: 248, column: 6, scope: !702)
!715 = !DILocalVariable(name: "rxpos", scope: !702, file: !318, line: 248, type: !46)
!716 = !DILocation(line: 248, column: 12, scope: !702)
!717 = !DILocalVariable(name: "max_width", scope: !702, file: !318, line: 249, type: !46)
!718 = !DILocation(line: 249, column: 6, scope: !702)
!719 = !DILocation(line: 251, column: 19, scope: !702)
!720 = !DILocation(line: 251, column: 17, scope: !702)
!721 = !DILocation(line: 252, column: 6, scope: !722)
!722 = distinct !DILexicalBlock(scope: !702, file: !318, line: 252, column: 6)
!723 = !DILocation(line: 252, column: 11, scope: !722)
!724 = !DILocation(line: 252, column: 25, scope: !722)
!725 = !DILocation(line: 252, column: 6, scope: !702)
!726 = !DILocation(line: 253, column: 16, scope: !722)
!727 = !DILocation(line: 253, column: 21, scope: !722)
!728 = !DILocation(line: 253, column: 36, scope: !722)
!729 = !DILocation(line: 253, column: 14, scope: !722)
!730 = !DILocation(line: 253, column: 3, scope: !722)
!731 = !DILocation(line: 255, column: 11, scope: !702)
!732 = !DILocation(line: 255, column: 16, scope: !702)
!733 = !DILocation(line: 255, column: 30, scope: !702)
!734 = !DILocation(line: 256, column: 4, scope: !702)
!735 = !DILocation(line: 256, column: 9, scope: !702)
!736 = !DILocation(line: 256, column: 24, scope: !702)
!737 = !DILocation(line: 255, column: 11, scope: !738)
!738 = !DILexicalBlockFile(scope: !702, file: !318, discriminator: 1)
!739 = !DILocation(line: 255, column: 11, scope: !740)
!740 = !DILexicalBlockFile(scope: !702, file: !318, discriminator: 2)
!741 = !DILocation(line: 255, column: 11, scope: !742)
!742 = !DILexicalBlockFile(scope: !702, file: !318, discriminator: 3)
!743 = !DILocation(line: 255, column: 9, scope: !742)
!744 = !DILocation(line: 259, column: 14, scope: !702)
!745 = !DILocation(line: 259, column: 21, scope: !702)
!746 = !DILocation(line: 259, column: 30, scope: !738)
!747 = !DILocation(line: 259, column: 38, scope: !738)
!748 = !DILocation(line: 259, column: 14, scope: !738)
!749 = !DILocation(line: 259, column: 46, scope: !740)
!750 = !DILocation(line: 259, column: 14, scope: !740)
!751 = !DILocation(line: 259, column: 14, scope: !742)
!752 = !DILocation(line: 259, column: 12, scope: !742)
!753 = !DILocation(line: 260, column: 25, scope: !702)
!754 = !DILocation(line: 260, column: 30, scope: !702)
!755 = !DILocation(line: 260, column: 2, scope: !702)
!756 = !DILocation(line: 263, column: 7, scope: !702)
!757 = !DILocation(line: 264, column: 13, scope: !758)
!758 = distinct !DILexicalBlock(scope: !702, file: !318, line: 264, column: 2)
!759 = !DILocation(line: 264, column: 18, scope: !758)
!760 = !DILocation(line: 264, column: 11, scope: !758)
!761 = !DILocation(line: 264, column: 7, scope: !758)
!762 = !DILocation(line: 264, column: 25, scope: !763)
!763 = !DILexicalBlockFile(scope: !764, file: !318, discriminator: 1)
!764 = distinct !DILexicalBlock(scope: !758, file: !318, line: 264, column: 2)
!765 = !DILocation(line: 264, column: 29, scope: !763)
!766 = !DILocation(line: 264, column: 2, scope: !763)
!767 = !DILocalVariable(name: "rec", scope: !768, file: !318, line: 265, type: !174)
!768 = distinct !DILexicalBlock(scope: !764, file: !318, line: 264, column: 54)
!769 = !DILocation(line: 265, column: 18, scope: !768)
!770 = !DILocation(line: 265, column: 24, scope: !768)
!771 = !DILocation(line: 265, column: 29, scope: !768)
!772 = !DILocation(line: 267, column: 8, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !318, line: 267, column: 7)
!774 = !DILocation(line: 267, column: 13, scope: !773)
!775 = !DILocation(line: 267, column: 21, scope: !773)
!776 = !DILocation(line: 267, column: 37, scope: !773)
!777 = !DILocation(line: 268, column: 8, scope: !773)
!778 = !DILocation(line: 268, column: 13, scope: !773)
!779 = !DILocation(line: 268, column: 18, scope: !773)
!780 = !DILocation(line: 268, column: 22, scope: !773)
!781 = !DILocation(line: 268, column: 25, scope: !782)
!782 = !DILexicalBlockFile(scope: !773, file: !318, discriminator: 1)
!783 = !DILocation(line: 268, column: 30, scope: !782)
!784 = !DILocation(line: 268, column: 43, scope: !782)
!785 = !DILocation(line: 267, column: 7, scope: !786)
!786 = !DILexicalBlockFile(scope: !768, file: !318, discriminator: 1)
!787 = !DILocation(line: 269, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !789, file: !318, line: 269, column: 8)
!789 = distinct !DILexicalBlock(scope: !773, file: !318, line: 268, column: 49)
!790 = !DILocation(line: 269, column: 17, scope: !788)
!791 = !DILocation(line: 269, column: 28, scope: !788)
!792 = !DILocation(line: 269, column: 34, scope: !788)
!793 = !DILocation(line: 269, column: 38, scope: !794)
!794 = !DILexicalBlockFile(scope: !788, file: !318, discriminator: 1)
!795 = !DILocation(line: 269, column: 48, scope: !794)
!796 = !DILocation(line: 269, column: 54, scope: !794)
!797 = !DILocation(line: 269, column: 44, scope: !794)
!798 = !DILocation(line: 269, column: 66, scope: !794)
!799 = !DILocation(line: 269, column: 70, scope: !800)
!800 = !DILexicalBlockFile(scope: !788, file: !318, discriminator: 2)
!801 = !DILocation(line: 269, column: 76, scope: !800)
!802 = !DILocation(line: 269, column: 85, scope: !800)
!803 = !DILocation(line: 269, column: 81, scope: !800)
!804 = !DILocation(line: 269, column: 91, scope: !800)
!805 = !DILocation(line: 269, column: 95, scope: !806)
!806 = !DILexicalBlockFile(scope: !788, file: !318, discriminator: 3)
!807 = !DILocation(line: 269, column: 101, scope: !806)
!808 = !DILocation(line: 269, column: 118, scope: !806)
!809 = !DILocation(line: 269, column: 124, scope: !806)
!810 = !DILocation(line: 269, column: 114, scope: !806)
!811 = !DILocation(line: 269, column: 8, scope: !806)
!812 = !DILocation(line: 271, column: 5, scope: !813)
!813 = distinct !DILexicalBlock(scope: !788, file: !318, line: 269, column: 131)
!814 = !DILocation(line: 271, column: 10, scope: !813)
!815 = !DILocation(line: 271, column: 16, scope: !813)
!816 = !DILocation(line: 272, column: 9, scope: !817)
!817 = distinct !DILexicalBlock(scope: !813, file: !318, line: 272, column: 9)
!818 = !DILocation(line: 272, column: 14, scope: !817)
!819 = !DILocation(line: 272, column: 25, scope: !817)
!820 = !DILocation(line: 272, column: 31, scope: !817)
!821 = !DILocation(line: 273, column: 9, scope: !817)
!822 = !DILocation(line: 273, column: 16, scope: !817)
!823 = !DILocation(line: 273, column: 21, scope: !817)
!824 = !DILocation(line: 273, column: 14, scope: !817)
!825 = !DILocation(line: 272, column: 9, scope: !826)
!826 = !DILexicalBlockFile(scope: !813, file: !318, discriminator: 1)
!827 = !DILocation(line: 274, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !817, file: !318, line: 273, column: 33)
!829 = !DILocation(line: 275, column: 6, scope: !828)
!830 = !DILocation(line: 275, column: 11, scope: !828)
!831 = !DILocation(line: 275, column: 17, scope: !828)
!832 = !DILocation(line: 276, column: 24, scope: !828)
!833 = !DILocation(line: 276, column: 6, scope: !828)
!834 = !DILocation(line: 276, column: 11, scope: !828)
!835 = !DILocation(line: 276, column: 22, scope: !828)
!836 = !DILocation(line: 277, column: 5, scope: !828)
!837 = !DILocation(line: 279, column: 17, scope: !813)
!838 = !DILocation(line: 279, column: 5, scope: !813)
!839 = !DILocation(line: 279, column: 10, scope: !813)
!840 = !DILocation(line: 279, column: 15, scope: !813)
!841 = !DILocation(line: 280, column: 4, scope: !813)
!842 = !DILocation(line: 281, column: 12, scope: !789)
!843 = !DILocation(line: 281, column: 17, scope: !789)
!844 = !DILocation(line: 281, column: 9, scope: !789)
!845 = !DILocation(line: 282, column: 3, scope: !789)
!846 = !DILocation(line: 283, column: 2, scope: !768)
!847 = !DILocation(line: 264, column: 43, scope: !848)
!848 = !DILexicalBlockFile(scope: !764, file: !318, discriminator: 2)
!849 = !DILocation(line: 264, column: 48, scope: !848)
!850 = !DILocation(line: 264, column: 41, scope: !848)
!851 = !DILocation(line: 264, column: 2, scope: !848)
!852 = distinct !{!852, !853}
!853 = !DILocation(line: 264, column: 2, scope: !702)
!854 = !DILocation(line: 287, column: 14, scope: !702)
!855 = !DILocation(line: 288, column: 13, scope: !856)
!856 = distinct !DILexicalBlock(scope: !702, file: !318, line: 288, column: 2)
!857 = !DILocation(line: 288, column: 18, scope: !856)
!858 = !DILocation(line: 288, column: 11, scope: !856)
!859 = !DILocation(line: 288, column: 7, scope: !856)
!860 = !DILocation(line: 288, column: 25, scope: !861)
!861 = !DILexicalBlockFile(scope: !862, file: !318, discriminator: 1)
!862 = distinct !DILexicalBlock(scope: !856, file: !318, line: 288, column: 2)
!863 = !DILocation(line: 288, column: 29, scope: !861)
!864 = !DILocation(line: 288, column: 2, scope: !861)
!865 = !DILocalVariable(name: "rec", scope: !866, file: !318, line: 289, type: !174)
!866 = distinct !DILexicalBlock(scope: !862, file: !318, line: 288, column: 54)
!867 = !DILocation(line: 289, column: 18, scope: !866)
!868 = !DILocation(line: 289, column: 24, scope: !866)
!869 = !DILocation(line: 289, column: 29, scope: !866)
!870 = !DILocation(line: 291, column: 7, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !318, line: 291, column: 7)
!872 = !DILocation(line: 291, column: 12, scope: !871)
!873 = !DILocation(line: 291, column: 20, scope: !871)
!874 = !DILocation(line: 291, column: 7, scope: !866)
!875 = !DILocation(line: 292, column: 8, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !318, line: 292, column: 8)
!877 = distinct !DILexicalBlock(scope: !871, file: !318, line: 291, column: 37)
!878 = !DILocation(line: 292, column: 13, scope: !876)
!879 = !DILocation(line: 292, column: 18, scope: !876)
!880 = !DILocation(line: 292, column: 8, scope: !877)
!881 = !DILocation(line: 293, column: 35, scope: !876)
!882 = !DILocation(line: 293, column: 48, scope: !876)
!883 = !DILocation(line: 293, column: 19, scope: !876)
!884 = !DILocation(line: 293, column: 17, scope: !876)
!885 = !DILocation(line: 293, column: 5, scope: !876)
!886 = !DILocation(line: 294, column: 13, scope: !887)
!887 = distinct !DILexicalBlock(scope: !876, file: !318, line: 294, column: 13)
!888 = !DILocation(line: 294, column: 18, scope: !887)
!889 = !DILocation(line: 294, column: 31, scope: !887)
!890 = !DILocation(line: 294, column: 35, scope: !887)
!891 = !DILocation(line: 295, column: 7, scope: !887)
!892 = !DILocation(line: 295, column: 12, scope: !887)
!893 = !DILocation(line: 295, column: 23, scope: !887)
!894 = !DILocation(line: 295, column: 29, scope: !887)
!895 = !DILocation(line: 296, column: 7, scope: !887)
!896 = !DILocation(line: 296, column: 12, scope: !887)
!897 = !DILocation(line: 296, column: 19, scope: !887)
!898 = !DILocation(line: 296, column: 24, scope: !887)
!899 = !DILocation(line: 296, column: 17, scope: !887)
!900 = !DILocation(line: 294, column: 13, scope: !901)
!901 = !DILexicalBlockFile(scope: !876, file: !318, discriminator: 1)
!902 = !DILocation(line: 299, column: 5, scope: !903)
!903 = distinct !DILexicalBlock(scope: !887, file: !318, line: 296, column: 37)
!904 = !DILocation(line: 300, column: 5, scope: !903)
!905 = !DILocation(line: 300, column: 10, scope: !903)
!906 = !DILocation(line: 300, column: 16, scope: !903)
!907 = !DILocation(line: 301, column: 23, scope: !903)
!908 = !DILocation(line: 301, column: 28, scope: !903)
!909 = !DILocation(line: 301, column: 5, scope: !903)
!910 = !DILocation(line: 301, column: 10, scope: !903)
!911 = !DILocation(line: 301, column: 21, scope: !903)
!912 = !DILocation(line: 302, column: 4, scope: !903)
!913 = !DILocation(line: 303, column: 3, scope: !877)
!914 = !DILocation(line: 304, column: 2, scope: !866)
!915 = !DILocation(line: 288, column: 43, scope: !916)
!916 = !DILexicalBlockFile(scope: !862, file: !318, discriminator: 2)
!917 = !DILocation(line: 288, column: 48, scope: !916)
!918 = !DILocation(line: 288, column: 41, scope: !916)
!919 = !DILocation(line: 288, column: 2, scope: !916)
!920 = distinct !{!920, !921}
!921 = !DILocation(line: 288, column: 2, scope: !702)
!922 = !DILocation(line: 306, column: 10, scope: !702)
!923 = !DILocation(line: 306, column: 8, scope: !702)
!924 = !DILocation(line: 307, column: 13, scope: !925)
!925 = distinct !DILexicalBlock(scope: !702, file: !318, line: 307, column: 2)
!926 = !DILocation(line: 307, column: 11, scope: !925)
!927 = !DILocation(line: 307, column: 7, scope: !925)
!928 = !DILocation(line: 307, column: 26, scope: !929)
!929 = !DILexicalBlockFile(scope: !930, file: !318, discriminator: 1)
!930 = distinct !DILexicalBlock(scope: !925, file: !318, line: 307, column: 2)
!931 = !DILocation(line: 307, column: 30, scope: !929)
!932 = !DILocation(line: 307, column: 2, scope: !929)
!933 = !DILocalVariable(name: "rec", scope: !934, file: !318, line: 308, type: !174)
!934 = distinct !DILexicalBlock(scope: !930, file: !318, line: 307, column: 55)
!935 = !DILocation(line: 308, column: 18, scope: !934)
!936 = !DILocation(line: 308, column: 24, scope: !934)
!937 = !DILocation(line: 308, column: 29, scope: !934)
!938 = !DILocation(line: 310, column: 12, scope: !934)
!939 = !DILocation(line: 310, column: 17, scope: !934)
!940 = !DILocation(line: 310, column: 9, scope: !934)
!941 = !DILocation(line: 311, column: 10, scope: !942)
!942 = distinct !DILexicalBlock(scope: !934, file: !318, line: 311, column: 7)
!943 = !DILocation(line: 311, column: 16, scope: !942)
!944 = !DILocation(line: 311, column: 27, scope: !942)
!945 = !DILocation(line: 311, column: 33, scope: !942)
!946 = !DILocation(line: 311, column: 37, scope: !947)
!947 = !DILexicalBlockFile(scope: !942, file: !318, discriminator: 1)
!948 = !DILocation(line: 311, column: 48, scope: !947)
!949 = !DILocation(line: 311, column: 54, scope: !947)
!950 = !DILocation(line: 311, column: 44, scope: !947)
!951 = !DILocation(line: 311, column: 66, scope: !947)
!952 = !DILocation(line: 311, column: 70, scope: !953)
!953 = !DILexicalBlockFile(scope: !942, file: !318, discriminator: 2)
!954 = !DILocation(line: 311, column: 76, scope: !953)
!955 = !DILocation(line: 311, column: 85, scope: !953)
!956 = !DILocation(line: 311, column: 81, scope: !953)
!957 = !DILocation(line: 311, column: 92, scope: !953)
!958 = !DILocation(line: 311, column: 96, scope: !959)
!959 = !DILexicalBlockFile(scope: !942, file: !318, discriminator: 3)
!960 = !DILocation(line: 311, column: 102, scope: !959)
!961 = !DILocation(line: 311, column: 119, scope: !959)
!962 = !DILocation(line: 311, column: 125, scope: !959)
!963 = !DILocation(line: 311, column: 115, scope: !959)
!964 = !DILocation(line: 311, column: 7, scope: !959)
!965 = !DILocation(line: 312, column: 4, scope: !966)
!966 = distinct !DILexicalBlock(scope: !942, file: !318, line: 311, column: 132)
!967 = !DILocation(line: 312, column: 9, scope: !966)
!968 = !DILocation(line: 312, column: 15, scope: !966)
!969 = !DILocation(line: 313, column: 8, scope: !970)
!970 = distinct !DILexicalBlock(scope: !966, file: !318, line: 313, column: 8)
!971 = !DILocation(line: 313, column: 13, scope: !970)
!972 = !DILocation(line: 313, column: 24, scope: !970)
!973 = !DILocation(line: 313, column: 30, scope: !970)
!974 = !DILocation(line: 314, column: 8, scope: !970)
!975 = !DILocation(line: 314, column: 16, scope: !970)
!976 = !DILocation(line: 314, column: 21, scope: !970)
!977 = !DILocation(line: 314, column: 14, scope: !970)
!978 = !DILocation(line: 313, column: 8, scope: !979)
!979 = !DILexicalBlockFile(scope: !966, file: !318, discriminator: 1)
!980 = !DILocation(line: 315, column: 5, scope: !981)
!981 = distinct !DILexicalBlock(scope: !970, file: !318, line: 314, column: 33)
!982 = !DILocation(line: 316, column: 5, scope: !981)
!983 = !DILocation(line: 316, column: 10, scope: !981)
!984 = !DILocation(line: 316, column: 16, scope: !981)
!985 = !DILocation(line: 317, column: 23, scope: !981)
!986 = !DILocation(line: 317, column: 5, scope: !981)
!987 = !DILocation(line: 317, column: 10, scope: !981)
!988 = !DILocation(line: 317, column: 21, scope: !981)
!989 = !DILocation(line: 318, column: 4, scope: !981)
!990 = !DILocation(line: 319, column: 16, scope: !966)
!991 = !DILocation(line: 319, column: 4, scope: !966)
!992 = !DILocation(line: 319, column: 9, scope: !966)
!993 = !DILocation(line: 319, column: 14, scope: !966)
!994 = !DILocation(line: 320, column: 3, scope: !966)
!995 = !DILocation(line: 321, column: 2, scope: !934)
!996 = !DILocation(line: 307, column: 44, scope: !997)
!997 = !DILexicalBlockFile(scope: !930, file: !318, discriminator: 2)
!998 = !DILocation(line: 307, column: 49, scope: !997)
!999 = !DILocation(line: 307, column: 42, scope: !997)
!1000 = !DILocation(line: 307, column: 2, scope: !997)
!1001 = distinct !{!1001, !1002}
!1002 = !DILocation(line: 307, column: 2, scope: !702)
!1003 = !DILocation(line: 322, column: 15, scope: !702)
!1004 = !DILocation(line: 322, column: 2, scope: !702)
!1005 = !DILocation(line: 324, column: 15, scope: !702)
!1006 = !DILocation(line: 324, column: 13, scope: !702)
!1007 = !DILocation(line: 325, column: 1, scope: !702)
!1008 = distinct !DISubprogram(name: "statusbar_item_redraw", scope: !318, file: !318, line: 346, type: !1009, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !174}
!1011 = !DILocalVariable(name: "item", arg: 1, scope: !1008, file: !318, line: 346, type: !174)
!1012 = !DILocation(line: 346, column: 43, scope: !1008)
!1013 = !DILocalVariable(name: "old_active_win", scope: !1008, file: !318, line: 348, type: !58)
!1014 = !DILocation(line: 348, column: 21, scope: !1008)
!1015 = !DILocation(line: 350, column: 2, scope: !1008)
!1016 = distinct !{!1016, !1015}
!1017 = !DILocation(line: 350, column: 10, scope: !1018)
!1018 = !DILexicalBlockFile(scope: !1019, file: !318, discriminator: 1)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !318, line: 350, column: 10)
!1020 = distinct !DILexicalBlock(scope: !1008, file: !318, line: 350, column: 4)
!1021 = !DILocation(line: 350, column: 15, scope: !1018)
!1022 = !DILocation(line: 350, column: 5, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1024, file: !318, discriminator: 2)
!1024 = distinct !DILexicalBlock(scope: !1019, file: !318, line: 350, column: 3)
!1025 = !DILocation(line: 350, column: 14, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1027, file: !318, discriminator: 3)
!1027 = distinct !DILexicalBlock(scope: !1019, file: !318, line: 350, column: 12)
!1028 = !DILocation(line: 350, column: 99, scope: !1026)
!1029 = !DILocation(line: 350, column: 110, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1020, file: !318, discriminator: 4)
!1031 = !DILocation(line: 352, column: 19, scope: !1008)
!1032 = !DILocation(line: 352, column: 17, scope: !1008)
!1033 = !DILocation(line: 353, column: 13, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1008, file: !318, line: 353, column: 13)
!1035 = !DILocation(line: 353, column: 19, scope: !1034)
!1036 = !DILocation(line: 353, column: 24, scope: !1034)
!1037 = !DILocation(line: 353, column: 38, scope: !1034)
!1038 = !DILocation(line: 353, column: 13, scope: !1008)
!1039 = !DILocation(line: 354, column: 16, scope: !1034)
!1040 = !DILocation(line: 354, column: 22, scope: !1034)
!1041 = !DILocation(line: 354, column: 27, scope: !1034)
!1042 = !DILocation(line: 354, column: 42, scope: !1034)
!1043 = !DILocation(line: 354, column: 14, scope: !1034)
!1044 = !DILocation(line: 354, column: 3, scope: !1034)
!1045 = !DILocation(line: 356, column: 2, scope: !1008)
!1046 = !DILocation(line: 356, column: 8, scope: !1008)
!1047 = !DILocation(line: 356, column: 13, scope: !1008)
!1048 = !DILocation(line: 358, column: 2, scope: !1008)
!1049 = !DILocation(line: 358, column: 8, scope: !1008)
!1050 = !DILocation(line: 358, column: 14, scope: !1008)
!1051 = !DILocation(line: 359, column: 2, scope: !1008)
!1052 = !DILocation(line: 359, column: 8, scope: !1008)
!1053 = !DILocation(line: 359, column: 13, scope: !1008)
!1054 = !DILocation(line: 359, column: 19, scope: !1008)
!1055 = !DILocation(line: 360, column: 2, scope: !1008)
!1056 = !DILocation(line: 362, column: 6, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1008, file: !318, line: 362, column: 6)
!1058 = !DILocation(line: 362, column: 12, scope: !1057)
!1059 = !DILocation(line: 362, column: 24, scope: !1057)
!1060 = !DILocation(line: 362, column: 30, scope: !1057)
!1061 = !DILocation(line: 362, column: 21, scope: !1057)
!1062 = !DILocation(line: 362, column: 6, scope: !1008)
!1063 = !DILocation(line: 365, column: 20, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1057, file: !318, line: 362, column: 36)
!1065 = !DILocation(line: 365, column: 26, scope: !1064)
!1066 = !DILocation(line: 365, column: 31, scope: !1064)
!1067 = !DILocation(line: 365, column: 37, scope: !1064)
!1068 = !DILocation(line: 365, column: 45, scope: !1064)
!1069 = !DILocation(line: 365, column: 3, scope: !1064)
!1070 = !DILocation(line: 366, column: 2, scope: !1064)
!1071 = !DILocation(line: 368, column: 15, scope: !1008)
!1072 = !DILocation(line: 368, column: 13, scope: !1008)
!1073 = !DILocation(line: 369, column: 1, scope: !1008)
!1074 = !DILocation(line: 369, column: 1, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1008, file: !318, discriminator: 1)
!1076 = distinct !DISubprogram(name: "statusbar_items_redraw", scope: !318, file: !318, line: 371, type: !393, isLocal: false, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!1077 = !DILocalVariable(name: "name", arg: 1, scope: !1076, file: !318, line: 371, type: !32)
!1078 = !DILocation(line: 371, column: 41, scope: !1076)
!1079 = !DILocation(line: 373, column: 38, scope: !1076)
!1080 = !DILocation(line: 373, column: 56, scope: !1076)
!1081 = !DILocation(line: 373, column: 18, scope: !1076)
!1082 = !DILocation(line: 373, column: 2, scope: !1083)
!1083 = !DILexicalBlockFile(scope: !1076, file: !318, discriminator: 1)
!1084 = !DILocation(line: 375, column: 1, scope: !1076)
!1085 = distinct !DISubprogram(name: "statusbar_create", scope: !318, file: !318, line: 470, type: !1086, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!34, !5, !40, !52}
!1088 = !DILocalVariable(name: "group", arg: 1, scope: !1085, file: !318, line: 470, type: !5)
!1089 = !DILocation(line: 470, column: 54, scope: !1085)
!1090 = !DILocalVariable(name: "config", arg: 2, scope: !1085, file: !318, line: 471, type: !40)
!1091 = !DILocation(line: 471, column: 55, scope: !1085)
!1092 = !DILocalVariable(name: "parent_window", arg: 3, scope: !1085, file: !318, line: 472, type: !52)
!1093 = !DILocation(line: 472, column: 50, scope: !1085)
!1094 = !DILocalVariable(name: "bar", scope: !1085, file: !318, line: 474, type: !34)
!1095 = !DILocation(line: 474, column: 17, scope: !1085)
!1096 = !DILocalVariable(name: "theme", scope: !1085, file: !318, line: 475, type: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "THEME_REC", file: !1099, line: 33, baseType: !1100)
!1099 = !DIFile(filename: "../../src/fe-common/core/themes.h", directory: "/home/lichi/Desktop/irssi/task1")
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1099, line: 13, size: 8768, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1113, !1114, !1115}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1100, file: !1099, line: 14, baseType: !46, size: 32, align: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1100, file: !1099, line: 16, baseType: !11, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1100, file: !1099, line: 17, baseType: !11, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "last_modify", scope: !1100, file: !1099, line: 18, baseType: !91, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "default_color", scope: !1100, file: !1099, line: 20, baseType: !46, size: 32, align: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "info_eol", scope: !1100, file: !1099, line: 23, baseType: !111, size: 1, align: 32, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !1100, file: !1099, line: 26, baseType: !79, size: 64, align: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "replace_keys", scope: !1100, file: !1099, line: 28, baseType: !1110, size: 8192, align: 32, offset: 384)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8192, align: 32, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "replace_values", scope: !1100, file: !1099, line: 29, baseType: !14, size: 64, align: 64, offset: 8576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "abstracts", scope: !1100, file: !1099, line: 30, baseType: !79, size: 64, align: 64, offset: 8640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !1100, file: !1099, line: 32, baseType: !4, size: 64, align: 64, offset: 8704)
!1116 = !DILocation(line: 475, column: 13, scope: !1085)
!1117 = !DILocalVariable(name: "tmp", scope: !1085, file: !318, line: 476, type: !14)
!1118 = !DILocation(line: 476, column: 17, scope: !1085)
!1119 = !DILocalVariable(name: "name", scope: !1085, file: !318, line: 477, type: !11)
!1120 = !DILocation(line: 477, column: 8, scope: !1085)
!1121 = !DILocalVariable(name: "value", scope: !1085, file: !318, line: 477, type: !11)
!1122 = !DILocation(line: 477, column: 15, scope: !1085)
!1123 = !DILocation(line: 479, column: 9, scope: !1085)
!1124 = distinct !{!1124, !1123}
!1125 = !DILocation(line: 479, column: 17, scope: !1126)
!1126 = !DILexicalBlockFile(scope: !1127, file: !318, discriminator: 1)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !318, line: 479, column: 17)
!1128 = distinct !DILexicalBlock(scope: !1085, file: !318, line: 479, column: 11)
!1129 = !DILocation(line: 479, column: 23, scope: !1126)
!1130 = !DILocation(line: 479, column: 12, scope: !1131)
!1131 = !DILexicalBlockFile(scope: !1132, file: !318, discriminator: 2)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !318, line: 479, column: 10)
!1133 = !DILocation(line: 479, column: 21, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1135, file: !318, discriminator: 3)
!1135 = distinct !DILexicalBlock(scope: !1127, file: !318, line: 479, column: 19)
!1136 = !DILocation(line: 479, column: 107, scope: !1134)
!1137 = !DILocation(line: 479, column: 14, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1128, file: !318, discriminator: 4)
!1139 = !DILocation(line: 480, column: 9, scope: !1085)
!1140 = distinct !{!1140, !1139}
!1141 = !DILocation(line: 480, column: 17, scope: !1142)
!1142 = !DILexicalBlockFile(scope: !1143, file: !318, discriminator: 1)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !318, line: 480, column: 17)
!1144 = distinct !DILexicalBlock(scope: !1085, file: !318, line: 480, column: 11)
!1145 = !DILocation(line: 480, column: 24, scope: !1142)
!1146 = !DILocation(line: 480, column: 12, scope: !1147)
!1147 = !DILexicalBlockFile(scope: !1148, file: !318, discriminator: 2)
!1148 = distinct !DILexicalBlock(scope: !1143, file: !318, line: 480, column: 10)
!1149 = !DILocation(line: 480, column: 21, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1151, file: !318, discriminator: 3)
!1151 = distinct !DILexicalBlock(scope: !1143, file: !318, line: 480, column: 19)
!1152 = !DILocation(line: 480, column: 108, scope: !1150)
!1153 = !DILocation(line: 480, column: 14, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1144, file: !318, discriminator: 4)
!1155 = !DILocation(line: 481, column: 2, scope: !1085)
!1156 = distinct !{!1156, !1155}
!1157 = !DILocation(line: 481, column: 10, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1159, file: !318, discriminator: 1)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !318, line: 481, column: 10)
!1160 = distinct !DILexicalBlock(scope: !1085, file: !318, line: 481, column: 4)
!1161 = !DILocation(line: 481, column: 18, scope: !1158)
!1162 = !DILocation(line: 481, column: 23, scope: !1158)
!1163 = !DILocation(line: 481, column: 28, scope: !1158)
!1164 = !DILocation(line: 481, column: 31, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1159, file: !318, discriminator: 2)
!1166 = !DILocation(line: 481, column: 45, scope: !1165)
!1167 = !DILocation(line: 481, column: 10, scope: !1165)
!1168 = !DILocation(line: 481, column: 5, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1170, file: !318, discriminator: 3)
!1170 = distinct !DILexicalBlock(scope: !1159, file: !318, line: 481, column: 3)
!1171 = !DILocation(line: 481, column: 14, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1173, file: !318, discriminator: 4)
!1173 = distinct !DILexicalBlock(scope: !1159, file: !318, line: 481, column: 12)
!1174 = !DILocation(line: 481, column: 149, scope: !1172)
!1175 = !DILocation(line: 481, column: 7, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1160, file: !318, discriminator: 5)
!1177 = !DILocation(line: 484, column: 27, scope: !1085)
!1178 = !DILocation(line: 484, column: 9, scope: !1085)
!1179 = !DILocation(line: 484, column: 6, scope: !1085)
!1180 = !DILocation(line: 485, column: 31, scope: !1085)
!1181 = !DILocation(line: 485, column: 38, scope: !1085)
!1182 = !DILocation(line: 485, column: 44, scope: !1085)
!1183 = !DILocation(line: 485, column: 16, scope: !1085)
!1184 = !DILocation(line: 485, column: 2, scope: !1085)
!1185 = !DILocation(line: 485, column: 9, scope: !1085)
!1186 = !DILocation(line: 485, column: 14, scope: !1085)
!1187 = !DILocation(line: 487, column: 15, scope: !1085)
!1188 = !DILocation(line: 487, column: 2, scope: !1085)
!1189 = !DILocation(line: 487, column: 7, scope: !1085)
!1190 = !DILocation(line: 487, column: 13, scope: !1085)
!1191 = !DILocation(line: 489, column: 23, scope: !1085)
!1192 = !DILocation(line: 489, column: 9, scope: !1085)
!1193 = !DILocation(line: 489, column: 14, scope: !1085)
!1194 = !DILocation(line: 489, column: 21, scope: !1085)
!1195 = !DILocation(line: 490, column: 30, scope: !1085)
!1196 = !DILocation(line: 490, column: 9, scope: !1085)
!1197 = !DILocation(line: 490, column: 14, scope: !1085)
!1198 = !DILocation(line: 490, column: 28, scope: !1085)
!1199 = !DILocation(line: 492, column: 2, scope: !1085)
!1200 = !DILocation(line: 493, column: 2, scope: !1085)
!1201 = !DILocation(line: 493, column: 7, scope: !1085)
!1202 = !DILocation(line: 493, column: 13, scope: !1085)
!1203 = !DILocation(line: 494, column: 9, scope: !1085)
!1204 = !DILocation(line: 494, column: 14, scope: !1085)
!1205 = !DILocation(line: 494, column: 25, scope: !1085)
!1206 = !DILocation(line: 496, column: 9, scope: !1085)
!1207 = !DILocation(line: 497, column: 2, scope: !1085)
!1208 = !DILocation(line: 498, column: 2, scope: !1085)
!1209 = !DILocation(line: 500, column: 6, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1085, file: !318, line: 500, column: 6)
!1211 = !DILocation(line: 500, column: 14, scope: !1210)
!1212 = !DILocation(line: 500, column: 19, scope: !1210)
!1213 = !DILocation(line: 500, column: 6, scope: !1085)
!1214 = !DILocation(line: 502, column: 29, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1210, file: !318, line: 500, column: 25)
!1216 = !DILocation(line: 502, column: 37, scope: !1215)
!1217 = !DILocation(line: 502, column: 47, scope: !1215)
!1218 = !DILocation(line: 503, column: 8, scope: !1215)
!1219 = !DILocation(line: 503, column: 16, scope: !1215)
!1220 = !DILocation(line: 503, column: 26, scope: !1215)
!1221 = !DILocation(line: 502, column: 3, scope: !1215)
!1222 = !DILocation(line: 504, column: 25, scope: !1215)
!1223 = !DILocation(line: 504, column: 23, scope: !1215)
!1224 = !DILocation(line: 505, column: 2, scope: !1215)
!1225 = !DILocation(line: 508, column: 19, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1210, file: !318, line: 505, column: 9)
!1227 = !DILocation(line: 508, column: 34, scope: !1226)
!1228 = !DILocation(line: 508, column: 46, scope: !1226)
!1229 = !DILocation(line: 508, column: 4, scope: !1226)
!1230 = !DILocation(line: 507, column: 3, scope: !1226)
!1231 = !DILocation(line: 507, column: 18, scope: !1226)
!1232 = !DILocation(line: 507, column: 29, scope: !1226)
!1233 = !DILocation(line: 509, column: 34, scope: !1226)
!1234 = !DILocation(line: 510, column: 13, scope: !1226)
!1235 = !DILocation(line: 510, column: 21, scope: !1226)
!1236 = !DILocation(line: 510, column: 31, scope: !1226)
!1237 = !DILocation(line: 511, column: 13, scope: !1226)
!1238 = !DILocation(line: 511, column: 21, scope: !1226)
!1239 = !DILocation(line: 511, column: 31, scope: !1226)
!1240 = !DILocation(line: 509, column: 3, scope: !1226)
!1241 = !DILocation(line: 512, column: 11, scope: !1226)
!1242 = !DILocation(line: 512, column: 25, scope: !1226)
!1243 = !DILocation(line: 512, column: 32, scope: !1226)
!1244 = !DILocation(line: 512, column: 35, scope: !1245)
!1245 = !DILexicalBlockFile(scope: !1226, file: !318, discriminator: 1)
!1246 = !DILocation(line: 512, column: 50, scope: !1245)
!1247 = !DILocation(line: 512, column: 57, scope: !1245)
!1248 = !DILocation(line: 512, column: 65, scope: !1245)
!1249 = !DILocation(line: 513, column: 4, scope: !1226)
!1250 = !DILocation(line: 513, column: 19, scope: !1226)
!1251 = !DILocation(line: 513, column: 27, scope: !1226)
!1252 = !DILocation(line: 513, column: 33, scope: !1226)
!1253 = !DILocation(line: 512, column: 11, scope: !1254)
!1254 = !DILexicalBlockFile(scope: !1226, file: !318, discriminator: 2)
!1255 = !DILocation(line: 514, column: 4, scope: !1226)
!1256 = !DILocation(line: 514, column: 19, scope: !1226)
!1257 = !DILocation(line: 514, column: 27, scope: !1226)
!1258 = !DILocation(line: 512, column: 11, scope: !1259)
!1259 = !DILexicalBlockFile(scope: !1226, file: !318, discriminator: 3)
!1260 = !DILocation(line: 514, column: 35, scope: !1245)
!1261 = !DILocation(line: 512, column: 11, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1226, file: !318, discriminator: 4)
!1263 = !DILocation(line: 512, column: 11, scope: !1264)
!1264 = !DILexicalBlockFile(scope: !1226, file: !318, discriminator: 5)
!1265 = !DILocation(line: 512, column: 9, scope: !1264)
!1266 = !DILocation(line: 517, column: 9, scope: !1085)
!1267 = !DILocation(line: 518, column: 2, scope: !1085)
!1268 = !DILocation(line: 519, column: 2, scope: !1085)
!1269 = !DILocation(line: 522, column: 46, scope: !1085)
!1270 = !DILocation(line: 522, column: 54, scope: !1085)
!1271 = !DILocation(line: 522, column: 16, scope: !1085)
!1272 = !DILocation(line: 522, column: 14, scope: !1085)
!1273 = !DILocation(line: 523, column: 30, scope: !1085)
!1274 = !DILocation(line: 523, column: 37, scope: !1085)
!1275 = !DILocation(line: 523, column: 10, scope: !1085)
!1276 = !DILocation(line: 523, column: 8, scope: !1085)
!1277 = !DILocation(line: 524, column: 9, scope: !1085)
!1278 = !DILocation(line: 524, column: 2, scope: !1085)
!1279 = !DILocation(line: 526, column: 7, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1085, file: !318, line: 526, column: 6)
!1281 = !DILocation(line: 526, column: 6, scope: !1280)
!1282 = !DILocation(line: 526, column: 13, scope: !1280)
!1283 = !DILocation(line: 526, column: 6, scope: !1085)
!1284 = !DILocation(line: 528, column: 10, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1280, file: !318, line: 526, column: 22)
!1286 = !DILocation(line: 528, column: 3, scope: !1285)
!1287 = !DILocation(line: 530, column: 40, scope: !1285)
!1288 = !DILocation(line: 530, column: 47, scope: !1285)
!1289 = !DILocation(line: 530, column: 10, scope: !1285)
!1290 = !DILocation(line: 530, column: 8, scope: !1285)
!1291 = !DILocation(line: 531, column: 31, scope: !1285)
!1292 = !DILocation(line: 531, column: 38, scope: !1285)
!1293 = !DILocation(line: 531, column: 11, scope: !1285)
!1294 = !DILocation(line: 531, column: 9, scope: !1285)
!1295 = !DILocation(line: 532, column: 10, scope: !1285)
