; ModuleID = './line168-dcc-get.o.i'
source_filename = "./line168-dcc-get.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.GET_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, i64, i64, i32, i32, [4 x i8], i32, i32, i8*, i8 }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !75, globals: !857)
!1 = !DIFile(filename: "line168-dcc-get.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35, !42, !54}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 12, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "dcc-get.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "DCC_GET_DEFAULT", value: 0)
!39 = !DIEnumerator(name: "DCC_GET_RENAME", value: 1)
!40 = !DIEnumerator(name: "DCC_GET_OVERWRITE", value: 2)
!41 = !DIEnumerator(name: "DCC_GET_RESUME", value: 3)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 51, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53}
!45 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!46 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!47 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!48 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!49 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!50 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!51 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!52 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!53 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 25, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!57 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!58 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!59 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!60 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!61 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!62 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!63 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!64 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!65 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!66 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!67 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!68 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!69 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!70 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!71 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!72 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!73 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!74 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!75 = !{!76, !784, !231, !202, !810, !187, !230, !429, !527, !814, !821}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "GET_DCC_REC", file: !36, line: 28, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 20, size: 2048, align: 64, elements: !79)
!79 = !{!80, !83, !84, !90, !746, !747, !748, !749, !754, !755, !756, !757, !761, !762, !763, !764, !765, !766, !767, !769, !770, !771, !772, !774, !775, !776, !777, !779, !780, !781, !782, !783}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !81, line: 1, baseType: !82, size: 32, align: 32)
!81 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !78, file: !81, line: 2, baseType: !82, size: 32, align: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !78, file: !81, line: 3, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !86, line: 75, baseType: !87)
!86 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !88, line: 139, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!89 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !78, file: !81, line: 5, baseType: !91, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !93, line: 6, baseType: !94)
!93 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !95, line: 42, size: 39168, align: 64, elements: !96)
!95 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !{!97, !99, !100, !101, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !401, !402, !406, !407, !408, !412, !417, !418, !419, !420, !421, !422, !423, !424, !431, !432, !433, !434, !435, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !743, !745}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !98, line: 3, baseType: !82, size: 32, align: 32)
!98 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !94, file: !98, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !94, file: !98, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !94, file: !98, line: 8, baseType: !102, size: 64, align: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !93, line: 5, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !95, line: 24, size: 2496, align: 64, elements: !105)
!105 = !{!106, !108, !109, !110, !113, !114, !115, !116, !117, !119, !120, !121, !122, !123, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !107, line: 3, baseType: !82, size: 32, align: 32)
!107 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !104, file: !107, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !104, file: !107, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !104, file: !107, line: 9, baseType: !111, size: 64, align: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !104, file: !107, line: 10, baseType: !82, size: 32, align: 32, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !104, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !104, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !104, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !104, file: !107, line: 13, baseType: !118, size: 16, align: 16, offset: 448)
!118 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !104, file: !107, line: 14, baseType: !111, size: 64, align: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !104, file: !107, line: 15, baseType: !111, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !104, file: !107, line: 16, baseType: !82, size: 32, align: 32, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !104, file: !107, line: 17, baseType: !111, size: 64, align: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !104, file: !107, line: 19, baseType: !124, size: 64, align: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !126, line: 99, baseType: !127)
!126 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !128, line: 22, size: 160, align: 32, elements: !129)
!128 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !127, file: !128, line: 23, baseType: !118, size: 16, align: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !127, file: !128, line: 24, baseType: !132, size: 128, align: 32, offset: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !133, line: 211, size: 128, align: 32, elements: !134)
!133 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !132, file: !133, line: 220, baseType: !136, size: 128, align: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !132, file: !133, line: 213, size: 128, align: 32, elements: !137)
!137 = !{!138, !145, !150}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !136, file: !133, line: 215, baseType: !139, size: 128, align: 8)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, align: 8, elements: !143)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !141, line: 48, baseType: !142)
!141 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!142 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!143 = !{!144}
!144 = !DISubrange(count: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !136, file: !133, line: 217, baseType: !146, size: 128, align: 16)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, align: 16, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !141, line: 49, baseType: !118)
!148 = !{!149}
!149 = !DISubrange(count: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !136, file: !133, line: 218, baseType: !151, size: 128, align: 32)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, align: 32, elements: !154)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !141, line: 51, baseType: !153)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = !{!155}
!155 = !DISubrange(count: 4)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !104, file: !107, line: 19, baseType: !124, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !104, file: !107, line: 21, baseType: !111, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !104, file: !107, line: 22, baseType: !111, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !104, file: !107, line: 23, baseType: !111, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !104, file: !107, line: 24, baseType: !111, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !104, file: !107, line: 26, baseType: !111, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !104, file: !107, line: 27, baseType: !111, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !104, file: !107, line: 28, baseType: !111, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !104, file: !107, line: 29, baseType: !111, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !104, file: !107, line: 30, baseType: !111, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !104, file: !107, line: 31, baseType: !111, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !104, file: !107, line: 32, baseType: !111, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !104, file: !107, line: 33, baseType: !111, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !104, file: !107, line: 35, baseType: !170, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !173)
!173 = !{!174, !177, !320, !321, !326, !327, !328, !329, !330, !339, !340, !341, !345, !346, !347, !348, !349, !350, !351, !352}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !172, file: !4, line: 100, baseType: !175, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !176, line: 49, baseType: !82)
!176 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !172, file: !4, line: 101, baseType: !178, size: 64, align: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !181)
!181 = !{!182, !205, !211, !217, !221, !307, !311, !316}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !180, file: !4, line: 133, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !170, !187, !189, !192, !193}
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !176, line: 46, baseType: !112)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !190, line: 66, baseType: !191)
!190 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!191 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !196, line: 42, baseType: !197)
!196 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !196, line: 44, size: 128, align: 64, elements: !198)
!198 = !{!199, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !197, file: !196, line: 46, baseType: !200, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !201, line: 36, baseType: !202)
!201 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !190, line: 45, baseType: !153)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !197, file: !196, line: 47, baseType: !175, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !197, file: !196, line: 48, baseType: !187, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !180, file: !4, line: 138, baseType: !206, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!186, !170, !209, !189, !192, !193}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !180, file: !4, line: 143, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!186, !170, !215, !216, !193}
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !190, line: 51, baseType: !89)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !180, file: !4, line: 147, baseType: !218, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!186, !170, !193}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !180, file: !4, line: 149, baseType: !222, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !170, !306}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !228)
!228 = !{!229, !232, !253, !282, !284, !288, !289, !290, !291, !299, !300, !301, !302}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !227, file: !16, line: 174, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !176, line: 77, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !227, file: !16, line: 175, baseType: !233, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !236)
!236 = !{!237, !241, !242}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !235, file: !16, line: 198, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !230}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !235, file: !16, line: 199, baseType: !238, size: 64, align: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !235, file: !16, line: 200, baseType: !243, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !230, !225, !246, !252}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !230}
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !176, line: 50, baseType: !175)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !227, file: !16, line: 177, baseType: !254, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !258)
!258 = !{!259, !264, !268, !272, !276, !277}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !257, file: !16, line: 216, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!251, !225, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !257, file: !16, line: 218, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!251, !225}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !257, file: !16, line: 219, baseType: !269, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!251, !225, !247, !230}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !257, file: !16, line: 222, baseType: !273, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !225}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !257, file: !16, line: 226, baseType: !247, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !257, file: !16, line: 227, baseType: !278, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !227, file: !16, line: 178, baseType: !283, size: 32, align: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !176, line: 55, baseType: !153)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !227, file: !16, line: 180, baseType: !285, size: 64, align: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !287)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !227, file: !16, line: 182, baseType: !175, size: 32, align: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !227, file: !16, line: 183, baseType: !283, size: 32, align: 32, offset: 352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !227, file: !16, line: 184, baseType: !283, size: 32, align: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !227, file: !16, line: 186, baseType: !292, size: 64, align: 64, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !294, line: 37, baseType: !295)
!294 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !294, line: 39, size: 128, align: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !294, line: 41, baseType: !230, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !294, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !227, file: !16, line: 188, baseType: !225, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !16, line: 189, baseType: !225, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !16, line: 191, baseType: !111, size: 64, align: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !227, file: !16, line: 193, baseType: !303, size: 64, align: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !180, file: !4, line: 151, baseType: !308, size: 64, align: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !170}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !180, file: !4, line: 152, baseType: !312, size: 64, align: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!186, !170, !315, !193}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !180, file: !4, line: 155, baseType: !317, size: 64, align: 64, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!315, !170}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !172, file: !4, line: 103, baseType: !187, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !172, file: !4, line: 104, baseType: !322, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !323, line: 77, baseType: !324)
!323 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !323, line: 77, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !172, file: !4, line: 105, baseType: !322, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !172, file: !4, line: 106, baseType: !187, size: 64, align: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !172, file: !4, line: 107, baseType: !283, size: 32, align: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !172, file: !4, line: 109, baseType: !189, size: 64, align: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !172, file: !4, line: 110, baseType: !331, size: 64, align: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !333, line: 39, baseType: !334)
!333 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !333, line: 41, size: 192, align: 64, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !334, file: !333, line: 43, baseType: !187, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !334, file: !333, line: 44, baseType: !189, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !334, file: !333, line: 45, baseType: !189, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !172, file: !4, line: 111, baseType: !331, size: 64, align: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !172, file: !4, line: 112, baseType: !331, size: 64, align: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !172, file: !4, line: 113, baseType: !342, size: 48, align: 8, offset: 704)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, align: 8, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 6)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !172, file: !4, line: 117, baseType: !283, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !172, file: !4, line: 118, baseType: !283, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !172, file: !4, line: 119, baseType: !283, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !172, file: !4, line: 120, baseType: !283, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !172, file: !4, line: 121, baseType: !283, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !172, file: !4, line: 122, baseType: !283, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !172, file: !4, line: 124, baseType: !230, size: 64, align: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !172, file: !4, line: 125, baseType: !230, size: 64, align: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !104, file: !107, line: 38, baseType: !153, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !104, file: !107, line: 39, baseType: !153, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !104, file: !107, line: 40, baseType: !153, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !104, file: !107, line: 41, baseType: !153, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !104, file: !107, line: 42, baseType: !153, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !104, file: !107, line: 43, baseType: !153, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !104, file: !107, line: 44, baseType: !153, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !104, file: !107, line: 45, baseType: !153, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !104, file: !107, line: 46, baseType: !111, size: 64, align: 64, offset: 1792)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !104, file: !107, line: 47, baseType: !111, size: 64, align: 64, offset: 1856)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !104, file: !95, line: 27, baseType: !111, size: 64, align: 64, offset: 1920)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !104, file: !95, line: 28, baseType: !111, size: 64, align: 64, offset: 1984)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !104, file: !95, line: 30, baseType: !82, size: 32, align: 32, offset: 2048)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !104, file: !95, line: 31, baseType: !111, size: 64, align: 64, offset: 2112)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !104, file: !95, line: 32, baseType: !111, size: 64, align: 64, offset: 2176)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !104, file: !95, line: 34, baseType: !82, size: 32, align: 32, offset: 2240)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !104, file: !95, line: 35, baseType: !82, size: 32, align: 32, offset: 2272)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !104, file: !95, line: 36, baseType: !82, size: 32, align: 32, offset: 2304)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !104, file: !95, line: 38, baseType: !82, size: 32, align: 32, offset: 2336)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !104, file: !95, line: 38, baseType: !82, size: 32, align: 32, offset: 2368)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !104, file: !95, line: 38, baseType: !82, size: 32, align: 32, offset: 2400)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !104, file: !95, line: 38, baseType: !82, size: 32, align: 32, offset: 2432)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !94, file: !98, line: 9, baseType: !85, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !94, file: !98, line: 10, baseType: !85, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !94, file: !98, line: 12, baseType: !111, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !94, file: !98, line: 13, baseType: !111, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !94, file: !98, line: 15, baseType: !153, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !94, file: !98, line: 16, baseType: !153, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !94, file: !98, line: 17, baseType: !153, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !94, file: !98, line: 18, baseType: !153, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !94, file: !98, line: 19, baseType: !153, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !94, file: !98, line: 21, baseType: !385, size: 64, align: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !126, line: 102, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !388, line: 7, size: 384, align: 64, elements: !389)
!388 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!389 = !{!390, !391, !395, !396, !397, !398, !399, !400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !387, file: !388, line: 8, baseType: !170, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !387, file: !388, line: 9, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !126, line: 101, baseType: !394)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !126, line: 101, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !387, file: !388, line: 11, baseType: !82, size: 32, align: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !387, file: !388, line: 12, baseType: !82, size: 32, align: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !387, file: !388, line: 13, baseType: !82, size: 32, align: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !387, file: !388, line: 14, baseType: !111, size: 64, align: 64, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !387, file: !388, line: 15, baseType: !82, size: 32, align: 32, offset: 320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !387, file: !388, line: 16, baseType: !153, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !94, file: !98, line: 22, baseType: !82, size: 32, align: 32, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !94, file: !98, line: 25, baseType: !403, size: 128, align: 64, offset: 640)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, align: 64, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 2)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !94, file: !98, line: 26, baseType: !82, size: 32, align: 32, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !94, file: !98, line: 27, baseType: !82, size: 32, align: 32, offset: 800)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !94, file: !98, line: 29, baseType: !409, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !126, line: 103, baseType: !411)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !126, line: 103, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !94, file: !98, line: 30, baseType: !413, size: 64, align: 64, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !415, line: 37, baseType: !416)
!415 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !415, line: 37, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !94, file: !98, line: 32, baseType: !111, size: 64, align: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !94, file: !98, line: 33, baseType: !111, size: 64, align: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !94, file: !98, line: 34, baseType: !111, size: 64, align: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !94, file: !98, line: 35, baseType: !153, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !94, file: !98, line: 36, baseType: !153, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !94, file: !98, line: 37, baseType: !153, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !94, file: !98, line: 38, baseType: !153, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !94, file: !98, line: 40, baseType: !425, size: 128, align: 64, offset: 1216)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !176, line: 504, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !176, line: 506, size: 128, align: 64, elements: !427)
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !426, file: !176, line: 508, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !176, line: 48, baseType: !89)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !426, file: !176, line: 509, baseType: !429, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !94, file: !98, line: 41, baseType: !85, size: 64, align: 64, offset: 1344)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !94, file: !98, line: 42, baseType: !82, size: 32, align: 32, offset: 1408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !94, file: !98, line: 44, baseType: !292, size: 64, align: 64, offset: 1472)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !94, file: !98, line: 45, baseType: !292, size: 64, align: 64, offset: 1536)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !94, file: !98, line: 53, baseType: !436, size: 64, align: 64, offset: 1600)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439, !527, !82}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !126, line: 107, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !442, line: 30, size: 2240, align: 64, elements: !443)
!442 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!443 = !{!444, !445, !446, !447, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !523, !529, !533, !537, !542, !619, !626, !630}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !98, line: 3, baseType: !82, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !441, file: !98, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !441, file: !98, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !441, file: !98, line: 8, baseType: !448, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !126, line: 113, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !442, line: 25, size: 1920, align: 64, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !107, line: 3, baseType: !82, size: 32, align: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !450, file: !107, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !450, file: !107, line: 6, baseType: !82, size: 32, align: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !450, file: !107, line: 9, baseType: !111, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !450, file: !107, line: 10, baseType: !82, size: 32, align: 32, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !450, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !450, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !450, file: !107, line: 11, baseType: !111, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !450, file: !107, line: 13, baseType: !118, size: 16, align: 16, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !450, file: !107, line: 14, baseType: !111, size: 64, align: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !450, file: !107, line: 15, baseType: !111, size: 64, align: 64, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !450, file: !107, line: 16, baseType: !82, size: 32, align: 32, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !450, file: !107, line: 17, baseType: !111, size: 64, align: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !450, file: !107, line: 19, baseType: !124, size: 64, align: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !450, file: !107, line: 19, baseType: !124, size: 64, align: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !450, file: !107, line: 21, baseType: !111, size: 64, align: 64, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !450, file: !107, line: 22, baseType: !111, size: 64, align: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !450, file: !107, line: 23, baseType: !111, size: 64, align: 64, offset: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !450, file: !107, line: 24, baseType: !111, size: 64, align: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !450, file: !107, line: 26, baseType: !111, size: 64, align: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !450, file: !107, line: 27, baseType: !111, size: 64, align: 64, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !450, file: !107, line: 28, baseType: !111, size: 64, align: 64, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !450, file: !107, line: 29, baseType: !111, size: 64, align: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !450, file: !107, line: 30, baseType: !111, size: 64, align: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !450, file: !107, line: 31, baseType: !111, size: 64, align: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !450, file: !107, line: 32, baseType: !111, size: 64, align: 64, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !450, file: !107, line: 33, baseType: !111, size: 64, align: 64, offset: 1600)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !450, file: !107, line: 35, baseType: !170, size: 64, align: 64, offset: 1664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !450, file: !107, line: 38, baseType: !153, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !450, file: !107, line: 39, baseType: !153, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !450, file: !107, line: 40, baseType: !153, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !450, file: !107, line: 41, baseType: !153, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !450, file: !107, line: 42, baseType: !153, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !450, file: !107, line: 43, baseType: !153, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !450, file: !107, line: 44, baseType: !153, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !450, file: !107, line: 45, baseType: !153, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !450, file: !107, line: 46, baseType: !111, size: 64, align: 64, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !450, file: !107, line: 47, baseType: !111, size: 64, align: 64, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !441, file: !98, line: 9, baseType: !85, size: 64, align: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !441, file: !98, line: 10, baseType: !85, size: 64, align: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !441, file: !98, line: 12, baseType: !111, size: 64, align: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !441, file: !98, line: 13, baseType: !111, size: 64, align: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !441, file: !98, line: 15, baseType: !153, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !441, file: !98, line: 16, baseType: !153, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !441, file: !98, line: 17, baseType: !153, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !441, file: !98, line: 18, baseType: !153, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !441, file: !98, line: 19, baseType: !153, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !441, file: !98, line: 21, baseType: !385, size: 64, align: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !441, file: !98, line: 22, baseType: !82, size: 32, align: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !441, file: !98, line: 25, baseType: !403, size: 128, align: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !441, file: !98, line: 26, baseType: !82, size: 32, align: 32, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !441, file: !98, line: 27, baseType: !82, size: 32, align: 32, offset: 800)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !441, file: !98, line: 29, baseType: !409, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !441, file: !98, line: 30, baseType: !413, size: 64, align: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !441, file: !98, line: 32, baseType: !111, size: 64, align: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !441, file: !98, line: 33, baseType: !111, size: 64, align: 64, offset: 1024)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !441, file: !98, line: 34, baseType: !111, size: 64, align: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !441, file: !98, line: 35, baseType: !153, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !441, file: !98, line: 36, baseType: !153, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !441, file: !98, line: 37, baseType: !153, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !441, file: !98, line: 38, baseType: !153, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !441, file: !98, line: 40, baseType: !425, size: 128, align: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !441, file: !98, line: 41, baseType: !85, size: 64, align: 64, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !441, file: !98, line: 42, baseType: !82, size: 32, align: 32, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !441, file: !98, line: 44, baseType: !292, size: 64, align: 64, offset: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !441, file: !98, line: 45, baseType: !292, size: 64, align: 64, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !441, file: !98, line: 53, baseType: !436, size: 64, align: 64, offset: 1600)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !441, file: !98, line: 55, baseType: !520, size: 64, align: 64, offset: 1664)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!82, !439, !112}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !441, file: !98, line: 57, baseType: !524, size: 64, align: 64, offset: 1728)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!82, !439, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !441, file: !98, line: 60, baseType: !530, size: 64, align: 64, offset: 1792)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!527, !439}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !441, file: !98, line: 62, baseType: !534, size: 64, align: 64, offset: 1856)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !439, !527, !527, !82}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !441, file: !98, line: 65, baseType: !538, size: 64, align: 64, offset: 1920)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !439, !527, !527}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !441, file: !98, line: 69, baseType: !543, size: 64, align: 64, offset: 1984)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !439, !527}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !126, line: 109, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !549, line: 15, size: 1408, align: 64, elements: !550)
!549 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = !{!551, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !569, !573, !575, !576, !577, !578, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !548, file: !552, line: 3, baseType: !82, size: 32, align: 32)
!552 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !548, file: !552, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !548, file: !552, line: 5, baseType: !413, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !548, file: !552, line: 7, baseType: !231, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !548, file: !552, line: 8, baseType: !439, size: 64, align: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !548, file: !552, line: 9, baseType: !111, size: 64, align: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !552, line: 10, baseType: !111, size: 64, align: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !548, file: !552, line: 11, baseType: !85, size: 64, align: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !548, file: !552, line: 12, baseType: !82, size: 32, align: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !548, file: !552, line: 13, baseType: !111, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !548, file: !552, line: 15, baseType: !563, size: 64, align: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !126, line: 108, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !126, line: 108, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !548, file: !552, line: 17, baseType: !570, size: 64, align: 64, offset: 640)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!527, !566}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !548, file: !574, line: 5, baseType: !111, size: 64, align: 64, offset: 704)
!574 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !548, file: !574, line: 6, baseType: !111, size: 64, align: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !548, file: !574, line: 7, baseType: !85, size: 64, align: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !548, file: !574, line: 9, baseType: !413, size: 64, align: 64, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !548, file: !574, line: 10, baseType: !579, size: 64, align: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !126, line: 111, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !582, line: 13, size: 576, align: 64, elements: !583)
!582 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!583 = !{!584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !585, line: 3, baseType: !82, size: 32, align: 32)
!585 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!586 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !581, file: !585, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !581, file: !585, line: 6, baseType: !85, size: 64, align: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !581, file: !585, line: 8, baseType: !111, size: 64, align: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !581, file: !585, line: 9, baseType: !111, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !581, file: !585, line: 10, baseType: !111, size: 64, align: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !581, file: !585, line: 11, baseType: !82, size: 32, align: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !581, file: !585, line: 14, baseType: !153, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !581, file: !585, line: 15, baseType: !153, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !581, file: !585, line: 18, baseType: !153, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !581, file: !585, line: 19, baseType: !153, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !581, file: !585, line: 20, baseType: !153, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !581, file: !585, line: 21, baseType: !153, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !581, file: !585, line: 22, baseType: !599, size: 64, align: 8, offset: 360)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, align: 8, elements: !148)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !581, file: !585, line: 26, baseType: !231, size: 64, align: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !585, line: 28, baseType: !579, size: 64, align: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !548, file: !574, line: 12, baseType: !153, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !548, file: !574, line: 13, baseType: !111, size: 64, align: 64, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !548, file: !574, line: 14, baseType: !82, size: 32, align: 32, offset: 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !548, file: !574, line: 15, baseType: !111, size: 64, align: 64, offset: 1216)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !548, file: !574, line: 17, baseType: !153, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !548, file: !574, line: 18, baseType: !153, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !548, file: !574, line: 19, baseType: !153, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !548, file: !574, line: 20, baseType: !153, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !548, file: !574, line: 22, baseType: !153, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !548, file: !574, line: 23, baseType: !153, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !548, file: !574, line: 24, baseType: !153, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !548, file: !574, line: 25, baseType: !153, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !548, file: !574, line: 26, baseType: !153, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !548, file: !574, line: 31, baseType: !616, size: 64, align: 64, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!111, !546}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !441, file: !98, line: 70, baseType: !620, size: 64, align: 64, offset: 2048)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!623, !439, !527}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !126, line: 110, baseType: !625)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !126, line: 110, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !441, file: !98, line: 71, baseType: !627, size: 64, align: 64, offset: 2112)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!82, !527, !527}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !441, file: !98, line: 73, baseType: !627, size: 64, align: 64, offset: 2176)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !94, file: !98, line: 55, baseType: !520, size: 64, align: 64, offset: 1664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !94, file: !98, line: 57, baseType: !524, size: 64, align: 64, offset: 1728)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !94, file: !98, line: 60, baseType: !530, size: 64, align: 64, offset: 1792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !94, file: !98, line: 62, baseType: !534, size: 64, align: 64, offset: 1856)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !94, file: !98, line: 65, baseType: !538, size: 64, align: 64, offset: 1920)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !94, file: !98, line: 69, baseType: !543, size: 64, align: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !94, file: !98, line: 70, baseType: !620, size: 64, align: 64, offset: 2048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !94, file: !98, line: 71, baseType: !627, size: 64, align: 64, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !94, file: !98, line: 73, baseType: !627, size: 64, align: 64, offset: 2176)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !94, file: !95, line: 46, baseType: !292, size: 64, align: 64, offset: 2240)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !94, file: !95, line: 47, baseType: !292, size: 64, align: 64, offset: 2304)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !94, file: !95, line: 48, baseType: !643, size: 64, align: 64, offset: 2368)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !93, line: 8, baseType: !645)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !93, line: 8, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !94, file: !95, line: 49, baseType: !292, size: 64, align: 64, offset: 2432)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !94, file: !95, line: 51, baseType: !111, size: 64, align: 64, offset: 2496)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !94, file: !95, line: 53, baseType: !111, size: 64, align: 64, offset: 2560)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !94, file: !95, line: 54, baseType: !111, size: 64, align: 64, offset: 2624)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !94, file: !95, line: 55, baseType: !111, size: 64, align: 64, offset: 2688)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !94, file: !95, line: 56, baseType: !111, size: 64, align: 64, offset: 2752)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !94, file: !95, line: 57, baseType: !82, size: 32, align: 32, offset: 2816)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !94, file: !95, line: 59, baseType: !153, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !94, file: !95, line: 60, baseType: !153, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !94, file: !95, line: 62, baseType: !153, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !94, file: !95, line: 63, baseType: !153, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !94, file: !95, line: 64, baseType: !153, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !94, file: !95, line: 65, baseType: !153, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !94, file: !95, line: 66, baseType: !153, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !94, file: !95, line: 67, baseType: !153, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !94, file: !95, line: 68, baseType: !153, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !94, file: !95, line: 69, baseType: !153, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !94, file: !95, line: 70, baseType: !153, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !94, file: !95, line: 71, baseType: !153, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !94, file: !95, line: 72, baseType: !153, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !94, file: !95, line: 74, baseType: !82, size: 32, align: 32, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !94, file: !95, line: 75, baseType: !82, size: 32, align: 32, offset: 2912)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !94, file: !95, line: 76, baseType: !82, size: 32, align: 32, offset: 2944)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !94, file: !95, line: 77, baseType: !82, size: 32, align: 32, offset: 2976)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !94, file: !95, line: 79, baseType: !413, size: 64, align: 64, offset: 3008)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !94, file: !95, line: 80, baseType: !292, size: 64, align: 64, offset: 3072)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !94, file: !95, line: 81, baseType: !292, size: 64, align: 64, offset: 3136)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !94, file: !95, line: 83, baseType: !331, size: 64, align: 64, offset: 3200)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !94, file: !95, line: 84, baseType: !283, size: 32, align: 32, offset: 3264)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !94, file: !95, line: 87, baseType: !82, size: 32, align: 32, offset: 3296)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !94, file: !95, line: 91, baseType: !292, size: 64, align: 64, offset: 3328)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !94, file: !95, line: 92, baseType: !425, size: 128, align: 64, offset: 3392)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !94, file: !95, line: 93, baseType: !425, size: 128, align: 64, offset: 3520)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !94, file: !95, line: 95, baseType: !82, size: 32, align: 32, offset: 3648)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !94, file: !95, line: 96, baseType: !82, size: 32, align: 32, offset: 3680)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !94, file: !95, line: 97, baseType: !82, size: 32, align: 32, offset: 3712)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !94, file: !95, line: 100, baseType: !292, size: 64, align: 64, offset: 3776)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !94, file: !95, line: 103, baseType: !292, size: 64, align: 64, offset: 3840)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !94, file: !95, line: 106, baseType: !292, size: 64, align: 64, offset: 3904)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !94, file: !95, line: 108, baseType: !413, size: 64, align: 64, offset: 3968)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !94, file: !95, line: 109, baseType: !292, size: 64, align: 64, offset: 4032)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !94, file: !95, line: 111, baseType: !292, size: 64, align: 64, offset: 4096)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !94, file: !95, line: 114, baseType: !231, size: 64, align: 64, offset: 4160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !94, file: !95, line: 116, baseType: !413, size: 64, align: 64, offset: 4224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !94, file: !95, line: 117, baseType: !691, size: 32768, align: 64, offset: 4288)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 32768, align: 64, elements: !741)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !693, line: 10, size: 128, align: 64, elements: !694)
!693 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!694 = !{!695, !740}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !692, file: !693, line: 11, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !693, line: 7, baseType: !698)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !700, !527, !112, !112, !111, !331}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !93, line: 7, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !703, line: 15, size: 1600, align: 64, elements: !704)
!703 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !552, line: 3, baseType: !82, size: 32, align: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !702, file: !552, line: 4, baseType: !82, size: 32, align: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !702, file: !552, line: 5, baseType: !413, size: 64, align: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !702, file: !552, line: 7, baseType: !231, size: 64, align: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !702, file: !552, line: 8, baseType: !91, size: 64, align: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !702, file: !552, line: 9, baseType: !111, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !702, file: !552, line: 10, baseType: !111, size: 64, align: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !702, file: !552, line: 11, baseType: !85, size: 64, align: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !702, file: !552, line: 12, baseType: !82, size: 32, align: 32, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !702, file: !552, line: 13, baseType: !111, size: 64, align: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !702, file: !552, line: 15, baseType: !563, size: 64, align: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !702, file: !552, line: 17, baseType: !570, size: 64, align: 64, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !702, file: !574, line: 5, baseType: !111, size: 64, align: 64, offset: 704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !702, file: !574, line: 6, baseType: !111, size: 64, align: 64, offset: 768)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !702, file: !574, line: 7, baseType: !85, size: 64, align: 64, offset: 832)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !702, file: !574, line: 9, baseType: !413, size: 64, align: 64, offset: 896)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !702, file: !574, line: 10, baseType: !579, size: 64, align: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !702, file: !574, line: 12, baseType: !153, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !702, file: !574, line: 13, baseType: !111, size: 64, align: 64, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !702, file: !574, line: 14, baseType: !82, size: 32, align: 32, offset: 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !702, file: !574, line: 15, baseType: !111, size: 64, align: 64, offset: 1216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !702, file: !574, line: 17, baseType: !153, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !702, file: !574, line: 18, baseType: !153, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !702, file: !574, line: 19, baseType: !153, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !702, file: !574, line: 20, baseType: !153, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !702, file: !574, line: 22, baseType: !153, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !702, file: !574, line: 23, baseType: !153, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !702, file: !574, line: 24, baseType: !153, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !702, file: !574, line: 25, baseType: !153, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !702, file: !574, line: 26, baseType: !153, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !702, file: !574, line: 31, baseType: !616, size: 64, align: 64, offset: 1344)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !702, file: !703, line: 18, baseType: !292, size: 64, align: 64, offset: 1408)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !702, file: !703, line: 20, baseType: !85, size: 64, align: 64, offset: 1472)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !702, file: !703, line: 21, baseType: !82, size: 32, align: 32, offset: 1536)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !702, file: !703, line: 22, baseType: !82, size: 32, align: 32, offset: 1568)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !692, file: !693, line: 12, baseType: !112, size: 8, align: 8, offset: 64)
!741 = !{!742}
!742 = !DISubrange(count: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !94, file: !95, line: 118, baseType: !744, size: 2048, align: 8, offset: 37056)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 2048, align: 8, elements: !741)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !94, file: !95, line: 120, baseType: !627, size: 64, align: 64, offset: 39104)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !78, file: !81, line: 6, baseType: !111, size: 64, align: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !78, file: !81, line: 7, baseType: !111, size: 64, align: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !78, file: !81, line: 8, baseType: !111, size: 64, align: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !78, file: !81, line: 10, baseType: !750, size: 64, align: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !752, line: 9, baseType: !753)
!752 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !752, line: 9, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !78, file: !81, line: 11, baseType: !111, size: 64, align: 64, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !78, file: !81, line: 12, baseType: !111, size: 64, align: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !78, file: !81, line: 14, baseType: !125, size: 160, align: 32, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !78, file: !81, line: 15, baseType: !758, size: 368, align: 8, offset: 736)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 368, align: 8, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 46)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !78, file: !81, line: 16, baseType: !82, size: 32, align: 32, offset: 1120)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !78, file: !81, line: 18, baseType: !170, size: 64, align: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !78, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !78, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1248)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !78, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1280)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !78, file: !81, line: 20, baseType: !85, size: 64, align: 64, offset: 1344)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !78, file: !81, line: 21, baseType: !768, size: 64, align: 64, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !126, line: 49, baseType: !191)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !78, file: !81, line: 23, baseType: !82, size: 32, align: 32, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !78, file: !81, line: 25, baseType: !153, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !78, file: !81, line: 27, baseType: !413, size: 64, align: 64, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !78, file: !773, line: 3, baseType: !768, size: 64, align: 64, offset: 1600)
!773 = !DIFile(filename: "dcc-file-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!774 = !DIDerivedType(tag: DW_TAG_member, name: "skipped", scope: !78, file: !773, line: 3, baseType: !768, size: 64, align: 64, offset: 1664)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fhandle", scope: !78, file: !773, line: 4, baseType: !82, size: 32, align: 32, offset: 1728)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !78, file: !773, line: 5, baseType: !82, size: 32, align: 32, offset: 1760)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "count_buf", scope: !78, file: !773, line: 8, baseType: !778, size: 32, align: 8, offset: 1792)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 32, align: 8, elements: !154)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "count_pos", scope: !78, file: !773, line: 9, baseType: !82, size: 32, align: 32, offset: 1824)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "get_type", scope: !78, file: !36, line: 23, baseType: !82, size: 32, align: 32, offset: 1856)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !78, file: !36, line: 24, baseType: !111, size: 64, align: 64, offset: 1920)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "file_quoted", scope: !78, file: !36, line: 26, baseType: !153, size: 1, align: 32, offset: 1984, flags: DIFlagBitField, extraData: i64 1984)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "from_dccserver", scope: !78, file: !36, line: 27, baseType: !153, size: 1, align: 32, offset: 1985, flags: DIFlagBitField, extraData: i64 1984)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !752, line: 13, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 11, size: 1600, align: 64, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !786, file: !81, line: 1, baseType: !82, size: 32, align: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !786, file: !81, line: 2, baseType: !82, size: 32, align: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !786, file: !81, line: 3, baseType: !85, size: 64, align: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !786, file: !81, line: 5, baseType: !91, size: 64, align: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !786, file: !81, line: 6, baseType: !111, size: 64, align: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !786, file: !81, line: 7, baseType: !111, size: 64, align: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !786, file: !81, line: 8, baseType: !111, size: 64, align: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !786, file: !81, line: 10, baseType: !750, size: 64, align: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !786, file: !81, line: 11, baseType: !111, size: 64, align: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !786, file: !81, line: 12, baseType: !111, size: 64, align: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !786, file: !81, line: 14, baseType: !125, size: 160, align: 32, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !786, file: !81, line: 15, baseType: !758, size: 368, align: 8, offset: 736)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !786, file: !81, line: 16, baseType: !82, size: 32, align: 32, offset: 1120)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !786, file: !81, line: 18, baseType: !170, size: 64, align: 64, offset: 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !786, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1216)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !786, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1248)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !786, file: !81, line: 19, baseType: !82, size: 32, align: 32, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !786, file: !81, line: 20, baseType: !85, size: 64, align: 64, offset: 1344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !786, file: !81, line: 21, baseType: !768, size: 64, align: 64, offset: 1408)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !786, file: !81, line: 23, baseType: !82, size: 32, align: 32, offset: 1472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !786, file: !81, line: 25, baseType: !153, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !786, file: !81, line: 27, baseType: !413, size: 64, align: 64, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !126, line: 60, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !231, !170, !82}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !815, line: 9, baseType: !816)
!815 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !819, !819, !819, !819, !819, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "SEND_DCC_REC", file: !823, line: 20, baseType: !824)
!823 = !DIFile(filename: "dcc-send.h", directory: "/home/lichi/Desktop/irssi/task1")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 12, size: 1920, align: 64, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !824, file: !81, line: 1, baseType: !82, size: 32, align: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !824, file: !81, line: 2, baseType: !82, size: 32, align: 32, offset: 32)
