; ModuleID = './line302-fe-irc-messages.o.i'
source_filename = "./line302-fe-irc-messages.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }
%struct._SERVER_CONNECT_REC = type { i32, i32, i32, i8*, i32, i8*, i8*, i8*, i16, i8*, i8*, i32, i8*, %struct._IPADDR*, %struct._IPADDR*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._GIOChannel*, i8, i8*, i8* }
%struct._IPADDR = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!370 = !DIEnumerator(name: "IRCTXT_USERMODE_CHANGE", value: 59)
!371 = !DIEnumerator(name: "IRCTXT_USER_MODE", value: 60)
!372 = !DIEnumerator(name: "IRCTXT_AWAY", value: 61)
!373 = !DIEnumerator(name: "IRCTXT_UNAWAY", value: 62)
!374 = !DIEnumerator(name: "IRCTXT_NICK_AWAY", value: 63)
!375 = !DIEnumerator(name: "IRCTXT_NO_SUCH_NICK", value: 64)
!376 = !DIEnumerator(name: "IRCTXT_NICK_IN_USE", value: 65)
!377 = !DIEnumerator(name: "IRCTXT_NICK_UNAVAILABLE", value: 66)
!378 = !DIEnumerator(name: "IRCTXT_YOUR_NICK_OWNED", value: 67)
!379 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!380 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!381 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!382 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!383 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!384 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!385 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!386 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!387 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!388 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!389 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!390 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!391 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!392 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!393 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!394 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!395 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!396 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!397 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!398 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!399 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!400 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!401 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!402 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!403 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!404 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!405 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!406 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!407 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!408 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!409 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!410 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!411 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!412 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!413 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!414 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!415 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!416 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!417 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!418 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!419 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!420 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!421 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!422 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!423 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!424 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!425 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!426 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!427 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!428 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!429 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!430 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!431 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!432 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!433 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!434 = !{!435, !442, !443, !756, !1053, !863}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !436, line: 9, baseType: !437)
!436 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440, !440, !440, !440, !440, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !445, line: 6, baseType: !446)
!445 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !447, line: 42, size: 39168, align: 64, elements: !448)
!447 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!448 = !{!449, !452, !453, !454, !701, !706, !707, !708, !709, !710, !711, !712, !713, !714, !718, !719, !723, !724, !725, !729, !734, !735, !736, !737, !738, !739, !740, !741, !748, !749, !750, !751, !752, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1096, !1098}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !450, line: 3, baseType: !451, size: 32, align: 32)
!450 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!451 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !446, file: !450, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !446, file: !450, line: 6, baseType: !451, size: 32, align: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !446, file: !450, line: 8, baseType: !455, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !445, line: 5, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !447, line: 24, size: 2496, align: 64, elements: !458)
!458 = !{!459, !461, !462, !463, !466, !467, !468, !469, !470, !472, !473, !474, !475, !476, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !460, line: 3, baseType: !451, size: 32, align: 32)
!460 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !457, file: !460, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !457, file: !460, line: 6, baseType: !451, size: 32, align: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !457, file: !460, line: 9, baseType: !464, size: 64, align: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !457, file: !460, line: 10, baseType: !451, size: 32, align: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !457, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !457, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !457, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !457, file: !460, line: 13, baseType: !471, size: 16, align: 16, offset: 448)
!471 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !457, file: !460, line: 14, baseType: !464, size: 64, align: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !457, file: !460, line: 15, baseType: !464, size: 64, align: 64, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !457, file: !460, line: 16, baseType: !451, size: 32, align: 32, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !457, file: !460, line: 17, baseType: !464, size: 64, align: 64, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !457, file: !460, line: 19, baseType: !477, size: 64, align: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !479, line: 99, baseType: !480)
!479 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !479, line: 99, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !457, file: !460, line: 19, baseType: !477, size: 64, align: 64, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !457, file: !460, line: 21, baseType: !464, size: 64, align: 64, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !457, file: !460, line: 22, baseType: !464, size: 64, align: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !457, file: !460, line: 23, baseType: !464, size: 64, align: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !457, file: !460, line: 24, baseType: !464, size: 64, align: 64, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !457, file: !460, line: 26, baseType: !464, size: 64, align: 64, offset: 1152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !457, file: !460, line: 27, baseType: !464, size: 64, align: 64, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !457, file: !460, line: 28, baseType: !464, size: 64, align: 64, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !457, file: !460, line: 29, baseType: !464, size: 64, align: 64, offset: 1344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !457, file: !460, line: 30, baseType: !464, size: 64, align: 64, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !457, file: !460, line: 31, baseType: !464, size: 64, align: 64, offset: 1472)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !457, file: !460, line: 32, baseType: !464, size: 64, align: 64, offset: 1536)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !457, file: !460, line: 33, baseType: !464, size: 64, align: 64, offset: 1600)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !457, file: !460, line: 35, baseType: !495, size: 64, align: 64, offset: 1664)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !498)
!498 = !{!499, !502, !646, !647, !652, !653, !654, !655, !656, !665, !666, !667, !671, !672, !673, !674, !675, !676, !677, !678}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !497, file: !4, line: 100, baseType: !500, size: 32, align: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !501, line: 49, baseType: !451)
!501 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !497, file: !4, line: 101, baseType: !503, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !506)
!506 = !{!507, !531, !537, !544, !548, !633, !637, !642}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !505, file: !4, line: 133, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !495, !512, !514, !517, !518}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !501, line: 46, baseType: !465)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !515, line: 66, baseType: !516)
!515 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!516 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !521, line: 42, baseType: !522)
!521 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !521, line: 44, size: 128, align: 64, elements: !523)
!523 = !{!524, !529, !530}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !522, file: !521, line: 46, baseType: !525, size: 32, align: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !526, line: 36, baseType: !527)
!526 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !515, line: 45, baseType: !528)
!528 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !522, file: !521, line: 47, baseType: !500, size: 32, align: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !522, file: !521, line: 48, baseType: !512, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !505, file: !4, line: 138, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!511, !495, !535, !514, !517, !518}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !505, file: !4, line: 143, baseType: !538, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!511, !495, !541, !543, !518}
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !515, line: 51, baseType: !542)
!542 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !505, file: !4, line: 147, baseType: !545, size: 64, align: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!511, !495, !518}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !505, file: !4, line: 149, baseType: !549, size: 64, align: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!552, !495, !632}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !555)
!555 = !{!556, !558, !579, !608, !610, !614, !615, !616, !617, !625, !626, !627, !628}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !554, file: !16, line: 174, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !501, line: 77, baseType: !442)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !554, file: !16, line: 175, baseType: !559, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !562)
!562 = !{!563, !567, !568}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !561, file: !16, line: 198, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !557}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !561, file: !16, line: 199, baseType: !564, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !561, file: !16, line: 200, baseType: !569, size: 64, align: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !557, !552, !572, !578}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!577, !557}
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !501, line: 50, baseType: !500)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !554, file: !16, line: 177, baseType: !580, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !584)
!584 = !{!585, !590, !594, !598, !602, !603}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !583, file: !16, line: 216, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!577, !552, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !583, file: !16, line: 218, baseType: !591, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!577, !552}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !583, file: !16, line: 219, baseType: !595, size: 64, align: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!577, !552, !573, !557}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !583, file: !16, line: 222, baseType: !599, size: 64, align: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !552}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !583, file: !16, line: 226, baseType: !573, size: 64, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !583, file: !16, line: 227, baseType: !604, size: 64, align: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !554, file: !16, line: 178, baseType: !609, size: 32, align: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !501, line: 55, baseType: !528)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !554, file: !16, line: 180, baseType: !611, size: 64, align: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !613)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !554, file: !16, line: 182, baseType: !500, size: 32, align: 32, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !554, file: !16, line: 183, baseType: !609, size: 32, align: 32, offset: 352)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !554, file: !16, line: 184, baseType: !609, size: 32, align: 32, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !554, file: !16, line: 186, baseType: !618, size: 64, align: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !620, line: 37, baseType: !621)
!620 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !620, line: 39, size: 128, align: 64, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !620, line: 41, baseType: !557, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !620, line: 42, baseType: !618, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !16, line: 188, baseType: !552, size: 64, align: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !16, line: 189, baseType: !552, size: 64, align: 64, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !16, line: 191, baseType: !464, size: 64, align: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !554, file: !16, line: 193, baseType: !629, size: 64, align: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !631)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !505, file: !4, line: 151, baseType: !634, size: 64, align: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !495}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !505, file: !4, line: 152, baseType: !638, size: 64, align: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!511, !495, !641, !518}
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !505, file: !4, line: 155, baseType: !643, size: 64, align: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!641, !495}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !497, file: !4, line: 103, baseType: !512, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !497, file: !4, line: 104, baseType: !648, size: 64, align: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !649, line: 77, baseType: !650)
!649 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !649, line: 77, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !497, file: !4, line: 105, baseType: !648, size: 64, align: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !497, file: !4, line: 106, baseType: !512, size: 64, align: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !497, file: !4, line: 107, baseType: !609, size: 32, align: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !497, file: !4, line: 109, baseType: !514, size: 64, align: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !497, file: !4, line: 110, baseType: !657, size: 64, align: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !659, line: 39, baseType: !660)
!659 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !659, line: 41, size: 192, align: 64, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !660, file: !659, line: 43, baseType: !512, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !660, file: !659, line: 44, baseType: !514, size: 64, align: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !660, file: !659, line: 45, baseType: !514, size: 64, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !497, file: !4, line: 111, baseType: !657, size: 64, align: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !497, file: !4, line: 112, baseType: !657, size: 64, align: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !497, file: !4, line: 113, baseType: !668, size: 48, align: 8, offset: 704)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 48, align: 8, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 6)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !497, file: !4, line: 117, baseType: !609, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !497, file: !4, line: 118, baseType: !609, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !497, file: !4, line: 119, baseType: !609, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !497, file: !4, line: 120, baseType: !609, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !497, file: !4, line: 121, baseType: !609, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !497, file: !4, line: 122, baseType: !609, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !497, file: !4, line: 124, baseType: !557, size: 64, align: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !497, file: !4, line: 125, baseType: !557, size: 64, align: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !457, file: !460, line: 38, baseType: !528, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !457, file: !460, line: 39, baseType: !528, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !457, file: !460, line: 40, baseType: !528, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !457, file: !460, line: 41, baseType: !528, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !457, file: !460, line: 42, baseType: !528, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !457, file: !460, line: 43, baseType: !528, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !457, file: !460, line: 44, baseType: !528, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !457, file: !460, line: 45, baseType: !528, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !457, file: !460, line: 46, baseType: !464, size: 64, align: 64, offset: 1792)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !457, file: !460, line: 47, baseType: !464, size: 64, align: 64, offset: 1856)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !457, file: !447, line: 27, baseType: !464, size: 64, align: 64, offset: 1920)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !457, file: !447, line: 28, baseType: !464, size: 64, align: 64, offset: 1984)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !457, file: !447, line: 30, baseType: !451, size: 32, align: 32, offset: 2048)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !457, file: !447, line: 31, baseType: !464, size: 64, align: 64, offset: 2112)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !457, file: !447, line: 32, baseType: !464, size: 64, align: 64, offset: 2176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !457, file: !447, line: 34, baseType: !451, size: 32, align: 32, offset: 2240)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !457, file: !447, line: 35, baseType: !451, size: 32, align: 32, offset: 2272)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !457, file: !447, line: 36, baseType: !451, size: 32, align: 32, offset: 2304)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !457, file: !447, line: 38, baseType: !451, size: 32, align: 32, offset: 2336)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !457, file: !447, line: 38, baseType: !451, size: 32, align: 32, offset: 2368)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !457, file: !447, line: 38, baseType: !451, size: 32, align: 32, offset: 2400)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !457, file: !447, line: 38, baseType: !451, size: 32, align: 32, offset: 2432)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !446, file: !450, line: 9, baseType: !702, size: 64, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !703, line: 75, baseType: !704)
!703 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !705, line: 139, baseType: !542)
!705 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!706 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !446, file: !450, line: 10, baseType: !702, size: 64, align: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !446, file: !450, line: 12, baseType: !464, size: 64, align: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !446, file: !450, line: 13, baseType: !464, size: 64, align: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !446, file: !450, line: 15, baseType: !528, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !446, file: !450, line: 16, baseType: !528, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !446, file: !450, line: 17, baseType: !528, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !446, file: !450, line: 18, baseType: !528, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !446, file: !450, line: 19, baseType: !528, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !446, file: !450, line: 21, baseType: !715, size: 64, align: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !479, line: 102, baseType: !717)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !479, line: 102, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !446, file: !450, line: 22, baseType: !451, size: 32, align: 32, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !446, file: !450, line: 25, baseType: !720, size: 128, align: 64, offset: 640)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, align: 64, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 2)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !446, file: !450, line: 26, baseType: !451, size: 32, align: 32, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !446, file: !450, line: 27, baseType: !451, size: 32, align: 32, offset: 800)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !446, file: !450, line: 29, baseType: !726, size: 64, align: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !479, line: 103, baseType: !728)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !479, line: 103, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !446, file: !450, line: 30, baseType: !730, size: 64, align: 64, offset: 896)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !732, line: 37, baseType: !733)
!732 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !732, line: 37, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !446, file: !450, line: 32, baseType: !464, size: 64, align: 64, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !446, file: !450, line: 33, baseType: !464, size: 64, align: 64, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !446, file: !450, line: 34, baseType: !464, size: 64, align: 64, offset: 1088)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !446, file: !450, line: 35, baseType: !528, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !446, file: !450, line: 36, baseType: !528, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !446, file: !450, line: 37, baseType: !528, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !446, file: !450, line: 38, baseType: !528, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !446, file: !450, line: 40, baseType: !742, size: 128, align: 64, offset: 1216)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !501, line: 504, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !501, line: 506, size: 128, align: 64, elements: !744)
!744 = !{!745, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !743, file: !501, line: 508, baseType: !746, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !501, line: 48, baseType: !542)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !743, file: !501, line: 509, baseType: !746, size: 64, align: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !446, file: !450, line: 41, baseType: !702, size: 64, align: 64, offset: 1344)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !446, file: !450, line: 42, baseType: !451, size: 32, align: 32, offset: 1408)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !446, file: !450, line: 44, baseType: !618, size: 64, align: 64, offset: 1472)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !446, file: !450, line: 45, baseType: !618, size: 64, align: 64, offset: 1536)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !446, file: !450, line: 53, baseType: !753, size: 64, align: 64, offset: 1600)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !756, !844, !451}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !479, line: 107, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !759, line: 30, size: 2240, align: 64, elements: !760)
!759 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!760 = !{!761, !762, !763, !764, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !840, !846, !850, !854, !859, !952, !979, !983}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !450, line: 3, baseType: !451, size: 32, align: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !758, file: !450, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !758, file: !450, line: 6, baseType: !451, size: 32, align: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !758, file: !450, line: 8, baseType: !765, size: 64, align: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !479, line: 113, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !759, line: 25, size: 1920, align: 64, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !460, line: 3, baseType: !451, size: 32, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !767, file: !460, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !767, file: !460, line: 6, baseType: !451, size: 32, align: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !767, file: !460, line: 9, baseType: !464, size: 64, align: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !767, file: !460, line: 10, baseType: !451, size: 32, align: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !767, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !767, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !767, file: !460, line: 11, baseType: !464, size: 64, align: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !767, file: !460, line: 13, baseType: !471, size: 16, align: 16, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !767, file: !460, line: 14, baseType: !464, size: 64, align: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !767, file: !460, line: 15, baseType: !464, size: 64, align: 64, offset: 576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !767, file: !460, line: 16, baseType: !451, size: 32, align: 32, offset: 640)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !767, file: !460, line: 17, baseType: !464, size: 64, align: 64, offset: 704)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !767, file: !460, line: 19, baseType: !477, size: 64, align: 64, offset: 768)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !767, file: !460, line: 19, baseType: !477, size: 64, align: 64, offset: 832)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !767, file: !460, line: 21, baseType: !464, size: 64, align: 64, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !767, file: !460, line: 22, baseType: !464, size: 64, align: 64, offset: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !767, file: !460, line: 23, baseType: !464, size: 64, align: 64, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !767, file: !460, line: 24, baseType: !464, size: 64, align: 64, offset: 1088)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !767, file: !460, line: 26, baseType: !464, size: 64, align: 64, offset: 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !767, file: !460, line: 27, baseType: !464, size: 64, align: 64, offset: 1216)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !767, file: !460, line: 28, baseType: !464, size: 64, align: 64, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !767, file: !460, line: 29, baseType: !464, size: 64, align: 64, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !767, file: !460, line: 30, baseType: !464, size: 64, align: 64, offset: 1408)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !767, file: !460, line: 31, baseType: !464, size: 64, align: 64, offset: 1472)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !767, file: !460, line: 32, baseType: !464, size: 64, align: 64, offset: 1536)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !767, file: !460, line: 33, baseType: !464, size: 64, align: 64, offset: 1600)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !767, file: !460, line: 35, baseType: !495, size: 64, align: 64, offset: 1664)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !767, file: !460, line: 38, baseType: !528, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !767, file: !460, line: 39, baseType: !528, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !767, file: !460, line: 40, baseType: !528, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !767, file: !460, line: 41, baseType: !528, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !767, file: !460, line: 42, baseType: !528, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !767, file: !460, line: 43, baseType: !528, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !767, file: !460, line: 44, baseType: !528, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !767, file: !460, line: 45, baseType: !528, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !767, file: !460, line: 46, baseType: !464, size: 64, align: 64, offset: 1792)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !767, file: !460, line: 47, baseType: !464, size: 64, align: 64, offset: 1856)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !758, file: !450, line: 9, baseType: !702, size: 64, align: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !758, file: !450, line: 10, baseType: !702, size: 64, align: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !758, file: !450, line: 12, baseType: !464, size: 64, align: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !758, file: !450, line: 13, baseType: !464, size: 64, align: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !758, file: !450, line: 15, baseType: !528, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !758, file: !450, line: 16, baseType: !528, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !758, file: !450, line: 17, baseType: !528, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !758, file: !450, line: 18, baseType: !528, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !758, file: !450, line: 19, baseType: !528, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !758, file: !450, line: 21, baseType: !715, size: 64, align: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !758, file: !450, line: 22, baseType: !451, size: 32, align: 32, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !758, file: !450, line: 25, baseType: !720, size: 128, align: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !758, file: !450, line: 26, baseType: !451, size: 32, align: 32, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !758, file: !450, line: 27, baseType: !451, size: 32, align: 32, offset: 800)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !758, file: !450, line: 29, baseType: !726, size: 64, align: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !758, file: !450, line: 30, baseType: !730, size: 64, align: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !758, file: !450, line: 32, baseType: !464, size: 64, align: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !758, file: !450, line: 33, baseType: !464, size: 64, align: 64, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !758, file: !450, line: 34, baseType: !464, size: 64, align: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !758, file: !450, line: 35, baseType: !528, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !758, file: !450, line: 36, baseType: !528, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !758, file: !450, line: 37, baseType: !528, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !758, file: !450, line: 38, baseType: !528, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !758, file: !450, line: 40, baseType: !742, size: 128, align: 64, offset: 1216)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !758, file: !450, line: 41, baseType: !702, size: 64, align: 64, offset: 1344)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !758, file: !450, line: 42, baseType: !451, size: 32, align: 32, offset: 1408)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !758, file: !450, line: 44, baseType: !618, size: 64, align: 64, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !758, file: !450, line: 45, baseType: !618, size: 64, align: 64, offset: 1536)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !758, file: !450, line: 53, baseType: !753, size: 64, align: 64, offset: 1600)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !758, file: !450, line: 55, baseType: !837, size: 64, align: 64, offset: 1664)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!451, !756, !465}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !758, file: !450, line: 57, baseType: !841, size: 64, align: 64, offset: 1728)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!451, !756, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64, align: 64)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !758, file: !450, line: 60, baseType: !847, size: 64, align: 64, offset: 1792)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!844, !756}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !758, file: !450, line: 62, baseType: !851, size: 64, align: 64, offset: 1856)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !756, !844, !844, !451}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !758, file: !450, line: 65, baseType: !855, size: 64, align: 64, offset: 1920)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64, align: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !756, !844, !844}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !758, file: !450, line: 69, baseType: !860, size: 64, align: 64, offset: 1984)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!863, !756, !844}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !479, line: 109, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !866, line: 15, size: 1408, align: 64, elements: !867)
!866 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!867 = !{!868, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !903, !904, !906, !907, !908, !909, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !865, file: !869, line: 3, baseType: !451, size: 32, align: 32)
!869 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!870 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !865, file: !869, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !865, file: !869, line: 5, baseType: !730, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !865, file: !869, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !865, file: !869, line: 8, baseType: !756, size: 64, align: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !865, file: !869, line: 9, baseType: !464, size: 64, align: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !869, line: 10, baseType: !464, size: 64, align: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !865, file: !869, line: 11, baseType: !702, size: 64, align: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !865, file: !869, line: 12, baseType: !451, size: 32, align: 32, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !865, file: !869, line: 13, baseType: !464, size: 64, align: 64, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !865, file: !869, line: 15, baseType: !880, size: 64, align: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !479, line: 108, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !886, line: 5, size: 704, align: 64, elements: !887)
!886 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !869, line: 3, baseType: !451, size: 32, align: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !885, file: !869, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !885, file: !869, line: 5, baseType: !730, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !885, file: !869, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !885, file: !869, line: 8, baseType: !756, size: 64, align: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !885, file: !869, line: 9, baseType: !464, size: 64, align: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !885, file: !869, line: 10, baseType: !464, size: 64, align: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !885, file: !869, line: 11, baseType: !702, size: 64, align: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !885, file: !869, line: 12, baseType: !451, size: 32, align: 32, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !885, file: !869, line: 13, baseType: !464, size: 64, align: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !885, file: !869, line: 15, baseType: !880, size: 64, align: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !885, file: !869, line: 17, baseType: !900, size: 64, align: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!844, !883}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !865, file: !869, line: 17, baseType: !900, size: 64, align: 64, offset: 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !865, file: !905, line: 5, baseType: !464, size: 64, align: 64, offset: 704)
!905 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!906 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !865, file: !905, line: 6, baseType: !464, size: 64, align: 64, offset: 768)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !865, file: !905, line: 7, baseType: !702, size: 64, align: 64, offset: 832)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !865, file: !905, line: 9, baseType: !730, size: 64, align: 64, offset: 896)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !865, file: !905, line: 10, baseType: !910, size: 64, align: 64, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !479, line: 111, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !913, line: 13, size: 576, align: 64, elements: !914)
!913 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!914 = !{!915, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !933, !934}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !912, file: !916, line: 3, baseType: !451, size: 32, align: 32)
!916 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!917 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !912, file: !916, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !912, file: !916, line: 6, baseType: !702, size: 64, align: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !912, file: !916, line: 8, baseType: !464, size: 64, align: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !912, file: !916, line: 9, baseType: !464, size: 64, align: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !912, file: !916, line: 10, baseType: !464, size: 64, align: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !912, file: !916, line: 11, baseType: !451, size: 32, align: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !912, file: !916, line: 14, baseType: !528, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !912, file: !916, line: 15, baseType: !528, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !912, file: !916, line: 18, baseType: !528, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !912, file: !916, line: 19, baseType: !528, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !912, file: !916, line: 20, baseType: !528, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !912, file: !916, line: 21, baseType: !528, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !912, file: !916, line: 22, baseType: !930, size: 64, align: 8, offset: 360)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 64, align: 8, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !912, file: !916, line: 26, baseType: !442, size: 64, align: 64, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !916, line: 28, baseType: !910, size: 64, align: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !865, file: !905, line: 12, baseType: !528, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !865, file: !905, line: 13, baseType: !464, size: 64, align: 64, offset: 1088)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !865, file: !905, line: 14, baseType: !451, size: 32, align: 32, offset: 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !865, file: !905, line: 15, baseType: !464, size: 64, align: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !865, file: !905, line: 17, baseType: !528, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !865, file: !905, line: 18, baseType: !528, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !865, file: !905, line: 19, baseType: !528, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !865, file: !905, line: 20, baseType: !528, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !865, file: !905, line: 22, baseType: !528, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !865, file: !905, line: 23, baseType: !528, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !865, file: !905, line: 24, baseType: !528, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !865, file: !905, line: 25, baseType: !528, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !865, file: !905, line: 26, baseType: !528, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !865, file: !905, line: 31, baseType: !949, size: 64, align: 64, offset: 1344)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!464, !863}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !758, file: !450, line: 70, baseType: !953, size: 64, align: 64, offset: 2048)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !756, !844}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !479, line: 110, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !959, line: 15, size: 960, align: 64, elements: !960)
!959 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!960 = !{!961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !975, !976, !977, !978}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !958, file: !869, line: 3, baseType: !451, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !958, file: !869, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !958, file: !869, line: 5, baseType: !730, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !958, file: !869, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !958, file: !869, line: 8, baseType: !756, size: 64, align: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !958, file: !869, line: 9, baseType: !464, size: 64, align: 64, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !958, file: !869, line: 10, baseType: !464, size: 64, align: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !958, file: !869, line: 11, baseType: !702, size: 64, align: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !958, file: !869, line: 12, baseType: !451, size: 32, align: 32, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !958, file: !869, line: 13, baseType: !464, size: 64, align: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !958, file: !869, line: 15, baseType: !880, size: 64, align: 64, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !958, file: !869, line: 17, baseType: !900, size: 64, align: 64, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !958, file: !974, line: 5, baseType: !464, size: 64, align: 64, offset: 704)
!974 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!975 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !958, file: !974, line: 6, baseType: !464, size: 64, align: 64, offset: 768)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !958, file: !974, line: 7, baseType: !702, size: 64, align: 64, offset: 832)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !958, file: !974, line: 9, baseType: !528, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !958, file: !974, line: 11, baseType: !528, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !758, file: !450, line: 71, baseType: !980, size: 64, align: 64, offset: 2112)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!451, !844, !844}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !758, file: !450, line: 73, baseType: !980, size: 64, align: 64, offset: 2176)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !446, file: !450, line: 55, baseType: !837, size: 64, align: 64, offset: 1664)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !446, file: !450, line: 57, baseType: !841, size: 64, align: 64, offset: 1728)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !446, file: !450, line: 60, baseType: !847, size: 64, align: 64, offset: 1792)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !446, file: !450, line: 62, baseType: !851, size: 64, align: 64, offset: 1856)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !446, file: !450, line: 65, baseType: !855, size: 64, align: 64, offset: 1920)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !446, file: !450, line: 69, baseType: !860, size: 64, align: 64, offset: 1984)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !446, file: !450, line: 70, baseType: !953, size: 64, align: 64, offset: 2048)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !446, file: !450, line: 71, baseType: !980, size: 64, align: 64, offset: 2112)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !446, file: !450, line: 73, baseType: !980, size: 64, align: 64, offset: 2176)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !446, file: !447, line: 46, baseType: !618, size: 64, align: 64, offset: 2240)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !446, file: !447, line: 47, baseType: !618, size: 64, align: 64, offset: 2304)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !446, file: !447, line: 48, baseType: !996, size: 64, align: 64, offset: 2368)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !445, line: 8, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !445, line: 8, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !446, file: !447, line: 49, baseType: !618, size: 64, align: 64, offset: 2432)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !446, file: !447, line: 51, baseType: !464, size: 64, align: 64, offset: 2496)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !446, file: !447, line: 53, baseType: !464, size: 64, align: 64, offset: 2560)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !446, file: !447, line: 54, baseType: !464, size: 64, align: 64, offset: 2624)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !446, file: !447, line: 55, baseType: !464, size: 64, align: 64, offset: 2688)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !446, file: !447, line: 56, baseType: !464, size: 64, align: 64, offset: 2752)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !446, file: !447, line: 57, baseType: !451, size: 32, align: 32, offset: 2816)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !446, file: !447, line: 59, baseType: !528, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !446, file: !447, line: 60, baseType: !528, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !446, file: !447, line: 62, baseType: !528, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !446, file: !447, line: 63, baseType: !528, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !446, file: !447, line: 64, baseType: !528, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !446, file: !447, line: 65, baseType: !528, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !446, file: !447, line: 66, baseType: !528, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !446, file: !447, line: 67, baseType: !528, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !446, file: !447, line: 68, baseType: !528, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !446, file: !447, line: 69, baseType: !528, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !446, file: !447, line: 70, baseType: !528, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !446, file: !447, line: 71, baseType: !528, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !446, file: !447, line: 72, baseType: !528, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !446, file: !447, line: 74, baseType: !451, size: 32, align: 32, offset: 2880)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !446, file: !447, line: 75, baseType: !451, size: 32, align: 32, offset: 2912)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !446, file: !447, line: 76, baseType: !451, size: 32, align: 32, offset: 2944)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !446, file: !447, line: 77, baseType: !451, size: 32, align: 32, offset: 2976)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !446, file: !447, line: 79, baseType: !730, size: 64, align: 64, offset: 3008)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !446, file: !447, line: 80, baseType: !618, size: 64, align: 64, offset: 3072)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !446, file: !447, line: 81, baseType: !618, size: 64, align: 64, offset: 3136)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !446, file: !447, line: 83, baseType: !657, size: 64, align: 64, offset: 3200)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !446, file: !447, line: 84, baseType: !609, size: 32, align: 32, offset: 3264)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !446, file: !447, line: 87, baseType: !451, size: 32, align: 32, offset: 3296)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !446, file: !447, line: 91, baseType: !618, size: 64, align: 64, offset: 3328)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !446, file: !447, line: 92, baseType: !742, size: 128, align: 64, offset: 3392)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !446, file: !447, line: 93, baseType: !742, size: 128, align: 64, offset: 3520)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !446, file: !447, line: 95, baseType: !451, size: 32, align: 32, offset: 3648)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !446, file: !447, line: 96, baseType: !451, size: 32, align: 32, offset: 3680)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !446, file: !447, line: 97, baseType: !451, size: 32, align: 32, offset: 3712)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !446, file: !447, line: 100, baseType: !618, size: 64, align: 64, offset: 3776)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !446, file: !447, line: 103, baseType: !618, size: 64, align: 64, offset: 3840)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !446, file: !447, line: 106, baseType: !618, size: 64, align: 64, offset: 3904)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !446, file: !447, line: 108, baseType: !730, size: 64, align: 64, offset: 3968)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !446, file: !447, line: 109, baseType: !618, size: 64, align: 64, offset: 4032)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !446, file: !447, line: 111, baseType: !618, size: 64, align: 64, offset: 4096)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !446, file: !447, line: 114, baseType: !442, size: 64, align: 64, offset: 4160)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !446, file: !447, line: 116, baseType: !730, size: 64, align: 64, offset: 4224)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !446, file: !447, line: 117, baseType: !1044, size: 32768, align: 64, offset: 4288)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 32768, align: 64, elements: !1094)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !1046, line: 10, size: 128, align: 64, elements: !1047)
!1046 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!1047 = !{!1048, !1093}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1045, file: !1046, line: 11, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !1046, line: 7, baseType: !1051)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !1053, !844, !465, !465, !464, !657}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !445, line: 7, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !1056, line: 15, size: 1600, align: 64, elements: !1057)
!1056 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1055, file: !869, line: 3, baseType: !451, size: 32, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !1055, file: !869, line: 4, baseType: !451, size: 32, align: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !1055, file: !869, line: 5, baseType: !730, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1055, file: !869, line: 7, baseType: !442, size: 64, align: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !1055, file: !869, line: 8, baseType: !443, size: 64, align: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !1055, file: !869, line: 9, baseType: !464, size: 64, align: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1055, file: !869, line: 10, baseType: !464, size: 64, align: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !1055, file: !869, line: 11, baseType: !702, size: 64, align: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !1055, file: !869, line: 12, baseType: !451, size: 32, align: 32, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !1055, file: !869, line: 13, baseType: !464, size: 64, align: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1055, file: !869, line: 15, baseType: !880, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !1055, file: !869, line: 17, baseType: !900, size: 64, align: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !1055, file: !905, line: 5, baseType: !464, size: 64, align: 64, offset: 704)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !1055, file: !905, line: 6, baseType: !464, size: 64, align: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !1055, file: !905, line: 7, baseType: !702, size: 64, align: 64, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !1055, file: !905, line: 9, baseType: !730, size: 64, align: 64, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !1055, file: !905, line: 10, baseType: !910, size: 64, align: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !1055, file: !905, line: 12, baseType: !528, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1055, file: !905, line: 13, baseType: !464, size: 64, align: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1055, file: !905, line: 14, baseType: !451, size: 32, align: 32, offset: 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1055, file: !905, line: 15, baseType: !464, size: 64, align: 64, offset: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !1055, file: !905, line: 17, baseType: !528, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !1055, file: !905, line: 18, baseType: !528, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !1055, file: !905, line: 19, baseType: !528, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !1055, file: !905, line: 20, baseType: !528, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !1055, file: !905, line: 22, baseType: !528, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1055, file: !905, line: 23, baseType: !528, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !1055, file: !905, line: 24, baseType: !528, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !1055, file: !905, line: 25, baseType: !528, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !1055, file: !905, line: 26, baseType: !528, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !1055, file: !905, line: 31, baseType: !949, size: 64, align: 64, offset: 1344)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !1055, file: !1056, line: 18, baseType: !618, size: 64, align: 64, offset: 1408)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !1055, file: !1056, line: 20, baseType: !702, size: 64, align: 64, offset: 1472)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !1055, file: !1056, line: 21, baseType: !451, size: 32, align: 32, offset: 1536)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !1055, file: !1056, line: 22, baseType: !451, size: 32, align: 32, offset: 1568)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !1045, file: !1046, line: 12, baseType: !465, size: 8, align: 8, offset: 64)
!1094 = !{!1095}
!1095 = !DISubrange(count: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !446, file: !447, line: 118, baseType: !1097, size: 2048, align: 8, offset: 37056)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 2048, align: 8, elements: !1094)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !446, file: !447, line: 120, baseType: !980, size: 64, align: 64, offset: 39104)
!1099 = !{i32 2, !"Dwarf Version", i32 4}
!1100 = !{i32 2, !"Debug Info Version", i32 3}
!1101 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!1102 = distinct !DISubprogram(name: "fe_irc_messages_init", scope: !1103, file: !1103, line: 286, type: !606, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1104)
!1103 = !DIFile(filename: "fe-irc-messages.c", directory: "/home/lichi/Desktop/irssi/task1")
!1104 = !{}
!1105 = !DILocation(line: 288, column: 9, scope: !1102)
!1106 = !DILocation(line: 289, column: 9, scope: !1102)
!1107 = !DILocation(line: 290, column: 9, scope: !1102)
!1108 = !DILocation(line: 291, column: 9, scope: !1102)
!1109 = !DILocation(line: 292, column: 9, scope: !1102)
!1110 = !DILocation(line: 293, column: 9, scope: !1102)
!1111 = !DILocation(line: 294, column: 9, scope: !1102)
!1112 = !DILocation(line: 295, column: 9, scope: !1102)
!1113 = !DILocation(line: 296, column: 9, scope: !1102)
!1114 = !DILocation(line: 297, column: 1, scope: !1102)
!1115 = distinct !DISubprogram(name: "sig_message_own_public", scope: !1103, file: !1103, line: 42, type: !1116, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1104)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !756, !844, !844, !844}
!1118 = !DILocalVariable(name: "server", arg: 1, scope: !1115, file: !1103, line: 42, type: !756)
!1119 = !DIExpression()
!1120 = !DILocation(line: 42, column: 48, scope: !1115)
!1121 = !DILocalVariable(name: "msg", arg: 2, scope: !1115, file: !1103, line: 42, type: !844)
!1122 = !DILocation(line: 42, column: 68, scope: !1115)
!1123 = !DILocalVariable(name: "target", arg: 3, scope: !1115, file: !1103, line: 43, type: !844)
!1124 = !DILocation(line: 43, column: 20, scope: !1115)
!1125 = !DILocalVariable(name: "origtarget", arg: 4, scope: !1115, file: !1103, line: 43, type: !844)
!1126 = !DILocation(line: 43, column: 40, scope: !1115)
!1127 = !DILocalVariable(name: "oldtarget", scope: !1115, file: !1103, line: 45, type: !844)
!1128 = !DILocation(line: 45, column: 14, scope: !1115)
!1129 = !DILocalVariable(name: "nickmode", scope: !1115, file: !1103, line: 46, type: !464)
!1130 = !DILocation(line: 46, column: 8, scope: !1115)
!1131 = !DILocation(line: 48, column: 87, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1115, file: !1103, line: 48, column: 6)
!1133 = !DILocation(line: 48, column: 69, scope: !1132)
!1134 = !DILocation(line: 48, column: 54, scope: !1132)
!1135 = !DILocation(line: 48, column: 53, scope: !1132)
!1136 = !DILocation(line: 48, column: 28, scope: !1137)
!1137 = !DILexicalBlockFile(scope: !1132, file: !1103, discriminator: 3)
!1138 = !DILocation(line: 48, column: 9, scope: !1132)
!1139 = !DILocation(line: 48, column: 6, scope: !1115)
!1140 = !DILocation(line: 48, column: 8, scope: !1141)
!1141 = !DILexicalBlockFile(scope: !1132, file: !1103, discriminator: 1)
!1142 = !DILocation(line: 48, column: 6, scope: !1143)
!1143 = !DILexicalBlockFile(scope: !1115, file: !1103, discriminator: 2)
!1144 = !DILocation(line: 49, column: 3, scope: !1132)
!1145 = !DILocation(line: 50, column: 14, scope: !1115)
!1146 = !DILocation(line: 50, column: 12, scope: !1115)
!1147 = !DILocation(line: 51, column: 113, scope: !1115)
!1148 = !DILocation(line: 51, column: 95, scope: !1115)
!1149 = !DILocation(line: 51, column: 80, scope: !1115)
!1150 = !DILocation(line: 51, column: 79, scope: !1115)
!1151 = !DILocation(line: 51, column: 54, scope: !1152)
!1152 = !DILexicalBlockFile(scope: !1115, file: !1103, discriminator: 1)
!1153 = !DILocation(line: 51, column: 35, scope: !1115)
!1154 = !DILocation(line: 51, column: 44, scope: !1115)
!1155 = !DILocation(line: 51, column: 11, scope: !1143)
!1156 = !DILocation(line: 51, column: 9, scope: !1115)
