; ModuleID = './line23-commands.o.i'
source_filename = "./line23-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 51, size: 32, align: 32, elements: !58)
!57 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!60 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!61 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!62 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!63 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!64 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!65 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!66 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!67 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!68 = !{!69, !70, !74, !76, !94, !99, !87, !107, !118, !90, !504, !505, !510, !93, !402, !514, !522, !436}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!73 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMMAND_REC", file: !36, line: 23, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 18, size: 256, align: 64, elements: !79)
!79 = !{!80, !89, !91, !92}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !78, file: !36, line: 19, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !83, line: 37, baseType: !84)
!83 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !83, line: 39, size: 128, align: 64, elements: !85)
!85 = !{!86, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !83, line: 41, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !72, line: 77, baseType: !69)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !83, line: 42, baseType: !81, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !78, file: !36, line: 20, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !78, file: !36, line: 21, baseType: !90, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !78, file: !36, line: 22, baseType: !93, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMMAND_CALLBACK_REC", file: !36, line: 9, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 6, size: 128, align: 64, elements: !97)
!97 = !{!98, !106}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !96, file: !36, line: 7, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !100, line: 9, baseType: !101)
!100 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104, !104, !104, !104, !104, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !96, file: !36, line: 8, baseType: !69, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMD_TEMP_REC", file: !109, line: 661, baseType: !110)
!109 = !DIFile(filename: "commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 658, size: 128, align: 64, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !110, file: !109, line: 659, baseType: !90, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !110, file: !109, line: 660, baseType: !114, size: 64, align: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !116, line: 37, baseType: !117)
!116 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !116, line: 37, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !120, line: 108, baseType: !121)
!120 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !122, line: 5, size: 704, align: 64, elements: !123)
!122 = !DIFile(filename: "window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!123 = !{!124, !127, !128, !129, !130, !497, !498, !499, !500, !501, !502, !503}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !125, line: 3, baseType: !126, size: 32, align: 32)
!125 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!126 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !121, file: !125, line: 4, baseType: !126, size: 32, align: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !121, file: !125, line: 5, baseType: !114, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !121, file: !125, line: 7, baseType: !69, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !121, file: !125, line: 8, baseType: !131, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !120, line: 107, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !134, line: 30, size: 2240, align: 64, elements: !135)
!134 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!135 = !{!136, !138, !139, !140, !361, !366, !367, !368, !369, !370, !371, !372, !373, !374, !378, !379, !383, !384, !385, !389, !390, !391, !392, !393, !394, !395, !396, !397, !404, !405, !406, !407, !408, !412, !416, !420, !424, !428, !432, !485, !492, !496}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !137, line: 3, baseType: !126, size: 32, align: 32)
!137 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!138 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !133, file: !137, line: 4, baseType: !126, size: 32, align: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !133, file: !137, line: 6, baseType: !126, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !133, file: !137, line: 8, baseType: !141, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !120, line: 113, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !134, line: 25, size: 1920, align: 64, elements: !144)
!144 = !{!145, !147, !148, !149, !150, !151, !152, !153, !154, !156, !157, !158, !159, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !146, line: 3, baseType: !126, size: 32, align: 32)
!146 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !143, file: !146, line: 4, baseType: !126, size: 32, align: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !143, file: !146, line: 6, baseType: !126, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !143, file: !146, line: 9, baseType: !90, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !143, file: !146, line: 10, baseType: !126, size: 32, align: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !143, file: !146, line: 11, baseType: !90, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !143, file: !146, line: 11, baseType: !90, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !143, file: !146, line: 11, baseType: !90, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !143, file: !146, line: 13, baseType: !155, size: 16, align: 16, offset: 448)
!155 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !143, file: !146, line: 14, baseType: !90, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !143, file: !146, line: 15, baseType: !90, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !143, file: !146, line: 16, baseType: !126, size: 32, align: 32, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !143, file: !146, line: 17, baseType: !90, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !143, file: !146, line: 19, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !120, line: 99, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !120, line: 99, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !143, file: !146, line: 19, baseType: !161, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !143, file: !146, line: 21, baseType: !90, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !143, file: !146, line: 22, baseType: !90, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !143, file: !146, line: 23, baseType: !90, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !143, file: !146, line: 24, baseType: !90, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !143, file: !146, line: 26, baseType: !90, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !143, file: !146, line: 27, baseType: !90, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !143, file: !146, line: 28, baseType: !90, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !143, file: !146, line: 29, baseType: !90, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !143, file: !146, line: 30, baseType: !90, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !143, file: !146, line: 31, baseType: !90, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !143, file: !146, line: 32, baseType: !90, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !143, file: !146, line: 33, baseType: !90, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !143, file: !146, line: 35, baseType: !178, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !181)
!181 = !{!182, !184, !318, !319, !324, !325, !326, !327, !328, !337, !338, !339, !343, !344, !345, !346, !347, !348, !349, !350}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !180, file: !4, line: 100, baseType: !183, size: 32, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !72, line: 49, baseType: !126)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !180, file: !4, line: 101, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !188)
!188 = !{!189, !211, !217, !224, !228, !305, !309, !314}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !187, file: !4, line: 133, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193, !178, !70, !194, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !195, line: 66, baseType: !196)
!195 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!196 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !201, line: 42, baseType: !202)
!201 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !201, line: 44, size: 128, align: 64, elements: !203)
!203 = !{!204, !209, !210}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !202, file: !201, line: 46, baseType: !205, size: 32, align: 32)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !206, line: 36, baseType: !207)
!206 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !195, line: 45, baseType: !208)
!208 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !202, file: !201, line: 47, baseType: !183, size: 32, align: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !202, file: !201, line: 48, baseType: !70, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !187, file: !4, line: 138, baseType: !212, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!193, !178, !215, !194, !197, !198}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !187, file: !4, line: 143, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!193, !178, !221, !223, !198}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !195, line: 51, baseType: !222)
!222 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !187, file: !4, line: 147, baseType: !225, size: 64, align: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!193, !178, !198}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !187, file: !4, line: 149, baseType: !229, size: 64, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !178, !304}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !235)
!235 = !{!236, !237, !258, !287, !289, !293, !294, !295, !296, !297, !298, !299, !300}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !234, file: !16, line: 174, baseType: !87, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !234, file: !16, line: 175, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !241)
!241 = !{!242, !246, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !240, file: !16, line: 198, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !87}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !240, file: !16, line: 199, baseType: !243, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !240, file: !16, line: 200, baseType: !248, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !87, !232, !251, !257}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !87}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !72, line: 50, baseType: !183)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !234, file: !16, line: 177, baseType: !259, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !263)
!263 = !{!264, !269, !273, !277, !281, !282}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !262, file: !16, line: 216, baseType: !265, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!256, !232, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !262, file: !16, line: 218, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!256, !232}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !262, file: !16, line: 219, baseType: !274, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!256, !232, !252, !87}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !262, file: !16, line: 222, baseType: !278, size: 64, align: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !232}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !262, file: !16, line: 226, baseType: !252, size: 64, align: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !262, file: !16, line: 227, baseType: !283, size: 64, align: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !234, file: !16, line: 178, baseType: !288, size: 32, align: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !72, line: 55, baseType: !208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !234, file: !16, line: 180, baseType: !290, size: 64, align: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !292)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !234, file: !16, line: 182, baseType: !183, size: 32, align: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !234, file: !16, line: 183, baseType: !288, size: 32, align: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !234, file: !16, line: 184, baseType: !288, size: 32, align: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !234, file: !16, line: 186, baseType: !81, size: 64, align: 64, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !234, file: !16, line: 188, baseType: !232, size: 64, align: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !16, line: 189, baseType: !232, size: 64, align: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !16, line: 191, baseType: !90, size: 64, align: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !234, file: !16, line: 193, baseType: !301, size: 64, align: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !303)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !187, file: !4, line: 151, baseType: !306, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !178}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !187, file: !4, line: 152, baseType: !310, size: 64, align: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!193, !178, !313, !198}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !187, file: !4, line: 155, baseType: !315, size: 64, align: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!313, !178}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !180, file: !4, line: 103, baseType: !70, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !180, file: !4, line: 104, baseType: !320, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !321, line: 77, baseType: !322)
!321 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !321, line: 77, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !180, file: !4, line: 105, baseType: !320, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !180, file: !4, line: 106, baseType: !70, size: 64, align: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !180, file: !4, line: 107, baseType: !288, size: 32, align: 32, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !180, file: !4, line: 109, baseType: !194, size: 64, align: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !180, file: !4, line: 110, baseType: !329, size: 64, align: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !331, line: 39, baseType: !332)
!331 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !331, line: 41, size: 192, align: 64, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !332, file: !331, line: 43, baseType: !70, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !332, file: !331, line: 44, baseType: !194, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !332, file: !331, line: 45, baseType: !194, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !180, file: !4, line: 111, baseType: !329, size: 64, align: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !180, file: !4, line: 112, baseType: !329, size: 64, align: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !180, file: !4, line: 113, baseType: !340, size: 48, align: 8, offset: 704)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 48, align: 8, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 6)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !180, file: !4, line: 117, baseType: !288, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !180, file: !4, line: 118, baseType: !288, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !180, file: !4, line: 119, baseType: !288, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !180, file: !4, line: 120, baseType: !288, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !180, file: !4, line: 121, baseType: !288, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !180, file: !4, line: 122, baseType: !288, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !180, file: !4, line: 124, baseType: !87, size: 64, align: 64, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !180, file: !4, line: 125, baseType: !87, size: 64, align: 64, offset: 832)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !143, file: !146, line: 38, baseType: !208, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !143, file: !146, line: 39, baseType: !208, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !143, file: !146, line: 40, baseType: !208, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !143, file: !146, line: 41, baseType: !208, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !143, file: !146, line: 42, baseType: !208, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !143, file: !146, line: 43, baseType: !208, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !143, file: !146, line: 44, baseType: !208, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !143, file: !146, line: 45, baseType: !208, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !143, file: !146, line: 46, baseType: !90, size: 64, align: 64, offset: 1792)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !143, file: !146, line: 47, baseType: !90, size: 64, align: 64, offset: 1856)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !133, file: !137, line: 9, baseType: !362, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !363, line: 75, baseType: !364)
!363 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !365, line: 139, baseType: !222)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !133, file: !137, line: 10, baseType: !362, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !133, file: !137, line: 12, baseType: !90, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !133, file: !137, line: 13, baseType: !90, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !133, file: !137, line: 15, baseType: !208, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !133, file: !137, line: 16, baseType: !208, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !133, file: !137, line: 17, baseType: !208, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !133, file: !137, line: 18, baseType: !208, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !133, file: !137, line: 19, baseType: !208, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !133, file: !137, line: 21, baseType: !375, size: 64, align: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !120, line: 102, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !120, line: 102, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !133, file: !137, line: 22, baseType: !126, size: 32, align: 32, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !133, file: !137, line: 25, baseType: !380, size: 128, align: 64, offset: 640)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 128, align: 64, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !133, file: !137, line: 26, baseType: !126, size: 32, align: 32, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !133, file: !137, line: 27, baseType: !126, size: 32, align: 32, offset: 800)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !133, file: !137, line: 29, baseType: !386, size: 64, align: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !120, line: 103, baseType: !388)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !120, line: 103, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !133, file: !137, line: 30, baseType: !114, size: 64, align: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !133, file: !137, line: 32, baseType: !90, size: 64, align: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !133, file: !137, line: 33, baseType: !90, size: 64, align: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !133, file: !137, line: 34, baseType: !90, size: 64, align: 64, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !133, file: !137, line: 35, baseType: !208, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !133, file: !137, line: 36, baseType: !208, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !133, file: !137, line: 37, baseType: !208, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !133, file: !137, line: 38, baseType: !208, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !133, file: !137, line: 40, baseType: !398, size: 128, align: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !72, line: 504, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !72, line: 506, size: 128, align: 64, elements: !400)
!400 = !{!401, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !399, file: !72, line: 508, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !72, line: 48, baseType: !222)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !399, file: !72, line: 509, baseType: !402, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !133, file: !137, line: 41, baseType: !362, size: 64, align: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !133, file: !137, line: 42, baseType: !126, size: 32, align: 32, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !133, file: !137, line: 44, baseType: !81, size: 64, align: 64, offset: 1472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !133, file: !137, line: 45, baseType: !81, size: 64, align: 64, offset: 1536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !133, file: !137, line: 53, baseType: !409, size: 64, align: 64, offset: 1600)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !131, !74, !126}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !133, file: !137, line: 55, baseType: !413, size: 64, align: 64, offset: 1664)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!126, !131, !73}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !133, file: !137, line: 57, baseType: !417, size: 64, align: 64, offset: 1728)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!126, !131, !74}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !133, file: !137, line: 60, baseType: !421, size: 64, align: 64, offset: 1792)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!74, !131}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !133, file: !137, line: 62, baseType: !425, size: 64, align: 64, offset: 1856)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !131, !74, !74, !126}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !133, file: !137, line: 65, baseType: !429, size: 64, align: 64, offset: 1920)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!93, !131, !74, !74}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !133, file: !137, line: 69, baseType: !433, size: 64, align: 64, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !131, !74}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !120, line: 109, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !439, line: 15, size: 1408, align: 64, elements: !440)
!439 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !459, !461, !462, !463, !464, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !438, file: !125, line: 3, baseType: !126, size: 32, align: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !438, file: !125, line: 4, baseType: !126, size: 32, align: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !438, file: !125, line: 5, baseType: !114, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !438, file: !125, line: 7, baseType: !69, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !438, file: !125, line: 8, baseType: !131, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !438, file: !125, line: 9, baseType: !90, size: 64, align: 64, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !438, file: !125, line: 10, baseType: !90, size: 64, align: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !438, file: !125, line: 11, baseType: !362, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !438, file: !125, line: 12, baseType: !126, size: 32, align: 32, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !438, file: !125, line: 13, baseType: !90, size: 64, align: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !438, file: !125, line: 15, baseType: !452, size: 64, align: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !118}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !438, file: !125, line: 17, baseType: !456, size: 64, align: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!74, !118}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !438, file: !460, line: 5, baseType: !90, size: 64, align: 64, offset: 704)
!460 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!461 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !438, file: !460, line: 6, baseType: !90, size: 64, align: 64, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !438, file: !460, line: 7, baseType: !362, size: 64, align: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !438, file: !460, line: 9, baseType: !114, size: 64, align: 64, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !438, file: !460, line: 10, baseType: !465, size: 64, align: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !120, line: 111, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !120, line: 111, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !438, file: !460, line: 12, baseType: !208, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !438, file: !460, line: 13, baseType: !90, size: 64, align: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !438, file: !460, line: 14, baseType: !126, size: 32, align: 32, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !438, file: !460, line: 15, baseType: !90, size: 64, align: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !438, file: !460, line: 17, baseType: !208, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !438, file: !460, line: 18, baseType: !208, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !438, file: !460, line: 19, baseType: !208, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !438, file: !460, line: 20, baseType: !208, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !438, file: !460, line: 22, baseType: !208, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !438, file: !460, line: 23, baseType: !208, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !438, file: !460, line: 24, baseType: !208, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !438, file: !460, line: 25, baseType: !208, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !438, file: !460, line: 26, baseType: !208, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !438, file: !460, line: 31, baseType: !482, size: 64, align: 64, offset: 1344)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!90, !436}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !133, file: !137, line: 70, baseType: !486, size: 64, align: 64, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !131, !74}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !120, line: 110, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !120, line: 110, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !133, file: !137, line: 71, baseType: !493, size: 64, align: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!126, !74, !74}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !133, file: !137, line: 73, baseType: !493, size: 64, align: 64, offset: 2176)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !121, file: !125, line: 9, baseType: !90, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !125, line: 10, baseType: !90, size: 64, align: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !121, file: !125, line: 11, baseType: !362, size: 64, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !121, file: !125, line: 12, baseType: !126, size: 32, align: 32, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !121, file: !125, line: 13, baseType: !90, size: 64, align: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !121, file: !125, line: 15, baseType: !452, size: 64, align: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !121, file: !125, line: 17, baseType: !456, size: 64, align: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !72, line: 90, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!288, !509}
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !72, line: 78, baseType: !104)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !72, line: 80, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!183, !509, !509}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMMAND_MODULE_REC", file: !36, line: 16, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 11, size: 256, align: 64, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !516, file: !36, line: 12, baseType: !90, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !516, file: !36, line: 13, baseType: !90, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !516, file: !36, line: 14, baseType: !126, size: 32, align: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !516, file: !36, line: 15, baseType: !81, size: 64, align: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !72, line: 88, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !87, !87}
!526 = !{!527, !528, !529, !530, !531}
!527 = distinct !DIGlobalVariable(name: "commands", scope: !0, file: !109, line: 34, type: !81, isLocal: false, isDefinition: true, variable: %struct._GSList** @commands)
!528 = distinct !DIGlobalVariable(name: "current_command", scope: !0, file: !109, line: 35, type: !90, isLocal: false, isDefinition: true, variable: i8** @current_command)
!529 = distinct !DIGlobalVariable(name: "signal_default_command", scope: !0, file: !109, line: 37, type: !126, isLocal: true, isDefinition: true, variable: i32* @signal_default_command)
!530 = distinct !DIGlobalVariable(name: "alias_runstack", scope: !0, file: !109, line: 39, type: !81, isLocal: true, isDefinition: true, variable: %struct._GSList** @alias_runstack)
!531 = distinct !DIGlobalVariable(name: "eval_recursion_depth", scope: !0, file: !109, line: 956, type: !126, isLocal: true, isDefinition: true, variable: i32* @eval_recursion_depth)
!532 = !{i32 2, !"Dwarf Version", i32 4}
!533 = !{i32 2, !"Debug Info Version", i32 3}
!534 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!535 = distinct !DISubprogram(name: "command_find", scope: !109, file: !109, line: 41, type: !536, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!536 = !DISubroutineType(types: !537)
!537 = !{!76, !74}
!538 = !{}
!539 = !DILocalVariable(name: "cmd", arg: 1, scope: !535, file: !109, line: 41, type: !74)
!540 = !DIExpression()
!541 = !DILocation(line: 41, column: 39, scope: !535)
!542 = !DILocalVariable(name: "tmp", scope: !535, file: !109, line: 43, type: !81)
!543 = !DILocation(line: 43, column: 10, scope: !535)
!544 = !DILocation(line: 45, column: 2, scope: !535)
!545 = distinct !{!545, !544}
!546 = !DILocation(line: 45, column: 10, scope: !547)
!547 = !DILexicalBlockFile(scope: !548, file: !109, discriminator: 1)
!548 = distinct !DILexicalBlock(scope: !549, file: !109, line: 45, column: 10)
!549 = distinct !DILexicalBlock(scope: !535, file: !109, line: 45, column: 4)
!550 = !DILocation(line: 45, column: 14, scope: !547)
!551 = !DILocation(line: 45, column: 5, scope: !552)
!552 = !DILexicalBlockFile(scope: !553, file: !109, discriminator: 2)
!553 = distinct !DILexicalBlock(scope: !548, file: !109, line: 45, column: 3)
!554 = !DILocation(line: 45, column: 14, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !109, discriminator: 3)
!556 = distinct !DILexicalBlock(scope: !548, file: !109, line: 45, column: 12)
!557 = !DILocation(line: 45, column: 98, scope: !555)
!558 = !DILocation(line: 45, column: 7, scope: !559)
!559 = !DILexicalBlockFile(scope: !549, file: !109, discriminator: 4)
!560 = !DILocation(line: 47, column: 13, scope: !561)
!561 = distinct !DILexicalBlock(scope: !535, file: !109, line: 47, column: 2)
!562 = !DILocation(line: 47, column: 11, scope: !561)
!563 = !DILocation(line: 47, column: 7, scope: !561)
!564 = !DILocation(line: 47, column: 23, scope: !565)
!565 = !DILexicalBlockFile(scope: !566, file: !109, discriminator: 1)
!566 = distinct !DILexicalBlock(scope: !561, file: !109, line: 47, column: 2)
!567 = !DILocation(line: 47, column: 27, scope: !565)
!568 = !DILocation(line: 47, column: 2, scope: !565)
!569 = !DILocalVariable(name: "rec", scope: !570, file: !109, line: 48, type: !76)
!570 = distinct !DILexicalBlock(scope: !566, file: !109, line: 47, column: 52)
!571 = !DILocation(line: 48, column: 16, scope: !570)
!572 = !DILocation(line: 48, column: 22, scope: !570)
!573 = !DILocation(line: 48, column: 27, scope: !570)
!574 = !DILocation(line: 50, column: 26, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !109, line: 50, column: 7)
!576 = !DILocation(line: 50, column: 31, scope: !575)
!577 = !DILocation(line: 50, column: 36, scope: !575)
!578 = !DILocation(line: 50, column: 7, scope: !575)
!579 = !DILocation(line: 50, column: 41, scope: !575)
!580 = !DILocation(line: 50, column: 7, scope: !570)
!581 = !DILocation(line: 51, column: 11, scope: !575)
!582 = !DILocation(line: 51, column: 4, scope: !575)
!583 = !DILocation(line: 52, column: 2, scope: !570)
!584 = !DILocation(line: 47, column: 41, scope: !585)
!585 = !DILexicalBlockFile(scope: !566, file: !109, discriminator: 2)
!586 = !DILocation(line: 47, column: 46, scope: !585)
!587 = !DILocation(line: 47, column: 39, scope: !585)
!588 = !DILocation(line: 47, column: 2, scope: !585)
!589 = distinct !{!589, !590}
!590 = !DILocation(line: 47, column: 2, scope: !535)
!591 = !DILocation(line: 54, column: 2, scope: !535)
!592 = !DILocation(line: 55, column: 1, scope: !535)
!593 = distinct !DISubprogram(name: "command_have_sub", scope: !109, file: !109, line: 101, type: !594, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!594 = !DISubroutineType(types: !595)
!595 = !{!126, !74}
!596 = !DILocalVariable(name: "command", arg: 1, scope: !593, file: !109, line: 101, type: !74)
!597 = !DILocation(line: 101, column: 34, scope: !593)
!598 = !DILocalVariable(name: "tmp", scope: !593, file: !109, line: 103, type: !81)
!599 = !DILocation(line: 103, column: 10, scope: !593)
!600 = !DILocalVariable(name: "len", scope: !593, file: !109, line: 104, type: !126)
!601 = !DILocation(line: 104, column: 6, scope: !593)
!602 = !DILocation(line: 106, column: 2, scope: !593)
!603 = distinct !{!603, !602}
!604 = !DILocation(line: 106, column: 10, scope: !605)
!605 = !DILexicalBlockFile(scope: !606, file: !109, discriminator: 1)
!606 = distinct !DILexicalBlock(scope: !607, file: !109, line: 106, column: 10)
!607 = distinct !DILexicalBlock(scope: !593, file: !109, line: 106, column: 4)
!608 = !DILocation(line: 106, column: 18, scope: !605)
!609 = !DILocation(line: 106, column: 5, scope: !610)
!610 = !DILexicalBlockFile(scope: !611, file: !109, discriminator: 2)
!611 = distinct !DILexicalBlock(scope: !606, file: !109, line: 106, column: 3)
!612 = !DILocation(line: 106, column: 14, scope: !613)
!613 = !DILexicalBlockFile(scope: !614, file: !109, discriminator: 3)
!614 = distinct !DILexicalBlock(scope: !606, file: !109, line: 106, column: 12)
!615 = !DILocation(line: 106, column: 102, scope: !613)
!616 = !DILocation(line: 106, column: 119, scope: !617)
!617 = !DILexicalBlockFile(scope: !607, file: !109, discriminator: 4)
!618 = !DILocation(line: 109, column: 22, scope: !593)
!619 = !DILocation(line: 109, column: 15, scope: !593)
!620 = !DILocation(line: 109, column: 13, scope: !593)
!621 = !DILocation(line: 110, column: 13, scope: !622)
!622 = distinct !DILexicalBlock(scope: !593, file: !109, line: 110, column: 2)
!623 = !DILocation(line: 110, column: 11, scope: !622)
!624 = !DILocation(line: 110, column: 7, scope: !622)
!625 = !DILocation(line: 110, column: 23, scope: !626)
!626 = !DILexicalBlockFile(scope: !627, file: !109, discriminator: 1)
!627 = distinct !DILexicalBlock(scope: !622, file: !109, line: 110, column: 2)
!628 = !DILocation(line: 110, column: 27, scope: !626)
!629 = !DILocation(line: 110, column: 2, scope: !626)
!630 = !DILocalVariable(name: "rec", scope: !631, file: !109, line: 111, type: !76)
!631 = distinct !DILexicalBlock(scope: !627, file: !109, line: 110, column: 52)
!632 = !DILocation(line: 111, column: 16, scope: !631)
!633 = !DILocation(line: 111, column: 22, scope: !631)
!634 = !DILocation(line: 111, column: 27, scope: !631)
!635 = !DILocation(line: 113, column: 27, scope: !636)
!636 = distinct !DILexicalBlock(scope: !631, file: !109, line: 113, column: 7)
!637 = !DILocation(line: 113, column: 32, scope: !636)
!638 = !DILocation(line: 113, column: 37, scope: !636)
!639 = !DILocation(line: 113, column: 46, scope: !636)
!640 = !DILocation(line: 113, column: 7, scope: !636)
!641 = !DILocation(line: 113, column: 51, scope: !636)
!642 = !DILocation(line: 113, column: 56, scope: !636)
!643 = !DILocation(line: 114, column: 16, scope: !636)
!644 = !DILocation(line: 114, column: 7, scope: !636)
!645 = !DILocation(line: 114, column: 12, scope: !636)
!646 = !DILocation(line: 114, column: 21, scope: !636)
!647 = !DILocation(line: 113, column: 7, scope: !648)
!648 = !DILexicalBlockFile(scope: !631, file: !109, discriminator: 1)
!649 = !DILocation(line: 115, column: 4, scope: !636)
!650 = !DILocation(line: 116, column: 2, scope: !631)
!651 = !DILocation(line: 110, column: 41, scope: !652)
!652 = !DILexicalBlockFile(scope: !627, file: !109, discriminator: 2)
!653 = !DILocation(line: 110, column: 46, scope: !652)
!654 = !DILocation(line: 110, column: 39, scope: !652)
!655 = !DILocation(line: 110, column: 2, scope: !652)
!656 = distinct !{!656, !657}
!657 = !DILocation(line: 110, column: 2, scope: !593)
!658 = !DILocation(line: 118, column: 2, scope: !593)
!659 = !DILocation(line: 119, column: 1, scope: !593)
!660 = distinct !DISubprogram(name: "command_bind_full", scope: !109, file: !109, line: 142, type: !661, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !74, !126, !74, !126, !74, !99, !69}
!663 = !DILocalVariable(name: "module", arg: 1, scope: !660, file: !109, line: 142, type: !74)
!664 = !DILocation(line: 142, column: 36, scope: !660)
!665 = !DILocalVariable(name: "priority", arg: 2, scope: !660, file: !109, line: 142, type: !126)
!666 = !DILocation(line: 142, column: 48, scope: !660)
!667 = !DILocalVariable(name: "cmd", arg: 3, scope: !660, file: !109, line: 142, type: !74)
!668 = !DILocation(line: 142, column: 70, scope: !660)
!669 = !DILocalVariable(name: "protocol", arg: 4, scope: !660, file: !109, line: 143, type: !126)
!670 = !DILocation(line: 143, column: 14, scope: !660)
!671 = !DILocalVariable(name: "category", arg: 5, scope: !660, file: !109, line: 143, type: !74)
!672 = !DILocation(line: 143, column: 36, scope: !660)
!673 = !DILocalVariable(name: "func", arg: 6, scope: !660, file: !109, line: 143, type: !99)
!674 = !DILocation(line: 143, column: 58, scope: !660)
!675 = !DILocalVariable(name: "user_data", arg: 7, scope: !660, file: !109, line: 144, type: !69)
!676 = !DILocation(line: 144, column: 16, scope: !660)
!677 = !DILocalVariable(name: "rec", scope: !660, file: !109, line: 146, type: !76)
!678 = !DILocation(line: 146, column: 15, scope: !660)
!679 = !DILocalVariable(name: "modrec", scope: !660, file: !109, line: 147, type: !514)
!680 = !DILocation(line: 147, column: 22, scope: !660)
!681 = !DILocalVariable(name: "cb", scope: !660, file: !109, line: 148, type: !94)
!682 = !DILocation(line: 148, column: 31, scope: !660)
!683 = !DILocalVariable(name: "str", scope: !660, file: !109, line: 149, type: !90)
!684 = !DILocation(line: 149, column: 8, scope: !660)
!685 = !DILocation(line: 151, column: 2, scope: !660)
!686 = distinct !{!686, !685}
!687 = !DILocation(line: 151, column: 10, scope: !688)
!688 = !DILexicalBlockFile(scope: !689, file: !109, discriminator: 1)
!689 = distinct !DILexicalBlock(scope: !690, file: !109, line: 151, column: 10)
!690 = distinct !DILexicalBlock(scope: !660, file: !109, line: 151, column: 4)
!691 = !DILocation(line: 151, column: 17, scope: !688)
!692 = !DILocation(line: 151, column: 5, scope: !693)
!693 = !DILexicalBlockFile(scope: !694, file: !109, discriminator: 2)
!694 = distinct !DILexicalBlock(scope: !689, file: !109, line: 151, column: 3)
!695 = !DILocation(line: 151, column: 14, scope: !696)
!696 = !DILexicalBlockFile(scope: !697, file: !109, discriminator: 3)
!697 = distinct !DILexicalBlock(scope: !689, file: !109, line: 151, column: 12)
!698 = !DILocation(line: 151, column: 101, scope: !696)
!699 = !DILocation(line: 151, column: 112, scope: !700)
!700 = !DILexicalBlockFile(scope: !690, file: !109, discriminator: 4)
!701 = !DILocation(line: 152, column: 2, scope: !660)
!702 = distinct !{!702, !701}
!703 = !DILocation(line: 152, column: 10, scope: !704)
!704 = !DILexicalBlockFile(scope: !705, file: !109, discriminator: 1)
!705 = distinct !DILexicalBlock(scope: !706, file: !109, line: 152, column: 10)
!706 = distinct !DILexicalBlock(scope: !660, file: !109, line: 152, column: 4)
!707 = !DILocation(line: 152, column: 14, scope: !704)
!708 = !DILocation(line: 152, column: 5, scope: !709)
!709 = !DILexicalBlockFile(scope: !710, file: !109, discriminator: 2)
!710 = distinct !DILexicalBlock(scope: !705, file: !109, line: 152, column: 3)
!711 = !DILocation(line: 152, column: 14, scope: !712)
!712 = !DILexicalBlockFile(scope: !713, file: !109, discriminator: 3)
!713 = distinct !DILexicalBlock(scope: !705, file: !109, line: 152, column: 12)
!714 = !DILocation(line: 152, column: 98, scope: !712)
!715 = !DILocation(line: 152, column: 109, scope: !716)
!716 = !DILexicalBlockFile(scope: !706, file: !109, discriminator: 4)
!717 = !DILocation(line: 154, column: 21, scope: !660)
!718 = !DILocation(line: 154, column: 8, scope: !660)
!719 = !DILocation(line: 154, column: 6, scope: !660)
!720 = !DILocation(line: 155, column: 6, scope: !721)
!721 = distinct !DILexicalBlock(scope: !660, file: !109, line: 155, column: 6)
!722 = !DILocation(line: 155, column: 10, scope: !721)
!723 = !DILocation(line: 155, column: 6, scope: !660)
!724 = !DILocation(line: 156, column: 26, scope: !725)
!725 = distinct !DILexicalBlock(scope: !721, file: !109, line: 155, column: 18)
!726 = !DILocation(line: 156, column: 10, scope: !725)
!727 = !DILocation(line: 156, column: 7, scope: !725)
!728 = !DILocation(line: 157, column: 23, scope: !725)
!729 = !DILocation(line: 157, column: 14, scope: !725)
!730 = !DILocation(line: 157, column: 3, scope: !725)
!731 = !DILocation(line: 157, column: 8, scope: !725)
!732 = !DILocation(line: 157, column: 12, scope: !725)
!733 = !DILocation(line: 158, column: 19, scope: !725)
!734 = !DILocation(line: 158, column: 28, scope: !725)
!735 = !DILocation(line: 158, column: 19, scope: !736)
!736 = !DILexicalBlockFile(scope: !725, file: !109, discriminator: 1)
!737 = !DILocation(line: 158, column: 53, scope: !738)
!738 = !DILexicalBlockFile(scope: !725, file: !109, discriminator: 2)
!739 = !DILocation(line: 158, column: 44, scope: !738)
!740 = !DILocation(line: 158, column: 19, scope: !738)
!741 = !DILocation(line: 158, column: 19, scope: !742)
!742 = !DILexicalBlockFile(scope: !725, file: !109, discriminator: 3)
!743 = !DILocation(line: 158, column: 3, scope: !742)
!744 = !DILocation(line: 158, column: 8, scope: !742)
!745 = !DILocation(line: 158, column: 17, scope: !742)
!746 = !DILocation(line: 159, column: 29, scope: !725)
!747 = !DILocation(line: 159, column: 39, scope: !725)
!748 = !DILocation(line: 159, column: 14, scope: !725)
!749 = !DILocation(line: 159, column: 12, scope: !725)
!750 = !DILocation(line: 160, column: 2, scope: !725)
!751 = !DILocation(line: 161, column: 37, scope: !660)
!752 = !DILocation(line: 161, column: 42, scope: !660)
!753 = !DILocation(line: 161, column: 50, scope: !660)
!754 = !DILocation(line: 161, column: 18, scope: !660)
!755 = !DILocation(line: 161, column: 16, scope: !660)
!756 = !DILocation(line: 163, column: 33, scope: !660)
!757 = !DILocation(line: 163, column: 8, scope: !660)
!758 = !DILocation(line: 163, column: 5, scope: !660)
!759 = !DILocation(line: 164, column: 13, scope: !660)
!760 = !DILocation(line: 164, column: 2, scope: !660)
!761 = !DILocation(line: 164, column: 6, scope: !660)
!762 = !DILocation(line: 164, column: 11, scope: !660)
!763 = !DILocation(line: 165, column: 18, scope: !660)
!764 = !DILocation(line: 165, column: 2, scope: !660)
!765 = !DILocation(line: 165, column: 6, scope: !660)
!766 = !DILocation(line: 165, column: 16, scope: !660)
!767 = !DILocation(line: 166, column: 37, scope: !660)
!768 = !DILocation(line: 166, column: 45, scope: !660)
!769 = !DILocation(line: 166, column: 56, scope: !660)
!770 = !DILocation(line: 166, column: 22, scope: !660)
!771 = !DILocation(line: 166, column: 2, scope: !660)
!772 = !DILocation(line: 166, column: 10, scope: !660)
!773 = !DILocation(line: 166, column: 20, scope: !660)
!774 = !DILocation(line: 168, column: 6, scope: !775)
!775 = distinct !DILexicalBlock(scope: !660, file: !109, line: 168, column: 6)
!776 = !DILocation(line: 168, column: 11, scope: !775)
!777 = !DILocation(line: 168, column: 6, scope: !660)
!778 = !DILocation(line: 169, column: 33, scope: !779)
!779 = distinct !DILexicalBlock(scope: !775, file: !109, line: 168, column: 19)
!780 = !DILocation(line: 169, column: 9, scope: !779)
!781 = !DILocation(line: 169, column: 7, scope: !779)
!782 = !DILocation(line: 170, column: 19, scope: !779)
!783 = !DILocation(line: 170, column: 27, scope: !779)
!784 = !DILocation(line: 170, column: 37, scope: !779)
!785 = !DILocation(line: 170, column: 42, scope: !779)
!786 = !DILocation(line: 170, column: 48, scope: !779)
!787 = !DILocation(line: 170, column: 3, scope: !779)
!788 = !DILocation(line: 171, column: 10, scope: !779)
!789 = !DILocation(line: 171, column: 3, scope: !779)
!790 = !DILocation(line: 172, column: 2, scope: !779)
!791 = !DILocation(line: 174, column: 36, scope: !660)
!792 = !DILocation(line: 174, column: 2, scope: !660)
!793 = !DILocation(line: 175, column: 1, scope: !660)
!794 = !DILocation(line: 175, column: 1, scope: !795)
!795 = !DILexicalBlockFile(scope: !660, file: !109, discriminator: 1)
!796 = distinct !DISubprogram(name: "command_module_get", scope: !109, file: !109, line: 122, type: !797, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!797 = !DISubroutineType(types: !798)
!798 = !{!514, !76, !74, !126}
!799 = !DILocalVariable(name: "rec", arg: 1, scope: !796, file: !109, line: 122, type: !76)
!800 = !DILocation(line: 122, column: 33, scope: !796)
!801 = !DILocalVariable(name: "module", arg: 2, scope: !796, file: !109, line: 122, type: !74)
!802 = !DILocation(line: 122, column: 50, scope: !796)
!803 = !DILocalVariable(name: "protocol", arg: 3, scope: !796, file: !109, line: 122, type: !126)
!804 = !DILocation(line: 122, column: 62, scope: !796)
!805 = !DILocalVariable(name: "modrec", scope: !796, file: !109, line: 124, type: !514)
!806 = !DILocation(line: 124, column: 29, scope: !796)
!807 = !DILocation(line: 126, column: 2, scope: !796)
!808 = distinct !{!808, !807}
!809 = !DILocation(line: 126, column: 10, scope: !810)
!810 = !DILexicalBlockFile(scope: !811, file: !109, discriminator: 1)
!811 = distinct !DILexicalBlock(scope: !812, file: !109, line: 126, column: 10)
!812 = distinct !DILexicalBlock(scope: !796, file: !109, line: 126, column: 4)
!813 = !DILocation(line: 126, column: 14, scope: !810)
!814 = !DILocation(line: 126, column: 5, scope: !815)
!815 = !DILexicalBlockFile(scope: !816, file: !109, discriminator: 2)
!816 = distinct !DILexicalBlock(scope: !811, file: !109, line: 126, column: 3)
!817 = !DILocation(line: 126, column: 14, scope: !818)
!818 = !DILexicalBlockFile(scope: !819, file: !109, discriminator: 3)
!819 = distinct !DILexicalBlock(scope: !811, file: !109, line: 126, column: 12)
!820 = !DILocation(line: 126, column: 98, scope: !818)
!821 = !DILocation(line: 126, column: 7, scope: !822)
!822 = !DILexicalBlockFile(scope: !812, file: !109, discriminator: 4)
!823 = !DILocation(line: 128, column: 31, scope: !796)
!824 = !DILocation(line: 128, column: 36, scope: !796)
!825 = !DILocation(line: 128, column: 11, scope: !796)
!826 = !DILocation(line: 128, column: 9, scope: !796)
!827 = !DILocation(line: 129, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !796, file: !109, line: 129, column: 6)
!829 = !DILocation(line: 129, column: 13, scope: !828)
!830 = !DILocation(line: 129, column: 6, scope: !796)
!831 = !DILocation(line: 130, column: 36, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !109, line: 129, column: 21)
!833 = !DILocation(line: 130, column: 13, scope: !832)
!834 = !DILocation(line: 130, column: 10, scope: !832)
!835 = !DILocation(line: 131, column: 27, scope: !832)
!836 = !DILocation(line: 131, column: 18, scope: !832)
!837 = !DILocation(line: 131, column: 3, scope: !832)
!838 = !DILocation(line: 131, column: 11, scope: !832)
!839 = !DILocation(line: 131, column: 16, scope: !832)
!840 = !DILocation(line: 132, column: 17, scope: !832)
!841 = !DILocation(line: 132, column: 25, scope: !832)
!842 = !DILocation(line: 132, column: 34, scope: !832)
!843 = !DILocation(line: 133, column: 33, scope: !832)
!844 = !DILocation(line: 133, column: 38, scope: !832)
!845 = !DILocation(line: 133, column: 47, scope: !832)
!846 = !DILocation(line: 133, column: 18, scope: !832)
!847 = !DILocation(line: 133, column: 3, scope: !832)
!848 = !DILocation(line: 133, column: 8, scope: !832)
!849 = !DILocation(line: 133, column: 16, scope: !832)
!850 = !DILocation(line: 134, column: 2, scope: !832)
!851 = !DILocation(line: 136, column: 13, scope: !852)
!852 = distinct !DILexicalBlock(scope: !796, file: !109, line: 136, column: 13)
!853 = !DILocation(line: 136, column: 22, scope: !852)
!854 = !DILocation(line: 136, column: 13, scope: !796)
!855 = !DILocation(line: 137, column: 22, scope: !852)
!856 = !DILocation(line: 137, column: 3, scope: !852)
!857 = !DILocation(line: 137, column: 11, scope: !852)
!858 = !DILocation(line: 137, column: 20, scope: !852)
!859 = !DILocation(line: 139, column: 16, scope: !796)
!860 = !DILocation(line: 139, column: 9, scope: !796)
!861 = !DILocation(line: 140, column: 1, scope: !796)
!862 = distinct !DISubprogram(name: "command_unbind_full", scope: !109, file: !109, line: 229, type: !863, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !74, !99, !69}
!865 = !DILocalVariable(name: "cmd", arg: 1, scope: !862, file: !109, line: 229, type: !74)
!866 = !DILocation(line: 229, column: 38, scope: !862)
!867 = !DILocalVariable(name: "func", arg: 2, scope: !862, file: !109, line: 229, type: !99)
!868 = !DILocation(line: 229, column: 55, scope: !862)
!869 = !DILocalVariable(name: "user_data", arg: 3, scope: !862, file: !109, line: 229, type: !69)
!870 = !DILocation(line: 229, column: 67, scope: !862)
!871 = !DILocalVariable(name: "rec", scope: !862, file: !109, line: 231, type: !76)
!872 = !DILocation(line: 231, column: 15, scope: !862)
!873 = !DILocalVariable(name: "modrec", scope: !862, file: !109, line: 232, type: !514)
!874 = !DILocation(line: 232, column: 22, scope: !862)
!875 = !DILocalVariable(name: "str", scope: !862, file: !109, line: 233, type: !90)
!876 = !DILocation(line: 233, column: 8, scope: !862)
!877 = !DILocation(line: 235, column: 2, scope: !862)
!878 = distinct !{!878, !877}
!879 = !DILocation(line: 235, column: 10, scope: !880)
!880 = !DILexicalBlockFile(scope: !881, file: !109, discriminator: 1)
!881 = distinct !DILexicalBlock(scope: !882, file: !109, line: 235, column: 10)
!882 = distinct !DILexicalBlock(scope: !862, file: !109, line: 235, column: 4)
!883 = !DILocation(line: 235, column: 14, scope: !880)
!884 = !DILocation(line: 235, column: 5, scope: !885)
!885 = !DILexicalBlockFile(scope: !886, file: !109, discriminator: 2)
!886 = distinct !DILexicalBlock(scope: !881, file: !109, line: 235, column: 3)
!887 = !DILocation(line: 235, column: 14, scope: !888)
!888 = !DILexicalBlockFile(scope: !889, file: !109, discriminator: 3)
!889 = distinct !DILexicalBlock(scope: !881, file: !109, line: 235, column: 12)
!890 = !DILocation(line: 235, column: 98, scope: !888)
!891 = !DILocation(line: 235, column: 109, scope: !892)
!892 = !DILexicalBlockFile(scope: !882, file: !109, discriminator: 4)
!893 = !DILocation(line: 236, column: 2, scope: !862)
!894 = distinct !{!894, !893}
!895 = !DILocation(line: 236, column: 10, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !109, discriminator: 1)
!897 = distinct !DILexicalBlock(scope: !898, file: !109, line: 236, column: 10)
!898 = distinct !DILexicalBlock(scope: !862, file: !109, line: 236, column: 4)
!899 = !DILocation(line: 236, column: 15, scope: !896)
!900 = !DILocation(line: 236, column: 5, scope: !901)
!901 = !DILexicalBlockFile(scope: !902, file: !109, discriminator: 2)
!902 = distinct !DILexicalBlock(scope: !897, file: !109, line: 236, column: 3)
!903 = !DILocation(line: 236, column: 14, scope: !904)
!904 = !DILexicalBlockFile(scope: !905, file: !109, discriminator: 3)
!905 = distinct !DILexicalBlock(scope: !897, file: !109, line: 236, column: 12)
!906 = !DILocation(line: 236, column: 99, scope: !904)
!907 = !DILocation(line: 236, column: 110, scope: !908)
!908 = !DILexicalBlockFile(scope: !898, file: !109, discriminator: 4)
!909 = !DILocation(line: 238, column: 21, scope: !862)
!910 = !DILocation(line: 238, column: 8, scope: !862)
!911 = !DILocation(line: 238, column: 6, scope: !862)
!912 = !DILocation(line: 239, column: 6, scope: !913)
!913 = distinct !DILexicalBlock(scope: !862, file: !109, line: 239, column: 6)
!914 = !DILocation(line: 239, column: 10, scope: !913)
!915 = !DILocation(line: 239, column: 6, scope: !862)
!916 = !DILocation(line: 240, column: 43, scope: !917)
!917 = distinct !DILexicalBlock(scope: !913, file: !109, line: 239, column: 18)
!918 = !DILocation(line: 240, column: 48, scope: !917)
!919 = !DILocation(line: 240, column: 12, scope: !917)
!920 = !DILocation(line: 240, column: 10, scope: !917)
!921 = !DILocation(line: 241, column: 3, scope: !917)
!922 = distinct !{!922, !921}
!923 = !DILocation(line: 241, column: 11, scope: !924)
!924 = !DILexicalBlockFile(scope: !925, file: !109, discriminator: 1)
!925 = distinct !DILexicalBlock(scope: !926, file: !109, line: 241, column: 11)
!926 = distinct !DILexicalBlock(scope: !917, file: !109, line: 241, column: 5)
!927 = !DILocation(line: 241, column: 18, scope: !924)
!928 = !DILocation(line: 241, column: 6, scope: !929)
!929 = !DILexicalBlockFile(scope: !930, file: !109, discriminator: 2)
!930 = distinct !DILexicalBlock(scope: !925, file: !109, line: 241, column: 4)
!931 = !DILocation(line: 241, column: 15, scope: !932)
!932 = !DILexicalBlockFile(scope: !933, file: !109, discriminator: 3)
!933 = distinct !DILexicalBlock(scope: !925, file: !109, line: 241, column: 13)
!934 = !DILocation(line: 241, column: 102, scope: !932)
!935 = !DILocation(line: 241, column: 113, scope: !936)
!936 = !DILexicalBlockFile(scope: !926, file: !109, discriminator: 4)
!937 = !DILocation(line: 243, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !917, file: !109, line: 243, column: 7)
!939 = !DILocation(line: 243, column: 15, scope: !938)
!940 = !DILocation(line: 243, column: 25, scope: !938)
!941 = !DILocation(line: 243, column: 7, scope: !917)
!942 = !DILocation(line: 244, column: 27, scope: !938)
!943 = !DILocation(line: 244, column: 32, scope: !938)
!944 = !DILocation(line: 244, column: 4, scope: !938)
!945 = !DILocation(line: 245, column: 2, scope: !917)
!946 = !DILocation(line: 247, column: 32, scope: !862)
!947 = !DILocation(line: 247, column: 8, scope: !862)
!948 = !DILocation(line: 247, column: 6, scope: !862)
!949 = !DILocation(line: 248, column: 22, scope: !862)
!950 = !DILocation(line: 248, column: 43, scope: !862)
!951 = !DILocation(line: 248, column: 50, scope: !862)
!952 = !DILocation(line: 248, column: 2, scope: !862)
!953 = !DILocation(line: 249, column: 9, scope: !862)
!954 = !DILocation(line: 249, column: 2, scope: !862)
!955 = !DILocation(line: 250, column: 1, scope: !862)
!956 = !DILocation(line: 250, column: 1, scope: !957)
!957 = !DILexicalBlockFile(scope: !862, file: !109, discriminator: 1)
!958 = distinct !DISubprogram(name: "command_module_find_and_remove", scope: !109, file: !109, line: 76, type: !959, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!959 = !DISubroutineType(types: !960)
!960 = !{!514, !76, !99}
!961 = !DILocalVariable(name: "rec", arg: 1, scope: !958, file: !109, line: 76, type: !76)
!962 = !DILocation(line: 76, column: 45, scope: !958)
!963 = !DILocalVariable(name: "func", arg: 2, scope: !958, file: !109, line: 76, type: !99)
!964 = !DILocation(line: 76, column: 62, scope: !958)
!965 = !DILocalVariable(name: "tmp", scope: !958, file: !109, line: 78, type: !81)
!966 = !DILocation(line: 78, column: 10, scope: !958)
!967 = !DILocalVariable(name: "tmp2", scope: !958, file: !109, line: 78, type: !81)
!968 = !DILocation(line: 78, column: 16, scope: !958)
!969 = !DILocation(line: 80, column: 2, scope: !958)
!970 = distinct !{!970, !969}
!971 = !DILocation(line: 80, column: 10, scope: !972)
!972 = !DILexicalBlockFile(scope: !973, file: !109, discriminator: 1)
!973 = distinct !DILexicalBlock(scope: !974, file: !109, line: 80, column: 10)
!974 = distinct !DILexicalBlock(scope: !958, file: !109, line: 80, column: 4)
!975 = !DILocation(line: 80, column: 14, scope: !972)
!976 = !DILocation(line: 80, column: 5, scope: !977)
!977 = !DILexicalBlockFile(scope: !978, file: !109, discriminator: 2)
!978 = distinct !DILexicalBlock(scope: !973, file: !109, line: 80, column: 3)
!979 = !DILocation(line: 80, column: 14, scope: !980)
!980 = !DILexicalBlockFile(scope: !981, file: !109, discriminator: 3)
!981 = distinct !DILexicalBlock(scope: !973, file: !109, line: 80, column: 12)
!982 = !DILocation(line: 80, column: 98, scope: !980)
!983 = !DILocation(line: 80, column: 7, scope: !984)
!984 = !DILexicalBlockFile(scope: !974, file: !109, discriminator: 4)
!985 = !DILocation(line: 81, column: 2, scope: !958)
!986 = distinct !{!986, !985}
!987 = !DILocation(line: 81, column: 10, scope: !988)
!988 = !DILexicalBlockFile(scope: !989, file: !109, discriminator: 1)
!989 = distinct !DILexicalBlock(scope: !990, file: !109, line: 81, column: 10)
!990 = distinct !DILexicalBlock(scope: !958, file: !109, line: 81, column: 4)
!991 = !DILocation(line: 81, column: 15, scope: !988)
!992 = !DILocation(line: 81, column: 5, scope: !993)
!993 = !DILexicalBlockFile(scope: !994, file: !109, discriminator: 2)
!994 = distinct !DILexicalBlock(scope: !989, file: !109, line: 81, column: 3)
!995 = !DILocation(line: 81, column: 14, scope: !996)
!996 = !DILexicalBlockFile(scope: !997, file: !109, discriminator: 3)
!997 = distinct !DILexicalBlock(scope: !989, file: !109, line: 81, column: 12)
!998 = !DILocation(line: 81, column: 99, scope: !996)
!999 = !DILocation(line: 81, column: 7, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !990, file: !109, discriminator: 4)
!1001 = !DILocation(line: 83, column: 13, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !958, file: !109, line: 83, column: 2)
!1003 = !DILocation(line: 83, column: 18, scope: !1002)
!1004 = !DILocation(line: 83, column: 11, scope: !1002)
!1005 = !DILocation(line: 83, column: 7, scope: !1002)
!1006 = !DILocation(line: 83, column: 27, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1008, file: !109, discriminator: 1)
!1008 = distinct !DILexicalBlock(scope: !1002, file: !109, line: 83, column: 2)
!1009 = !DILocation(line: 83, column: 31, scope: !1007)
!1010 = !DILocation(line: 83, column: 2, scope: !1007)
!1011 = !DILocalVariable(name: "rec", scope: !1012, file: !109, line: 84, type: !514)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !109, line: 83, column: 56)
!1013 = !DILocation(line: 84, column: 23, scope: !1012)
!1014 = !DILocation(line: 84, column: 29, scope: !1012)
!1015 = !DILocation(line: 84, column: 34, scope: !1012)
!1016 = !DILocation(line: 86, column: 15, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !109, line: 86, column: 3)
!1018 = !DILocation(line: 86, column: 20, scope: !1017)
!1019 = !DILocation(line: 86, column: 13, scope: !1017)
!1020 = !DILocation(line: 86, column: 8, scope: !1017)
!1021 = !DILocation(line: 86, column: 31, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1023, file: !109, discriminator: 1)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !109, line: 86, column: 3)
!1024 = !DILocation(line: 86, column: 36, scope: !1022)
!1025 = !DILocation(line: 86, column: 3, scope: !1022)
!1026 = !DILocalVariable(name: "cb", scope: !1027, file: !109, line: 87, type: !94)
!1027 = distinct !DILexicalBlock(scope: !1023, file: !109, line: 86, column: 63)
!1028 = !DILocation(line: 87, column: 26, scope: !1027)
!1029 = !DILocation(line: 87, column: 31, scope: !1027)
!1030 = !DILocation(line: 87, column: 37, scope: !1027)
!1031 = !DILocation(line: 89, column: 8, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !109, line: 89, column: 8)
!1033 = !DILocation(line: 89, column: 12, scope: !1032)
!1034 = !DILocation(line: 89, column: 20, scope: !1032)
!1035 = !DILocation(line: 89, column: 17, scope: !1032)
!1036 = !DILocation(line: 89, column: 8, scope: !1027)
!1037 = !DILocation(line: 91, column: 21, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1032, file: !109, line: 89, column: 26)
!1039 = !DILocation(line: 91, column: 26, scope: !1038)
!1040 = !DILocation(line: 91, column: 37, scope: !1038)
!1041 = !DILocation(line: 91, column: 6, scope: !1038)
!1042 = !DILocation(line: 90, column: 5, scope: !1038)
!1043 = !DILocation(line: 90, column: 10, scope: !1038)
!1044 = !DILocation(line: 90, column: 20, scope: !1038)
!1045 = !DILocation(line: 92, column: 12, scope: !1038)
!1046 = !DILocation(line: 92, column: 5, scope: !1038)
!1047 = !DILocation(line: 93, column: 12, scope: !1038)
!1048 = !DILocation(line: 93, column: 5, scope: !1038)
!1049 = !DILocation(line: 95, column: 3, scope: !1027)
!1050 = !DILocation(line: 86, column: 51, scope: !1051)
!1051 = !DILexicalBlockFile(scope: !1023, file: !109, discriminator: 2)
!1052 = !DILocation(line: 86, column: 57, scope: !1051)
!1053 = !DILocation(line: 86, column: 49, scope: !1051)
!1054 = !DILocation(line: 86, column: 3, scope: !1051)
!1055 = distinct !{!1055, !1056}
!1056 = !DILocation(line: 86, column: 3, scope: !1012)
!1057 = !DILocation(line: 96, column: 2, scope: !1012)
!1058 = !DILocation(line: 83, column: 45, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1008, file: !109, discriminator: 2)
!1060 = !DILocation(line: 83, column: 50, scope: !1059)
!1061 = !DILocation(line: 83, column: 43, scope: !1059)
!1062 = !DILocation(line: 83, column: 2, scope: !1059)
!1063 = distinct !{!1063, !1064}
!1064 = !DILocation(line: 83, column: 2, scope: !958)
!1065 = !DILocation(line: 98, column: 2, scope: !958)
!1066 = !DILocation(line: 99, column: 1, scope: !958)
!1067 = distinct !DISubprogram(name: "command_module_destroy", scope: !109, file: !109, line: 199, type: !1068, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !76, !514}
!1070 = !DILocalVariable(name: "rec", arg: 1, scope: !1067, file: !109, line: 199, type: !76)
!1071 = !DILocation(line: 199, column: 49, scope: !1067)
!1072 = !DILocalVariable(name: "modrec", arg: 2, scope: !1067, file: !109, line: 200, type: !514)
!1073 = !DILocation(line: 200, column: 28, scope: !1067)
!1074 = !DILocalVariable(name: "tmp", scope: !1067, file: !109, line: 202, type: !81)
!1075 = !DILocation(line: 202, column: 10, scope: !1067)
!1076 = !DILocalVariable(name: "freelist", scope: !1067, file: !109, line: 202, type: !81)
!1077 = !DILocation(line: 202, column: 16, scope: !1067)
!1078 = !DILocation(line: 204, column: 29, scope: !1067)
!1079 = !DILocation(line: 204, column: 37, scope: !1067)
!1080 = !DILocation(line: 204, column: 9, scope: !1067)
!1081 = !DILocation(line: 209, column: 18, scope: !1067)
!1082 = !DILocation(line: 210, column: 13, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1067, file: !109, line: 210, column: 2)
!1084 = !DILocation(line: 210, column: 18, scope: !1083)
!1085 = !DILocation(line: 210, column: 11, scope: !1083)
!1086 = !DILocation(line: 210, column: 7, scope: !1083)
!1087 = !DILocation(line: 210, column: 27, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !1089, file: !109, discriminator: 1)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !109, line: 210, column: 2)
!1090 = !DILocation(line: 210, column: 31, scope: !1088)
!1091 = !DILocation(line: 210, column: 2, scope: !1088)
!1092 = !DILocalVariable(name: "rec", scope: !1093, file: !109, line: 211, type: !514)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !109, line: 210, column: 56)
!1094 = !DILocation(line: 211, column: 23, scope: !1093)
!1095 = !DILocation(line: 211, column: 29, scope: !1093)
!1096 = !DILocation(line: 211, column: 34, scope: !1093)
!1097 = !DILocation(line: 213, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1093, file: !109, line: 213, column: 7)
!1099 = !DILocation(line: 213, column: 12, scope: !1098)
!1100 = !DILocation(line: 213, column: 22, scope: !1098)
!1101 = !DILocation(line: 213, column: 7, scope: !1093)
!1102 = !DILocation(line: 214, column: 30, scope: !1098)
!1103 = !DILocation(line: 214, column: 40, scope: !1098)
!1104 = !DILocation(line: 214, column: 15, scope: !1098)
!1105 = !DILocation(line: 214, column: 13, scope: !1098)
!1106 = !DILocation(line: 214, column: 4, scope: !1098)
!1107 = !DILocation(line: 216, column: 38, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1098, file: !109, line: 215, column: 8)
!1109 = !DILocation(line: 216, column: 25, scope: !1108)
!1110 = !DILocation(line: 217, column: 34, scope: !1108)
!1111 = !DILocation(line: 218, column: 4, scope: !1108)
!1112 = !DILocation(line: 220, column: 2, scope: !1093)
!1113 = !DILocation(line: 210, column: 45, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1089, file: !109, discriminator: 2)
!1115 = !DILocation(line: 210, column: 50, scope: !1114)
!1116 = !DILocation(line: 210, column: 43, scope: !1114)
!1117 = !DILocation(line: 210, column: 2, scope: !1114)
!1118 = distinct !{!1118, !1119}
!1119 = !DILocation(line: 210, column: 2, scope: !1067)
!1120 = !DILocation(line: 222, column: 18, scope: !1067)
!1121 = !DILocation(line: 222, column: 57, scope: !1067)
!1122 = !DILocation(line: 222, column: 2, scope: !1067)
!1123 = !DILocation(line: 223, column: 15, scope: !1067)
!1124 = !DILocation(line: 223, column: 2, scope: !1067)
!1125 = !DILocation(line: 225, column: 6, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1067, file: !109, line: 225, column: 6)
!1127 = !DILocation(line: 225, column: 11, scope: !1126)
!1128 = !DILocation(line: 225, column: 19, scope: !1126)
!1129 = !DILocation(line: 225, column: 6, scope: !1067)
!1130 = !DILocation(line: 226, column: 16, scope: !1126)
!1131 = !DILocation(line: 226, column: 3, scope: !1126)
!1132 = !DILocation(line: 227, column: 1, scope: !1067)
!1133 = distinct !DISubprogram(name: "command_runsub", scope: !109, file: !109, line: 296, type: !1134, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !538)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !74, !74, !69, !69}
!1136 = !DILocalVariable(name: "cmd", arg: 1, scope: !1133, file: !109, line: 296, type: !74)
!1137 = !DILocation(line: 296, column: 33, scope: !1133)
!1138 = !DILocalVariable(name: "data", arg: 2, scope: !1133, file: !109, line: 296, type: !74)
!1139 = !DILocation(line: 296, column: 50, scope: !1133)
!1140 = !DILocalVariable(name: "server", arg: 3, scope: !1133, file: !109, line: 297, type: !69)
!1141 = !DILocation(line: 297, column: 13, scope: !1133)
!1142 = !DILocalVariable(name: "item", arg: 4, scope: !1133, file: !109, line: 297, type: !69)
!1143 = !DILocation(line: 297, column: 27, scope: !1133)
!1144 = !DILocalVariable(name: "newcmd", scope: !1133, file: !109, line: 299, type: !74)
!1145 = !DILocation(line: 299, column: 14, scope: !1133)
!1146 = !DILocalVariable(name: "orig", scope: !1133, file: !109, line: 300, type: !90)
!1147 = !DILocation(line: 300, column: 8, scope: !1133)
!1148 = !DILocalVariable(name: "subcmd", scope: !1133, file: !109, line: 300, type: !90)
!1149 = !DILocation(line: 300, column: 15, scope: !1133)
!1150 = !DILocalVariable(name: "defcmd", scope: !1133, file: !109, line: 300, type: !90)
!1151 = !DILocation(line: 300, column: 24, scope: !1133)
!1152 = !DILocalVariable(name: "args", scope: !1133, file: !109, line: 300, type: !90)
!1153 = !DILocation(line: 300, column: 33, scope: !1133)
!1154 = !DILocation(line: 302, column: 2, scope: !1133)
!1155 = distinct !{!1155, !1154}
!1156 = !DILocation(line: 302, column: 10, scope: !1157)
!1157 = !DILexicalBlockFile(scope: !1158, file: !109, discriminator: 1)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !109, line: 302, column: 10)
!1159 = distinct !DILexicalBlock(scope: !1133, file: !109, line: 302, column: 4)
!1160 = !DILocation(line: 302, column: 15, scope: !1157)
!1161 = !DILocation(line: 302, column: 5, scope: !1162)
!1162 = !DILexicalBlockFile(scope: !1163, file: !109, discriminator: 2)
!1163 = distinct !DILexicalBlock(scope: !1158, file: !109, line: 302, column: 3)
!1164 = !DILocation(line: 302, column: 14, scope: !1165)
!1165 = !DILexicalBlockFile(scope: !1166, file: !109, discriminator: 3)
!1166 = distinct !DILexicalBlock(scope: !1158, file: !109, line: 302, column: 12)
!1167 = !DILocation(line: 302, column: 99, scope: !1165)
!1168 = !DILocation(line: 302, column: 110, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1159, file: !109, discriminator: 4)
!1170 = !DILocation(line: 304, column: 9, scope: !1133)
!1171 = !DILocation(line: 304, column: 17, scope: !1172)
!1172 = !DILexicalBlockFile(scope: !1133, file: !109, discriminator: 1)
!1173 = !DILocation(line: 304, column: 16, scope: !1172)
!1174 = !DILocation(line: 304, column: 22, scope: !1172)
!1175 = !DILocation(line: 304, column: 9, scope: !1172)
!1176 = !DILocation(line: 304, column: 34, scope: !1177)
!1177 = !DILexicalBlockFile(scope: !1133, file: !109, discriminator: 2)
!1178 = !DILocation(line: 304, column: 9, scope: !1177)
!1179 = distinct !{!1179, !1170}
!1180 = !DILocation(line: 306, column: 7, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1133, file: !109, line: 306, column: 6)
!1182 = !DILocation(line: 306, column: 6, scope: !1181)
!1183 = !DILocation(line: 306, column: 12, scope: !1181)
!1184 = !DILocation(line: 306, column: 6, scope: !1133)
!1185 = !DILocation(line: 308, column: 38, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1181, file: !109, line: 306, column: 21)
!1187 = !DILocation(line: 308, column: 3, scope: !1186)
!1188 = !DILocation(line: 309, column: 3, scope: !1186)
!1189 = !DILocation(line: 313, column: 51, scope: !1133)
!1190 = !DILocation(line: 313, column: 56, scope: !1133)
!1191 = !DILocation(line: 313, column: 18, scope: !1133)
!1192 = !DILocation(line: 313, column: 16, scope: !1133)
!1193 = !DILocation(line: 313, column: 7, scope: !1133)
!1194 = !DILocation(line: 314, column: 16, scope: !1133)
!1195 = !DILocation(line: 314, column: 22, scope: !1133)
!1196 = !DILocation(line: 314, column: 34, scope: !1133)
!1197 = !DILocation(line: 314, column: 27, scope: !1133)
!1198 = !DILocation(line: 314, column: 25, scope: !1133)
!1199 = !DILocation(line: 314, column: 38, scope: !1133)
!1200 = !DILocation(line: 314, column: 9, scope: !1172)
!1201 = !DILocation(line: 314, column: 7, scope: !1133)
!1202 = !DILocation(line: 315, column: 6, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1133, file: !109, line: 315, column: 6)
!1204 = !DILocation(line: 315, column: 11, scope: !1203)
!1205 = !DILocation(line: 315, column: 6, scope: !1133)
!1206 = !DILocation(line: 315, column: 24, scope: !1207)
!1207 = !DILexicalBlockFile(scope: !1203, file: !109, discriminator: 1)
!1208 = !DILocation(line: 315, column: 27, scope: !1207)
!1209 = !DILocation(line: 315, column: 19, scope: !1207)
!1210 = !DILocation(line: 315, column: 45, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1203, file: !109, discriminator: 2)
!1212 = !DILocation(line: 316, column: 2, scope: !1133)
!1213 = !DILocation(line: 316, column: 10, scope: !1172)
!1214 = !DILocation(line: 316, column: 9, scope: !1172)
!1215 = !DILocation(line: 316, column: 15, scope: !1172)
!1216 = !DILocation(line: 316, column: 2, scope: !1172)
!1217 = !DILocation(line: 316, column: 27, scope: !1177)
!1218 = !DILocation(line: 316, column: 2, scope: !1177)
!1219 = distinct !{!1219, !1212}
