; ModuleID = './line81-session.o.i'
source_filename = "./line81-session.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._GOptionEntry = type { i8*, i8, i32, i32, i8*, i8*, i8* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }

!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !55, line: 31, size: 32, align: 32, elements: !56)
!55 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIEnumerator(name: "G_IO_IN", value: 1)
!58 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!59 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!60 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!61 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!62 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 84, size: 32, align: 32, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73}
!65 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!66 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!67 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!68 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!69 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!70 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!71 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!72 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!73 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !75, line: 25, size: 32, align: 32, elements: !76)
!75 = !DIFile(filename: "commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!77 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!78 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!79 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!80 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!81 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!82 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!83 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!84 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!85 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!86 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!87 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!88 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!89 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!90 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!91 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!92 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!93 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!94 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 4, size: 32, align: 32, elements: !97)
!96 = !DIFile(filename: "../../src/lib-config/iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!99 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!100 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!101 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!102 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!103 = !{!104, !105, !112, !114, !116}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !106, line: 9, baseType: !107)
!106 = !DIFile(filename: "signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, !110, !110, !110, !110, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !113, line: 77, baseType: !104)
!113 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !113, line: 48, baseType: !115)
!115 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !113, line: 49, baseType: !117)
!117 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!118 = !{!119, !123, !145, !146}
!119 = distinct !DIGlobalVariable(name: "irssi_binary", scope: !0, file: !120, line: 37, type: !121, isLocal: false, isDefinition: true, variable: i8** @irssi_binary)
!120 = !DIFile(filename: "session.c", directory: "/home/lichi/Desktop/irssi/task1")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!123 = distinct !DIGlobalVariable(name: "options", scope: !124, file: !120, line: 336, type: !128, isLocal: true, isDefinition: true, variable: [2 x %struct._GOptionEntry]* @session_register_options.options)
!124 = distinct !DISubprogram(name: "session_register_options", scope: !120, file: !120, line: 334, type: !125, isLocal: false, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!125 = !DISubroutineType(types: !126)
!126 = !{null}
!127 = !{}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 768, align: 64, elements: !143)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !4, line: 52, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !4, line: 257, size: 384, align: 64, elements: !131)
!131 = !{!132, !136, !137, !138, !140, !141, !142}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !130, file: !4, line: 259, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !113, line: 46, baseType: !122)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !130, file: !4, line: 260, baseType: !135, size: 8, align: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !4, line: 261, baseType: !116, size: 32, align: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !130, file: !4, line: 263, baseType: !139, size: 32, align: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !4, line: 129, baseType: !3)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !130, file: !4, line: 264, baseType: !112, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !130, file: !4, line: 266, baseType: !133, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !130, file: !4, line: 267, baseType: !133, size: 64, align: 64, offset: 320)
!143 = !{!144}
!144 = !DISubrange(count: 2)
!145 = distinct !DIGlobalVariable(name: "session_file", scope: !0, file: !120, line: 36, type: !121, isLocal: true, isDefinition: true, variable: i8** @session_file)
!146 = distinct !DIGlobalVariable(name: "session_args", scope: !0, file: !120, line: 39, type: !147, isLocal: true, isDefinition: true, variable: i8*** @session_args)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!148 = !{i32 2, !"Dwarf Version", i32 4}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!151 = distinct !DISubprogram(name: "session_set_binary", scope: !120, file: !120, line: 41, type: !152, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!156 = !DILocalVariable(name: "path", arg: 1, scope: !151, file: !120, line: 41, type: !154)
!157 = !DIExpression()
!158 = !DILocation(line: 41, column: 37, scope: !151)
!159 = !DILocation(line: 43, column: 2, scope: !151)
!160 = distinct !{!160, !159}
!161 = !DILocation(line: 43, column: 11, scope: !162)
!162 = !DILexicalBlockFile(scope: !163, file: !120, discriminator: 1)
!163 = distinct !DILexicalBlock(scope: !164, file: !120, line: 43, column: 11)
!164 = distinct !DILexicalBlock(scope: !151, file: !120, line: 43, column: 5)
!165 = !DILocation(line: 43, column: 34, scope: !166)
!166 = !DILexicalBlockFile(scope: !167, file: !120, discriminator: 2)
!167 = distinct !DILexicalBlock(scope: !163, file: !120, line: 43, column: 25)
!168 = !DILocation(line: 43, column: 27, scope: !166)
!169 = !DILocation(line: 43, column: 64, scope: !166)
!170 = !DILocation(line: 43, column: 3, scope: !166)
!171 = !DILocation(line: 43, column: 5, scope: !172)
!172 = !DILexicalBlockFile(scope: !164, file: !120, discriminator: 3)
!173 = !DILocation(line: 45, column: 40, scope: !151)
!174 = !DILocation(line: 45, column: 17, scope: !151)
!175 = !DILocation(line: 45, column: 15, scope: !151)
!176 = !DILocation(line: 46, column: 1, scope: !151)
!177 = distinct !DISubprogram(name: "session_upgrade", scope: !120, file: !120, line: 48, type: !125, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!178 = !DILocation(line: 50, column: 6, scope: !179)
!179 = distinct !DILexicalBlock(scope: !177, file: !120, line: 50, column: 6)
!180 = !DILocation(line: 50, column: 19, scope: !179)
!181 = !DILocation(line: 50, column: 6, scope: !177)
!182 = !DILocation(line: 51, column: 17, scope: !179)
!183 = !DILocation(line: 53, column: 8, scope: !177)
!184 = !DILocation(line: 53, column: 25, scope: !177)
!185 = !DILocation(line: 53, column: 2, scope: !177)
!186 = !DILocation(line: 54, column: 9, scope: !177)
!187 = !DILocation(line: 55, column: 3, scope: !177)
!188 = !DILocation(line: 55, column: 32, scope: !177)
!189 = !DILocation(line: 55, column: 31, scope: !177)
!190 = !DILocation(line: 55, column: 20, scope: !191)
!191 = !DILexicalBlockFile(scope: !177, file: !120, discriminator: 1)
!192 = !DILocation(line: 54, column: 2, scope: !177)
!193 = !DILocation(line: 56, column: 1, scope: !177)
!194 = !DILocation(line: 56, column: 1, scope: !191)
!195 = !DILocation(line: 341, column: 15, scope: !124)
!196 = !DILocation(line: 342, column: 2, scope: !124)
!197 = !DILocation(line: 343, column: 1, scope: !124)
!198 = distinct !DISubprogram(name: "session_init", scope: !120, file: !120, line: 345, type: !125, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!199 = !DILocation(line: 347, column: 2, scope: !198)
!200 = !DILocation(line: 349, column: 2, scope: !198)
!201 = !DILocation(line: 350, column: 2, scope: !198)
!202 = !DILocation(line: 351, column: 2, scope: !198)
!203 = !DILocation(line: 352, column: 2, scope: !198)
!204 = !DILocation(line: 353, column: 2, scope: !198)
!205 = !DILocation(line: 354, column: 2, scope: !198)
!206 = !DILocation(line: 355, column: 2, scope: !198)
!207 = !DILocation(line: 356, column: 1, scope: !198)
!208 = distinct !DISubprogram(name: "cmd_upgrade", scope: !120, file: !120, line: 59, type: !152, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!209 = !DILocalVariable(name: "data", arg: 1, scope: !208, file: !120, line: 59, type: !154)
!210 = !DILocation(line: 59, column: 37, scope: !208)
!211 = !DILocalVariable(name: "session", scope: !208, file: !120, line: 61, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !96, line: 18, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !96, line: 49, size: 576, align: 64, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !228, !233, !234, !327, !497, !498}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !214, file: !96, line: 50, baseType: !121, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !214, file: !96, line: 51, baseType: !117, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !214, file: !96, line: 52, baseType: !117, size: 32, align: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !214, file: !96, line: 54, baseType: !121, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !214, file: !96, line: 55, baseType: !221, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !96, line: 17, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !96, line: 20, size: 192, align: 64, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !96, line: 21, baseType: !117, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !223, file: !96, line: 22, baseType: !121, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !223, file: !96, line: 23, baseType: !104, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !214, file: !96, line: 56, baseType: !229, size: 64, align: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !231, line: 37, baseType: !232)
!231 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !231, line: 37, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !214, file: !96, line: 57, baseType: !229, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !214, file: !96, line: 59, baseType: !235, size: 64, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !16, line: 37, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !16, line: 169, size: 1152, align: 64, elements: !238)
!238 = !{!239, !240, !243, !244, !245, !250, !283, !285, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !237, file: !16, line: 172, baseType: !112, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !237, file: !16, line: 173, baseType: !241, size: 32, align: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !113, line: 55, baseType: !242)
!242 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !237, file: !16, line: 176, baseType: !241, size: 32, align: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !237, file: !16, line: 179, baseType: !133, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !237, file: !16, line: 182, baseType: !246, size: 64, align: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !248, line: 36, baseType: !249)
!248 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !248, line: 36, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !237, file: !16, line: 185, baseType: !251, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !16, line: 38, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !16, line: 127, size: 320, align: 64, elements: !254)
!254 = !{!255, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !253, file: !16, line: 131, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !253, file: !16, line: 132, baseType: !256, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !253, file: !16, line: 133, baseType: !256, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !253, file: !16, line: 134, baseType: !256, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !253, file: !16, line: 138, baseType: !241, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !253, file: !16, line: 143, baseType: !241, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !253, file: !16, line: 144, baseType: !241, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !253, file: !16, line: 145, baseType: !241, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !253, file: !16, line: 146, baseType: !241, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !253, file: !16, line: 147, baseType: !241, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !253, file: !16, line: 148, baseType: !241, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !253, file: !16, line: 149, baseType: !241, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !253, file: !16, line: 150, baseType: !241, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !253, file: !16, line: 151, baseType: !241, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !253, file: !16, line: 152, baseType: !241, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !253, file: !16, line: 153, baseType: !241, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !253, file: !16, line: 154, baseType: !241, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !253, file: !16, line: 155, baseType: !241, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !253, file: !16, line: 156, baseType: !241, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !253, file: !16, line: 157, baseType: !241, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !253, file: !16, line: 158, baseType: !241, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !253, file: !16, line: 159, baseType: !241, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !253, file: !16, line: 160, baseType: !241, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !253, file: !16, line: 161, baseType: !241, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !253, file: !16, line: 162, baseType: !241, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !253, file: !16, line: 163, baseType: !241, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !253, file: !16, line: 166, baseType: !241, size: 32, align: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !237, file: !16, line: 188, baseType: !284, size: 32, align: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !16, line: 109, baseType: !15)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !237, file: !16, line: 189, baseType: !286, size: 64, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !16, line: 39, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !16, line: 111, size: 64, align: 64, elements: !288)
!288 = !{!289, !290, !291, !294, !295, !296, !299, !302, !303, !304, !305, !308}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !287, file: !16, line: 113, baseType: !112, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !287, file: !16, line: 114, baseType: !256, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !287, file: !16, line: 115, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !113, line: 54, baseType: !293)
!293 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !287, file: !16, line: 116, baseType: !292, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !287, file: !16, line: 117, baseType: !292, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !287, file: !16, line: 118, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !298, line: 52, baseType: !293)
!298 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !287, file: !16, line: 119, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !113, line: 58, baseType: !301)
!301 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !287, file: !16, line: 120, baseType: !292, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !287, file: !16, line: 121, baseType: !256, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !287, file: !16, line: 122, baseType: !256, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !287, file: !16, line: 123, baseType: !306, size: 8, align: 8)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !113, line: 52, baseType: !307)
!307 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !287, file: !16, line: 124, baseType: !241, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !237, file: !16, line: 190, baseType: !241, size: 32, align: 32, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !237, file: !16, line: 191, baseType: !241, size: 32, align: 32, offset: 480)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !237, file: !16, line: 194, baseType: !284, size: 32, align: 32, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !237, file: !16, line: 195, baseType: !286, size: 64, align: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !237, file: !16, line: 196, baseType: !241, size: 32, align: 32, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !237, file: !16, line: 197, baseType: !241, size: 32, align: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !237, file: !16, line: 201, baseType: !229, size: 64, align: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !237, file: !16, line: 202, baseType: !116, size: 32, align: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !237, file: !16, line: 203, baseType: !133, size: 64, align: 64, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !237, file: !16, line: 204, baseType: !133, size: 64, align: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !237, file: !16, line: 205, baseType: !256, size: 64, align: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !237, file: !16, line: 206, baseType: !241, size: 32, align: 32, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !237, file: !16, line: 210, baseType: !322, size: 64, align: 64, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !16, line: 41, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !235, !256, !326}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !113, line: 50, baseType: !116)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !214, file: !96, line: 62, baseType: !328, size: 64, align: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !43, line: 41, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !43, line: 97, size: 896, align: 64, elements: !331)
!331 = !{!332, !333, !464, !465, !470, !471, !472, !473, !474, !483, !484, !485, !489, !490, !491, !492, !493, !494, !495, !496}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !330, file: !43, line: 100, baseType: !116, size: 32, align: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !330, file: !43, line: 101, baseType: !334, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !43, line: 42, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !43, line: 131, size: 512, align: 64, elements: !337)
!337 = !{!338, !357, !361, !367, !371, !451, !455, !460}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !336, file: !43, line: 133, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !328, !256, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !43, line: 75, baseType: !42)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !298, line: 66, baseType: !293)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !348, line: 42, baseType: !349)
!348 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !348, line: 44, size: 128, align: 64, elements: !350)
!350 = !{!351, !355, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !349, file: !348, line: 46, baseType: !352, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !353, line: 36, baseType: !354)
!353 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !298, line: 45, baseType: !242)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !349, file: !348, line: 47, baseType: !116, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !349, file: !348, line: 48, baseType: !256, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !336, file: !43, line: 138, baseType: !358, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!342, !328, !133, !343, !344, !345}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !336, file: !43, line: 143, baseType: !362, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!342, !328, !365, !366, !345}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !298, line: 51, baseType: !115)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !43, line: 82, baseType: !49)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !336, file: !43, line: 147, baseType: !368, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!342, !328, !345}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !336, file: !43, line: 149, baseType: !372, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !328, !450}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !55, line: 64, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !55, line: 171, size: 768, align: 64, elements: !378)
!378 = !{!379, !380, !400, !427, !428, !432, !433, !434, !435, !443, !444, !445, !446}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !377, file: !55, line: 174, baseType: !112, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !377, file: !55, line: 175, baseType: !381, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !55, line: 77, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !55, line: 196, size: 192, align: 64, elements: !384)
!384 = !{!385, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !383, file: !55, line: 198, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !112}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !383, file: !55, line: 199, baseType: !386, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !383, file: !55, line: 200, baseType: !391, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !112, !375, !394, !399}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !55, line: 155, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!326, !112}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !377, file: !55, line: 177, baseType: !401, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !55, line: 130, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !55, line: 214, size: 384, align: 64, elements: !405)
!405 = !{!406, !411, !415, !419, !423, !424}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !404, file: !55, line: 216, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!326, !375, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !404, file: !55, line: 218, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!326, !375}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !404, file: !55, line: 219, baseType: !416, size: 64, align: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!326, !375, !395, !112}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !404, file: !55, line: 222, baseType: !420, size: 64, align: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !375}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !404, file: !55, line: 226, baseType: !395, size: 64, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !404, file: !55, line: 227, baseType: !425, size: 64, align: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !55, line: 212, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !377, file: !55, line: 178, baseType: !241, size: 32, align: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !377, file: !55, line: 180, baseType: !429, size: 64, align: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !55, line: 48, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !55, line: 48, flags: DIFlagFwdDecl)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !377, file: !55, line: 182, baseType: !116, size: 32, align: 32, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !55, line: 183, baseType: !241, size: 32, align: 32, offset: 352)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !377, file: !55, line: 184, baseType: !241, size: 32, align: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !377, file: !55, line: 186, baseType: !436, size: 64, align: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !438, line: 37, baseType: !439)
!438 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !438, line: 39, size: 128, align: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !439, file: !438, line: 41, baseType: !112, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !438, line: 42, baseType: !436, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !55, line: 188, baseType: !375, size: 64, align: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !55, line: 189, baseType: !375, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !55, line: 191, baseType: !121, size: 64, align: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !377, file: !55, line: 193, baseType: !447, size: 64, align: 64, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !55, line: 65, baseType: !449)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !55, line: 65, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !55, line: 39, baseType: !54)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !336, file: !43, line: 151, baseType: !452, size: 64, align: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !328}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !336, file: !43, line: 152, baseType: !456, size: 64, align: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!342, !328, !459, !345}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !43, line: 95, baseType: !63)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !336, file: !43, line: 155, baseType: !461, size: 64, align: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!459, !328}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !330, file: !43, line: 103, baseType: !256, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !330, file: !43, line: 104, baseType: !466, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !467, line: 77, baseType: !468)
!467 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !467, line: 77, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !330, file: !43, line: 105, baseType: !466, size: 64, align: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !330, file: !43, line: 106, baseType: !256, size: 64, align: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !330, file: !43, line: 107, baseType: !241, size: 32, align: 32, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !330, file: !43, line: 109, baseType: !343, size: 64, align: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !330, file: !43, line: 110, baseType: !475, size: 64, align: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !477, line: 39, baseType: !478)
!477 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !477, line: 41, size: 192, align: 64, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !478, file: !477, line: 43, baseType: !256, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !478, file: !477, line: 44, baseType: !343, size: 64, align: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !478, file: !477, line: 45, baseType: !343, size: 64, align: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !330, file: !43, line: 111, baseType: !475, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !330, file: !43, line: 112, baseType: !475, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !330, file: !43, line: 113, baseType: !486, size: 48, align: 8, offset: 704)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 48, align: 8, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 6)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !330, file: !43, line: 117, baseType: !241, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !330, file: !43, line: 118, baseType: !241, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !330, file: !43, line: 119, baseType: !241, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !330, file: !43, line: 120, baseType: !241, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !330, file: !43, line: 121, baseType: !241, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !330, file: !43, line: 122, baseType: !241, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !330, file: !43, line: 124, baseType: !112, size: 64, align: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !330, file: !43, line: 125, baseType: !112, size: 64, align: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !214, file: !96, line: 63, baseType: !117, size: 32, align: 32, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !214, file: !96, line: 64, baseType: !117, size: 32, align: 32, offset: 544)
!499 = !DILocation(line: 61, column: 14, scope: !208)
!500 = !DILocalVariable(name: "session_file", scope: !208, file: !120, line: 62, type: !121)
!501 = !DILocation(line: 62, column: 8, scope: !208)
!502 = !DILocalVariable(name: "str", scope: !208, file: !120, line: 62, type: !121)
!503 = !DILocation(line: 62, column: 23, scope: !208)
!504 = !DILocalVariable(name: "binary", scope: !208, file: !120, line: 63, type: !121)
!505 = !DILocation(line: 63, column: 8, scope: !208)
!506 = !DILocation(line: 65, column: 7, scope: !507)
!507 = distinct !DILexicalBlock(scope: !208, file: !120, line: 65, column: 6)
!508 = !DILocation(line: 65, column: 6, scope: !507)
!509 = !DILocation(line: 65, column: 12, scope: !507)
!510 = !DILocation(line: 65, column: 6, scope: !208)
!511 = !DILocation(line: 66, column: 10, scope: !507)
!512 = !DILocation(line: 66, column: 8, scope: !507)
!513 = !DILocation(line: 66, column: 3, scope: !507)
!514 = !DILocation(line: 68, column: 39, scope: !515)
!515 = distinct !DILexicalBlock(scope: !208, file: !120, line: 68, column: 6)
!516 = !DILocation(line: 68, column: 16, scope: !515)
!517 = !DILocation(line: 68, column: 14, scope: !515)
!518 = !DILocation(line: 68, column: 46, scope: !515)
!519 = !DILocation(line: 68, column: 6, scope: !208)
!520 = !DILocation(line: 69, column: 3, scope: !515)
!521 = distinct !{!521, !520}
!522 = !DILocation(line: 69, column: 8, scope: !523)
!523 = !DILexicalBlockFile(scope: !524, file: !120, discriminator: 1)
!524 = distinct !DILexicalBlock(scope: !515, file: !120, line: 69, column: 6)
!525 = !DILocation(line: 69, column: 90, scope: !526)
!526 = !DILexicalBlockFile(scope: !523, file: !120, discriminator: 3)
!527 = !DILocation(line: 69, column: 105, scope: !523)
!528 = !DILocation(line: 69, column: 113, scope: !529)
!529 = !DILexicalBlockFile(scope: !524, file: !120, discriminator: 2)
!530 = !DILocation(line: 72, column: 54, scope: !208)
!531 = !DILocation(line: 72, column: 24, scope: !532)
!532 = !DILexicalBlockFile(scope: !208, file: !120, discriminator: 1)
!533 = !DILocation(line: 72, column: 22, scope: !208)
!534 = !DILocation(line: 73, column: 24, scope: !208)
!535 = !DILocation(line: 73, column: 12, scope: !208)
!536 = !DILocation(line: 73, column: 10, scope: !208)
!537 = !DILocation(line: 74, column: 16, scope: !208)
!538 = !DILocation(line: 74, column: 9, scope: !208)
!539 = !DILocation(line: 76, column: 33, scope: !208)
!540 = !DILocation(line: 76, column: 2, scope: !208)
!541 = !DILocation(line: 77, column: 22, scope: !208)
!542 = !DILocation(line: 77, column: 9, scope: !208)
!543 = !DILocation(line: 78, column: 22, scope: !208)
!544 = !DILocation(line: 78, column: 9, scope: !208)
!545 = !DILocation(line: 83, column: 10, scope: !208)
!546 = !DILocation(line: 83, column: 18, scope: !208)
!547 = !DILocation(line: 83, column: 32, scope: !208)
!548 = !DILocation(line: 83, column: 49, scope: !532)
!549 = !DILocation(line: 82, column: 8, scope: !208)
!550 = !DILocation(line: 82, column: 6, scope: !208)
!551 = !DILocation(line: 84, column: 9, scope: !208)
!552 = !DILocation(line: 84, column: 2, scope: !208)
!553 = !DILocation(line: 85, column: 9, scope: !208)
!554 = !DILocation(line: 85, column: 2, scope: !208)
!555 = !DILocation(line: 86, column: 35, scope: !208)
!556 = !DILocation(line: 86, column: 24, scope: !208)
!557 = !DILocation(line: 86, column: 22, scope: !208)
!558 = !DILocation(line: 87, column: 16, scope: !208)
!559 = !DILocation(line: 87, column: 9, scope: !208)
!560 = !DILocation(line: 89, column: 2, scope: !208)
!561 = !DILocation(line: 90, column: 1, scope: !208)
!562 = !DILocation(line: 90, column: 1, scope: !532)
!563 = distinct !DISubprogram(name: "sig_session_save", scope: !120, file: !120, line: 276, type: !564, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !212}
!566 = !DILocalVariable(name: "config", arg: 1, scope: !563, file: !120, line: 276, type: !212)
!567 = !DILocation(line: 276, column: 42, scope: !563)
!568 = !DILocalVariable(name: "node", scope: !563, file: !120, line: 278, type: !221)
!569 = !DILocation(line: 278, column: 15, scope: !563)
!570 = !DILocalVariable(name: "tmp", scope: !563, file: !120, line: 279, type: !436)
!571 = !DILocation(line: 279, column: 10, scope: !563)
!572 = !DILocalVariable(name: "str", scope: !563, file: !120, line: 280, type: !475)
!573 = !DILocation(line: 280, column: 18, scope: !563)
!574 = !DILocation(line: 283, column: 30, scope: !563)
!575 = !DILocation(line: 283, column: 9, scope: !563)
!576 = !DILocation(line: 283, column: 7, scope: !563)
!577 = !DILocation(line: 284, column: 2, scope: !563)
!578 = !DILocation(line: 284, column: 9, scope: !579)
!579 = !DILexicalBlockFile(scope: !563, file: !120, discriminator: 1)
!580 = !DILocation(line: 284, column: 17, scope: !579)
!581 = !DILocation(line: 284, column: 2, scope: !579)
!582 = !DILocation(line: 285, column: 23, scope: !563)
!583 = !DILocation(line: 285, column: 32, scope: !563)
!584 = !DILocation(line: 285, column: 38, scope: !563)
!585 = !DILocation(line: 285, column: 46, scope: !563)
!586 = !DILocation(line: 285, column: 3, scope: !563)
!587 = !DILocation(line: 284, column: 2, scope: !588)
!588 = !DILexicalBlockFile(scope: !563, file: !120, discriminator: 2)
!589 = distinct !{!589, !577}
!590 = !DILocation(line: 288, column: 15, scope: !563)
!591 = !DILocation(line: 288, column: 13, scope: !563)
!592 = !DILocation(line: 289, column: 13, scope: !593)
!593 = distinct !DILexicalBlock(scope: !563, file: !120, line: 289, column: 2)
!594 = !DILocation(line: 289, column: 11, scope: !593)
!595 = !DILocation(line: 289, column: 7, scope: !593)
!596 = !DILocation(line: 289, column: 33, scope: !597)
!597 = !DILexicalBlockFile(scope: !598, file: !120, discriminator: 1)
!598 = distinct !DILexicalBlock(scope: !593, file: !120, line: 289, column: 2)
!599 = !DILocation(line: 289, column: 37, scope: !597)
!600 = !DILocation(line: 289, column: 2, scope: !597)
!601 = !DILocation(line: 290, column: 40, scope: !598)
!602 = !DILocation(line: 290, column: 69, scope: !598)
!603 = !DILocation(line: 290, column: 74, scope: !598)
!604 = !DILocation(line: 290, column: 60, scope: !598)
!605 = !DILocation(line: 290, column: 53, scope: !598)
!606 = !DILocation(line: 290, column: 17, scope: !598)
!607 = !DILocation(line: 289, column: 51, scope: !608)
!608 = !DILexicalBlockFile(scope: !598, file: !120, discriminator: 2)
!609 = !DILocation(line: 289, column: 56, scope: !608)
!610 = !DILocation(line: 289, column: 49, scope: !608)
!611 = !DILocation(line: 289, column: 2, scope: !608)
!612 = distinct !{!612, !613}
!613 = !DILocation(line: 289, column: 2, scope: !563)
!614 = !DILocation(line: 291, column: 29, scope: !563)
!615 = !DILocation(line: 291, column: 37, scope: !563)
!616 = !DILocation(line: 291, column: 45, scope: !563)
!617 = !DILocation(line: 291, column: 63, scope: !563)
!618 = !DILocation(line: 291, column: 68, scope: !563)
!619 = !DILocation(line: 291, column: 9, scope: !563)
!620 = !DILocation(line: 292, column: 23, scope: !563)
!621 = !DILocation(line: 292, column: 9, scope: !563)
!622 = !DILocation(line: 293, column: 1, scope: !563)
!623 = distinct !DISubprogram(name: "sig_session_restore", scope: !120, file: !120, line: 295, type: !564, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!624 = !DILocalVariable(name: "config", arg: 1, scope: !623, file: !120, line: 295, type: !212)
!625 = !DILocation(line: 295, column: 45, scope: !623)
!626 = !DILocalVariable(name: "node", scope: !623, file: !120, line: 297, type: !221)
!627 = !DILocation(line: 297, column: 15, scope: !623)
!628 = !DILocalVariable(name: "tmp", scope: !623, file: !120, line: 298, type: !436)
!629 = !DILocation(line: 298, column: 17, scope: !623)
!630 = !DILocalVariable(name: "pids", scope: !623, file: !120, line: 299, type: !147)
!631 = !DILocation(line: 299, column: 16, scope: !623)
!632 = !DILocalVariable(name: "pid", scope: !623, file: !120, line: 299, type: !147)
!633 = !DILocation(line: 299, column: 24, scope: !623)
!634 = !DILocation(line: 302, column: 30, scope: !623)
!635 = !DILocation(line: 302, column: 9, scope: !623)
!636 = !DILocation(line: 302, column: 7, scope: !623)
!637 = !DILocation(line: 303, column: 6, scope: !638)
!638 = distinct !DILexicalBlock(scope: !623, file: !120, line: 303, column: 6)
!639 = !DILocation(line: 303, column: 11, scope: !638)
!640 = !DILocation(line: 303, column: 6, scope: !623)
!641 = !DILocation(line: 304, column: 27, scope: !642)
!642 = distinct !DILexicalBlock(scope: !638, file: !120, line: 303, column: 19)
!643 = !DILocation(line: 304, column: 33, scope: !642)
!644 = !DILocation(line: 304, column: 9, scope: !642)
!645 = !DILocation(line: 304, column: 7, scope: !642)
!646 = !DILocation(line: 305, column: 3, scope: !642)
!647 = !DILocation(line: 305, column: 10, scope: !648)
!648 = !DILexicalBlockFile(scope: !649, file: !120, discriminator: 1)
!649 = distinct !DILexicalBlock(scope: !650, file: !120, line: 305, column: 3)
!650 = distinct !DILexicalBlock(scope: !642, file: !120, line: 305, column: 3)
!651 = !DILocation(line: 305, column: 14, scope: !648)
!652 = !DILocation(line: 305, column: 3, scope: !648)
!653 = !DILocation(line: 306, column: 27, scope: !649)
!654 = !DILocation(line: 306, column: 32, scope: !649)
!655 = !DILocation(line: 306, column: 4, scope: !649)
!656 = !DILocation(line: 305, column: 45, scope: !657)
!657 = !DILexicalBlockFile(scope: !649, file: !120, discriminator: 2)
!658 = !DILocation(line: 305, column: 28, scope: !657)
!659 = !DILocation(line: 305, column: 26, scope: !657)
!660 = !DILocation(line: 305, column: 3, scope: !657)
!661 = distinct !{!661, !646}
!662 = !DILocation(line: 307, column: 2, scope: !642)
!663 = !DILocation(line: 310, column: 40, scope: !623)
!664 = !DILocation(line: 310, column: 48, scope: !623)
!665 = !DILocation(line: 310, column: 20, scope: !623)
!666 = !DILocation(line: 310, column: 9, scope: !667)
!667 = !DILexicalBlockFile(scope: !623, file: !120, discriminator: 1)
!668 = !DILocation(line: 310, column: 7, scope: !623)
!669 = !DILocation(line: 311, column: 13, scope: !670)
!670 = distinct !DILexicalBlock(scope: !623, file: !120, line: 311, column: 2)
!671 = !DILocation(line: 311, column: 11, scope: !670)
!672 = !DILocation(line: 311, column: 7, scope: !670)
!673 = !DILocation(line: 311, column: 20, scope: !674)
!674 = !DILexicalBlockFile(scope: !675, file: !120, discriminator: 1)
!675 = distinct !DILexicalBlock(scope: !670, file: !120, line: 311, column: 2)
!676 = !DILocation(line: 311, column: 19, scope: !674)
!677 = !DILocation(line: 311, column: 24, scope: !674)
!678 = !DILocation(line: 311, column: 2, scope: !674)
!679 = !DILocation(line: 312, column: 35, scope: !675)
!680 = !DILocation(line: 312, column: 34, scope: !675)
!681 = !DILocation(line: 312, column: 29, scope: !675)
!682 = !DILocation(line: 312, column: 17, scope: !674)
!683 = !DILocation(line: 312, column: 17, scope: !675)
!684 = !DILocation(line: 311, column: 35, scope: !685)
!685 = !DILexicalBlockFile(scope: !675, file: !120, discriminator: 2)
!686 = !DILocation(line: 311, column: 2, scope: !685)
!687 = distinct !{!687, !688}
!688 = !DILocation(line: 311, column: 2, scope: !623)
!689 = !DILocation(line: 313, column: 20, scope: !623)
!690 = !DILocation(line: 313, column: 9, scope: !623)
!691 = !DILocation(line: 314, column: 1, scope: !623)
!692 = distinct !DISubprogram(name: "session_save_server_channels", scope: !120, file: !120, line: 134, type: !693, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !695, !212, !221}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !697, line: 107, baseType: !698)
!697 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !699, line: 30, size: 2240, align: 64, elements: !700)
!699 = !DIFile(filename: "servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!700 = !{!701, !703, !704, !705, !779, !784, !785, !786, !787, !788, !789, !790, !791, !792, !809, !810, !812, !813, !814, !818, !819, !820, !821, !822, !823, !824, !825, !826, !832, !833, !834, !835, !836, !840, !844, !848, !852, !856, !860, !937, !944, !948}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !698, file: !702, line: 3, baseType: !117, size: 32, align: 32)
!702 = !DIFile(filename: "server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !698, file: !702, line: 4, baseType: !117, size: 32, align: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !698, file: !702, line: 6, baseType: !117, size: 32, align: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !698, file: !702, line: 8, baseType: !706, size: 64, align: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !697, line: 113, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !699, line: 25, size: 1920, align: 64, elements: !709)
!709 = !{!710, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !711, line: 3, baseType: !117, size: 32, align: 32)
!711 = !DIFile(filename: "server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !708, file: !711, line: 4, baseType: !117, size: 32, align: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !708, file: !711, line: 6, baseType: !117, size: 32, align: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !708, file: !711, line: 9, baseType: !121, size: 64, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !708, file: !711, line: 10, baseType: !117, size: 32, align: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !708, file: !711, line: 11, baseType: !121, size: 64, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !708, file: !711, line: 11, baseType: !121, size: 64, align: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !708, file: !711, line: 11, baseType: !121, size: 64, align: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !708, file: !711, line: 13, baseType: !720, size: 16, align: 16, offset: 448)
!720 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !708, file: !711, line: 14, baseType: !121, size: 64, align: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !708, file: !711, line: 15, baseType: !121, size: 64, align: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !708, file: !711, line: 16, baseType: !117, size: 32, align: 32, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !708, file: !711, line: 17, baseType: !121, size: 64, align: 64, offset: 704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !708, file: !711, line: 19, baseType: !726, size: 64, align: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !697, line: 99, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !729, line: 22, size: 160, align: 32, elements: !730)
!729 = !DIFile(filename: "network.h", directory: "/home/lichi/Desktop/irssi/task1")
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !728, file: !729, line: 23, baseType: !720, size: 16, align: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !728, file: !729, line: 24, baseType: !733, size: 128, align: 32, offset: 32)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !734, line: 211, size: 128, align: 32, elements: !735)
!734 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !733, file: !734, line: 220, baseType: !737, size: 128, align: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !734, line: 213, size: 128, align: 32, elements: !738)
!738 = !{!739, !745, !750}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !737, file: !734, line: 215, baseType: !740, size: 128, align: 8)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 128, align: 8, elements: !743)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !742, line: 48, baseType: !307)
!742 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!743 = !{!744}
!744 = !DISubrange(count: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !737, file: !734, line: 217, baseType: !746, size: 128, align: 16)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 128, align: 16, elements: !748)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !742, line: 49, baseType: !720)
!748 = !{!749}
!749 = !DISubrange(count: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !737, file: !734, line: 218, baseType: !751, size: 128, align: 32)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, align: 32, elements: !753)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !742, line: 51, baseType: !242)
!753 = !{!754}
!754 = !DISubrange(count: 4)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !708, file: !711, line: 19, baseType: !726, size: 64, align: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !708, file: !711, line: 21, baseType: !121, size: 64, align: 64, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !708, file: !711, line: 22, baseType: !121, size: 64, align: 64, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !708, file: !711, line: 23, baseType: !121, size: 64, align: 64, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !708, file: !711, line: 24, baseType: !121, size: 64, align: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !708, file: !711, line: 26, baseType: !121, size: 64, align: 64, offset: 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !708, file: !711, line: 27, baseType: !121, size: 64, align: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !708, file: !711, line: 28, baseType: !121, size: 64, align: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !708, file: !711, line: 29, baseType: !121, size: 64, align: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !708, file: !711, line: 30, baseType: !121, size: 64, align: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !708, file: !711, line: 31, baseType: !121, size: 64, align: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !708, file: !711, line: 32, baseType: !121, size: 64, align: 64, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !708, file: !711, line: 33, baseType: !121, size: 64, align: 64, offset: 1600)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !708, file: !711, line: 35, baseType: !328, size: 64, align: 64, offset: 1664)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !708, file: !711, line: 38, baseType: !242, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !708, file: !711, line: 39, baseType: !242, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !708, file: !711, line: 40, baseType: !242, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !708, file: !711, line: 41, baseType: !242, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !708, file: !711, line: 42, baseType: !242, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !708, file: !711, line: 43, baseType: !242, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !708, file: !711, line: 44, baseType: !242, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !708, file: !711, line: 45, baseType: !242, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !708, file: !711, line: 46, baseType: !121, size: 64, align: 64, offset: 1792)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !708, file: !711, line: 47, baseType: !121, size: 64, align: 64, offset: 1856)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !698, file: !702, line: 9, baseType: !780, size: 64, align: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !781, line: 75, baseType: !782)
!781 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !783, line: 139, baseType: !115)
!783 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!784 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !698, file: !702, line: 10, baseType: !780, size: 64, align: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !698, file: !702, line: 12, baseType: !121, size: 64, align: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !698, file: !702, line: 13, baseType: !121, size: 64, align: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !698, file: !702, line: 15, baseType: !242, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !698, file: !702, line: 16, baseType: !242, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !698, file: !702, line: 17, baseType: !242, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !698, file: !702, line: 18, baseType: !242, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !698, file: !702, line: 19, baseType: !242, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !698, file: !702, line: 21, baseType: !793, size: 64, align: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !697, line: 102, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !796, line: 7, size: 384, align: 64, elements: !797)
!796 = !DIFile(filename: "net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!797 = !{!798, !799, !803, !804, !805, !806, !807, !808}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !795, file: !796, line: 8, baseType: !328, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !795, file: !796, line: 9, baseType: !800, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !697, line: 101, baseType: !802)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !697, line: 101, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !795, file: !796, line: 11, baseType: !117, size: 32, align: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !795, file: !796, line: 12, baseType: !117, size: 32, align: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !795, file: !796, line: 13, baseType: !117, size: 32, align: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !795, file: !796, line: 14, baseType: !121, size: 64, align: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !795, file: !796, line: 15, baseType: !117, size: 32, align: 32, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !795, file: !796, line: 16, baseType: !242, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !698, file: !702, line: 22, baseType: !117, size: 32, align: 32, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !698, file: !702, line: 25, baseType: !811, size: 128, align: 64, offset: 640)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 128, align: 64, elements: !143)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !698, file: !702, line: 26, baseType: !117, size: 32, align: 32, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !698, file: !702, line: 27, baseType: !117, size: 32, align: 32, offset: 800)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !698, file: !702, line: 29, baseType: !815, size: 64, align: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !697, line: 103, baseType: !817)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !697, line: 103, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !698, file: !702, line: 30, baseType: !229, size: 64, align: 64, offset: 896)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !698, file: !702, line: 32, baseType: !121, size: 64, align: 64, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !698, file: !702, line: 33, baseType: !121, size: 64, align: 64, offset: 1024)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !698, file: !702, line: 34, baseType: !121, size: 64, align: 64, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !698, file: !702, line: 35, baseType: !242, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !698, file: !702, line: 36, baseType: !242, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !698, file: !702, line: 37, baseType: !242, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !698, file: !702, line: 38, baseType: !242, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !698, file: !702, line: 40, baseType: !827, size: 128, align: 64, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !113, line: 504, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !113, line: 506, size: 128, align: 64, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !828, file: !113, line: 508, baseType: !114, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !828, file: !113, line: 509, baseType: !114, size: 64, align: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !698, file: !702, line: 41, baseType: !780, size: 64, align: 64, offset: 1344)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !698, file: !702, line: 42, baseType: !117, size: 32, align: 32, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !698, file: !702, line: 44, baseType: !436, size: 64, align: 64, offset: 1472)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !698, file: !702, line: 45, baseType: !436, size: 64, align: 64, offset: 1536)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !698, file: !702, line: 53, baseType: !837, size: 64, align: 64, offset: 1600)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !695, !154, !117}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !698, file: !702, line: 55, baseType: !841, size: 64, align: 64, offset: 1664)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64, align: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!117, !695, !122}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !698, file: !702, line: 57, baseType: !845, size: 64, align: 64, offset: 1728)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!117, !695, !154}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !698, file: !702, line: 60, baseType: !849, size: 64, align: 64, offset: 1792)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!154, !695}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !698, file: !702, line: 62, baseType: !853, size: 64, align: 64, offset: 1856)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !695, !154, !154, !117}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !698, file: !702, line: 65, baseType: !857, size: 64, align: 64, offset: 1920)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64, align: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!147, !695, !154, !154}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !698, file: !702, line: 69, baseType: !861, size: 64, align: 64, offset: 1984)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !695, !154}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !697, line: 109, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !867, line: 15, size: 1408, align: 64, elements: !868)
!867 = !DIFile(filename: "channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!868 = !{!869, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !887, !891, !893, !894, !895, !896, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !866, file: !870, line: 3, baseType: !117, size: 32, align: 32)
!870 = !DIFile(filename: "window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!871 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !866, file: !870, line: 4, baseType: !117, size: 32, align: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !866, file: !870, line: 5, baseType: !229, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !866, file: !870, line: 7, baseType: !104, size: 64, align: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !866, file: !870, line: 8, baseType: !695, size: 64, align: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !866, file: !870, line: 9, baseType: !121, size: 64, align: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !870, line: 10, baseType: !121, size: 64, align: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !866, file: !870, line: 11, baseType: !780, size: 64, align: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !866, file: !870, line: 12, baseType: !117, size: 32, align: 32, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !866, file: !870, line: 13, baseType: !121, size: 64, align: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !866, file: !870, line: 15, baseType: !881, size: 64, align: 64, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64, align: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !697, line: 108, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !697, line: 108, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !866, file: !870, line: 17, baseType: !888, size: 64, align: 64, offset: 640)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!154, !884}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !866, file: !892, line: 5, baseType: !121, size: 64, align: 64, offset: 704)
!892 = !DIFile(filename: "channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!893 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !866, file: !892, line: 6, baseType: !121, size: 64, align: 64, offset: 768)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !866, file: !892, line: 7, baseType: !780, size: 64, align: 64, offset: 832)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !866, file: !892, line: 9, baseType: !229, size: 64, align: 64, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !866, file: !892, line: 10, baseType: !897, size: 64, align: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !697, line: 111, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !900, line: 13, size: 576, align: 64, elements: !901)
!900 = !DIFile(filename: "nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!901 = !{!902, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !918, !919}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !903, line: 3, baseType: !117, size: 32, align: 32)
!903 = !DIFile(filename: "nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!904 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !899, file: !903, line: 4, baseType: !117, size: 32, align: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !899, file: !903, line: 6, baseType: !780, size: 64, align: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !899, file: !903, line: 8, baseType: !121, size: 64, align: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !899, file: !903, line: 9, baseType: !121, size: 64, align: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !899, file: !903, line: 10, baseType: !121, size: 64, align: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !899, file: !903, line: 11, baseType: !117, size: 32, align: 32, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !899, file: !903, line: 14, baseType: !242, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !899, file: !903, line: 15, baseType: !242, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !899, file: !903, line: 18, baseType: !242, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !899, file: !903, line: 19, baseType: !242, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !899, file: !903, line: 20, baseType: !242, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !899, file: !903, line: 21, baseType: !242, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !899, file: !903, line: 22, baseType: !917, size: 64, align: 8, offset: 360)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 64, align: 8, elements: !748)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !899, file: !903, line: 26, baseType: !104, size: 64, align: 64, offset: 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !899, file: !903, line: 28, baseType: !897, size: 64, align: 64, offset: 512)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !866, file: !892, line: 12, baseType: !242, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !866, file: !892, line: 13, baseType: !121, size: 64, align: 64, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !866, file: !892, line: 14, baseType: !117, size: 32, align: 32, offset: 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !866, file: !892, line: 15, baseType: !121, size: 64, align: 64, offset: 1216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !866, file: !892, line: 17, baseType: !242, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !866, file: !892, line: 18, baseType: !242, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !866, file: !892, line: 19, baseType: !242, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !866, file: !892, line: 20, baseType: !242, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !866, file: !892, line: 22, baseType: !242, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !866, file: !892, line: 23, baseType: !242, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !866, file: !892, line: 24, baseType: !242, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !866, file: !892, line: 25, baseType: !242, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !866, file: !892, line: 26, baseType: !242, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !866, file: !892, line: 31, baseType: !934, size: 64, align: 64, offset: 1344)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!121, !864}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !698, file: !702, line: 70, baseType: !938, size: 64, align: 64, offset: 2048)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !695, !154}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !697, line: 110, baseType: !943)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !697, line: 110, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !698, file: !702, line: 71, baseType: !945, size: 64, align: 64, offset: 2112)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!117, !154, !154}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !698, file: !702, line: 73, baseType: !945, size: 64, align: 64, offset: 2176)
!949 = !DILocalVariable(name: "server", arg: 1, scope: !692, file: !120, line: 134, type: !695)
!950 = !DILocation(line: 134, column: 54, scope: !692)
!951 = !DILocalVariable(name: "config", arg: 2, scope: !692, file: !120, line: 135, type: !212)
!952 = !DILocation(line: 135, column: 19, scope: !692)
!953 = !DILocalVariable(name: "node", arg: 3, scope: !692, file: !120, line: 136, type: !221)
!954 = !DILocation(line: 136, column: 20, scope: !692)
!955 = !DILocalVariable(name: "tmp", scope: !692, file: !120, line: 138, type: !436)
!956 = !DILocation(line: 138, column: 10, scope: !692)
!957 = !DILocation(line: 141, column: 29, scope: !692)
!958 = !DILocation(line: 141, column: 37, scope: !692)
!959 = !DILocation(line: 141, column: 9, scope: !692)
!960 = !DILocation(line: 141, column: 7, scope: !692)
!961 = !DILocation(line: 142, column: 13, scope: !962)
!962 = distinct !DILexicalBlock(scope: !692, file: !120, line: 142, column: 2)
!963 = !DILocation(line: 142, column: 21, scope: !962)
!964 = !DILocation(line: 142, column: 11, scope: !962)
!965 = !DILocation(line: 142, column: 7, scope: !962)
!966 = !DILocation(line: 142, column: 31, scope: !967)
!967 = !DILexicalBlockFile(scope: !968, file: !120, discriminator: 1)
!968 = distinct !DILexicalBlock(scope: !962, file: !120, line: 142, column: 2)
!969 = !DILocation(line: 142, column: 35, scope: !967)
!970 = !DILocation(line: 142, column: 2, scope: !967)
!971 = !DILocation(line: 143, column: 24, scope: !968)
!972 = !DILocation(line: 143, column: 29, scope: !968)
!973 = !DILocation(line: 143, column: 35, scope: !968)
!974 = !DILocation(line: 143, column: 43, scope: !968)
!975 = !DILocation(line: 143, column: 3, scope: !968)
!976 = !DILocation(line: 142, column: 49, scope: !977)
!977 = !DILexicalBlockFile(scope: !968, file: !120, discriminator: 2)
!978 = !DILocation(line: 142, column: 54, scope: !977)
!979 = !DILocation(line: 142, column: 47, scope: !977)
!980 = !DILocation(line: 142, column: 2, scope: !977)
!981 = distinct !{!981, !982}
!982 = !DILocation(line: 142, column: 2, scope: !692)
!983 = !DILocation(line: 144, column: 1, scope: !692)
!984 = distinct !DISubprogram(name: "session_restore_server_channels", scope: !120, file: !120, line: 222, type: !985, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !695, !221}
!987 = !DILocalVariable(name: "server", arg: 1, scope: !984, file: !120, line: 222, type: !695)
!988 = !DILocation(line: 222, column: 57, scope: !984)
!989 = !DILocalVariable(name: "node", arg: 2, scope: !984, file: !120, line: 223, type: !221)
!990 = !DILocation(line: 223, column: 23, scope: !984)
!991 = !DILocalVariable(name: "tmp", scope: !984, file: !120, line: 225, type: !436)
!992 = !DILocation(line: 225, column: 10, scope: !984)
!993 = !DILocation(line: 228, column: 34, scope: !984)
!994 = !DILocation(line: 228, column: 9, scope: !984)
!995 = !DILocation(line: 228, column: 7, scope: !984)
!996 = !DILocation(line: 229, column: 6, scope: !997)
!997 = distinct !DILexicalBlock(scope: !984, file: !120, line: 229, column: 6)
!998 = !DILocation(line: 229, column: 11, scope: !997)
!999 = !DILocation(line: 229, column: 18, scope: !997)
!1000 = !DILocation(line: 229, column: 21, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !997, file: !120, discriminator: 1)
!1002 = !DILocation(line: 229, column: 27, scope: !1001)
!1003 = !DILocation(line: 229, column: 32, scope: !1001)
!1004 = !DILocation(line: 229, column: 6, scope: !1001)
!1005 = !DILocation(line: 230, column: 27, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !997, file: !120, line: 229, column: 51)
!1007 = !DILocation(line: 230, column: 33, scope: !1006)
!1008 = !DILocation(line: 230, column: 9, scope: !1006)
!1009 = !DILocation(line: 230, column: 7, scope: !1006)
!1010 = !DILocation(line: 231, column: 3, scope: !1006)
!1011 = !DILocation(line: 231, column: 10, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !1013, file: !120, discriminator: 1)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !120, line: 231, column: 3)
!1014 = distinct !DILexicalBlock(scope: !1006, file: !120, line: 231, column: 3)
!1015 = !DILocation(line: 231, column: 14, scope: !1012)
!1016 = !DILocation(line: 231, column: 3, scope: !1012)
!1017 = !DILocation(line: 232, column: 28, scope: !1013)
!1018 = !DILocation(line: 232, column: 36, scope: !1013)
!1019 = !DILocation(line: 232, column: 41, scope: !1013)
!1020 = !DILocation(line: 232, column: 4, scope: !1013)
!1021 = !DILocation(line: 231, column: 45, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1013, file: !120, discriminator: 2)
!1023 = !DILocation(line: 231, column: 28, scope: !1022)
!1024 = !DILocation(line: 231, column: 26, scope: !1022)
!1025 = !DILocation(line: 231, column: 3, scope: !1022)
!1026 = distinct !{!1026, !1010}
!1027 = !DILocation(line: 233, column: 2, scope: !1006)
!1028 = !DILocation(line: 234, column: 1, scope: !984)
!1029 = distinct !DISubprogram(name: "session_save_channel_nicks", scope: !120, file: !120, line: 107, type: !1030, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !864, !212, !221}
!1032 = !DILocalVariable(name: "channel", arg: 1, scope: !1029, file: !120, line: 107, type: !864)
!1033 = !DILocation(line: 107, column: 53, scope: !1029)
!1034 = !DILocalVariable(name: "config", arg: 2, scope: !1029, file: !120, line: 107, type: !212)
!1035 = !DILocation(line: 107, column: 74, scope: !1029)
!1036 = !DILocalVariable(name: "node", arg: 3, scope: !1029, file: !120, line: 108, type: !221)
!1037 = !DILocation(line: 108, column: 25, scope: !1029)
!1038 = !DILocalVariable(name: "tmp", scope: !1029, file: !120, line: 110, type: !436)
!1039 = !DILocation(line: 110, column: 10, scope: !1029)
!1040 = !DILocalVariable(name: "nicks", scope: !1029, file: !120, line: 110, type: !436)
!1041 = !DILocation(line: 110, column: 16, scope: !1029)
!1042 = !DILocation(line: 112, column: 29, scope: !1029)
!1043 = !DILocation(line: 112, column: 37, scope: !1029)
!1044 = !DILocation(line: 112, column: 9, scope: !1029)
!1045 = !DILocation(line: 112, column: 7, scope: !1029)
!1046 = !DILocation(line: 113, column: 35, scope: !1029)
!1047 = !DILocation(line: 113, column: 17, scope: !1029)
!1048 = !DILocation(line: 113, column: 15, scope: !1029)
!1049 = !DILocation(line: 114, column: 13, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1029, file: !120, line: 114, column: 2)
!1051 = !DILocation(line: 114, column: 11, scope: !1050)
!1052 = !DILocation(line: 114, column: 7, scope: !1050)
!1053 = !DILocation(line: 114, column: 20, scope: !1054)
!1054 = !DILexicalBlockFile(scope: !1055, file: !120, discriminator: 1)
!1055 = distinct !DILexicalBlock(scope: !1050, file: !120, line: 114, column: 2)
!1056 = !DILocation(line: 114, column: 24, scope: !1054)
!1057 = !DILocation(line: 114, column: 2, scope: !1054)
!1058 = !DILocation(line: 115, column: 21, scope: !1055)
!1059 = !DILocation(line: 115, column: 30, scope: !1055)
!1060 = !DILocation(line: 115, column: 35, scope: !1055)
!1061 = !DILocation(line: 115, column: 41, scope: !1055)
!1062 = !DILocation(line: 115, column: 49, scope: !1055)
!1063 = !DILocation(line: 115, column: 3, scope: !1055)
!1064 = !DILocation(line: 114, column: 38, scope: !1065)
!1065 = !DILexicalBlockFile(scope: !1055, file: !120, discriminator: 2)
!1066 = !DILocation(line: 114, column: 43, scope: !1065)
!1067 = !DILocation(line: 114, column: 36, scope: !1065)
!1068 = !DILocation(line: 114, column: 2, scope: !1065)
!1069 = distinct !{!1069, !1070}
!1070 = !DILocation(line: 114, column: 2, scope: !1029)
!1071 = !DILocation(line: 116, column: 22, scope: !1029)
!1072 = !DILocation(line: 116, column: 9, scope: !1029)
!1073 = !DILocation(line: 117, column: 1, scope: !1029)
!1074 = distinct !DISubprogram(name: "session_restore_channel_nicks", scope: !120, file: !120, line: 186, type: !1075, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !127)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !864, !221}
!1077 = !DILocalVariable(name: "channel", arg: 1, scope: !1074, file: !120, line: 186, type: !864)
!1078 = !DILocation(line: 186, column: 56, scope: !1074)
!1079 = !DILocalVariable(name: "node", arg: 2, scope: !1074, file: !120, line: 187, type: !221)
!1080 = !DILocation(line: 187, column: 21, scope: !1074)
!1081 = !DILocalVariable(name: "tmp", scope: !1074, file: !120, line: 189, type: !436)
!1082 = !DILocation(line: 189, column: 10, scope: !1074)
!1083 = !DILocation(line: 192, column: 34, scope: !1074)
!1084 = !DILocation(line: 192, column: 9, scope: !1074)
!1085 = !DILocation(line: 192, column: 7, scope: !1074)
!1086 = !DILocation(line: 193, column: 6, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1074, file: !120, line: 193, column: 6)
!1088 = !DILocation(line: 193, column: 11, scope: !1087)
!1089 = !DILocation(line: 193, column: 18, scope: !1087)
!1090 = !DILocation(line: 193, column: 21, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1087, file: !120, discriminator: 1)
!1092 = !DILocation(line: 193, column: 27, scope: !1091)
!1093 = !DILocation(line: 193, column: 32, scope: !1091)
!1094 = !DILocation(line: 193, column: 6, scope: !1091)
!1095 = !DILocation(line: 194, column: 27, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1087, file: !120, line: 193, column: 51)
!1097 = !DILocation(line: 194, column: 33, scope: !1096)
!1098 = !DILocation(line: 194, column: 9, scope: !1096)
!1099 = !DILocation(line: 194, column: 7, scope: !1096)
!1100 = !DILocation(line: 195, column: 3, scope: !1096)
!1101 = !DILocation(line: 195, column: 10, scope: !1102)
!1102 = !DILexicalBlockFile(scope: !1103, file: !120, discriminator: 1)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !120, line: 195, column: 3)
!1104 = distinct !DILexicalBlock(scope: !1096, file: !120, line: 195, column: 3)
!1105 = !DILocation(line: 195, column: 14, scope: !1102)
!1106 = !DILocation(line: 195, column: 3, scope: !1102)
!1107 = !DILocation(line: 197, column: 9, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1103, file: !120, line: 195, column: 51)
!1109 = !DILocation(line: 197, column: 18, scope: !1108)
!1110 = !DILocation(line: 197, column: 23, scope: !1108)
!1111 = !DILocation(line: 196, column: 4, scope: !1108)
!1112 = !DILocation(line: 198, column: 3, scope: !1108)
