; ModuleID = './line10-parse.o.i'
source_filename = "./line10-parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !70)
!1 = !DIFile(filename: "line10-parse.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !30, !37, !42, !51, !62}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 75, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/gscanner.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!6 = !DIEnumerator(name: "G_TOKEN_EOF", value: 0)
!7 = !DIEnumerator(name: "G_TOKEN_LEFT_PAREN", value: 40)
!8 = !DIEnumerator(name: "G_TOKEN_RIGHT_PAREN", value: 41)
!9 = !DIEnumerator(name: "G_TOKEN_LEFT_CURLY", value: 123)
!10 = !DIEnumerator(name: "G_TOKEN_RIGHT_CURLY", value: 125)
!11 = !DIEnumerator(name: "G_TOKEN_LEFT_BRACE", value: 91)
!12 = !DIEnumerator(name: "G_TOKEN_RIGHT_BRACE", value: 93)
!13 = !DIEnumerator(name: "G_TOKEN_EQUAL_SIGN", value: 61)
!14 = !DIEnumerator(name: "G_TOKEN_COMMA", value: 44)
!15 = !DIEnumerator(name: "G_TOKEN_NONE", value: 256)
!16 = !DIEnumerator(name: "G_TOKEN_ERROR", value: 257)
!17 = !DIEnumerator(name: "G_TOKEN_CHAR", value: 258)
!18 = !DIEnumerator(name: "G_TOKEN_BINARY", value: 259)
!19 = !DIEnumerator(name: "G_TOKEN_OCTAL", value: 260)
!20 = !DIEnumerator(name: "G_TOKEN_INT", value: 261)
!21 = !DIEnumerator(name: "G_TOKEN_HEX", value: 262)
!22 = !DIEnumerator(name: "G_TOKEN_FLOAT", value: 263)
!23 = !DIEnumerator(name: "G_TOKEN_STRING", value: 264)
!24 = !DIEnumerator(name: "G_TOKEN_SYMBOL", value: 265)
!25 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER", value: 266)
!26 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER_NULL", value: 267)
!27 = !DIEnumerator(name: "G_TOKEN_COMMENT_SINGLE", value: 268)
!28 = !DIEnumerator(name: "G_TOKEN_COMMENT_MULTI", value: 269)
!29 = !DIEnumerator(name: "G_TOKEN_LAST", value: 270)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 69, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!32 = !{!33, !34, !35, !36}
!33 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!34 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!35 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!36 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 77, size: 32, align: 32, elements: !38)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!40 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!41 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 31, size: 32, align: 32, elements: !44)
!43 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "G_IO_IN", value: 1)
!46 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!47 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!48 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!49 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!50 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 84, size: 32, align: 32, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61}
!53 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!54 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!55 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!56 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!57 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!58 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!59 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!60 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!61 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 4, size: 32, align: 32, elements: !64)
!63 = !DIFile(filename: "iconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!66 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!67 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!68 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!69 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!70 = !{!71, !82, !103, !176, !178, !188, !373, !380, !384, !131, !169, !154}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !4, line: 41, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !103, !175}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !4, line: 37, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !4, line: 169, size: 1152, align: 64, elements: !78)
!78 = !{!79, !83, !86, !87, !92, !97, !130, !132, !156, !157, !158, !159, !160, !161, !162, !167, !170, !171, !172, !173, !174}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !77, file: !4, line: 172, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !81, line: 77, baseType: !82)
!81 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !77, file: !4, line: 173, baseType: !84, size: 32, align: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !81, line: 55, baseType: !85)
!85 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !77, file: !4, line: 176, baseType: !84, size: 32, align: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !77, file: !4, line: 179, baseType: !88, size: 64, align: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !81, line: 46, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !77, file: !4, line: 182, baseType: !93, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !95, line: 36, baseType: !96)
!95 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !95, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !77, file: !4, line: 185, baseType: !98, size: 64, align: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !4, line: 38, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !4, line: 127, size: 320, align: 64, elements: !101)
!101 = !{!102, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !100, file: !4, line: 131, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !100, file: !4, line: 132, baseType: !103, size: 64, align: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !100, file: !4, line: 133, baseType: !103, size: 64, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !100, file: !4, line: 134, baseType: !103, size: 64, align: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !100, file: !4, line: 138, baseType: !84, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !100, file: !4, line: 143, baseType: !84, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !100, file: !4, line: 144, baseType: !84, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !100, file: !4, line: 145, baseType: !84, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !100, file: !4, line: 146, baseType: !84, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !100, file: !4, line: 147, baseType: !84, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !100, file: !4, line: 148, baseType: !84, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !100, file: !4, line: 149, baseType: !84, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !100, file: !4, line: 150, baseType: !84, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !100, file: !4, line: 151, baseType: !84, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !100, file: !4, line: 152, baseType: !84, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !100, file: !4, line: 153, baseType: !84, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !100, file: !4, line: 154, baseType: !84, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !100, file: !4, line: 155, baseType: !84, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !100, file: !4, line: 156, baseType: !84, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !100, file: !4, line: 157, baseType: !84, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !100, file: !4, line: 158, baseType: !84, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !100, file: !4, line: 159, baseType: !84, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !100, file: !4, line: 160, baseType: !84, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !100, file: !4, line: 161, baseType: !84, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !100, file: !4, line: 162, baseType: !84, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !100, file: !4, line: 163, baseType: !84, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !100, file: !4, line: 166, baseType: !84, size: 32, align: 32, offset: 288)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !77, file: !4, line: 188, baseType: !131, size: 32, align: 32, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !4, line: 109, baseType: !3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !77, file: !4, line: 189, baseType: !133, size: 64, align: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !4, line: 39, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !4, line: 111, size: 64, align: 64, elements: !135)
!135 = !{!136, !137, !138, !141, !142, !143, !146, !149, !150, !151, !152, !155}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !134, file: !4, line: 113, baseType: !80, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !134, file: !4, line: 114, baseType: !103, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !134, file: !4, line: 115, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !81, line: 54, baseType: !140)
!140 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !134, file: !4, line: 116, baseType: !139, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !134, file: !4, line: 117, baseType: !139, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !134, file: !4, line: 118, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !145, line: 52, baseType: !140)
!145 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !134, file: !4, line: 119, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !81, line: 58, baseType: !148)
!148 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !134, file: !4, line: 120, baseType: !139, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !134, file: !4, line: 121, baseType: !103, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !134, file: !4, line: 122, baseType: !103, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !134, file: !4, line: 123, baseType: !153, size: 8, align: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !81, line: 52, baseType: !154)
!154 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !134, file: !4, line: 124, baseType: !84, size: 32, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !77, file: !4, line: 190, baseType: !84, size: 32, align: 32, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !77, file: !4, line: 191, baseType: !84, size: 32, align: 32, offset: 480)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !77, file: !4, line: 194, baseType: !131, size: 32, align: 32, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !77, file: !4, line: 195, baseType: !133, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !77, file: !4, line: 196, baseType: !84, size: 32, align: 32, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !77, file: !4, line: 197, baseType: !84, size: 32, align: 32, offset: 672)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !77, file: !4, line: 201, baseType: !163, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !165, line: 37, baseType: !166)
!165 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !165, line: 37, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !77, file: !4, line: 202, baseType: !168, size: 32, align: 32, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !81, line: 49, baseType: !169)
!169 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !77, file: !4, line: 203, baseType: !88, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !77, file: !4, line: 204, baseType: !88, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !77, file: !4, line: 205, baseType: !103, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !77, file: !4, line: 206, baseType: !84, size: 32, align: 32, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !77, file: !4, line: 210, baseType: !71, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !81, line: 50, baseType: !168)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !63, line: 18, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !63, line: 49, size: 576, align: 64, elements: !181)
!181 = !{!182, !184, !185, !186, !187, !195, !196, !197, !198, !371, !372}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !180, file: !63, line: 50, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !180, file: !63, line: 51, baseType: !169, size: 32, align: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !180, file: !63, line: 52, baseType: !169, size: 32, align: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !180, file: !63, line: 54, baseType: !183, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !180, file: !63, line: 55, baseType: !188, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !63, line: 17, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !63, line: 20, size: 192, align: 64, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !63, line: 21, baseType: !169, size: 32, align: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !190, file: !63, line: 22, baseType: !183, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !190, file: !63, line: 23, baseType: !82, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !180, file: !63, line: 56, baseType: !163, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !180, file: !63, line: 57, baseType: !163, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !180, file: !63, line: 59, baseType: !75, size: 64, align: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !180, file: !63, line: 62, baseType: !199, size: 64, align: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !31, line: 41, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !31, line: 97, size: 896, align: 64, elements: !202)
!202 = !{!203, !204, !338, !339, !344, !345, !346, !347, !348, !357, !358, !359, !363, !364, !365, !366, !367, !368, !369, !370}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !201, file: !31, line: 100, baseType: !168, size: 32, align: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !201, file: !31, line: 101, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !31, line: 42, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !31, line: 131, size: 512, align: 64, elements: !208)
!208 = !{!209, !228, !232, !239, !243, !325, !329, !334}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !207, file: !31, line: 133, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !199, !103, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !31, line: 75, baseType: !30)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !145, line: 66, baseType: !140)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !219, line: 42, baseType: !220)
!219 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !219, line: 44, size: 128, align: 64, elements: !221)
!221 = !{!222, !226, !227}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !220, file: !219, line: 46, baseType: !223, size: 32, align: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !224, line: 36, baseType: !225)
!224 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !145, line: 45, baseType: !85)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !220, file: !219, line: 47, baseType: !168, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !220, file: !219, line: 48, baseType: !103, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !207, file: !31, line: 138, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!213, !199, !88, !214, !215, !216}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !207, file: !31, line: 143, baseType: !233, size: 64, align: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!213, !199, !236, !238, !216}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !145, line: 51, baseType: !237)
!237 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !31, line: 82, baseType: !37)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !207, file: !31, line: 147, baseType: !240, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!213, !199, !216}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !207, file: !31, line: 149, baseType: !244, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !199, !324}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !43, line: 64, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !43, line: 171, size: 768, align: 64, elements: !250)
!250 = !{!251, !252, !272, !301, !302, !306, !307, !308, !309, !317, !318, !319, !320}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !249, file: !43, line: 174, baseType: !80, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !249, file: !43, line: 175, baseType: !253, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !43, line: 77, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !43, line: 196, size: 192, align: 64, elements: !256)
!256 = !{!257, !261, !262}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !255, file: !43, line: 198, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !80}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !255, file: !43, line: 199, baseType: !258, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !255, file: !43, line: 200, baseType: !263, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !80, !247, !266, !271}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !43, line: 155, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!175, !80}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !249, file: !43, line: 177, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !43, line: 130, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !43, line: 214, size: 384, align: 64, elements: !277)
!277 = !{!278, !283, !287, !291, !295, !296}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !276, file: !43, line: 216, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!175, !247, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !276, file: !43, line: 218, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!175, !247}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !276, file: !43, line: 219, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!175, !247, !267, !80}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !276, file: !43, line: 222, baseType: !292, size: 64, align: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !247}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !276, file: !43, line: 226, baseType: !267, size: 64, align: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !276, file: !43, line: 227, baseType: !297, size: 64, align: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !43, line: 212, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !249, file: !43, line: 178, baseType: !84, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !249, file: !43, line: 180, baseType: !303, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !43, line: 48, baseType: !305)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !43, line: 48, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !249, file: !43, line: 182, baseType: !168, size: 32, align: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !43, line: 183, baseType: !84, size: 32, align: 32, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !249, file: !43, line: 184, baseType: !84, size: 32, align: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !249, file: !43, line: 186, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !312, line: 37, baseType: !313)
!312 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !312, line: 39, size: 128, align: 64, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !313, file: !312, line: 41, baseType: !80, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !312, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !43, line: 188, baseType: !247, size: 64, align: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !43, line: 189, baseType: !247, size: 64, align: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !43, line: 191, baseType: !183, size: 64, align: 64, offset: 640)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !249, file: !43, line: 193, baseType: !321, size: 64, align: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !43, line: 65, baseType: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !43, line: 65, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !43, line: 39, baseType: !42)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !207, file: !31, line: 151, baseType: !326, size: 64, align: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !199}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !207, file: !31, line: 152, baseType: !330, size: 64, align: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!213, !199, !333, !216}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !31, line: 95, baseType: !51)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !207, file: !31, line: 155, baseType: !335, size: 64, align: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!333, !199}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !201, file: !31, line: 103, baseType: !103, size: 64, align: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !201, file: !31, line: 104, baseType: !340, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !341, line: 77, baseType: !342)
!341 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !341, line: 77, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !201, file: !31, line: 105, baseType: !340, size: 64, align: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !201, file: !31, line: 106, baseType: !103, size: 64, align: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !201, file: !31, line: 107, baseType: !84, size: 32, align: 32, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !201, file: !31, line: 109, baseType: !214, size: 64, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !201, file: !31, line: 110, baseType: !349, size: 64, align: 64, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !351, line: 39, baseType: !352)
!351 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !351, line: 41, size: 192, align: 64, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !352, file: !351, line: 43, baseType: !103, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !352, file: !351, line: 44, baseType: !214, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !352, file: !351, line: 45, baseType: !214, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !201, file: !31, line: 111, baseType: !349, size: 64, align: 64, offset: 576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !201, file: !31, line: 112, baseType: !349, size: 64, align: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !201, file: !31, line: 113, baseType: !360, size: 48, align: 8, offset: 704)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 48, align: 8, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 6)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !201, file: !31, line: 117, baseType: !84, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !201, file: !31, line: 118, baseType: !84, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !201, file: !31, line: 119, baseType: !84, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !201, file: !31, line: 120, baseType: !84, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !201, file: !31, line: 121, baseType: !84, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !201, file: !31, line: 122, baseType: !84, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !201, file: !31, line: 124, baseType: !80, size: 64, align: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !201, file: !31, line: 125, baseType: !80, size: 64, align: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !180, file: !63, line: 63, baseType: !169, size: 32, align: 32, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !180, file: !63, line: 64, baseType: !169, size: 32, align: 32, offset: 544)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !81, line: 90, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!84, !377}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !81, line: 78, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !81, line: 80, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!168, !377, !377}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !81, line: 91, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !80, !80, !80}
!388 = !{i32 2, !"Dwarf Version", i32 4}
!389 = !{i32 2, !"Debug Info Version", i32 3}
!390 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!391 = distinct !DISubprogram(name: "config_error", scope: !392, file: !392, line: 46, type: !393, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!392 = !DIFile(filename: "parse.c", directory: "/home/lichi/Desktop/irssi/task1")
!393 = !DISubroutineType(types: !394)
!394 = !{!169, !178, !176}
!395 = !{}
!396 = !DILocalVariable(name: "rec", arg: 1, scope: !391, file: !392, line: 46, type: !178)
!397 = !DIExpression()
!398 = !DILocation(line: 46, column: 30, scope: !391)
!399 = !DILocalVariable(name: "msg", arg: 2, scope: !391, file: !392, line: 46, type: !176)
!400 = !DILocation(line: 46, column: 47, scope: !391)
!401 = !DILocation(line: 48, column: 2, scope: !391)
!402 = distinct !{!402, !401}
!403 = !DILocation(line: 48, column: 11, scope: !404)
!404 = !DILexicalBlockFile(scope: !405, file: !392, discriminator: 1)
!405 = distinct !DILexicalBlock(scope: !406, file: !392, line: 48, column: 11)
!406 = distinct !DILexicalBlock(scope: !391, file: !392, line: 48, column: 5)
!407 = !DILocation(line: 48, column: 16, scope: !404)
!408 = !DILocation(line: 48, column: 37, scope: !409)
!409 = !DILexicalBlockFile(scope: !410, file: !392, discriminator: 2)
!410 = distinct !DILexicalBlock(scope: !405, file: !392, line: 48, column: 28)
!411 = !DILocation(line: 48, column: 42, scope: !409)
!412 = !DILocation(line: 48, column: 30, scope: !409)
!413 = !DILocation(line: 48, column: 56, scope: !409)
!414 = !DILocation(line: 48, column: 61, scope: !409)
!415 = !DILocation(line: 48, column: 73, scope: !409)
!416 = !DILocation(line: 48, column: 3, scope: !409)
!417 = !DILocation(line: 48, column: 5, scope: !418)
!418 = !DILexicalBlockFile(scope: !406, file: !392, discriminator: 3)
!419 = !DILocation(line: 49, column: 29, scope: !391)
!420 = !DILocation(line: 49, column: 20, scope: !391)
!421 = !DILocation(line: 49, column: 2, scope: !391)
!422 = !DILocation(line: 49, column: 7, scope: !391)
!423 = !DILocation(line: 49, column: 18, scope: !391)
!424 = !DILocation(line: 50, column: 2, scope: !391)
!425 = distinct !DISubprogram(name: "config_parse_init", scope: !392, file: !392, line: 246, type: !426, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !395)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !178, !176}
!428 = !DILocalVariable(name: "rec", arg: 1, scope: !425, file: !392, line: 246, type: !178)
!429 = !DILocation(line: 246, column: 36, scope: !425)
!430 = !DILocalVariable(name: "name", arg: 2, scope: !425, file: !392, line: 246, type: !176)
!431 = !DILocation(line: 246, column: 53, scope: !425)
