; ModuleID = './line218-fe-common-core.o.i'
source_filename = "./line218-fe-common-core.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GOptionEntry = type { i8*, i8, i32, i32, i8*, i8*, i8* }
%struct._FORMAT_REC = type { i8*, i8*, i32, [10 x i32] }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, {}*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque

!291 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!292 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!293 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!294 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!295 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!296 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!297 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!298 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!299 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 69, size: 32, align: 32, elements: !302)
!301 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!302 = !{!303, !304, !305, !306}
!303 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!304 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!305 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!306 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!307 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 77, size: 32, align: 32, elements: !308)
!308 = !{!309, !310, !311}
!309 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!310 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!311 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !313, line: 31, size: 32, align: 32, elements: !314)
!313 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!314 = !{!315, !316, !317, !318, !319, !320}
!315 = !DIEnumerator(name: "G_IO_IN", value: 1)
!316 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!317 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!318 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!319 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!320 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 84, size: 32, align: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331}
!323 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!324 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!325 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!326 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!327 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!328 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!329 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!330 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!331 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!332 = !{!333, !340, !341, !347, !358, !359, !361, !374}
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !334, line: 9, baseType: !335)
!334 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338, !338, !338, !338, !338, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !342, line: 85, baseType: !343)
!342 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/lichi/Desktop/irssi/task1")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346}
!346 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogFunc", file: !16, line: 71, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351, !356, !351, !357}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !354, line: 46, baseType: !355)
!354 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLogLevelFlags", file: !16, line: 66, baseType: !15)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !354, line: 77, baseType: !340)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_SERVER_REC", file: !363, line: 29, baseType: !364)
!363 = !DIFile(filename: "module.h", directory: "/home/lichi/Desktop/irssi/task1")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 25, size: 64, align: 64, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lastmsgs", scope: !364, file: !363, line: 27, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !369, line: 37, baseType: !370)
!369 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !369, line: 39, size: 128, align: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !370, file: !369, line: 41, baseType: !357, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !370, file: !369, line: 42, baseType: !367, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MODULE_CHANNEL_REC", file: !363, line: 35, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 31, size: 64, align: 64, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lastmsgs", scope: !376, file: !363, line: 33, baseType: !367, size: 64, align: 64)
!379 = !{!380, !401, !403, !404, !405, !406, !407, !408, !410, !411}
!380 = distinct !DIGlobalVariable(name: "options", scope: !381, file: !382, line: 129, type: !386, isLocal: true, isDefinition: true, variable: [7 x %struct._GOptionEntry]* @fe_common_core_register_options.options)
!381 = distinct !DISubprogram(name: "fe_common_core_register_options", scope: !382, file: !382, line: 127, type: !383, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!382 = !DIFile(filename: "fe-common-core.c", directory: "/home/lichi/Desktop/irssi/task1")
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !{}
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 2688, align: 64, elements: !399)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionEntry", file: !4, line: 52, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GOptionEntry", file: !4, line: 257, size: 384, align: 64, elements: !389)
!389 = !{!390, !391, !392, !394, !396, !397, !398}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !388, file: !4, line: 259, baseType: !351, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "short_name", scope: !388, file: !4, line: 260, baseType: !353, size: 8, align: 8, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !388, file: !4, line: 261, baseType: !393, size: 32, align: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !354, line: 49, baseType: !346)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !388, file: !4, line: 263, baseType: !395, size: 32, align: 32, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "GOptionArg", file: !4, line: 129, baseType: !3)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arg_data", scope: !388, file: !4, line: 264, baseType: !357, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !388, file: !4, line: 266, baseType: !351, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arg_description", scope: !388, file: !4, line: 267, baseType: !351, size: 64, align: 64, offset: 320)
!399 = !{!400}
!400 = !DISubrange(count: 7)
!401 = distinct !DIGlobalVariable(name: "autocon_server", scope: !0, file: !382, line: 54, type: !402, isLocal: true, isDefinition: true, variable: i8** @autocon_server)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!403 = distinct !DIGlobalVariable(name: "autocon_password", scope: !0, file: !382, line: 55, type: !402, isLocal: true, isDefinition: true, variable: i8** @autocon_password)
!404 = distinct !DIGlobalVariable(name: "autocon_port", scope: !0, file: !382, line: 56, type: !346, isLocal: true, isDefinition: true, variable: i32* @autocon_port)
!405 = distinct !DIGlobalVariable(name: "no_autoconnect", scope: !0, file: !382, line: 57, type: !346, isLocal: true, isDefinition: true, variable: i32* @no_autoconnect)
!406 = distinct !DIGlobalVariable(name: "cmdline_nick", scope: !0, file: !382, line: 58, type: !402, isLocal: true, isDefinition: true, variable: i8** @cmdline_nick)
!407 = distinct !DIGlobalVariable(name: "cmdline_hostname", scope: !0, file: !382, line: 59, type: !402, isLocal: true, isDefinition: true, variable: i8** @cmdline_hostname)
!408 = distinct !DIGlobalVariable(name: "firsttime", scope: !409, file: !382, line: 378, type: !346, isLocal: true, isDefinition: true, variable: i32* @sig_setup_changed.firsttime)
!409 = distinct !DISubprogram(name: "sig_setup_changed", scope: !382, file: !382, line: 376, type: !383, isLocal: true, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!410 = distinct !DIGlobalVariable(name: "status_window", scope: !409, file: !382, line: 379, type: !346, isLocal: true, isDefinition: true, variable: i32* @sig_setup_changed.status_window)
!411 = distinct !DIGlobalVariable(name: "msgs_window", scope: !409, file: !382, line: 379, type: !346, isLocal: true, isDefinition: true, variable: i32* @sig_setup_changed.msgs_window)
!412 = !{i32 2, !"Dwarf Version", i32 4}
!413 = !{i32 2, !"Debug Info Version", i32 3}
!414 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!415 = !DILocation(line: 139, column: 17, scope: !381)
!416 = !DILocation(line: 140, column: 19, scope: !381)
!417 = !DILocation(line: 141, column: 15, scope: !381)
!418 = !DILocation(line: 142, column: 17, scope: !381)
!419 = !DILocation(line: 143, column: 15, scope: !381)
!420 = !DILocation(line: 144, column: 19, scope: !381)
!421 = !DILocation(line: 145, column: 2, scope: !381)
!422 = !DILocation(line: 146, column: 1, scope: !381)
!423 = distinct !DISubprogram(name: "fe_common_core_init", scope: !382, file: !382, line: 148, type: !383, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!424 = !DILocalVariable(name: "str", scope: !423, file: !382, line: 150, type: !359)
!425 = !DIExpression()
!426 = !DILocation(line: 150, column: 14, scope: !423)
!427 = !DILocation(line: 152, column: 2, scope: !423)
!428 = !DILocation(line: 153, column: 2, scope: !423)
!429 = !DILocation(line: 154, column: 2, scope: !423)
!430 = !DILocation(line: 156, column: 2, scope: !423)
!431 = !DILocation(line: 157, column: 2, scope: !423)
!432 = !DILocation(line: 158, column: 2, scope: !423)
!433 = !DILocation(line: 160, column: 2, scope: !423)
!434 = !DILocation(line: 161, column: 2, scope: !423)
!435 = !DILocation(line: 162, column: 2, scope: !423)
!436 = !DILocation(line: 164, column: 2, scope: !423)
!437 = !DILocation(line: 165, column: 2, scope: !423)
!438 = !DILocation(line: 166, column: 2, scope: !423)
!439 = !DILocation(line: 167, column: 75, scope: !423)
!440 = !DILocation(line: 167, column: 2, scope: !423)
!441 = !DILocation(line: 168, column: 2, scope: !423)
!442 = !DILocation(line: 169, column: 9, scope: !423)
!443 = !DILocation(line: 171, column: 2, scope: !423)
!444 = !DILocation(line: 172, column: 2, scope: !423)
!445 = !DILocation(line: 173, column: 2, scope: !423)
!446 = !DILocation(line: 174, column: 2, scope: !423)
!447 = !DILocation(line: 175, column: 2, scope: !423)
!448 = !DILocation(line: 176, column: 9, scope: !423)
!449 = !DILocation(line: 177, column: 9, scope: !423)
!450 = !DILocation(line: 178, column: 2, scope: !423)
!451 = !DILocation(line: 179, column: 2, scope: !423)
!452 = !DILocation(line: 180, column: 2, scope: !423)
!453 = !DILocation(line: 181, column: 2, scope: !423)
!454 = !DILocation(line: 182, column: 2, scope: !423)
!455 = !DILocation(line: 183, column: 2, scope: !423)
!456 = !DILocation(line: 184, column: 2, scope: !423)
!457 = !DILocation(line: 188, column: 2, scope: !423)
!458 = !DILocation(line: 189, column: 2, scope: !423)
!459 = !DILocation(line: 190, column: 2, scope: !423)
!460 = !DILocation(line: 191, column: 2, scope: !423)
!461 = !DILocation(line: 192, column: 2, scope: !423)
!462 = !DILocation(line: 193, column: 2, scope: !423)
!463 = !DILocation(line: 195, column: 9, scope: !423)
!464 = !DILocation(line: 196, column: 9, scope: !423)
!465 = !DILocation(line: 198, column: 2, scope: !423)
!466 = !DILocation(line: 199, column: 2, scope: !423)
!467 = !DILocation(line: 200, column: 2, scope: !423)
!468 = !DILocation(line: 201, column: 2, scope: !423)
!469 = !DILocation(line: 203, column: 2, scope: !423)
!470 = !DILocation(line: 205, column: 9, scope: !423)
!471 = !DILocation(line: 206, column: 9, scope: !423)
!472 = !DILocation(line: 207, column: 9, scope: !423)
!473 = !DILocation(line: 208, column: 9, scope: !423)
!474 = !DILocation(line: 210, column: 2, scope: !423)
!475 = !DILocation(line: 211, column: 1, scope: !423)
!476 = distinct !DISubprogram(name: "sig_connected", scope: !382, file: !382, line: 102, type: !477, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !481, line: 107, baseType: !482)
!481 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !483, line: 30, size: 2240, align: 64, elements: !484)
!483 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!484 = !{!485, !487, !488, !489, !705, !710, !711, !712, !713, !714, !715, !716, !717, !718, !722, !723, !727, !728, !729, !733, !738, !739, !740, !741, !742, !743, !744, !745, !752, !753, !754, !755, !756, !760, !764, !768, !772, !776, !781, !852, !879, !883}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !486, line: 3, baseType: !346, size: 32, align: 32)
!486 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !482, file: !486, line: 4, baseType: !346, size: 32, align: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !482, file: !486, line: 6, baseType: !346, size: 32, align: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !482, file: !486, line: 8, baseType: !490, size: 64, align: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !481, line: 113, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !483, line: 25, size: 1920, align: 64, elements: !493)
!493 = !{!494, !496, !497, !498, !499, !500, !501, !502, !503, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !492, file: !495, line: 3, baseType: !346, size: 32, align: 32)
!495 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !492, file: !495, line: 4, baseType: !346, size: 32, align: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !492, file: !495, line: 6, baseType: !346, size: 32, align: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !492, file: !495, line: 9, baseType: !402, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !492, file: !495, line: 10, baseType: !346, size: 32, align: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !492, file: !495, line: 11, baseType: !402, size: 64, align: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !492, file: !495, line: 11, baseType: !402, size: 64, align: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !492, file: !495, line: 11, baseType: !402, size: 64, align: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !492, file: !495, line: 13, baseType: !504, size: 16, align: 16, offset: 448)
!504 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !492, file: !495, line: 14, baseType: !402, size: 64, align: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !492, file: !495, line: 15, baseType: !402, size: 64, align: 64, offset: 576)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !492, file: !495, line: 16, baseType: !346, size: 32, align: 32, offset: 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !492, file: !495, line: 17, baseType: !402, size: 64, align: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !492, file: !495, line: 19, baseType: !510, size: 64, align: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !481, line: 99, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !481, line: 99, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !492, file: !495, line: 19, baseType: !510, size: 64, align: 64, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !492, file: !495, line: 21, baseType: !402, size: 64, align: 64, offset: 896)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !492, file: !495, line: 22, baseType: !402, size: 64, align: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !492, file: !495, line: 23, baseType: !402, size: 64, align: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !492, file: !495, line: 24, baseType: !402, size: 64, align: 64, offset: 1088)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !492, file: !495, line: 26, baseType: !402, size: 64, align: 64, offset: 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !492, file: !495, line: 27, baseType: !402, size: 64, align: 64, offset: 1216)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !492, file: !495, line: 28, baseType: !402, size: 64, align: 64, offset: 1280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !492, file: !495, line: 29, baseType: !402, size: 64, align: 64, offset: 1344)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !492, file: !495, line: 30, baseType: !402, size: 64, align: 64, offset: 1408)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !492, file: !495, line: 31, baseType: !402, size: 64, align: 64, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !492, file: !495, line: 32, baseType: !402, size: 64, align: 64, offset: 1536)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !492, file: !495, line: 33, baseType: !402, size: 64, align: 64, offset: 1600)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !492, file: !495, line: 35, baseType: !527, size: 64, align: 64, offset: 1664)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !301, line: 41, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !301, line: 97, size: 896, align: 64, elements: !530)
!530 = !{!531, !532, !662, !663, !668, !669, !670, !671, !672, !681, !682, !683, !687, !688, !689, !690, !691, !692, !693, !694}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !529, file: !301, line: 100, baseType: !393, size: 32, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !529, file: !301, line: 101, baseType: !533, size: 64, align: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !301, line: 42, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !301, line: 131, size: 512, align: 64, elements: !536)
!536 = !{!537, !559, !563, !570, !574, !649, !653, !658}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !535, file: !301, line: 133, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !527, !358, !542, !545, !546}
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !301, line: 75, baseType: !300)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !543, line: 66, baseType: !544)
!543 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!544 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !549, line: 42, baseType: !550)
!549 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !549, line: 44, size: 128, align: 64, elements: !551)
!551 = !{!552, !557, !558}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !550, file: !549, line: 46, baseType: !553, size: 32, align: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !554, line: 36, baseType: !555)
!554 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !543, line: 45, baseType: !556)
!556 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !550, file: !549, line: 47, baseType: !393, size: 32, align: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !550, file: !549, line: 48, baseType: !358, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !535, file: !301, line: 138, baseType: !560, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!541, !527, !351, !542, !545, !546}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !535, file: !301, line: 143, baseType: !564, size: 64, align: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!541, !527, !567, !569, !546}
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !543, line: 51, baseType: !568)
!568 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !301, line: 82, baseType: !307)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !535, file: !301, line: 147, baseType: !571, size: 64, align: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!541, !527, !546}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !535, file: !301, line: 149, baseType: !575, size: 64, align: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, align: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!578, !527, !648}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !313, line: 64, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !313, line: 171, size: 768, align: 64, elements: !581)
!581 = !{!582, !583, !604, !631, !633, !637, !638, !639, !640, !641, !642, !643, !644}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !580, file: !313, line: 174, baseType: !357, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !580, file: !313, line: 175, baseType: !584, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !313, line: 77, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !313, line: 196, size: 192, align: 64, elements: !587)
!587 = !{!588, !592, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !586, file: !313, line: 198, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !357}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !586, file: !313, line: 199, baseType: !589, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !586, file: !313, line: 200, baseType: !594, size: 64, align: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !357, !578, !597, !603}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !313, line: 155, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !357}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !354, line: 50, baseType: !393)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !580, file: !313, line: 177, baseType: !605, size: 64, align: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !313, line: 130, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !313, line: 214, size: 384, align: 64, elements: !609)
!609 = !{!610, !615, !619, !623, !627, !628}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !608, file: !313, line: 216, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!602, !578, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !608, file: !313, line: 218, baseType: !616, size: 64, align: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!602, !578}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !608, file: !313, line: 219, baseType: !620, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!602, !578, !598, !357}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !608, file: !313, line: 222, baseType: !624, size: 64, align: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !578}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !608, file: !313, line: 226, baseType: !598, size: 64, align: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !608, file: !313, line: 227, baseType: !629, size: 64, align: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !313, line: 212, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !580, file: !313, line: 178, baseType: !632, size: 32, align: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !354, line: 55, baseType: !556)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !580, file: !313, line: 180, baseType: !634, size: 64, align: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !313, line: 48, baseType: !636)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !313, line: 48, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !580, file: !313, line: 182, baseType: !393, size: 32, align: 32, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !313, line: 183, baseType: !632, size: 32, align: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !580, file: !313, line: 184, baseType: !632, size: 32, align: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !580, file: !313, line: 186, baseType: !367, size: 64, align: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !580, file: !313, line: 188, baseType: !578, size: 64, align: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !313, line: 189, baseType: !578, size: 64, align: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !313, line: 191, baseType: !402, size: 64, align: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !580, file: !313, line: 193, baseType: !645, size: 64, align: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !313, line: 65, baseType: !647)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !313, line: 65, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !313, line: 39, baseType: !312)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !535, file: !301, line: 151, baseType: !650, size: 64, align: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !527}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !535, file: !301, line: 152, baseType: !654, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!541, !527, !657, !546}
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !301, line: 95, baseType: !321)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !535, file: !301, line: 155, baseType: !659, size: 64, align: 64, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!657, !527}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !529, file: !301, line: 103, baseType: !358, size: 64, align: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !529, file: !301, line: 104, baseType: !664, size: 64, align: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !665, line: 77, baseType: !666)
!665 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !665, line: 77, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !529, file: !301, line: 105, baseType: !664, size: 64, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !529, file: !301, line: 106, baseType: !358, size: 64, align: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !529, file: !301, line: 107, baseType: !632, size: 32, align: 32, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !529, file: !301, line: 109, baseType: !542, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !529, file: !301, line: 110, baseType: !673, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !675, line: 39, baseType: !676)
!675 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !675, line: 41, size: 192, align: 64, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !676, file: !675, line: 43, baseType: !358, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !676, file: !675, line: 44, baseType: !542, size: 64, align: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !676, file: !675, line: 45, baseType: !542, size: 64, align: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !529, file: !301, line: 111, baseType: !673, size: 64, align: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !529, file: !301, line: 112, baseType: !673, size: 64, align: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !529, file: !301, line: 113, baseType: !684, size: 48, align: 8, offset: 704)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 48, align: 8, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 6)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !529, file: !301, line: 117, baseType: !632, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !529, file: !301, line: 118, baseType: !632, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !529, file: !301, line: 119, baseType: !632, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !529, file: !301, line: 120, baseType: !632, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !529, file: !301, line: 121, baseType: !632, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !529, file: !301, line: 122, baseType: !632, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !529, file: !301, line: 124, baseType: !357, size: 64, align: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !529, file: !301, line: 125, baseType: !357, size: 64, align: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !492, file: !495, line: 38, baseType: !556, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !492, file: !495, line: 39, baseType: !556, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !492, file: !495, line: 40, baseType: !556, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !492, file: !495, line: 41, baseType: !556, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !492, file: !495, line: 42, baseType: !556, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !492, file: !495, line: 43, baseType: !556, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !492, file: !495, line: 44, baseType: !556, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !492, file: !495, line: 45, baseType: !556, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !492, file: !495, line: 46, baseType: !402, size: 64, align: 64, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !492, file: !495, line: 47, baseType: !402, size: 64, align: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !482, file: !486, line: 9, baseType: !706, size: 64, align: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !707, line: 75, baseType: !708)
!707 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !709, line: 139, baseType: !568)
!709 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !482, file: !486, line: 10, baseType: !706, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !482, file: !486, line: 12, baseType: !402, size: 64, align: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !482, file: !486, line: 13, baseType: !402, size: 64, align: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !482, file: !486, line: 15, baseType: !556, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !482, file: !486, line: 16, baseType: !556, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !482, file: !486, line: 17, baseType: !556, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !482, file: !486, line: 18, baseType: !556, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !482, file: !486, line: 19, baseType: !556, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !482, file: !486, line: 21, baseType: !719, size: 64, align: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !481, line: 102, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !481, line: 102, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !482, file: !486, line: 22, baseType: !346, size: 32, align: 32, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !482, file: !486, line: 25, baseType: !724, size: 128, align: 64, offset: 640)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 128, align: 64, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 2)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !482, file: !486, line: 26, baseType: !346, size: 32, align: 32, offset: 768)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !482, file: !486, line: 27, baseType: !346, size: 32, align: 32, offset: 800)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !482, file: !486, line: 29, baseType: !730, size: 64, align: 64, offset: 832)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !481, line: 103, baseType: !732)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !481, line: 103, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !482, file: !486, line: 30, baseType: !734, size: 64, align: 64, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !736, line: 37, baseType: !737)
!736 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !736, line: 37, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !482, file: !486, line: 32, baseType: !402, size: 64, align: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !482, file: !486, line: 33, baseType: !402, size: 64, align: 64, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !482, file: !486, line: 34, baseType: !402, size: 64, align: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !482, file: !486, line: 35, baseType: !556, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !482, file: !486, line: 36, baseType: !556, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !482, file: !486, line: 37, baseType: !556, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !482, file: !486, line: 38, baseType: !556, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !482, file: !486, line: 40, baseType: !746, size: 128, align: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !354, line: 504, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !354, line: 506, size: 128, align: 64, elements: !748)
!748 = !{!749, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !747, file: !354, line: 508, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !354, line: 48, baseType: !568)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !747, file: !354, line: 509, baseType: !750, size: 64, align: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !482, file: !486, line: 41, baseType: !706, size: 64, align: 64, offset: 1344)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !482, file: !486, line: 42, baseType: !346, size: 32, align: 32, offset: 1408)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !482, file: !486, line: 44, baseType: !367, size: 64, align: 64, offset: 1472)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !482, file: !486, line: 45, baseType: !367, size: 64, align: 64, offset: 1536)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !482, file: !486, line: 53, baseType: !757, size: 64, align: 64, offset: 1600)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !479, !359, !346}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !482, file: !486, line: 55, baseType: !761, size: 64, align: 64, offset: 1664)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!346, !479, !355}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !482, file: !486, line: 57, baseType: !765, size: 64, align: 64, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64, align: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!346, !479, !359}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !482, file: !486, line: 60, baseType: !769, size: 64, align: 64, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!359, !479}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !482, file: !486, line: 62, baseType: !773, size: 64, align: 64, offset: 1856)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !479, !359, !359, !346}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !482, file: !486, line: 65, baseType: !777, size: 64, align: 64, offset: 1920)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!780, !479, !359, !359}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !482, file: !486, line: 69, baseType: !782, size: 64, align: 64, offset: 1984)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !479, !359}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !481, line: 109, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !788, line: 15, size: 1408, align: 64, elements: !789)
!788 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!789 = !{!790, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !825, !826, !828, !829, !830, !831, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !791, line: 3, baseType: !346, size: 32, align: 32)
!791 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !787, file: !791, line: 4, baseType: !346, size: 32, align: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !787, file: !791, line: 5, baseType: !734, size: 64, align: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !787, file: !791, line: 7, baseType: !340, size: 64, align: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !787, file: !791, line: 8, baseType: !479, size: 64, align: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !787, file: !791, line: 9, baseType: !402, size: 64, align: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !791, line: 10, baseType: !402, size: 64, align: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !787, file: !791, line: 11, baseType: !706, size: 64, align: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !787, file: !791, line: 12, baseType: !346, size: 32, align: 32, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !787, file: !791, line: 13, baseType: !402, size: 64, align: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !787, file: !791, line: 15, baseType: !802, size: 64, align: 64, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !481, line: 108, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !808, line: 5, size: 704, align: 64, elements: !809)
!808 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !791, line: 3, baseType: !346, size: 32, align: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !807, file: !791, line: 4, baseType: !346, size: 32, align: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !807, file: !791, line: 5, baseType: !734, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !807, file: !791, line: 7, baseType: !340, size: 64, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !807, file: !791, line: 8, baseType: !479, size: 64, align: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !807, file: !791, line: 9, baseType: !402, size: 64, align: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !807, file: !791, line: 10, baseType: !402, size: 64, align: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !807, file: !791, line: 11, baseType: !706, size: 64, align: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !807, file: !791, line: 12, baseType: !346, size: 32, align: 32, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !807, file: !791, line: 13, baseType: !402, size: 64, align: 64, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !807, file: !791, line: 15, baseType: !802, size: 64, align: 64, offset: 576)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !807, file: !791, line: 17, baseType: !822, size: 64, align: 64, offset: 640)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64, align: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!359, !805}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !787, file: !791, line: 17, baseType: !822, size: 64, align: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !787, file: !827, line: 5, baseType: !402, size: 64, align: 64, offset: 704)
!827 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!828 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !787, file: !827, line: 6, baseType: !402, size: 64, align: 64, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !787, file: !827, line: 7, baseType: !706, size: 64, align: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !787, file: !827, line: 9, baseType: !734, size: 64, align: 64, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !787, file: !827, line: 10, baseType: !832, size: 64, align: 64, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !481, line: 111, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !481, line: 111, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !787, file: !827, line: 12, baseType: !556, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !787, file: !827, line: 13, baseType: !402, size: 64, align: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !787, file: !827, line: 14, baseType: !346, size: 32, align: 32, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !787, file: !827, line: 15, baseType: !402, size: 64, align: 64, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !787, file: !827, line: 17, baseType: !556, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !787, file: !827, line: 18, baseType: !556, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !787, file: !827, line: 19, baseType: !556, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !787, file: !827, line: 20, baseType: !556, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !787, file: !827, line: 22, baseType: !556, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !787, file: !827, line: 23, baseType: !556, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !787, file: !827, line: 24, baseType: !556, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !787, file: !827, line: 25, baseType: !556, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !787, file: !827, line: 26, baseType: !556, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !787, file: !827, line: 31, baseType: !849, size: 64, align: 64, offset: 1344)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!402, !785}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !482, file: !486, line: 70, baseType: !853, size: 64, align: 64, offset: 2048)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64, align: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!856, !479, !359}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !481, line: 110, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !859, line: 15, size: 960, align: 64, elements: !860)
!859 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !875, !876, !877, !878}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !858, file: !791, line: 3, baseType: !346, size: 32, align: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !858, file: !791, line: 4, baseType: !346, size: 32, align: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !858, file: !791, line: 5, baseType: !734, size: 64, align: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !858, file: !791, line: 7, baseType: !340, size: 64, align: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !858, file: !791, line: 8, baseType: !479, size: 64, align: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !858, file: !791, line: 9, baseType: !402, size: 64, align: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !858, file: !791, line: 10, baseType: !402, size: 64, align: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !858, file: !791, line: 11, baseType: !706, size: 64, align: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !858, file: !791, line: 12, baseType: !346, size: 32, align: 32, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !858, file: !791, line: 13, baseType: !402, size: 64, align: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !858, file: !791, line: 15, baseType: !802, size: 64, align: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !858, file: !791, line: 17, baseType: !822, size: 64, align: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !858, file: !874, line: 5, baseType: !402, size: 64, align: 64, offset: 704)
!874 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!875 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !858, file: !874, line: 6, baseType: !402, size: 64, align: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !858, file: !874, line: 7, baseType: !706, size: 64, align: 64, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !858, file: !874, line: 9, baseType: !556, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !858, file: !874, line: 11, baseType: !556, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !482, file: !486, line: 71, baseType: !880, size: 64, align: 64, offset: 2112)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!346, !359, !359}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !482, file: !486, line: 73, baseType: !880, size: 64, align: 64, offset: 2176)
!884 = !DILocalVariable(name: "server", arg: 1, scope: !476, file: !382, line: 102, type: !479)
!885 = !DILocation(line: 102, column: 39, scope: !476)
!886 = !DILocation(line: 104, column: 23, scope: !476)
!887 = !DILocation(line: 104, column: 32, scope: !476)
!888 = !DILocation(line: 104, column: 86, scope: !476)
!889 = !DILocation(line: 104, column: 64, scope: !476)
!890 = !DILocation(line: 104, column: 63, scope: !476)
!891 = !DILocation(line: 104, column: 2, scope: !892)
!892 = !DILexicalBlockFile(scope: !476, file: !382, discriminator: 1)
!893 = !DILocation(line: 105, column: 1, scope: !476)
!894 = distinct !DISubprogram(name: "sig_destroyed", scope: !382, file: !382, line: 107, type: !477, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!895 = !DILocalVariable(name: "server", arg: 1, scope: !894, file: !382, line: 107, type: !479)
!896 = !DILocation(line: 107, column: 39, scope: !894)
!897 = !DILocalVariable(name: "data", scope: !894, file: !382, line: 109, type: !340)
!898 = !DILocation(line: 109, column: 8, scope: !894)
!899 = !DILocation(line: 109, column: 36, scope: !894)
!900 = !DILocation(line: 109, column: 45, scope: !894)
!901 = !DILocation(line: 109, column: 15, scope: !894)
!902 = !DILocation(line: 110, column: 9, scope: !894)
!903 = !DILocation(line: 110, column: 2, scope: !894)
!904 = !DILocation(line: 111, column: 23, scope: !894)
!905 = !DILocation(line: 111, column: 32, scope: !894)
!906 = !DILocation(line: 111, column: 2, scope: !894)
!907 = !DILocation(line: 112, column: 1, scope: !894)
!908 = distinct !DISubprogram(name: "sig_channel_created", scope: !382, file: !382, line: 114, type: !909, isLocal: true, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !785}
!911 = !DILocalVariable(name: "channel", arg: 1, scope: !908, file: !382, line: 114, type: !785)
!912 = !DILocation(line: 114, column: 46, scope: !908)
!913 = !DILocation(line: 116, column: 23, scope: !908)
!914 = !DILocation(line: 116, column: 33, scope: !908)
!915 = !DILocation(line: 116, column: 88, scope: !908)
!916 = !DILocation(line: 116, column: 65, scope: !908)
!917 = !DILocation(line: 116, column: 64, scope: !908)
!918 = !DILocation(line: 116, column: 2, scope: !919)
!919 = !DILexicalBlockFile(scope: !908, file: !382, discriminator: 1)
!920 = !DILocation(line: 117, column: 1, scope: !908)
!921 = distinct !DISubprogram(name: "sig_channel_destroyed", scope: !382, file: !382, line: 119, type: !909, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!922 = !DILocalVariable(name: "channel", arg: 1, scope: !921, file: !382, line: 119, type: !785)
!923 = !DILocation(line: 119, column: 48, scope: !921)
!924 = !DILocalVariable(name: "data", scope: !921, file: !382, line: 121, type: !340)
!925 = !DILocation(line: 121, column: 8, scope: !921)
!926 = !DILocation(line: 121, column: 36, scope: !921)
!927 = !DILocation(line: 121, column: 46, scope: !921)
!928 = !DILocation(line: 121, column: 15, scope: !921)
!929 = !DILocation(line: 123, column: 9, scope: !921)
!930 = !DILocation(line: 123, column: 2, scope: !921)
!931 = !DILocation(line: 124, column: 23, scope: !921)
!932 = !DILocation(line: 124, column: 33, scope: !921)
!933 = !DILocation(line: 124, column: 2, scope: !921)
!934 = !DILocation(line: 125, column: 1, scope: !921)
!935 = distinct !DISubprogram(name: "fe_common_core_deinit", scope: !382, file: !382, line: 213, type: !383, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!936 = !DILocation(line: 215, column: 2, scope: !935)
!937 = !DILocation(line: 216, column: 2, scope: !935)
!938 = !DILocation(line: 217, column: 2, scope: !935)
!939 = !DILocation(line: 218, column: 2, scope: !935)
!940 = !DILocation(line: 219, column: 2, scope: !935)
!941 = !DILocation(line: 220, column: 2, scope: !935)
!942 = !DILocation(line: 221, column: 9, scope: !935)
!943 = !DILocation(line: 222, column: 9, scope: !935)
!944 = !DILocation(line: 223, column: 2, scope: !935)
!945 = !DILocation(line: 224, column: 2, scope: !935)
!946 = !DILocation(line: 225, column: 2, scope: !935)
!947 = !DILocation(line: 226, column: 2, scope: !935)
!948 = !DILocation(line: 227, column: 2, scope: !935)
!949 = !DILocation(line: 228, column: 2, scope: !935)
!950 = !DILocation(line: 229, column: 2, scope: !935)
!951 = !DILocation(line: 233, column: 2, scope: !935)
!952 = !DILocation(line: 234, column: 2, scope: !935)
!953 = !DILocation(line: 235, column: 2, scope: !935)
!954 = !DILocation(line: 236, column: 2, scope: !935)
!955 = !DILocation(line: 237, column: 2, scope: !935)
!956 = !DILocation(line: 238, column: 2, scope: !935)
!957 = !DILocation(line: 240, column: 9, scope: !935)
!958 = !DILocation(line: 241, column: 9, scope: !935)
!959 = !DILocation(line: 243, column: 2, scope: !935)
!960 = !DILocation(line: 244, column: 2, scope: !935)
!961 = !DILocation(line: 245, column: 2, scope: !935)
!962 = !DILocation(line: 247, column: 9, scope: !935)
!963 = !DILocation(line: 248, column: 2, scope: !935)
!964 = !DILocation(line: 250, column: 9, scope: !935)
!965 = !DILocation(line: 251, column: 9, scope: !935)
!966 = !DILocation(line: 252, column: 9, scope: !935)
!967 = !DILocation(line: 253, column: 9, scope: !935)
!968 = !DILocation(line: 254, column: 9, scope: !935)
!969 = !DILocation(line: 255, column: 1, scope: !935)
!970 = !DILocalVariable(name: "changed", scope: !409, file: !382, line: 380, type: !346)
!971 = !DILocation(line: 380, column: 6, scope: !409)
!972 = !DILocation(line: 382, column: 6, scope: !973)
!973 = distinct !DILexicalBlock(scope: !409, file: !382, line: 382, column: 6)
!974 = !DILocation(line: 382, column: 48, scope: !973)
!975 = !DILocation(line: 382, column: 45, scope: !973)
!976 = !DILocation(line: 382, column: 6, scope: !409)
!977 = !DILocation(line: 383, column: 20, scope: !978)
!978 = distinct !DILexicalBlock(scope: !973, file: !382, line: 382, column: 63)
!979 = !DILocation(line: 383, column: 19, scope: !978)
!980 = !DILocation(line: 383, column: 17, scope: !978)
!981 = !DILocation(line: 384, column: 11, scope: !978)
!982 = !DILocation(line: 385, column: 2, scope: !978)
!983 = !DILocation(line: 386, column: 6, scope: !984)
!984 = distinct !DILexicalBlock(scope: !409, file: !382, line: 386, column: 6)
!985 = !DILocation(line: 386, column: 46, scope: !984)
!986 = !DILocation(line: 386, column: 43, scope: !984)
!987 = !DILocation(line: 386, column: 6, scope: !409)
!988 = !DILocation(line: 387, column: 18, scope: !989)
!989 = distinct !DILexicalBlock(scope: !984, file: !382, line: 386, column: 59)
!990 = !DILocation(line: 387, column: 17, scope: !989)
!991 = !DILocation(line: 387, column: 15, scope: !989)
!992 = !DILocation(line: 388, column: 11, scope: !989)
!993 = !DILocation(line: 389, column: 2, scope: !989)
!994 = !DILocation(line: 391, column: 6, scope: !995)
!995 = distinct !DILexicalBlock(scope: !409, file: !382, line: 391, column: 6)
!996 = !DILocation(line: 391, column: 6, scope: !409)
!997 = !DILocation(line: 392, column: 13, scope: !998)
!998 = distinct !DILexicalBlock(scope: !995, file: !382, line: 391, column: 17)
!999 = !DILocation(line: 393, column: 11, scope: !998)
!1000 = !DILocation(line: 395, column: 3, scope: !998)
!1001 = !DILocation(line: 396, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !998, file: !382, line: 396, column: 7)
!1003 = !DILocation(line: 396, column: 15, scope: !1002)
!1004 = !DILocation(line: 396, column: 7, scope: !998)
!1005 = !DILocation(line: 397, column: 4, scope: !1002)
!1006 = !DILocation(line: 398, column: 2, scope: !998)
!1007 = !DILocation(line: 400, column: 6, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !409, file: !382, line: 400, column: 6)
!1009 = !DILocation(line: 400, column: 6, scope: !409)
!1010 = !DILocation(line: 401, column: 3, scope: !1008)
!1011 = !DILocation(line: 402, column: 1, scope: !409)
!1012 = distinct !DISubprogram(name: "glog_func", scope: !382, file: !382, line: 257, type: !1013, isLocal: false, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !359, !356, !359}
!1015 = !DILocalVariable(name: "log_domain", arg: 1, scope: !1012, file: !382, line: 257, type: !359)
!1016 = !DILocation(line: 257, column: 28, scope: !1012)
!1017 = !DILocalVariable(name: "log_level", arg: 2, scope: !1012, file: !382, line: 257, type: !356)
!1018 = !DILocation(line: 257, column: 55, scope: !1012)
!1019 = !DILocalVariable(name: "message", arg: 3, scope: !1012, file: !382, line: 258, type: !359)
!1020 = !DILocation(line: 258, column: 21, scope: !1012)
!1021 = !DILocalVariable(name: "reason", scope: !1012, file: !382, line: 260, type: !359)
!1022 = !DILocation(line: 260, column: 14, scope: !1012)
!1023 = !DILocation(line: 262, column: 10, scope: !1012)
!1024 = !DILocation(line: 262, column: 2, scope: !1012)
!1025 = !DILocation(line: 264, column: 24, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1012, file: !382, line: 262, column: 21)
!1027 = !DILocation(line: 265, column: 17, scope: !1026)
!1028 = !DILocation(line: 267, column: 24, scope: !1026)
!1029 = !DILocation(line: 268, column: 3, scope: !1026)
!1030 = !DILocation(line: 270, column: 10, scope: !1026)
!1031 = !DILocation(line: 271, column: 17, scope: !1026)
!1032 = !DILocation(line: 274, column: 6, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1012, file: !382, line: 274, column: 6)
!1034 = !DILocation(line: 274, column: 14, scope: !1033)
!1035 = !DILocation(line: 274, column: 6, scope: !1012)
!1036 = !DILocation(line: 275, column: 10, scope: !1033)
!1037 = !DILocation(line: 275, column: 35, scope: !1033)
!1038 = !DILocation(line: 275, column: 43, scope: !1033)
!1039 = !DILocation(line: 275, column: 3, scope: !1033)
!1040 = !DILocation(line: 277, column: 42, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !382, line: 276, column: 7)
!1042 = !DILocation(line: 277, column: 50, scope: !1041)
!1043 = !DILocation(line: 277, column: 3, scope: !1041)
!1044 = !DILocation(line: 280, column: 1, scope: !1012)
!1045 = distinct !DISubprogram(name: "fe_common_core_finish_init", scope: !382, file: !382, line: 435, type: !383, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!1046 = !DILocalVariable(name: "setup_changed", scope: !1045, file: !382, line: 437, type: !346)
!1047 = !DILocation(line: 437, column: 6, scope: !1045)
!1048 = !DILocation(line: 439, column: 2, scope: !1045)
!1049 = !DILocation(line: 442, column: 2, scope: !1045)
!1050 = !DILocation(line: 445, column: 23, scope: !1045)
!1051 = !DILocation(line: 446, column: 6, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1045, file: !382, line: 446, column: 6)
!1053 = !DILocation(line: 446, column: 19, scope: !1052)
!1054 = !DILocation(line: 446, column: 26, scope: !1052)
!1055 = !DILocation(line: 446, column: 30, scope: !1056)
!1056 = !DILexicalBlockFile(scope: !1052, file: !382, discriminator: 1)
!1057 = !DILocation(line: 446, column: 29, scope: !1056)
!1058 = !DILocation(line: 446, column: 43, scope: !1056)
!1059 = !DILocation(line: 446, column: 6, scope: !1056)
!1060 = !DILocation(line: 448, column: 28, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1052, file: !382, line: 446, column: 52)
!1062 = !DILocation(line: 448, column: 3, scope: !1061)
!1063 = !DILocation(line: 449, column: 17, scope: !1061)
!1064 = !DILocation(line: 450, column: 2, scope: !1061)
!1065 = !DILocation(line: 452, column: 6, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1045, file: !382, line: 452, column: 6)
!1067 = !DILocation(line: 452, column: 23, scope: !1066)
!1068 = !DILocation(line: 452, column: 6, scope: !1045)
!1069 = !DILocation(line: 454, column: 32, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !382, line: 452, column: 31)
!1071 = !DILocation(line: 454, column: 3, scope: !1070)
!1072 = !DILocation(line: 455, column: 17, scope: !1070)
!1073 = !DILocation(line: 456, column: 2, scope: !1070)
!1074 = !DILocation(line: 458, column: 2, scope: !1045)
!1075 = !DILocation(line: 459, column: 2, scope: !1045)
!1076 = !DILocation(line: 462, column: 2, scope: !1045)
!1077 = !DILocation(line: 464, column: 6, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1045, file: !382, line: 464, column: 6)
!1079 = !DILocation(line: 464, column: 6, scope: !1045)
!1080 = !DILocation(line: 465, column: 17, scope: !1078)
!1081 = !DILocation(line: 467, column: 2, scope: !1045)
!1082 = !DILocation(line: 468, column: 2, scope: !1045)
!1083 = !DILocation(line: 469, column: 1, scope: !1045)
!1084 = distinct !DISubprogram(name: "autorun_startup", scope: !382, file: !382, line: 404, type: !383, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!1085 = !DILocalVariable(name: "path", scope: !1084, file: !382, line: 406, type: !402)
!1086 = !DILocation(line: 406, column: 8, scope: !1084)
!1087 = !DILocalVariable(name: "handle", scope: !1084, file: !382, line: 407, type: !527)
!1088 = !DILocation(line: 407, column: 14, scope: !1084)
!1089 = !DILocalVariable(name: "buf", scope: !1084, file: !382, line: 408, type: !673)
!1090 = !DILocation(line: 408, column: 11, scope: !1084)
!1091 = !DILocalVariable(name: "tpos", scope: !1084, file: !382, line: 409, type: !542)
!1092 = !DILocation(line: 409, column: 8, scope: !1084)
!1093 = !DILocation(line: 412, column: 39, scope: !1084)
!1094 = !DILocation(line: 412, column: 9, scope: !1095)
!1095 = !DILexicalBlockFile(scope: !1084, file: !382, discriminator: 1)
!1096 = !DILocation(line: 412, column: 7, scope: !1084)
!1097 = !DILocation(line: 413, column: 33, scope: !1084)
!1098 = !DILocation(line: 413, column: 11, scope: !1084)
!1099 = !DILocation(line: 413, column: 9, scope: !1084)
!1100 = !DILocation(line: 414, column: 9, scope: !1084)
!1101 = !DILocation(line: 414, column: 2, scope: !1084)
!1102 = !DILocation(line: 415, column: 6, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1084, file: !382, line: 415, column: 6)
!1104 = !DILocation(line: 415, column: 13, scope: !1103)
!1105 = !DILocation(line: 415, column: 6, scope: !1084)
!1106 = !DILocation(line: 417, column: 3, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1103, file: !382, line: 415, column: 21)
!1108 = !DILocation(line: 420, column: 28, scope: !1084)
!1109 = !DILocation(line: 420, column: 2, scope: !1084)
!1110 = !DILocation(line: 421, column: 8, scope: !1084)
!1111 = !DILocation(line: 421, column: 6, scope: !1084)
!1112 = !DILocation(line: 422, column: 2, scope: !1084)
!1113 = !DILocation(line: 422, column: 39, scope: !1095)
!1114 = !DILocation(line: 422, column: 47, scope: !1095)
!1115 = !DILocation(line: 422, column: 9, scope: !1095)
!1116 = !DILocation(line: 422, column: 64, scope: !1095)
!1117 = !DILocation(line: 422, column: 2, scope: !1095)
!1118 = !DILocation(line: 423, column: 12, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1084, file: !382, line: 422, column: 87)
!1120 = !DILocation(line: 423, column: 3, scope: !1119)
!1121 = !DILocation(line: 423, column: 8, scope: !1119)
!1122 = !DILocation(line: 423, column: 18, scope: !1119)
!1123 = !DILocation(line: 424, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !382, line: 424, column: 7)
!1125 = !DILocation(line: 424, column: 12, scope: !1124)
!1126 = !DILocation(line: 424, column: 19, scope: !1124)
!1127 = !DILocation(line: 424, column: 7, scope: !1119)
!1128 = !DILocation(line: 425, column: 24, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !382, line: 424, column: 27)
!1130 = !DILocation(line: 425, column: 29, scope: !1129)
!1131 = !DILocation(line: 426, column: 10, scope: !1129)
!1132 = !DILocation(line: 426, column: 22, scope: !1129)
!1133 = !DILocation(line: 427, column: 10, scope: !1129)
!1134 = !DILocation(line: 427, column: 22, scope: !1129)
!1135 = !DILocation(line: 425, column: 4, scope: !1129)
!1136 = !DILocation(line: 428, column: 3, scope: !1129)
!1137 = !DILocation(line: 422, column: 2, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1084, file: !382, discriminator: 2)
!1139 = distinct !{!1139, !1112}
!1140 = !DILocation(line: 430, column: 16, scope: !1084)
!1141 = !DILocation(line: 430, column: 2, scope: !1084)
!1142 = !DILocation(line: 432, column: 21, scope: !1084)
!1143 = !DILocation(line: 432, column: 2, scope: !1084)
!1144 = !DILocation(line: 433, column: 1, scope: !1084)
!1145 = !DILocation(line: 433, column: 1, scope: !1095)
!1146 = distinct !DISubprogram(name: "autoconnect_servers", scope: !382, file: !382, line: 331, type: !383, isLocal: true, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!1147 = !DILocalVariable(name: "tmp", scope: !1146, file: !382, line: 333, type: !367)
!1148 = !DILocation(line: 333, column: 10, scope: !1146)
!1149 = !DILocalVariable(name: "chatnets", scope: !1146, file: !382, line: 333, type: !367)
!1150 = !DILocation(line: 333, column: 16, scope: !1146)
!1151 = !DILocalVariable(name: "str", scope: !1146, file: !382, line: 334, type: !402)
!1152 = !DILocation(line: 334, column: 8, scope: !1146)
!1153 = !DILocation(line: 336, column: 6, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1146, file: !382, line: 336, column: 6)
!1155 = !DILocation(line: 336, column: 21, scope: !1154)
!1156 = !DILocation(line: 336, column: 6, scope: !1146)
!1157 = !DILocation(line: 338, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !382, line: 338, column: 7)
!1159 = distinct !DILexicalBlock(scope: !1154, file: !382, line: 336, column: 29)
!1160 = !DILocation(line: 338, column: 24, scope: !1158)
!1161 = !DILocation(line: 338, column: 7, scope: !1159)
!1162 = !DILocation(line: 339, column: 35, scope: !1158)
!1163 = !DILocation(line: 339, column: 51, scope: !1158)
!1164 = !DILocation(line: 339, column: 10, scope: !1158)
!1165 = !DILocation(line: 339, column: 8, scope: !1158)
!1166 = !DILocation(line: 339, column: 4, scope: !1158)
!1167 = !DILocation(line: 341, column: 38, scope: !1158)
!1168 = !DILocation(line: 341, column: 54, scope: !1158)
!1169 = !DILocation(line: 341, column: 68, scope: !1158)
!1170 = !DILocation(line: 341, column: 10, scope: !1158)
!1171 = !DILocation(line: 341, column: 8, scope: !1158)
!1172 = !DILocation(line: 343, column: 37, scope: !1159)
!1173 = !DILocation(line: 343, column: 3, scope: !1159)
!1174 = !DILocation(line: 344, column: 10, scope: !1159)
!1175 = !DILocation(line: 344, column: 3, scope: !1159)
!1176 = !DILocation(line: 345, column: 3, scope: !1159)
!1177 = !DILocation(line: 348, column: 6, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1146, file: !382, line: 348, column: 6)
!1179 = !DILocation(line: 348, column: 6, scope: !1146)
!1180 = !DILocation(line: 350, column: 3, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1178, file: !382, line: 348, column: 22)
!1182 = !DILocation(line: 354, column: 11, scope: !1146)
!1183 = !DILocation(line: 355, column: 13, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1146, file: !382, line: 355, column: 2)
!1185 = !DILocation(line: 355, column: 11, scope: !1184)
!1186 = !DILocation(line: 355, column: 7, scope: !1184)
!1187 = !DILocation(line: 355, column: 27, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1189, file: !382, discriminator: 1)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !382, line: 355, column: 2)
!1190 = !DILocation(line: 355, column: 31, scope: !1188)
!1191 = !DILocation(line: 355, column: 2, scope: !1188)
!1192 = !DILocalVariable(name: "rec", scope: !1193, file: !382, line: 356, type: !1194)
!1193 = distinct !DILexicalBlock(scope: !1189, file: !382, line: 355, column: 56)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_SETUP_REC", file: !481, line: 114, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_SETUP_REC", file: !1197, line: 13, size: 1408, align: 64, elements: !1198)
!1197 = !DIFile(filename: "../../../src/core/servers-setup.h", directory: "/home/lichi/Desktop/irssi/task1")
!1198 = !{!1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1196, file: !1200, line: 1, baseType: !346, size: 32, align: 32)
!1200 = !DIFile(filename: "../../../src/core/server-setup-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !1196, file: !1200, line: 2, baseType: !346, size: 32, align: 32, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !1196, file: !1200, line: 4, baseType: !402, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1196, file: !1200, line: 6, baseType: !504, size: 16, align: 16, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1196, file: !1200, line: 7, baseType: !402, size: 64, align: 64, offset: 192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1196, file: !1200, line: 8, baseType: !346, size: 32, align: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !1196, file: !1200, line: 9, baseType: !402, size: 64, align: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !1196, file: !1200, line: 11, baseType: !346, size: 32, align: 32, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !1196, file: !1200, line: 12, baseType: !402, size: 64, align: 64, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !1196, file: !1200, line: 14, baseType: !402, size: 64, align: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !1196, file: !1200, line: 15, baseType: !402, size: 64, align: 64, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !1196, file: !1200, line: 16, baseType: !402, size: 64, align: 64, offset: 640)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !1196, file: !1200, line: 17, baseType: !402, size: 64, align: 64, offset: 704)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !1196, file: !1200, line: 18, baseType: !402, size: 64, align: 64, offset: 768)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !1196, file: !1200, line: 19, baseType: !402, size: 64, align: 64, offset: 832)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !1196, file: !1200, line: 20, baseType: !402, size: 64, align: 64, offset: 896)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !1196, file: !1200, line: 21, baseType: !402, size: 64, align: 64, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "own_host", scope: !1196, file: !1200, line: 23, baseType: !402, size: 64, align: 64, offset: 1024)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !1196, file: !1200, line: 24, baseType: !510, size: 64, align: 64, offset: 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !1196, file: !1200, line: 24, baseType: !510, size: 64, align: 64, offset: 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "last_connect", scope: !1196, file: !1200, line: 26, baseType: !706, size: 64, align: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "autoconnect", scope: !1196, file: !1200, line: 28, baseType: !556, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "no_proxy", scope: !1196, file: !1200, line: 29, baseType: !556, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "last_failed", scope: !1196, file: !1200, line: 30, baseType: !556, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !1196, file: !1200, line: 31, baseType: !556, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !1196, file: !1200, line: 32, baseType: !556, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !1196, file: !1200, line: 33, baseType: !556, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !1196, file: !1200, line: 34, baseType: !556, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !1196, file: !1200, line: 36, baseType: !734, size: 64, align: 64, offset: 1344)
!1229 = !DILocation(line: 356, column: 21, scope: !1193)
!1230 = !DILocation(line: 356, column: 27, scope: !1193)
!1231 = !DILocation(line: 356, column: 32, scope: !1193)
!1232 = !DILocation(line: 358, column: 7, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1193, file: !382, line: 358, column: 7)
!1234 = !DILocation(line: 358, column: 12, scope: !1233)
!1235 = !DILocation(line: 358, column: 24, scope: !1233)
!1236 = !DILocation(line: 359, column: 8, scope: !1233)
!1237 = !DILocation(line: 359, column: 13, scope: !1233)
!1238 = !DILocation(line: 359, column: 21, scope: !1233)
!1239 = !DILocation(line: 359, column: 28, scope: !1233)
!1240 = !DILocation(line: 360, column: 33, scope: !1233)
!1241 = !DILocation(line: 360, column: 43, scope: !1233)
!1242 = !DILocation(line: 360, column: 48, scope: !1233)
!1243 = !DILocation(line: 360, column: 8, scope: !1233)
!1244 = !DILocation(line: 360, column: 57, scope: !1233)
!1245 = !DILocation(line: 358, column: 7, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1193, file: !382, discriminator: 1)
!1247 = !DILocation(line: 361, column: 8, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1249, file: !382, line: 361, column: 8)
!1249 = distinct !DILexicalBlock(scope: !1233, file: !382, line: 360, column: 66)
!1250 = !DILocation(line: 361, column: 13, scope: !1248)
!1251 = !DILocation(line: 361, column: 21, scope: !1248)
!1252 = !DILocation(line: 361, column: 8, scope: !1249)
!1253 = !DILocation(line: 362, column: 31, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1248, file: !382, line: 361, column: 29)
!1255 = !DILocation(line: 362, column: 41, scope: !1254)
!1256 = !DILocation(line: 362, column: 46, scope: !1254)
!1257 = !DILocation(line: 362, column: 16, scope: !1254)
!1258 = !DILocation(line: 362, column: 14, scope: !1254)
!1259 = !DILocation(line: 363, column: 48, scope: !1254)
!1260 = !DILocation(line: 363, column: 53, scope: !1254)
!1261 = !DILocation(line: 363, column: 62, scope: !1254)
!1262 = !DILocation(line: 363, column: 67, scope: !1254)
!1263 = !DILocation(line: 363, column: 76, scope: !1254)
!1264 = !DILocation(line: 363, column: 81, scope: !1254)
!1265 = !DILocation(line: 363, column: 11, scope: !1254)
!1266 = !DILocation(line: 363, column: 9, scope: !1254)
!1267 = !DILocation(line: 364, column: 4, scope: !1254)
!1268 = !DILocation(line: 365, column: 36, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1248, file: !382, line: 364, column: 11)
!1270 = !DILocation(line: 365, column: 41, scope: !1269)
!1271 = !DILocation(line: 365, column: 50, scope: !1269)
!1272 = !DILocation(line: 365, column: 55, scope: !1269)
!1273 = !DILocation(line: 365, column: 11, scope: !1269)
!1274 = !DILocation(line: 365, column: 9, scope: !1269)
!1275 = !DILocation(line: 368, column: 38, scope: !1249)
!1276 = !DILocation(line: 368, column: 4, scope: !1249)
!1277 = !DILocation(line: 369, column: 11, scope: !1249)
!1278 = !DILocation(line: 369, column: 4, scope: !1249)
!1279 = !DILocation(line: 370, column: 3, scope: !1249)
!1280 = !DILocation(line: 371, column: 2, scope: !1193)
!1281 = !DILocation(line: 355, column: 45, scope: !1282)
!1282 = !DILexicalBlockFile(scope: !1189, file: !382, discriminator: 2)
!1283 = !DILocation(line: 355, column: 50, scope: !1282)
!1284 = !DILocation(line: 355, column: 43, scope: !1282)
!1285 = !DILocation(line: 355, column: 2, scope: !1282)
!1286 = distinct !{!1286, !1287}
!1287 = !DILocation(line: 355, column: 2, scope: !1146)
!1288 = !DILocation(line: 373, column: 15, scope: !1146)
!1289 = !DILocation(line: 373, column: 2, scope: !1146)
!1290 = !DILocation(line: 374, column: 1, scope: !1146)
!1291 = !DILocation(line: 374, column: 1, scope: !1292)
!1292 = !DILexicalBlockFile(scope: !1146, file: !382, discriminator: 1)
!1293 = distinct !DISubprogram(name: "strarray_find_dest", scope: !382, file: !382, line: 471, type: !1294, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !385)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!602, !780, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1298)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !1299, line: 62, baseType: !1300)
!1299 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !1299, line: 50, size: 576, align: 64, elements: !1301)
!1301 = !{!1302, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1300, file: !1299, line: 51, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !481, line: 117, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !1306, line: 28, size: 1280, align: 64, elements: !1307)
!1306 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!1307 = !{!1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !1305, file: !1306, line: 29, baseType: !346, size: 32, align: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1305, file: !1306, line: 30, baseType: !402, size: 64, align: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !1306, line: 32, baseType: !346, size: 32, align: 32, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !1306, line: 32, baseType: !346, size: 32, align: 32, offset: 160)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1305, file: !1306, line: 34, baseType: !367, size: 64, align: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1305, file: !1306, line: 35, baseType: !805, size: 64, align: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !1305, file: !1306, line: 36, baseType: !479, size: 64, align: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !1305, file: !1306, line: 37, baseType: !479, size: 64, align: 64, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !1305, file: !1306, line: 38, baseType: !402, size: 64, align: 64, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1305, file: !1306, line: 40, baseType: !346, size: 32, align: 32, offset: 512)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !1305, file: !1306, line: 41, baseType: !367, size: 64, align: 64, offset: 576)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !1305, file: !1306, line: 43, baseType: !556, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !1305, file: !1306, line: 44, baseType: !556, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !1305, file: !1306, line: 45, baseType: !556, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !1305, file: !1306, line: 48, baseType: !1323, size: 64, align: 64, offset: 704)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !1325, line: 14, baseType: !1326)
!1325 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1325, line: 6, size: 256, align: 64, elements: !1327)
!1327 = !{!1328, !1329, !1338, !1339, !1340}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1326, file: !1325, line: 7, baseType: !402, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1326, file: !1325, line: 9, baseType: !1330, size: 64, align: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1332, line: 37, baseType: !1333)
!1332 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1332, line: 39, size: 192, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1333, file: !1332, line: 41, baseType: !357, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1333, file: !1332, line: 42, baseType: !1330, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1333, file: !1332, line: 43, baseType: !1330, size: 64, align: 64, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1326, file: !1325, line: 10, baseType: !346, size: 32, align: 32, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1326, file: !1325, line: 12, baseType: !346, size: 32, align: 32, offset: 160)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !1326, file: !1325, line: 13, baseType: !346, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !1305, file: !1306, line: 49, baseType: !402, size: 64, align: 64, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !1305, file: !1306, line: 51, baseType: !346, size: 32, align: 32, offset: 832)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !1305, file: !1306, line: 52, baseType: !402, size: 64, align: 64, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !1305, file: !1306, line: 54, baseType: !706, size: 64, align: 64, offset: 960)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !1305, file: !1306, line: 55, baseType: !706, size: 64, align: 64, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !1305, file: !1306, line: 57, baseType: !402, size: 64, align: 64, offset: 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !1305, file: !1306, line: 58, baseType: !340, size: 64, align: 64, offset: 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !1305, file: !1306, line: 60, baseType: !340, size: 64, align: 64, offset: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !1300, file: !1299, line: 52, baseType: !479, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !1300, file: !1299, line: 53, baseType: !359, size: 64, align: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1300, file: !1299, line: 54, baseType: !359, size: 64, align: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !1300, file: !1299, line: 55, baseType: !359, size: 64, align: 64, offset: 256)
