; ModuleID = './line366-statusbar-items.o.i'
source_filename = "./line366-statusbar-items.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._GHashTable = type opaque
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 7, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41}
!38 = !DIEnumerator(name: "DATA_LEVEL_NONE", value: 0)
!39 = !DIEnumerator(name: "DATA_LEVEL_TEXT", value: 1)
!40 = !DIEnumerator(name: "DATA_LEVEL_MSG", value: 2)
!41 = !DIEnumerator(name: "DATA_LEVEL_HILIGHT", value: 3)
!42 = !{!43, !50, !51, !60, !67, !71, !75, !76, !185, !397, !57, !387}
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !44, line: 9, baseType: !45)
!44 = !DIFile(filename: "../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !48, !48, !48, !48, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !59}
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !56, line: 50, baseType: !57)
!56 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !56, line: 49, baseType: !58)
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !56, line: 77, baseType: !50)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashFunc", file: !56, line: 90, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !56, line: 55, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !56, line: 78, baseType: !48)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !56, line: 80, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!57, !66, !66}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHFunc", file: !56, line: 91, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !59, !59, !59}
!75 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_WINDOW_REC", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "gui-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 13, size: 320, align: 64, elements: !80)
!80 = !{!81, !508, !590, !591, !592, !593, !594, !595}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !78, line: 14, baseType: !82, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_WINDOW_REC", file: !84, line: 34, baseType: !85)
!84 = !DIFile(filename: "mainwindows.h", directory: "/home/lichi/Desktop/irssi/task1")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 16, size: 704, align: 64, elements: !86)
!86 = !{!87, !487, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !85, file: !84, line: 17, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !90, line: 117, baseType: !91)
!90 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !36, line: 28, size: 1280, align: 64, elements: !92)
!92 = !{!93, !94, !97, !98, !99, !107, !452, !453, !454, !455, !456, !457, !458, !459, !460, !479, !480, !481, !482, !483, !484, !485, !486}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !91, file: !36, line: 29, baseType: !58, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !36, line: 30, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !91, file: !36, line: 32, baseType: !58, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !91, file: !36, line: 32, baseType: !58, size: 32, align: 32, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !91, file: !36, line: 34, baseType: !100, size: 64, align: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !102, line: 37, baseType: !103)
!102 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !102, line: 39, size: 128, align: 64, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !102, line: 41, baseType: !59, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !103, file: !102, line: 42, baseType: !100, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !91, file: !36, line: 35, baseType: !108, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !90, line: 108, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !111, line: 5, size: 704, align: 64, elements: !112)
!111 = !DIFile(filename: "../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!112 = !{!113, !115, !116, !121, !122, !439, !440, !441, !442, !443, !444, !448}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !114, line: 3, baseType: !58, size: 32, align: 32)
!114 = !DIFile(filename: "../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !110, file: !114, line: 4, baseType: !58, size: 32, align: 32, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !110, file: !114, line: 5, baseType: !117, size: 64, align: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !119, line: 37, baseType: !120)
!119 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !119, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !110, file: !114, line: 7, baseType: !50, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !110, file: !114, line: 8, baseType: !123, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !90, line: 107, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !126, line: 30, size: 2240, align: 64, elements: !127)
!126 = !DIFile(filename: "../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!127 = !{!128, !130, !131, !132, !346, !351, !352, !353, !354, !355, !356, !357, !358, !359, !363, !364, !368, !369, !370, !374, !375, !376, !377, !378, !379, !380, !381, !382, !389, !390, !391, !392, !393, !399, !403, !407, !411, !415, !420, !427, !434, !438}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !129, line: 3, baseType: !58, size: 32, align: 32)
!129 = !DIFile(filename: "../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !125, file: !129, line: 4, baseType: !58, size: 32, align: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !125, file: !129, line: 6, baseType: !58, size: 32, align: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !125, file: !129, line: 8, baseType: !133, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !90, line: 113, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !126, line: 25, size: 1920, align: 64, elements: !136)
!136 = !{!137, !139, !140, !141, !142, !143, !144, !145, !146, !148, !149, !150, !151, !152, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !138, line: 3, baseType: !58, size: 32, align: 32)
!138 = !DIFile(filename: "../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !135, file: !138, line: 4, baseType: !58, size: 32, align: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !135, file: !138, line: 6, baseType: !58, size: 32, align: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !135, file: !138, line: 9, baseType: !95, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !135, file: !138, line: 10, baseType: !58, size: 32, align: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !135, file: !138, line: 11, baseType: !95, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !135, file: !138, line: 11, baseType: !95, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !135, file: !138, line: 11, baseType: !95, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !135, file: !138, line: 13, baseType: !147, size: 16, align: 16, offset: 448)
!147 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !135, file: !138, line: 14, baseType: !95, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !135, file: !138, line: 15, baseType: !95, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !135, file: !138, line: 16, baseType: !58, size: 32, align: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !135, file: !138, line: 17, baseType: !95, size: 64, align: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !135, file: !138, line: 19, baseType: !153, size: 64, align: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !90, line: 99, baseType: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !90, line: 99, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !135, file: !138, line: 19, baseType: !153, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !135, file: !138, line: 21, baseType: !95, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !135, file: !138, line: 22, baseType: !95, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !135, file: !138, line: 23, baseType: !95, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !135, file: !138, line: 24, baseType: !95, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !135, file: !138, line: 26, baseType: !95, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !135, file: !138, line: 27, baseType: !95, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !135, file: !138, line: 28, baseType: !95, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !135, file: !138, line: 29, baseType: !95, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !135, file: !138, line: 30, baseType: !95, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !135, file: !138, line: 31, baseType: !95, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !135, file: !138, line: 32, baseType: !95, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !135, file: !138, line: 33, baseType: !95, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !135, file: !138, line: 35, baseType: !170, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !173)
!173 = !{!174, !175, !303, !304, !309, !310, !311, !312, !313, !322, !323, !324, !328, !329, !330, !331, !332, !333, !334, !335}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !172, file: !4, line: 100, baseType: !57, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !172, file: !4, line: 101, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !179)
!179 = !{!180, !203, !209, !215, !219, !290, !294, !299}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !178, file: !4, line: 133, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !170, !185, !187, !190, !191}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !56, line: 46, baseType: !96)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !188, line: 66, baseType: !189)
!188 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!189 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !194, line: 42, baseType: !195)
!194 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !194, line: 44, size: 128, align: 64, elements: !196)
!196 = !{!197, !201, !202}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !195, file: !194, line: 46, baseType: !198, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !199, line: 36, baseType: !200)
!199 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !188, line: 45, baseType: !65)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !195, file: !194, line: 47, baseType: !57, size: 32, align: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !195, file: !194, line: 48, baseType: !185, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !178, file: !4, line: 138, baseType: !204, size: 64, align: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!184, !170, !207, !187, !190, !191}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !178, file: !4, line: 143, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!184, !170, !213, !214, !191}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !188, line: 51, baseType: !75)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !178, file: !4, line: 147, baseType: !216, size: 64, align: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!184, !170, !191}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !178, file: !4, line: 149, baseType: !220, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !170, !289}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !226)
!226 = !{!227, !228, !244, !273, !274, !278, !279, !280, !281, !282, !283, !284, !285}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !225, file: !16, line: 174, baseType: !59, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !225, file: !16, line: 175, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !232)
!232 = !{!233, !237, !238}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !231, file: !16, line: 198, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !59}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !231, file: !16, line: 199, baseType: !234, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !231, file: !16, line: 200, baseType: !239, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !59, !223, !242, !243}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !225, file: !16, line: 177, baseType: !245, size: 64, align: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !249)
!249 = !{!250, !255, !259, !263, !267, !268}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !248, file: !16, line: 216, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!55, !223, !254}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !248, file: !16, line: 218, baseType: !256, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!55, !223}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !248, file: !16, line: 219, baseType: !260, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!55, !223, !51, !59}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !248, file: !16, line: 222, baseType: !264, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !223}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !248, file: !16, line: 226, baseType: !51, size: 64, align: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !248, file: !16, line: 227, baseType: !269, size: 64, align: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !225, file: !16, line: 178, baseType: !64, size: 32, align: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !225, file: !16, line: 180, baseType: !275, size: 64, align: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !277)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !225, file: !16, line: 182, baseType: !57, size: 32, align: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !16, line: 183, baseType: !64, size: 32, align: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !225, file: !16, line: 184, baseType: !64, size: 32, align: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !225, file: !16, line: 186, baseType: !100, size: 64, align: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !16, line: 188, baseType: !223, size: 64, align: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !16, line: 189, baseType: !223, size: 64, align: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !16, line: 191, baseType: !95, size: 64, align: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !225, file: !16, line: 193, baseType: !286, size: 64, align: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !178, file: !4, line: 151, baseType: !291, size: 64, align: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !170}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !178, file: !4, line: 152, baseType: !295, size: 64, align: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!184, !170, !298, !191}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !178, file: !4, line: 155, baseType: !300, size: 64, align: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!298, !170}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !172, file: !4, line: 103, baseType: !185, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !172, file: !4, line: 104, baseType: !305, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !306, line: 77, baseType: !307)
!306 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !306, line: 77, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !172, file: !4, line: 105, baseType: !305, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !172, file: !4, line: 106, baseType: !185, size: 64, align: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !172, file: !4, line: 107, baseType: !64, size: 32, align: 32, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !172, file: !4, line: 109, baseType: !187, size: 64, align: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !172, file: !4, line: 110, baseType: !314, size: 64, align: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !316, line: 39, baseType: !317)
!316 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !316, line: 41, size: 192, align: 64, elements: !318)
!318 = !{!319, !320, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !317, file: !316, line: 43, baseType: !185, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !317, file: !316, line: 44, baseType: !187, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !317, file: !316, line: 45, baseType: !187, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !172, file: !4, line: 111, baseType: !314, size: 64, align: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !172, file: !4, line: 112, baseType: !314, size: 64, align: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !172, file: !4, line: 113, baseType: !325, size: 48, align: 8, offset: 704)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 48, align: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 6)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !172, file: !4, line: 117, baseType: !64, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !172, file: !4, line: 118, baseType: !64, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !172, file: !4, line: 119, baseType: !64, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !172, file: !4, line: 120, baseType: !64, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !172, file: !4, line: 121, baseType: !64, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !172, file: !4, line: 122, baseType: !64, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !172, file: !4, line: 124, baseType: !59, size: 64, align: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !172, file: !4, line: 125, baseType: !59, size: 64, align: 64, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !135, file: !138, line: 38, baseType: !65, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !135, file: !138, line: 39, baseType: !65, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !135, file: !138, line: 40, baseType: !65, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !135, file: !138, line: 41, baseType: !65, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !135, file: !138, line: 42, baseType: !65, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !135, file: !138, line: 43, baseType: !65, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !135, file: !138, line: 44, baseType: !65, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !135, file: !138, line: 45, baseType: !65, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !135, file: !138, line: 46, baseType: !95, size: 64, align: 64, offset: 1792)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !135, file: !138, line: 47, baseType: !95, size: 64, align: 64, offset: 1856)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !125, file: !129, line: 9, baseType: !347, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !348, line: 75, baseType: !349)
!348 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !350, line: 139, baseType: !75)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !125, file: !129, line: 10, baseType: !347, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !125, file: !129, line: 12, baseType: !95, size: 64, align: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !125, file: !129, line: 13, baseType: !95, size: 64, align: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !125, file: !129, line: 15, baseType: !65, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !125, file: !129, line: 16, baseType: !65, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !125, file: !129, line: 17, baseType: !65, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !125, file: !129, line: 18, baseType: !65, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !125, file: !129, line: 19, baseType: !65, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !125, file: !129, line: 21, baseType: !360, size: 64, align: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !90, line: 102, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !90, line: 102, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !125, file: !129, line: 22, baseType: !58, size: 32, align: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !125, file: !129, line: 25, baseType: !365, size: 128, align: 64, offset: 640)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 128, align: 64, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 2)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !125, file: !129, line: 26, baseType: !58, size: 32, align: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !125, file: !129, line: 27, baseType: !58, size: 32, align: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !125, file: !129, line: 29, baseType: !371, size: 64, align: 64, offset: 832)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !90, line: 103, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !90, line: 103, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !125, file: !129, line: 30, baseType: !117, size: 64, align: 64, offset: 896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !125, file: !129, line: 32, baseType: !95, size: 64, align: 64, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !125, file: !129, line: 33, baseType: !95, size: 64, align: 64, offset: 1024)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !125, file: !129, line: 34, baseType: !95, size: 64, align: 64, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !125, file: !129, line: 35, baseType: !65, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !125, file: !129, line: 36, baseType: !65, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !125, file: !129, line: 37, baseType: !65, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !125, file: !129, line: 38, baseType: !65, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !125, file: !129, line: 40, baseType: !383, size: 128, align: 64, offset: 1216)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !56, line: 504, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !56, line: 506, size: 128, align: 64, elements: !385)
!385 = !{!386, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !384, file: !56, line: 508, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !56, line: 48, baseType: !75)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !384, file: !56, line: 509, baseType: !387, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !125, file: !129, line: 41, baseType: !347, size: 64, align: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !125, file: !129, line: 42, baseType: !58, size: 32, align: 32, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !125, file: !129, line: 44, baseType: !100, size: 64, align: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !125, file: !129, line: 45, baseType: !100, size: 64, align: 64, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !125, file: !129, line: 53, baseType: !394, size: 64, align: 64, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !123, !397, !58}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !125, file: !129, line: 55, baseType: !400, size: 64, align: 64, offset: 1664)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!58, !123, !96}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !125, file: !129, line: 57, baseType: !404, size: 64, align: 64, offset: 1728)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!58, !123, !397}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !125, file: !129, line: 60, baseType: !408, size: 64, align: 64, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!397, !123}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !125, file: !129, line: 62, baseType: !412, size: 64, align: 64, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !123, !397, !397, !58}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !125, file: !129, line: 65, baseType: !416, size: 64, align: 64, offset: 1920)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !123, !397, !397}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !125, file: !129, line: 69, baseType: !421, size: 64, align: 64, offset: 1984)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !123, !397}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !90, line: 109, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !90, line: 109, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !125, file: !129, line: 70, baseType: !428, size: 64, align: 64, offset: 2048)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !123, !397}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !90, line: 110, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !90, line: 110, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !125, file: !129, line: 71, baseType: !435, size: 64, align: 64, offset: 2112)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!58, !397, !397}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !125, file: !129, line: 73, baseType: !435, size: 64, align: 64, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !110, file: !114, line: 9, baseType: !95, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !114, line: 10, baseType: !95, size: 64, align: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !110, file: !114, line: 11, baseType: !347, size: 64, align: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !110, file: !114, line: 12, baseType: !58, size: 32, align: 32, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !110, file: !114, line: 13, baseType: !95, size: 64, align: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !110, file: !114, line: 15, baseType: !445, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !108}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !110, file: !114, line: 17, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!397, !108}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !91, file: !36, line: 36, baseType: !123, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !91, file: !36, line: 37, baseType: !123, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !91, file: !36, line: 38, baseType: !95, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !91, file: !36, line: 40, baseType: !58, size: 32, align: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !91, file: !36, line: 41, baseType: !100, size: 64, align: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !91, file: !36, line: 43, baseType: !65, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !91, file: !36, line: 44, baseType: !65, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !91, file: !36, line: 45, baseType: !65, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !91, file: !36, line: 48, baseType: !461, size: 64, align: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !463, line: 14, baseType: !464)
!463 = !DIFile(filename: "../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 6, size: 256, align: 64, elements: !465)
!465 = !{!466, !467, !476, !477, !478}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !464, file: !463, line: 7, baseType: !95, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !464, file: !463, line: 9, baseType: !468, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !470, line: 37, baseType: !471)
!470 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !470, line: 39, size: 192, align: 64, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !470, line: 41, baseType: !59, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !470, line: 42, baseType: !468, size: 64, align: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !470, line: 43, baseType: !468, size: 64, align: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !464, file: !463, line: 10, baseType: !58, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !464, file: !463, line: 12, baseType: !58, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !464, file: !463, line: 13, baseType: !58, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !91, file: !36, line: 49, baseType: !95, size: 64, align: 64, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !91, file: !36, line: 51, baseType: !58, size: 32, align: 32, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !91, file: !36, line: 52, baseType: !95, size: 64, align: 64, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !91, file: !36, line: 54, baseType: !347, size: 64, align: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !91, file: !36, line: 55, baseType: !347, size: 64, align: 64, offset: 1024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !91, file: !36, line: 57, baseType: !95, size: 64, align: 64, offset: 1088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !91, file: !36, line: 58, baseType: !50, size: 64, align: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !91, file: !36, line: 60, baseType: !50, size: 64, align: 64, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "screen_win", scope: !85, file: !84, line: 19, baseType: !488, size: 64, align: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "TERM_WINDOW", file: !490, line: 4, baseType: !491)
!490 = !DIFile(filename: "term.h", directory: "/home/lichi/Desktop/irssi/task1")
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_TERM_WINDOW", file: !490, line: 4, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_windows", scope: !85, file: !84, line: 20, baseType: !58, size: 32, align: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !85, file: !84, line: 22, baseType: !58, size: 32, align: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !85, file: !84, line: 22, baseType: !58, size: 32, align: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !85, file: !84, line: 23, baseType: !58, size: 32, align: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "last_column", scope: !85, file: !84, line: 23, baseType: !58, size: 32, align: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !85, file: !84, line: 24, baseType: !58, size: 32, align: 32, offset: 288)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !85, file: !84, line: 24, baseType: !58, size: 32, align: 32, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "statusbars", scope: !85, file: !84, line: 26, baseType: !100, size: 64, align: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_top", scope: !85, file: !84, line: 27, baseType: !58, size: 32, align: 32, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines_bottom", scope: !85, file: !84, line: 27, baseType: !58, size: 32, align: 32, offset: 480)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_lines", scope: !85, file: !84, line: 28, baseType: !58, size: 32, align: 32, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_left", scope: !85, file: !84, line: 29, baseType: !58, size: 32, align: 32, offset: 544)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns_right", scope: !85, file: !84, line: 29, baseType: !58, size: 32, align: 32, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "statusbar_columns", scope: !85, file: !84, line: 30, baseType: !58, size: 32, align: 32, offset: 608)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !85, file: !84, line: 32, baseType: !65, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "size_dirty", scope: !85, file: !84, line: 33, baseType: !65, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !79, file: !78, line: 15, baseType: !509, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_VIEW_REC", file: !511, line: 7, baseType: !512)
!511 = !DIFile(filename: "textbuffer-view.h", directory: "/home/lichi/Desktop/irssi/task1")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_BUFFER_VIEW_REC", file: !511, line: 50, size: 960, align: 64, elements: !513)
!513 = !{!514, !555, !556, !557, !558, !559, !560, !565, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !512, file: !511, line: 51, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_REC", file: !517, line: 72, baseType: !518)
!517 = !DIFile(filename: "textbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 60, size: 448, align: 64, elements: !519)
!519 = !{!520, !521, !538, !539, !540, !551, !552, !553, !554}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "text_chunks", scope: !518, file: !517, line: 61, baseType: !100, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "first_line", scope: !518, file: !517, line: 62, baseType: !522, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_REC", file: !517, line: 52, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LINE_REC", file: !517, line: 34, size: 320, align: 64, elements: !525)
!525 = !{!526, !528, !529, !532}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !517, line: 48, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !524, file: !517, line: 48, baseType: !527, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !524, file: !517, line: 50, baseType: !530, size: 64, align: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !524, file: !517, line: 51, baseType: !533, size: 128, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINE_INFO_REC", file: !517, line: 32, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 29, size: 128, align: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !534, file: !517, line: 30, baseType: !58, size: 32, align: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !534, file: !517, line: 31, baseType: !347, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lines_count", scope: !518, file: !517, line: 63, baseType: !58, size: 32, align: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "cur_line", scope: !518, file: !517, line: 65, baseType: !522, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cur_text", scope: !518, file: !517, line: 66, baseType: !541, size: 64, align: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_CHUNK_REC", file: !517, line: 58, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !517, line: 54, size: 131008, align: 32, elements: !544)
!544 = !{!545, !549, !550}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !543, file: !517, line: 55, baseType: !546, size: 130944, align: 8)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 130944, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 16368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !543, file: !517, line: 56, baseType: !58, size: 32, align: 32, offset: 130944)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !543, file: !517, line: 57, baseType: !58, size: 32, align: 32, offset: 130976)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "last_fg", scope: !518, file: !517, line: 68, baseType: !58, size: 32, align: 32, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "last_bg", scope: !518, file: !517, line: 69, baseType: !58, size: 32, align: 32, offset: 352)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "last_flags", scope: !518, file: !517, line: 70, baseType: !58, size: 32, align: 32, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "last_eol", scope: !518, file: !517, line: 71, baseType: !65, size: 1, align: 32, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "siblings", scope: !512, file: !511, line: 53, baseType: !100, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !512, file: !511, line: 55, baseType: !488, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !512, file: !511, line: 56, baseType: !58, size: 32, align: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !512, file: !511, line: 56, baseType: !58, size: 32, align: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent", scope: !512, file: !511, line: 58, baseType: !58, size: 32, align: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "default_indent_func", scope: !512, file: !511, line: 59, baseType: !561, size: 64, align: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "INDENT_FUNC", file: !511, line: 10, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!58, !509, !522, !58}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !512, file: !511, line: 61, baseType: !566, size: 64, align: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_BUFFER_CACHE_REC", file: !511, line: 48, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 37, size: 192, align: 64, elements: !569)
!569 = !{!570, !571, !572, !573, !574}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !568, file: !511, line: 38, baseType: !58, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !568, file: !511, line: 39, baseType: !58, size: 32, align: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "line_cache", scope: !568, file: !511, line: 41, baseType: !117, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "update_counter", scope: !568, file: !511, line: 45, baseType: !531, size: 8, align: 8, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "last_linecount", scope: !568, file: !511, line: 47, baseType: !58, size: 32, align: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !512, file: !511, line: 63, baseType: !58, size: 32, align: 32, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "startline", scope: !512, file: !511, line: 66, baseType: !522, size: 64, align: 64, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "subline", scope: !512, file: !511, line: 68, baseType: !58, size: 32, align: 32, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_startline", scope: !512, file: !511, line: 71, baseType: !522, size: 64, align: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_subline", scope: !512, file: !511, line: 72, baseType: !58, size: 32, align: 32, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bookmarks", scope: !512, file: !511, line: 76, baseType: !117, size: 64, align: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hidden_level", scope: !512, file: !511, line: 79, baseType: !58, size: 32, align: 32, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "empty_linecount", scope: !512, file: !511, line: 82, baseType: !58, size: 32, align: 32, offset: 864)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "longword_noindent", scope: !512, file: !511, line: 84, baseType: !65, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !512, file: !511, line: 86, baseType: !65, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !512, file: !511, line: 88, baseType: !65, size: 1, align: 32, offset: 898, flags: DIFlagBitField, extraData: i64 896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "break_wide", scope: !512, file: !511, line: 90, baseType: !65, size: 1, align: 32, offset: 899, flags: DIFlagBitField, extraData: i64 896)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !512, file: !511, line: 92, baseType: !65, size: 1, align: 32, offset: 900, flags: DIFlagBitField, extraData: i64 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "more_text", scope: !512, file: !511, line: 94, baseType: !65, size: 1, align: 32, offset: 901, flags: DIFlagBitField, extraData: i64 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !512, file: !511, line: 96, baseType: !65, size: 1, align: 32, offset: 902, flags: DIFlagBitField, extraData: i64 896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !79, file: !78, line: 17, baseType: !65, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "use_scroll", scope: !79, file: !78, line: 18, baseType: !65, size: 1, align: 32, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !79, file: !78, line: 20, baseType: !65, size: 1, align: 32, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "use_insert_after", scope: !79, file: !78, line: 21, baseType: !65, size: 1, align: 32, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after", scope: !79, file: !78, line: 22, baseType: !522, size: 64, align: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "insert_after_time", scope: !79, file: !78, line: 23, baseType: !347, size: 64, align: 64, offset: 256)
!596 = !{!597, !599, !600, !601, !602, !603, !604}
!597 = distinct !DIGlobalVariable(name: "activity_list", scope: !0, file: !598, line: 34, type: !468, isLocal: true, isDefinition: true, variable: %struct._GList** @activity_list)
!598 = !DIFile(filename: "statusbar-items.c", directory: "/home/lichi/Desktop/irssi/task1")
!599 = distinct !DIGlobalVariable(name: "more_visible", scope: !0, file: !598, line: 36, type: !100, isLocal: true, isDefinition: true, variable: %struct._GSList** @more_visible)
!600 = distinct !DIGlobalVariable(name: "input_entries", scope: !0, file: !598, line: 37, type: !117, isLocal: true, isDefinition: true, variable: %struct._GHashTable** @input_entries)
!601 = distinct !DIGlobalVariable(name: "last_lag", scope: !0, file: !598, line: 38, type: !58, isLocal: true, isDefinition: true, variable: i32* @last_lag)
!602 = distinct !DIGlobalVariable(name: "last_lag_unknown", scope: !0, file: !598, line: 38, type: !58, isLocal: true, isDefinition: true, variable: i32* @last_lag_unknown)
!603 = distinct !DIGlobalVariable(name: "lag_timeout_tag", scope: !0, file: !598, line: 38, type: !58, isLocal: true, isDefinition: true, variable: i32* @lag_timeout_tag)
!604 = distinct !DIGlobalVariable(name: "actlist_sort", scope: !0, file: !598, line: 35, type: !605, isLocal: true, isDefinition: true, variable: i8* @actlist_sort)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint8", file: !188, line: 38, baseType: !531)
!606 = !{i32 2, !"Dwarf Version", i32 4}
!607 = !{i32 2, !"Debug Info Version", i32 3}
!608 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!609 = distinct !DISubprogram(name: "statusbar_items_init", scope: !598, file: !598, line: 468, type: !271, isLocal: false, isDefinition: true, scopeLine: 469, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!610 = !{}
!611 = !DILocation(line: 470, column: 2, scope: !609)
!612 = !DILocation(line: 471, column: 2, scope: !609)
!613 = !DILocation(line: 472, column: 2, scope: !609)
!614 = !DILocation(line: 474, column: 2, scope: !609)
!615 = !DILocation(line: 475, column: 2, scope: !609)
!616 = !DILocation(line: 476, column: 2, scope: !609)
!617 = !DILocation(line: 477, column: 2, scope: !609)
!618 = !DILocation(line: 478, column: 2, scope: !609)
!619 = !DILocation(line: 479, column: 2, scope: !609)
!620 = !DILocation(line: 480, column: 2, scope: !609)
!621 = !DILocation(line: 481, column: 2, scope: !609)
!622 = !DILocation(line: 482, column: 2, scope: !609)
!623 = !DILocation(line: 483, column: 2, scope: !609)
!624 = !DILocation(line: 486, column: 16, scope: !609)
!625 = !DILocation(line: 487, column: 2, scope: !609)
!626 = !DILocation(line: 488, column: 2, scope: !609)
!627 = !DILocation(line: 489, column: 2, scope: !609)
!628 = !DILocation(line: 492, column: 22, scope: !609)
!629 = !DILocation(line: 493, column: 2, scope: !609)
!630 = !DILocation(line: 494, column: 2, scope: !609)
!631 = !DILocation(line: 495, column: 2, scope: !609)
!632 = !DILocation(line: 496, column: 2, scope: !609)
!633 = !DILocation(line: 497, column: 2, scope: !609)
!634 = !DILocation(line: 500, column: 11, scope: !609)
!635 = !DILocation(line: 500, column: 33, scope: !609)
!636 = !DILocation(line: 501, column: 2, scope: !609)
!637 = !DILocation(line: 502, column: 2, scope: !609)
!638 = !DILocation(line: 503, column: 2, scope: !609)
!639 = !DILocation(line: 504, column: 27, scope: !609)
!640 = !DILocation(line: 504, column: 25, scope: !609)
!641 = !DILocation(line: 507, column: 18, scope: !609)
!642 = !DILocation(line: 507, column: 16, scope: !609)
!643 = !DILocation(line: 510, column: 2, scope: !609)
!644 = !DILocation(line: 511, column: 9, scope: !609)
!645 = !DILocation(line: 512, column: 1, scope: !609)
!646 = distinct !DISubprogram(name: "item_window_active", scope: !598, file: !598, line: 40, type: !647, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !649, !58}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBAR_ITEM_REC", file: !651, line: 11, baseType: !652)
!651 = !DIFile(filename: "statusbar.h", directory: "/home/lichi/Desktop/irssi/task1")
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBAR_ITEM_REC", file: !651, line: 71, size: 384, align: 64, elements: !653)
!653 = !{!654, !684, !693, !700, !701, !702, !703, !704, !705}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !652, file: !651, line: 72, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_REC", file: !651, line: 61, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !651, line: 49, size: 448, align: 64, elements: !658)
!658 = !{!659, !667, !678, !679, !680, !681, !682, !683}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !657, file: !651, line: 50, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_GROUP_REC", file: !651, line: 36, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !651, line: 32, size: 192, align: 64, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !662, file: !651, line: 33, baseType: !95, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "config_bars", scope: !662, file: !651, line: 34, baseType: !100, size: 64, align: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bars", scope: !662, file: !651, line: 35, baseType: !100, size: 64, align: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !657, file: !651, line: 51, baseType: !668, size: 64, align: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_CONFIG_REC", file: !651, line: 47, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !651, line: 38, size: 256, align: 64, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !670, file: !651, line: 39, baseType: !95, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !651, line: 41, baseType: !58, size: 32, align: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "placement", scope: !670, file: !651, line: 42, baseType: !58, size: 32, align: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !670, file: !651, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "visible", scope: !670, file: !651, line: 44, baseType: !58, size: 32, align: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !670, file: !651, line: 46, baseType: !100, size: 64, align: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parent_window", scope: !657, file: !651, line: 53, baseType: !82, size: 64, align: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !657, file: !651, line: 54, baseType: !100, size: 64, align: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !657, file: !651, line: 56, baseType: !95, size: 64, align: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "real_ypos", scope: !657, file: !651, line: 57, baseType: !58, size: 32, align: 32, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !657, file: !651, line: 59, baseType: !65, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_xpos", scope: !657, file: !651, line: 60, baseType: !58, size: 32, align: 32, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !652, file: !651, line: 73, baseType: !685, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBAR_ITEM_CONFIG_REC", file: !651, line: 69, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !651, line: 63, size: 192, align: 64, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !687, file: !651, line: 64, baseType: !95, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !687, file: !651, line: 65, baseType: !95, size: 64, align: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !687, file: !651, line: 67, baseType: !58, size: 32, align: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "right_alignment", scope: !687, file: !651, line: 68, baseType: !65, size: 1, align: 32, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !652, file: !651, line: 74, baseType: !694, size: 64, align: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "STATUSBAR_FUNC", file: !695, line: 6, baseType: !696)
!695 = !DIFile(filename: "statusbar-item.h", directory: "/home/lichi/Desktop/irssi/task1")
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !699, !58}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !652, file: !651, line: 77, baseType: !58, size: 32, align: 32, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !652, file: !651, line: 77, baseType: !58, size: 32, align: 32, offset: 224)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !652, file: !651, line: 80, baseType: !58, size: 32, align: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !652, file: !651, line: 80, baseType: !58, size: 32, align: 32, offset: 288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "current_size", scope: !652, file: !651, line: 82, baseType: !58, size: 32, align: 32, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !652, file: !651, line: 83, baseType: !65, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!706 = !DILocalVariable(name: "item", arg: 1, scope: !646, file: !598, line: 40, type: !649)
!707 = !DIExpression()
!708 = !DILocation(line: 40, column: 47, scope: !646)
!709 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !646, file: !598, line: 40, type: !58)
!710 = !DILocation(line: 40, column: 57, scope: !646)
!711 = !DILocalVariable(name: "window", scope: !646, file: !598, line: 42, type: !88)
!712 = !DILocation(line: 42, column: 14, scope: !646)
!713 = !DILocation(line: 44, column: 18, scope: !646)
!714 = !DILocation(line: 44, column: 16, scope: !646)
!715 = !DILocation(line: 45, column: 6, scope: !716)
!716 = distinct !DILexicalBlock(scope: !646, file: !598, line: 45, column: 6)
!717 = !DILocation(line: 45, column: 12, scope: !716)
!718 = !DILocation(line: 45, column: 17, scope: !716)
!719 = !DILocation(line: 45, column: 31, scope: !716)
!720 = !DILocation(line: 45, column: 6, scope: !646)
!721 = !DILocation(line: 46, column: 12, scope: !716)
!722 = !DILocation(line: 46, column: 18, scope: !716)
!723 = !DILocation(line: 46, column: 23, scope: !716)
!724 = !DILocation(line: 46, column: 38, scope: !716)
!725 = !DILocation(line: 46, column: 10, scope: !716)
!726 = !DILocation(line: 46, column: 3, scope: !716)
!727 = !DILocation(line: 48, column: 6, scope: !728)
!728 = distinct !DILexicalBlock(scope: !646, file: !598, line: 48, column: 6)
!729 = !DILocation(line: 48, column: 13, scope: !728)
!730 = !DILocation(line: 48, column: 20, scope: !728)
!731 = !DILocation(line: 48, column: 23, scope: !732)
!732 = !DILexicalBlockFile(scope: !728, file: !598, discriminator: 1)
!733 = !DILocation(line: 48, column: 31, scope: !732)
!734 = !DILocation(line: 48, column: 38, scope: !732)
!735 = !DILocation(line: 48, column: 6, scope: !732)
!736 = !DILocation(line: 49, column: 34, scope: !737)
!737 = distinct !DILexicalBlock(scope: !728, file: !598, line: 48, column: 47)
!738 = !DILocation(line: 49, column: 40, scope: !737)
!739 = !DILocation(line: 49, column: 3, scope: !737)
!740 = !DILocation(line: 51, column: 2, scope: !737)
!741 = !DILocation(line: 51, column: 13, scope: !742)
!742 = !DILexicalBlockFile(scope: !743, file: !598, discriminator: 1)
!743 = distinct !DILexicalBlock(scope: !728, file: !598, line: 51, column: 13)
!744 = !DILocation(line: 52, column: 34, scope: !745)
!745 = distinct !DILexicalBlock(scope: !743, file: !598, line: 51, column: 28)
!746 = !DILocation(line: 52, column: 40, scope: !745)
!747 = !DILocation(line: 52, column: 49, scope: !745)
!748 = !DILocation(line: 52, column: 17, scope: !745)
!749 = !DILocation(line: 52, column: 23, scope: !745)
!750 = !DILocation(line: 52, column: 32, scope: !745)
!751 = !DILocation(line: 53, column: 2, scope: !745)
!752 = !DILocation(line: 54, column: 1, scope: !646)
!753 = distinct !DISubprogram(name: "item_window_empty", scope: !598, file: !598, line: 56, type: !647, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!754 = !DILocalVariable(name: "item", arg: 1, scope: !753, file: !598, line: 56, type: !649)
!755 = !DILocation(line: 56, column: 46, scope: !753)
!756 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !753, file: !598, line: 56, type: !58)
!757 = !DILocation(line: 56, column: 56, scope: !753)
!758 = !DILocalVariable(name: "window", scope: !753, file: !598, line: 58, type: !88)
!759 = !DILocation(line: 58, column: 14, scope: !753)
!760 = !DILocation(line: 60, column: 18, scope: !753)
!761 = !DILocation(line: 60, column: 16, scope: !753)
!762 = !DILocation(line: 61, column: 6, scope: !763)
!763 = distinct !DILexicalBlock(scope: !753, file: !598, line: 61, column: 6)
!764 = !DILocation(line: 61, column: 12, scope: !763)
!765 = !DILocation(line: 61, column: 17, scope: !763)
!766 = !DILocation(line: 61, column: 31, scope: !763)
!767 = !DILocation(line: 61, column: 6, scope: !753)
!768 = !DILocation(line: 62, column: 12, scope: !763)
!769 = !DILocation(line: 62, column: 18, scope: !763)
!770 = !DILocation(line: 62, column: 23, scope: !763)
!771 = !DILocation(line: 62, column: 38, scope: !763)
!772 = !DILocation(line: 62, column: 10, scope: !763)
!773 = !DILocation(line: 62, column: 3, scope: !763)
!774 = !DILocation(line: 64, column: 6, scope: !775)
!775 = distinct !DILexicalBlock(scope: !753, file: !598, line: 64, column: 6)
!776 = !DILocation(line: 64, column: 13, scope: !775)
!777 = !DILocation(line: 64, column: 20, scope: !775)
!778 = !DILocation(line: 64, column: 23, scope: !779)
!779 = !DILexicalBlockFile(scope: !775, file: !598, discriminator: 1)
!780 = !DILocation(line: 64, column: 31, scope: !779)
!781 = !DILocation(line: 64, column: 38, scope: !779)
!782 = !DILocation(line: 64, column: 6, scope: !779)
!783 = !DILocation(line: 65, column: 34, scope: !784)
!784 = distinct !DILexicalBlock(scope: !775, file: !598, line: 64, column: 47)
!785 = !DILocation(line: 65, column: 40, scope: !784)
!786 = !DILocation(line: 65, column: 3, scope: !784)
!787 = !DILocation(line: 67, column: 2, scope: !784)
!788 = !DILocation(line: 67, column: 13, scope: !789)
!789 = !DILexicalBlockFile(scope: !790, file: !598, discriminator: 1)
!790 = distinct !DILexicalBlock(scope: !775, file: !598, line: 67, column: 13)
!791 = !DILocation(line: 68, column: 34, scope: !792)
!792 = distinct !DILexicalBlock(scope: !790, file: !598, line: 67, column: 28)
!793 = !DILocation(line: 68, column: 40, scope: !792)
!794 = !DILocation(line: 68, column: 49, scope: !792)
!795 = !DILocation(line: 68, column: 17, scope: !792)
!796 = !DILocation(line: 68, column: 23, scope: !792)
!797 = !DILocation(line: 68, column: 32, scope: !792)
!798 = !DILocation(line: 69, column: 2, scope: !792)
!799 = !DILocation(line: 70, column: 1, scope: !753)
!800 = distinct !DISubprogram(name: "item_lag", scope: !598, file: !598, line: 351, type: !647, isLocal: true, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!801 = !DILocalVariable(name: "item", arg: 1, scope: !800, file: !598, line: 351, type: !649)
!802 = !DILocation(line: 351, column: 37, scope: !800)
!803 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !800, file: !598, line: 351, type: !58)
!804 = !DILocation(line: 351, column: 47, scope: !800)
!805 = !DILocalVariable(name: "server", scope: !800, file: !598, line: 353, type: !123)
!806 = !DILocation(line: 353, column: 14, scope: !800)
!807 = !DILocalVariable(name: "str", scope: !800, file: !598, line: 354, type: !808)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 176, align: 8, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 22)
!811 = !DILocation(line: 354, column: 14, scope: !800)
!812 = !DILocalVariable(name: "lag", scope: !800, file: !598, line: 355, type: !58)
!813 = !DILocation(line: 355, column: 6, scope: !800)
!814 = !DILocalVariable(name: "lag_unknown", scope: !800, file: !598, line: 355, type: !58)
!815 = !DILocation(line: 355, column: 11, scope: !800)
!816 = !DILocation(line: 357, column: 11, scope: !800)
!817 = !DILocation(line: 357, column: 22, scope: !800)
!818 = !DILocation(line: 357, column: 11, scope: !819)
!819 = !DILexicalBlockFile(scope: !800, file: !598, discriminator: 1)
!820 = !DILocation(line: 357, column: 38, scope: !821)
!821 = !DILexicalBlockFile(scope: !800, file: !598, discriminator: 2)
!822 = !DILocation(line: 357, column: 50, scope: !821)
!823 = !DILocation(line: 357, column: 11, scope: !821)
!824 = !DILocation(line: 357, column: 11, scope: !825)
!825 = !DILexicalBlockFile(scope: !800, file: !598, discriminator: 3)
!826 = !DILocation(line: 357, column: 9, scope: !825)
!827 = !DILocation(line: 358, column: 16, scope: !800)
!828 = !DILocation(line: 358, column: 8, scope: !800)
!829 = !DILocation(line: 358, column: 6, scope: !800)
!830 = !DILocation(line: 360, column: 6, scope: !831)
!831 = distinct !DILexicalBlock(scope: !800, file: !598, line: 360, column: 6)
!832 = !DILocation(line: 360, column: 10, scope: !831)
!833 = !DILocation(line: 360, column: 15, scope: !831)
!834 = !DILocation(line: 360, column: 18, scope: !835)
!835 = !DILexicalBlockFile(scope: !831, file: !598, discriminator: 1)
!836 = !DILocation(line: 360, column: 24, scope: !835)
!837 = !DILocation(line: 360, column: 22, scope: !835)
!838 = !DILocation(line: 360, column: 6, scope: !835)
!839 = !DILocation(line: 362, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !598, line: 362, column: 7)
!841 = distinct !DILexicalBlock(scope: !831, file: !598, line: 360, column: 59)
!842 = !DILocation(line: 362, column: 7, scope: !841)
!843 = !DILocation(line: 363, column: 21, scope: !840)
!844 = !DILocation(line: 363, column: 27, scope: !840)
!845 = !DILocation(line: 363, column: 36, scope: !840)
!846 = !DILocation(line: 363, column: 4, scope: !840)
!847 = !DILocation(line: 363, column: 10, scope: !840)
!848 = !DILocation(line: 363, column: 19, scope: !840)
!849 = !DILocation(line: 364, column: 3, scope: !841)
!850 = !DILocation(line: 367, column: 6, scope: !800)
!851 = !DILocation(line: 368, column: 13, scope: !800)
!852 = !DILocation(line: 368, column: 11, scope: !800)
!853 = !DILocation(line: 369, column: 21, scope: !800)
!854 = !DILocation(line: 369, column: 19, scope: !800)
!855 = !DILocation(line: 371, column: 6, scope: !856)
!856 = distinct !DILexicalBlock(scope: !800, file: !598, line: 371, column: 6)
!857 = !DILocation(line: 371, column: 6, scope: !800)
!858 = !DILocation(line: 374, column: 14, scope: !859)
!859 = distinct !DILexicalBlock(scope: !856, file: !598, line: 371, column: 19)
!860 = !DILocation(line: 374, column: 45, scope: !859)
!861 = !DILocation(line: 374, column: 49, scope: !859)
!862 = !DILocation(line: 374, column: 3, scope: !859)
!863 = !DILocation(line: 375, column: 2, scope: !859)
!864 = !DILocation(line: 376, column: 7, scope: !865)
!865 = distinct !DILexicalBlock(scope: !866, file: !598, line: 376, column: 7)
!866 = distinct !DILexicalBlock(scope: !856, file: !598, line: 375, column: 9)
!867 = !DILocation(line: 376, column: 11, scope: !865)
!868 = !DILocation(line: 376, column: 17, scope: !865)
!869 = !DILocation(line: 376, column: 7, scope: !866)
!870 = !DILocation(line: 377, column: 15, scope: !865)
!871 = !DILocation(line: 377, column: 39, scope: !865)
!872 = !DILocation(line: 377, column: 43, scope: !865)
!873 = !DILocation(line: 377, column: 4, scope: !865)
!874 = !DILocation(line: 379, column: 15, scope: !865)
!875 = !DILocation(line: 379, column: 44, scope: !865)
!876 = !DILocation(line: 379, column: 48, scope: !865)
!877 = !DILocation(line: 379, column: 55, scope: !865)
!878 = !DILocation(line: 379, column: 59, scope: !865)
!879 = !DILocation(line: 379, column: 4, scope: !865)
!880 = !DILocation(line: 382, column: 33, scope: !800)
!881 = !DILocation(line: 382, column: 39, scope: !800)
!882 = !DILocation(line: 383, column: 17, scope: !800)
!883 = !DILocation(line: 382, column: 2, scope: !800)
!884 = !DILocation(line: 384, column: 1, scope: !800)
!885 = !DILocation(line: 384, column: 1, scope: !819)
!886 = distinct !DISubprogram(name: "item_act", scope: !598, file: !598, line: 143, type: !647, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!887 = !DILocalVariable(name: "item", arg: 1, scope: !886, file: !598, line: 143, type: !649)
!888 = !DILocation(line: 143, column: 37, scope: !886)
!889 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !886, file: !598, line: 143, type: !58)
!890 = !DILocation(line: 143, column: 47, scope: !886)
!891 = !DILocalVariable(name: "actlist", scope: !886, file: !598, line: 145, type: !95)
!892 = !DILocation(line: 145, column: 8, scope: !886)
!893 = !DILocalVariable(name: "max_size", scope: !886, file: !598, line: 146, type: !58)
!894 = !DILocation(line: 146, column: 6, scope: !886)
!895 = !DILocation(line: 148, column: 6, scope: !896)
!896 = distinct !DILexicalBlock(scope: !886, file: !598, line: 148, column: 6)
!897 = !DILocation(line: 148, column: 6, scope: !886)
!898 = !DILocation(line: 149, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !900, file: !598, line: 149, column: 7)
!900 = distinct !DILexicalBlock(scope: !896, file: !598, line: 148, column: 21)
!901 = !DILocation(line: 149, column: 21, scope: !899)
!902 = !DILocation(line: 149, column: 7, scope: !900)
!903 = !DILocation(line: 150, column: 21, scope: !899)
!904 = !DILocation(line: 150, column: 27, scope: !899)
!905 = !DILocation(line: 150, column: 36, scope: !899)
!906 = !DILocation(line: 150, column: 4, scope: !899)
!907 = !DILocation(line: 150, column: 10, scope: !899)
!908 = !DILocation(line: 150, column: 19, scope: !899)
!909 = !DILocation(line: 153, column: 3, scope: !900)
!910 = !DILocation(line: 156, column: 30, scope: !886)
!911 = !DILocation(line: 156, column: 36, scope: !886)
!912 = !DILocation(line: 156, column: 41, scope: !886)
!913 = !DILocation(line: 156, column: 12, scope: !886)
!914 = !DILocation(line: 156, column: 10, scope: !886)
!915 = !DILocation(line: 157, column: 6, scope: !916)
!916 = distinct !DILexicalBlock(scope: !886, file: !598, line: 157, column: 6)
!917 = !DILocation(line: 157, column: 14, scope: !916)
!918 = !DILocation(line: 157, column: 6, scope: !886)
!919 = !DILocation(line: 158, column: 3, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !598, line: 157, column: 22)
!921 = !DILocation(line: 161, column: 13, scope: !886)
!922 = !DILocation(line: 161, column: 19, scope: !886)
!923 = !DILocation(line: 161, column: 11, scope: !886)
!924 = !DILocation(line: 162, column: 33, scope: !886)
!925 = !DILocation(line: 163, column: 17, scope: !886)
!926 = !DILocation(line: 162, column: 2, scope: !886)
!927 = !DILocation(line: 164, column: 33, scope: !886)
!928 = !DILocation(line: 165, column: 17, scope: !886)
!929 = !DILocation(line: 164, column: 2, scope: !886)
!930 = !DILocation(line: 166, column: 6, scope: !931)
!931 = distinct !DILexicalBlock(scope: !886, file: !598, line: 166, column: 6)
!932 = !DILocation(line: 166, column: 18, scope: !931)
!933 = !DILocation(line: 166, column: 24, scope: !931)
!934 = !DILocation(line: 166, column: 15, scope: !931)
!935 = !DILocation(line: 166, column: 6, scope: !886)
!936 = !DILocation(line: 170, column: 22, scope: !937)
!937 = distinct !DILexicalBlock(scope: !931, file: !598, line: 166, column: 34)
!938 = !DILocation(line: 170, column: 28, scope: !937)
!939 = !DILocation(line: 170, column: 34, scope: !937)
!940 = !DILocation(line: 170, column: 3, scope: !937)
!941 = !DILocation(line: 170, column: 9, scope: !937)
!942 = !DILocation(line: 170, column: 14, scope: !937)
!943 = !DILocation(line: 170, column: 20, scope: !937)
!944 = !DILocation(line: 171, column: 20, scope: !937)
!945 = !DILocation(line: 171, column: 26, scope: !937)
!946 = !DILocation(line: 171, column: 3, scope: !937)
!947 = !DILocation(line: 172, column: 3, scope: !937)
!948 = !DILocation(line: 173, column: 2, scope: !937)
!949 = !DILocation(line: 175, column: 9, scope: !886)
!950 = !DILocation(line: 175, column: 2, scope: !886)
!951 = !DILocation(line: 176, column: 1, scope: !886)
!952 = !DILocation(line: 176, column: 1, scope: !953)
!953 = !DILexicalBlockFile(scope: !886, file: !598, discriminator: 1)
!954 = distinct !DISubprogram(name: "item_more", scope: !598, file: !598, line: 281, type: !647, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!955 = !DILocalVariable(name: "item", arg: 1, scope: !954, file: !598, line: 281, type: !649)
!956 = !DILocation(line: 281, column: 38, scope: !954)
!957 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !954, file: !598, line: 281, type: !58)
!958 = !DILocation(line: 281, column: 48, scope: !954)
!959 = !DILocalVariable(name: "mainwin", scope: !954, file: !598, line: 283, type: !82)
!960 = !DILocation(line: 283, column: 26, scope: !954)
!961 = !DILocalVariable(name: "visible", scope: !954, file: !598, line: 284, type: !58)
!962 = !DILocation(line: 284, column: 6, scope: !954)
!963 = !DILocation(line: 286, column: 6, scope: !964)
!964 = distinct !DILexicalBlock(scope: !954, file: !598, line: 286, column: 6)
!965 = !DILocation(line: 286, column: 17, scope: !964)
!966 = !DILocation(line: 286, column: 6, scope: !954)
!967 = !DILocation(line: 287, column: 25, scope: !968)
!968 = distinct !DILexicalBlock(scope: !964, file: !598, line: 286, column: 25)
!969 = !DILocation(line: 288, column: 11, scope: !968)
!970 = !DILocation(line: 289, column: 2, scope: !968)
!971 = !DILocation(line: 290, column: 36, scope: !972)
!972 = distinct !DILexicalBlock(scope: !964, file: !598, line: 289, column: 9)
!973 = !DILocation(line: 290, column: 49, scope: !972)
!974 = !DILocation(line: 290, column: 15, scope: !972)
!975 = !DILocation(line: 290, column: 61, scope: !972)
!976 = !DILocation(line: 290, column: 11, scope: !972)
!977 = !DILocation(line: 291, column: 35, scope: !972)
!978 = !DILocation(line: 291, column: 48, scope: !972)
!979 = !DILocation(line: 291, column: 14, scope: !972)
!980 = !DILocation(line: 291, column: 60, scope: !972)
!981 = !DILocation(line: 291, column: 66, scope: !972)
!982 = !DILocation(line: 291, column: 11, scope: !972)
!983 = !DILocation(line: 294, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !954, file: !598, line: 294, column: 6)
!985 = !DILocation(line: 294, column: 6, scope: !954)
!986 = !DILocation(line: 295, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !598, line: 295, column: 7)
!988 = distinct !DILexicalBlock(scope: !984, file: !598, line: 294, column: 16)
!989 = !DILocation(line: 295, column: 15, scope: !987)
!990 = !DILocation(line: 295, column: 7, scope: !988)
!991 = !DILocation(line: 296, column: 34, scope: !987)
!992 = !DILocation(line: 296, column: 48, scope: !987)
!993 = !DILocation(line: 296, column: 19, scope: !987)
!994 = !DILocation(line: 296, column: 17, scope: !987)
!995 = !DILocation(line: 296, column: 4, scope: !987)
!996 = !DILocation(line: 297, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !988, file: !598, line: 297, column: 7)
!998 = !DILocation(line: 297, column: 7, scope: !988)
!999 = !DILocation(line: 298, column: 21, scope: !997)
!1000 = !DILocation(line: 298, column: 27, scope: !997)
!1001 = !DILocation(line: 298, column: 36, scope: !997)
!1002 = !DILocation(line: 298, column: 4, scope: !997)
!1003 = !DILocation(line: 298, column: 10, scope: !997)
!1004 = !DILocation(line: 298, column: 19, scope: !997)
!1005 = !DILocation(line: 299, column: 3, scope: !988)
!1006 = !DILocation(line: 302, column: 33, scope: !954)
!1007 = !DILocation(line: 302, column: 47, scope: !954)
!1008 = !DILocation(line: 302, column: 17, scope: !954)
!1009 = !DILocation(line: 302, column: 15, scope: !954)
!1010 = !DILocation(line: 303, column: 33, scope: !954)
!1011 = !DILocation(line: 303, column: 39, scope: !954)
!1012 = !DILocation(line: 303, column: 2, scope: !954)
!1013 = !DILocation(line: 304, column: 1, scope: !954)
!1014 = !DILocation(line: 304, column: 1, scope: !1015)
!1015 = !DILexicalBlockFile(scope: !954, file: !598, discriminator: 1)
!1016 = distinct !DISubprogram(name: "item_input", scope: !598, file: !598, line: 415, type: !647, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !610)
!1017 = !DILocalVariable(name: "item", arg: 1, scope: !1016, file: !598, line: 415, type: !649)
!1018 = !DILocation(line: 415, column: 39, scope: !1016)
!1019 = !DILocalVariable(name: "get_size_only", arg: 2, scope: !1016, file: !598, line: 415, type: !58)
!1020 = !DILocation(line: 415, column: 49, scope: !1016)
!1021 = !DILocalVariable(name: "rec", scope: !1016, file: !598, line: 417, type: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUI_ENTRY_REC", file: !1024, line: 31, baseType: !1025)
!1024 = !DIFile(filename: "gui-entry.h", directory: "/home/lichi/Desktop/irssi/task1")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1024, line: 9, size: 640, align: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "text_len", scope: !1025, file: !1024, line: 10, baseType: !58, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "text_alloc", scope: !1025, file: !1024, line: 10, baseType: !58, size: 32, align: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1025, file: !1024, line: 11, baseType: !1030, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "unichar", file: !1032, line: 12, baseType: !200)
!1032 = !DIFile(filename: "../../src/core/utf8.h", directory: "/home/lichi/Desktop/irssi/task1")
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "extents", scope: !1025, file: !1024, line: 12, baseType: !419, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "kill_ring", scope: !1025, file: !1024, line: 14, baseType: !100, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "xpos", scope: !1025, file: !1024, line: 17, baseType: !58, size: 32, align: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ypos", scope: !1025, file: !1024, line: 17, baseType: !58, size: 32, align: 32, offset: 288)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1025, file: !1024, line: 17, baseType: !58, size: 32, align: 32, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1025, file: !1024, line: 18, baseType: !58, size: 32, align: 32, offset: 352)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "scrstart", scope: !1025, file: !1024, line: 18, baseType: !58, size: 32, align: 32, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "scrpos", scope: !1025, file: !1024, line: 18, baseType: !58, size: 32, align: 32, offset: 416)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "hidden", scope: !1025, file: !1024, line: 19, baseType: !58, size: 32, align: 32, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "promptlen", scope: !1025, file: !1024, line: 21, baseType: !58, size: 32, align: 32, offset: 480)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !1025, file: !1024, line: 22, baseType: !95, size: 64, align: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "redraw_needed_from", scope: !1025, file: !1024, line: 24, baseType: !58, size: 32, align: 32, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !1025, file: !1024, line: 25, baseType: !65, size: 1, align: 32, offset: 608, flags: DIFlagBitField, extraData: i64 608)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "previous_append_next_kill", scope: !1025, file: !1024, line: 27, baseType: !65, size: 1, align: 32, offset: 609, flags: DIFlagBitField, extraData: i64 608)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "append_next_kill", scope: !1025, file: !1024, line: 28, baseType: !65, size: 1, align: 32, offset: 610, flags: DIFlagBitField, extraData: i64 608)
