; ModuleID = './line178-dcc-server.o.i'
source_filename = "./line178-dcc-server.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IPADDR = type { i16, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.SERVER_DCC_REC = type { i32, i32, i64, %struct._IRC_SERVER_REC*, i8*, i8*, i8*, %struct.CHAT_DCC_REC*, i8*, i8*, %struct._IPADDR, [46 x i8], i32, %struct._GIOChannel*, i32, i32, i32, i64, i64, i32, i8, %struct._GHashTable*, %struct._NET_SENDBUF_REC*, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !56)
!1 = !DIFile(filename: "line178-dcc-server.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 25, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!38 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!39 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!40 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!41 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!42 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!43 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!44 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!45 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!46 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!47 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!48 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!49 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!50 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!51 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!52 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!53 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!54 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!55 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!56 = !{!57, !58, !62, !64, !787, !80, !423, !215, !413, !794, !798}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_DCC_REC", file: !66, line: 24, baseType: !67)
!66 = !DIFile(filename: "dcc-server.h", directory: "/home/lichi/Desktop/irssi/task1")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SERVER_DCC_REC", file: !66, line: 12, size: 1728, align: 64, elements: !68)
!68 = !{!69, !72, !73, !79, !728, !729, !730, !731, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !70, line: 1, baseType: !71, size: 32, align: 32)
!70 = !DIFile(filename: "dcc-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !67, file: !70, line: 2, baseType: !71, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !67, file: !70, line: 3, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !75, line: 75, baseType: !76)
!75 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !77, line: 139, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!78 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !67, file: !70, line: 5, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !82, line: 6, baseType: !83)
!82 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !84, line: 42, size: 39168, align: 64, elements: !85)
!84 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!85 = !{!86, !88, !89, !90, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !385, !386, !390, !391, !392, !396, !401, !402, !403, !404, !405, !406, !407, !408, !415, !416, !417, !418, !419, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !725, !727}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !87, line: 3, baseType: !71, size: 32, align: 32)
!87 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !83, file: !87, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !83, file: !87, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !83, file: !87, line: 8, baseType: !91, size: 64, align: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !82, line: 5, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !84, line: 24, size: 2496, align: 64, elements: !94)
!94 = !{!95, !97, !98, !99, !101, !102, !103, !104, !105, !107, !108, !109, !110, !111, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !96, line: 3, baseType: !71, size: 32, align: 32)
!96 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !93, file: !96, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !93, file: !96, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !93, file: !96, line: 9, baseType: !100, size: 64, align: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !93, file: !96, line: 10, baseType: !71, size: 32, align: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !93, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !93, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !93, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !93, file: !96, line: 13, baseType: !106, size: 16, align: 16, offset: 448)
!106 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !93, file: !96, line: 14, baseType: !100, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !93, file: !96, line: 15, baseType: !100, size: 64, align: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !93, file: !96, line: 16, baseType: !71, size: 32, align: 32, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !93, file: !96, line: 17, baseType: !100, size: 64, align: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !93, file: !96, line: 19, baseType: !112, size: 64, align: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !114, line: 99, baseType: !115)
!114 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !116, line: 22, size: 160, align: 32, elements: !117)
!116 = !DIFile(filename: "../../../src/core/network.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !115, file: !116, line: 23, baseType: !106, size: 16, align: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !115, file: !116, line: 24, baseType: !120, size: 128, align: 32, offset: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !121, line: 211, size: 128, align: 32, elements: !122)
!121 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/lichi/Desktop/irssi/task1")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !120, file: !121, line: 220, baseType: !124, size: 128, align: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !120, file: !121, line: 213, size: 128, align: 32, elements: !125)
!125 = !{!126, !133, !138}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !124, file: !121, line: 215, baseType: !127, size: 128, align: 8)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 128, align: 8, elements: !131)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 48, baseType: !130)
!129 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/irssi/task1")
!130 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!131 = !{!132}
!132 = !DISubrange(count: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !124, file: !121, line: 217, baseType: !134, size: 128, align: 16)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 128, align: 16, elements: !136)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !129, line: 49, baseType: !106)
!136 = !{!137}
!137 = !DISubrange(count: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !124, file: !121, line: 218, baseType: !139, size: 128, align: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, align: 32, elements: !142)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 51, baseType: !141)
!141 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !93, file: !96, line: 19, baseType: !112, size: 64, align: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !93, file: !96, line: 21, baseType: !100, size: 64, align: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !93, file: !96, line: 22, baseType: !100, size: 64, align: 64, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !93, file: !96, line: 23, baseType: !100, size: 64, align: 64, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !93, file: !96, line: 24, baseType: !100, size: 64, align: 64, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !93, file: !96, line: 26, baseType: !100, size: 64, align: 64, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !93, file: !96, line: 27, baseType: !100, size: 64, align: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !93, file: !96, line: 28, baseType: !100, size: 64, align: 64, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !93, file: !96, line: 29, baseType: !100, size: 64, align: 64, offset: 1344)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !93, file: !96, line: 30, baseType: !100, size: 64, align: 64, offset: 1408)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !93, file: !96, line: 31, baseType: !100, size: 64, align: 64, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !93, file: !96, line: 32, baseType: !100, size: 64, align: 64, offset: 1536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !93, file: !96, line: 33, baseType: !100, size: 64, align: 64, offset: 1600)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !93, file: !96, line: 35, baseType: !158, size: 64, align: 64, offset: 1664)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !161)
!161 = !{!162, !164, !304, !305, !310, !311, !312, !313, !314, !323, !324, !325, !329, !330, !331, !332, !333, !334, !335, !336}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !160, file: !4, line: 100, baseType: !163, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !60, line: 49, baseType: !71)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !160, file: !4, line: 101, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !168)
!168 = !{!169, !190, !196, !202, !206, !291, !295, !300}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !167, file: !4, line: 133, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !158, !58, !174, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !175, line: 66, baseType: !176)
!175 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!176 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !181, line: 42, baseType: !182)
!181 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !181, line: 44, size: 128, align: 64, elements: !183)
!183 = !{!184, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !182, file: !181, line: 46, baseType: !185, size: 32, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !186, line: 36, baseType: !187)
!186 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !175, line: 45, baseType: !141)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !182, file: !181, line: 47, baseType: !163, size: 32, align: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !182, file: !181, line: 48, baseType: !58, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !167, file: !4, line: 138, baseType: !191, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!173, !158, !194, !174, !177, !178}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !167, file: !4, line: 143, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!173, !158, !200, !201, !178}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !175, line: 51, baseType: !78)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !167, file: !4, line: 147, baseType: !203, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!173, !158, !178}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !167, file: !4, line: 149, baseType: !207, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!210, !158, !290}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !213)
!213 = !{!214, !216, !237, !266, !268, !272, !273, !274, !275, !283, !284, !285, !286}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !212, file: !16, line: 174, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !60, line: 77, baseType: !57)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !212, file: !16, line: 175, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !220)
!220 = !{!221, !225, !226}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !219, file: !16, line: 198, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !215}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !219, file: !16, line: 199, baseType: !222, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !219, file: !16, line: 200, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !215, !210, !230, !236}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !215}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !60, line: 50, baseType: !163)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !212, file: !16, line: 177, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !242)
!242 = !{!243, !248, !252, !256, !260, !261}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !241, file: !16, line: 216, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!235, !210, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !241, file: !16, line: 218, baseType: !249, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!235, !210}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !241, file: !16, line: 219, baseType: !253, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!235, !210, !231, !215}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !241, file: !16, line: 222, baseType: !257, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !210}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !241, file: !16, line: 226, baseType: !231, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !241, file: !16, line: 227, baseType: !262, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !212, file: !16, line: 178, baseType: !267, size: 32, align: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !60, line: 55, baseType: !141)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !212, file: !16, line: 180, baseType: !269, size: 64, align: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !212, file: !16, line: 182, baseType: !163, size: 32, align: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !212, file: !16, line: 183, baseType: !267, size: 32, align: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !212, file: !16, line: 184, baseType: !267, size: 32, align: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !212, file: !16, line: 186, baseType: !276, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !278, line: 37, baseType: !279)
!278 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !278, line: 39, size: 128, align: 64, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !279, file: !278, line: 41, baseType: !215, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !278, line: 42, baseType: !276, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !212, file: !16, line: 188, baseType: !210, size: 64, align: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !16, line: 189, baseType: !210, size: 64, align: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !16, line: 191, baseType: !100, size: 64, align: 64, offset: 640)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !212, file: !16, line: 193, baseType: !287, size: 64, align: 64, offset: 704)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !289)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !167, file: !4, line: 151, baseType: !292, size: 64, align: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !158}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !167, file: !4, line: 152, baseType: !296, size: 64, align: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!173, !158, !299, !178}
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !167, file: !4, line: 155, baseType: !301, size: 64, align: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!299, !158}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !160, file: !4, line: 103, baseType: !58, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !160, file: !4, line: 104, baseType: !306, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !307, line: 77, baseType: !308)
!307 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !307, line: 77, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !160, file: !4, line: 105, baseType: !306, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !160, file: !4, line: 106, baseType: !58, size: 64, align: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !160, file: !4, line: 107, baseType: !267, size: 32, align: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !160, file: !4, line: 109, baseType: !174, size: 64, align: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !160, file: !4, line: 110, baseType: !315, size: 64, align: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !317, line: 39, baseType: !318)
!317 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !317, line: 41, size: 192, align: 64, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !318, file: !317, line: 43, baseType: !58, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !318, file: !317, line: 44, baseType: !174, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !318, file: !317, line: 45, baseType: !174, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !160, file: !4, line: 111, baseType: !315, size: 64, align: 64, offset: 576)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !160, file: !4, line: 112, baseType: !315, size: 64, align: 64, offset: 640)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !160, file: !4, line: 113, baseType: !326, size: 48, align: 8, offset: 704)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 6)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !160, file: !4, line: 117, baseType: !267, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !160, file: !4, line: 118, baseType: !267, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !160, file: !4, line: 119, baseType: !267, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !160, file: !4, line: 120, baseType: !267, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !160, file: !4, line: 121, baseType: !267, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !160, file: !4, line: 122, baseType: !267, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !160, file: !4, line: 124, baseType: !215, size: 64, align: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !160, file: !4, line: 125, baseType: !215, size: 64, align: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !93, file: !96, line: 38, baseType: !141, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !93, file: !96, line: 39, baseType: !141, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !93, file: !96, line: 40, baseType: !141, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !93, file: !96, line: 41, baseType: !141, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !93, file: !96, line: 42, baseType: !141, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !93, file: !96, line: 43, baseType: !141, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !93, file: !96, line: 44, baseType: !141, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !93, file: !96, line: 45, baseType: !141, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !93, file: !96, line: 46, baseType: !100, size: 64, align: 64, offset: 1792)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !93, file: !96, line: 47, baseType: !100, size: 64, align: 64, offset: 1856)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !93, file: !84, line: 27, baseType: !100, size: 64, align: 64, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !93, file: !84, line: 28, baseType: !100, size: 64, align: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !93, file: !84, line: 30, baseType: !71, size: 32, align: 32, offset: 2048)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !93, file: !84, line: 31, baseType: !100, size: 64, align: 64, offset: 2112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !93, file: !84, line: 32, baseType: !100, size: 64, align: 64, offset: 2176)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !93, file: !84, line: 34, baseType: !71, size: 32, align: 32, offset: 2240)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !93, file: !84, line: 35, baseType: !71, size: 32, align: 32, offset: 2272)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !93, file: !84, line: 36, baseType: !71, size: 32, align: 32, offset: 2304)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !93, file: !84, line: 38, baseType: !71, size: 32, align: 32, offset: 2336)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !93, file: !84, line: 38, baseType: !71, size: 32, align: 32, offset: 2368)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !93, file: !84, line: 38, baseType: !71, size: 32, align: 32, offset: 2400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !93, file: !84, line: 38, baseType: !71, size: 32, align: 32, offset: 2432)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !83, file: !87, line: 9, baseType: !74, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !83, file: !87, line: 10, baseType: !74, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !83, file: !87, line: 12, baseType: !100, size: 64, align: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !83, file: !87, line: 13, baseType: !100, size: 64, align: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !83, file: !87, line: 15, baseType: !141, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !83, file: !87, line: 16, baseType: !141, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !83, file: !87, line: 17, baseType: !141, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !83, file: !87, line: 18, baseType: !141, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !83, file: !87, line: 19, baseType: !141, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !83, file: !87, line: 21, baseType: !369, size: 64, align: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !114, line: 102, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !372, line: 7, size: 384, align: 64, elements: !373)
!372 = !DIFile(filename: "../../../src/core/net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = !{!374, !375, !379, !380, !381, !382, !383, !384}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !371, file: !372, line: 8, baseType: !158, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !371, file: !372, line: 9, baseType: !376, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !114, line: 101, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !114, line: 101, flags: DIFlagFwdDecl)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !371, file: !372, line: 11, baseType: !71, size: 32, align: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !371, file: !372, line: 12, baseType: !71, size: 32, align: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !371, file: !372, line: 13, baseType: !71, size: 32, align: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !371, file: !372, line: 14, baseType: !100, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !371, file: !372, line: 15, baseType: !71, size: 32, align: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !371, file: !372, line: 16, baseType: !141, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !83, file: !87, line: 22, baseType: !71, size: 32, align: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !83, file: !87, line: 25, baseType: !387, size: 128, align: 64, offset: 640)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, align: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !83, file: !87, line: 26, baseType: !71, size: 32, align: 32, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !83, file: !87, line: 27, baseType: !71, size: 32, align: 32, offset: 800)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !83, file: !87, line: 29, baseType: !393, size: 64, align: 64, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !114, line: 103, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !114, line: 103, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !83, file: !87, line: 30, baseType: !397, size: 64, align: 64, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !399, line: 37, baseType: !400)
!399 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !399, line: 37, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !83, file: !87, line: 32, baseType: !100, size: 64, align: 64, offset: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !83, file: !87, line: 33, baseType: !100, size: 64, align: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !83, file: !87, line: 34, baseType: !100, size: 64, align: 64, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !83, file: !87, line: 35, baseType: !141, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !83, file: !87, line: 36, baseType: !141, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !83, file: !87, line: 37, baseType: !141, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !83, file: !87, line: 38, baseType: !141, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !83, file: !87, line: 40, baseType: !409, size: 128, align: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !60, line: 504, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !60, line: 506, size: 128, align: 64, elements: !411)
!411 = !{!412, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !410, file: !60, line: 508, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !60, line: 48, baseType: !78)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !410, file: !60, line: 509, baseType: !413, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !83, file: !87, line: 41, baseType: !74, size: 64, align: 64, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !83, file: !87, line: 42, baseType: !71, size: 32, align: 32, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !83, file: !87, line: 44, baseType: !276, size: 64, align: 64, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !83, file: !87, line: 45, baseType: !276, size: 64, align: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !83, file: !87, line: 53, baseType: !420, size: 64, align: 64, offset: 1600)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !423, !62, !71}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !114, line: 107, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !426, line: 30, size: 2240, align: 64, elements: !427)
!426 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!427 = !{!428, !429, !430, !431, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !511, !515, !519, !524, !601, !608, !612}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !87, line: 3, baseType: !71, size: 32, align: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !425, file: !87, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !425, file: !87, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !425, file: !87, line: 8, baseType: !432, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !114, line: 113, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !426, line: 25, size: 1920, align: 64, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !96, line: 3, baseType: !71, size: 32, align: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !434, file: !96, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !434, file: !96, line: 6, baseType: !71, size: 32, align: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !434, file: !96, line: 9, baseType: !100, size: 64, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !434, file: !96, line: 10, baseType: !71, size: 32, align: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !434, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !434, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !434, file: !96, line: 11, baseType: !100, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !434, file: !96, line: 13, baseType: !106, size: 16, align: 16, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !434, file: !96, line: 14, baseType: !100, size: 64, align: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !434, file: !96, line: 15, baseType: !100, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !434, file: !96, line: 16, baseType: !71, size: 32, align: 32, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !434, file: !96, line: 17, baseType: !100, size: 64, align: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !434, file: !96, line: 19, baseType: !112, size: 64, align: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !434, file: !96, line: 19, baseType: !112, size: 64, align: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !434, file: !96, line: 21, baseType: !100, size: 64, align: 64, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !434, file: !96, line: 22, baseType: !100, size: 64, align: 64, offset: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !434, file: !96, line: 23, baseType: !100, size: 64, align: 64, offset: 1024)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !434, file: !96, line: 24, baseType: !100, size: 64, align: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !434, file: !96, line: 26, baseType: !100, size: 64, align: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !434, file: !96, line: 27, baseType: !100, size: 64, align: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !434, file: !96, line: 28, baseType: !100, size: 64, align: 64, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !434, file: !96, line: 29, baseType: !100, size: 64, align: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !434, file: !96, line: 30, baseType: !100, size: 64, align: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !434, file: !96, line: 31, baseType: !100, size: 64, align: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !434, file: !96, line: 32, baseType: !100, size: 64, align: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !434, file: !96, line: 33, baseType: !100, size: 64, align: 64, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !434, file: !96, line: 35, baseType: !158, size: 64, align: 64, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !434, file: !96, line: 38, baseType: !141, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !434, file: !96, line: 39, baseType: !141, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !434, file: !96, line: 40, baseType: !141, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !434, file: !96, line: 41, baseType: !141, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !434, file: !96, line: 42, baseType: !141, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !434, file: !96, line: 43, baseType: !141, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !434, file: !96, line: 44, baseType: !141, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !434, file: !96, line: 45, baseType: !141, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !434, file: !96, line: 46, baseType: !100, size: 64, align: 64, offset: 1792)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !434, file: !96, line: 47, baseType: !100, size: 64, align: 64, offset: 1856)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !425, file: !87, line: 9, baseType: !74, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !425, file: !87, line: 10, baseType: !74, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !425, file: !87, line: 12, baseType: !100, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !425, file: !87, line: 13, baseType: !100, size: 64, align: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !425, file: !87, line: 15, baseType: !141, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !425, file: !87, line: 16, baseType: !141, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !425, file: !87, line: 17, baseType: !141, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !425, file: !87, line: 18, baseType: !141, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !425, file: !87, line: 19, baseType: !141, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !425, file: !87, line: 21, baseType: !369, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !425, file: !87, line: 22, baseType: !71, size: 32, align: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !425, file: !87, line: 25, baseType: !387, size: 128, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !425, file: !87, line: 26, baseType: !71, size: 32, align: 32, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !425, file: !87, line: 27, baseType: !71, size: 32, align: 32, offset: 800)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !425, file: !87, line: 29, baseType: !393, size: 64, align: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !425, file: !87, line: 30, baseType: !397, size: 64, align: 64, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !425, file: !87, line: 32, baseType: !100, size: 64, align: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !425, file: !87, line: 33, baseType: !100, size: 64, align: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !425, file: !87, line: 34, baseType: !100, size: 64, align: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !425, file: !87, line: 35, baseType: !141, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !425, file: !87, line: 36, baseType: !141, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !425, file: !87, line: 37, baseType: !141, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !425, file: !87, line: 38, baseType: !141, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !425, file: !87, line: 40, baseType: !409, size: 128, align: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !425, file: !87, line: 41, baseType: !74, size: 64, align: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !425, file: !87, line: 42, baseType: !71, size: 32, align: 32, offset: 1408)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !425, file: !87, line: 44, baseType: !276, size: 64, align: 64, offset: 1472)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !425, file: !87, line: 45, baseType: !276, size: 64, align: 64, offset: 1536)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !425, file: !87, line: 53, baseType: !420, size: 64, align: 64, offset: 1600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !425, file: !87, line: 55, baseType: !504, size: 64, align: 64, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!71, !423, !61}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !425, file: !87, line: 57, baseType: !508, size: 64, align: 64, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!71, !423, !62}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !425, file: !87, line: 60, baseType: !512, size: 64, align: 64, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!62, !423}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !425, file: !87, line: 62, baseType: !516, size: 64, align: 64, offset: 1856)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !423, !62, !62, !71}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !425, file: !87, line: 65, baseType: !520, size: 64, align: 64, offset: 1920)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !423, !62, !62}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !425, file: !87, line: 69, baseType: !525, size: 64, align: 64, offset: 1984)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !423, !62}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !114, line: 109, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !531, line: 15, size: 1408, align: 64, elements: !532)
!531 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!532 = !{!533, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !551, !555, !557, !558, !559, !560, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !534, line: 3, baseType: !71, size: 32, align: 32)
!534 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !530, file: !534, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !530, file: !534, line: 5, baseType: !397, size: 64, align: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !530, file: !534, line: 7, baseType: !57, size: 64, align: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !530, file: !534, line: 8, baseType: !423, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !530, file: !534, line: 9, baseType: !100, size: 64, align: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !534, line: 10, baseType: !100, size: 64, align: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !530, file: !534, line: 11, baseType: !74, size: 64, align: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !530, file: !534, line: 12, baseType: !71, size: 32, align: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !530, file: !534, line: 13, baseType: !100, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !530, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !114, line: 108, baseType: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !114, line: 108, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !530, file: !534, line: 17, baseType: !552, size: 64, align: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!62, !548}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !530, file: !556, line: 5, baseType: !100, size: 64, align: 64, offset: 704)
!556 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!557 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !530, file: !556, line: 6, baseType: !100, size: 64, align: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !530, file: !556, line: 7, baseType: !74, size: 64, align: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !530, file: !556, line: 9, baseType: !397, size: 64, align: 64, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !530, file: !556, line: 10, baseType: !561, size: 64, align: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !114, line: 111, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !564, line: 13, size: 576, align: 64, elements: !565)
!564 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!565 = !{!566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !583}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !567, line: 3, baseType: !71, size: 32, align: 32)
!567 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !563, file: !567, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !563, file: !567, line: 6, baseType: !74, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !563, file: !567, line: 8, baseType: !100, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !563, file: !567, line: 9, baseType: !100, size: 64, align: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !563, file: !567, line: 10, baseType: !100, size: 64, align: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !563, file: !567, line: 11, baseType: !71, size: 32, align: 32, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !563, file: !567, line: 14, baseType: !141, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !563, file: !567, line: 15, baseType: !141, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !563, file: !567, line: 18, baseType: !141, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !563, file: !567, line: 19, baseType: !141, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !563, file: !567, line: 20, baseType: !141, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !563, file: !567, line: 21, baseType: !141, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !563, file: !567, line: 22, baseType: !581, size: 64, align: 8, offset: 360)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, align: 8, elements: !136)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !563, file: !567, line: 26, baseType: !57, size: 64, align: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !563, file: !567, line: 28, baseType: !561, size: 64, align: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !530, file: !556, line: 12, baseType: !141, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !530, file: !556, line: 13, baseType: !100, size: 64, align: 64, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !530, file: !556, line: 14, baseType: !71, size: 32, align: 32, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !530, file: !556, line: 15, baseType: !100, size: 64, align: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !530, file: !556, line: 17, baseType: !141, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !530, file: !556, line: 18, baseType: !141, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !530, file: !556, line: 19, baseType: !141, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !530, file: !556, line: 20, baseType: !141, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !530, file: !556, line: 22, baseType: !141, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !530, file: !556, line: 23, baseType: !141, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !530, file: !556, line: 24, baseType: !141, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !530, file: !556, line: 25, baseType: !141, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !530, file: !556, line: 26, baseType: !141, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !530, file: !556, line: 31, baseType: !598, size: 64, align: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!100, !528}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !425, file: !87, line: 70, baseType: !602, size: 64, align: 64, offset: 2048)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !423, !62}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !114, line: 110, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !114, line: 110, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !425, file: !87, line: 71, baseType: !609, size: 64, align: 64, offset: 2112)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!71, !62, !62}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !425, file: !87, line: 73, baseType: !609, size: 64, align: 64, offset: 2176)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !83, file: !87, line: 55, baseType: !504, size: 64, align: 64, offset: 1664)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !83, file: !87, line: 57, baseType: !508, size: 64, align: 64, offset: 1728)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !83, file: !87, line: 60, baseType: !512, size: 64, align: 64, offset: 1792)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !83, file: !87, line: 62, baseType: !516, size: 64, align: 64, offset: 1856)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !83, file: !87, line: 65, baseType: !520, size: 64, align: 64, offset: 1920)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !83, file: !87, line: 69, baseType: !525, size: 64, align: 64, offset: 1984)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !83, file: !87, line: 70, baseType: !602, size: 64, align: 64, offset: 2048)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !83, file: !87, line: 71, baseType: !609, size: 64, align: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !83, file: !87, line: 73, baseType: !609, size: 64, align: 64, offset: 2176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !83, file: !84, line: 46, baseType: !276, size: 64, align: 64, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !83, file: !84, line: 47, baseType: !276, size: 64, align: 64, offset: 2304)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !83, file: !84, line: 48, baseType: !625, size: 64, align: 64, offset: 2368)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !82, line: 8, baseType: !627)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !82, line: 8, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !83, file: !84, line: 49, baseType: !276, size: 64, align: 64, offset: 2432)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !83, file: !84, line: 51, baseType: !100, size: 64, align: 64, offset: 2496)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !83, file: !84, line: 53, baseType: !100, size: 64, align: 64, offset: 2560)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !83, file: !84, line: 54, baseType: !100, size: 64, align: 64, offset: 2624)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !83, file: !84, line: 55, baseType: !100, size: 64, align: 64, offset: 2688)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !83, file: !84, line: 56, baseType: !100, size: 64, align: 64, offset: 2752)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !83, file: !84, line: 57, baseType: !71, size: 32, align: 32, offset: 2816)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !83, file: !84, line: 59, baseType: !141, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !83, file: !84, line: 60, baseType: !141, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !83, file: !84, line: 62, baseType: !141, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !83, file: !84, line: 63, baseType: !141, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !83, file: !84, line: 64, baseType: !141, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !83, file: !84, line: 65, baseType: !141, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !83, file: !84, line: 66, baseType: !141, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !83, file: !84, line: 67, baseType: !141, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !83, file: !84, line: 68, baseType: !141, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !83, file: !84, line: 69, baseType: !141, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !83, file: !84, line: 70, baseType: !141, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !83, file: !84, line: 71, baseType: !141, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !83, file: !84, line: 72, baseType: !141, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !83, file: !84, line: 74, baseType: !71, size: 32, align: 32, offset: 2880)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !83, file: !84, line: 75, baseType: !71, size: 32, align: 32, offset: 2912)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !83, file: !84, line: 76, baseType: !71, size: 32, align: 32, offset: 2944)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !83, file: !84, line: 77, baseType: !71, size: 32, align: 32, offset: 2976)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !83, file: !84, line: 79, baseType: !397, size: 64, align: 64, offset: 3008)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !83, file: !84, line: 80, baseType: !276, size: 64, align: 64, offset: 3072)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !83, file: !84, line: 81, baseType: !276, size: 64, align: 64, offset: 3136)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !83, file: !84, line: 83, baseType: !315, size: 64, align: 64, offset: 3200)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !83, file: !84, line: 84, baseType: !267, size: 32, align: 32, offset: 3264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !83, file: !84, line: 87, baseType: !71, size: 32, align: 32, offset: 3296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !83, file: !84, line: 91, baseType: !276, size: 64, align: 64, offset: 3328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !83, file: !84, line: 92, baseType: !409, size: 128, align: 64, offset: 3392)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !83, file: !84, line: 93, baseType: !409, size: 128, align: 64, offset: 3520)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !83, file: !84, line: 95, baseType: !71, size: 32, align: 32, offset: 3648)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !83, file: !84, line: 96, baseType: !71, size: 32, align: 32, offset: 3680)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !83, file: !84, line: 97, baseType: !71, size: 32, align: 32, offset: 3712)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !83, file: !84, line: 100, baseType: !276, size: 64, align: 64, offset: 3776)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !83, file: !84, line: 103, baseType: !276, size: 64, align: 64, offset: 3840)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !83, file: !84, line: 106, baseType: !276, size: 64, align: 64, offset: 3904)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !83, file: !84, line: 108, baseType: !397, size: 64, align: 64, offset: 3968)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !83, file: !84, line: 109, baseType: !276, size: 64, align: 64, offset: 4032)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !83, file: !84, line: 111, baseType: !276, size: 64, align: 64, offset: 4096)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !83, file: !84, line: 114, baseType: !57, size: 64, align: 64, offset: 4160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !83, file: !84, line: 116, baseType: !397, size: 64, align: 64, offset: 4224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !83, file: !84, line: 117, baseType: !673, size: 32768, align: 64, offset: 4288)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 32768, align: 64, elements: !723)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !675, line: 10, size: 128, align: 64, elements: !676)
!675 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!676 = !{!677, !722}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !674, file: !675, line: 11, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !675, line: 7, baseType: !680)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !682, !62, !61, !61, !100, !315}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !82, line: 7, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !685, line: 15, size: 1600, align: 64, elements: !686)
!685 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !534, line: 3, baseType: !71, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !684, file: !534, line: 4, baseType: !71, size: 32, align: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !684, file: !534, line: 5, baseType: !397, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !684, file: !534, line: 7, baseType: !57, size: 64, align: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !684, file: !534, line: 8, baseType: !80, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !684, file: !534, line: 9, baseType: !100, size: 64, align: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !534, line: 10, baseType: !100, size: 64, align: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !684, file: !534, line: 11, baseType: !74, size: 64, align: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !684, file: !534, line: 12, baseType: !71, size: 32, align: 32, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !684, file: !534, line: 13, baseType: !100, size: 64, align: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !684, file: !534, line: 15, baseType: !545, size: 64, align: 64, offset: 576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !684, file: !534, line: 17, baseType: !552, size: 64, align: 64, offset: 640)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !684, file: !556, line: 5, baseType: !100, size: 64, align: 64, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !684, file: !556, line: 6, baseType: !100, size: 64, align: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !684, file: !556, line: 7, baseType: !74, size: 64, align: 64, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !684, file: !556, line: 9, baseType: !397, size: 64, align: 64, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !684, file: !556, line: 10, baseType: !561, size: 64, align: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !684, file: !556, line: 12, baseType: !141, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !684, file: !556, line: 13, baseType: !100, size: 64, align: 64, offset: 1088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !684, file: !556, line: 14, baseType: !71, size: 32, align: 32, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !684, file: !556, line: 15, baseType: !100, size: 64, align: 64, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !684, file: !556, line: 17, baseType: !141, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !684, file: !556, line: 18, baseType: !141, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !684, file: !556, line: 19, baseType: !141, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !684, file: !556, line: 20, baseType: !141, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !684, file: !556, line: 22, baseType: !141, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !684, file: !556, line: 23, baseType: !141, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !684, file: !556, line: 24, baseType: !141, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !684, file: !556, line: 25, baseType: !141, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !684, file: !556, line: 26, baseType: !141, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !684, file: !556, line: 31, baseType: !598, size: 64, align: 64, offset: 1344)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !684, file: !685, line: 18, baseType: !276, size: 64, align: 64, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !684, file: !685, line: 20, baseType: !74, size: 64, align: 64, offset: 1472)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !684, file: !685, line: 21, baseType: !71, size: 32, align: 32, offset: 1536)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !684, file: !685, line: 22, baseType: !71, size: 32, align: 32, offset: 1568)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !674, file: !675, line: 12, baseType: !61, size: 8, align: 8, offset: 64)
!723 = !{!724}
!724 = !DISubrange(count: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !83, file: !84, line: 118, baseType: !726, size: 2048, align: 8, offset: 37056)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, align: 8, elements: !723)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !83, file: !84, line: 120, baseType: !609, size: 64, align: 64, offset: 39104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !67, file: !70, line: 6, baseType: !100, size: 64, align: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !67, file: !70, line: 7, baseType: !100, size: 64, align: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !67, file: !70, line: 8, baseType: !100, size: 64, align: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !67, file: !70, line: 10, baseType: !732, size: 64, align: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAT_DCC_REC", file: !734, line: 9, baseType: !735)
!734 = !DIFile(filename: "dcc.h", directory: "/home/lichi/Desktop/irssi/task1")
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CHAT_DCC_REC", file: !736, line: 12, size: 1792, align: 64, elements: !737)
!736 = !DIFile(filename: "dcc-chat.h", directory: "/home/lichi/Desktop/irssi/task1")
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !753, !754, !755, !756, !757, !758, !759, !761, !762, !763, !764, !765, !766, !767}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !735, file: !70, line: 1, baseType: !71, size: 32, align: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !735, file: !70, line: 2, baseType: !71, size: 32, align: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !735, file: !70, line: 3, baseType: !74, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !735, file: !70, line: 5, baseType: !80, size: 64, align: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !735, file: !70, line: 6, baseType: !100, size: 64, align: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !735, file: !70, line: 7, baseType: !100, size: 64, align: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !735, file: !70, line: 8, baseType: !100, size: 64, align: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !735, file: !70, line: 10, baseType: !732, size: 64, align: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !735, file: !70, line: 11, baseType: !100, size: 64, align: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !735, file: !70, line: 12, baseType: !100, size: 64, align: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !735, file: !70, line: 14, baseType: !113, size: 160, align: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !735, file: !70, line: 15, baseType: !750, size: 368, align: 8, offset: 736)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 368, align: 8, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 46)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !735, file: !70, line: 16, baseType: !71, size: 32, align: 32, offset: 1120)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !735, file: !70, line: 18, baseType: !158, size: 64, align: 64, offset: 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !735, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1216)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !735, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1248)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !735, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !735, file: !70, line: 20, baseType: !74, size: 64, align: 64, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !735, file: !70, line: 21, baseType: !760, size: 64, align: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "uoff_t", file: !114, line: 49, baseType: !176)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !735, file: !70, line: 23, baseType: !71, size: 32, align: 32, offset: 1472)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !735, file: !70, line: 25, baseType: !141, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !735, file: !70, line: 27, baseType: !397, size: 64, align: 64, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !735, file: !736, line: 15, baseType: !100, size: 64, align: 64, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !735, file: !736, line: 16, baseType: !369, size: 64, align: 64, offset: 1664)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mirc_ctcp", scope: !735, file: !736, line: 18, baseType: !141, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !735, file: !736, line: 19, baseType: !141, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !67, file: !70, line: 11, baseType: !100, size: 64, align: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !67, file: !70, line: 12, baseType: !100, size: 64, align: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !67, file: !70, line: 14, baseType: !113, size: 160, align: 32, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !67, file: !70, line: 15, baseType: !750, size: 368, align: 8, offset: 736)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !67, file: !70, line: 16, baseType: !71, size: 32, align: 32, offset: 1120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !67, file: !70, line: 18, baseType: !158, size: 64, align: 64, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !67, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1216)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !67, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1248)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !67, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !67, file: !70, line: 20, baseType: !74, size: 64, align: 64, offset: 1344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !67, file: !70, line: 21, baseType: !760, size: 64, align: 64, offset: 1408)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !67, file: !70, line: 23, baseType: !71, size: 32, align: 32, offset: 1472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "destroyed", scope: !67, file: !70, line: 25, baseType: !141, size: 1, align: 32, offset: 1504, flags: DIFlagBitField, extraData: i64 1504)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !67, file: !70, line: 27, baseType: !397, size: 64, align: 64, offset: 1536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "sendbuf", scope: !67, file: !66, line: 14, baseType: !369, size: 64, align: 64, offset: 1600)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "accept_send", scope: !67, file: !66, line: 16, baseType: !141, size: 1, align: 32, offset: 1664, flags: DIFlagBitField, extraData: i64 1664)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "accept_chat", scope: !67, file: !66, line: 17, baseType: !141, size: 1, align: 32, offset: 1665, flags: DIFlagBitField, extraData: i64 1664)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "accept_fserve", scope: !67, file: !66, line: 18, baseType: !141, size: 1, align: 32, offset: 1666, flags: DIFlagBitField, extraData: i64 1664)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "connection_established", scope: !67, file: !66, line: 19, baseType: !141, size: 1, align: 32, offset: 1667, flags: DIFlagBitField, extraData: i64 1664)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !788, line: 9, baseType: !789)
!788 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64, align: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !792, !792, !792, !792, !792, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !114, line: 60, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !57, !158, !71}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCC_REC", file: !734, line: 13, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !734, line: 11, size: 1600, align: 64, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !800, file: !70, line: 1, baseType: !71, size: 32, align: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "orig_type", scope: !800, file: !70, line: 2, baseType: !71, size: 32, align: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !800, file: !70, line: 3, baseType: !74, size: 64, align: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !800, file: !70, line: 5, baseType: !80, size: 64, align: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !800, file: !70, line: 6, baseType: !100, size: 64, align: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mynick", scope: !800, file: !70, line: 7, baseType: !100, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !800, file: !70, line: 8, baseType: !100, size: 64, align: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chat", scope: !800, file: !70, line: 10, baseType: !732, size: 64, align: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !800, file: !70, line: 11, baseType: !100, size: 64, align: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !800, file: !70, line: 12, baseType: !100, size: 64, align: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !800, file: !70, line: 14, baseType: !113, size: 160, align: 32, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "addrstr", scope: !800, file: !70, line: 15, baseType: !750, size: 368, align: 8, offset: 736)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !800, file: !70, line: 16, baseType: !71, size: 32, align: 32, offset: 1120)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !800, file: !70, line: 18, baseType: !158, size: 64, align: 64, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tagconn", scope: !800, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tagread", scope: !800, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1248)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tagwrite", scope: !800, file: !70, line: 19, baseType: !71, size: 32, align: 32, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "starttime", scope: !800, file: !70, line: 20, baseType: !74, size: 64, align: 64, offset: 1344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "transfd", scope: !800, file: !70, line: 21, baseType: !760, size: 64, align: 64, offset: 1408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pasv_id", scope: !800, file: !70, line: 23, baseType: !71, size: 32, align: 32, offset: 1472)
