; ModuleID = './line214-completion.o.i'
source_filename = "./line214-completion.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GList = type { i8*, %struct._GList*, %struct._GList* }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }

!257 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!258 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!259 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!260 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!261 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!262 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!263 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!264 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!265 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!266 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!267 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!268 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!269 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!270 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!271 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!272 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!273 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!274 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!275 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!276 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!277 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!278 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!279 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!280 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!281 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!282 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!283 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !285, line: 4, size: 32, align: 32, elements: !286)
!285 = !DIFile(filename: "../../../src/core/settings.h", directory: "/home/lichi/Desktop/irssi/task1")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294}
!287 = !DIEnumerator(name: "SETTING_TYPE_STRING", value: 0)
!288 = !DIEnumerator(name: "SETTING_TYPE_INT", value: 1)
!289 = !DIEnumerator(name: "SETTING_TYPE_BOOLEAN", value: 2)
!290 = !DIEnumerator(name: "SETTING_TYPE_TIME", value: 3)
!291 = !DIEnumerator(name: "SETTING_TYPE_LEVEL", value: 4)
!292 = !DIEnumerator(name: "SETTING_TYPE_SIZE", value: 5)
!293 = !DIEnumerator(name: "SETTING_TYPE_CHOICE", value: 6)
!294 = !DIEnumerator(name: "SETTING_TYPE_ANY", value: 7)
!295 = !{!296, !297, !301, !303, !304, !311, !312, !317}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !299, line: 46, baseType: !300)
!299 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!300 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!303 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !305, line: 9, baseType: !306)
!305 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !309, !309, !309, !309, !309, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "GFunc", file: !299, line: 88, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316, !316}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !299, line: 77, baseType: !296)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !299, line: 80, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !322, !322}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !299, line: 49, baseType: !303)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !299, line: 78, baseType: !309)
!323 = !{!324, !422, !423, !424, !425, !426}
!324 = distinct !DIGlobalVariable(name: "startpos", scope: !325, file: !326, line: 136, type: !303, isLocal: true, isDefinition: true, variable: i32* @word_complete.startpos)
!325 = distinct !DISubprogram(name: "word_complete", scope: !326, file: !326, line: 134, type: !327, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!326 = !DIFile(filename: "completion.c", directory: "/home/lichi/Desktop/irssi/task1")
!327 = !DISubroutineType(types: !328)
!328 = !{!311, !329, !301, !420, !303, !303}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !331, line: 117, baseType: !332)
!331 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !333, line: 28, size: 1280, align: 64, elements: !334)
!333 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!334 = !{!335, !336, !337, !338, !339, !347, !384, !385, !386, !387, !388, !389, !391, !392, !393, !412, !413, !414, !415, !416, !417, !418, !419}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !332, file: !333, line: 29, baseType: !303, size: 32, align: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !333, line: 30, baseType: !311, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !332, file: !333, line: 32, baseType: !303, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !332, file: !333, line: 32, baseType: !303, size: 32, align: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !332, file: !333, line: 34, baseType: !340, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !342, line: 37, baseType: !343)
!342 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !342, line: 39, size: 128, align: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !343, file: !342, line: 41, baseType: !316, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !342, line: 42, baseType: !340, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !332, file: !333, line: 35, baseType: !348, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !331, line: 108, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !351, line: 5, size: 704, align: 64, elements: !352)
!351 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!352 = !{!353, !355, !356, !361, !362, !366, !367, !368, !374, !375, !376, !380}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !354, line: 3, baseType: !303, size: 32, align: 32)
!354 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !350, file: !354, line: 4, baseType: !303, size: 32, align: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !350, file: !354, line: 5, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !359, line: 37, baseType: !360)
!359 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !359, line: 37, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !350, file: !354, line: 7, baseType: !296, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !350, file: !354, line: 8, baseType: !363, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !331, line: 107, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !331, line: 107, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !350, file: !354, line: 9, baseType: !311, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !354, line: 10, baseType: !311, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !350, file: !354, line: 11, baseType: !369, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !370, line: 75, baseType: !371)
!370 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !372, line: 139, baseType: !373)
!372 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !350, file: !354, line: 12, baseType: !303, size: 32, align: 32, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !350, file: !354, line: 13, baseType: !311, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !350, file: !354, line: 15, baseType: !377, size: 64, align: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !348}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !350, file: !354, line: 17, baseType: !381, size: 64, align: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!301, !348}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !332, file: !333, line: 36, baseType: !363, size: 64, align: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !332, file: !333, line: 37, baseType: !363, size: 64, align: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !332, file: !333, line: 38, baseType: !311, size: 64, align: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !332, file: !333, line: 40, baseType: !303, size: 32, align: 32, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !332, file: !333, line: 41, baseType: !340, size: 64, align: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !332, file: !333, line: 43, baseType: !390, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!390 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !332, file: !333, line: 44, baseType: !390, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !332, file: !333, line: 45, baseType: !390, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !332, file: !333, line: 48, baseType: !394, size: 64, align: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !396, line: 14, baseType: !397)
!396 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 6, size: 256, align: 64, elements: !398)
!398 = !{!399, !400, !409, !410, !411}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !396, line: 7, baseType: !311, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !397, file: !396, line: 9, baseType: !401, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !403, line: 37, baseType: !404)
!403 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !403, line: 39, size: 192, align: 64, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !403, line: 41, baseType: !316, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !403, line: 42, baseType: !401, size: 64, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !403, line: 43, baseType: !401, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !397, file: !396, line: 10, baseType: !303, size: 32, align: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !397, file: !396, line: 12, baseType: !303, size: 32, align: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !397, file: !396, line: 13, baseType: !303, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !332, file: !333, line: 49, baseType: !311, size: 64, align: 64, offset: 768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !332, file: !333, line: 51, baseType: !303, size: 32, align: 32, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !332, file: !333, line: 52, baseType: !311, size: 64, align: 64, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !332, file: !333, line: 54, baseType: !369, size: 64, align: 64, offset: 960)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !332, file: !333, line: 55, baseType: !369, size: 64, align: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !332, file: !333, line: 57, baseType: !311, size: 64, align: 64, offset: 1088)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !332, file: !333, line: 58, baseType: !296, size: 64, align: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !332, file: !333, line: 60, baseType: !296, size: 64, align: 64, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!421 = !{}
!422 = distinct !DIGlobalVariable(name: "wordlen", scope: !325, file: !326, line: 136, type: !303, isLocal: true, isDefinition: true, variable: i32* @word_complete.wordlen)
!423 = distinct !DIGlobalVariable(name: "complist", scope: !0, file: !326, line: 33, type: !401, isLocal: true, isDefinition: true, variable: %struct._GList** @complist)
!424 = distinct !DIGlobalVariable(name: "last_line", scope: !0, file: !326, line: 34, type: !311, isLocal: true, isDefinition: true, variable: i8** @last_line)
!425 = distinct !DIGlobalVariable(name: "last_want_space", scope: !0, file: !326, line: 35, type: !303, isLocal: true, isDefinition: true, variable: i32* @last_want_space)
!426 = distinct !DIGlobalVariable(name: "last_line_pos", scope: !0, file: !326, line: 35, type: !303, isLocal: true, isDefinition: true, variable: i32* @last_line_pos)
!427 = !{i32 2, !"Dwarf Version", i32 4}
!428 = !{i32 2, !"Debug Info Version", i32 3}
!429 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!430 = distinct !DISubprogram(name: "auto_word_complete", scope: !326, file: !326, line: 89, type: !431, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!431 = !DISubroutineType(types: !432)
!432 = !{!311, !301, !420}
!433 = !DILocalVariable(name: "line", arg: 1, scope: !430, file: !326, line: 89, type: !301)
!434 = !DIExpression()
!435 = !DILocation(line: 89, column: 38, scope: !430)
!436 = !DILocalVariable(name: "pos", arg: 2, scope: !430, file: !326, line: 89, type: !420)
!437 = !DILocation(line: 89, column: 49, scope: !430)
!438 = !DILocalVariable(name: "result", scope: !430, file: !326, line: 91, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !441, line: 39, baseType: !442)
!441 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !441, line: 41, size: 192, align: 64, elements: !443)
!443 = !{!444, !445, !449}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !442, file: !441, line: 43, baseType: !297, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !442, file: !441, line: 44, baseType: !446, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !447, line: 66, baseType: !448)
!447 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!448 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !442, file: !441, line: 45, baseType: !446, size: 64, align: 64, offset: 128)
!450 = !DILocation(line: 91, column: 11, scope: !430)
!451 = !DILocalVariable(name: "replace", scope: !430, file: !326, line: 92, type: !301)
!452 = !DILocation(line: 92, column: 14, scope: !430)
!453 = !DILocalVariable(name: "word", scope: !430, file: !326, line: 93, type: !311)
!454 = !DILocation(line: 93, column: 8, scope: !430)
!455 = !DILocalVariable(name: "wordstart", scope: !430, file: !326, line: 93, type: !311)
!456 = !DILocation(line: 93, column: 15, scope: !430)
!457 = !DILocalVariable(name: "ret", scope: !430, file: !326, line: 93, type: !311)
!458 = !DILocation(line: 93, column: 27, scope: !430)
!459 = !DILocalVariable(name: "startpos", scope: !430, file: !326, line: 94, type: !303)
!460 = !DILocation(line: 94, column: 6, scope: !430)
!461 = !DILocation(line: 96, column: 2, scope: !430)
!462 = distinct !{!462, !461}
!463 = !DILocation(line: 96, column: 10, scope: !464)
!464 = !DILexicalBlockFile(scope: !465, file: !326, discriminator: 1)
!465 = distinct !DILexicalBlock(scope: !466, file: !326, line: 96, column: 10)
!466 = distinct !DILexicalBlock(scope: !430, file: !326, line: 96, column: 4)
!467 = !DILocation(line: 96, column: 15, scope: !464)
!468 = !DILocation(line: 96, column: 5, scope: !469)
!469 = !DILexicalBlockFile(scope: !470, file: !326, discriminator: 2)
!470 = distinct !DILexicalBlock(scope: !465, file: !326, line: 96, column: 3)
!471 = !DILocation(line: 96, column: 14, scope: !472)
!472 = !DILexicalBlockFile(scope: !473, file: !326, discriminator: 3)
!473 = distinct !DILexicalBlock(scope: !465, file: !326, line: 96, column: 12)
!474 = !DILocation(line: 96, column: 99, scope: !472)
!475 = !DILocation(line: 96, column: 7, scope: !476)
!476 = !DILexicalBlockFile(scope: !466, file: !326, discriminator: 4)
!477 = !DILocation(line: 97, column: 2, scope: !430)
!478 = distinct !{!478, !477}
!479 = !DILocation(line: 97, column: 10, scope: !480)
!480 = !DILexicalBlockFile(scope: !481, file: !326, discriminator: 1)
!481 = distinct !DILexicalBlock(scope: !482, file: !326, line: 97, column: 10)
!482 = distinct !DILexicalBlock(scope: !430, file: !326, line: 97, column: 4)
!483 = !DILocation(line: 97, column: 14, scope: !480)
!484 = !DILocation(line: 97, column: 5, scope: !485)
!485 = !DILexicalBlockFile(scope: !486, file: !326, discriminator: 2)
!486 = distinct !DILexicalBlock(scope: !481, file: !326, line: 97, column: 3)
!487 = !DILocation(line: 97, column: 14, scope: !488)
!488 = !DILexicalBlockFile(scope: !489, file: !326, discriminator: 3)
!489 = distinct !DILexicalBlock(scope: !481, file: !326, line: 97, column: 12)
!490 = !DILocation(line: 97, column: 98, scope: !488)
!491 = !DILocation(line: 97, column: 7, scope: !492)
!492 = !DILexicalBlockFile(scope: !482, file: !326, discriminator: 4)
!493 = !DILocation(line: 99, column: 21, scope: !430)
!494 = !DILocation(line: 99, column: 28, scope: !430)
!495 = !DILocation(line: 99, column: 27, scope: !430)
!496 = !DILocation(line: 99, column: 9, scope: !430)
!497 = !DILocation(line: 99, column: 7, scope: !430)
!498 = !DILocation(line: 100, column: 20, scope: !430)
!499 = !DILocation(line: 100, column: 30, scope: !430)
!500 = !DILocation(line: 100, column: 29, scope: !430)
!501 = !DILocation(line: 100, column: 13, scope: !430)
!502 = !DILocation(line: 100, column: 11, scope: !430)
!503 = !DILocation(line: 102, column: 24, scope: !430)
!504 = !DILocation(line: 102, column: 11, scope: !430)
!505 = !DILocation(line: 102, column: 9, scope: !430)
!506 = !DILocation(line: 103, column: 17, scope: !430)
!507 = !DILocation(line: 103, column: 25, scope: !430)
!508 = !DILocation(line: 103, column: 42, scope: !430)
!509 = !DILocation(line: 103, column: 35, scope: !430)
!510 = !DILocation(line: 103, column: 2, scope: !511)
!511 = !DILexicalBlockFile(scope: !430, file: !326, discriminator: 1)
!512 = !DILocation(line: 106, column: 28, scope: !430)
!513 = !DILocation(line: 106, column: 12, scope: !430)
!514 = !DILocation(line: 106, column: 10, scope: !430)
!515 = !DILocation(line: 107, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !430, file: !326, line: 107, column: 6)
!517 = !DILocation(line: 107, column: 14, scope: !516)
!518 = !DILocation(line: 107, column: 6, scope: !430)
!519 = !DILocation(line: 108, column: 7, scope: !520)
!520 = distinct !DILexicalBlock(scope: !516, file: !326, line: 107, column: 22)
!521 = !DILocation(line: 109, column: 17, scope: !520)
!522 = !DILocation(line: 109, column: 3, scope: !520)
!523 = !DILocation(line: 110, column: 2, scope: !520)
!524 = !DILocation(line: 111, column: 10, scope: !525)
!525 = distinct !DILexicalBlock(scope: !516, file: !326, line: 110, column: 9)
!526 = !DILocation(line: 111, column: 26, scope: !525)
!527 = !DILocation(line: 111, column: 19, scope: !525)
!528 = !DILocation(line: 111, column: 18, scope: !525)
!529 = !DILocation(line: 111, column: 4, scope: !525)
!530 = !DILocation(line: 111, column: 8, scope: !525)
!531 = !DILocation(line: 113, column: 19, scope: !525)
!532 = !DILocation(line: 113, column: 27, scope: !525)
!533 = !DILocation(line: 113, column: 37, scope: !525)
!534 = !DILocation(line: 113, column: 3, scope: !525)
!535 = !DILocation(line: 114, column: 9, scope: !525)
!536 = !DILocation(line: 114, column: 17, scope: !525)
!537 = !DILocation(line: 114, column: 7, scope: !525)
!538 = !DILocation(line: 115, column: 17, scope: !525)
!539 = !DILocation(line: 115, column: 3, scope: !525)
!540 = !DILocation(line: 118, column: 9, scope: !430)
!541 = !DILocation(line: 118, column: 2, scope: !430)
!542 = !DILocation(line: 119, column: 9, scope: !430)
!543 = !DILocation(line: 119, column: 2, scope: !430)
!544 = !DILocation(line: 120, column: 1, scope: !430)
!545 = distinct !DISubprogram(name: "get_word_at", scope: !326, file: !326, line: 68, type: !546, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!546 = !DISubroutineType(types: !547)
!547 = !{!311, !301, !303, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!549 = !DILocalVariable(name: "str", arg: 1, scope: !545, file: !326, line: 68, type: !301)
!550 = !DILocation(line: 68, column: 38, scope: !545)
!551 = !DILocalVariable(name: "pos", arg: 2, scope: !545, file: !326, line: 68, type: !303)
!552 = !DILocation(line: 68, column: 47, scope: !545)
!553 = !DILocalVariable(name: "startpos", arg: 3, scope: !545, file: !326, line: 68, type: !548)
!554 = !DILocation(line: 68, column: 59, scope: !545)
!555 = !DILocalVariable(name: "start", scope: !545, file: !326, line: 70, type: !301)
!556 = !DILocation(line: 70, column: 14, scope: !545)
!557 = !DILocalVariable(name: "end", scope: !545, file: !326, line: 70, type: !301)
!558 = !DILocation(line: 70, column: 22, scope: !545)
!559 = !DILocation(line: 72, column: 2, scope: !545)
!560 = distinct !{!560, !559}
!561 = !DILocation(line: 72, column: 10, scope: !562)
!562 = !DILexicalBlockFile(scope: !563, file: !326, discriminator: 1)
!563 = distinct !DILexicalBlock(scope: !564, file: !326, line: 72, column: 10)
!564 = distinct !DILexicalBlock(scope: !545, file: !326, line: 72, column: 4)
!565 = !DILocation(line: 72, column: 14, scope: !562)
!566 = !DILocation(line: 72, column: 5, scope: !567)
!567 = !DILexicalBlockFile(scope: !568, file: !326, discriminator: 2)
!568 = distinct !DILexicalBlock(scope: !563, file: !326, line: 72, column: 3)
!569 = !DILocation(line: 72, column: 14, scope: !570)
!570 = !DILexicalBlockFile(scope: !571, file: !326, discriminator: 3)
!571 = distinct !DILexicalBlock(scope: !563, file: !326, line: 72, column: 12)
!572 = !DILocation(line: 72, column: 98, scope: !570)
!573 = !DILocation(line: 72, column: 7, scope: !574)
!574 = !DILexicalBlockFile(scope: !564, file: !326, discriminator: 4)
!575 = !DILocation(line: 73, column: 2, scope: !545)
!576 = distinct !{!576, !575}
!577 = !DILocation(line: 73, column: 10, scope: !578)
!578 = !DILexicalBlockFile(scope: !579, file: !326, discriminator: 1)
!579 = distinct !DILexicalBlock(scope: !580, file: !326, line: 73, column: 10)
!580 = distinct !DILexicalBlock(scope: !545, file: !326, line: 73, column: 4)
!581 = !DILocation(line: 73, column: 14, scope: !578)
!582 = !DILocation(line: 73, column: 22, scope: !583)
!583 = !DILexicalBlockFile(scope: !584, file: !326, discriminator: 2)
!584 = distinct !DILexicalBlock(scope: !579, file: !326, line: 73, column: 20)
!585 = !DILocation(line: 73, column: 31, scope: !586)
!586 = !DILexicalBlockFile(scope: !587, file: !326, discriminator: 3)
!587 = distinct !DILexicalBlock(scope: !579, file: !326, line: 73, column: 29)
!588 = !DILocation(line: 73, column: 112, scope: !586)
!589 = !DILocation(line: 73, column: 7, scope: !590)
!590 = !DILexicalBlockFile(scope: !580, file: !326, discriminator: 4)
!591 = !DILocation(line: 76, column: 10, scope: !545)
!592 = !DILocation(line: 76, column: 14, scope: !545)
!593 = !DILocation(line: 76, column: 13, scope: !545)
!594 = !DILocation(line: 76, column: 8, scope: !545)
!595 = !DILocation(line: 77, column: 2, scope: !545)
!596 = !DILocation(line: 77, column: 9, scope: !597)
!597 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 1)
!598 = !DILocation(line: 77, column: 17, scope: !597)
!599 = !DILocation(line: 77, column: 15, scope: !597)
!600 = !DILocation(line: 77, column: 21, scope: !597)
!601 = !DILocation(line: 77, column: 27, scope: !602)
!602 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 2)
!603 = !DILocation(line: 77, column: 26, scope: !602)
!604 = !DILocation(line: 77, column: 38, scope: !602)
!605 = !DILocation(line: 77, column: 46, scope: !602)
!606 = !DILocation(line: 77, column: 51, scope: !607)
!607 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 3)
!608 = !DILocation(line: 77, column: 50, scope: !607)
!609 = !DILocation(line: 77, column: 62, scope: !607)
!610 = !DILocation(line: 77, column: 46, scope: !607)
!611 = !DILocation(line: 77, column: 2, scope: !612)
!612 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 4)
!613 = !DILocation(line: 77, column: 77, scope: !614)
!614 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 5)
!615 = !DILocation(line: 77, column: 2, scope: !614)
!616 = distinct !{!616, !595}
!617 = !DILocation(line: 79, column: 8, scope: !545)
!618 = !DILocation(line: 79, column: 6, scope: !545)
!619 = !DILocation(line: 80, column: 2, scope: !545)
!620 = !DILocation(line: 80, column: 9, scope: !597)
!621 = !DILocation(line: 80, column: 17, scope: !597)
!622 = !DILocation(line: 80, column: 15, scope: !597)
!623 = !DILocation(line: 80, column: 21, scope: !597)
!624 = !DILocation(line: 80, column: 28, scope: !602)
!625 = !DILocation(line: 80, column: 27, scope: !602)
!626 = !DILocation(line: 80, column: 39, scope: !602)
!627 = !DILocation(line: 80, column: 47, scope: !602)
!628 = !DILocation(line: 80, column: 52, scope: !607)
!629 = !DILocation(line: 80, column: 51, scope: !607)
!630 = !DILocation(line: 80, column: 63, scope: !607)
!631 = !DILocation(line: 80, column: 47, scope: !607)
!632 = !DILocation(line: 80, column: 24, scope: !612)
!633 = !DILocation(line: 80, column: 2, scope: !614)
!634 = !DILocation(line: 80, column: 78, scope: !635)
!635 = !DILexicalBlockFile(scope: !545, file: !326, discriminator: 6)
!636 = !DILocation(line: 80, column: 2, scope: !635)
!637 = distinct !{!637, !619}
!638 = !DILocation(line: 81, column: 2, scope: !545)
!639 = !DILocation(line: 81, column: 10, scope: !597)
!640 = !DILocation(line: 81, column: 9, scope: !597)
!641 = !DILocation(line: 81, column: 14, scope: !597)
!642 = !DILocation(line: 81, column: 22, scope: !597)
!643 = !DILocation(line: 81, column: 30, scope: !602)
!644 = !DILocation(line: 81, column: 29, scope: !602)
!645 = !DILocation(line: 81, column: 28, scope: !602)
!646 = !DILocation(line: 81, column: 35, scope: !602)
!647 = !DILocation(line: 81, column: 43, scope: !602)
!648 = !DILocation(line: 81, column: 49, scope: !607)
!649 = !DILocation(line: 81, column: 48, scope: !607)
!650 = !DILocation(line: 81, column: 47, scope: !607)
!651 = !DILocation(line: 81, column: 54, scope: !607)
!652 = !DILocation(line: 81, column: 43, scope: !607)
!653 = !DILocation(line: 81, column: 25, scope: !612)
!654 = !DILocation(line: 81, column: 2, scope: !614)
!655 = !DILocation(line: 81, column: 67, scope: !635)
!656 = !DILocation(line: 81, column: 2, scope: !635)
!657 = distinct !{!657, !638}
!658 = !DILocation(line: 82, column: 2, scope: !545)
!659 = !DILocation(line: 82, column: 10, scope: !597)
!660 = !DILocation(line: 82, column: 9, scope: !597)
!661 = !DILocation(line: 82, column: 14, scope: !597)
!662 = !DILocation(line: 82, column: 22, scope: !597)
!663 = !DILocation(line: 82, column: 28, scope: !602)
!664 = !DILocation(line: 82, column: 27, scope: !602)
!665 = !DILocation(line: 82, column: 26, scope: !602)
!666 = !DILocation(line: 82, column: 33, scope: !602)
!667 = !DILocation(line: 82, column: 2, scope: !607)
!668 = !DILocation(line: 82, column: 45, scope: !612)
!669 = !DILocation(line: 82, column: 2, scope: !612)
!670 = distinct !{!670, !658}
!671 = !DILocation(line: 84, column: 23, scope: !545)
!672 = !DILocation(line: 84, column: 3, scope: !545)
!673 = !DILocation(line: 84, column: 12, scope: !545)
!674 = !DILocation(line: 85, column: 19, scope: !545)
!675 = !DILocation(line: 85, column: 33, scope: !545)
!676 = !DILocation(line: 85, column: 37, scope: !545)
!677 = !DILocation(line: 85, column: 36, scope: !545)
!678 = !DILocation(line: 85, column: 26, scope: !545)
!679 = !DILocation(line: 85, column: 9, scope: !545)
!680 = !DILocation(line: 85, column: 2, scope: !545)
!681 = !DILocation(line: 86, column: 1, scope: !545)
!682 = distinct !DISubprogram(name: "completion_find", scope: !326, file: !326, line: 49, type: !683, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!683 = !DISubroutineType(types: !684)
!684 = !{!301, !301, !303}
!685 = !DILocalVariable(name: "key", arg: 1, scope: !682, file: !326, line: 49, type: !301)
!686 = !DILocation(line: 49, column: 48, scope: !682)
!687 = !DILocalVariable(name: "automatic", arg: 2, scope: !682, file: !326, line: 49, type: !303)
!688 = !DILocation(line: 49, column: 57, scope: !682)
!689 = !DILocalVariable(name: "node", scope: !682, file: !326, line: 51, type: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !4, line: 17, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !4, line: 20, size: 192, align: 64, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !4, line: 21, baseType: !303, size: 32, align: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !692, file: !4, line: 22, baseType: !311, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !692, file: !4, line: 23, baseType: !296, size: 64, align: 64, offset: 128)
!697 = !DILocation(line: 51, column: 15, scope: !682)
!698 = !DILocation(line: 53, column: 30, scope: !682)
!699 = !DILocation(line: 53, column: 9, scope: !682)
!700 = !DILocation(line: 53, column: 7, scope: !682)
!701 = !DILocation(line: 54, column: 6, scope: !702)
!702 = distinct !DILexicalBlock(scope: !682, file: !326, line: 54, column: 6)
!703 = !DILocation(line: 54, column: 11, scope: !702)
!704 = !DILocation(line: 54, column: 18, scope: !702)
!705 = !DILocation(line: 54, column: 21, scope: !706)
!706 = !DILexicalBlockFile(scope: !702, file: !326, discriminator: 1)
!707 = !DILocation(line: 54, column: 27, scope: !706)
!708 = !DILocation(line: 54, column: 32, scope: !706)
!709 = !DILocation(line: 54, column: 6, scope: !706)
!710 = !DILocation(line: 55, column: 3, scope: !702)
!711 = !DILocation(line: 57, column: 29, scope: !682)
!712 = !DILocation(line: 57, column: 41, scope: !682)
!713 = !DILocation(line: 57, column: 47, scope: !682)
!714 = !DILocation(line: 57, column: 9, scope: !682)
!715 = !DILocation(line: 57, column: 7, scope: !682)
!716 = !DILocation(line: 58, column: 6, scope: !717)
!717 = distinct !DILexicalBlock(scope: !682, file: !326, line: 58, column: 6)
!718 = !DILocation(line: 58, column: 11, scope: !717)
!719 = !DILocation(line: 58, column: 6, scope: !682)
!720 = !DILocation(line: 59, column: 3, scope: !717)
!721 = !DILocation(line: 61, column: 6, scope: !722)
!722 = distinct !DILexicalBlock(scope: !682, file: !326, line: 61, column: 6)
!723 = !DILocation(line: 61, column: 16, scope: !722)
!724 = !DILocation(line: 61, column: 41, scope: !725)
!725 = !DILexicalBlockFile(scope: !722, file: !326, discriminator: 1)
!726 = !DILocation(line: 61, column: 20, scope: !725)
!727 = !DILocation(line: 61, column: 6, scope: !725)
!728 = !DILocation(line: 62, column: 3, scope: !722)
!729 = !DILocation(line: 64, column: 29, scope: !682)
!730 = !DILocation(line: 64, column: 9, scope: !682)
!731 = !DILocation(line: 64, column: 2, scope: !682)
!732 = !DILocation(line: 65, column: 1, scope: !682)
!733 = !DILocalVariable(name: "window", arg: 1, scope: !325, file: !326, line: 134, type: !329)
!734 = !DILocation(line: 134, column: 33, scope: !325)
!735 = !DILocalVariable(name: "line", arg: 2, scope: !325, file: !326, line: 134, type: !301)
!736 = !DILocation(line: 134, column: 53, scope: !325)
!737 = !DILocalVariable(name: "pos", arg: 3, scope: !325, file: !326, line: 134, type: !420)
!738 = !DILocation(line: 134, column: 64, scope: !325)
!739 = !DILocalVariable(name: "erase", arg: 4, scope: !325, file: !326, line: 134, type: !303)
!740 = !DILocation(line: 134, column: 73, scope: !325)
!741 = !DILocalVariable(name: "backward", arg: 5, scope: !325, file: !326, line: 134, type: !303)
!742 = !DILocation(line: 134, column: 84, scope: !325)
!743 = !DILocalVariable(name: "old_startpos", scope: !325, file: !326, line: 137, type: !303)
!744 = !DILocation(line: 137, column: 13, scope: !325)
!745 = !DILocalVariable(name: "old_wordlen", scope: !325, file: !326, line: 137, type: !303)
!746 = !DILocation(line: 137, column: 27, scope: !325)
!747 = !DILocalVariable(name: "result", scope: !325, file: !326, line: 139, type: !439)
!748 = !DILocation(line: 139, column: 11, scope: !325)
!749 = !DILocalVariable(name: "cmdchars", scope: !325, file: !326, line: 140, type: !301)
!750 = !DILocation(line: 140, column: 14, scope: !325)
!751 = !DILocalVariable(name: "word", scope: !325, file: !326, line: 141, type: !311)
!752 = !DILocation(line: 141, column: 8, scope: !325)
!753 = !DILocalVariable(name: "wordstart", scope: !325, file: !326, line: 141, type: !311)
!754 = !DILocation(line: 141, column: 15, scope: !325)
!755 = !DILocalVariable(name: "linestart", scope: !325, file: !326, line: 141, type: !311)
!756 = !DILocation(line: 141, column: 27, scope: !325)
!757 = !DILocalVariable(name: "ret", scope: !325, file: !326, line: 141, type: !311)
!758 = !DILocation(line: 141, column: 39, scope: !325)
!759 = !DILocalVariable(name: "data", scope: !325, file: !326, line: 141, type: !311)
!760 = !DILocation(line: 141, column: 45, scope: !325)
!761 = !DILocalVariable(name: "continue_complete", scope: !325, file: !326, line: 142, type: !303)
!762 = !DILocation(line: 142, column: 6, scope: !325)
!763 = !DILocalVariable(name: "want_space", scope: !325, file: !326, line: 142, type: !303)
!764 = !DILocation(line: 142, column: 25, scope: !325)
!765 = !DILocalVariable(name: "expand_escapes", scope: !325, file: !326, line: 142, type: !303)
!766 = !DILocation(line: 142, column: 37, scope: !325)
!767 = !DILocation(line: 144, column: 2, scope: !325)
!768 = distinct !{!768, !767}
!769 = !DILocation(line: 144, column: 10, scope: !770)
!770 = !DILexicalBlockFile(scope: !771, file: !326, discriminator: 1)
!771 = distinct !DILexicalBlock(scope: !772, file: !326, line: 144, column: 10)
!772 = distinct !DILexicalBlock(scope: !325, file: !326, line: 144, column: 4)
!773 = !DILocation(line: 144, column: 15, scope: !770)
!774 = !DILocation(line: 144, column: 5, scope: !775)
!775 = !DILexicalBlockFile(scope: !776, file: !326, discriminator: 2)
!776 = distinct !DILexicalBlock(scope: !771, file: !326, line: 144, column: 3)
!777 = !DILocation(line: 144, column: 14, scope: !778)
!778 = !DILexicalBlockFile(scope: !779, file: !326, discriminator: 3)
!779 = distinct !DILexicalBlock(scope: !771, file: !326, line: 144, column: 12)
!780 = !DILocation(line: 144, column: 99, scope: !778)
!781 = !DILocation(line: 144, column: 7, scope: !782)
!782 = !DILexicalBlockFile(scope: !772, file: !326, discriminator: 4)
!783 = !DILocation(line: 145, column: 2, scope: !325)
!784 = distinct !{!784, !783}
!785 = !DILocation(line: 145, column: 10, scope: !786)
!786 = !DILexicalBlockFile(scope: !787, file: !326, discriminator: 1)
!787 = distinct !DILexicalBlock(scope: !788, file: !326, line: 145, column: 10)
!788 = distinct !DILexicalBlock(scope: !325, file: !326, line: 145, column: 4)
!789 = !DILocation(line: 145, column: 14, scope: !786)
!790 = !DILocation(line: 145, column: 5, scope: !791)
!791 = !DILexicalBlockFile(scope: !792, file: !326, discriminator: 2)
!792 = distinct !DILexicalBlock(scope: !787, file: !326, line: 145, column: 3)
!793 = !DILocation(line: 145, column: 14, scope: !794)
!794 = !DILexicalBlockFile(scope: !795, file: !326, discriminator: 3)
!795 = distinct !DILexicalBlock(scope: !787, file: !326, line: 145, column: 12)
!796 = !DILocation(line: 145, column: 98, scope: !794)
!797 = !DILocation(line: 145, column: 7, scope: !798)
!798 = !DILexicalBlockFile(scope: !788, file: !326, discriminator: 4)
!799 = !DILocation(line: 147, column: 22, scope: !325)
!800 = !DILocation(line: 147, column: 31, scope: !325)
!801 = !DILocation(line: 147, column: 38, scope: !325)
!802 = !DILocation(line: 147, column: 42, scope: !803)
!803 = !DILexicalBlockFile(scope: !325, file: !326, discriminator: 1)
!804 = !DILocation(line: 147, column: 41, scope: !803)
!805 = !DILocation(line: 147, column: 49, scope: !803)
!806 = !DILocation(line: 147, column: 46, scope: !803)
!807 = !DILocation(line: 147, column: 63, scope: !803)
!808 = !DILocation(line: 148, column: 13, scope: !325)
!809 = !DILocation(line: 148, column: 19, scope: !325)
!810 = !DILocation(line: 148, column: 3, scope: !325)
!811 = !DILocation(line: 148, column: 30, scope: !325)
!812 = !DILocation(line: 147, column: 63, scope: !813)
!813 = !DILexicalBlockFile(scope: !325, file: !326, discriminator: 2)
!814 = !DILocation(line: 147, column: 20, scope: !813)
!815 = !DILocation(line: 150, column: 6, scope: !816)
!816 = distinct !DILexicalBlock(scope: !325, file: !326, line: 150, column: 6)
!817 = !DILocation(line: 150, column: 12, scope: !816)
!818 = !DILocation(line: 150, column: 16, scope: !819)
!819 = !DILexicalBlockFile(scope: !816, file: !326, discriminator: 1)
!820 = !DILocation(line: 150, column: 6, scope: !819)
!821 = !DILocation(line: 151, column: 3, scope: !816)
!822 = !DILocation(line: 153, column: 17, scope: !325)
!823 = !DILocation(line: 153, column: 15, scope: !325)
!824 = !DILocation(line: 154, column: 16, scope: !325)
!825 = !DILocation(line: 154, column: 14, scope: !325)
!826 = !DILocation(line: 156, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !325, file: !326, line: 156, column: 6)
!828 = !DILocation(line: 156, column: 13, scope: !827)
!829 = !DILocation(line: 156, column: 16, scope: !830)
!830 = !DILexicalBlockFile(scope: !827, file: !326, discriminator: 1)
!831 = !DILocation(line: 156, column: 6, scope: !830)
!832 = !DILocation(line: 157, column: 8, scope: !833)
!833 = distinct !DILexicalBlock(scope: !827, file: !326, line: 156, column: 35)
!834 = !DILocation(line: 158, column: 27, scope: !833)
!835 = !DILocation(line: 159, column: 2, scope: !833)
!836 = !DILocalVariable(name: "old_wordstart", scope: !837, file: !326, line: 160, type: !311)
!837 = distinct !DILexicalBlock(scope: !827, file: !326, line: 159, column: 9)
!838 = !DILocation(line: 160, column: 9, scope: !837)
!839 = !DILocation(line: 163, column: 22, scope: !837)
!840 = !DILocation(line: 163, column: 29, scope: !837)
!841 = !DILocation(line: 163, column: 28, scope: !837)
!842 = !DILocation(line: 163, column: 10, scope: !837)
!843 = !DILocation(line: 163, column: 8, scope: !837)
!844 = !DILocation(line: 164, column: 19, scope: !837)
!845 = !DILocation(line: 164, column: 17, scope: !837)
!846 = !DILocation(line: 166, column: 21, scope: !837)
!847 = !DILocation(line: 166, column: 31, scope: !837)
!848 = !DILocation(line: 166, column: 30, scope: !837)
!849 = !DILocation(line: 166, column: 14, scope: !837)
!850 = !DILocation(line: 166, column: 12, scope: !837)
!851 = !DILocation(line: 167, column: 20, scope: !837)
!852 = !DILocation(line: 167, column: 13, scope: !837)
!853 = !DILocation(line: 167, column: 11, scope: !837)
!854 = !DILocation(line: 170, column: 3, scope: !837)
!855 = !DILocation(line: 170, column: 10, scope: !856)
!856 = !DILexicalBlockFile(scope: !837, file: !326, discriminator: 1)
!857 = !DILocation(line: 170, column: 22, scope: !856)
!858 = !DILocation(line: 170, column: 20, scope: !856)
!859 = !DILocation(line: 170, column: 27, scope: !856)
!860 = !DILocation(line: 170, column: 32, scope: !861)
!861 = !DILexicalBlockFile(scope: !837, file: !326, discriminator: 2)
!862 = !DILocation(line: 170, column: 31, scope: !861)
!863 = !DILocation(line: 170, column: 47, scope: !861)
!864 = !DILocation(line: 170, column: 3, scope: !865)
!865 = !DILexicalBlockFile(scope: !837, file: !326, discriminator: 3)
!866 = !DILocation(line: 171, column: 13, scope: !837)
!867 = !DILocation(line: 170, column: 3, scope: !868)
!868 = !DILexicalBlockFile(scope: !837, file: !326, discriminator: 4)
!869 = distinct !{!869, !854}
!870 = !DILocation(line: 174, column: 7, scope: !871)
!871 = distinct !DILexicalBlock(scope: !837, file: !326, line: 174, column: 7)
!872 = !DILocation(line: 174, column: 23, scope: !871)
!873 = !DILocation(line: 174, column: 21, scope: !871)
!874 = !DILocation(line: 174, column: 28, scope: !871)
!875 = !DILocation(line: 174, column: 31, scope: !876)
!876 = !DILexicalBlockFile(scope: !871, file: !326, discriminator: 1)
!877 = !DILocation(line: 174, column: 44, scope: !876)
!878 = !DILocation(line: 174, column: 41, scope: !876)
!879 = !DILocation(line: 174, column: 7, scope: !876)
!880 = !DILocation(line: 175, column: 16, scope: !871)
!881 = !DILocation(line: 175, column: 30, scope: !871)
!882 = !DILocation(line: 175, column: 14, scope: !871)
!883 = !DILocation(line: 175, column: 4, scope: !871)
!884 = !DILocation(line: 177, column: 25, scope: !837)
!885 = !DILocation(line: 177, column: 38, scope: !837)
!886 = !DILocation(line: 177, column: 48, scope: !837)
!887 = !DILocation(line: 177, column: 47, scope: !837)
!888 = !DILocation(line: 177, column: 31, scope: !837)
!889 = !DILocation(line: 177, column: 15, scope: !837)
!890 = !DILocation(line: 177, column: 13, scope: !837)
!891 = !DILocation(line: 185, column: 8, scope: !892)
!892 = distinct !DILexicalBlock(scope: !837, file: !326, line: 185, column: 7)
!893 = !DILocation(line: 185, column: 14, scope: !892)
!894 = !DILocation(line: 185, column: 18, scope: !895)
!895 = !DILexicalBlockFile(scope: !892, file: !326, discriminator: 1)
!896 = !DILocation(line: 185, column: 17, scope: !895)
!897 = !DILocation(line: 185, column: 22, scope: !895)
!898 = !DILocation(line: 185, column: 26, scope: !895)
!899 = !DILocation(line: 185, column: 37, scope: !900)
!900 = !DILexicalBlockFile(scope: !892, file: !326, discriminator: 2)
!901 = !DILocation(line: 185, column: 36, scope: !900)
!902 = !DILocation(line: 185, column: 40, scope: !900)
!903 = !DILocation(line: 185, column: 31, scope: !900)
!904 = !DILocation(line: 185, column: 30, scope: !900)
!905 = !DILocation(line: 185, column: 45, scope: !900)
!906 = !DILocation(line: 185, column: 53, scope: !900)
!907 = !DILocation(line: 186, column: 9, scope: !892)
!908 = !DILocation(line: 186, column: 8, scope: !892)
!909 = !DILocation(line: 186, column: 19, scope: !892)
!910 = !DILocation(line: 186, column: 27, scope: !892)
!911 = !DILocation(line: 186, column: 33, scope: !895)
!912 = !DILocation(line: 186, column: 32, scope: !895)
!913 = !DILocation(line: 186, column: 48, scope: !895)
!914 = !DILocation(line: 185, column: 7, scope: !865)
!915 = !DILocalVariable(name: "old", scope: !916, file: !326, line: 187, type: !311)
!916 = distinct !DILexicalBlock(scope: !892, file: !326, line: 186, column: 58)
!917 = !DILocation(line: 187, column: 10, scope: !916)
!918 = !DILocation(line: 189, column: 10, scope: !916)
!919 = !DILocation(line: 189, column: 8, scope: !916)
!920 = !DILocation(line: 191, column: 9, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !326, line: 191, column: 8)
!922 = !DILocation(line: 191, column: 8, scope: !921)
!923 = !DILocation(line: 191, column: 19, scope: !921)
!924 = !DILocation(line: 191, column: 8, scope: !916)
!925 = !DILocation(line: 192, column: 26, scope: !926)
!926 = distinct !DILexicalBlock(scope: !921, file: !326, line: 191, column: 28)
!927 = !DILocation(line: 192, column: 17, scope: !926)
!928 = !DILocation(line: 192, column: 15, scope: !926)
!929 = !DILocation(line: 193, column: 4, scope: !926)
!930 = !DILocalVariable(name: "str", scope: !931, file: !326, line: 194, type: !439)
!931 = distinct !DILexicalBlock(scope: !921, file: !326, line: 193, column: 11)
!932 = !DILocation(line: 194, column: 14, scope: !931)
!933 = !DILocation(line: 194, column: 33, scope: !931)
!934 = !DILocation(line: 194, column: 20, scope: !931)
!935 = !DILocation(line: 195, column: 9, scope: !936)
!936 = distinct !DILexicalBlock(scope: !931, file: !326, line: 195, column: 9)
!937 = !DILocation(line: 195, column: 39, scope: !936)
!938 = !DILocation(line: 195, column: 44, scope: !936)
!939 = !DILocation(line: 195, column: 48, scope: !936)
!940 = !DILocation(line: 195, column: 30, scope: !936)
!941 = !DILocation(line: 195, column: 35, scope: !936)
!942 = !DILocation(line: 195, column: 27, scope: !936)
!943 = !DILocation(line: 195, column: 9, scope: !931)
!944 = !DILocation(line: 197, column: 32, scope: !945)
!945 = distinct !DILexicalBlock(scope: !936, file: !326, line: 195, column: 54)
!946 = !DILocation(line: 197, column: 37, scope: !945)
!947 = !DILocation(line: 197, column: 6, scope: !945)
!948 = !DILocation(line: 198, column: 5, scope: !945)
!949 = !DILocation(line: 199, column: 21, scope: !931)
!950 = !DILocation(line: 199, column: 26, scope: !931)
!951 = !DILocation(line: 199, column: 5, scope: !931)
!952 = !DILocation(line: 200, column: 31, scope: !931)
!953 = !DILocation(line: 200, column: 17, scope: !931)
!954 = !DILocation(line: 200, column: 15, scope: !931)
!955 = !DILocation(line: 202, column: 11, scope: !916)
!956 = !DILocation(line: 202, column: 4, scope: !916)
!957 = !DILocation(line: 204, column: 11, scope: !916)
!958 = !DILocation(line: 204, column: 4, scope: !916)
!959 = !DILocation(line: 205, column: 11, scope: !916)
!960 = !DILocation(line: 205, column: 9, scope: !916)
!961 = !DILocation(line: 207, column: 16, scope: !916)
!962 = !DILocation(line: 207, column: 15, scope: !916)
!963 = !DILocation(line: 207, column: 26, scope: !916)
!964 = !DILocation(line: 207, column: 15, scope: !965)
!965 = !DILexicalBlockFile(scope: !916, file: !326, discriminator: 1)
!966 = !DILocation(line: 208, column: 12, scope: !916)
!967 = !DILocation(line: 208, column: 5, scope: !916)
!968 = !DILocation(line: 208, column: 22, scope: !916)
!969 = !DILocation(line: 207, column: 15, scope: !970)
!970 = !DILexicalBlockFile(scope: !916, file: !326, discriminator: 2)
!971 = !DILocation(line: 207, column: 15, scope: !972)
!972 = !DILexicalBlockFile(scope: !916, file: !326, discriminator: 3)
!973 = !DILocation(line: 207, column: 13, scope: !972)
!974 = !DILocation(line: 209, column: 12, scope: !916)
!975 = !DILocation(line: 210, column: 3, scope: !916)
!976 = !DILocation(line: 214, column: 6, scope: !977)
!977 = distinct !DILexicalBlock(scope: !325, file: !326, line: 214, column: 6)
!978 = !DILocation(line: 214, column: 6, scope: !325)
!979 = !DILocation(line: 215, column: 36, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !326, line: 214, column: 13)
!981 = !DILocation(line: 215, column: 44, scope: !980)
!982 = !DILocation(line: 215, column: 50, scope: !980)
!983 = !DILocation(line: 215, column: 3, scope: !980)
!984 = !DILocation(line: 218, column: 28, scope: !980)
!985 = !DILocation(line: 218, column: 26, scope: !980)
!986 = !DILocation(line: 219, column: 13, scope: !980)
!987 = !DILocation(line: 219, column: 11, scope: !980)
!988 = !DILocation(line: 220, column: 2, scope: !980)
!989 = !DILocation(line: 222, column: 6, scope: !990)
!990 = distinct !DILexicalBlock(scope: !325, file: !326, line: 222, column: 6)
!991 = !DILocation(line: 222, column: 6, scope: !325)
!992 = !DILocation(line: 224, column: 7, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !326, line: 224, column: 7)
!994 = distinct !DILexicalBlock(scope: !990, file: !326, line: 222, column: 25)
!995 = !DILocation(line: 224, column: 7, scope: !994)
!996 = !DILocation(line: 225, column: 15, scope: !993)
!997 = !DILocation(line: 225, column: 25, scope: !993)
!998 = !DILocation(line: 225, column: 30, scope: !993)
!999 = !DILocation(line: 225, column: 39, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !993, file: !326, discriminator: 1)
!1001 = !DILocation(line: 225, column: 49, scope: !1000)
!1002 = !DILocation(line: 225, column: 15, scope: !1000)
!1003 = !DILocation(line: 226, column: 17, scope: !993)
!1004 = !DILocation(line: 226, column: 5, scope: !993)
!1005 = !DILocation(line: 225, column: 15, scope: !1006)
!1006 = !DILexicalBlockFile(scope: !993, file: !326, discriminator: 2)
!1007 = !DILocation(line: 225, column: 15, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !993, file: !326, discriminator: 3)
!1009 = !DILocation(line: 225, column: 13, scope: !1008)
!1010 = !DILocation(line: 225, column: 4, scope: !1008)
!1011 = !DILocation(line: 228, column: 15, scope: !993)
!1012 = !DILocation(line: 228, column: 25, scope: !993)
!1013 = !DILocation(line: 228, column: 30, scope: !993)
!1014 = !DILocation(line: 228, column: 39, scope: !1000)
!1015 = !DILocation(line: 228, column: 49, scope: !1000)
!1016 = !DILocation(line: 228, column: 15, scope: !1000)
!1017 = !DILocation(line: 229, column: 18, scope: !993)
!1018 = !DILocation(line: 229, column: 5, scope: !993)
!1019 = !DILocation(line: 228, column: 15, scope: !1006)
!1020 = !DILocation(line: 228, column: 15, scope: !1008)
!1021 = !DILocation(line: 228, column: 13, scope: !1008)
!1022 = !DILocation(line: 230, column: 16, scope: !994)
!1023 = !DILocation(line: 230, column: 14, scope: !994)
!1024 = !DILocation(line: 231, column: 2, scope: !994)
!1025 = !DILocation(line: 233, column: 3, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !990, file: !326, line: 231, column: 9)
!1027 = !DILocation(line: 235, column: 14, scope: !1026)
!1028 = !DILocation(line: 236, column: 46, scope: !1026)
!1029 = !DILocation(line: 236, column: 54, scope: !1026)
!1030 = !DILocation(line: 236, column: 60, scope: !1026)
!1031 = !DILocation(line: 236, column: 3, scope: !1026)
!1032 = !DILocation(line: 237, column: 21, scope: !1026)
!1033 = !DILocation(line: 237, column: 19, scope: !1026)
!1034 = !DILocation(line: 239, column: 7, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1026, file: !326, line: 239, column: 7)
!1036 = !DILocation(line: 239, column: 16, scope: !1035)
!1037 = !DILocation(line: 239, column: 7, scope: !1026)
!1038 = !DILocation(line: 241, column: 46, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !326, line: 239, column: 24)
!1040 = !DILocation(line: 241, column: 33, scope: !1039)
!1041 = !DILocation(line: 241, column: 15, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1039, file: !326, discriminator: 1)
!1043 = !DILocation(line: 241, column: 13, scope: !1039)
!1044 = !DILocation(line: 242, column: 3, scope: !1039)
!1045 = !DILocation(line: 245, column: 9, scope: !325)
!1046 = !DILocation(line: 245, column: 2, scope: !325)
!1047 = !DILocation(line: 246, column: 9, scope: !325)
!1048 = !DILocation(line: 246, column: 2, scope: !325)
!1049 = !DILocation(line: 248, column: 6, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !325, file: !326, line: 248, column: 6)
!1051 = !DILocation(line: 248, column: 15, scope: !1050)
!1052 = !DILocation(line: 248, column: 6, scope: !325)
!1053 = !DILocation(line: 249, column: 3, scope: !1050)
!1054 = !DILocation(line: 252, column: 13, scope: !325)
!1055 = !DILocation(line: 252, column: 11, scope: !325)
!1056 = !DILocation(line: 255, column: 19, scope: !325)
!1057 = !DILocation(line: 255, column: 17, scope: !325)
!1058 = !DILocation(line: 258, column: 16, scope: !325)
!1059 = !DILocation(line: 258, column: 27, scope: !325)
!1060 = !DILocation(line: 258, column: 26, scope: !325)
!1061 = !DILocation(line: 258, column: 9, scope: !325)
!1062 = !DILocation(line: 258, column: 33, scope: !325)
!1063 = !DILocation(line: 258, column: 40, scope: !325)
!1064 = !DILocation(line: 258, column: 43, scope: !803)
!1065 = !DILocation(line: 258, column: 9, scope: !803)
!1066 = !DILocation(line: 259, column: 17, scope: !325)
!1067 = !DILocation(line: 259, column: 27, scope: !325)
!1068 = !DILocation(line: 259, column: 3, scope: !325)
!1069 = !DILocation(line: 258, column: 9, scope: !813)
!1070 = !DILocation(line: 259, column: 44, scope: !803)
!1071 = !DILocation(line: 259, column: 54, scope: !803)
!1072 = !DILocation(line: 259, column: 35, scope: !803)
!1073 = !DILocation(line: 258, column: 9, scope: !1074)
!1074 = !DILexicalBlockFile(scope: !325, file: !326, discriminator: 3)
!1075 = !DILocation(line: 258, column: 9, scope: !1076)
!1076 = !DILexicalBlockFile(scope: !325, file: !326, discriminator: 4)
!1077 = !DILocation(line: 258, column: 7, scope: !1076)
!1078 = !DILocation(line: 262, column: 9, scope: !325)
!1079 = !DILocation(line: 262, column: 27, scope: !325)
!1080 = !DILocation(line: 262, column: 20, scope: !325)
!1081 = !DILocation(line: 262, column: 18, scope: !325)
!1082 = !DILocation(line: 262, column: 3, scope: !325)
!1083 = !DILocation(line: 262, column: 7, scope: !325)
!1084 = !DILocation(line: 266, column: 24, scope: !325)
!1085 = !DILocation(line: 266, column: 11, scope: !325)
!1086 = !DILocation(line: 266, column: 9, scope: !325)
!1087 = !DILocation(line: 267, column: 17, scope: !325)
!1088 = !DILocation(line: 267, column: 25, scope: !325)
!1089 = !DILocation(line: 267, column: 35, scope: !325)
!1090 = !DILocation(line: 267, column: 2, scope: !325)
!1091 = !DILocation(line: 268, column: 18, scope: !325)
!1092 = !DILocation(line: 268, column: 26, scope: !325)
!1093 = !DILocation(line: 268, column: 36, scope: !325)
!1094 = !DILocation(line: 268, column: 2, scope: !325)
!1095 = !DILocation(line: 270, column: 6, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !325, file: !326, line: 270, column: 6)
!1097 = !DILocation(line: 270, column: 6, scope: !325)
!1098 = !DILocation(line: 271, column: 24, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !326, line: 271, column: 7)
!1100 = distinct !DILexicalBlock(scope: !1096, file: !326, line: 270, column: 18)
!1101 = !DILocation(line: 271, column: 23, scope: !1099)
!1102 = !DILocation(line: 271, column: 11, scope: !1099)
!1103 = !DILocation(line: 271, column: 19, scope: !1099)
!1104 = !DILocation(line: 271, column: 10, scope: !1099)
!1105 = !DILocation(line: 271, column: 30, scope: !1099)
!1106 = !DILocation(line: 271, column: 38, scope: !1099)
!1107 = !DILocation(line: 271, column: 56, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1099, file: !326, discriminator: 1)
!1109 = !DILocation(line: 271, column: 55, scope: !1108)
!1110 = !DILocation(line: 271, column: 43, scope: !1108)
!1111 = !DILocation(line: 271, column: 51, scope: !1108)
!1112 = !DILocation(line: 271, column: 42, scope: !1108)
!1113 = !DILocation(line: 271, column: 62, scope: !1108)
!1114 = !DILocation(line: 271, column: 7, scope: !1108)
!1115 = !DILocation(line: 272, column: 22, scope: !1099)
!1116 = !DILocation(line: 272, column: 31, scope: !1099)
!1117 = !DILocation(line: 272, column: 30, scope: !1099)
!1118 = !DILocation(line: 272, column: 4, scope: !1099)
!1119 = !DILocation(line: 273, column: 5, scope: !1100)
!1120 = !DILocation(line: 273, column: 9, scope: !1100)
!1121 = !DILocation(line: 274, column: 2, scope: !1100)
!1122 = !DILocation(line: 276, column: 19, scope: !325)
!1123 = !DILocation(line: 276, column: 12, scope: !325)
!1124 = !DILocation(line: 276, column: 10, scope: !325)
!1125 = !DILocation(line: 277, column: 19, scope: !325)
!1126 = !DILocation(line: 277, column: 18, scope: !325)
!1127 = !DILocation(line: 277, column: 16, scope: !325)
!1128 = !DILocation(line: 278, column: 9, scope: !325)
!1129 = !DILocation(line: 278, column: 2, scope: !325)
!1130 = !DILocation(line: 279, column: 23, scope: !325)
!1131 = !DILocation(line: 279, column: 31, scope: !325)
!1132 = !DILocation(line: 279, column: 14, scope: !325)
!1133 = !DILocation(line: 279, column: 12, scope: !325)
!1134 = !DILocation(line: 281, column: 8, scope: !325)
!1135 = !DILocation(line: 281, column: 16, scope: !325)
!1136 = !DILocation(line: 281, column: 6, scope: !325)
!1137 = !DILocation(line: 282, column: 16, scope: !325)
!1138 = !DILocation(line: 282, column: 2, scope: !325)
!1139 = !DILocation(line: 285, column: 9, scope: !325)
!1140 = !DILocation(line: 285, column: 2, scope: !325)
!1141 = !DILocation(line: 287, column: 9, scope: !325)
!1142 = !DILocation(line: 287, column: 2, scope: !325)
!1143 = !DILocation(line: 288, column: 1, scope: !325)
!1144 = distinct !DISubprogram(name: "g_string_append_c_inline", scope: !441, file: !441, line: 161, type: !1145, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!439, !439, !298}
!1147 = !DILocalVariable(name: "gstring", arg: 1, scope: !1144, file: !441, line: 161, type: !439)
!1148 = !DILocation(line: 161, column: 36, scope: !1144)
!1149 = !DILocalVariable(name: "c", arg: 2, scope: !1144, file: !441, line: 162, type: !298)
!1150 = !DILocation(line: 162, column: 33, scope: !1144)
!1151 = !DILocation(line: 164, column: 7, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1144, file: !441, line: 164, column: 7)
!1153 = !DILocation(line: 164, column: 16, scope: !1152)
!1154 = !DILocation(line: 164, column: 20, scope: !1152)
!1155 = !DILocation(line: 164, column: 26, scope: !1152)
!1156 = !DILocation(line: 164, column: 35, scope: !1152)
!1157 = !DILocation(line: 164, column: 24, scope: !1152)
!1158 = !DILocation(line: 164, column: 7, scope: !1144)
!1159 = !DILocation(line: 166, column: 38, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1152, file: !441, line: 165, column: 5)
!1161 = !DILocation(line: 166, column: 20, scope: !1160)
!1162 = !DILocation(line: 166, column: 29, scope: !1160)
!1163 = !DILocation(line: 166, column: 32, scope: !1160)
!1164 = !DILocation(line: 166, column: 7, scope: !1160)
!1165 = !DILocation(line: 166, column: 16, scope: !1160)
!1166 = !DILocation(line: 166, column: 36, scope: !1160)
!1167 = !DILocation(line: 167, column: 20, scope: !1160)
!1168 = !DILocation(line: 167, column: 29, scope: !1160)
!1169 = !DILocation(line: 167, column: 7, scope: !1160)
!1170 = !DILocation(line: 167, column: 16, scope: !1160)
!1171 = !DILocation(line: 167, column: 34, scope: !1160)
!1172 = !DILocation(line: 168, column: 5, scope: !1160)
!1173 = !DILocation(line: 170, column: 24, scope: !1152)
!1174 = !DILocation(line: 170, column: 37, scope: !1152)
!1175 = !DILocation(line: 170, column: 5, scope: !1152)
!1176 = !DILocation(line: 171, column: 10, scope: !1144)
!1177 = !DILocation(line: 171, column: 3, scope: !1144)
!1178 = distinct !DISubprogram(name: "free_completions", scope: !326, file: !326, line: 122, type: !1179, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null}
!1181 = !DILocation(line: 124, column: 26, scope: !1178)
!1182 = !DILocation(line: 124, column: 13, scope: !1178)
!1183 = !DILocation(line: 124, column: 11, scope: !1178)
!1184 = !DILocation(line: 126, column: 17, scope: !1178)
!1185 = !DILocation(line: 126, column: 2, scope: !1178)
!1186 = !DILocation(line: 127, column: 14, scope: !1178)
!1187 = !DILocation(line: 127, column: 2, scope: !1178)
!1188 = !DILocation(line: 128, column: 18, scope: !1178)
!1189 = !DILocation(line: 130, column: 2, scope: !1178)
!1190 = distinct !{!1190, !1189}
!1191 = !DILocation(line: 130, column: 11, scope: !1192)
!1192 = !DILexicalBlockFile(scope: !1193, file: !326, discriminator: 1)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !326, line: 130, column: 11)
!1194 = distinct !DILexicalBlock(scope: !1178, file: !326, line: 130, column: 5)
!1195 = !DILocation(line: 130, column: 31, scope: !1196)
!1196 = !DILexicalBlockFile(scope: !1197, file: !326, discriminator: 2)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !326, line: 130, column: 22)
!1198 = !DILocation(line: 130, column: 24, scope: !1196)
!1199 = !DILocation(line: 130, column: 55, scope: !1196)
!1200 = !DILocation(line: 130, column: 3, scope: !1196)
!1201 = !DILocation(line: 130, column: 5, scope: !1202)
!1202 = !DILexicalBlockFile(scope: !1194, file: !326, discriminator: 3)
!1203 = !DILocation(line: 131, column: 1, scope: !1178)
!1204 = distinct !DISubprogram(name: "filename_complete", scope: !326, file: !326, line: 319, type: !1205, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!401, !301, !301}
!1207 = !DILocalVariable(name: "path", arg: 1, scope: !1204, file: !326, line: 319, type: !301)
!1208 = !DILocation(line: 319, column: 38, scope: !1204)
!1209 = !DILocalVariable(name: "default_path", arg: 2, scope: !1204, file: !326, line: 319, type: !301)
!1210 = !DILocation(line: 319, column: 56, scope: !1204)
!1211 = !DILocalVariable(name: "list", scope: !1204, file: !326, line: 321, type: !401)
!1212 = !DILocation(line: 321, column: 16, scope: !1204)
!1213 = !DILocalVariable(name: "dirp", scope: !1204, file: !326, line: 322, type: !1214)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1216, line: 127, baseType: !1217)
!1216 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/irssi/task1")
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1216, line: 127, flags: DIFlagFwdDecl)
!1218 = !DILocation(line: 322, column: 7, scope: !1204)
!1219 = !DILocalVariable(name: "dp", scope: !1204, file: !326, line: 323, type: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1222, line: 22, size: 2240, align: 64, elements: !1223)
!1222 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/irssi/task1")
!1223 = !{!1224, !1226, !1228, !1230, !1232}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1221, file: !1222, line: 25, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !372, line: 127, baseType: !448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1221, file: !1222, line: 26, baseType: !1227, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !372, line: 131, baseType: !373)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1221, file: !1222, line: 31, baseType: !1229, size: 16, align: 16, offset: 128)
!1229 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1221, file: !1222, line: 32, baseType: !1231, size: 8, align: 8, offset: 144)
!1231 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1221, file: !1222, line: 33, baseType: !1233, size: 2048, align: 8, offset: 152)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 2048, align: 8, elements: !1234)
!1234 = !{!1235}
!1235 = !DISubrange(count: 256)
!1236 = !DILocation(line: 323, column: 17, scope: !1204)
!1237 = !DILocalVariable(name: "basename", scope: !1204, file: !326, line: 324, type: !311)
!1238 = !DILocation(line: 324, column: 8, scope: !1204)
!1239 = !DILocalVariable(name: "realpath", scope: !1204, file: !326, line: 325, type: !311)
!1240 = !DILocation(line: 325, column: 8, scope: !1204)
!1241 = !DILocalVariable(name: "dir", scope: !1204, file: !326, line: 325, type: !311)
!1242 = !DILocation(line: 325, column: 19, scope: !1204)
!1243 = !DILocalVariable(name: "name", scope: !1204, file: !326, line: 325, type: !311)
!1244 = !DILocation(line: 325, column: 25, scope: !1204)
!1245 = !DILocalVariable(name: "len", scope: !1204, file: !326, line: 326, type: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1247, line: 216, baseType: !448)
!1247 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/irssi/task1")
!1248 = !DILocation(line: 326, column: 9, scope: !1204)
!1249 = !DILocation(line: 328, column: 2, scope: !1204)
!1250 = distinct !{!1250, !1249}
!1251 = !DILocation(line: 328, column: 10, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !1253, file: !326, discriminator: 1)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !326, line: 328, column: 10)
!1254 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 328, column: 4)
!1255 = !DILocation(line: 328, column: 15, scope: !1252)
!1256 = !DILocation(line: 328, column: 5, scope: !1257)
!1257 = !DILexicalBlockFile(scope: !1258, file: !326, discriminator: 2)
!1258 = distinct !DILexicalBlock(scope: !1253, file: !326, line: 328, column: 3)
!1259 = !DILocation(line: 328, column: 14, scope: !1260)
!1260 = !DILexicalBlockFile(scope: !1261, file: !326, discriminator: 3)
!1261 = distinct !DILexicalBlock(scope: !1253, file: !326, line: 328, column: 12)
!1262 = !DILocation(line: 328, column: 99, scope: !1260)
!1263 = !DILocation(line: 328, column: 7, scope: !1264)
!1264 = !DILexicalBlockFile(scope: !1254, file: !326, discriminator: 4)
!1265 = !DILocation(line: 330, column: 6, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 330, column: 6)
!1267 = !DILocation(line: 330, column: 14, scope: !1266)
!1268 = !DILocation(line: 330, column: 6, scope: !1204)
!1269 = !DILocation(line: 331, column: 6, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1266, file: !326, line: 330, column: 23)
!1271 = !DILocation(line: 334, column: 7, scope: !1204)
!1272 = !DILocation(line: 337, column: 26, scope: !1204)
!1273 = !DILocation(line: 337, column: 13, scope: !1204)
!1274 = !DILocation(line: 337, column: 11, scope: !1204)
!1275 = !DILocation(line: 338, column: 28, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 338, column: 6)
!1277 = !DILocation(line: 338, column: 9, scope: !1276)
!1278 = !DILocation(line: 338, column: 38, scope: !1276)
!1279 = !DILocation(line: 338, column: 43, scope: !1280)
!1280 = !DILexicalBlockFile(scope: !1276, file: !326, discriminator: 1)
!1281 = !DILocation(line: 338, column: 42, scope: !1280)
!1282 = !DILocation(line: 338, column: 56, scope: !1280)
!1283 = !DILocation(line: 338, column: 63, scope: !1280)
!1284 = !DILocation(line: 338, column: 68, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1276, file: !326, discriminator: 2)
!1286 = !DILocation(line: 338, column: 67, scope: !1285)
!1287 = !DILocation(line: 338, column: 81, scope: !1285)
!1288 = !DILocation(line: 338, column: 89, scope: !1285)
!1289 = !DILocation(line: 338, column: 93, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !1276, file: !326, discriminator: 3)
!1291 = !DILocation(line: 338, column: 92, scope: !1290)
!1292 = !DILocation(line: 338, column: 106, scope: !1290)
!1293 = !DILocation(line: 338, column: 116, scope: !1290)
!1294 = !DILocation(line: 338, column: 119, scope: !1295)
!1295 = !DILexicalBlockFile(scope: !1276, file: !326, discriminator: 4)
!1296 = !DILocation(line: 338, column: 132, scope: !1295)
!1297 = !DILocation(line: 338, column: 6, scope: !1295)
!1298 = !DILocation(line: 339, column: 24, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1276, file: !326, line: 338, column: 8)
!1300 = !DILocation(line: 339, column: 17, scope: !1299)
!1301 = !DILocation(line: 340, column: 26, scope: !1299)
!1302 = !DILocation(line: 341, column: 12, scope: !1299)
!1303 = !DILocation(line: 340, column: 14, scope: !1299)
!1304 = !DILocation(line: 340, column: 12, scope: !1299)
!1305 = !DILocation(line: 342, column: 2, scope: !1299)
!1306 = !DILocation(line: 345, column: 27, scope: !1204)
!1307 = !DILocation(line: 345, column: 8, scope: !1204)
!1308 = !DILocation(line: 345, column: 6, scope: !1204)
!1309 = !DILocation(line: 346, column: 17, scope: !1204)
!1310 = !DILocation(line: 346, column: 9, scope: !1204)
!1311 = !DILocation(line: 346, column: 7, scope: !1204)
!1312 = !DILocation(line: 347, column: 9, scope: !1204)
!1313 = !DILocation(line: 347, column: 2, scope: !1204)
!1314 = !DILocation(line: 348, column: 16, scope: !1204)
!1315 = !DILocation(line: 348, column: 9, scope: !1204)
!1316 = !DILocation(line: 350, column: 6, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 350, column: 6)
!1318 = !DILocation(line: 350, column: 11, scope: !1317)
!1319 = !DILocation(line: 350, column: 6, scope: !1204)
!1320 = !DILocation(line: 351, column: 3, scope: !1317)
!1321 = !DILocation(line: 353, column: 27, scope: !1204)
!1322 = !DILocation(line: 353, column: 8, scope: !1204)
!1323 = !DILocation(line: 353, column: 6, scope: !1204)
!1324 = !DILocation(line: 354, column: 7, scope: !1325)
!1325 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 354, column: 6)
!1326 = !DILocation(line: 354, column: 6, scope: !1325)
!1327 = !DILocation(line: 354, column: 11, scope: !1325)
!1328 = !DILocation(line: 354, column: 18, scope: !1325)
!1329 = !DILocation(line: 354, column: 21, scope: !1330)
!1330 = !DILexicalBlockFile(scope: !1325, file: !326, discriminator: 1)
!1331 = !DILocation(line: 354, column: 28, scope: !1330)
!1332 = !DILocation(line: 354, column: 6, scope: !1330)
!1333 = !DILocation(line: 356, column: 4, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1325, file: !326, line: 354, column: 37)
!1335 = !DILocation(line: 356, column: 8, scope: !1334)
!1336 = !DILocation(line: 357, column: 2, scope: !1334)
!1337 = !DILocation(line: 357, column: 15, scope: !1338)
!1338 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 1)
!1339 = distinct !DILexicalBlock(scope: !1325, file: !326, line: 357, column: 13)
!1340 = !DILocation(line: 357, column: 14, scope: !1338)
!1341 = !DILocation(line: 357, column: 23, scope: !1338)
!1342 = !DILocation(line: 357, column: 30, scope: !1338)
!1343 = !DILocation(line: 357, column: 35, scope: !1344)
!1344 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 2)
!1345 = !DILocation(line: 357, column: 34, scope: !1344)
!1346 = !DILocation(line: 357, column: 43, scope: !1344)
!1347 = !DILocation(line: 357, column: 51, scope: !1344)
!1348 = !DILocation(line: 357, column: 55, scope: !1349)
!1349 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 3)
!1350 = !DILocation(line: 357, column: 54, scope: !1349)
!1351 = !DILocation(line: 357, column: 63, scope: !1349)
!1352 = !DILocation(line: 357, column: 72, scope: !1349)
!1353 = !DILocation(line: 357, column: 78, scope: !1354)
!1354 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 4)
!1355 = !DILocation(line: 357, column: 77, scope: !1354)
!1356 = !DILocation(line: 357, column: 87, scope: !1354)
!1357 = !DILocation(line: 357, column: 94, scope: !1354)
!1358 = !DILocation(line: 357, column: 99, scope: !1359)
!1359 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 5)
!1360 = !DILocation(line: 357, column: 98, scope: !1359)
!1361 = !DILocation(line: 357, column: 108, scope: !1359)
!1362 = !DILocation(line: 357, column: 116, scope: !1359)
!1363 = !DILocation(line: 357, column: 120, scope: !1364)
!1364 = !DILexicalBlockFile(scope: !1339, file: !326, discriminator: 6)
!1365 = !DILocation(line: 357, column: 119, scope: !1364)
!1366 = !DILocation(line: 357, column: 129, scope: !1364)
!1367 = !DILocation(line: 357, column: 13, scope: !1364)
!1368 = !DILocation(line: 360, column: 3, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1339, file: !326, line: 357, column: 139)
!1370 = distinct !{!1370, !1368}
!1371 = !DILocation(line: 360, column: 12, scope: !1372)
!1372 = !DILexicalBlockFile(scope: !1373, file: !326, discriminator: 1)
!1373 = distinct !DILexicalBlock(scope: !1374, file: !326, line: 360, column: 12)
!1374 = distinct !DILexicalBlock(scope: !1369, file: !326, line: 360, column: 6)
!1375 = !DILocation(line: 360, column: 26, scope: !1376)
!1376 = !DILexicalBlockFile(scope: !1377, file: !326, discriminator: 2)
!1377 = distinct !DILexicalBlock(scope: !1373, file: !326, line: 360, column: 17)
!1378 = !DILocation(line: 360, column: 19, scope: !1376)
!1379 = !DILocation(line: 360, column: 38, scope: !1376)
!1380 = !DILocation(line: 360, column: 4, scope: !1376)
!1381 = !DILocation(line: 360, column: 6, scope: !1382)
!1382 = !DILexicalBlockFile(scope: !1374, file: !326, discriminator: 3)
!1383 = !DILocation(line: 361, column: 2, scope: !1369)
!1384 = !DILocation(line: 363, column: 15, scope: !1204)
!1385 = !DILocation(line: 363, column: 8, scope: !1204)
!1386 = !DILocation(line: 363, column: 6, scope: !1204)
!1387 = !DILocation(line: 366, column: 6, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 366, column: 6)
!1389 = !DILocation(line: 366, column: 10, scope: !1388)
!1390 = !DILocation(line: 366, column: 14, scope: !1388)
!1391 = !DILocation(line: 366, column: 22, scope: !1392)
!1392 = !DILexicalBlockFile(scope: !1388, file: !326, discriminator: 1)
!1393 = !DILocation(line: 366, column: 26, scope: !1392)
!1394 = !DILocation(line: 366, column: 17, scope: !1392)
!1395 = !DILocation(line: 366, column: 31, scope: !1392)
!1396 = !DILocation(line: 366, column: 6, scope: !1392)
!1397 = !DILocation(line: 367, column: 17, scope: !1398)
!1398 = distinct !DILexicalBlock(scope: !1388, file: !326, line: 366, column: 39)
!1399 = !DILocation(line: 367, column: 15, scope: !1398)
!1400 = !DILocation(line: 368, column: 2, scope: !1398)
!1401 = !DILocation(line: 369, column: 37, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1388, file: !326, line: 368, column: 9)
!1403 = !DILocation(line: 369, column: 17, scope: !1402)
!1404 = !DILocation(line: 369, column: 15, scope: !1402)
!1405 = !DILocation(line: 371, column: 15, scope: !1204)
!1406 = !DILocation(line: 371, column: 8, scope: !1204)
!1407 = !DILocation(line: 371, column: 6, scope: !1204)
!1408 = !DILocation(line: 374, column: 2, scope: !1204)
!1409 = !DILocation(line: 374, column: 23, scope: !1410)
!1410 = !DILexicalBlockFile(scope: !1204, file: !326, discriminator: 1)
!1411 = !DILocation(line: 374, column: 15, scope: !1410)
!1412 = !DILocation(line: 374, column: 13, scope: !1410)
!1413 = !DILocation(line: 374, column: 30, scope: !1410)
!1414 = !DILocation(line: 374, column: 2, scope: !1410)
!1415 = !DILocation(line: 375, column: 7, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1417, file: !326, line: 375, column: 7)
!1417 = distinct !DILexicalBlock(scope: !1204, file: !326, line: 374, column: 38)
!1418 = !DILocation(line: 375, column: 11, scope: !1416)
!1419 = !DILocation(line: 375, column: 21, scope: !1416)
!1420 = !DILocation(line: 375, column: 7, scope: !1417)
!1421 = !DILocation(line: 376, column: 8, scope: !1422)
!1422 = distinct !DILexicalBlock(scope: !1423, file: !326, line: 376, column: 8)
!1423 = distinct !DILexicalBlock(scope: !1416, file: !326, line: 375, column: 29)
!1424 = !DILocation(line: 376, column: 12, scope: !1422)
!1425 = !DILocation(line: 376, column: 22, scope: !1422)
!1426 = !DILocation(line: 376, column: 30, scope: !1422)
!1427 = !DILocation(line: 377, column: 9, scope: !1422)
!1428 = !DILocation(line: 377, column: 13, scope: !1422)
!1429 = !DILocation(line: 377, column: 23, scope: !1422)
!1430 = !DILocation(line: 377, column: 30, scope: !1422)
!1431 = !DILocation(line: 377, column: 33, scope: !1432)
!1432 = !DILexicalBlockFile(scope: !1422, file: !326, discriminator: 1)
!1433 = !DILocation(line: 377, column: 37, scope: !1432)
!1434 = !DILocation(line: 377, column: 47, scope: !1432)
!1435 = !DILocation(line: 376, column: 8, scope: !1436)
!1436 = !DILexicalBlockFile(scope: !1423, file: !326, discriminator: 1)
!1437 = !DILocation(line: 378, column: 5, scope: !1422)
!1438 = distinct !{!1438, !1408}
!1439 = !DILocation(line: 382, column: 8, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1423, file: !326, line: 382, column: 8)
!1441 = !DILocation(line: 382, column: 20, scope: !1440)
!1442 = !DILocation(line: 382, column: 27, scope: !1440)
!1443 = !DILocation(line: 382, column: 30, scope: !1444)
!1444 = !DILexicalBlockFile(scope: !1440, file: !326, discriminator: 1)
!1445 = !DILocation(line: 382, column: 42, scope: !1444)
!1446 = !DILocation(line: 382, column: 8, scope: !1444)
!1447 = !DILocation(line: 383, column: 5, scope: !1440)
!1448 = !DILocation(line: 384, column: 3, scope: !1423)
!1449 = !DILocation(line: 386, column: 7, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1417, file: !326, line: 386, column: 7)
!1451 = !DILocation(line: 386, column: 11, scope: !1450)
!1452 = !DILocation(line: 386, column: 16, scope: !1450)
!1453 = !DILocation(line: 386, column: 27, scope: !1454)
!1454 = !DILexicalBlockFile(scope: !1450, file: !326, discriminator: 1)
!1455 = !DILocation(line: 386, column: 31, scope: !1454)
!1456 = !DILocation(line: 386, column: 39, scope: !1454)
!1457 = !DILocation(line: 386, column: 49, scope: !1454)
!1458 = !DILocation(line: 386, column: 19, scope: !1454)
!1459 = !DILocation(line: 386, column: 54, scope: !1454)
!1460 = !DILocation(line: 386, column: 7, scope: !1454)
!1461 = !DILocation(line: 387, column: 11, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1450, file: !326, line: 386, column: 60)
!1463 = !DILocation(line: 387, column: 15, scope: !1462)
!1464 = !DILocation(line: 387, column: 33, scope: !1465)
!1465 = !DILexicalBlockFile(scope: !1462, file: !326, discriminator: 1)
!1466 = !DILocation(line: 387, column: 37, scope: !1465)
!1467 = !DILocation(line: 387, column: 24, scope: !1465)
!1468 = !DILocation(line: 387, column: 11, scope: !1465)
!1469 = !DILocation(line: 388, column: 34, scope: !1462)
!1470 = !DILocation(line: 388, column: 39, scope: !1462)
!1471 = !DILocation(line: 388, column: 43, scope: !1462)
!1472 = !DILocation(line: 388, column: 5, scope: !1462)
!1473 = !DILocation(line: 387, column: 11, scope: !1474)
!1474 = !DILexicalBlockFile(scope: !1462, file: !326, discriminator: 2)
!1475 = !DILocation(line: 387, column: 11, scope: !1476)
!1476 = !DILexicalBlockFile(scope: !1462, file: !326, discriminator: 3)
!1477 = !DILocation(line: 387, column: 9, scope: !1476)
!1478 = !DILocation(line: 389, column: 25, scope: !1462)
!1479 = !DILocation(line: 389, column: 31, scope: !1462)
!1480 = !DILocation(line: 389, column: 37, scope: !1462)
!1481 = !DILocation(line: 389, column: 11, scope: !1462)
!1482 = !DILocation(line: 389, column: 9, scope: !1462)
!1483 = !DILocation(line: 390, column: 11, scope: !1462)
!1484 = !DILocation(line: 390, column: 4, scope: !1462)
!1485 = !DILocation(line: 391, column: 3, scope: !1462)
!1486 = !DILocation(line: 374, column: 2, scope: !1487)
!1487 = !DILexicalBlockFile(scope: !1204, file: !326, discriminator: 2)
!1488 = !DILocation(line: 393, column: 11, scope: !1204)
!1489 = !DILocation(line: 393, column: 2, scope: !1204)
!1490 = !DILocation(line: 394, column: 9, scope: !1204)
!1491 = !DILocation(line: 394, column: 2, scope: !1204)
!1492 = !DILocation(line: 396, column: 9, scope: !1204)
!1493 = !DILocation(line: 396, column: 2, scope: !1204)
!1494 = !DILocation(line: 397, column: 16, scope: !1204)
!1495 = !DILocation(line: 397, column: 9, scope: !1204)
!1496 = !DILocation(line: 398, column: 1, scope: !1204)
!1497 = distinct !DISubprogram(name: "list_add_file", scope: !326, file: !326, line: 297, type: !1498, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!401, !401, !301, !301}
!1500 = !DILocalVariable(name: "list", arg: 1, scope: !1497, file: !326, line: 297, type: !401)
!1501 = !DILocation(line: 297, column: 36, scope: !1497)
!1502 = !DILocalVariable(name: "name", arg: 2, scope: !1497, file: !326, line: 297, type: !301)
!1503 = !DILocation(line: 297, column: 54, scope: !1497)
!1504 = !DILocalVariable(name: "default_path", arg: 3, scope: !1497, file: !326, line: 297, type: !301)
!1505 = !DILocation(line: 297, column: 72, scope: !1497)
!1506 = !DILocalVariable(name: "statbuf", scope: !1497, file: !326, line: 299, type: !1507)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1508, line: 46, size: 1152, align: 64, elements: !1509)
!1508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/irssi/task1")
!1509 = !{!1510, !1512, !1513, !1515, !1517, !1519, !1521, !1522, !1523, !1524, !1526, !1528, !1534, !1535, !1536}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1507, file: !1508, line: 48, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !372, line: 124, baseType: !448)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1507, file: !1508, line: 53, baseType: !1225, size: 64, align: 64, offset: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1507, file: !1508, line: 61, baseType: !1514, size: 64, align: 64, offset: 128)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !372, line: 130, baseType: !448)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1507, file: !1508, line: 62, baseType: !1516, size: 32, align: 32, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !372, line: 129, baseType: !390)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1507, file: !1508, line: 64, baseType: !1518, size: 32, align: 32, offset: 224)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !372, line: 125, baseType: !390)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1507, file: !1508, line: 65, baseType: !1520, size: 32, align: 32, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !372, line: 126, baseType: !390)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1507, file: !1508, line: 67, baseType: !303, size: 32, align: 32, offset: 288)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1507, file: !1508, line: 69, baseType: !1511, size: 64, align: 64, offset: 320)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1507, file: !1508, line: 74, baseType: !1227, size: 64, align: 64, offset: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1507, file: !1508, line: 78, baseType: !1525, size: 64, align: 64, offset: 448)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !372, line: 153, baseType: !373)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1507, file: !1508, line: 80, baseType: !1527, size: 64, align: 64, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !372, line: 158, baseType: !373)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1507, file: !1508, line: 91, baseType: !1529, size: 128, align: 64, offset: 576)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !370, line: 120, size: 128, align: 64, elements: !1530)
!1530 = !{!1531, !1532}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1529, file: !370, line: 122, baseType: !371, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1529, file: !370, line: 123, baseType: !1533, size: 64, align: 64, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !372, line: 175, baseType: !373)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1507, file: !1508, line: 92, baseType: !1529, size: 128, align: 64, offset: 704)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1507, file: !1508, line: 93, baseType: !1529, size: 128, align: 64, offset: 832)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1507, file: !1508, line: 106, baseType: !1537, size: 192, align: 64, offset: 960)
!1537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1533, size: 192, align: 64, elements: !1538)
!1538 = !{!1539}
!1539 = !DISubrange(count: 3)
!1540 = !DILocation(line: 299, column: 14, scope: !1497)
!1541 = !DILocalVariable(name: "fname", scope: !1497, file: !326, line: 300, type: !311)
!1542 = !DILocation(line: 300, column: 8, scope: !1497)
!1543 = !DILocation(line: 302, column: 2, scope: !1497)
!1544 = distinct !{!1544, !1543}
!1545 = !DILocation(line: 302, column: 10, scope: !1546)
!1546 = !DILexicalBlockFile(scope: !1547, file: !326, discriminator: 1)
!1547 = distinct !DILexicalBlock(scope: !1548, file: !326, line: 302, column: 10)
!1548 = distinct !DILexicalBlock(scope: !1497, file: !326, line: 302, column: 4)
!1549 = !DILocation(line: 302, column: 15, scope: !1546)
!1550 = !DILocation(line: 302, column: 5, scope: !1551)
!1551 = !DILexicalBlockFile(scope: !1552, file: !326, discriminator: 2)
!1552 = distinct !DILexicalBlock(scope: !1547, file: !326, line: 302, column: 3)
!1553 = !DILocation(line: 302, column: 14, scope: !1554)
!1554 = !DILexicalBlockFile(scope: !1555, file: !326, discriminator: 3)
!1555 = distinct !DILexicalBlock(scope: !1547, file: !326, line: 302, column: 12)
!1556 = !DILocation(line: 302, column: 99, scope: !1554)
!1557 = !DILocation(line: 302, column: 7, scope: !1558)
!1558 = !DILexicalBlockFile(scope: !1548, file: !326, discriminator: 4)
!1559 = !DILocation(line: 304, column: 23, scope: !1497)
!1560 = !DILocation(line: 304, column: 10, scope: !1497)
!1561 = !DILocation(line: 304, column: 8, scope: !1497)
!1562 = !DILocation(line: 305, column: 28, scope: !1563)
!1563 = distinct !DILexicalBlock(scope: !1497, file: !326, line: 305, column: 6)
!1564 = !DILocation(line: 305, column: 9, scope: !1563)
!1565 = !DILocation(line: 305, column: 35, scope: !1563)
!1566 = !DILocation(line: 305, column: 40, scope: !1567)
!1567 = !DILexicalBlockFile(scope: !1563, file: !326, discriminator: 1)
!1568 = !DILocation(line: 305, column: 39, scope: !1567)
!1569 = !DILocation(line: 305, column: 50, scope: !1567)
!1570 = !DILocation(line: 305, column: 57, scope: !1567)
!1571 = !DILocation(line: 305, column: 62, scope: !1572)
!1572 = !DILexicalBlockFile(scope: !1563, file: !326, discriminator: 2)
!1573 = !DILocation(line: 305, column: 61, scope: !1572)
!1574 = !DILocation(line: 305, column: 72, scope: !1572)
!1575 = !DILocation(line: 305, column: 80, scope: !1572)
!1576 = !DILocation(line: 305, column: 84, scope: !1577)
!1577 = !DILexicalBlockFile(scope: !1563, file: !326, discriminator: 3)
!1578 = !DILocation(line: 305, column: 83, scope: !1577)
!1579 = !DILocation(line: 305, column: 94, scope: !1577)
!1580 = !DILocation(line: 305, column: 104, scope: !1577)
!1581 = !DILocation(line: 305, column: 107, scope: !1582)
!1582 = !DILexicalBlockFile(scope: !1563, file: !326, discriminator: 4)
!1583 = !DILocation(line: 305, column: 120, scope: !1582)
!1584 = !DILocation(line: 305, column: 6, scope: !1582)
!1585 = !DILocation(line: 306, column: 24, scope: !1586)
!1586 = distinct !DILexicalBlock(scope: !1563, file: !326, line: 305, column: 8)
!1587 = !DILocation(line: 306, column: 17, scope: !1586)
!1588 = !DILocation(line: 307, column: 23, scope: !1586)
!1589 = !DILocation(line: 308, column: 9, scope: !1586)
!1590 = !DILocation(line: 307, column: 11, scope: !1586)
!1591 = !DILocation(line: 307, column: 9, scope: !1586)
!1592 = !DILocation(line: 309, column: 2, scope: !1586)
!1593 = !DILocation(line: 310, column: 11, scope: !1594)
!1594 = distinct !DILexicalBlock(scope: !1497, file: !326, line: 310, column: 6)
!1595 = !DILocation(line: 310, column: 6, scope: !1594)
!1596 = !DILocation(line: 310, column: 28, scope: !1594)
!1597 = !DILocation(line: 310, column: 6, scope: !1497)
!1598 = !DILocation(line: 311, column: 24, scope: !1599)
!1599 = distinct !DILexicalBlock(scope: !1594, file: !326, line: 310, column: 34)
!1600 = !DILocation(line: 311, column: 38, scope: !1599)
!1601 = !DILocation(line: 311, column: 33, scope: !1599)
!1602 = !DILocation(line: 311, column: 44, scope: !1599)
!1603 = !DILocation(line: 311, column: 30, scope: !1599)
!1604 = !DILocation(line: 311, column: 66, scope: !1605)
!1605 = !DILexicalBlockFile(scope: !1599, file: !326, discriminator: 1)
!1606 = !DILocation(line: 311, column: 57, scope: !1605)
!1607 = !DILocation(line: 311, column: 30, scope: !1605)
!1608 = !DILocation(line: 312, column: 22, scope: !1599)
!1609 = !DILocation(line: 312, column: 10, scope: !1599)
!1610 = !DILocation(line: 311, column: 30, scope: !1611)
!1611 = !DILexicalBlockFile(scope: !1599, file: !326, discriminator: 2)
!1612 = !DILocation(line: 311, column: 30, scope: !1613)
!1613 = !DILexicalBlockFile(scope: !1599, file: !326, discriminator: 3)
!1614 = !DILocation(line: 311, column: 10, scope: !1613)
!1615 = !DILocation(line: 311, column: 8, scope: !1613)
!1616 = !DILocation(line: 313, column: 2, scope: !1599)
!1617 = !DILocation(line: 315, column: 16, scope: !1497)
!1618 = !DILocation(line: 315, column: 9, scope: !1497)
!1619 = !DILocation(line: 316, column: 9, scope: !1497)
!1620 = !DILocation(line: 316, column: 2, scope: !1497)
!1621 = !DILocation(line: 317, column: 1, scope: !1497)
!1622 = distinct !DISubprogram(name: "completion_init", scope: !326, file: !326, line: 893, type: !1179, isLocal: false, isDefinition: true, scopeLine: 894, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1623 = !DILocation(line: 895, column: 11, scope: !1622)
!1624 = !DILocation(line: 896, column: 12, scope: !1622)
!1625 = !DILocation(line: 896, column: 33, scope: !1622)
!1626 = !DILocation(line: 898, column: 2, scope: !1622)
!1627 = !DILocation(line: 900, column: 2, scope: !1622)
!1628 = !DILocation(line: 902, column: 2, scope: !1622)
!1629 = !DILocation(line: 903, column: 2, scope: !1622)
!1630 = !DILocation(line: 904, column: 2, scope: !1622)
!1631 = !DILocation(line: 905, column: 2, scope: !1622)
!1632 = !DILocation(line: 906, column: 2, scope: !1622)
!1633 = !DILocation(line: 907, column: 2, scope: !1622)
!1634 = !DILocation(line: 908, column: 2, scope: !1622)
!1635 = !DILocation(line: 909, column: 2, scope: !1622)
!1636 = !DILocation(line: 910, column: 2, scope: !1622)
!1637 = !DILocation(line: 911, column: 2, scope: !1622)
!1638 = !DILocation(line: 912, column: 2, scope: !1622)
!1639 = !DILocation(line: 914, column: 2, scope: !1622)
!1640 = !DILocation(line: 915, column: 1, scope: !1622)
!1641 = distinct !DISubprogram(name: "cmd_completion", scope: !326, file: !326, line: 820, type: !1642, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !421)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !301}
!1644 = !DILocalVariable(name: "data", arg: 1, scope: !1641, file: !326, line: 820, type: !301)
!1645 = !DILocation(line: 820, column: 40, scope: !1641)
!1646 = !DILocalVariable(name: "optlist", scope: !1641, file: !326, line: 822, type: !357)
!1647 = !DILocation(line: 822, column: 14, scope: !1641)
!1648 = !DILocalVariable(name: "node", scope: !1641, file: !326, line: 823, type: !690)
!1649 = !DILocation(line: 823, column: 15, scope: !1641)
!1650 = !DILocalVariable(name: "tmp", scope: !1641, file: !326, line: 824, type: !340)
!1651 = !DILocation(line: 824, column: 10, scope: !1641)
!1652 = !DILocalVariable(name: "key", scope: !1641, file: !326, line: 825, type: !311)
!1653 = !DILocation(line: 825, column: 8, scope: !1641)
!1654 = !DILocalVariable(name: "value", scope: !1641, file: !326, line: 825, type: !311)
!1655 = !DILocation(line: 825, column: 14, scope: !1641)
!1656 = !DILocalVariable(name: "free_arg", scope: !1641, file: !326, line: 826, type: !296)
!1657 = !DILocation(line: 826, column: 8, scope: !1641)
!1658 = !DILocalVariable(name: "len", scope: !1641, file: !326, line: 827, type: !303)
!1659 = !DILocation(line: 827, column: 6, scope: !1641)
!1660 = !DILocation(line: 829, column: 22, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1641, file: !326, line: 829, column: 6)
!1662 = !DILocation(line: 829, column: 7, scope: !1661)
!1663 = !DILocation(line: 829, column: 6, scope: !1641)
!1664 = !DILocation(line: 832, column: 3, scope: !1661)
!1665 = !DILocation(line: 834, column: 30, scope: !1641)
!1666 = !DILocation(line: 834, column: 58, scope: !1641)
!1667 = !DILocation(line: 834, column: 57, scope: !1641)
!1668 = !DILocation(line: 834, column: 64, scope: !1641)
!1669 = !DILocation(line: 834, column: 9, scope: !1641)
!1670 = !DILocation(line: 834, column: 7, scope: !1641)
!1671 = !DILocation(line: 835, column: 6, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1641, file: !326, line: 835, column: 6)
!1673 = !DILocation(line: 835, column: 11, scope: !1672)
!1674 = !DILocation(line: 835, column: 18, scope: !1672)
!1675 = !DILocation(line: 835, column: 21, scope: !1676)
!1676 = !DILexicalBlockFile(scope: !1672, file: !326, discriminator: 1)
!1677 = !DILocation(line: 835, column: 27, scope: !1676)
!1678 = !DILocation(line: 835, column: 32, scope: !1676)
!1679 = !DILocation(line: 835, column: 6, scope: !1676)
!1680 = !DILocation(line: 837, column: 22, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1672, file: !326, line: 835, column: 52)
!1682 = !DILocation(line: 837, column: 34, scope: !1681)
!1683 = !DILocation(line: 837, column: 46, scope: !1681)
!1684 = !DILocation(line: 837, column: 56, scope: !1681)
!1685 = !DILocation(line: 837, column: 3, scope: !1681)
!1686 = !DILocation(line: 838, column: 31, scope: !1681)
!1687 = !DILocation(line: 838, column: 59, scope: !1681)
!1688 = !DILocation(line: 838, column: 58, scope: !1681)
!1689 = !DILocation(line: 838, column: 65, scope: !1681)
!1690 = !DILocation(line: 838, column: 10, scope: !1681)
!1691 = !DILocation(line: 838, column: 8, scope: !1681)
!1692 = !DILocation(line: 839, column: 2, scope: !1681)
!1693 = !DILocation(line: 841, column: 6, scope: !1694)
!1694 = distinct !DILexicalBlock(scope: !1641, file: !326, line: 841, column: 6)
!1695 = !DILocation(line: 841, column: 11, scope: !1694)
