; ModuleID = './line232-fe-log.o.i'
source_filename = "./line232-fe-log.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct._GHashTable = type opaque
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!306 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!307 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!308 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!309 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!310 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!311 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!312 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !314, line: 25, size: 32, align: 32, elements: !315)
!314 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!316 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!317 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!318 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!319 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!320 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!321 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!322 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!323 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!324 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!325 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!326 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!327 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!328 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!329 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!330 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!331 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!332 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!333 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!334 = !{!335, !344, !345, !352, !355, !343, !357, !341}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!339, !343}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !340, line: 50, baseType: !341)
!340 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !340, line: 49, baseType: !342)
!342 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !340, line: 77, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !346, line: 9, baseType: !347)
!346 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350, !350, !350, !350, !350, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !340, line: 46, baseType: !354)
!354 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !340, line: 48, baseType: !358)
!358 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!359 = !{!360, !362, !363, !365, !366, !367, !369}
!360 = distinct !DIGlobalVariable(name: "autolog_level", scope: !0, file: !361, line: 47, type: !342, isLocal: true, isDefinition: true, variable: i32* @autolog_level)
!361 = !DIFile(filename: "fe-log.c", directory: "/home/lichi/Desktop/irssi/task1")
!362 = distinct !DIGlobalVariable(name: "autoremove_tag", scope: !0, file: !361, line: 48, type: !342, isLocal: true, isDefinition: true, variable: i32* @autoremove_tag)
!363 = distinct !DIGlobalVariable(name: "autolog_path", scope: !0, file: !361, line: 49, type: !364, isLocal: true, isDefinition: true, variable: i8** @autolog_path)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!365 = distinct !DIGlobalVariable(name: "skip_next_printtext", scope: !0, file: !361, line: 52, type: !342, isLocal: true, isDefinition: true, variable: i32* @skip_next_printtext)
!366 = distinct !DIGlobalVariable(name: "log_theme_name", scope: !0, file: !361, line: 53, type: !364, isLocal: true, isDefinition: true, variable: i8** @log_theme_name)
!367 = distinct !DIGlobalVariable(name: "autolog_ignore_targets", scope: !0, file: !361, line: 55, type: !368, isLocal: true, isDefinition: true, variable: i8*** @autolog_ignore_targets)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!369 = distinct !DIGlobalVariable(name: "log_theme", scope: !0, file: !361, line: 51, type: !370, isLocal: true, isDefinition: true, variable: %struct.THEME_REC** @log_theme)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "THEME_REC", file: !372, line: 33, baseType: !373)
!372 = !DIFile(filename: "themes.h", directory: "/home/lichi/Desktop/irssi/task1")
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 13, size: 8768, align: 64, elements: !374)
!374 = !{!375, !376, !377, !378, !383, !384, !386, !391, !395, !403, !404}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !373, file: !372, line: 14, baseType: !342, size: 32, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !373, file: !372, line: 16, baseType: !364, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !372, line: 17, baseType: !364, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "last_modify", scope: !373, file: !372, line: 18, baseType: !379, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !380, line: 75, baseType: !381)
!380 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !382, line: 139, baseType: !358)
!382 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "default_color", scope: !373, file: !372, line: 20, baseType: !342, size: 32, align: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "info_eol", scope: !373, file: !372, line: 23, baseType: !385, size: 1, align: 32, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!385 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !373, file: !372, line: 26, baseType: !387, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !389, line: 37, baseType: !390)
!389 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !389, line: 37, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "replace_keys", scope: !373, file: !372, line: 28, baseType: !392, size: 8192, align: 32, offset: 384)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 8192, align: 32, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "replace_values", scope: !373, file: !372, line: 29, baseType: !396, size: 64, align: 64, offset: 8576)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !398, line: 37, baseType: !399)
!398 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !398, line: 39, size: 128, align: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !399, file: !398, line: 41, baseType: !343, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !398, line: 42, baseType: !396, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "abstracts", scope: !373, file: !372, line: 30, baseType: !387, size: 64, align: 64, offset: 8640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !373, file: !372, line: 32, baseType: !344, size: 64, align: 64, offset: 8704)
!405 = !{i32 2, !"Dwarf Version", i32 4}
!406 = !{i32 2, !"Debug Info Version", i32 3}
!407 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!408 = distinct !DISubprogram(name: "fe_log_init", scope: !361, file: !361, line: 717, type: !409, isLocal: false, isDefinition: true, scopeLine: 718, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{null}
!411 = !{}
!412 = !DILocation(line: 719, column: 19, scope: !408)
!413 = !DILocation(line: 719, column: 17, scope: !408)
!414 = !DILocation(line: 720, column: 22, scope: !408)
!415 = !DILocation(line: 722, column: 2, scope: !408)
!416 = !DILocation(line: 723, column: 9, scope: !408)
!417 = !DILocation(line: 724, column: 2, scope: !408)
!418 = !DILocation(line: 725, column: 9, scope: !408)
!419 = !DILocation(line: 726, column: 2, scope: !408)
!420 = !DILocation(line: 727, column: 9, scope: !408)
!421 = !DILocation(line: 728, column: 2, scope: !408)
!422 = !DILocation(line: 730, column: 16, scope: !408)
!423 = !DILocation(line: 731, column: 17, scope: !408)
!424 = !DILocation(line: 732, column: 2, scope: !408)
!425 = !DILocation(line: 734, column: 2, scope: !408)
!426 = !DILocation(line: 735, column: 2, scope: !408)
!427 = !DILocation(line: 736, column: 2, scope: !408)
!428 = !DILocation(line: 737, column: 2, scope: !408)
!429 = !DILocation(line: 738, column: 2, scope: !408)
!430 = !DILocation(line: 739, column: 2, scope: !408)
!431 = !DILocation(line: 740, column: 2, scope: !408)
!432 = !DILocation(line: 741, column: 2, scope: !408)
!433 = !DILocation(line: 742, column: 2, scope: !408)
!434 = !DILocation(line: 743, column: 2, scope: !408)
!435 = !DILocation(line: 744, column: 2, scope: !408)
!436 = !DILocation(line: 745, column: 2, scope: !408)
!437 = !DILocation(line: 746, column: 2, scope: !408)
!438 = !DILocation(line: 747, column: 2, scope: !408)
!439 = !DILocation(line: 748, column: 2, scope: !408)
!440 = !DILocation(line: 749, column: 2, scope: !408)
!441 = !DILocation(line: 750, column: 2, scope: !408)
!442 = !DILocation(line: 751, column: 2, scope: !408)
!443 = !DILocation(line: 752, column: 2, scope: !408)
!444 = !DILocation(line: 754, column: 2, scope: !408)
!445 = !DILocation(line: 755, column: 1, scope: !408)
!446 = distinct !DISubprogram(name: "sig_autoremove", scope: !361, file: !361, line: 582, type: !447, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!447 = !DISubroutineType(types: !448)
!448 = !{!342}
!449 = !DILocalVariable(name: "server", scope: !446, file: !361, line: 584, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !452, line: 107, baseType: !453)
!452 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !454, line: 30, size: 2240, align: 64, elements: !455)
!454 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!455 = !{!456, !458, !459, !460, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !684, !685, !689, !690, !691, !695, !696, !697, !698, !699, !700, !701, !702, !703, !709, !710, !711, !712, !713, !717, !721, !725, !729, !733, !737, !744, !751, !755}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !457, line: 3, baseType: !342, size: 32, align: 32)
!457 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !453, file: !457, line: 4, baseType: !342, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !453, file: !457, line: 6, baseType: !342, size: 32, align: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !453, file: !457, line: 8, baseType: !461, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !452, line: 113, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !454, line: 25, size: 1920, align: 64, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !473, !474, !476, !477, !478, !479, !480, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !466, line: 3, baseType: !342, size: 32, align: 32)
!466 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !463, file: !466, line: 4, baseType: !342, size: 32, align: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !463, file: !466, line: 6, baseType: !342, size: 32, align: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !463, file: !466, line: 9, baseType: !364, size: 64, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !463, file: !466, line: 10, baseType: !342, size: 32, align: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !463, file: !466, line: 11, baseType: !364, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !463, file: !466, line: 11, baseType: !364, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !463, file: !466, line: 11, baseType: !364, size: 64, align: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !463, file: !466, line: 13, baseType: !475, size: 16, align: 16, offset: 448)
!475 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !463, file: !466, line: 14, baseType: !364, size: 64, align: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !463, file: !466, line: 15, baseType: !364, size: 64, align: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !463, file: !466, line: 16, baseType: !342, size: 32, align: 32, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !463, file: !466, line: 17, baseType: !364, size: 64, align: 64, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !463, file: !466, line: 19, baseType: !481, size: 64, align: 64, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !452, line: 99, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !452, line: 99, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !463, file: !466, line: 19, baseType: !481, size: 64, align: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !463, file: !466, line: 21, baseType: !364, size: 64, align: 64, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !463, file: !466, line: 22, baseType: !364, size: 64, align: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !463, file: !466, line: 23, baseType: !364, size: 64, align: 64, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !463, file: !466, line: 24, baseType: !364, size: 64, align: 64, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !463, file: !466, line: 26, baseType: !364, size: 64, align: 64, offset: 1152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !463, file: !466, line: 27, baseType: !364, size: 64, align: 64, offset: 1216)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !463, file: !466, line: 28, baseType: !364, size: 64, align: 64, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !463, file: !466, line: 29, baseType: !364, size: 64, align: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !463, file: !466, line: 30, baseType: !364, size: 64, align: 64, offset: 1408)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !463, file: !466, line: 31, baseType: !364, size: 64, align: 64, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !463, file: !466, line: 32, baseType: !364, size: 64, align: 64, offset: 1536)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !463, file: !466, line: 33, baseType: !364, size: 64, align: 64, offset: 1600)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !463, file: !466, line: 35, baseType: !498, size: 64, align: 64, offset: 1664)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !501)
!501 = !{!502, !503, !628, !629, !634, !635, !636, !637, !638, !647, !648, !649, !653, !654, !655, !656, !657, !658, !659, !660}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !500, file: !4, line: 100, baseType: !341, size: 32, align: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !500, file: !4, line: 101, baseType: !504, size: 64, align: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !507)
!507 = !{!508, !529, !535, !541, !545, !615, !619, !624}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !506, file: !4, line: 133, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !498, !352, !513, !516, !517}
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !514, line: 66, baseType: !515)
!514 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!515 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !520, line: 42, baseType: !521)
!520 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !520, line: 44, size: 128, align: 64, elements: !522)
!522 = !{!523, !527, !528}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !521, file: !520, line: 46, baseType: !524, size: 32, align: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !525, line: 36, baseType: !526)
!525 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !514, line: 45, baseType: !385)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !521, file: !520, line: 47, baseType: !341, size: 32, align: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !521, file: !520, line: 48, baseType: !352, size: 64, align: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !506, file: !4, line: 138, baseType: !530, size: 64, align: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!512, !498, !533, !513, !516, !517}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !506, file: !4, line: 143, baseType: !536, size: 64, align: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!512, !498, !539, !540, !517}
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !514, line: 51, baseType: !358)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !506, file: !4, line: 147, baseType: !542, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!512, !498, !517}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !506, file: !4, line: 149, baseType: !546, size: 64, align: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !498, !614}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !552)
!552 = !{!553, !554, !570, !597, !599, !603, !604, !605, !606, !607, !608, !609, !610}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !551, file: !16, line: 174, baseType: !343, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !551, file: !16, line: 175, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !558)
!558 = !{!559, !563, !564}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !557, file: !16, line: 198, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !343}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !557, file: !16, line: 199, baseType: !560, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !557, file: !16, line: 200, baseType: !565, size: 64, align: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !343, !549, !568, !569}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !551, file: !16, line: 177, baseType: !571, size: 64, align: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !575)
!575 = !{!576, !581, !585, !589, !593, !594}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !574, file: !16, line: 216, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!339, !549, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !574, file: !16, line: 218, baseType: !582, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!339, !549}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !574, file: !16, line: 219, baseType: !586, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!339, !549, !335, !343}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !574, file: !16, line: 222, baseType: !590, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !549}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !574, file: !16, line: 226, baseType: !335, size: 64, align: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !574, file: !16, line: 227, baseType: !595, size: 64, align: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !551, file: !16, line: 178, baseType: !598, size: 32, align: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !340, line: 55, baseType: !385)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !551, file: !16, line: 180, baseType: !600, size: 64, align: 64, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !551, file: !16, line: 182, baseType: !341, size: 32, align: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !551, file: !16, line: 183, baseType: !598, size: 32, align: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !551, file: !16, line: 184, baseType: !598, size: 32, align: 32, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !551, file: !16, line: 186, baseType: !396, size: 64, align: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !551, file: !16, line: 188, baseType: !549, size: 64, align: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !16, line: 189, baseType: !549, size: 64, align: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !16, line: 191, baseType: !364, size: 64, align: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !551, file: !16, line: 193, baseType: !611, size: 64, align: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !613)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !506, file: !4, line: 151, baseType: !616, size: 64, align: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !498}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !506, file: !4, line: 152, baseType: !620, size: 64, align: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!512, !498, !623, !517}
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !506, file: !4, line: 155, baseType: !625, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!623, !498}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !500, file: !4, line: 103, baseType: !352, size: 64, align: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !500, file: !4, line: 104, baseType: !630, size: 64, align: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !631, line: 77, baseType: !632)
!631 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !631, line: 77, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !500, file: !4, line: 105, baseType: !630, size: 64, align: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !500, file: !4, line: 106, baseType: !352, size: 64, align: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !500, file: !4, line: 107, baseType: !598, size: 32, align: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !500, file: !4, line: 109, baseType: !513, size: 64, align: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !500, file: !4, line: 110, baseType: !639, size: 64, align: 64, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !641, line: 39, baseType: !642)
!641 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !641, line: 41, size: 192, align: 64, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !642, file: !641, line: 43, baseType: !352, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !642, file: !641, line: 44, baseType: !513, size: 64, align: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !642, file: !641, line: 45, baseType: !513, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !500, file: !4, line: 111, baseType: !639, size: 64, align: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !500, file: !4, line: 112, baseType: !639, size: 64, align: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !500, file: !4, line: 113, baseType: !650, size: 48, align: 8, offset: 704)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 48, align: 8, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 6)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !500, file: !4, line: 117, baseType: !598, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !500, file: !4, line: 118, baseType: !598, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !500, file: !4, line: 119, baseType: !598, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !500, file: !4, line: 120, baseType: !598, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !500, file: !4, line: 121, baseType: !598, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !500, file: !4, line: 122, baseType: !598, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !500, file: !4, line: 124, baseType: !343, size: 64, align: 64, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !500, file: !4, line: 125, baseType: !343, size: 64, align: 64, offset: 832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !463, file: !466, line: 38, baseType: !385, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !463, file: !466, line: 39, baseType: !385, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !463, file: !466, line: 40, baseType: !385, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !463, file: !466, line: 41, baseType: !385, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !463, file: !466, line: 42, baseType: !385, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !463, file: !466, line: 43, baseType: !385, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !463, file: !466, line: 44, baseType: !385, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !463, file: !466, line: 45, baseType: !385, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !463, file: !466, line: 46, baseType: !364, size: 64, align: 64, offset: 1792)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !463, file: !466, line: 47, baseType: !364, size: 64, align: 64, offset: 1856)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !453, file: !457, line: 9, baseType: !379, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !453, file: !457, line: 10, baseType: !379, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !453, file: !457, line: 12, baseType: !364, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !453, file: !457, line: 13, baseType: !364, size: 64, align: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !453, file: !457, line: 15, baseType: !385, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !453, file: !457, line: 16, baseType: !385, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !453, file: !457, line: 17, baseType: !385, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !453, file: !457, line: 18, baseType: !385, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !453, file: !457, line: 19, baseType: !385, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !453, file: !457, line: 21, baseType: !681, size: 64, align: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !452, line: 102, baseType: !683)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !452, line: 102, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !453, file: !457, line: 22, baseType: !342, size: 32, align: 32, offset: 576)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !453, file: !457, line: 25, baseType: !686, size: 128, align: 64, offset: 640)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 128, align: 64, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 2)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !453, file: !457, line: 26, baseType: !342, size: 32, align: 32, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !453, file: !457, line: 27, baseType: !342, size: 32, align: 32, offset: 800)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !453, file: !457, line: 29, baseType: !692, size: 64, align: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !452, line: 103, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !452, line: 103, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !453, file: !457, line: 30, baseType: !387, size: 64, align: 64, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !453, file: !457, line: 32, baseType: !364, size: 64, align: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !453, file: !457, line: 33, baseType: !364, size: 64, align: 64, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !453, file: !457, line: 34, baseType: !364, size: 64, align: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !453, file: !457, line: 35, baseType: !385, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !453, file: !457, line: 36, baseType: !385, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !453, file: !457, line: 37, baseType: !385, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !453, file: !457, line: 38, baseType: !385, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !453, file: !457, line: 40, baseType: !704, size: 128, align: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !340, line: 504, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !340, line: 506, size: 128, align: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !705, file: !340, line: 508, baseType: !357, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !705, file: !340, line: 509, baseType: !357, size: 64, align: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !453, file: !457, line: 41, baseType: !379, size: 64, align: 64, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !453, file: !457, line: 42, baseType: !342, size: 32, align: 32, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !453, file: !457, line: 44, baseType: !396, size: 64, align: 64, offset: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !453, file: !457, line: 45, baseType: !396, size: 64, align: 64, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !453, file: !457, line: 53, baseType: !714, size: 64, align: 64, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !450, !355, !342}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !453, file: !457, line: 55, baseType: !718, size: 64, align: 64, offset: 1664)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!342, !450, !354}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !453, file: !457, line: 57, baseType: !722, size: 64, align: 64, offset: 1728)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!342, !450, !355}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !453, file: !457, line: 60, baseType: !726, size: 64, align: 64, offset: 1792)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!355, !450}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !453, file: !457, line: 62, baseType: !730, size: 64, align: 64, offset: 1856)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !450, !355, !355, !342}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !453, file: !457, line: 65, baseType: !734, size: 64, align: 64, offset: 1920)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!368, !450, !355, !355}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !453, file: !457, line: 69, baseType: !738, size: 64, align: 64, offset: 1984)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !450, !355}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !452, line: 109, baseType: !743)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !452, line: 109, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !453, file: !457, line: 70, baseType: !745, size: 64, align: 64, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !450, !355}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !452, line: 110, baseType: !750)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !452, line: 110, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !453, file: !457, line: 71, baseType: !752, size: 64, align: 64, offset: 2112)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!342, !355, !355}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !453, file: !457, line: 73, baseType: !752, size: 64, align: 64, offset: 2176)
!756 = !DIExpression()
!757 = !DILocation(line: 584, column: 14, scope: !446)
!758 = !DILocalVariable(name: "logitem", scope: !446, file: !361, line: 585, type: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "LOG_ITEM_REC", file: !36, line: 12, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LOG_ITEM_REC", file: !36, line: 14, size: 192, align: 64, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !36, line: 15, baseType: !342, size: 32, align: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !36, line: 16, baseType: !364, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !761, file: !36, line: 17, baseType: !364, size: 64, align: 64, offset: 128)
!766 = !DILocation(line: 585, column: 16, scope: !446)
!767 = !DILocalVariable(name: "tmp", scope: !446, file: !361, line: 586, type: !396)
!768 = !DILocation(line: 586, column: 10, scope: !446)
!769 = !DILocalVariable(name: "next", scope: !446, file: !361, line: 586, type: !396)
!770 = !DILocation(line: 586, column: 16, scope: !446)
!771 = !DILocalVariable(name: "removetime", scope: !446, file: !361, line: 587, type: !379)
!772 = !DILocation(line: 587, column: 9, scope: !446)
!773 = !DILocation(line: 589, column: 22, scope: !446)
!774 = !DILocation(line: 589, column: 31, scope: !446)
!775 = !DILocation(line: 589, column: 20, scope: !446)
!776 = !DILocation(line: 590, column: 13, scope: !777)
!777 = distinct !DILexicalBlock(scope: !446, file: !361, line: 590, column: 2)
!778 = !DILocation(line: 590, column: 11, scope: !777)
!779 = !DILocation(line: 590, column: 7, scope: !777)
!780 = !DILocation(line: 590, column: 19, scope: !781)
!781 = !DILexicalBlockFile(scope: !782, file: !361, discriminator: 1)
!782 = distinct !DILexicalBlock(scope: !777, file: !361, line: 590, column: 2)
!783 = !DILocation(line: 590, column: 23, scope: !781)
!784 = !DILocation(line: 590, column: 2, scope: !781)
!785 = !DILocalVariable(name: "log", scope: !786, file: !361, line: 591, type: !787)
!786 = distinct !DILexicalBlock(scope: !782, file: !361, line: 590, column: 43)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "LOG_REC", file: !36, line: 11, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LOG_REC", file: !36, line: 20, size: 576, align: 64, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !803, !804, !805}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !789, file: !36, line: 21, baseType: !364, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "real_fname", scope: !789, file: !36, line: 22, baseType: !364, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !789, file: !36, line: 23, baseType: !342, size: 32, align: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "opened", scope: !789, file: !36, line: 24, baseType: !379, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !789, file: !36, line: 26, baseType: !342, size: 32, align: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !789, file: !36, line: 27, baseType: !396, size: 64, align: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !789, file: !36, line: 29, baseType: !379, size: 64, align: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "colorizer", scope: !789, file: !36, line: 30, baseType: !799, size: 64, align: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLORIZE_FUNC", file: !36, line: 9, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!364, !355}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "autoopen", scope: !789, file: !36, line: 32, baseType: !385, size: 1, align: 32, offset: 512, flags: DIFlagBitField, extraData: i64 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !789, file: !36, line: 33, baseType: !385, size: 1, align: 32, offset: 513, flags: DIFlagBitField, extraData: i64 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !789, file: !36, line: 34, baseType: !385, size: 1, align: 32, offset: 514, flags: DIFlagBitField, extraData: i64 512)
!806 = !DILocation(line: 591, column: 12, scope: !786)
!807 = !DILocation(line: 591, column: 18, scope: !786)
!808 = !DILocation(line: 591, column: 23, scope: !786)
!809 = !DILocation(line: 593, column: 10, scope: !786)
!810 = !DILocation(line: 593, column: 15, scope: !786)
!811 = !DILocation(line: 593, column: 8, scope: !786)
!812 = !DILocation(line: 595, column: 8, scope: !813)
!813 = distinct !DILexicalBlock(scope: !786, file: !361, line: 595, column: 7)
!814 = !DILocation(line: 595, column: 13, scope: !813)
!815 = !DILocation(line: 595, column: 18, scope: !813)
!816 = !DILocation(line: 595, column: 21, scope: !817)
!817 = !DILexicalBlockFile(scope: !813, file: !361, discriminator: 1)
!818 = !DILocation(line: 595, column: 26, scope: !817)
!819 = !DILocation(line: 595, column: 33, scope: !817)
!820 = !DILocation(line: 595, column: 31, scope: !817)
!821 = !DILocation(line: 595, column: 44, scope: !817)
!822 = !DILocation(line: 595, column: 47, scope: !823)
!823 = !DILexicalBlockFile(scope: !813, file: !361, discriminator: 2)
!824 = !DILocation(line: 595, column: 52, scope: !823)
!825 = !DILocation(line: 595, column: 58, scope: !823)
!826 = !DILocation(line: 595, column: 7, scope: !823)
!827 = !DILocation(line: 596, column: 25, scope: !813)
!828 = !DILocation(line: 599, column: 13, scope: !786)
!829 = !DILocation(line: 599, column: 18, scope: !786)
!830 = !DILocation(line: 599, column: 25, scope: !786)
!831 = !DILocation(line: 599, column: 11, scope: !786)
!832 = !DILocation(line: 600, column: 7, scope: !833)
!833 = distinct !DILexicalBlock(scope: !786, file: !361, line: 600, column: 7)
!834 = !DILocation(line: 600, column: 16, scope: !833)
!835 = !DILocation(line: 600, column: 26, scope: !833)
!836 = !DILocation(line: 600, column: 7, scope: !786)
!837 = !DILocation(line: 601, column: 4, scope: !833)
!838 = !DILocation(line: 603, column: 28, scope: !786)
!839 = !DILocation(line: 603, column: 37, scope: !786)
!840 = !DILocation(line: 603, column: 12, scope: !786)
!841 = !DILocation(line: 603, column: 10, scope: !786)
!842 = !DILocation(line: 604, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !786, file: !361, line: 604, column: 7)
!844 = !DILocation(line: 604, column: 16, scope: !843)
!845 = !DILocation(line: 604, column: 21, scope: !843)
!846 = !DILocation(line: 604, column: 40, scope: !843)
!847 = !DILocation(line: 605, column: 7, scope: !843)
!848 = !DILocation(line: 605, column: 14, scope: !843)
!849 = !DILocation(line: 605, column: 21, scope: !843)
!850 = !DILocation(line: 605, column: 27, scope: !851)
!851 = !DILexicalBlockFile(scope: !843, file: !361, discriminator: 1)
!852 = !DILocation(line: 605, column: 36, scope: !851)
!853 = !DILocation(line: 605, column: 46, scope: !851)
!854 = !DILocation(line: 605, column: 54, scope: !851)
!855 = !DILocation(line: 605, column: 63, scope: !851)
!856 = !DILocation(line: 605, column: 26, scope: !851)
!857 = !DILocation(line: 604, column: 7, scope: !858)
!858 = !DILexicalBlockFile(scope: !786, file: !361, discriminator: 1)
!859 = !DILocation(line: 606, column: 14, scope: !843)
!860 = !DILocation(line: 606, column: 4, scope: !843)
!861 = !DILocation(line: 607, column: 2, scope: !786)
!862 = !DILocation(line: 590, column: 37, scope: !863)
!863 = !DILexicalBlockFile(scope: !782, file: !361, discriminator: 2)
!864 = !DILocation(line: 590, column: 35, scope: !863)
!865 = !DILocation(line: 590, column: 2, scope: !863)
!866 = distinct !{!866, !867}
!867 = !DILocation(line: 590, column: 2, scope: !446)
!868 = !DILocation(line: 608, column: 2, scope: !446)
!869 = distinct !DISubprogram(name: "read_settings", scope: !361, file: !361, line: 681, type: !409, isLocal: true, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!870 = !DILocalVariable(name: "old_autolog", scope: !869, file: !361, line: 683, type: !342)
!871 = !DILocation(line: 683, column: 6, scope: !869)
!872 = !DILocation(line: 683, column: 20, scope: !869)
!873 = !DILocation(line: 685, column: 9, scope: !869)
!874 = !DILocation(line: 685, column: 2, scope: !869)
!875 = !DILocation(line: 686, column: 26, scope: !869)
!876 = !DILocation(line: 686, column: 17, scope: !877)
!877 = !DILexicalBlockFile(scope: !869, file: !361, discriminator: 1)
!878 = !DILocation(line: 686, column: 15, scope: !869)
!879 = !DILocation(line: 688, column: 19, scope: !869)
!880 = !DILocation(line: 688, column: 18, scope: !869)
!881 = !DILocation(line: 688, column: 18, scope: !877)
!882 = !DILocation(line: 689, column: 3, scope: !869)
!883 = !DILocation(line: 688, column: 18, scope: !884)
!884 = !DILexicalBlockFile(scope: !869, file: !361, discriminator: 2)
!885 = !DILocation(line: 688, column: 18, scope: !886)
!886 = !DILexicalBlockFile(scope: !869, file: !361, discriminator: 3)
!887 = !DILocation(line: 688, column: 16, scope: !886)
!888 = !DILocation(line: 691, column: 6, scope: !889)
!889 = distinct !DILexicalBlock(scope: !869, file: !361, line: 691, column: 6)
!890 = !DILocation(line: 691, column: 18, scope: !889)
!891 = !DILocation(line: 691, column: 22, scope: !892)
!892 = !DILexicalBlockFile(scope: !889, file: !361, discriminator: 1)
!893 = !DILocation(line: 691, column: 6, scope: !892)
!894 = !DILocation(line: 692, column: 3, scope: !889)
!895 = !DILocation(line: 695, column: 6, scope: !896)
!896 = distinct !DILexicalBlock(scope: !869, file: !361, line: 695, column: 6)
!897 = !DILocation(line: 695, column: 21, scope: !896)
!898 = !DILocation(line: 695, column: 6, scope: !869)
!899 = !DILocation(line: 696, column: 3, scope: !896)
!900 = !DILocation(line: 698, column: 9, scope: !869)
!901 = !DILocation(line: 698, column: 2, scope: !869)
!902 = !DILocation(line: 699, column: 28, scope: !869)
!903 = !DILocation(line: 699, column: 19, scope: !877)
!904 = !DILocation(line: 699, column: 17, scope: !869)
!905 = !DILocation(line: 701, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !869, file: !361, line: 701, column: 6)
!907 = !DILocation(line: 701, column: 6, scope: !906)
!908 = !DILocation(line: 701, column: 22, scope: !906)
!909 = !DILocation(line: 701, column: 6, scope: !869)
!910 = !DILocation(line: 702, column: 10, scope: !911)
!911 = distinct !DILexicalBlock(scope: !906, file: !361, line: 701, column: 31)
!912 = !DILocation(line: 702, column: 3, scope: !911)
!913 = !DILocation(line: 703, column: 18, scope: !911)
!914 = !DILocation(line: 704, column: 2, scope: !911)
!915 = !DILocation(line: 706, column: 3, scope: !906)
!916 = !DILocation(line: 708, column: 14, scope: !869)
!917 = !DILocation(line: 708, column: 29, scope: !869)
!918 = !DILocation(line: 708, column: 14, scope: !877)
!919 = !DILocation(line: 709, column: 14, scope: !869)
!920 = !DILocation(line: 709, column: 3, scope: !869)
!921 = !DILocation(line: 708, column: 14, scope: !884)
!922 = !DILocation(line: 708, column: 14, scope: !886)
!923 = !DILocation(line: 708, column: 12, scope: !886)
!924 = !DILocation(line: 711, column: 6, scope: !925)
!925 = distinct !DILexicalBlock(scope: !869, file: !361, line: 711, column: 6)
!926 = !DILocation(line: 711, column: 29, scope: !925)
!927 = !DILocation(line: 711, column: 6, scope: !869)
!928 = !DILocation(line: 712, column: 14, scope: !925)
!929 = !DILocation(line: 712, column: 3, scope: !925)
!930 = !DILocation(line: 714, column: 38, scope: !869)
!931 = !DILocation(line: 714, column: 27, scope: !877)
!932 = !DILocation(line: 714, column: 25, scope: !869)
!933 = !DILocation(line: 715, column: 1, scope: !869)
!934 = distinct !DISubprogram(name: "cmd_log", scope: !361, file: !361, line: 244, type: !935, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !355, !450, !344}
!937 = !DILocalVariable(name: "data", arg: 1, scope: !934, file: !361, line: 244, type: !355)
!938 = !DILocation(line: 244, column: 33, scope: !934)
!939 = !DILocalVariable(name: "server", arg: 2, scope: !934, file: !361, line: 244, type: !450)
!940 = !DILocation(line: 244, column: 51, scope: !934)
!941 = !DILocalVariable(name: "item", arg: 3, scope: !934, file: !361, line: 244, type: !344)
!942 = !DILocation(line: 244, column: 65, scope: !934)
!943 = !DILocation(line: 246, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !934, file: !361, line: 246, column: 6)
!945 = !DILocation(line: 246, column: 6, scope: !944)
!946 = !DILocation(line: 246, column: 12, scope: !944)
!947 = !DILocation(line: 246, column: 6, scope: !934)
!948 = !DILocation(line: 247, column: 3, scope: !944)
!949 = !DILocation(line: 249, column: 25, scope: !944)
!950 = !DILocation(line: 249, column: 31, scope: !944)
!951 = !DILocation(line: 249, column: 39, scope: !944)
!952 = !DILocation(line: 249, column: 3, scope: !944)
!953 = !DILocation(line: 250, column: 1, scope: !934)
!954 = distinct !DISubprogram(name: "cmd_log_open", scope: !361, file: !361, line: 80, type: !955, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !355}
!957 = !DILocalVariable(name: "data", arg: 1, scope: !954, file: !361, line: 80, type: !355)
!958 = !DILocation(line: 80, column: 38, scope: !954)
!959 = !DILocalVariable(name: "server", scope: !954, file: !361, line: 82, type: !450)
!960 = !DILocation(line: 82, column: 21, scope: !954)
!961 = !DILocalVariable(name: "optlist", scope: !954, file: !361, line: 83, type: !387)
!962 = !DILocation(line: 83, column: 21, scope: !954)
!963 = !DILocalVariable(name: "targetarg", scope: !954, file: !361, line: 84, type: !364)
!964 = !DILocation(line: 84, column: 8, scope: !954)
!965 = !DILocalVariable(name: "fname", scope: !954, file: !361, line: 84, type: !364)
!966 = !DILocation(line: 84, column: 20, scope: !954)
!967 = !DILocalVariable(name: "levels", scope: !954, file: !361, line: 84, type: !364)
!968 = !DILocation(line: 84, column: 28, scope: !954)
!969 = !DILocalVariable(name: "servertag", scope: !954, file: !361, line: 84, type: !364)
!970 = !DILocation(line: 84, column: 37, scope: !954)
!971 = !DILocalVariable(name: "free_arg", scope: !954, file: !361, line: 85, type: !344)
!972 = !DILocation(line: 85, column: 8, scope: !954)
!973 = !DILocalVariable(name: "window", scope: !954, file: !361, line: 86, type: !974)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 96, align: 8, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 12)
!977 = !DILocation(line: 86, column: 7, scope: !954)
!978 = !DILocalVariable(name: "log", scope: !954, file: !361, line: 87, type: !787)
!979 = !DILocation(line: 87, column: 11, scope: !954)
!980 = !DILocalVariable(name: "level", scope: !954, file: !361, line: 88, type: !342)
!981 = !DILocation(line: 88, column: 6, scope: !954)
!982 = !DILocation(line: 90, column: 22, scope: !983)
!983 = distinct !DILexicalBlock(scope: !954, file: !361, line: 90, column: 6)
!984 = !DILocation(line: 90, column: 7, scope: !983)
!985 = !DILocation(line: 90, column: 6, scope: !954)
!986 = !DILocation(line: 94, column: 3, scope: !983)
!987 = !DILocation(line: 95, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !954, file: !361, line: 95, column: 6)
!989 = !DILocation(line: 95, column: 6, scope: !988)
!990 = !DILocation(line: 95, column: 13, scope: !988)
!991 = !DILocation(line: 95, column: 6, scope: !954)
!992 = !DILocation(line: 95, column: 22, scope: !993)
!993 = !DILexicalBlockFile(scope: !988, file: !361, discriminator: 1)
!994 = distinct !{!994, !995}
!995 = !DILocation(line: 95, column: 22, scope: !988)
!996 = !DILocation(line: 95, column: 43, scope: !997)
!997 = !DILexicalBlockFile(scope: !998, file: !361, discriminator: 2)
!998 = distinct !DILexicalBlock(scope: !988, file: !361, line: 95, column: 25)
!999 = !DILocation(line: 95, column: 27, scope: !997)
!1000 = !DILocation(line: 95, column: 54, scope: !997)
!1001 = distinct !{!1001, !1002}
!1002 = !DILocation(line: 95, column: 54, scope: !998)
!1003 = !DILocation(line: 95, column: 59, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !1005, file: !361, discriminator: 3)
!1005 = distinct !DILexicalBlock(scope: !998, file: !361, line: 95, column: 57)
!1006 = !DILocation(line: 95, column: 141, scope: !1007)
!1007 = !DILexicalBlockFile(scope: !1004, file: !361, discriminator: 6)
!1008 = !DILocation(line: 95, column: 156, scope: !1004)
!1009 = !DILocation(line: 95, column: 177, scope: !1010)
!1010 = !DILexicalBlockFile(scope: !998, file: !361, discriminator: 4)
!1011 = !DILocation(line: 95, column: 177, scope: !1012)
!1012 = !DILexicalBlockFile(scope: !998, file: !361, discriminator: 5)
!1013 = !DILocation(line: 97, column: 21, scope: !954)
!1014 = !DILocation(line: 97, column: 10, scope: !954)
!1015 = !DILocation(line: 97, column: 8, scope: !954)
!1016 = !DILocation(line: 98, column: 23, scope: !954)
!1017 = !DILocation(line: 98, column: 30, scope: !954)
!1018 = !DILocation(line: 98, column: 36, scope: !954)
!1019 = !DILocation(line: 98, column: 43, scope: !1020)
!1020 = !DILexicalBlockFile(scope: !954, file: !361, discriminator: 1)
!1021 = !DILocation(line: 98, column: 30, scope: !1020)
!1022 = !DILocation(line: 98, column: 30, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !954, file: !361, discriminator: 2)
!1024 = !DILocation(line: 98, column: 30, scope: !1025)
!1025 = !DILexicalBlockFile(scope: !954, file: !361, discriminator: 3)
!1026 = !DILocation(line: 98, column: 8, scope: !1025)
!1027 = !DILocation(line: 98, column: 6, scope: !1025)
!1028 = !DILocation(line: 101, column: 46, scope: !954)
!1029 = !DILocation(line: 101, column: 11, scope: !954)
!1030 = !DILocation(line: 101, column: 9, scope: !954)
!1031 = !DILocation(line: 102, column: 14, scope: !954)
!1032 = !DILocation(line: 102, column: 21, scope: !954)
!1033 = !DILocation(line: 102, column: 14, scope: !1020)
!1034 = !DILocation(line: 102, column: 37, scope: !1023)
!1035 = !DILocation(line: 102, column: 45, scope: !1023)
!1036 = !DILocation(line: 102, column: 14, scope: !1023)
!1037 = !DILocation(line: 102, column: 14, scope: !1025)
!1038 = !DILocation(line: 102, column: 12, scope: !1025)
!1039 = !DILocation(line: 104, column: 26, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !954, file: !361, line: 104, column: 6)
!1041 = !DILocation(line: 104, column: 6, scope: !1040)
!1042 = !DILocation(line: 104, column: 6, scope: !954)
!1043 = !DILocation(line: 106, column: 35, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !361, line: 104, column: 46)
!1045 = !DILocation(line: 106, column: 15, scope: !1044)
!1046 = !DILocation(line: 106, column: 13, scope: !1044)
!1047 = !DILocation(line: 107, column: 7, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !361, line: 107, column: 7)
!1049 = !DILocation(line: 107, column: 17, scope: !1048)
!1050 = !DILocation(line: 107, column: 24, scope: !1048)
!1051 = !DILocation(line: 107, column: 39, scope: !1052)
!1052 = !DILexicalBlockFile(scope: !1048, file: !361, discriminator: 1)
!1053 = !DILocation(line: 107, column: 28, scope: !1052)
!1054 = !DILocation(line: 107, column: 7, scope: !1052)
!1055 = !DILocation(line: 108, column: 15, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1048, file: !361, line: 107, column: 57)
!1057 = !DILocation(line: 108, column: 45, scope: !1056)
!1058 = !DILocation(line: 108, column: 57, scope: !1056)
!1059 = !DILocation(line: 108, column: 4, scope: !1056)
!1060 = !DILocation(line: 109, column: 16, scope: !1056)
!1061 = !DILocation(line: 109, column: 14, scope: !1056)
!1062 = !DILocation(line: 110, column: 3, scope: !1056)
!1063 = !DILocation(line: 111, column: 16, scope: !1044)
!1064 = !DILocation(line: 111, column: 45, scope: !1044)
!1065 = !DILocation(line: 112, column: 9, scope: !1044)
!1066 = !DILocation(line: 111, column: 3, scope: !1044)
!1067 = !DILocation(line: 113, column: 2, scope: !1044)
!1068 = !DILocation(line: 114, column: 35, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1040, file: !361, line: 113, column: 9)
!1070 = !DILocation(line: 114, column: 15, scope: !1069)
!1071 = !DILocation(line: 114, column: 13, scope: !1069)
!1072 = !DILocation(line: 115, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !361, line: 115, column: 7)
!1074 = !DILocation(line: 115, column: 17, scope: !1073)
!1075 = !DILocation(line: 115, column: 24, scope: !1073)
!1076 = !DILocation(line: 115, column: 28, scope: !1077)
!1077 = !DILexicalBlockFile(scope: !1073, file: !361, discriminator: 1)
!1078 = !DILocation(line: 115, column: 27, scope: !1077)
!1079 = !DILocation(line: 115, column: 38, scope: !1077)
!1080 = !DILocation(line: 115, column: 7, scope: !1077)
!1081 = !DILocation(line: 116, column: 20, scope: !1073)
!1082 = !DILocation(line: 116, column: 25, scope: !1073)
!1083 = !DILocation(line: 116, column: 36, scope: !1073)
!1084 = !DILocation(line: 116, column: 4, scope: !1073)
!1085 = !DILocation(line: 117, column: 12, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1073, file: !361, line: 117, column: 12)
!1087 = !DILocation(line: 117, column: 22, scope: !1086)
!1088 = !DILocation(line: 117, column: 12, scope: !1073)
!1089 = !DILocation(line: 118, column: 20, scope: !1086)
!1090 = !DILocation(line: 118, column: 30, scope: !1086)
!1091 = !DILocation(line: 118, column: 4, scope: !1086)
!1092 = !DILocation(line: 121, column: 26, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !954, file: !361, line: 121, column: 6)
!1094 = !DILocation(line: 121, column: 6, scope: !1093)
!1095 = !DILocation(line: 121, column: 6, scope: !954)
!1096 = !DILocation(line: 122, column: 3, scope: !1093)
!1097 = !DILocation(line: 122, column: 8, scope: !1093)
!1098 = !DILocation(line: 122, column: 17, scope: !1093)
!1099 = !DILocation(line: 124, column: 26, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !954, file: !361, line: 124, column: 6)
!1101 = !DILocation(line: 124, column: 6, scope: !1100)
!1102 = !DILocation(line: 124, column: 45, scope: !1100)
!1103 = !DILocation(line: 124, column: 6, scope: !954)
!1104 = !DILocation(line: 125, column: 3, scope: !1100)
!1105 = !DILocation(line: 125, column: 8, scope: !1100)
!1106 = !DILocation(line: 125, column: 18, scope: !1100)
!1107 = !DILocation(line: 127, column: 13, scope: !954)
!1108 = !DILocation(line: 127, column: 2, scope: !954)
!1109 = !DILocation(line: 129, column: 6, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !954, file: !361, line: 129, column: 6)
!1111 = !DILocation(line: 129, column: 11, scope: !1110)
!1112 = !DILocation(line: 129, column: 18, scope: !1110)
!1113 = !DILocation(line: 129, column: 24, scope: !1110)
!1114 = !DILocation(line: 129, column: 47, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1110, file: !361, discriminator: 1)
!1116 = !DILocation(line: 129, column: 27, scope: !1115)
!1117 = !DILocation(line: 129, column: 66, scope: !1115)
!1118 = !DILocation(line: 129, column: 6, scope: !1115)
!1119 = !DILocation(line: 131, column: 25, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !361, line: 131, column: 7)
!1121 = distinct !DILexicalBlock(scope: !1110, file: !361, line: 129, column: 74)
!1122 = !DILocation(line: 131, column: 7, scope: !1120)
!1123 = !DILocation(line: 131, column: 7, scope: !1121)
!1124 = !DILocation(line: 132, column: 44, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1120, file: !361, line: 131, column: 31)
!1126 = !DILocation(line: 132, column: 4, scope: !1125)
!1127 = !DILocation(line: 134, column: 3, scope: !1125)
!1128 = !DILocation(line: 135, column: 14, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1120, file: !361, line: 134, column: 10)
!1130 = !DILocation(line: 135, column: 4, scope: !1129)
!1131 = !DILocation(line: 137, column: 2, scope: !1121)
!1132 = !DILocation(line: 139, column: 25, scope: !954)
!1133 = !DILocation(line: 139, column: 9, scope: !954)
!1134 = !DILocation(line: 140, column: 1, scope: !954)
!1135 = !DILocation(line: 140, column: 1, scope: !1020)
!1136 = distinct !DISubprogram(name: "cmd_log_close", scope: !361, file: !361, line: 155, type: !955, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1137 = !DILocalVariable(name: "data", arg: 1, scope: !1136, file: !361, line: 155, type: !355)
!1138 = !DILocation(line: 155, column: 39, scope: !1136)
!1139 = !DILocalVariable(name: "log", scope: !1136, file: !361, line: 157, type: !787)
!1140 = !DILocation(line: 157, column: 11, scope: !1136)
!1141 = !DILocation(line: 159, column: 27, scope: !1136)
!1142 = !DILocation(line: 159, column: 8, scope: !1136)
!1143 = !DILocation(line: 159, column: 6, scope: !1136)
!1144 = !DILocation(line: 160, column: 6, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1136, file: !361, line: 160, column: 6)
!1146 = !DILocation(line: 160, column: 10, scope: !1145)
!1147 = !DILocation(line: 160, column: 6, scope: !1136)
!1148 = !DILocation(line: 161, column: 44, scope: !1145)
!1149 = !DILocation(line: 161, column: 3, scope: !1145)
!1150 = !DILocation(line: 163, column: 13, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1145, file: !361, line: 162, column: 7)
!1152 = !DILocation(line: 163, column: 3, scope: !1151)
!1153 = !DILocation(line: 164, column: 43, scope: !1151)
!1154 = !DILocation(line: 164, column: 3, scope: !1151)
!1155 = !DILocation(line: 166, column: 1, scope: !1136)
!1156 = distinct !DISubprogram(name: "cmd_log_start", scope: !361, file: !361, line: 169, type: !955, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1157 = !DILocalVariable(name: "data", arg: 1, scope: !1156, file: !361, line: 169, type: !355)
!1158 = !DILocation(line: 169, column: 39, scope: !1156)
!1159 = !DILocalVariable(name: "log", scope: !1156, file: !361, line: 171, type: !787)
!1160 = !DILocation(line: 171, column: 11, scope: !1156)
!1161 = !DILocation(line: 173, column: 27, scope: !1156)
!1162 = !DILocation(line: 173, column: 8, scope: !1156)
!1163 = !DILocation(line: 173, column: 6, scope: !1156)
!1164 = !DILocation(line: 174, column: 6, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1156, file: !361, line: 174, column: 6)
!1166 = !DILocation(line: 174, column: 10, scope: !1165)
!1167 = !DILocation(line: 174, column: 6, scope: !1156)
!1168 = !DILocation(line: 175, column: 21, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !361, line: 174, column: 18)
!1170 = !DILocation(line: 175, column: 3, scope: !1169)
!1171 = !DILocation(line: 176, column: 43, scope: !1169)
!1172 = !DILocation(line: 176, column: 3, scope: !1169)
!1173 = !DILocation(line: 177, column: 2, scope: !1169)
!1174 = !DILocation(line: 178, column: 1, scope: !1156)
!1175 = distinct !DISubprogram(name: "cmd_log_stop", scope: !361, file: !361, line: 181, type: !955, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1176 = !DILocalVariable(name: "data", arg: 1, scope: !1175, file: !361, line: 181, type: !355)
!1177 = !DILocation(line: 181, column: 38, scope: !1175)
!1178 = !DILocalVariable(name: "log", scope: !1175, file: !361, line: 183, type: !787)
!1179 = !DILocation(line: 183, column: 11, scope: !1175)
!1180 = !DILocation(line: 185, column: 27, scope: !1175)
!1181 = !DILocation(line: 185, column: 8, scope: !1175)
!1182 = !DILocation(line: 185, column: 6, scope: !1175)
!1183 = !DILocation(line: 186, column: 6, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1175, file: !361, line: 186, column: 6)
!1185 = !DILocation(line: 186, column: 10, scope: !1184)
!1186 = !DILocation(line: 186, column: 17, scope: !1184)
!1187 = !DILocation(line: 186, column: 20, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1184, file: !361, discriminator: 1)
!1189 = !DILocation(line: 186, column: 25, scope: !1188)
!1190 = !DILocation(line: 186, column: 32, scope: !1188)
!1191 = !DILocation(line: 186, column: 6, scope: !1188)
!1192 = !DILocation(line: 187, column: 44, scope: !1184)
!1193 = !DILocation(line: 187, column: 3, scope: !1184)
!1194 = !DILocation(line: 189, column: 20, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1184, file: !361, line: 188, column: 7)
!1196 = !DILocation(line: 189, column: 3, scope: !1195)
!1197 = !DILocation(line: 190, column: 43, scope: !1195)
!1198 = !DILocation(line: 190, column: 3, scope: !1195)
!1199 = !DILocation(line: 192, column: 1, scope: !1175)
!1200 = distinct !DISubprogram(name: "cmd_window_log", scope: !361, file: !361, line: 273, type: !955, isLocal: true, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1201 = !DILocalVariable(name: "data", arg: 1, scope: !1200, file: !361, line: 273, type: !355)
!1202 = !DILocation(line: 273, column: 40, scope: !1200)
!1203 = !DILocalVariable(name: "log", scope: !1200, file: !361, line: 275, type: !787)
!1204 = !DILocation(line: 275, column: 11, scope: !1200)
!1205 = !DILocalVariable(name: "set", scope: !1200, file: !361, line: 276, type: !364)
!1206 = !DILocation(line: 276, column: 8, scope: !1200)
!1207 = !DILocalVariable(name: "fname", scope: !1200, file: !361, line: 276, type: !364)
!1208 = !DILocation(line: 276, column: 14, scope: !1200)
!1209 = !DILocalVariable(name: "window", scope: !1200, file: !361, line: 276, type: !974)
!1210 = !DILocation(line: 276, column: 21, scope: !1200)
!1211 = !DILocalVariable(name: "free_arg", scope: !1200, file: !361, line: 277, type: !344)
!1212 = !DILocation(line: 277, column: 8, scope: !1200)
!1213 = !DILocalVariable(name: "open_log", scope: !1200, file: !361, line: 278, type: !342)
!1214 = !DILocation(line: 278, column: 6, scope: !1200)
!1215 = !DILocalVariable(name: "close_log", scope: !1200, file: !361, line: 278, type: !342)
!1216 = !DILocation(line: 278, column: 16, scope: !1200)
!1217 = !DILocation(line: 280, column: 22, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1200, file: !361, line: 280, column: 6)
!1219 = !DILocation(line: 280, column: 7, scope: !1218)
!1220 = !DILocation(line: 280, column: 6, scope: !1200)
!1221 = !DILocation(line: 281, column: 3, scope: !1218)
!1222 = !DILocation(line: 283, column: 20, scope: !1200)
!1223 = !DILocation(line: 283, column: 50, scope: !1200)
!1224 = !DILocation(line: 283, column: 62, scope: !1200)
!1225 = !DILocation(line: 283, column: 9, scope: !1200)
!1226 = !DILocation(line: 284, column: 47, scope: !1200)
!1227 = !DILocation(line: 284, column: 8, scope: !1200)
!1228 = !DILocation(line: 284, column: 6, scope: !1200)
!1229 = !DILocation(line: 286, column: 30, scope: !1200)
!1230 = !DILocation(line: 286, column: 18, scope: !1200)
!1231 = !DILocation(line: 287, column: 25, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1200, file: !361, line: 287, column: 6)
!1233 = !DILocation(line: 287, column: 6, scope: !1232)
!1234 = !DILocation(line: 287, column: 36, scope: !1232)
!1235 = !DILocation(line: 287, column: 6, scope: !1200)
!1236 = !DILocation(line: 288, column: 12, scope: !1232)
!1237 = !DILocation(line: 288, column: 3, scope: !1232)
!1238 = !DILocation(line: 289, column: 30, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1232, file: !361, line: 289, column: 11)
!1240 = !DILocation(line: 289, column: 11, scope: !1239)
!1241 = !DILocation(line: 289, column: 42, scope: !1239)
!1242 = !DILocation(line: 289, column: 11, scope: !1232)
!1243 = !DILocation(line: 290, column: 13, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1239, file: !361, line: 289, column: 48)
!1245 = !DILocation(line: 291, column: 2, scope: !1244)
!1246 = !DILocation(line: 291, column: 32, scope: !1247)
!1247 = !DILexicalBlockFile(scope: !1248, file: !361, discriminator: 1)
!1248 = distinct !DILexicalBlock(scope: !1239, file: !361, line: 291, column: 13)
!1249 = !DILocation(line: 291, column: 13, scope: !1247)
!1250 = !DILocation(line: 291, column: 47, scope: !1247)
!1251 = !DILocation(line: 292, column: 28, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1248, file: !361, line: 291, column: 53)
!1253 = !DILocation(line: 292, column: 32, scope: !1252)
!1254 = !DILocation(line: 292, column: 26, scope: !1252)
!1255 = !DILocation(line: 293, column: 29, scope: !1252)
!1256 = !DILocation(line: 293, column: 33, scope: !1252)
!1257 = !DILocation(line: 293, column: 27, scope: !1252)
!1258 = !DILocation(line: 294, column: 2, scope: !1252)
!1259 = !DILocation(line: 295, column: 3, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1248, file: !361, line: 294, column: 9)
!1261 = !DILocation(line: 296, column: 19, scope: !1260)
!1262 = !DILocation(line: 296, column: 3, scope: !1260)
!1263 = !DILocation(line: 297, column: 3, scope: !1260)
!1264 = !DILocation(line: 300, column: 6, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1200, file: !361, line: 300, column: 6)
!1266 = !DILocation(line: 300, column: 15, scope: !1265)
!1267 = !DILocation(line: 300, column: 18, scope: !1268)
!1268 = !DILexicalBlockFile(scope: !1265, file: !361, discriminator: 1)
!1269 = !DILocation(line: 300, column: 22, scope: !1268)
!1270 = !DILocation(line: 300, column: 6, scope: !1268)
!1271 = !DILocation(line: 302, column: 12, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1265, file: !361, line: 300, column: 30)
!1273 = !DILocation(line: 302, column: 11, scope: !1272)
!1274 = !DILocation(line: 302, column: 18, scope: !1272)
!1275 = !DILocation(line: 302, column: 37, scope: !1276)
!1276 = !DILexicalBlockFile(scope: !1272, file: !361, discriminator: 1)
!1277 = !DILocation(line: 302, column: 28, scope: !1276)
!1278 = !DILocation(line: 302, column: 11, scope: !1276)
!1279 = !DILocation(line: 304, column: 6, scope: !1272)
!1280 = !DILocation(line: 304, column: 18, scope: !1272)
!1281 = !DILocation(line: 304, column: 23, scope: !1272)
!1282 = !DILocation(line: 304, column: 32, scope: !1276)
!1283 = !DILocation(line: 304, column: 44, scope: !1276)
!1284 = !DILocation(line: 304, column: 6, scope: !1276)
!1285 = !DILocation(line: 304, column: 6, scope: !1286)
!1286 = !DILexicalBlockFile(scope: !1272, file: !361, discriminator: 2)
!1287 = !DILocation(line: 304, column: 6, scope: !1288)
!1288 = !DILexicalBlockFile(scope: !1272, file: !361, discriminator: 3)
!1289 = !DILocation(line: 305, column: 6, scope: !1272)
!1290 = !DILocation(line: 305, column: 18, scope: !1272)
!1291 = !DILocation(line: 305, column: 23, scope: !1272)
!1292 = !DILocation(line: 305, column: 6, scope: !1276)
!1293 = !DILocation(line: 305, column: 37, scope: !1286)
!1294 = !DILocation(line: 305, column: 6, scope: !1286)
!1295 = !DILocation(line: 305, column: 6, scope: !1288)
!1296 = !DILocation(line: 303, column: 4, scope: !1272)
!1297 = !DILocation(line: 302, column: 11, scope: !1286)
!1298 = !DILocation(line: 302, column: 11, scope: !1288)
!1299 = !DILocation(line: 302, column: 9, scope: !1288)
!1300 = !DILocation(line: 306, column: 24, scope: !1272)
!1301 = !DILocation(line: 306, column: 9, scope: !1272)
!1302 = !DILocation(line: 306, column: 7, scope: !1272)
!1303 = !DILocation(line: 307, column: 3, scope: !1272)
!1304 = !DILocation(line: 307, column: 8, scope: !1272)
!1305 = !DILocation(line: 307, column: 18, scope: !1272)
!1306 = !DILocation(line: 308, column: 30, scope: !1272)
!1307 = !DILocation(line: 308, column: 59, scope: !1272)
!1308 = !DILocation(line: 308, column: 17, scope: !1272)
!1309 = !DILocation(line: 309, column: 14, scope: !1272)
!1310 = !DILocation(line: 309, column: 3, scope: !1272)
!1311 = !DILocation(line: 310, column: 10, scope: !1272)
!1312 = !DILocation(line: 310, column: 3, scope: !1272)
!1313 = !DILocation(line: 311, column: 2, scope: !1272)
!1314 = !DILocation(line: 313, column: 6, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1200, file: !361, line: 313, column: 6)
!1316 = !DILocation(line: 313, column: 15, scope: !1315)
!1317 = !DILocation(line: 313, column: 18, scope: !1318)
!1318 = !DILexicalBlockFile(scope: !1315, file: !361, discriminator: 1)
!1319 = !DILocation(line: 313, column: 22, scope: !1318)
!1320 = !DILocation(line: 313, column: 6, scope: !1318)
!1321 = !DILocation(line: 314, column: 21, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1315, file: !361, line: 313, column: 30)
!1323 = !DILocation(line: 314, column: 3, scope: !1322)
!1324 = !DILocation(line: 315, column: 43, scope: !1322)
!1325 = !DILocation(line: 315, column: 48, scope: !1322)
!1326 = !DILocation(line: 315, column: 3, scope: !1322)
!1327 = !DILocation(line: 316, column: 2, scope: !1322)
!1328 = !DILocation(line: 316, column: 13, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1330, file: !361, discriminator: 1)
!1330 = distinct !DILexicalBlock(scope: !1315, file: !361, line: 316, column: 13)
!1331 = !DILocation(line: 316, column: 23, scope: !1329)
!1332 = !DILocation(line: 316, column: 26, scope: !1333)
!1333 = !DILexicalBlockFile(scope: !1330, file: !361, discriminator: 2)
!1334 = !DILocation(line: 316, column: 30, scope: !1333)
!1335 = !DILocation(line: 316, column: 37, scope: !1333)
!1336 = !DILocation(line: 316, column: 40, scope: !1337)
!1337 = !DILexicalBlockFile(scope: !1330, file: !361, discriminator: 3)
!1338 = !DILocation(line: 316, column: 45, scope: !1337)
!1339 = !DILocation(line: 316, column: 52, scope: !1337)
!1340 = !DILocation(line: 316, column: 13, scope: !1337)
!1341 = !DILocation(line: 317, column: 20, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1330, file: !361, line: 316, column: 59)
!1343 = !DILocation(line: 317, column: 3, scope: !1342)
!1344 = !DILocation(line: 318, column: 43, scope: !1342)
!1345 = !DILocation(line: 318, column: 48, scope: !1342)
!1346 = !DILocation(line: 318, column: 3, scope: !1342)
!1347 = !DILocation(line: 319, column: 2, scope: !1342)
!1348 = !DILocation(line: 321, column: 25, scope: !1200)
!1349 = !DILocation(line: 321, column: 9, scope: !1200)
!1350 = !DILocation(line: 322, column: 1, scope: !1200)
!1351 = !DILocation(line: 322, column: 1, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1200, file: !361, discriminator: 1)
!1353 = distinct !DISubprogram(name: "cmd_window_logfile", scope: !361, file: !361, line: 326, type: !955, isLocal: true, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1354 = !DILocalVariable(name: "data", arg: 1, scope: !1353, file: !361, line: 326, type: !355)
!1355 = !DILocation(line: 326, column: 44, scope: !1353)
!1356 = !DILocalVariable(name: "log", scope: !1353, file: !361, line: 328, type: !787)
!1357 = !DILocation(line: 328, column: 11, scope: !1353)
!1358 = !DILocalVariable(name: "window", scope: !1353, file: !361, line: 329, type: !974)
!1359 = !DILocation(line: 329, column: 7, scope: !1353)
!1360 = !DILocation(line: 331, column: 20, scope: !1353)
!1361 = !DILocation(line: 331, column: 50, scope: !1353)
!1362 = !DILocation(line: 331, column: 62, scope: !1353)
!1363 = !DILocation(line: 331, column: 9, scope: !1353)
!1364 = !DILocation(line: 332, column: 47, scope: !1353)
!1365 = !DILocation(line: 332, column: 8, scope: !1353)
!1366 = !DILocation(line: 332, column: 6, scope: !1353)
!1367 = !DILocation(line: 334, column: 6, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1353, file: !361, line: 334, column: 6)
!1369 = !DILocation(line: 334, column: 10, scope: !1368)
!1370 = !DILocation(line: 334, column: 6, scope: !1353)
!1371 = !DILocation(line: 335, column: 3, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1368, file: !361, line: 334, column: 18)
!1373 = !DILocation(line: 336, column: 3, scope: !1372)
!1374 = !DILocation(line: 339, column: 23, scope: !1353)
!1375 = !DILocation(line: 339, column: 8, scope: !1353)
!1376 = !DILocation(line: 339, column: 6, scope: !1353)
!1377 = !DILocation(line: 340, column: 2, scope: !1353)
!1378 = !DILocation(line: 340, column: 7, scope: !1353)
!1379 = !DILocation(line: 340, column: 17, scope: !1353)
!1380 = !DILocation(line: 341, column: 15, scope: !1353)
!1381 = !DILocation(line: 341, column: 44, scope: !1353)
!1382 = !DILocation(line: 341, column: 2, scope: !1353)
!1383 = !DILocation(line: 342, column: 13, scope: !1353)
!1384 = !DILocation(line: 342, column: 2, scope: !1353)
!1385 = !DILocation(line: 344, column: 46, scope: !1353)
!1386 = !DILocation(line: 344, column: 2, scope: !1353)
!1387 = !DILocation(line: 345, column: 1, scope: !1353)
!1388 = !DILocation(line: 345, column: 1, scope: !1389)
!1389 = !DILexicalBlockFile(scope: !1353, file: !361, discriminator: 1)
!1390 = distinct !DISubprogram(name: "sig_printtext", scope: !361, file: !361, line: 537, type: !1391, isLocal: true, isDefinition: true, scopeLine: 539, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !411)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{null, !1393, !355, !355}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXT_DEST_REC", file: !1395, line: 62, baseType: !1396)
!1395 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TEXT_DEST_REC", file: !1395, line: 50, size: 576, align: 64, elements: !1397)
!1397 = !{!1398, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1396, file: !1395, line: 51, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !452, line: 117, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !1402, line: 28, size: 1280, align: 64, elements: !1403)
!1402 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!1403 = !{!1404, !1405, !1406, !1407, !1408, !1409, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !1401, file: !1402, line: 29, baseType: !342, size: 32, align: 32)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1401, file: !1402, line: 30, baseType: !364, size: 64, align: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1401, file: !1402, line: 32, baseType: !342, size: 32, align: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1401, file: !1402, line: 32, baseType: !342, size: 32, align: 32, offset: 160)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !1401, file: !1402, line: 34, baseType: !396, size: 64, align: 64, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1401, file: !1402, line: 35, baseType: !1410, size: 64, align: 64, offset: 256)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !452, line: 108, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !1413, line: 5, size: 704, align: 64, elements: !1414)
!1413 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!1414 = !{!1415, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1430}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1412, file: !1416, line: 3, baseType: !342, size: 32, align: 32)
!1416 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !1412, file: !1416, line: 4, baseType: !342, size: 32, align: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !1412, file: !1416, line: 5, baseType: !387, size: 64, align: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !1412, file: !1416, line: 7, baseType: !344, size: 64, align: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !1412, file: !1416, line: 8, baseType: !450, size: 64, align: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !1412, file: !1416, line: 9, baseType: !364, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1412, file: !1416, line: 10, baseType: !364, size: 64, align: 64, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !1412, file: !1416, line: 11, baseType: !379, size: 64, align: 64, offset: 384)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !1412, file: !1416, line: 12, baseType: !342, size: 32, align: 32, offset: 448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !1412, file: !1416, line: 13, baseType: !364, size: 64, align: 64, offset: 512)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !1412, file: !1416, line: 15, baseType: !1427, size: 64, align: 64, offset: 576)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{null, !1410}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !1412, file: !1416, line: 17, baseType: !1431, size: 64, align: 64, offset: 640)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{!355, !1410}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !1401, file: !1402, line: 36, baseType: !450, size: 64, align: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !1401, file: !1402, line: 37, baseType: !450, size: 64, align: 64, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !1401, file: !1402, line: 38, baseType: !364, size: 64, align: 64, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1401, file: !1402, line: 40, baseType: !342, size: 32, align: 32, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !1401, file: !1402, line: 41, baseType: !396, size: 64, align: 64, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !1401, file: !1402, line: 43, baseType: !385, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !1401, file: !1402, line: 44, baseType: !385, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !1401, file: !1402, line: 45, baseType: !385, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !1401, file: !1402, line: 48, baseType: !1443, size: 64, align: 64, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !1445, line: 14, baseType: !1446)
!1445 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1445, line: 6, size: 256, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1458, !1459, !1460}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1446, file: !1445, line: 7, baseType: !364, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1446, file: !1445, line: 9, baseType: !1450, size: 64, align: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !1452, line: 37, baseType: !1453)
!1452 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !1452, line: 39, size: 192, align: 64, elements: !1454)
!1454 = !{!1455, !1456, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1453, file: !1452, line: 41, baseType: !343, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1453, file: !1452, line: 42, baseType: !1450, size: 64, align: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1453, file: !1452, line: 43, baseType: !1450, size: 64, align: 64, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1446, file: !1445, line: 10, baseType: !342, size: 32, align: 32, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !1446, file: !1445, line: 12, baseType: !342, size: 32, align: 32, offset: 160)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !1446, file: !1445, line: 13, baseType: !342, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !1401, file: !1402, line: 49, baseType: !364, size: 64, align: 64, offset: 768)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !1401, file: !1402, line: 51, baseType: !342, size: 32, align: 32, offset: 832)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !1401, file: !1402, line: 52, baseType: !364, size: 64, align: 64, offset: 896)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !1401, file: !1402, line: 54, baseType: !379, size: 64, align: 64, offset: 960)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !1401, file: !1402, line: 55, baseType: !379, size: 64, align: 64, offset: 1024)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !1401, file: !1402, line: 57, baseType: !364, size: 64, align: 64, offset: 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !1401, file: !1402, line: 58, baseType: !344, size: 64, align: 64, offset: 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !1401, file: !1402, line: 60, baseType: !344, size: 64, align: 64, offset: 1216)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !1396, file: !1395, line: 52, baseType: !450, size: 64, align: 64, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !1396, file: !1395, line: 53, baseType: !355, size: 64, align: 64, offset: 128)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1396, file: !1395, line: 54, baseType: !355, size: 64, align: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !1396, file: !1395, line: 55, baseType: !355, size: 64, align: 64, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1396, file: !1395, line: 56, baseType: !355, size: 64, align: 64, offset: 320)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1396, file: !1395, line: 57, baseType: !342, size: 32, align: 32, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_priority", scope: !1396, file: !1395, line: 59, baseType: !342, size: 32, align: 32, offset: 416)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !1396, file: !1395, line: 60, baseType: !364, size: 64, align: 64, offset: 448)
