; ModuleID = './line300-fe-irc-commands.o.i'
source_filename = "./line300-fe-irc-commands.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._IRC_SERVER_REC = type { i32, i32, i32, %struct._IRC_SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)*, %struct._GSList*, %struct._GSList*, %struct._REDIRECT_REC*, %struct._GSList*, i8*, i8*, i8*, i8*, i8*, i32, i16, i32, i32, i32, i32, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, %struct._GString*, i32, i32, %struct._GSList*, %struct._GTimeVal, %struct._GTimeVal, i32, i32, i32, %struct._GSList*, %struct._GSList*, %struct._GSList*, %struct._GHashTable*, %struct._GSList*, %struct._GSList*, i8*, %struct._GHashTable*, [256 x %struct.modes_type], [256 x i8], i32 (i8*, i8*)* }

!149 = !DIEnumerator(name: "IRCTXT_USERMODE_CHANGE", value: 59)
!150 = !DIEnumerator(name: "IRCTXT_USER_MODE", value: 60)
!151 = !DIEnumerator(name: "IRCTXT_AWAY", value: 61)
!152 = !DIEnumerator(name: "IRCTXT_UNAWAY", value: 62)
!153 = !DIEnumerator(name: "IRCTXT_NICK_AWAY", value: 63)
!154 = !DIEnumerator(name: "IRCTXT_NO_SUCH_NICK", value: 64)
!155 = !DIEnumerator(name: "IRCTXT_NICK_IN_USE", value: 65)
!156 = !DIEnumerator(name: "IRCTXT_NICK_UNAVAILABLE", value: 66)
!157 = !DIEnumerator(name: "IRCTXT_YOUR_NICK_OWNED", value: 67)
!158 = !DIEnumerator(name: "IRCTXT_FILL_5", value: 68)
!159 = !DIEnumerator(name: "IRCTXT_WHOIS", value: 69)
!160 = !DIEnumerator(name: "IRCTXT_WHOWAS", value: 70)
!161 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE", value: 71)
!162 = !DIEnumerator(name: "IRCTXT_WHOIS_IDLE_SIGNON", value: 72)
!163 = !DIEnumerator(name: "IRCTXT_WHOIS_SERVER", value: 73)
!164 = !DIEnumerator(name: "IRCTXT_WHOIS_OPER", value: 74)
!165 = !DIEnumerator(name: "IRCTXT_WHOIS_MODES", value: 75)
!166 = !DIEnumerator(name: "IRCTXT_WHOIS_REALHOST", value: 76)
!167 = !DIEnumerator(name: "IRCTXT_WHOIS_USERMODE", value: 77)
!168 = !DIEnumerator(name: "IRCTXT_WHOIS_CHANNELS", value: 78)
!169 = !DIEnumerator(name: "IRCTXT_WHOIS_AWAY", value: 79)
!170 = !DIEnumerator(name: "IRCTXT_WHOIS_SPECIAL", value: 80)
!171 = !DIEnumerator(name: "IRCTXT_WHOIS_EXTRA", value: 81)
!172 = !DIEnumerator(name: "IRCTXT_END_OF_WHOIS", value: 82)
!173 = !DIEnumerator(name: "IRCTXT_END_OF_WHOWAS", value: 83)
!174 = !DIEnumerator(name: "IRCTXT_WHOIS_NOT_FOUND", value: 84)
!175 = !DIEnumerator(name: "IRCTXT_WHO", value: 85)
!176 = !DIEnumerator(name: "IRCTXT_END_OF_WHO", value: 86)
!177 = !DIEnumerator(name: "IRCTXT_FILL_6", value: 87)
!178 = !DIEnumerator(name: "IRCTXT_OWN_NOTICE", value: 88)
!179 = !DIEnumerator(name: "IRCTXT_OWN_ACTION", value: 89)
!180 = !DIEnumerator(name: "IRCTXT_OWN_ACTION_TARGET", value: 90)
!181 = !DIEnumerator(name: "IRCTXT_OWN_CTCP", value: 91)
!182 = !DIEnumerator(name: "IRCTXT_FILL_7", value: 92)
!183 = !DIEnumerator(name: "IRCTXT_NOTICE_SERVER", value: 93)
!184 = !DIEnumerator(name: "IRCTXT_NOTICE_PUBLIC", value: 94)
!185 = !DIEnumerator(name: "IRCTXT_NOTICE_PRIVATE", value: 95)
!186 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE", value: 96)
!187 = !DIEnumerator(name: "IRCTXT_ACTION_PRIVATE_QUERY", value: 97)
!188 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC", value: 98)
!189 = !DIEnumerator(name: "IRCTXT_ACTION_PUBLIC_CHANNEL", value: 99)
!190 = !DIEnumerator(name: "IRCTXT_FILL_8", value: 100)
!191 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY", value: 101)
!192 = !DIEnumerator(name: "IRCTXT_CTCP_REPLY_CHANNEL", value: 102)
!193 = !DIEnumerator(name: "IRCTXT_CTCP_PING_REPLY", value: 103)
!194 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED", value: 104)
!195 = !DIEnumerator(name: "IRCTXT_CTCP_REQUESTED_UNKNOWN", value: 105)
!196 = !DIEnumerator(name: "IRCTXT_FILL_10", value: 106)
!197 = !DIEnumerator(name: "IRCTXT_ONLINE", value: 107)
!198 = !DIEnumerator(name: "IRCTXT_PONG", value: 108)
!199 = !DIEnumerator(name: "IRCTXT_WALLOPS", value: 109)
!200 = !DIEnumerator(name: "IRCTXT_ACTION_WALLOPS", value: 110)
!201 = !DIEnumerator(name: "IRCTXT_KILL", value: 111)
!202 = !DIEnumerator(name: "IRCTXT_KILL_SERVER", value: 112)
!203 = !DIEnumerator(name: "IRCTXT_ERROR", value: 113)
!204 = !DIEnumerator(name: "IRCTXT_UNKNOWN_MODE", value: 114)
!205 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT", value: 115)
!206 = !DIEnumerator(name: "IRCTXT_DEFAULT_EVENT_SERVER", value: 116)
!207 = !DIEnumerator(name: "IRCTXT_FILL_11", value: 117)
!208 = !DIEnumerator(name: "IRCTXT_SILENCED", value: 118)
!209 = !DIEnumerator(name: "IRCTXT_UNSILENCED", value: 119)
!210 = !DIEnumerator(name: "IRCTXT_SILENCE_LINE", value: 120)
!211 = !DIEnumerator(name: "IRCTXT_ASK_OPER_PASS", value: 121)
!212 = !DIEnumerator(name: "IRCTXT_ACCEPT_LIST", value: 122)
!213 = !{!214, !221, !222, !535, !336, !525, !832, !642, !735, !230, !291, !623, !878, !885, !662}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !215, line: 9, baseType: !216)
!215 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !219, !219, !219, !219, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_REC", file: !224, line: 6, baseType: !225)
!224 = !DIFile(filename: "../../../src/irc/core/irc.h", directory: "/home/lichi/Desktop/irssi/task1")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_REC", file: !226, line: 42, size: 39168, align: 64, elements: !227)
!226 = !DIFile(filename: "../../../src/irc/core/irc-servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!227 = !{!228, !231, !232, !233, !480, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !502, !503, !504, !508, !513, !514, !515, !516, !517, !518, !519, !520, !527, !528, !529, !530, !531, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !875, !877}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !229, line: 3, baseType: !230, size: 32, align: 32)
!229 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!230 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !225, file: !229, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !225, file: !229, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !225, file: !229, line: 8, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_SERVER_CONNECT_REC", file: !224, line: 5, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_SERVER_CONNECT_REC", file: !226, line: 24, size: 2496, align: 64, elements: !237)
!237 = !{!238, !240, !241, !242, !245, !246, !247, !248, !249, !251, !252, !253, !254, !255, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !239, line: 3, baseType: !230, size: 32, align: 32)
!239 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !236, file: !239, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !236, file: !239, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !236, file: !239, line: 9, baseType: !243, size: 64, align: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !236, file: !239, line: 10, baseType: !230, size: 32, align: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !236, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !236, file: !239, line: 13, baseType: !250, size: 16, align: 16, offset: 448)
!250 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !236, file: !239, line: 14, baseType: !243, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !236, file: !239, line: 15, baseType: !243, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !236, file: !239, line: 16, baseType: !230, size: 32, align: 32, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !236, file: !239, line: 17, baseType: !243, size: 64, align: 64, offset: 704)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !236, file: !239, line: 19, baseType: !256, size: 64, align: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !258, line: 99, baseType: !259)
!258 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !258, line: 99, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !236, file: !239, line: 19, baseType: !256, size: 64, align: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !236, file: !239, line: 21, baseType: !243, size: 64, align: 64, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !236, file: !239, line: 22, baseType: !243, size: 64, align: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !236, file: !239, line: 23, baseType: !243, size: 64, align: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !236, file: !239, line: 24, baseType: !243, size: 64, align: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !236, file: !239, line: 26, baseType: !243, size: 64, align: 64, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !236, file: !239, line: 27, baseType: !243, size: 64, align: 64, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !236, file: !239, line: 28, baseType: !243, size: 64, align: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !236, file: !239, line: 29, baseType: !243, size: 64, align: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !236, file: !239, line: 30, baseType: !243, size: 64, align: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !236, file: !239, line: 31, baseType: !243, size: 64, align: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !236, file: !239, line: 32, baseType: !243, size: 64, align: 64, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !236, file: !239, line: 33, baseType: !243, size: 64, align: 64, offset: 1600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !236, file: !239, line: 35, baseType: !274, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !277)
!277 = !{!278, !281, !425, !426, !431, !432, !433, !434, !435, !444, !445, !446, !450, !451, !452, !453, !454, !455, !456, !457}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !276, file: !4, line: 100, baseType: !279, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !280, line: 49, baseType: !230)
!280 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!281 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !276, file: !4, line: 101, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !285)
!285 = !{!286, !310, !316, !323, !327, !412, !416, !421}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !284, file: !4, line: 133, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!290, !274, !291, !293, !296, !297}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !280, line: 46, baseType: !244)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !294, line: 66, baseType: !295)
!294 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!295 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !300, line: 42, baseType: !301)
!300 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !300, line: 44, size: 128, align: 64, elements: !302)
!302 = !{!303, !308, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !301, file: !300, line: 46, baseType: !304, size: 32, align: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !305, line: 36, baseType: !306)
!305 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !294, line: 45, baseType: !307)
!307 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !301, file: !300, line: 47, baseType: !279, size: 32, align: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !301, file: !300, line: 48, baseType: !291, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !284, file: !4, line: 138, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!290, !274, !314, !293, !296, !297}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !284, file: !4, line: 143, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!290, !274, !320, !322, !297}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !294, line: 51, baseType: !321)
!321 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !284, file: !4, line: 147, baseType: !324, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!290, !274, !297}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !284, file: !4, line: 149, baseType: !328, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !274, !411}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !334)
!334 = !{!335, !337, !358, !387, !389, !393, !394, !395, !396, !404, !405, !406, !407}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !333, file: !16, line: 174, baseType: !336, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !280, line: 77, baseType: !221)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !333, file: !16, line: 175, baseType: !338, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !341)
!341 = !{!342, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !340, file: !16, line: 198, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !336}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !340, file: !16, line: 199, baseType: !343, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !340, file: !16, line: 200, baseType: !348, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !336, !331, !351, !357}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!356, !336}
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !280, line: 50, baseType: !279)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !333, file: !16, line: 177, baseType: !359, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !363)
!363 = !{!364, !369, !373, !377, !381, !382}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !362, file: !16, line: 216, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!356, !331, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !362, file: !16, line: 218, baseType: !370, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!356, !331}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !362, file: !16, line: 219, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!356, !331, !352, !336}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !362, file: !16, line: 222, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !331}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !362, file: !16, line: 226, baseType: !352, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !362, file: !16, line: 227, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !333, file: !16, line: 178, baseType: !388, size: 32, align: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !280, line: 55, baseType: !307)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !333, file: !16, line: 180, baseType: !390, size: 64, align: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !333, file: !16, line: 182, baseType: !279, size: 32, align: 32, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !333, file: !16, line: 183, baseType: !388, size: 32, align: 32, offset: 352)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !333, file: !16, line: 184, baseType: !388, size: 32, align: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !333, file: !16, line: 186, baseType: !397, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !399, line: 37, baseType: !400)
!399 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !399, line: 39, size: 128, align: 64, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !400, file: !399, line: 41, baseType: !336, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !399, line: 42, baseType: !397, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !16, line: 188, baseType: !331, size: 64, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !16, line: 189, baseType: !331, size: 64, align: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !16, line: 191, baseType: !243, size: 64, align: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !333, file: !16, line: 193, baseType: !408, size: 64, align: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !284, file: !4, line: 151, baseType: !413, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !274}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !284, file: !4, line: 152, baseType: !417, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!290, !274, !420, !297}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !284, file: !4, line: 155, baseType: !422, size: 64, align: 64, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!420, !274}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !276, file: !4, line: 103, baseType: !291, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !276, file: !4, line: 104, baseType: !427, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !428, line: 77, baseType: !429)
!428 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !428, line: 77, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !276, file: !4, line: 105, baseType: !427, size: 64, align: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !276, file: !4, line: 106, baseType: !291, size: 64, align: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !276, file: !4, line: 107, baseType: !388, size: 32, align: 32, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !276, file: !4, line: 109, baseType: !293, size: 64, align: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !276, file: !4, line: 110, baseType: !436, size: 64, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !438, line: 39, baseType: !439)
!438 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !438, line: 41, size: 192, align: 64, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !439, file: !438, line: 43, baseType: !291, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !439, file: !438, line: 44, baseType: !293, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !439, file: !438, line: 45, baseType: !293, size: 64, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !276, file: !4, line: 111, baseType: !436, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !276, file: !4, line: 112, baseType: !436, size: 64, align: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !276, file: !4, line: 113, baseType: !447, size: 48, align: 8, offset: 704)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 48, align: 8, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 6)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !276, file: !4, line: 117, baseType: !388, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !276, file: !4, line: 118, baseType: !388, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !276, file: !4, line: 119, baseType: !388, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !276, file: !4, line: 120, baseType: !388, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !276, file: !4, line: 121, baseType: !388, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !276, file: !4, line: 122, baseType: !388, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !276, file: !4, line: 124, baseType: !336, size: 64, align: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !276, file: !4, line: 125, baseType: !336, size: 64, align: 64, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !236, file: !239, line: 38, baseType: !307, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !236, file: !239, line: 39, baseType: !307, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !236, file: !239, line: 40, baseType: !307, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !236, file: !239, line: 41, baseType: !307, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !236, file: !239, line: 42, baseType: !307, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !236, file: !239, line: 43, baseType: !307, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !236, file: !239, line: 44, baseType: !307, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !236, file: !239, line: 45, baseType: !307, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !236, file: !239, line: 46, baseType: !243, size: 64, align: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !236, file: !239, line: 47, baseType: !243, size: 64, align: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !236, file: !226, line: 27, baseType: !243, size: 64, align: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "alternate_nick", scope: !236, file: !226, line: 28, baseType: !243, size: 64, align: 64, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_mechanism", scope: !236, file: !226, line: 30, baseType: !230, size: 32, align: 32, offset: 2048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_username", scope: !236, file: !226, line: 31, baseType: !243, size: 64, align: 64, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_password", scope: !236, file: !226, line: 32, baseType: !243, size: 64, align: 64, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !236, file: !226, line: 34, baseType: !230, size: 32, align: 32, offset: 2240)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !236, file: !226, line: 35, baseType: !230, size: 32, align: 32, offset: 2272)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !236, file: !226, line: 36, baseType: !230, size: 32, align: 32, offset: 2304)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks", scope: !236, file: !226, line: 38, baseType: !230, size: 32, align: 32, offset: 2336)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !236, file: !226, line: 38, baseType: !230, size: 32, align: 32, offset: 2368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes", scope: !236, file: !226, line: 38, baseType: !230, size: 32, align: 32, offset: 2400)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois", scope: !236, file: !226, line: 38, baseType: !230, size: 32, align: 32, offset: 2432)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !225, file: !229, line: 9, baseType: !481, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !482, line: 75, baseType: !483)
!482 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !484, line: 139, baseType: !321)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!485 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !225, file: !229, line: 10, baseType: !481, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !225, file: !229, line: 12, baseType: !243, size: 64, align: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !225, file: !229, line: 13, baseType: !243, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !225, file: !229, line: 15, baseType: !307, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !225, file: !229, line: 16, baseType: !307, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !225, file: !229, line: 17, baseType: !307, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !225, file: !229, line: 18, baseType: !307, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !225, file: !229, line: 19, baseType: !307, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !225, file: !229, line: 21, baseType: !494, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !258, line: 102, baseType: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !258, line: 102, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !225, file: !229, line: 22, baseType: !230, size: 32, align: 32, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !225, file: !229, line: 25, baseType: !499, size: 128, align: 64, offset: 640)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, align: 64, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !225, file: !229, line: 26, baseType: !230, size: 32, align: 32, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !225, file: !229, line: 27, baseType: !230, size: 32, align: 32, offset: 800)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !225, file: !229, line: 29, baseType: !505, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !258, line: 103, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !258, line: 103, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !225, file: !229, line: 30, baseType: !509, size: 64, align: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !511, line: 37, baseType: !512)
!511 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !511, line: 37, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !229, line: 32, baseType: !243, size: 64, align: 64, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !225, file: !229, line: 33, baseType: !243, size: 64, align: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !225, file: !229, line: 34, baseType: !243, size: 64, align: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !225, file: !229, line: 35, baseType: !307, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !225, file: !229, line: 36, baseType: !307, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !225, file: !229, line: 37, baseType: !307, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !225, file: !229, line: 38, baseType: !307, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !225, file: !229, line: 40, baseType: !521, size: 128, align: 64, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !280, line: 504, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !280, line: 506, size: 128, align: 64, elements: !523)
!523 = !{!524, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !522, file: !280, line: 508, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !280, line: 48, baseType: !321)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !522, file: !280, line: 509, baseType: !525, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !225, file: !229, line: 41, baseType: !481, size: 64, align: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !225, file: !229, line: 42, baseType: !230, size: 32, align: 32, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !225, file: !229, line: 44, baseType: !397, size: 64, align: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !225, file: !229, line: 45, baseType: !397, size: 64, align: 64, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !225, file: !229, line: 53, baseType: !532, size: 64, align: 64, offset: 1600)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535, !623, !230}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !258, line: 107, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !538, line: 30, size: 2240, align: 64, elements: !539)
!538 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!539 = !{!540, !541, !542, !543, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !625, !629, !633, !638, !731, !758, !762}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !229, line: 3, baseType: !230, size: 32, align: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !537, file: !229, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !537, file: !229, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !537, file: !229, line: 8, baseType: !544, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !258, line: 113, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !538, line: 25, size: 1920, align: 64, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !546, file: !239, line: 3, baseType: !230, size: 32, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !546, file: !239, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !546, file: !239, line: 6, baseType: !230, size: 32, align: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !546, file: !239, line: 9, baseType: !243, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !546, file: !239, line: 10, baseType: !230, size: 32, align: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !546, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !546, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !546, file: !239, line: 11, baseType: !243, size: 64, align: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !546, file: !239, line: 13, baseType: !250, size: 16, align: 16, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !546, file: !239, line: 14, baseType: !243, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !546, file: !239, line: 15, baseType: !243, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !546, file: !239, line: 16, baseType: !230, size: 32, align: 32, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !546, file: !239, line: 17, baseType: !243, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !546, file: !239, line: 19, baseType: !256, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !546, file: !239, line: 19, baseType: !256, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !546, file: !239, line: 21, baseType: !243, size: 64, align: 64, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !546, file: !239, line: 22, baseType: !243, size: 64, align: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !546, file: !239, line: 23, baseType: !243, size: 64, align: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !546, file: !239, line: 24, baseType: !243, size: 64, align: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !546, file: !239, line: 26, baseType: !243, size: 64, align: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !546, file: !239, line: 27, baseType: !243, size: 64, align: 64, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !546, file: !239, line: 28, baseType: !243, size: 64, align: 64, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !546, file: !239, line: 29, baseType: !243, size: 64, align: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !546, file: !239, line: 30, baseType: !243, size: 64, align: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !546, file: !239, line: 31, baseType: !243, size: 64, align: 64, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !546, file: !239, line: 32, baseType: !243, size: 64, align: 64, offset: 1536)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !546, file: !239, line: 33, baseType: !243, size: 64, align: 64, offset: 1600)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !546, file: !239, line: 35, baseType: !274, size: 64, align: 64, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !546, file: !239, line: 38, baseType: !307, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !546, file: !239, line: 39, baseType: !307, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !546, file: !239, line: 40, baseType: !307, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !546, file: !239, line: 41, baseType: !307, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !546, file: !239, line: 42, baseType: !307, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !546, file: !239, line: 43, baseType: !307, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !546, file: !239, line: 44, baseType: !307, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !546, file: !239, line: 45, baseType: !307, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !546, file: !239, line: 46, baseType: !243, size: 64, align: 64, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !546, file: !239, line: 47, baseType: !243, size: 64, align: 64, offset: 1856)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !537, file: !229, line: 9, baseType: !481, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !537, file: !229, line: 10, baseType: !481, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !537, file: !229, line: 12, baseType: !243, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !537, file: !229, line: 13, baseType: !243, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !537, file: !229, line: 15, baseType: !307, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !537, file: !229, line: 16, baseType: !307, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !537, file: !229, line: 17, baseType: !307, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !537, file: !229, line: 18, baseType: !307, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !537, file: !229, line: 19, baseType: !307, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !537, file: !229, line: 21, baseType: !494, size: 64, align: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !537, file: !229, line: 22, baseType: !230, size: 32, align: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !537, file: !229, line: 25, baseType: !499, size: 128, align: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !537, file: !229, line: 26, baseType: !230, size: 32, align: 32, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !537, file: !229, line: 27, baseType: !230, size: 32, align: 32, offset: 800)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !537, file: !229, line: 29, baseType: !505, size: 64, align: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !537, file: !229, line: 30, baseType: !509, size: 64, align: 64, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !537, file: !229, line: 32, baseType: !243, size: 64, align: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !537, file: !229, line: 33, baseType: !243, size: 64, align: 64, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !537, file: !229, line: 34, baseType: !243, size: 64, align: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !537, file: !229, line: 35, baseType: !307, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !537, file: !229, line: 36, baseType: !307, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !537, file: !229, line: 37, baseType: !307, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !537, file: !229, line: 38, baseType: !307, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !537, file: !229, line: 40, baseType: !521, size: 128, align: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !537, file: !229, line: 41, baseType: !481, size: 64, align: 64, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !537, file: !229, line: 42, baseType: !230, size: 32, align: 32, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !537, file: !229, line: 44, baseType: !397, size: 64, align: 64, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !537, file: !229, line: 45, baseType: !397, size: 64, align: 64, offset: 1536)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !537, file: !229, line: 53, baseType: !532, size: 64, align: 64, offset: 1600)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !537, file: !229, line: 55, baseType: !616, size: 64, align: 64, offset: 1664)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!230, !535, !244}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !537, file: !229, line: 57, baseType: !620, size: 64, align: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!230, !535, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !537, file: !229, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!623, !535}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !537, file: !229, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !535, !623, !623, !230}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !537, file: !229, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!637, !535, !623, !623}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !537, file: !229, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !535, !623}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !258, line: 109, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !645, line: 15, size: 1408, align: 64, elements: !646)
!645 = !DIFile(filename: "../../../src/core/channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!646 = !{!647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !682, !683, !685, !686, !687, !688, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !648, line: 3, baseType: !230, size: 32, align: 32)
!648 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !644, file: !648, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !644, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !644, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !644, file: !648, line: 8, baseType: !535, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !644, file: !648, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !648, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !644, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !644, file: !648, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !644, file: !648, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !644, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !258, line: 108, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !665, line: 5, size: 704, align: 64, elements: !666)
!665 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !648, line: 3, baseType: !230, size: 32, align: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !664, file: !648, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !664, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !664, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !664, file: !648, line: 8, baseType: !535, size: 64, align: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !664, file: !648, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !664, file: !648, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !664, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !664, file: !648, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !664, file: !648, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !664, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !664, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!623, !662}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !644, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !644, file: !684, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!684 = !DIFile(filename: "../../../src/core/channel-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!685 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !644, file: !684, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !644, file: !684, line: 7, baseType: !481, size: 64, align: 64, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !644, file: !684, line: 9, baseType: !509, size: 64, align: 64, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !644, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "NICK_REC", file: !258, line: 111, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NICK_REC", file: !692, line: 13, size: 576, align: 64, elements: !693)
!692 = !DIFile(filename: "../../../src/core/nicklist.h", directory: "/home/lichi/Desktop/irssi/task1")
!693 = !{!694, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !712, !713}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !695, line: 3, baseType: !230, size: 32, align: 32)
!695 = !DIFile(filename: "../../../src/core/nick-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !691, file: !695, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last_check", scope: !691, file: !695, line: 6, baseType: !481, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !691, file: !695, line: 8, baseType: !243, size: 64, align: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !691, file: !695, line: 9, baseType: !243, size: 64, align: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !691, file: !695, line: 10, baseType: !243, size: 64, align: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "hops", scope: !691, file: !695, line: 11, baseType: !230, size: 32, align: 32, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gone", scope: !691, file: !695, line: 14, baseType: !307, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "serverop", scope: !691, file: !695, line: 15, baseType: !307, size: 1, align: 32, offset: 353, flags: DIFlagBitField, extraData: i64 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "send_massjoin", scope: !691, file: !695, line: 18, baseType: !307, size: 1, align: 32, offset: 354, flags: DIFlagBitField, extraData: i64 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !691, file: !695, line: 19, baseType: !307, size: 1, align: 32, offset: 355, flags: DIFlagBitField, extraData: i64 352)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "halfop", scope: !691, file: !695, line: 20, baseType: !307, size: 1, align: 32, offset: 356, flags: DIFlagBitField, extraData: i64 352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "voice", scope: !691, file: !695, line: 21, baseType: !307, size: 1, align: 32, offset: 357, flags: DIFlagBitField, extraData: i64 352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prefixes", scope: !691, file: !695, line: 22, baseType: !709, size: 64, align: 8, offset: 360)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 64, align: 8, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 8)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "unique_id", scope: !691, file: !695, line: 26, baseType: !221, size: 64, align: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !695, line: 28, baseType: !689, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !644, file: !684, line: 12, baseType: !307, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !644, file: !684, line: 13, baseType: !243, size: 64, align: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !644, file: !684, line: 14, baseType: !230, size: 32, align: 32, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !644, file: !684, line: 15, baseType: !243, size: 64, align: 64, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !644, file: !684, line: 17, baseType: !307, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !644, file: !684, line: 18, baseType: !307, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !644, file: !684, line: 19, baseType: !307, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !644, file: !684, line: 20, baseType: !307, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !644, file: !684, line: 22, baseType: !307, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !644, file: !684, line: 23, baseType: !307, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !644, file: !684, line: 24, baseType: !307, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !644, file: !684, line: 25, baseType: !307, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !644, file: !684, line: 26, baseType: !307, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !644, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!243, !642}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !537, file: !229, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !535, !623}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !258, line: 110, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !738, line: 15, size: 960, align: 64, elements: !739)
!738 = !DIFile(filename: "../../../src/core/queries.h", directory: "/home/lichi/Desktop/irssi/task1")
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !754, !755, !756, !757}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !648, line: 3, baseType: !230, size: 32, align: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !737, file: !648, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !737, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !737, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !737, file: !648, line: 8, baseType: !535, size: 64, align: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !737, file: !648, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !648, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !737, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !737, file: !648, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !737, file: !648, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !737, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !737, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !737, file: !753, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!753 = !DIFile(filename: "../../../src/core/query-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!754 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !737, file: !753, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "last_unread_msg", scope: !737, file: !753, line: 7, baseType: !481, size: 64, align: 64, offset: 832)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "unwanted", scope: !737, file: !753, line: 9, baseType: !307, size: 1, align: 32, offset: 896, flags: DIFlagBitField, extraData: i64 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !737, file: !753, line: 11, baseType: !307, size: 1, align: 32, offset: 897, flags: DIFlagBitField, extraData: i64 896)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !537, file: !229, line: 71, baseType: !759, size: 64, align: 64, offset: 2112)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!230, !623, !623}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !537, file: !229, line: 73, baseType: !759, size: 64, align: 64, offset: 2176)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !225, file: !229, line: 55, baseType: !616, size: 64, align: 64, offset: 1664)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !225, file: !229, line: 57, baseType: !620, size: 64, align: 64, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !225, file: !229, line: 60, baseType: !626, size: 64, align: 64, offset: 1792)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !225, file: !229, line: 62, baseType: !630, size: 64, align: 64, offset: 1856)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !225, file: !229, line: 65, baseType: !634, size: 64, align: 64, offset: 1920)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !225, file: !229, line: 69, baseType: !639, size: 64, align: 64, offset: 1984)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !225, file: !229, line: 70, baseType: !732, size: 64, align: 64, offset: 2048)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !225, file: !229, line: 71, baseType: !759, size: 64, align: 64, offset: 2112)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !225, file: !229, line: 73, baseType: !759, size: 64, align: 64, offset: 2176)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "redirects", scope: !225, file: !226, line: 46, baseType: !397, size: 64, align: 64, offset: 2240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_queue", scope: !225, file: !226, line: 47, baseType: !397, size: 64, align: 64, offset: 2304)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_next", scope: !225, file: !226, line: 48, baseType: !775, size: 64, align: 64, offset: 2368)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "REDIRECT_REC", file: !224, line: 8, baseType: !777)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "_REDIRECT_REC", file: !224, line: 8, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_active", scope: !225, file: !226, line: 49, baseType: !397, size: 64, align: 64, offset: 2432)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "last_nick", scope: !225, file: !226, line: 51, baseType: !243, size: 64, align: 64, offset: 2496)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "real_address", scope: !225, file: !226, line: 53, baseType: !243, size: 64, align: 64, offset: 2560)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "usermode", scope: !225, file: !226, line: 54, baseType: !243, size: 64, align: 64, offset: 2624)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_usermode", scope: !225, file: !226, line: 55, baseType: !243, size: 64, align: 64, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "userhost", scope: !225, file: !226, line: 56, baseType: !243, size: 64, align: 64, offset: 2752)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "channels_formed", scope: !225, file: !226, line: 57, baseType: !230, size: 32, align: 32, offset: 2816)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "whois_found", scope: !225, file: !226, line: 59, baseType: !307, size: 1, align: 32, offset: 2848, flags: DIFlagBitField, extraData: i64 2848)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "whowas_found", scope: !225, file: !226, line: 60, baseType: !307, size: 1, align: 32, offset: 2849, flags: DIFlagBitField, extraData: i64 2848)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "emode_known", scope: !225, file: !226, line: 62, baseType: !307, size: 1, align: 32, offset: 2850, flags: DIFlagBitField, extraData: i64 2848)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_mode", scope: !225, file: !226, line: 63, baseType: !307, size: 1, align: 32, offset: 2851, flags: DIFlagBitField, extraData: i64 2848)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "no_multi_who", scope: !225, file: !226, line: 64, baseType: !307, size: 1, align: 32, offset: 2852, flags: DIFlagBitField, extraData: i64 2848)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "one_endofwho", scope: !225, file: !226, line: 65, baseType: !307, size: 1, align: 32, offset: 2853, flags: DIFlagBitField, extraData: i64 2848)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "disable_lag", scope: !225, file: !226, line: 66, baseType: !307, size: 1, align: 32, offset: 2854, flags: DIFlagBitField, extraData: i64 2848)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nick_collision", scope: !225, file: !226, line: 67, baseType: !307, size: 1, align: 32, offset: 2855, flags: DIFlagBitField, extraData: i64 2848)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "motd_got", scope: !225, file: !226, line: 68, baseType: !307, size: 1, align: 32, offset: 2856, flags: DIFlagBitField, extraData: i64 2848)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "isupport_sent", scope: !225, file: !226, line: 69, baseType: !307, size: 1, align: 32, offset: 2857, flags: DIFlagBitField, extraData: i64 2848)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cap_complete", scope: !225, file: !226, line: 70, baseType: !307, size: 1, align: 32, offset: 2858, flags: DIFlagBitField, extraData: i64 2848)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cap_in_multiline", scope: !225, file: !226, line: 71, baseType: !307, size: 1, align: 32, offset: 2859, flags: DIFlagBitField, extraData: i64 2848)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_success", scope: !225, file: !226, line: 72, baseType: !307, size: 1, align: 32, offset: 2860, flags: DIFlagBitField, extraData: i64 2848)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_kicks_in_cmd", scope: !225, file: !226, line: 74, baseType: !230, size: 32, align: 32, offset: 2880)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "max_modes_in_cmd", scope: !225, file: !226, line: 75, baseType: !230, size: 32, align: 32, offset: 2912)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "max_whois_in_cmd", scope: !225, file: !226, line: 76, baseType: !230, size: 32, align: 32, offset: 2944)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs_in_cmd", scope: !225, file: !226, line: 77, baseType: !230, size: 32, align: 32, offset: 2976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cap_supported", scope: !225, file: !226, line: 79, baseType: !509, size: 64, align: 64, offset: 3008)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cap_active", scope: !225, file: !226, line: 80, baseType: !397, size: 64, align: 64, offset: 3072)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cap_queue", scope: !225, file: !226, line: 81, baseType: !397, size: 64, align: 64, offset: 3136)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_buffer", scope: !225, file: !226, line: 83, baseType: !436, size: 64, align: 64, offset: 3200)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sasl_timeout", scope: !225, file: !226, line: 84, baseType: !388, size: 32, align: 32, offset: 3264)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cmdcount", scope: !225, file: !226, line: 87, baseType: !230, size: 32, align: 32, offset: 3296)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cmdqueue", scope: !225, file: !226, line: 91, baseType: !397, size: 64, align: 64, offset: 3328)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "wait_cmd", scope: !225, file: !226, line: 92, baseType: !521, size: 128, align: 64, offset: 3392)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "last_cmd", scope: !225, file: !226, line: 93, baseType: !521, size: 128, align: 64, offset: 3520)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds_at_once", scope: !225, file: !226, line: 95, baseType: !230, size: 32, align: 32, offset: 3648)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_queue_speed", scope: !225, file: !226, line: 96, baseType: !230, size: 32, align: 32, offset: 3680)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "max_query_chans", scope: !225, file: !226, line: 97, baseType: !230, size: 32, align: 32, offset: 3712)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "idles", scope: !225, file: !226, line: 100, baseType: !397, size: 64, align: 64, offset: 3776)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ctcpqueue", scope: !225, file: !226, line: 103, baseType: !397, size: 64, align: 64, offset: 3840)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "knockoutlist", scope: !225, file: !226, line: 106, baseType: !397, size: 64, align: 64, offset: 3904)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "splits", scope: !225, file: !226, line: 108, baseType: !509, size: 64, align: 64, offset: 3968)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "split_servers", scope: !225, file: !226, line: 109, baseType: !397, size: 64, align: 64, offset: 4032)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rejoin_channels", scope: !225, file: !226, line: 111, baseType: !397, size: 64, align: 64, offset: 4096)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "chanqueries", scope: !225, file: !226, line: 114, baseType: !221, size: 64, align: 64, offset: 4160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "isupport", scope: !225, file: !226, line: 116, baseType: !509, size: 64, align: 64, offset: 4224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !225, file: !226, line: 117, baseType: !823, size: 32768, align: 64, offset: 4288)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 32768, align: 64, elements: !873)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "modes_type", file: !825, line: 10, size: 128, align: 64, elements: !826)
!825 = !DIFile(filename: "../../../src/irc/core/modes.h", directory: "/home/lichi/Desktop/irssi/task1")
!826 = !{!827, !872}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !824, file: !825, line: 11, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_func_t", file: !825, line: 7, baseType: !830)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !832, !623, !244, !244, !243, !436}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRC_CHANNEL_REC", file: !224, line: 7, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IRC_CHANNEL_REC", file: !835, line: 15, size: 1600, align: 64, elements: !836)
!835 = !DIFile(filename: "../../../src/irc/core/irc-channels.h", directory: "/home/lichi/Desktop/irssi/task1")
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !834, file: !648, line: 3, baseType: !230, size: 32, align: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !834, file: !648, line: 4, baseType: !230, size: 32, align: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !834, file: !648, line: 5, baseType: !509, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !834, file: !648, line: 7, baseType: !221, size: 64, align: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !834, file: !648, line: 8, baseType: !222, size: 64, align: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !834, file: !648, line: 9, baseType: !243, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !834, file: !648, line: 10, baseType: !243, size: 64, align: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !834, file: !648, line: 11, baseType: !481, size: 64, align: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !834, file: !648, line: 12, baseType: !230, size: 32, align: 32, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !834, file: !648, line: 13, baseType: !243, size: 64, align: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !834, file: !648, line: 15, baseType: !659, size: 64, align: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !834, file: !648, line: 17, baseType: !679, size: 64, align: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !834, file: !684, line: 5, baseType: !243, size: 64, align: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "topic_by", scope: !834, file: !684, line: 6, baseType: !243, size: 64, align: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "topic_time", scope: !834, file: !684, line: 7, baseType: !481, size: 64, align: 64, offset: 832)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "nicks", scope: !834, file: !684, line: 9, baseType: !509, size: 64, align: 64, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ownnick", scope: !834, file: !684, line: 10, baseType: !689, size: 64, align: 64, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "no_modes", scope: !834, file: !684, line: 12, baseType: !307, size: 1, align: 32, offset: 1024, flags: DIFlagBitField, extraData: i64 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !834, file: !684, line: 13, baseType: !243, size: 64, align: 64, offset: 1088)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !834, file: !684, line: 14, baseType: !230, size: 32, align: 32, offset: 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !834, file: !684, line: 15, baseType: !243, size: 64, align: 64, offset: 1216)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "chanop", scope: !834, file: !684, line: 17, baseType: !307, size: 1, align: 32, offset: 1280, flags: DIFlagBitField, extraData: i64 1280)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "names_got", scope: !834, file: !684, line: 18, baseType: !307, size: 1, align: 32, offset: 1281, flags: DIFlagBitField, extraData: i64 1280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "wholist", scope: !834, file: !684, line: 19, baseType: !307, size: 1, align: 32, offset: 1282, flags: DIFlagBitField, extraData: i64 1280)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "synced", scope: !834, file: !684, line: 20, baseType: !307, size: 1, align: 32, offset: 1283, flags: DIFlagBitField, extraData: i64 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "joined", scope: !834, file: !684, line: 22, baseType: !307, size: 1, align: 32, offset: 1284, flags: DIFlagBitField, extraData: i64 1280)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !834, file: !684, line: 23, baseType: !307, size: 1, align: 32, offset: 1285, flags: DIFlagBitField, extraData: i64 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "kicked", scope: !834, file: !684, line: 24, baseType: !307, size: 1, align: 32, offset: 1286, flags: DIFlagBitField, extraData: i64 1280)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "session_rejoin", scope: !834, file: !684, line: 25, baseType: !307, size: 1, align: 32, offset: 1287, flags: DIFlagBitField, extraData: i64 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !834, file: !684, line: 26, baseType: !307, size: 1, align: 32, offset: 1288, flags: DIFlagBitField, extraData: i64 1280)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "get_join_data", scope: !834, file: !684, line: 31, baseType: !728, size: 64, align: 64, offset: 1344)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "banlist", scope: !834, file: !835, line: 18, baseType: !397, size: 64, align: 64, offset: 1408)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "massjoin_start", scope: !834, file: !835, line: 20, baseType: !481, size: 64, align: 64, offset: 1472)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "massjoins", scope: !834, file: !835, line: 21, baseType: !230, size: 32, align: 32, offset: 1536)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "last_massjoins", scope: !834, file: !835, line: 22, baseType: !230, size: 32, align: 32, offset: 1568)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !824, file: !825, line: 12, baseType: !244, size: 8, align: 8, offset: 64)
!873 = !{!874}
!874 = !DISubrange(count: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !225, file: !226, line: 118, baseType: !876, size: 2048, align: 8, offset: 37056)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 2048, align: 8, elements: !873)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "nick_comp_func", scope: !225, file: !226, line: 120, baseType: !759, size: 64, align: 64, offset: 39104)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "OPER_PASS_REC", file: !880, line: 350, baseType: !881)
!880 = !DIFile(filename: "fe-irc-commands.c", directory: "/home/lichi/Desktop/irssi/task1")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !880, line: 347, size: 128, align: 64, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server_tag", scope: !881, file: !880, line: 348, baseType: !243, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !881, file: !880, line: 349, baseType: !243, size: 64, align: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !258, line: 117, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !888, line: 28, size: 1280, align: 64, elements: !889)
!888 = !DIFile(filename: "../../../src/fe-common/core/fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !923, !924, !925, !926, !927, !928, !929, !930}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !887, file: !888, line: 29, baseType: !230, size: 32, align: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !888, line: 30, baseType: !243, size: 64, align: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !887, file: !888, line: 32, baseType: !230, size: 32, align: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !887, file: !888, line: 32, baseType: !230, size: 32, align: 32, offset: 160)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !887, file: !888, line: 34, baseType: !397, size: 64, align: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !887, file: !888, line: 35, baseType: !662, size: 64, align: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !887, file: !888, line: 36, baseType: !535, size: 64, align: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !887, file: !888, line: 37, baseType: !535, size: 64, align: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !887, file: !888, line: 38, baseType: !243, size: 64, align: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !887, file: !888, line: 40, baseType: !230, size: 32, align: 32, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !887, file: !888, line: 41, baseType: !397, size: 64, align: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !887, file: !888, line: 43, baseType: !307, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !887, file: !888, line: 44, baseType: !307, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !887, file: !888, line: 45, baseType: !307, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !887, file: !888, line: 48, baseType: !905, size: 64, align: 64, offset: 704)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !907, line: 14, baseType: !908)
!907 = !DIFile(filename: "../../../src/fe-common/core/command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !907, line: 6, size: 256, align: 64, elements: !909)
!909 = !{!910, !911, !920, !921, !922}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !907, line: 7, baseType: !243, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !908, file: !907, line: 9, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !914, line: 37, baseType: !915)
!914 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !914, line: 39, size: 192, align: 64, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !915, file: !914, line: 41, baseType: !336, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !915, file: !914, line: 42, baseType: !912, size: 64, align: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !915, file: !914, line: 43, baseType: !912, size: 64, align: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !908, file: !907, line: 10, baseType: !230, size: 32, align: 32, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !908, file: !907, line: 12, baseType: !230, size: 32, align: 32, offset: 160)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !908, file: !907, line: 13, baseType: !230, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !887, file: !888, line: 49, baseType: !243, size: 64, align: 64, offset: 768)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !887, file: !888, line: 51, baseType: !230, size: 32, align: 32, offset: 832)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !887, file: !888, line: 52, baseType: !243, size: 64, align: 64, offset: 896)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !887, file: !888, line: 54, baseType: !481, size: 64, align: 64, offset: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !887, file: !888, line: 55, baseType: !481, size: 64, align: 64, offset: 1024)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !887, file: !888, line: 57, baseType: !243, size: 64, align: 64, offset: 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !887, file: !888, line: 58, baseType: !221, size: 64, align: 64, offset: 1152)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !887, file: !888, line: 60, baseType: !221, size: 64, align: 64, offset: 1216)
!931 = !{i32 2, !"Dwarf Version", i32 4}
!932 = !{i32 2, !"Debug Info Version", i32 3}
!933 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!934 = distinct !DISubprogram(name: "fe_irc_commands_init", scope: !880, file: !880, line: 418, type: !385, isLocal: false, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !935)
!935 = !{}
!936 = !DILocation(line: 420, column: 49, scope: !934)
!937 = !DILocation(line: 420, column: 2, scope: !938)
!938 = !DILexicalBlockFile(scope: !934, file: !880, discriminator: 1)
!939 = !DILocation(line: 421, column: 53, scope: !934)
!940 = !DILocation(line: 421, column: 2, scope: !938)
!941 = !DILocation(line: 422, column: 51, scope: !934)
!942 = !DILocation(line: 422, column: 2, scope: !938)
!943 = !DILocation(line: 423, column: 49, scope: !934)
!944 = !DILocation(line: 423, column: 2, scope: !938)
!945 = !DILocation(line: 424, column: 50, scope: !934)
!946 = !DILocation(line: 424, column: 2, scope: !938)
!947 = !DILocation(line: 425, column: 49, scope: !934)
!948 = !DILocation(line: 425, column: 2, scope: !938)
!949 = !DILocation(line: 426, column: 48, scope: !934)
!950 = !DILocation(line: 426, column: 2, scope: !938)
!951 = !DILocation(line: 427, column: 48, scope: !934)
!952 = !DILocation(line: 427, column: 2, scope: !938)
!953 = !DILocation(line: 428, column: 50, scope: !934)
!954 = !DILocation(line: 428, column: 2, scope: !938)
!955 = !DILocation(line: 429, column: 47, scope: !934)
!956 = !DILocation(line: 429, column: 2, scope: !938)
!957 = !DILocation(line: 430, column: 49, scope: !934)
!958 = !DILocation(line: 430, column: 2, scope: !938)
!959 = !DILocation(line: 431, column: 52, scope: !934)
!960 = !DILocation(line: 431, column: 2, scope: !938)
!961 = !DILocation(line: 432, column: 1, scope: !934)
!962 = distinct !DISubprogram(name: "cmd_me", scope: !880, file: !880, line: 44, type: !963, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !935)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !623, !222, !662}
!965 = !DILocalVariable(name: "data", arg: 1, scope: !962, file: !880, line: 44, type: !623)
!966 = !DIExpression()
!967 = !DILocation(line: 44, column: 32, scope: !962)
!968 = !DILocalVariable(name: "server", arg: 2, scope: !962, file: !880, line: 44, type: !222)
!969 = !DILocation(line: 44, column: 54, scope: !962)
!970 = !DILocalVariable(name: "item", arg: 3, scope: !962, file: !880, line: 44, type: !662)
!971 = !DILocation(line: 44, column: 75, scope: !962)
!972 = !DILocalVariable(name: "target", scope: !962, file: !880, line: 46, type: !623)
!973 = !DILocation(line: 46, column: 14, scope: !962)
!974 = !DILocalVariable(name: "subdata", scope: !962, file: !880, line: 47, type: !243)
!975 = !DILocation(line: 47, column: 8, scope: !962)
!976 = !DILocalVariable(name: "splitdata", scope: !962, file: !880, line: 48, type: !637)
!977 = !DILocation(line: 48, column: 9, scope: !962)
!978 = !DILocalVariable(name: "n", scope: !962, file: !880, line: 49, type: !230)
!979 = !DILocation(line: 49, column: 6, scope: !962)
!980 = !DILocation(line: 51, column: 9, scope: !962)
!981 = distinct !{!981, !980}
!982 = !DILocation(line: 51, column: 18, scope: !983)
!983 = !DILexicalBlockFile(scope: !984, file: !880, discriminator: 1)
!984 = distinct !DILexicalBlock(scope: !985, file: !880, line: 51, column: 18)
!985 = distinct !DILexicalBlock(scope: !962, file: !880, line: 51, column: 12)
!986 = !DILocation(line: 51, column: 25, scope: !983)
!987 = !DILocation(line: 51, column: 8, scope: !983)
!988 = !DILocation(line: 51, column: 92, scope: !989)
!989 = !DILexicalBlockFile(scope: !984, file: !880, discriminator: 2)
