; ModuleID = './line256-fe-recode.o.i'
source_filename = "./line256-fe-recode.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!285 = !DIFile(filename: "../../../src/core/commands.h", directory: "/home/lichi/Desktop/irssi/task1")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!287 = !DIEnumerator(name: "CMDERR_OPTION_UNKNOWN", value: -3)
!288 = !DIEnumerator(name: "CMDERR_OPTION_AMBIGUOUS", value: -2)
!289 = !DIEnumerator(name: "CMDERR_OPTION_ARG_MISSING", value: -1)
!290 = !DIEnumerator(name: "CMDERR_UNKNOWN", value: 0)
!291 = !DIEnumerator(name: "CMDERR_AMBIGUOUS", value: 1)
!292 = !DIEnumerator(name: "CMDERR_ERRNO", value: 2)
!293 = !DIEnumerator(name: "CMDERR_NOT_ENOUGH_PARAMS", value: 3)
!294 = !DIEnumerator(name: "CMDERR_NOT_CONNECTED", value: 4)
!295 = !DIEnumerator(name: "CMDERR_NOT_JOINED", value: 5)
!296 = !DIEnumerator(name: "CMDERR_CHAN_NOT_FOUND", value: 6)
!297 = !DIEnumerator(name: "CMDERR_CHAN_NOT_SYNCED", value: 7)
!298 = !DIEnumerator(name: "CMDERR_ILLEGAL_PROTO", value: 8)
!299 = !DIEnumerator(name: "CMDERR_NOT_GOOD_IDEA", value: 9)
!300 = !DIEnumerator(name: "CMDERR_INVALID_TIME", value: 10)
!301 = !DIEnumerator(name: "CMDERR_INVALID_CHARSET", value: 11)
!302 = !DIEnumerator(name: "CMDERR_EVAL_MAX_RECURSE", value: 12)
!303 = !DIEnumerator(name: "CMDERR_PROGRAM_NOT_FOUND", value: 13)
!304 = !DIEnumerator(name: "CMDERR_NO_SERVER_DEFINED", value: 14)
!305 = !{!306, !313, !314, !322, !323}
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !307, line: 9, baseType: !308)
!307 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311, !311, !311, !311, !311, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareFunc", file: !315, line: 80, baseType: !316)
!315 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !321, !321}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !315, line: 49, baseType: !320)
!320 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !315, line: 78, baseType: !311)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !315, line: 77, baseType: !313)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !315, line: 48, baseType: !324)
!324 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!325 = !{!326, !330, !331}
!326 = distinct !DIGlobalVariable(name: "term_charset", scope: !0, file: !327, line: 34, type: !328, isLocal: true, isDefinition: true, variable: i8** @term_charset)
!327 = !DIFile(filename: "fe-recode.c", directory: "/home/lichi/Desktop/irssi/task1")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!330 = distinct !DIGlobalVariable(name: "recode_fallback", scope: !0, file: !327, line: 32, type: !328, isLocal: true, isDefinition: true, variable: i8** @recode_fallback)
!331 = distinct !DIGlobalVariable(name: "recode_out_default", scope: !0, file: !327, line: 33, type: !328, isLocal: true, isDefinition: true, variable: i8** @recode_out_default)
!332 = !{i32 2, !"Dwarf Version", i32 4}
!333 = !{i32 2, !"Debug Info Version", i32 3}
!334 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!335 = distinct !DISubprogram(name: "fe_recode_init", scope: !327, file: !327, line: 193, type: !336, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !338)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !{}
!339 = !DILocation(line: 195, column: 2, scope: !335)
!340 = !DILocation(line: 196, column: 2, scope: !335)
!341 = !DILocation(line: 197, column: 2, scope: !335)
!342 = !DILocation(line: 198, column: 2, scope: !335)
!343 = !DILocation(line: 199, column: 2, scope: !335)
!344 = !DILocation(line: 200, column: 1, scope: !335)
!345 = distinct !DISubprogram(name: "fe_recode_cmd", scope: !327, file: !327, line: 52, type: !346, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !338)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348, !350, !354}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !352, line: 107, baseType: !353)
!352 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !352, line: 107, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !352, line: 108, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !357, line: 5, size: 704, align: 64, elements: !358)
!357 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!358 = !{!359, !361, !362, !367, !368, !369, !370, !371, !376, !377, !378, !382}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !360, line: 3, baseType: !320, size: 32, align: 32)
!360 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!361 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !356, file: !360, line: 4, baseType: !320, size: 32, align: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !356, file: !360, line: 5, baseType: !363, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !365, line: 37, baseType: !366)
!365 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !365, line: 37, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !356, file: !360, line: 7, baseType: !313, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !356, file: !360, line: 8, baseType: !350, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !356, file: !360, line: 9, baseType: !328, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !360, line: 10, baseType: !328, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !356, file: !360, line: 11, baseType: !372, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !373, line: 75, baseType: !374)
!373 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !375, line: 139, baseType: !324)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !356, file: !360, line: 12, baseType: !320, size: 32, align: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !356, file: !360, line: 13, baseType: !328, size: 64, align: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !356, file: !360, line: 15, baseType: !379, size: 64, align: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !354}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !356, file: !360, line: 17, baseType: !383, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!348, !354}
!386 = !DILocalVariable(name: "data", arg: 1, scope: !345, file: !327, line: 52, type: !348)
!387 = !DIExpression()
!388 = !DILocation(line: 52, column: 40, scope: !345)
!389 = !DILocalVariable(name: "server", arg: 2, scope: !345, file: !327, line: 52, type: !350)
!390 = !DILocation(line: 52, column: 58, scope: !345)
!391 = !DILocalVariable(name: "witem", arg: 3, scope: !345, file: !327, line: 52, type: !354)
!392 = !DILocation(line: 52, column: 79, scope: !345)
!393 = !DILocation(line: 54, column: 7, scope: !394)
!394 = distinct !DILexicalBlock(scope: !345, file: !327, line: 54, column: 6)
!395 = !DILocation(line: 54, column: 6, scope: !394)
!396 = !DILocation(line: 54, column: 6, scope: !345)
!397 = !DILocation(line: 55, column: 28, scope: !394)
!398 = !DILocation(line: 55, column: 34, scope: !394)
!399 = !DILocation(line: 55, column: 42, scope: !394)
!400 = !DILocation(line: 55, column: 3, scope: !394)
!401 = !DILocalVariable(name: "conversions", scope: !402, file: !327, line: 57, type: !403)
!402 = distinct !DILexicalBlock(scope: !394, file: !327, line: 56, column: 7)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !4, line: 17, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !4, line: 20, size: 192, align: 64, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !405, file: !4, line: 21, baseType: !320, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !405, file: !4, line: 22, baseType: !328, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !405, file: !4, line: 23, baseType: !313, size: 64, align: 64, offset: 128)
!410 = !DILocation(line: 57, column: 16, scope: !402)
!411 = !DILocalVariable(name: "tmp", scope: !402, file: !327, line: 58, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !414, line: 37, baseType: !415)
!414 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !414, line: 39, size: 128, align: 64, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !414, line: 41, baseType: !322, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !414, line: 42, baseType: !412, size: 64, align: 64, offset: 64)
!419 = !DILocation(line: 58, column: 11, scope: !402)
!420 = !DILocalVariable(name: "sorted", scope: !402, file: !327, line: 59, type: !412)
!421 = !DILocation(line: 59, column: 11, scope: !402)
!422 = !DILocation(line: 61, column: 38, scope: !402)
!423 = !DILocation(line: 61, column: 17, scope: !402)
!424 = !DILocation(line: 61, column: 15, scope: !402)
!425 = !DILocation(line: 63, column: 14, scope: !426)
!426 = distinct !DILexicalBlock(scope: !402, file: !327, line: 63, column: 3)
!427 = !DILocation(line: 63, column: 46, scope: !428)
!428 = !DILexicalBlockFile(scope: !426, file: !327, discriminator: 1)
!429 = !DILocation(line: 63, column: 59, scope: !428)
!430 = !DILocation(line: 63, column: 28, scope: !428)
!431 = !DILocation(line: 63, column: 14, scope: !428)
!432 = !DILocation(line: 63, column: 14, scope: !433)
!433 = !DILexicalBlockFile(scope: !426, file: !327, discriminator: 2)
!434 = !DILocation(line: 63, column: 14, scope: !435)
!435 = !DILexicalBlockFile(scope: !426, file: !327, discriminator: 3)
!436 = !DILocation(line: 63, column: 12, scope: !435)
!437 = !DILocation(line: 63, column: 8, scope: !435)
!438 = !DILocation(line: 64, column: 8, scope: !439)
!439 = distinct !DILexicalBlock(scope: !426, file: !327, line: 63, column: 3)
!440 = !DILocation(line: 64, column: 12, scope: !439)
!441 = !DILocation(line: 63, column: 3, scope: !442)
!442 = !DILexicalBlockFile(scope: !426, file: !327, discriminator: 4)
!443 = !DILocalVariable(name: "node", scope: !444, file: !327, line: 66, type: !403)
!444 = distinct !DILexicalBlock(scope: !439, file: !327, line: 65, column: 37)
!445 = !DILocation(line: 66, column: 17, scope: !444)
!446 = !DILocation(line: 66, column: 24, scope: !444)
!447 = !DILocation(line: 66, column: 29, scope: !444)
!448 = !DILocation(line: 68, column: 8, scope: !449)
!449 = distinct !DILexicalBlock(scope: !444, file: !327, line: 68, column: 8)
!450 = !DILocation(line: 68, column: 14, scope: !449)
!451 = !DILocation(line: 68, column: 19, scope: !449)
!452 = !DILocation(line: 68, column: 8, scope: !444)
!453 = !DILocation(line: 69, column: 36, scope: !449)
!454 = !DILocation(line: 69, column: 44, scope: !449)
!455 = !DILocation(line: 69, column: 14, scope: !449)
!456 = !DILocation(line: 69, column: 12, scope: !449)
!457 = !DILocation(line: 69, column: 5, scope: !449)
!458 = !DILocation(line: 70, column: 3, scope: !444)
!459 = !DILocation(line: 65, column: 31, scope: !439)
!460 = !DILocation(line: 65, column: 14, scope: !439)
!461 = !DILocation(line: 65, column: 12, scope: !439)
!462 = !DILocation(line: 63, column: 3, scope: !463)
!463 = !DILexicalBlockFile(scope: !439, file: !327, discriminator: 5)
!464 = distinct !{!464, !465}
!465 = !DILocation(line: 63, column: 3, scope: !402)
!466 = !DILocation(line: 72, column: 4, scope: !402)
!467 = !DILocation(line: 73, column: 14, scope: !468)
!468 = distinct !DILexicalBlock(scope: !402, file: !327, line: 73, column: 3)
!469 = !DILocation(line: 73, column: 12, scope: !468)
!470 = !DILocation(line: 73, column: 8, scope: !468)
!471 = !DILocation(line: 73, column: 22, scope: !472)
!472 = !DILexicalBlockFile(scope: !473, file: !327, discriminator: 1)
!473 = distinct !DILexicalBlock(scope: !468, file: !327, line: 73, column: 3)
!474 = !DILocation(line: 73, column: 26, scope: !472)
!475 = !DILocation(line: 73, column: 3, scope: !472)
!476 = !DILocalVariable(name: "node", scope: !477, file: !327, line: 74, type: !403)
!477 = distinct !DILexicalBlock(scope: !473, file: !327, line: 73, column: 51)
!478 = !DILocation(line: 74, column: 17, scope: !477)
!479 = !DILocation(line: 74, column: 24, scope: !477)
!480 = !DILocation(line: 74, column: 29, scope: !477)
!481 = !DILocation(line: 75, column: 43, scope: !477)
!482 = !DILocation(line: 75, column: 49, scope: !477)
!483 = !DILocation(line: 75, column: 54, scope: !477)
