; ModuleID = './line268-fe-windows.o.i'
source_filename = "./line268-fe-windows.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GSList = type { i8*, %struct._GSList* }
%struct._WINDOW_REC = type { i32, i8*, i32, i32, %struct._GSList*, %struct._WI_ITEM_REC*, %struct._SERVER_REC*, %struct._SERVER_REC*, i8*, i32, %struct._GSList*, i8, %struct.HISTORY_REC*, i8*, i32, i8*, i64, i64, i8*, i8*, i8* }
%struct._WI_ITEM_REC = type { i32, i32, %struct._GHashTable*, i8*, %struct._SERVER_REC*, i8*, i8*, i64, i32, i8*, void (%struct._WI_ITEM_REC*)*, i8* (%struct._WI_ITEM_REC*)* }
%struct._GHashTable = type opaque
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!226 = !DIEnumerator(name: "TXT_NOT_ENOUGH_PARAMS", value: 157)
!227 = !DIEnumerator(name: "TXT_NOT_CONNECTED", value: 158)
!228 = !DIEnumerator(name: "TXT_NOT_JOINED", value: 159)
!229 = !DIEnumerator(name: "TXT_CHAN_NOT_FOUND", value: 160)
!230 = !DIEnumerator(name: "TXT_CHAN_NOT_SYNCED", value: 161)
!231 = !DIEnumerator(name: "TXT_ILLEGAL_PROTO", value: 162)
!232 = !DIEnumerator(name: "TXT_NOT_GOOD_IDEA", value: 163)
!233 = !DIEnumerator(name: "TXT_INVALID_NUMBER", value: 164)
!234 = !DIEnumerator(name: "TXT_INVALID_TIME", value: 165)
!235 = !DIEnumerator(name: "TXT_INVALID_LEVEL", value: 166)
!236 = !DIEnumerator(name: "TXT_INVALID_SIZE", value: 167)
!237 = !DIEnumerator(name: "TXT_INVALID_CHARSET", value: 168)
!238 = !DIEnumerator(name: "TXT_INVALID_CHOICE", value: 169)
!239 = !DIEnumerator(name: "TXT_EVAL_MAX_RECURSE", value: 170)
!240 = !DIEnumerator(name: "TXT_PROGRAM_NOT_FOUND", value: 171)
!241 = !DIEnumerator(name: "TXT_NO_SERVER_DEFINED", value: 172)
!242 = !DIEnumerator(name: "TXT_FILL_11", value: 173)
!243 = !DIEnumerator(name: "TXT_THEME_SAVED", value: 174)
!244 = !DIEnumerator(name: "TXT_THEME_SAVE_FAILED", value: 175)
!245 = !DIEnumerator(name: "TXT_THEME_NOT_FOUND", value: 176)
!246 = !DIEnumerator(name: "TXT_THEME_CHANGED", value: 177)
!247 = !DIEnumerator(name: "TXT_WINDOW_THEME", value: 178)
!248 = !DIEnumerator(name: "TXT_WINDOW_THEME_DEFAULT", value: 179)
!249 = !DIEnumerator(name: "TXT_WINDOW_THEME_CHANGED", value: 180)
!250 = !DIEnumerator(name: "TXT_WINDOW_THEME_REMOVED", value: 181)
!251 = !DIEnumerator(name: "TXT_FORMAT_TITLE", value: 182)
!252 = !DIEnumerator(name: "TXT_FORMAT_SUBTITLE", value: 183)
!253 = !DIEnumerator(name: "TXT_FORMAT_ITEM", value: 184)
!254 = !DIEnumerator(name: "TXT_FILL_12", value: 185)
!255 = !DIEnumerator(name: "TXT_IGNORED", value: 186)
!256 = !DIEnumerator(name: "TXT_IGNORED_OPTIONS", value: 187)
!257 = !DIEnumerator(name: "TXT_UNIGNORED", value: 188)
!258 = !DIEnumerator(name: "TXT_IGNORE_NOT_FOUND", value: 189)
!259 = !DIEnumerator(name: "TXT_IGNORE_NO_IGNORES", value: 190)
!260 = !DIEnumerator(name: "TXT_IGNORE_HEADER", value: 191)
!261 = !DIEnumerator(name: "TXT_IGNORE_LINE", value: 192)
!262 = !DIEnumerator(name: "TXT_IGNORE_FOOTER", value: 193)
!263 = !DIEnumerator(name: "TXT_FILL_13", value: 194)
!264 = !DIEnumerator(name: "TXT_NOT_CHANNEL_OR_QUERY", value: 195)
!265 = !DIEnumerator(name: "TXT_CONVERSION_ADDED", value: 196)
!266 = !DIEnumerator(name: "TXT_CONVERSION_REMOVED", value: 197)
!267 = !DIEnumerator(name: "TXT_CONVERSION_NOT_FOUND", value: 198)
!268 = !DIEnumerator(name: "TXT_CONVERSION_NO_TRANSLITS", value: 199)
!269 = !DIEnumerator(name: "TXT_RECODE_HEADER", value: 200)
!270 = !DIEnumerator(name: "TXT_RECODE_LINE", value: 201)
!271 = !DIEnumerator(name: "TXT_FILL_14", value: 202)
!272 = !DIEnumerator(name: "TXT_UNKNOWN_CHAT_PROTOCOL", value: 203)
!273 = !DIEnumerator(name: "TXT_UNKNOWN_CHATNET", value: 204)
!274 = !DIEnumerator(name: "TXT_NOT_TOGGLE", value: 205)
!275 = !DIEnumerator(name: "TXT_PERL_ERROR", value: 206)
!276 = !DIEnumerator(name: "TXT_BIND_HEADER", value: 207)
!277 = !DIEnumerator(name: "TXT_BIND_LIST", value: 208)
!278 = !DIEnumerator(name: "TXT_BIND_COMMAND_LIST", value: 209)
!279 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!280 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!281 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!282 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!283 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!284 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!285 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!286 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!287 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!288 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!289 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!290 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!291 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!292 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!293 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!294 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!295 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!296 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!297 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!298 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!299 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!300 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!301 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!302 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!303 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!304 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!305 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!306 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!307 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!308 = !{!309, !329, !622, !331, !412, !632, !349, !334, !318, !722, !729, !736, !401, !472}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_REC", file: !311, line: 117, baseType: !312)
!311 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WINDOW_REC", file: !313, line: 28, size: 1280, align: 64, elements: !314)
!313 = !DIFile(filename: "fe-windows.h", directory: "/home/lichi/Desktop/irssi/task1")
!314 = !{!315, !317, !320, !321, !322, !333, !687, !688, !689, !690, !691, !692, !693, !694, !695, !714, !715, !716, !717, !718, !719, !720, !721}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "refnum", scope: !312, file: !313, line: 29, baseType: !316, size: 32, align: 32)
!316 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !313, line: 30, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !312, file: !313, line: 32, baseType: !316, size: 32, align: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !312, file: !313, line: 32, baseType: !316, size: 32, align: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !312, file: !313, line: 34, baseType: !323, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !325, line: 37, baseType: !326)
!325 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !325, line: 39, size: 128, align: 64, elements: !327)
!327 = !{!328, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !325, line: 41, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !330, line: 77, baseType: !331)
!330 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !325, line: 42, baseType: !323, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !312, file: !313, line: 35, baseType: !334, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "WI_ITEM_REC", file: !311, line: 108, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_WI_ITEM_REC", file: !337, line: 5, size: 704, align: 64, elements: !338)
!337 = !DIFile(filename: "../../../src/core/window-item-def.h", directory: "/home/lichi/Desktop/irssi/task1")
!338 = !{!339, !341, !342, !347, !348, !674, !675, !676, !677, !678, !679, !683}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !340, line: 3, baseType: !316, size: 32, align: 32)
!340 = !DIFile(filename: "../../../src/core/window-item-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !336, file: !340, line: 4, baseType: !316, size: 32, align: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !336, file: !340, line: 5, baseType: !343, size: 64, align: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !345, line: 37, baseType: !346)
!345 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !345, line: 37, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !336, file: !340, line: 7, baseType: !331, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "server", scope: !336, file: !340, line: 8, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !311, line: 107, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !352, line: 30, size: 2240, align: 64, elements: !353)
!352 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!353 = !{!354, !356, !357, !358, !581, !586, !587, !588, !589, !590, !591, !592, !593, !594, !598, !599, !603, !604, !605, !609, !610, !611, !612, !613, !614, !615, !616, !617, !624, !625, !626, !627, !628, !634, !638, !642, !646, !650, !655, !662, !669, !673}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !351, file: !355, line: 3, baseType: !316, size: 32, align: 32)
!355 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !351, file: !355, line: 4, baseType: !316, size: 32, align: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !351, file: !355, line: 6, baseType: !316, size: 32, align: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !351, file: !355, line: 8, baseType: !359, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !311, line: 113, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !352, line: 25, size: 1920, align: 64, elements: !362)
!362 = !{!363, !365, !366, !367, !368, !369, !370, !371, !372, !374, !375, !376, !377, !378, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !361, file: !364, line: 3, baseType: !316, size: 32, align: 32)
!364 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !361, file: !364, line: 4, baseType: !316, size: 32, align: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !361, file: !364, line: 6, baseType: !316, size: 32, align: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !361, file: !364, line: 9, baseType: !318, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !361, file: !364, line: 10, baseType: !316, size: 32, align: 32, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !361, file: !364, line: 11, baseType: !318, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !361, file: !364, line: 11, baseType: !318, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !361, file: !364, line: 11, baseType: !318, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !361, file: !364, line: 13, baseType: !373, size: 16, align: 16, offset: 448)
!373 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !361, file: !364, line: 14, baseType: !318, size: 64, align: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !361, file: !364, line: 15, baseType: !318, size: 64, align: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !361, file: !364, line: 16, baseType: !316, size: 32, align: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !361, file: !364, line: 17, baseType: !318, size: 64, align: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !361, file: !364, line: 19, baseType: !379, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !311, line: 99, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !311, line: 99, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !361, file: !364, line: 19, baseType: !379, size: 64, align: 64, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !361, file: !364, line: 21, baseType: !318, size: 64, align: 64, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !361, file: !364, line: 22, baseType: !318, size: 64, align: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !361, file: !364, line: 23, baseType: !318, size: 64, align: 64, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !361, file: !364, line: 24, baseType: !318, size: 64, align: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !361, file: !364, line: 26, baseType: !318, size: 64, align: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !361, file: !364, line: 27, baseType: !318, size: 64, align: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !361, file: !364, line: 28, baseType: !318, size: 64, align: 64, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !361, file: !364, line: 29, baseType: !318, size: 64, align: 64, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !361, file: !364, line: 30, baseType: !318, size: 64, align: 64, offset: 1408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !361, file: !364, line: 31, baseType: !318, size: 64, align: 64, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !361, file: !364, line: 32, baseType: !318, size: 64, align: 64, offset: 1536)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !361, file: !364, line: 33, baseType: !318, size: 64, align: 64, offset: 1600)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !361, file: !364, line: 35, baseType: !396, size: 64, align: 64, offset: 1664)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !399)
!399 = !{!400, !402, !538, !539, !544, !545, !546, !547, !548, !557, !558, !559, !563, !564, !565, !566, !567, !568, !569, !570}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !398, file: !4, line: 100, baseType: !401, size: 32, align: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !330, line: 49, baseType: !316)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !398, file: !4, line: 101, baseType: !403, size: 64, align: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !406)
!406 = !{!407, !431, !437, !444, !448, !525, !529, !534}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !405, file: !4, line: 133, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !396, !412, !414, !417, !418}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !330, line: 46, baseType: !319)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !415, line: 66, baseType: !416)
!415 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!416 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !421, line: 42, baseType: !422)
!421 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !421, line: 44, size: 128, align: 64, elements: !423)
!423 = !{!424, !429, !430}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !422, file: !421, line: 46, baseType: !425, size: 32, align: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !426, line: 36, baseType: !427)
!426 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !415, line: 45, baseType: !428)
!428 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !422, file: !421, line: 47, baseType: !401, size: 32, align: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !422, file: !421, line: 48, baseType: !412, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !405, file: !4, line: 138, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!411, !396, !435, !414, !417, !418}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !405, file: !4, line: 143, baseType: !438, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!411, !396, !441, !443, !418}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !415, line: 51, baseType: !442)
!442 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !405, file: !4, line: 147, baseType: !445, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!411, !396, !418}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !405, file: !4, line: 149, baseType: !449, size: 64, align: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !396, !524}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !455)
!455 = !{!456, !457, !478, !507, !509, !513, !514, !515, !516, !517, !518, !519, !520}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !454, file: !16, line: 174, baseType: !329, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !454, file: !16, line: 175, baseType: !458, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !461)
!461 = !{!462, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !460, file: !16, line: 198, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !329}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !460, file: !16, line: 199, baseType: !463, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !460, file: !16, line: 200, baseType: !468, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !329, !452, !471, !477}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !329}
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !330, line: 50, baseType: !401)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !454, file: !16, line: 177, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !483)
!483 = !{!484, !489, !493, !497, !501, !502}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !482, file: !16, line: 216, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!476, !452, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !482, file: !16, line: 218, baseType: !490, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{!476, !452}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !482, file: !16, line: 219, baseType: !494, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!476, !452, !472, !329}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !482, file: !16, line: 222, baseType: !498, size: 64, align: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !452}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !482, file: !16, line: 226, baseType: !472, size: 64, align: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !482, file: !16, line: 227, baseType: !503, size: 64, align: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{null}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !454, file: !16, line: 178, baseType: !508, size: 32, align: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !330, line: 55, baseType: !428)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !454, file: !16, line: 180, baseType: !510, size: 64, align: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !454, file: !16, line: 182, baseType: !401, size: 32, align: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !454, file: !16, line: 183, baseType: !508, size: 32, align: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !454, file: !16, line: 184, baseType: !508, size: 32, align: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !454, file: !16, line: 186, baseType: !323, size: 64, align: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !454, file: !16, line: 188, baseType: !452, size: 64, align: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !16, line: 189, baseType: !452, size: 64, align: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !454, file: !16, line: 191, baseType: !318, size: 64, align: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !454, file: !16, line: 193, baseType: !521, size: 64, align: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !523)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !405, file: !4, line: 151, baseType: !526, size: 64, align: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !396}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !405, file: !4, line: 152, baseType: !530, size: 64, align: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!411, !396, !533, !418}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !405, file: !4, line: 155, baseType: !535, size: 64, align: 64, offset: 448)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!533, !396}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !398, file: !4, line: 103, baseType: !412, size: 64, align: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !398, file: !4, line: 104, baseType: !540, size: 64, align: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !541, line: 77, baseType: !542)
!541 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !541, line: 77, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !398, file: !4, line: 105, baseType: !540, size: 64, align: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !398, file: !4, line: 106, baseType: !412, size: 64, align: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !398, file: !4, line: 107, baseType: !508, size: 32, align: 32, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !398, file: !4, line: 109, baseType: !414, size: 64, align: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !398, file: !4, line: 110, baseType: !549, size: 64, align: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !551, line: 39, baseType: !552)
!551 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !551, line: 41, size: 192, align: 64, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !552, file: !551, line: 43, baseType: !412, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !552, file: !551, line: 44, baseType: !414, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !552, file: !551, line: 45, baseType: !414, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !398, file: !4, line: 111, baseType: !549, size: 64, align: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !398, file: !4, line: 112, baseType: !549, size: 64, align: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !398, file: !4, line: 113, baseType: !560, size: 48, align: 8, offset: 704)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 48, align: 8, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 6)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !398, file: !4, line: 117, baseType: !508, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !398, file: !4, line: 118, baseType: !508, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !398, file: !4, line: 119, baseType: !508, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !398, file: !4, line: 120, baseType: !508, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !398, file: !4, line: 121, baseType: !508, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !398, file: !4, line: 122, baseType: !508, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !398, file: !4, line: 124, baseType: !329, size: 64, align: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !398, file: !4, line: 125, baseType: !329, size: 64, align: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !361, file: !364, line: 38, baseType: !428, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !361, file: !364, line: 39, baseType: !428, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !361, file: !364, line: 40, baseType: !428, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !361, file: !364, line: 41, baseType: !428, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !361, file: !364, line: 42, baseType: !428, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !361, file: !364, line: 43, baseType: !428, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !361, file: !364, line: 44, baseType: !428, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !361, file: !364, line: 45, baseType: !428, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !361, file: !364, line: 46, baseType: !318, size: 64, align: 64, offset: 1792)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !361, file: !364, line: 47, baseType: !318, size: 64, align: 64, offset: 1856)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !351, file: !355, line: 9, baseType: !582, size: 64, align: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !583, line: 75, baseType: !584)
!583 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !585, line: 139, baseType: !442)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!586 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !351, file: !355, line: 10, baseType: !582, size: 64, align: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !351, file: !355, line: 12, baseType: !318, size: 64, align: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !351, file: !355, line: 13, baseType: !318, size: 64, align: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !351, file: !355, line: 15, baseType: !428, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !351, file: !355, line: 16, baseType: !428, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !351, file: !355, line: 17, baseType: !428, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !351, file: !355, line: 18, baseType: !428, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !351, file: !355, line: 19, baseType: !428, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !351, file: !355, line: 21, baseType: !595, size: 64, align: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !311, line: 102, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !311, line: 102, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !351, file: !355, line: 22, baseType: !316, size: 32, align: 32, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !351, file: !355, line: 25, baseType: !600, size: 128, align: 64, offset: 640)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 128, align: 64, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 2)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !351, file: !355, line: 26, baseType: !316, size: 32, align: 32, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !351, file: !355, line: 27, baseType: !316, size: 32, align: 32, offset: 800)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !351, file: !355, line: 29, baseType: !606, size: 64, align: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !311, line: 103, baseType: !608)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !311, line: 103, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !351, file: !355, line: 30, baseType: !343, size: 64, align: 64, offset: 896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !351, file: !355, line: 32, baseType: !318, size: 64, align: 64, offset: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !351, file: !355, line: 33, baseType: !318, size: 64, align: 64, offset: 1024)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !351, file: !355, line: 34, baseType: !318, size: 64, align: 64, offset: 1088)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !351, file: !355, line: 35, baseType: !428, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !351, file: !355, line: 36, baseType: !428, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !351, file: !355, line: 37, baseType: !428, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !351, file: !355, line: 38, baseType: !428, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !351, file: !355, line: 40, baseType: !618, size: 128, align: 64, offset: 1216)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !330, line: 504, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !330, line: 506, size: 128, align: 64, elements: !620)
!620 = !{!621, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !619, file: !330, line: 508, baseType: !622, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !330, line: 48, baseType: !442)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !619, file: !330, line: 509, baseType: !622, size: 64, align: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !351, file: !355, line: 41, baseType: !582, size: 64, align: 64, offset: 1344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !351, file: !355, line: 42, baseType: !316, size: 32, align: 32, offset: 1408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !351, file: !355, line: 44, baseType: !323, size: 64, align: 64, offset: 1472)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !351, file: !355, line: 45, baseType: !323, size: 64, align: 64, offset: 1536)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !351, file: !355, line: 53, baseType: !629, size: 64, align: 64, offset: 1600)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !349, !632, !316}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !351, file: !355, line: 55, baseType: !635, size: 64, align: 64, offset: 1664)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!316, !349, !319}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !351, file: !355, line: 57, baseType: !639, size: 64, align: 64, offset: 1728)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!316, !349, !632}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !351, file: !355, line: 60, baseType: !643, size: 64, align: 64, offset: 1792)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!632, !349}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !351, file: !355, line: 62, baseType: !647, size: 64, align: 64, offset: 1856)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !349, !632, !632, !316}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !351, file: !355, line: 65, baseType: !651, size: 64, align: 64, offset: 1920)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !349, !632, !632}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !351, file: !355, line: 69, baseType: !656, size: 64, align: 64, offset: 1984)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !349, !632}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !311, line: 109, baseType: !661)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !311, line: 109, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !351, file: !355, line: 70, baseType: !663, size: 64, align: 64, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!666, !349, !632}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !311, line: 110, baseType: !668)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !311, line: 110, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !351, file: !355, line: 71, baseType: !670, size: 64, align: 64, offset: 2112)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!316, !632, !632}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !351, file: !355, line: 73, baseType: !670, size: 64, align: 64, offset: 2176)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "visible_name", scope: !336, file: !340, line: 9, baseType: !318, size: 64, align: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !336, file: !340, line: 10, baseType: !318, size: 64, align: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "createtime", scope: !336, file: !340, line: 11, baseType: !582, size: 64, align: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !336, file: !340, line: 12, baseType: !316, size: 32, align: 32, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !336, file: !340, line: 13, baseType: !318, size: 64, align: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !336, file: !340, line: 15, baseType: !680, size: 64, align: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !334}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "get_target", scope: !336, file: !340, line: 17, baseType: !684, size: 64, align: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!632, !334}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "active_server", scope: !312, file: !313, line: 36, baseType: !349, size: 64, align: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "connect_server", scope: !312, file: !313, line: 37, baseType: !349, size: 64, align: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !312, file: !313, line: 38, baseType: !318, size: 64, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !312, file: !313, line: 40, baseType: !316, size: 32, align: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bound_items", scope: !312, file: !313, line: 41, baseType: !323, size: 64, align: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "immortal", scope: !312, file: !313, line: 43, baseType: !428, size: 1, align: 32, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sticky_refnum", scope: !312, file: !313, line: 44, baseType: !428, size: 1, align: 32, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "destroying", scope: !312, file: !313, line: 45, baseType: !428, size: 1, align: 32, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !312, file: !313, line: 48, baseType: !696, size: 64, align: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "HISTORY_REC", file: !698, line: 14, baseType: !699)
!698 = !DIFile(filename: "command-history.h", directory: "/home/lichi/Desktop/irssi/task1")
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !698, line: 6, size: 256, align: 64, elements: !700)
!700 = !{!701, !702, !711, !712, !713}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !698, line: 7, baseType: !318, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !699, file: !698, line: 9, baseType: !703, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "GList", file: !705, line: 37, baseType: !706)
!705 = !DIFile(filename: "/usr/include/glib-2.0/glib/glist.h", directory: "/home/lichi/Desktop/irssi/task1")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GList", file: !705, line: 39, size: 192, align: 64, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !706, file: !705, line: 41, baseType: !329, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !705, line: 42, baseType: !703, size: 64, align: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !706, file: !705, line: 43, baseType: !703, size: 64, align: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !699, file: !698, line: 10, baseType: !316, size: 32, align: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !699, file: !698, line: 12, baseType: !316, size: 32, align: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "redo", scope: !699, file: !698, line: 13, baseType: !316, size: 1, align: 32, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "history_name", scope: !312, file: !313, line: 49, baseType: !318, size: 64, align: 64, offset: 768)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "data_level", scope: !312, file: !313, line: 51, baseType: !316, size: 32, align: 32, offset: 832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "hilight_color", scope: !312, file: !313, line: 52, baseType: !318, size: 64, align: 64, offset: 896)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !312, file: !313, line: 54, baseType: !582, size: 64, align: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "last_line", scope: !312, file: !313, line: 55, baseType: !582, size: 64, align: 64, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "theme_name", scope: !312, file: !313, line: 57, baseType: !318, size: 64, align: 64, offset: 1088)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "theme", scope: !312, file: !313, line: 58, baseType: !331, size: 64, align: 64, offset: 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !312, file: !313, line: 60, baseType: !331, size: 64, align: 64, offset: 1216)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW_BIND_REC", file: !313, line: 26, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 22, size: 192, align: 64, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "servertag", scope: !724, file: !313, line: 23, baseType: !318, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !313, line: 24, baseType: !318, size: 64, align: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sticky", scope: !724, file: !313, line: 25, baseType: !428, size: 1, align: 32, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !730, line: 9, baseType: !731)
!730 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !734, !734, !734, !734, !734, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCompareDataFunc", file: !330, line: 82, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!401, !740, !740, !329}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "gconstpointer", file: !330, line: 78, baseType: !734)
!741 = !{!742, !753, !754, !755, !756, !757, !762, !763, !764}
!742 = distinct !DIGlobalVariable(name: "cstep_size", scope: !743, file: !744, line: 702, type: !752, isLocal: true, isDefinition: true, variable: i32* @color_24bit_256.cstep_size)
!743 = distinct !DISubprogram(name: "color_24bit_256", scope: !744, file: !744, line: 700, type: !745, isLocal: false, isDefinition: true, scopeLine: 701, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!744 = !DIFile(filename: "fe-windows.c", directory: "/home/lichi/Desktop/irssi/task1")
!745 = !DISubroutineType(types: !746)
!746 = !{!747, !748}
!747 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!750 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!751 = !{}
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!753 = distinct !DIGlobalVariable(name: "cstep_start", scope: !743, file: !744, line: 703, type: !752, isLocal: true, isDefinition: true, variable: i32* @color_24bit_256.cstep_start)
!754 = distinct !DIGlobalVariable(name: "gstep_size", scope: !743, file: !744, line: 705, type: !752, isLocal: true, isDefinition: true, variable: i32* @color_24bit_256.gstep_size)
!755 = distinct !DIGlobalVariable(name: "gstep_start", scope: !743, file: !744, line: 706, type: !752, isLocal: true, isDefinition: true, variable: i32* @color_24bit_256.gstep_start)
!756 = distinct !DIGlobalVariable(name: "windows", scope: !0, file: !744, line: 36, type: !323, isLocal: false, isDefinition: true, variable: %struct._GSList** @windows)
!757 = distinct !DIGlobalVariable(name: "windows_seq", scope: !0, file: !744, line: 38, type: !758, isLocal: false, isDefinition: true, variable: %struct._GSequence** @windows_seq)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSequence", file: !760, line: 30, baseType: !761)
!760 = !DIFile(filename: "/usr/include/glib-2.0/glib/gsequence.h", directory: "/home/lichi/Desktop/irssi/task1")
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSequence", file: !760, line: 30, flags: DIFlagFwdDecl)
!762 = distinct !DIGlobalVariable(name: "active_win", scope: !0, file: !744, line: 39, type: !309, isLocal: false, isDefinition: true, variable: %struct._WINDOW_REC** @active_win)
!763 = distinct !DIGlobalVariable(name: "daytag", scope: !0, file: !744, line: 41, type: !316, isLocal: true, isDefinition: true, variable: i32* @daytag)
!764 = distinct !DIGlobalVariable(name: "daycheck", scope: !0, file: !744, line: 42, type: !316, isLocal: true, isDefinition: true, variable: i32* @daycheck)
!765 = !{i32 2, !"Dwarf Version", i32 4}
!766 = !{i32 2, !"Debug Info Version", i32 3}
!767 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!768 = distinct !DISubprogram(name: "window_create", scope: !744, file: !744, line: 120, type: !769, isLocal: false, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!769 = !DISubroutineType(types: !770)
!770 = !{!309, !334, !316}
!771 = !DILocalVariable(name: "item", arg: 1, scope: !768, file: !744, line: 120, type: !334)
!772 = !DIExpression()
!773 = !DILocation(line: 120, column: 40, scope: !768)
!774 = !DILocalVariable(name: "automatic", arg: 2, scope: !768, file: !744, line: 120, type: !316)
!775 = !DILocation(line: 120, column: 50, scope: !768)
!776 = !DILocalVariable(name: "rec", scope: !768, file: !744, line: 122, type: !309)
!777 = !DILocation(line: 122, column: 14, scope: !768)
!778 = !DILocation(line: 124, column: 24, scope: !768)
!779 = !DILocation(line: 124, column: 9, scope: !768)
!780 = !DILocation(line: 124, column: 6, scope: !768)
!781 = !DILocation(line: 125, column: 16, scope: !768)
!782 = !DILocation(line: 125, column: 2, scope: !768)
!783 = !DILocation(line: 125, column: 7, scope: !768)
!784 = !DILocation(line: 125, column: 14, scope: !768)
!785 = !DILocation(line: 126, column: 15, scope: !768)
!786 = !DILocation(line: 126, column: 2, scope: !768)
!787 = !DILocation(line: 126, column: 7, scope: !768)
!788 = !DILocation(line: 126, column: 13, scope: !768)
!789 = !DILocation(line: 128, column: 28, scope: !768)
!790 = !DILocation(line: 128, column: 37, scope: !768)
!791 = !DILocation(line: 128, column: 12, scope: !768)
!792 = !DILocation(line: 128, column: 10, scope: !768)
!793 = !DILocation(line: 129, column: 21, scope: !768)
!794 = !DILocation(line: 129, column: 2, scope: !768)
!795 = !DILocation(line: 130, column: 35, scope: !768)
!796 = !DILocation(line: 130, column: 61, scope: !768)
!797 = !DILocation(line: 130, column: 52, scope: !768)
!798 = !DILocation(line: 130, column: 41, scope: !768)
!799 = !DILocation(line: 130, column: 2, scope: !768)
!800 = !DILocation(line: 132, column: 6, scope: !801)
!801 = distinct !DILexicalBlock(scope: !768, file: !744, line: 132, column: 6)
!802 = !DILocation(line: 132, column: 11, scope: !801)
!803 = !DILocation(line: 132, column: 6, scope: !768)
!804 = !DILocation(line: 132, column: 35, scope: !805)
!805 = !DILexicalBlockFile(scope: !801, file: !744, discriminator: 1)
!806 = !DILocation(line: 132, column: 40, scope: !805)
!807 = !DILocation(line: 132, column: 46, scope: !805)
!808 = !DILocation(line: 132, column: 19, scope: !805)
!809 = !DILocation(line: 133, column: 6, scope: !810)
!810 = distinct !DILexicalBlock(scope: !768, file: !744, line: 133, column: 6)
!811 = !DILocation(line: 133, column: 15, scope: !810)
!812 = !DILocation(line: 133, column: 20, scope: !810)
!813 = !DILocation(line: 133, column: 27, scope: !810)
!814 = !DILocation(line: 133, column: 31, scope: !815)
!815 = !DILexicalBlockFile(scope: !810, file: !744, discriminator: 1)
!816 = !DILocation(line: 133, column: 41, scope: !815)
!817 = !DILocation(line: 133, column: 44, scope: !818)
!818 = !DILexicalBlockFile(scope: !810, file: !744, discriminator: 2)
!819 = !DILocation(line: 133, column: 6, scope: !818)
!820 = !DILocation(line: 134, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !822, file: !744, line: 134, column: 7)
!822 = distinct !DILexicalBlock(scope: !810, file: !744, line: 133, column: 85)
!823 = !DILocation(line: 134, column: 17, scope: !821)
!824 = !DILocation(line: 134, column: 20, scope: !825)
!825 = !DILexicalBlockFile(scope: !821, file: !744, discriminator: 1)
!826 = !DILocation(line: 134, column: 29, scope: !825)
!827 = !DILocation(line: 134, column: 34, scope: !825)
!828 = !DILocation(line: 134, column: 7, scope: !825)
!829 = !DILocation(line: 135, column: 47, scope: !821)
!830 = !DILocation(line: 135, column: 4, scope: !821)
!831 = !DILocation(line: 136, column: 21, scope: !822)
!832 = !DILocation(line: 136, column: 3, scope: !822)
!833 = !DILocation(line: 137, column: 2, scope: !822)
!834 = !DILocation(line: 138, column: 9, scope: !768)
!835 = !DILocation(line: 138, column: 2, scope: !768)
!836 = distinct !DISubprogram(name: "window_get_new_refnum", scope: !744, file: !744, line: 97, type: !837, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!837 = !DISubroutineType(types: !838)
!838 = !{!316}
!839 = !DILocalVariable(name: "win", scope: !836, file: !744, line: 99, type: !309)
!840 = !DILocation(line: 99, column: 14, scope: !836)
!841 = !DILocalVariable(name: "iter", scope: !836, file: !744, line: 100, type: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSequenceIter", file: !760, line: 31, baseType: !844)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSequenceNode", file: !760, line: 31, flags: DIFlagFwdDecl)
!845 = !DILocation(line: 100, column: 17, scope: !836)
!846 = !DILocalVariable(name: "end", scope: !836, file: !744, line: 100, type: !842)
!847 = !DILocation(line: 100, column: 24, scope: !836)
!848 = !DILocalVariable(name: "refnum", scope: !836, file: !744, line: 101, type: !316)
!849 = !DILocation(line: 101, column: 6, scope: !836)
!850 = !DILocation(line: 103, column: 9, scope: !836)
!851 = !DILocation(line: 104, column: 9, scope: !836)
!852 = !DILocation(line: 104, column: 7, scope: !836)
!853 = !DILocation(line: 105, column: 8, scope: !836)
!854 = !DILocation(line: 105, column: 6, scope: !836)
!855 = !DILocation(line: 107, column: 2, scope: !836)
!856 = !DILocation(line: 107, column: 9, scope: !857)
!857 = !DILexicalBlockFile(scope: !836, file: !744, discriminator: 1)
!858 = !DILocation(line: 107, column: 17, scope: !857)
!859 = !DILocation(line: 107, column: 14, scope: !857)
!860 = !DILocation(line: 107, column: 2, scope: !857)
!861 = !DILocation(line: 108, column: 24, scope: !862)
!862 = distinct !DILexicalBlock(scope: !836, file: !744, line: 107, column: 22)
!863 = !DILocation(line: 108, column: 9, scope: !862)
!864 = !DILocation(line: 108, column: 7, scope: !862)
!865 = !DILocation(line: 110, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !744, line: 110, column: 7)
!867 = !DILocation(line: 110, column: 17, scope: !866)
!868 = !DILocation(line: 110, column: 22, scope: !866)
!869 = !DILocation(line: 110, column: 14, scope: !866)
!870 = !DILocation(line: 110, column: 7, scope: !862)
!871 = !DILocation(line: 111, column: 11, scope: !866)
!872 = !DILocation(line: 111, column: 4, scope: !866)
!873 = !DILocation(line: 113, column: 9, scope: !862)
!874 = !DILocation(line: 114, column: 31, scope: !862)
!875 = !DILocation(line: 114, column: 10, scope: !862)
!876 = !DILocation(line: 114, column: 8, scope: !862)
!877 = !DILocation(line: 107, column: 2, scope: !878)
!878 = !DILexicalBlockFile(scope: !836, file: !744, discriminator: 2)
!879 = distinct !{!879, !855}
!880 = !DILocation(line: 117, column: 9, scope: !836)
!881 = !DILocation(line: 117, column: 2, scope: !836)
!882 = !DILocation(line: 118, column: 1, scope: !836)
!883 = distinct !DISubprogram(name: "windows_seq_insert", scope: !744, file: !744, line: 61, type: !884, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!884 = !DISubroutineType(types: !885)
!885 = !{!842, !309}
!886 = !DILocalVariable(name: "rec", arg: 1, scope: !883, file: !744, line: 61, type: !309)
!887 = !DILocation(line: 61, column: 54, scope: !883)
!888 = !DILocation(line: 63, column: 34, scope: !883)
!889 = !DILocation(line: 63, column: 47, scope: !883)
!890 = !DILocation(line: 63, column: 9, scope: !883)
!891 = !DILocation(line: 63, column: 2, scope: !883)
!892 = distinct !DISubprogram(name: "window_set_active", scope: !744, file: !744, line: 225, type: !893, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !309}
!895 = !DILocalVariable(name: "window", arg: 1, scope: !892, file: !744, line: 225, type: !309)
!896 = !DILocation(line: 225, column: 36, scope: !892)
!897 = !DILocalVariable(name: "old_window", scope: !892, file: !744, line: 227, type: !309)
!898 = !DILocation(line: 227, column: 14, scope: !892)
!899 = !DILocation(line: 229, column: 6, scope: !900)
!900 = distinct !DILexicalBlock(scope: !892, file: !744, line: 229, column: 6)
!901 = !DILocation(line: 229, column: 16, scope: !900)
!902 = !DILocation(line: 229, column: 13, scope: !900)
!903 = !DILocation(line: 229, column: 6, scope: !892)
!904 = !DILocation(line: 230, column: 3, scope: !900)
!905 = !DILocation(line: 232, column: 15, scope: !892)
!906 = !DILocation(line: 232, column: 13, scope: !892)
!907 = !DILocation(line: 233, column: 15, scope: !892)
!908 = !DILocation(line: 233, column: 13, scope: !892)
!909 = !DILocation(line: 234, column: 6, scope: !910)
!910 = distinct !DILexicalBlock(scope: !892, file: !744, line: 234, column: 6)
!911 = !DILocation(line: 234, column: 17, scope: !910)
!912 = !DILocation(line: 234, column: 6, scope: !892)
!913 = !DILocation(line: 235, column: 28, scope: !914)
!914 = distinct !DILexicalBlock(scope: !910, file: !744, line: 234, column: 25)
!915 = !DILocation(line: 235, column: 37, scope: !914)
!916 = !DILocation(line: 235, column: 13, scope: !914)
!917 = !DILocation(line: 235, column: 11, scope: !914)
!918 = !DILocation(line: 236, column: 29, scope: !914)
!919 = !DILocation(line: 236, column: 38, scope: !914)
!920 = !DILocation(line: 236, column: 13, scope: !914)
!921 = !DILocation(line: 236, column: 11, scope: !914)
!922 = !DILocation(line: 237, column: 2, scope: !914)
!923 = !DILocation(line: 239, column: 13, scope: !924)
!924 = distinct !DILexicalBlock(scope: !892, file: !744, line: 239, column: 13)
!925 = !DILocation(line: 239, column: 24, scope: !924)
!926 = !DILocation(line: 239, column: 13, scope: !892)
!927 = !DILocation(line: 240, column: 36, scope: !924)
!928 = !DILocation(line: 240, column: 48, scope: !924)
!929 = !DILocation(line: 240, column: 3, scope: !924)
!930 = !DILocation(line: 241, column: 1, scope: !892)
!931 = distinct !DISubprogram(name: "window_destroy", scope: !744, file: !744, line: 182, type: !893, isLocal: false, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!932 = !DILocalVariable(name: "window", arg: 1, scope: !931, file: !744, line: 182, type: !309)
!933 = !DILocation(line: 182, column: 33, scope: !931)
!934 = !DILocalVariable(name: "iter", scope: !931, file: !744, line: 184, type: !842)
!935 = !DILocation(line: 184, column: 17, scope: !931)
!936 = !DILocation(line: 185, column: 2, scope: !931)
!937 = distinct !{!937, !936}
!938 = !DILocation(line: 185, column: 10, scope: !939)
!939 = !DILexicalBlockFile(scope: !940, file: !744, discriminator: 1)
!940 = distinct !DILexicalBlock(scope: !941, file: !744, line: 185, column: 10)
!941 = distinct !DILexicalBlock(scope: !931, file: !744, line: 185, column: 4)
!942 = !DILocation(line: 185, column: 17, scope: !939)
!943 = !DILocation(line: 185, column: 5, scope: !944)
!944 = !DILexicalBlockFile(scope: !945, file: !744, discriminator: 2)
!945 = distinct !DILexicalBlock(scope: !940, file: !744, line: 185, column: 3)
!946 = !DILocation(line: 185, column: 14, scope: !947)
!947 = !DILexicalBlockFile(scope: !948, file: !744, discriminator: 3)
!948 = distinct !DILexicalBlock(scope: !940, file: !744, line: 185, column: 12)
!949 = !DILocation(line: 185, column: 101, scope: !947)
!950 = !DILocation(line: 185, column: 112, scope: !951)
!951 = !DILexicalBlockFile(scope: !941, file: !744, discriminator: 4)
!952 = !DILocation(line: 187, column: 6, scope: !953)
!953 = distinct !DILexicalBlock(scope: !931, file: !744, line: 187, column: 6)
!954 = !DILocation(line: 187, column: 14, scope: !953)
!955 = !DILocation(line: 187, column: 6, scope: !931)
!956 = !DILocation(line: 187, column: 26, scope: !957)
!957 = !DILexicalBlockFile(scope: !953, file: !744, discriminator: 1)
!958 = !DILocation(line: 188, column: 2, scope: !931)
!959 = !DILocation(line: 188, column: 10, scope: !931)
!960 = !DILocation(line: 188, column: 21, scope: !931)
!961 = !DILocation(line: 189, column: 27, scope: !931)
!962 = !DILocation(line: 189, column: 36, scope: !931)
!963 = !DILocation(line: 189, column: 12, scope: !931)
!964 = !DILocation(line: 189, column: 10, scope: !931)
!965 = !DILocation(line: 190, column: 35, scope: !931)
!966 = !DILocation(line: 190, column: 9, scope: !931)
!967 = !DILocation(line: 190, column: 7, scope: !931)
!968 = !DILocation(line: 191, column: 6, scope: !969)
!969 = distinct !DILexicalBlock(scope: !931, file: !744, line: 191, column: 6)
!970 = !DILocation(line: 191, column: 11, scope: !969)
!971 = !DILocation(line: 191, column: 6, scope: !931)
!972 = !DILocation(line: 191, column: 37, scope: !973)
!973 = !DILexicalBlockFile(scope: !969, file: !744, discriminator: 1)
!974 = !DILocation(line: 191, column: 19, scope: !973)
!975 = !DILocation(line: 193, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !931, file: !744, line: 193, column: 6)
!977 = !DILocation(line: 193, column: 20, scope: !976)
!978 = !DILocation(line: 193, column: 17, scope: !976)
!979 = !DILocation(line: 193, column: 6, scope: !931)
!980 = !DILocation(line: 194, column: 14, scope: !981)
!981 = distinct !DILexicalBlock(scope: !976, file: !744, line: 193, column: 28)
!982 = !DILocation(line: 195, column: 7, scope: !983)
!983 = distinct !DILexicalBlock(scope: !981, file: !744, line: 195, column: 7)
!984 = !DILocation(line: 195, column: 15, scope: !983)
!985 = !DILocation(line: 195, column: 7, scope: !981)
!986 = !DILocation(line: 196, column: 22, scope: !983)
!987 = !DILocation(line: 196, column: 31, scope: !983)
!988 = !DILocation(line: 196, column: 4, scope: !983)
!989 = !DILocation(line: 197, column: 2, scope: !981)
!990 = !DILocation(line: 199, column: 2, scope: !931)
!991 = !DILocation(line: 199, column: 9, scope: !992)
!992 = !DILexicalBlockFile(scope: !931, file: !744, discriminator: 1)
!993 = !DILocation(line: 199, column: 17, scope: !992)
!994 = !DILocation(line: 199, column: 23, scope: !992)
!995 = !DILocation(line: 199, column: 2, scope: !992)
!996 = !DILocation(line: 200, column: 23, scope: !931)
!997 = !DILocation(line: 200, column: 31, scope: !931)
!998 = !DILocation(line: 200, column: 38, scope: !931)
!999 = !DILocation(line: 200, column: 3, scope: !931)
!1000 = !DILocation(line: 199, column: 2, scope: !1001)
!1001 = !DILexicalBlockFile(scope: !931, file: !744, discriminator: 2)
!1002 = distinct !{!1002, !990}
!1003 = !DILocation(line: 202, column: 13, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !931, file: !744, line: 202, column: 13)
!1005 = !DILocation(line: 202, column: 13, scope: !931)
!1006 = !DILocation(line: 203, column: 16, scope: !1004)
!1007 = !DILocation(line: 203, column: 24, scope: !1004)
!1008 = !DILocation(line: 203, column: 3, scope: !1004)
!1009 = !DILocation(line: 205, column: 37, scope: !931)
!1010 = !DILocation(line: 205, column: 2, scope: !931)
!1011 = !DILocation(line: 207, column: 2, scope: !931)
!1012 = !DILocation(line: 207, column: 9, scope: !992)
!1013 = !DILocation(line: 207, column: 17, scope: !992)
!1014 = !DILocation(line: 207, column: 29, scope: !992)
!1015 = !DILocation(line: 207, column: 2, scope: !992)
!1016 = !DILocation(line: 208, column: 37, scope: !931)
!1017 = !DILocation(line: 208, column: 45, scope: !931)
!1018 = !DILocation(line: 208, column: 53, scope: !931)
!1019 = !DILocation(line: 208, column: 66, scope: !931)
!1020 = !DILocation(line: 208, column: 17, scope: !931)
!1021 = !DILocation(line: 207, column: 2, scope: !1001)
!1022 = distinct !{!1022, !1011}
!1023 = !DILocation(line: 210, column: 9, scope: !931)
!1024 = !DILocation(line: 210, column: 17, scope: !931)
!1025 = !DILocation(line: 210, column: 2, scope: !931)
!1026 = !DILocation(line: 211, column: 9, scope: !931)
!1027 = !DILocation(line: 211, column: 17, scope: !931)
!1028 = !DILocation(line: 211, column: 2, scope: !931)
!1029 = !DILocation(line: 212, column: 9, scope: !931)
!1030 = !DILocation(line: 212, column: 17, scope: !931)
!1031 = !DILocation(line: 212, column: 2, scope: !931)
!1032 = !DILocation(line: 213, column: 9, scope: !931)
!1033 = !DILocation(line: 213, column: 17, scope: !931)
!1034 = !DILocation(line: 213, column: 2, scope: !931)
!1035 = !DILocation(line: 214, column: 9, scope: !931)
!1036 = !DILocation(line: 214, column: 2, scope: !931)
!1037 = !DILocation(line: 215, column: 1, scope: !931)
!1038 = !DILocation(line: 215, column: 1, scope: !992)
!1039 = distinct !DISubprogram(name: "windows_seq_window_lookup", scope: !744, file: !744, line: 76, type: !884, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1040 = !DILocalVariable(name: "rec", arg: 1, scope: !1039, file: !744, line: 76, type: !309)
!1041 = !DILocation(line: 76, column: 61, scope: !1039)
!1042 = !DILocation(line: 78, column: 27, scope: !1039)
!1043 = !DILocation(line: 78, column: 40, scope: !1039)
!1044 = !DILocation(line: 78, column: 9, scope: !1039)
!1045 = !DILocation(line: 78, column: 2, scope: !1039)
!1046 = distinct !DISubprogram(name: "windows_pack", scope: !744, file: !744, line: 157, type: !1047, isLocal: true, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !316}
!1049 = !DILocalVariable(name: "removed_refnum", arg: 1, scope: !1046, file: !744, line: 157, type: !316)
!1050 = !DILocation(line: 157, column: 30, scope: !1046)
!1051 = !DILocalVariable(name: "window", scope: !1046, file: !744, line: 159, type: !309)
!1052 = !DILocation(line: 159, column: 14, scope: !1046)
!1053 = !DILocalVariable(name: "refnum", scope: !1046, file: !744, line: 160, type: !316)
!1054 = !DILocation(line: 160, column: 6, scope: !1046)
!1055 = !DILocalVariable(name: "iter", scope: !1046, file: !744, line: 161, type: !842)
!1056 = !DILocation(line: 161, column: 17, scope: !1046)
!1057 = !DILocalVariable(name: "end", scope: !1046, file: !744, line: 161, type: !842)
!1058 = !DILocation(line: 161, column: 24, scope: !1046)
!1059 = !DILocation(line: 163, column: 11, scope: !1046)
!1060 = !DILocation(line: 163, column: 26, scope: !1046)
!1061 = !DILocation(line: 163, column: 9, scope: !1046)
!1062 = !DILocation(line: 164, column: 8, scope: !1046)
!1063 = !DILocation(line: 164, column: 6, scope: !1046)
!1064 = !DILocation(line: 165, column: 35, scope: !1046)
!1065 = !DILocation(line: 165, column: 9, scope: !1046)
!1066 = !DILocation(line: 165, column: 7, scope: !1046)
!1067 = !DILocation(line: 166, column: 6, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1046, file: !744, line: 166, column: 6)
!1069 = !DILocation(line: 166, column: 11, scope: !1068)
!1070 = !DILocation(line: 166, column: 6, scope: !1046)
!1071 = !DILocation(line: 166, column: 19, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1068, file: !744, discriminator: 1)
!1073 = !DILocation(line: 168, column: 2, scope: !1046)
!1074 = !DILocation(line: 168, column: 9, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1046, file: !744, discriminator: 1)
!1076 = !DILocation(line: 168, column: 17, scope: !1075)
!1077 = !DILocation(line: 168, column: 14, scope: !1075)
!1078 = !DILocation(line: 168, column: 2, scope: !1075)
!1079 = !DILocation(line: 169, column: 27, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1046, file: !744, line: 168, column: 22)
!1081 = !DILocation(line: 169, column: 12, scope: !1080)
!1082 = !DILocation(line: 169, column: 10, scope: !1080)
!1083 = !DILocation(line: 171, column: 7, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !744, line: 171, column: 7)
!1085 = !DILocation(line: 171, column: 14, scope: !1084)
!1086 = !DILocation(line: 171, column: 21, scope: !1084)
!1087 = !DILocation(line: 171, column: 24, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !1084, file: !744, discriminator: 1)
!1089 = !DILocation(line: 171, column: 32, scope: !1088)
!1090 = !DILocation(line: 171, column: 46, scope: !1088)
!1091 = !DILocation(line: 171, column: 49, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1084, file: !744, discriminator: 2)
!1093 = !DILocation(line: 171, column: 57, scope: !1092)
!1094 = !DILocation(line: 171, column: 67, scope: !1092)
!1095 = !DILocation(line: 171, column: 64, scope: !1092)
!1096 = !DILocation(line: 171, column: 7, scope: !1092)
!1097 = !DILocation(line: 172, column: 4, scope: !1084)
!1098 = !DILocation(line: 174, column: 22, scope: !1080)
!1099 = !DILocation(line: 174, column: 30, scope: !1080)
!1100 = !DILocation(line: 174, column: 37, scope: !1080)
!1101 = !DILocation(line: 174, column: 3, scope: !1080)
!1102 = !DILocation(line: 175, column: 23, scope: !1080)
!1103 = !DILocation(line: 175, column: 3, scope: !1080)
!1104 = !DILocation(line: 177, column: 9, scope: !1080)
!1105 = !DILocation(line: 178, column: 31, scope: !1080)
!1106 = !DILocation(line: 178, column: 10, scope: !1080)
!1107 = !DILocation(line: 178, column: 8, scope: !1080)
!1108 = !DILocation(line: 168, column: 2, scope: !1109)
!1109 = !DILexicalBlockFile(scope: !1046, file: !744, discriminator: 2)
!1110 = distinct !{!1110, !1073}
!1111 = !DILocation(line: 180, column: 1, scope: !1046)
!1112 = distinct !DISubprogram(name: "window_bind_destroy", scope: !744, file: !744, line: 599, type: !1113, isLocal: false, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !309, !722}
!1115 = !DILocalVariable(name: "window", arg: 1, scope: !1112, file: !744, line: 599, type: !309)
!1116 = !DILocation(line: 599, column: 38, scope: !1112)
!1117 = !DILocalVariable(name: "rec", arg: 2, scope: !1112, file: !744, line: 599, type: !722)
!1118 = !DILocation(line: 599, column: 63, scope: !1112)
!1119 = !DILocation(line: 601, column: 2, scope: !1112)
!1120 = distinct !{!1120, !1119}
!1121 = !DILocation(line: 601, column: 10, scope: !1122)
!1122 = !DILexicalBlockFile(scope: !1123, file: !744, discriminator: 1)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !744, line: 601, column: 10)
!1124 = distinct !DILexicalBlock(scope: !1112, file: !744, line: 601, column: 4)
!1125 = !DILocation(line: 601, column: 17, scope: !1122)
!1126 = !DILocation(line: 601, column: 5, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1128, file: !744, discriminator: 2)
!1128 = distinct !DILexicalBlock(scope: !1123, file: !744, line: 601, column: 3)
!1129 = !DILocation(line: 601, column: 14, scope: !1130)
!1130 = !DILexicalBlockFile(scope: !1131, file: !744, discriminator: 3)
!1131 = distinct !DILexicalBlock(scope: !1123, file: !744, line: 601, column: 12)
!1132 = !DILocation(line: 601, column: 101, scope: !1130)
!1133 = !DILocation(line: 601, column: 112, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1124, file: !744, discriminator: 4)
!1135 = !DILocation(line: 602, column: 9, scope: !1112)
!1136 = distinct !{!1136, !1135}
!1137 = !DILocation(line: 602, column: 17, scope: !1138)
!1138 = !DILexicalBlockFile(scope: !1139, file: !744, discriminator: 1)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !744, line: 602, column: 17)
!1140 = distinct !DILexicalBlock(scope: !1112, file: !744, line: 602, column: 11)
!1141 = !DILocation(line: 602, column: 21, scope: !1138)
!1142 = !DILocation(line: 602, column: 12, scope: !1143)
!1143 = !DILexicalBlockFile(scope: !1144, file: !744, discriminator: 2)
!1144 = distinct !DILexicalBlock(scope: !1139, file: !744, line: 602, column: 10)
!1145 = !DILocation(line: 602, column: 21, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1147, file: !744, discriminator: 3)
!1147 = distinct !DILexicalBlock(scope: !1139, file: !744, line: 602, column: 19)
!1148 = !DILocation(line: 602, column: 105, scope: !1146)
!1149 = !DILocation(line: 602, column: 116, scope: !1150)
!1150 = !DILexicalBlockFile(scope: !1140, file: !744, discriminator: 4)
!1151 = !DILocation(line: 604, column: 39, scope: !1112)
!1152 = !DILocation(line: 604, column: 47, scope: !1112)
!1153 = !DILocation(line: 604, column: 60, scope: !1112)
!1154 = !DILocation(line: 604, column: 24, scope: !1112)
!1155 = !DILocation(line: 604, column: 2, scope: !1112)
!1156 = !DILocation(line: 604, column: 10, scope: !1112)
!1157 = !DILocation(line: 604, column: 22, scope: !1112)
!1158 = !DILocation(line: 606, column: 16, scope: !1112)
!1159 = !DILocation(line: 606, column: 21, scope: !1112)
!1160 = !DILocation(line: 606, column: 9, scope: !1112)
!1161 = !DILocation(line: 607, column: 16, scope: !1112)
!1162 = !DILocation(line: 607, column: 21, scope: !1112)
!1163 = !DILocation(line: 607, column: 9, scope: !1112)
!1164 = !DILocation(line: 608, column: 16, scope: !1112)
!1165 = !DILocation(line: 608, column: 9, scope: !1112)
!1166 = !DILocation(line: 609, column: 1, scope: !1112)
!1167 = !DILocation(line: 609, column: 1, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1112, file: !744, discriminator: 1)
!1169 = distinct !DISubprogram(name: "window_auto_destroy", scope: !744, file: !744, line: 217, type: !893, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1170 = !DILocalVariable(name: "window", arg: 1, scope: !1169, file: !744, line: 217, type: !309)
!1171 = !DILocation(line: 217, column: 38, scope: !1169)
!1172 = !DILocation(line: 219, column: 6, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !744, line: 219, column: 6)
!1174 = !DILocation(line: 219, column: 45, scope: !1173)
!1175 = !DILocation(line: 219, column: 48, scope: !1176)
!1176 = !DILexicalBlockFile(scope: !1173, file: !744, discriminator: 1)
!1177 = !DILocation(line: 219, column: 57, scope: !1176)
!1178 = !DILocation(line: 219, column: 62, scope: !1176)
!1179 = !DILocation(line: 219, column: 69, scope: !1176)
!1180 = !DILocation(line: 220, column: 6, scope: !1173)
!1181 = !DILocation(line: 220, column: 14, scope: !1173)
!1182 = !DILocation(line: 220, column: 20, scope: !1173)
!1183 = !DILocation(line: 220, column: 27, scope: !1173)
!1184 = !DILocation(line: 220, column: 30, scope: !1176)
!1185 = !DILocation(line: 220, column: 38, scope: !1176)
!1186 = !DILocation(line: 220, column: 50, scope: !1176)
!1187 = !DILocation(line: 220, column: 58, scope: !1176)
!1188 = !DILocation(line: 221, column: 6, scope: !1173)
!1189 = !DILocation(line: 221, column: 14, scope: !1173)
!1190 = !DILocation(line: 221, column: 20, scope: !1173)
!1191 = !DILocation(line: 221, column: 25, scope: !1173)
!1192 = !DILocation(line: 221, column: 29, scope: !1176)
!1193 = !DILocation(line: 221, column: 37, scope: !1176)
!1194 = !DILocation(line: 219, column: 6, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1169, file: !744, discriminator: 2)
!1196 = !DILocation(line: 222, column: 32, scope: !1173)
!1197 = !DILocation(line: 222, column: 17, scope: !1173)
!1198 = !DILocation(line: 223, column: 1, scope: !1169)
!1199 = distinct !DISubprogram(name: "window_change_server", scope: !744, file: !744, line: 243, type: !1200, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !309, !331}
!1202 = !DILocalVariable(name: "window", arg: 1, scope: !1199, file: !744, line: 243, type: !309)
!1203 = !DILocation(line: 243, column: 39, scope: !1199)
!1204 = !DILocalVariable(name: "server", arg: 2, scope: !1199, file: !744, line: 243, type: !331)
!1205 = !DILocation(line: 243, column: 53, scope: !1199)
!1206 = !DILocalVariable(name: "active", scope: !1199, file: !744, line: 245, type: !349)
!1207 = !DILocation(line: 245, column: 14, scope: !1199)
!1208 = !DILocalVariable(name: "connect", scope: !1199, file: !744, line: 245, type: !349)
!1209 = !DILocation(line: 245, column: 23, scope: !1199)
!1210 = !DILocation(line: 247, column: 6, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1199, file: !744, line: 247, column: 6)
!1212 = !DILocation(line: 247, column: 13, scope: !1211)
!1213 = !DILocation(line: 247, column: 20, scope: !1211)
!1214 = !DILocation(line: 247, column: 57, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1211, file: !744, discriminator: 1)
!1216 = !DILocation(line: 247, column: 39, scope: !1215)
!1217 = !DILocation(line: 247, column: 24, scope: !1215)
!1218 = !DILocation(line: 247, column: 37, scope: !1215)
!1219 = !DILocation(line: 247, column: 23, scope: !1215)
!1220 = !DILocation(line: 247, column: 6, scope: !1215)
!1221 = !DILocation(line: 248, column: 3, scope: !1211)
!1222 = !DILocation(line: 250, column: 6, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1199, file: !744, line: 250, column: 6)
!1224 = !DILocation(line: 250, column: 13, scope: !1223)
!1225 = !DILocation(line: 250, column: 6, scope: !1199)
!1226 = !DILocation(line: 251, column: 20, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !744, line: 250, column: 21)
!1228 = !DILocation(line: 251, column: 10, scope: !1227)
!1229 = !DILocation(line: 252, column: 2, scope: !1227)
!1230 = !DILocation(line: 252, column: 26, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1232, file: !744, discriminator: 1)
!1232 = distinct !DILexicalBlock(scope: !1223, file: !744, line: 252, column: 13)
!1233 = !DILocation(line: 252, column: 35, scope: !1231)
!1234 = !DILocation(line: 252, column: 13, scope: !1231)
!1235 = !DILocation(line: 252, column: 43, scope: !1231)
!1236 = !DILocation(line: 253, column: 12, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1232, file: !744, line: 252, column: 51)
!1238 = !DILocation(line: 253, column: 10, scope: !1237)
!1239 = !DILocation(line: 254, column: 11, scope: !1237)
!1240 = !DILocation(line: 255, column: 2, scope: !1237)
!1241 = !DILocation(line: 256, column: 10, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1232, file: !744, line: 255, column: 9)
!1243 = !DILocation(line: 257, column: 13, scope: !1242)
!1244 = !DILocation(line: 257, column: 11, scope: !1242)
!1245 = !DILocation(line: 260, column: 6, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1199, file: !744, line: 260, column: 6)
!1247 = !DILocation(line: 260, column: 14, scope: !1246)
!1248 = !DILocation(line: 260, column: 32, scope: !1246)
!1249 = !DILocation(line: 260, column: 29, scope: !1246)
!1250 = !DILocation(line: 260, column: 6, scope: !1199)
!1251 = !DILocation(line: 261, column: 28, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1246, file: !744, line: 260, column: 41)
!1253 = !DILocation(line: 261, column: 3, scope: !1252)
!1254 = !DILocation(line: 261, column: 11, scope: !1252)
!1255 = !DILocation(line: 261, column: 26, scope: !1252)
!1256 = !DILocation(line: 262, column: 44, scope: !1252)
!1257 = !DILocation(line: 262, column: 52, scope: !1252)
!1258 = !DILocation(line: 262, column: 3, scope: !1252)
!1259 = !DILocation(line: 263, column: 2, scope: !1252)
!1260 = !DILocation(line: 265, column: 6, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1199, file: !744, line: 265, column: 6)
!1262 = !DILocation(line: 265, column: 14, scope: !1261)
!1263 = !DILocation(line: 265, column: 31, scope: !1261)
!1264 = !DILocation(line: 265, column: 28, scope: !1261)
!1265 = !DILocation(line: 265, column: 6, scope: !1199)
!1266 = !DILocation(line: 266, column: 27, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1261, file: !744, line: 265, column: 39)
!1268 = !DILocation(line: 266, column: 3, scope: !1267)
!1269 = !DILocation(line: 266, column: 11, scope: !1267)
!1270 = !DILocation(line: 266, column: 25, scope: !1267)
!1271 = !DILocation(line: 267, column: 43, scope: !1267)
!1272 = !DILocation(line: 267, column: 51, scope: !1267)
!1273 = !DILocation(line: 267, column: 3, scope: !1267)
!1274 = !DILocation(line: 268, column: 2, scope: !1267)
!1275 = !DILocation(line: 269, column: 1, scope: !1199)
!1276 = distinct !DISubprogram(name: "window_set_refnum", scope: !744, file: !744, line: 271, type: !1277, isLocal: false, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !309, !316}
!1279 = !DILocalVariable(name: "window", arg: 1, scope: !1276, file: !744, line: 271, type: !309)
!1280 = !DILocation(line: 271, column: 36, scope: !1276)
!1281 = !DILocalVariable(name: "refnum", arg: 2, scope: !1276, file: !744, line: 271, type: !316)
!1282 = !DILocation(line: 271, column: 48, scope: !1276)
!1283 = !DILocalVariable(name: "other_iter", scope: !1276, file: !744, line: 273, type: !842)
!1284 = !DILocation(line: 273, column: 17, scope: !1276)
!1285 = !DILocalVariable(name: "window_iter", scope: !1276, file: !744, line: 273, type: !842)
!1286 = !DILocation(line: 273, column: 30, scope: !1276)
!1287 = !DILocalVariable(name: "old_refnum", scope: !1276, file: !744, line: 274, type: !316)
!1288 = !DILocation(line: 274, column: 6, scope: !1276)
!1289 = !DILocation(line: 276, column: 2, scope: !1276)
!1290 = distinct !{!1290, !1289}
!1291 = !DILocation(line: 276, column: 10, scope: !1292)
!1292 = !DILexicalBlockFile(scope: !1293, file: !744, discriminator: 1)
!1293 = distinct !DILexicalBlock(scope: !1294, file: !744, line: 276, column: 10)
!1294 = distinct !DILexicalBlock(scope: !1276, file: !744, line: 276, column: 4)
!1295 = !DILocation(line: 276, column: 17, scope: !1292)
!1296 = !DILocation(line: 276, column: 5, scope: !1297)
!1297 = !DILexicalBlockFile(scope: !1298, file: !744, discriminator: 2)
!1298 = distinct !DILexicalBlock(scope: !1293, file: !744, line: 276, column: 3)
!1299 = !DILocation(line: 276, column: 14, scope: !1300)
!1300 = !DILexicalBlockFile(scope: !1301, file: !744, discriminator: 3)
!1301 = distinct !DILexicalBlock(scope: !1293, file: !744, line: 276, column: 12)
!1302 = !DILocation(line: 276, column: 101, scope: !1300)
!1303 = !DILocation(line: 276, column: 112, scope: !1304)
!1304 = !DILexicalBlockFile(scope: !1294, file: !744, discriminator: 4)
!1305 = !DILocation(line: 277, column: 2, scope: !1276)
!1306 = distinct !{!1306, !1305}
!1307 = !DILocation(line: 277, column: 10, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1309, file: !744, discriminator: 1)
!1309 = distinct !DILexicalBlock(scope: !1310, file: !744, line: 277, column: 10)
!1310 = distinct !DILexicalBlock(scope: !1276, file: !744, line: 277, column: 4)
!1311 = !DILocation(line: 277, column: 17, scope: !1308)
!1312 = !DILocation(line: 277, column: 25, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1314, file: !744, discriminator: 2)
!1314 = distinct !DILexicalBlock(scope: !1309, file: !744, line: 277, column: 23)
!1315 = !DILocation(line: 277, column: 34, scope: !1316)
!1316 = !DILexicalBlockFile(scope: !1317, file: !744, discriminator: 3)
!1317 = distinct !DILexicalBlock(scope: !1309, file: !744, line: 277, column: 32)
!1318 = !DILocation(line: 277, column: 118, scope: !1316)
!1319 = !DILocation(line: 277, column: 129, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1310, file: !744, discriminator: 4)
!1321 = !DILocation(line: 278, column: 6, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1276, file: !744, line: 278, column: 6)
!1323 = !DILocation(line: 278, column: 14, scope: !1322)
!1324 = !DILocation(line: 278, column: 24, scope: !1322)
!1325 = !DILocation(line: 278, column: 21, scope: !1322)
!1326 = !DILocation(line: 278, column: 6, scope: !1276)
!1327 = !DILocation(line: 278, column: 32, scope: !1328)
!1328 = !DILexicalBlockFile(scope: !1322, file: !744, discriminator: 1)
!1329 = !DILocation(line: 280, column: 41, scope: !1276)
!1330 = !DILocation(line: 280, column: 15, scope: !1276)
!1331 = !DILocation(line: 280, column: 13, scope: !1276)
!1332 = !DILocation(line: 281, column: 42, scope: !1276)
!1333 = !DILocation(line: 281, column: 50, scope: !1276)
!1334 = !DILocation(line: 281, column: 16, scope: !1276)
!1335 = !DILocation(line: 281, column: 14, scope: !1276)
!1336 = !DILocation(line: 283, column: 6, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1276, file: !744, line: 283, column: 6)
!1338 = !DILocation(line: 283, column: 17, scope: !1337)
!1339 = !DILocation(line: 283, column: 6, scope: !1276)
!1340 = !DILocalVariable(name: "rec", scope: !1341, file: !744, line: 284, type: !309)
!1341 = distinct !DILexicalBlock(scope: !1337, file: !744, line: 283, column: 25)
!1342 = !DILocation(line: 284, column: 15, scope: !1341)
!1343 = !DILocation(line: 284, column: 36, scope: !1341)
!1344 = !DILocation(line: 284, column: 21, scope: !1341)
!1345 = !DILocation(line: 286, column: 17, scope: !1341)
!1346 = !DILocation(line: 286, column: 25, scope: !1341)
!1347 = !DILocation(line: 286, column: 3, scope: !1341)
!1348 = !DILocation(line: 286, column: 8, scope: !1341)
!1349 = !DILocation(line: 286, column: 15, scope: !1341)
!1350 = !DILocation(line: 287, column: 43, scope: !1341)
!1351 = !DILocation(line: 287, column: 69, scope: !1341)
!1352 = !DILocation(line: 287, column: 60, scope: !1341)
!1353 = !DILocation(line: 287, column: 49, scope: !1341)
!1354 = !DILocation(line: 287, column: 3, scope: !1341)
!1355 = !DILocation(line: 288, column: 2, scope: !1341)
!1356 = !DILocation(line: 290, column: 15, scope: !1276)
!1357 = !DILocation(line: 290, column: 23, scope: !1276)
!1358 = !DILocation(line: 290, column: 13, scope: !1276)
!1359 = !DILocation(line: 291, column: 19, scope: !1276)
!1360 = !DILocation(line: 291, column: 2, scope: !1276)
!1361 = !DILocation(line: 291, column: 10, scope: !1276)
!1362 = !DILocation(line: 291, column: 17, scope: !1276)
!1363 = !DILocation(line: 292, column: 42, scope: !1276)
!1364 = !DILocation(line: 292, column: 71, scope: !1276)
!1365 = !DILocation(line: 292, column: 62, scope: !1276)
!1366 = !DILocation(line: 292, column: 51, scope: !1276)
!1367 = !DILocation(line: 292, column: 2, scope: !1276)
!1368 = !DILocation(line: 294, column: 6, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1276, file: !744, line: 294, column: 6)
!1370 = !DILocation(line: 294, column: 18, scope: !1369)
!1371 = !DILocation(line: 294, column: 25, scope: !1369)
!1372 = !DILocation(line: 294, column: 28, scope: !1373)
!1373 = !DILexicalBlockFile(scope: !1369, file: !744, discriminator: 1)
!1374 = !DILocation(line: 294, column: 39, scope: !1373)
!1375 = !DILocation(line: 294, column: 6, scope: !1373)
!1376 = !DILocation(line: 295, column: 19, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1369, file: !744, line: 294, column: 48)
!1378 = !DILocation(line: 295, column: 31, scope: !1377)
!1379 = !DILocation(line: 295, column: 3, scope: !1377)
!1380 = !DILocation(line: 296, column: 2, scope: !1377)
!1381 = !DILocation(line: 297, column: 23, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1369, file: !744, line: 296, column: 9)
!1383 = !DILocation(line: 297, column: 3, scope: !1382)
!1384 = !DILocation(line: 299, column: 1, scope: !1276)
!1385 = distinct !DISubprogram(name: "windows_seq_refnum_lookup", scope: !744, file: !744, line: 66, type: !1386, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!842, !316}
!1388 = !DILocalVariable(name: "refnum", arg: 1, scope: !1385, file: !744, line: 66, type: !316)
!1389 = !DILocation(line: 66, column: 53, scope: !1385)
!1390 = !DILocation(line: 68, column: 27, scope: !1385)
!1391 = !DILocation(line: 68, column: 61, scope: !1385)
!1392 = !DILocation(line: 68, column: 52, scope: !1385)
!1393 = !DILocation(line: 68, column: 41, scope: !1385)
!1394 = !DILocation(line: 68, column: 9, scope: !1385)
!1395 = !DILocation(line: 68, column: 2, scope: !1385)
!1396 = distinct !DISubprogram(name: "windows_seq_changed", scope: !744, file: !744, line: 71, type: !1397, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !842}
!1399 = !DILocalVariable(name: "iter", arg: 1, scope: !1396, file: !744, line: 71, type: !842)
!1400 = !DILocation(line: 71, column: 48, scope: !1396)
!1401 = !DILocation(line: 73, column: 26, scope: !1396)
!1402 = !DILocation(line: 73, column: 2, scope: !1396)
!1403 = !DILocation(line: 74, column: 1, scope: !1396)
!1404 = distinct !DISubprogram(name: "window_set_name", scope: !744, file: !744, line: 301, type: !1405, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !751)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !309, !632}
!1407 = !DILocalVariable(name: "window", arg: 1, scope: !1404, file: !744, line: 301, type: !309)
!1408 = !DILocation(line: 301, column: 34, scope: !1404)
!1409 = !DILocalVariable(name: "name", arg: 2, scope: !1404, file: !744, line: 301, type: !632)
!1410 = !DILocation(line: 301, column: 54, scope: !1404)
!1411 = !DILocation(line: 303, column: 9, scope: !1404)
!1412 = !DILocation(line: 303, column: 17, scope: !1404)
!1413 = !DILocation(line: 303, column: 2, scope: !1404)
!1414 = !DILocation(line: 304, column: 17, scope: !1404)
!1415 = !DILocation(line: 304, column: 22, scope: !1404)
!1416 = !DILocation(line: 304, column: 29, scope: !1404)
!1417 = !DILocation(line: 304, column: 33, scope: !1418)
!1418 = !DILexicalBlockFile(scope: !1404, file: !744, discriminator: 1)
!1419 = !DILocation(line: 304, column: 32, scope: !1418)
!1420 = !DILocation(line: 304, column: 38, scope: !1418)
!1421 = !DILocation(line: 304, column: 17, scope: !1418)
!1422 = !DILocation(line: 304, column: 17, scope: !1423)
!1423 = !DILexicalBlockFile(scope: !1404, file: !744, discriminator: 2)
!1424 = !DILocation(line: 304, column: 64, scope: !1425)
!1425 = !DILexicalBlockFile(scope: !1404, file: !744, discriminator: 3)
!1426 = !DILocation(line: 304, column: 55, scope: !1425)
!1427 = !DILocation(line: 304, column: 17, scope: !1425)
!1428 = !DILocation(line: 304, column: 17, scope: !1429)
!1429 = !DILexicalBlockFile(scope: !1404, file: !744, discriminator: 4)
!1430 = !DILocation(line: 304, column: 2, scope: !1429)
!1431 = !DILocation(line: 304, column: 10, scope: !1429)
!1432 = !DILocation(line: 304, column: 15, scope: !1429)
!1433 = !DILocation(line: 306, column: 40, scope: !1404)
!1434 = !DILocation(line: 306, column: 2, scope: !1404)
!1435 = !DILocation(line: 307, column: 1, scope: !1404)
