; ModuleID = './line57-net-sendbuffer.o.i'
source_filename = "./line57-net-sendbuffer.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._NET_SENDBUF_REC = type { %struct._GIOChannel*, %struct._LINEBUF_REC*, i32, i32, i32, i8*, i32, i8 }
%struct._LINEBUF_REC = type opaque
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }
%struct._GSource = type { i8*, %struct._GSourceCallbackFuncs*, %struct._GSourceFuncs*, i32, %struct._GMainContext*, i32, i32, i32, %struct._GSList*, %struct._GSource*, %struct._GSource*, i8*, %struct._GSourcePrivate* }
%struct._GSourceCallbackFuncs = type { void (i8*)*, void (i8*)*, void (i8*, %struct._GSource*, i32 (i8*)**, i8**)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47)
!1 = !DIFile(filename: "line57-net-sendbuffer.o.i", directory: "/home/lichi/Desktop/irssi/task1")
!2 = !{!3, !10, !15, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 69, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!7 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!8 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!9 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 77, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!13 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!14 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 31, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "G_IO_IN", value: 1)
!19 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!20 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!21 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!22 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!23 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 84, size: 32, align: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!27 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!28 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!29 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!30 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!31 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!32 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!33 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!34 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 51, size: 32, align: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46}
!38 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!39 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!40 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!41 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!42 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!43 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!44 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!45 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!46 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!47 = !{!48, !49, !53, !55, !255}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !57, line: 102, baseType: !58)
!57 = !DIFile(filename: "../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !59, line: 7, size: 384, align: 64, elements: !60)
!59 = !DIFile(filename: "net-sendbuffer.h", directory: "/home/lichi/Desktop/irssi/task1")
!60 = !{!61, !245, !249, !250, !251, !252, !253, !254}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !58, file: !59, line: 8, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !4, line: 41, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !4, line: 97, size: 896, align: 64, elements: !65)
!65 = !{!66, !69, !212, !213, !218, !219, !220, !221, !222, !231, !232, !233, !237, !238, !239, !240, !241, !242, !243, !244}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !64, file: !4, line: 100, baseType: !67, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !51, line: 49, baseType: !68)
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !64, file: !4, line: 101, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !4, line: 42, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !4, line: 131, size: 512, align: 64, elements: !73)
!73 = !{!74, !96, !102, !109, !113, !199, !203, !208}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !72, file: !4, line: 133, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !62, !49, !79, !82, !83}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !4, line: 75, baseType: !3)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !80, line: 66, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!81 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !86, line: 42, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !86, line: 44, size: 128, align: 64, elements: !88)
!88 = !{!89, !94, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !87, file: !86, line: 46, baseType: !90, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !91, line: 36, baseType: !92)
!91 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !80, line: 45, baseType: !93)
!93 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !87, file: !86, line: 47, baseType: !67, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !87, file: !86, line: 48, baseType: !49, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !72, file: !4, line: 138, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!78, !62, !100, !79, !82, !83}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !72, file: !4, line: 143, baseType: !103, size: 64, align: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!78, !62, !106, !108, !83}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !80, line: 51, baseType: !107)
!107 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !4, line: 82, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !72, file: !4, line: 147, baseType: !110, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!78, !62, !83}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !72, file: !4, line: 149, baseType: !114, size: 64, align: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!117, !62, !198}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !16, line: 64, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !16, line: 171, size: 768, align: 64, elements: !120)
!120 = !{!121, !123, !144, !173, !175, !179, !180, !181, !182, !190, !191, !192, !194}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !119, file: !16, line: 174, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !51, line: 77, baseType: !48)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !119, file: !16, line: 175, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !16, line: 77, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !16, line: 196, size: 192, align: 64, elements: !127)
!127 = !{!128, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !126, file: !16, line: 198, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !122}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !126, file: !16, line: 199, baseType: !129, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !126, file: !16, line: 200, baseType: !134, size: 64, align: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !122, !117, !137, !143}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !16, line: 155, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !122}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !51, line: 50, baseType: !67)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !119, file: !16, line: 177, baseType: !145, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !16, line: 130, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !16, line: 214, size: 384, align: 64, elements: !149)
!149 = !{!150, !155, !159, !163, !167, !168}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !148, file: !16, line: 216, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!142, !117, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !148, file: !16, line: 218, baseType: !156, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!142, !117}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !148, file: !16, line: 219, baseType: !160, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!142, !117, !138, !122}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !148, file: !16, line: 222, baseType: !164, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !117}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !148, file: !16, line: 226, baseType: !138, size: 64, align: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !148, file: !16, line: 227, baseType: !169, size: 64, align: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !16, line: 212, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !119, file: !16, line: 178, baseType: !174, size: 32, align: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !51, line: 55, baseType: !93)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !119, file: !16, line: 180, baseType: !176, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !16, line: 48, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !16, line: 48, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !119, file: !16, line: 182, baseType: !67, size: 32, align: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !16, line: 183, baseType: !174, size: 32, align: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !119, file: !16, line: 184, baseType: !174, size: 32, align: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !119, file: !16, line: 186, baseType: !183, size: 64, align: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !185, line: 37, baseType: !186)
!185 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !185, line: 39, size: 128, align: 64, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !185, line: 41, baseType: !122, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !185, line: 42, baseType: !183, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !16, line: 188, baseType: !117, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !16, line: 189, baseType: !117, size: 64, align: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !16, line: 191, baseType: !193, size: 64, align: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !119, file: !16, line: 193, baseType: !195, size: 64, align: 64, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !16, line: 65, baseType: !197)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !16, line: 65, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !16, line: 39, baseType: !15)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !72, file: !4, line: 151, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !62}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !72, file: !4, line: 152, baseType: !204, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!78, !62, !207, !83}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !4, line: 95, baseType: !24)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !72, file: !4, line: 155, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!207, !62}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !64, file: !4, line: 103, baseType: !49, size: 64, align: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !64, file: !4, line: 104, baseType: !214, size: 64, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !215, line: 77, baseType: !216)
!215 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !215, line: 77, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !64, file: !4, line: 105, baseType: !214, size: 64, align: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !64, file: !4, line: 106, baseType: !49, size: 64, align: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !64, file: !4, line: 107, baseType: !174, size: 32, align: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !64, file: !4, line: 109, baseType: !79, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !64, file: !4, line: 110, baseType: !223, size: 64, align: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !225, line: 39, baseType: !226)
!225 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !225, line: 41, size: 192, align: 64, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !226, file: !225, line: 43, baseType: !49, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !226, file: !225, line: 44, baseType: !79, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !226, file: !225, line: 45, baseType: !79, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !64, file: !4, line: 111, baseType: !223, size: 64, align: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !64, file: !4, line: 112, baseType: !223, size: 64, align: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !64, file: !4, line: 113, baseType: !234, size: 48, align: 8, offset: 704)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 48, align: 8, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 6)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !64, file: !4, line: 117, baseType: !174, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !64, file: !4, line: 118, baseType: !174, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !64, file: !4, line: 119, baseType: !174, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !64, file: !4, line: 120, baseType: !174, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !64, file: !4, line: 121, baseType: !174, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !64, file: !4, line: 122, baseType: !174, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !64, file: !4, line: 124, baseType: !122, size: 64, align: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !64, file: !4, line: 125, baseType: !122, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "readbuffer", scope: !58, file: !59, line: 9, baseType: !246, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "LINEBUF_REC", file: !57, line: 101, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LINEBUF_REC", file: !57, line: 101, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "send_tag", scope: !58, file: !59, line: 11, baseType: !68, size: 32, align: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !58, file: !59, line: 12, baseType: !68, size: 32, align: 32, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !58, file: !59, line: 13, baseType: !68, size: 32, align: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !58, file: !59, line: 14, baseType: !193, size: 64, align: 64, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "def_bufsize", scope: !58, file: !59, line: 15, baseType: !68, size: 32, align: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !58, file: !59, line: 16, baseType: !93, size: 1, align: 32, offset: 352, flags: DIFlagBitField, extraData: i64 352)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GInputFunction", file: !57, line: 60, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !48, !62, !68}
!259 = !{i32 2, !"Dwarf Version", i32 4}
!260 = !{i32 2, !"Debug Info Version", i32 3}
!261 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!262 = distinct !DISubprogram(name: "net_sendbuffer_create", scope: !263, file: !263, line: 29, type: !264, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !266)
!263 = !DIFile(filename: "net-sendbuffer.c", directory: "/home/lichi/Desktop/irssi/task1")
!264 = !DISubroutineType(types: !265)
!265 = !{!55, !62, !68}
!266 = !{}
!267 = !DILocalVariable(name: "handle", arg: 1, scope: !262, file: !263, line: 29, type: !62)
!268 = !DIExpression()
!269 = !DILocation(line: 29, column: 52, scope: !262)
!270 = !DILocalVariable(name: "bufsize", arg: 2, scope: !262, file: !263, line: 29, type: !68)
!271 = !DILocation(line: 29, column: 64, scope: !262)
!272 = !DILocalVariable(name: "rec", scope: !262, file: !263, line: 31, type: !55)
!273 = !DILocation(line: 31, column: 19, scope: !262)
!274 = !DILocation(line: 33, column: 2, scope: !262)
!275 = distinct !{!275, !274}
!276 = !DILocation(line: 33, column: 10, scope: !277)
!277 = !DILexicalBlockFile(scope: !278, file: !263, discriminator: 1)
!278 = distinct !DILexicalBlock(scope: !279, file: !263, line: 33, column: 10)
!279 = distinct !DILexicalBlock(scope: !262, file: !263, line: 33, column: 4)
!280 = !DILocation(line: 33, column: 17, scope: !277)
!281 = !DILocation(line: 33, column: 5, scope: !282)
!282 = !DILexicalBlockFile(scope: !283, file: !263, discriminator: 2)
!283 = distinct !DILexicalBlock(scope: !278, file: !263, line: 33, column: 3)
!284 = !DILocation(line: 33, column: 14, scope: !285)
!285 = !DILexicalBlockFile(scope: !286, file: !263, discriminator: 3)
!286 = distinct !DILexicalBlock(scope: !278, file: !263, line: 33, column: 12)
!287 = !DILocation(line: 33, column: 101, scope: !285)
!288 = !DILocation(line: 33, column: 7, scope: !289)
!289 = !DILexicalBlockFile(scope: !279, file: !263, discriminator: 4)
!290 = !DILocation(line: 35, column: 29, scope: !262)
!291 = !DILocation(line: 35, column: 9, scope: !262)
!292 = !DILocation(line: 35, column: 6, scope: !262)
!293 = !DILocation(line: 36, column: 9, scope: !262)
!294 = !DILocation(line: 36, column: 14, scope: !262)
!295 = !DILocation(line: 36, column: 23, scope: !262)
!296 = !DILocation(line: 37, column: 16, scope: !262)
!297 = !DILocation(line: 37, column: 2, scope: !262)
!298 = !DILocation(line: 37, column: 7, scope: !262)
!299 = !DILocation(line: 37, column: 14, scope: !262)
!300 = !DILocation(line: 38, column: 17, scope: !262)
!301 = !DILocation(line: 38, column: 25, scope: !262)
!302 = !DILocation(line: 38, column: 31, scope: !303)
!303 = !DILexicalBlockFile(scope: !262, file: !263, discriminator: 1)
!304 = !DILocation(line: 38, column: 17, scope: !303)
!305 = !DILocation(line: 38, column: 17, scope: !306)
!306 = !DILexicalBlockFile(scope: !262, file: !263, discriminator: 2)
!307 = !DILocation(line: 38, column: 17, scope: !308)
!308 = !DILexicalBlockFile(scope: !262, file: !263, discriminator: 3)
!309 = !DILocation(line: 38, column: 2, scope: !308)
!310 = !DILocation(line: 38, column: 7, scope: !308)
!311 = !DILocation(line: 38, column: 15, scope: !308)
!312 = !DILocation(line: 39, column: 21, scope: !262)
!313 = !DILocation(line: 39, column: 26, scope: !262)
!314 = !DILocation(line: 39, column: 2, scope: !262)
!315 = !DILocation(line: 39, column: 7, scope: !262)
!316 = !DILocation(line: 39, column: 19, scope: !262)
!317 = !DILocation(line: 41, column: 9, scope: !262)
