; ModuleID = './line246-formats.o.i'
source_filename = "./line246-formats.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._GHashTable = type opaque
%struct.THEME_REC = type { i32, i8*, i8*, i64, i32, i8, %struct._GHashTable*, [256 x i32], %struct._GSList*, %struct._GHashTable*, i8* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._FORMAT_REC = type { i8*, i8*, i32, [10 x i32] }
%struct._GString = type { i8*, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._TEXT_DEST_REC = type { %struct._WINDOW_REC*, %struct._SERVER_REC*, i8*, i8*, i8*, i8*, i32, i32, i8*, i32 }
%struct._SERVER_REC = type { i32, i32, i32, %struct._SERVER_CONNECT_REC*, i64, i64, i8*, i8*, i8, %struct._NET_SENDBUF_REC*, i32, [2 x %struct._GIOChannel*], i32, i32, %struct._RAWLOG_REC*, %struct._GHashTable*, i8*, i8*, i8*, i8, %struct._GTimeVal, i64, i32, %struct._GSList*, %struct._GSList*, void (%struct._SERVER_REC*, i8*, i32)*, i32 (%struct._SERVER_REC*, i8)*, i32 (%struct._SERVER_REC*, i8*)*, i8* (%struct._SERVER_REC*)*, void (%struct._SERVER_REC*, i8*, i8*, i32)*, i8** (%struct._SERVER_REC*, i8*, i8*)*, %struct._CHANNEL_REC* (%struct._SERVER_REC*, i8*)*, %struct._QUERY_REC* (%struct._SERVER_REC*, i8*)*, i32 (i8*, i8*)*, i32 (i8*, i8*)* }

!263 = !DIEnumerator(name: "TXT_BIND_FOOTER", value: 210)
!264 = !DIEnumerator(name: "TXT_BIND_UNKNOWN_ID", value: 211)
!265 = !DIEnumerator(name: "TXT_CONFIG_SAVED", value: 212)
!266 = !DIEnumerator(name: "TXT_CONFIG_RELOADED", value: 213)
!267 = !DIEnumerator(name: "TXT_CONFIG_MODIFIED", value: 214)
!268 = !DIEnumerator(name: "TXT_GLIB_ERROR", value: 215)
!269 = !DIEnumerator(name: "TXT_OVERWRITE_CONFIG", value: 216)
!270 = !DIEnumerator(name: "TXT_SET_TITLE", value: 217)
!271 = !DIEnumerator(name: "TXT_SET_ITEM", value: 218)
!272 = !DIEnumerator(name: "TXT_SET_UNKNOWN", value: 219)
!273 = !DIEnumerator(name: "TXT_SET_NOT_BOOLEAN", value: 220)
!274 = !DIEnumerator(name: "TXT_NO_COMPLETIONS", value: 221)
!275 = !DIEnumerator(name: "TXT_COMPLETION_REMOVED", value: 222)
!276 = !DIEnumerator(name: "TXT_COMPLETION_HEADER", value: 223)
!277 = !DIEnumerator(name: "TXT_COMPLETION_LINE", value: 224)
!278 = !DIEnumerator(name: "TXT_COMPLETION_FOOTER", value: 225)
!279 = !DIEnumerator(name: "TXT_CAPSICUM_ENABLED", value: 226)
!280 = !DIEnumerator(name: "TXT_CAPSICUM_DISABLED", value: 227)
!281 = !DIEnumerator(name: "TXT_CAPSICUM_FAILED", value: 228)
!282 = !DIEnumerator(name: "TLS_FILL_15", value: 229)
!283 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY", value: 230)
!284 = !DIEnumerator(name: "TXT_TLS_EPHEMERAL_KEY_UNAVAILBLE", value: 231)
!285 = !DIEnumerator(name: "TXT_TLS_PUBKEY", value: 232)
!286 = !DIEnumerator(name: "TXT_TLS_CERT_HEADER", value: 233)
!287 = !DIEnumerator(name: "TXT_TLS_CERT_SUBJECT", value: 234)
!288 = !DIEnumerator(name: "TXT_TLS_CERT_ISSUER", value: 235)
!289 = !DIEnumerator(name: "TXT_TLS_PUBKEY_FINGERPRINT", value: 236)
!290 = !DIEnumerator(name: "TXT_TLS_CERT_FINGERPRINT", value: 237)
!291 = !DIEnumerator(name: "TXT_TLS_PROTOCOL_VERSION", value: 238)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !293, line: 10, size: 32, align: 32, elements: !294)
!293 = !DIFile(filename: "../../../src/core/levels.h", directory: "/home/lichi/Desktop/irssi/task1")
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!295 = !DIEnumerator(name: "MSGLEVEL_CRAP", value: 1)
!296 = !DIEnumerator(name: "MSGLEVEL_MSGS", value: 2)
!297 = !DIEnumerator(name: "MSGLEVEL_PUBLIC", value: 4)
!298 = !DIEnumerator(name: "MSGLEVEL_NOTICES", value: 8)
!299 = !DIEnumerator(name: "MSGLEVEL_SNOTES", value: 16)
!300 = !DIEnumerator(name: "MSGLEVEL_CTCPS", value: 32)
!301 = !DIEnumerator(name: "MSGLEVEL_ACTIONS", value: 64)
!302 = !DIEnumerator(name: "MSGLEVEL_JOINS", value: 128)
!303 = !DIEnumerator(name: "MSGLEVEL_PARTS", value: 256)
!304 = !DIEnumerator(name: "MSGLEVEL_QUITS", value: 512)
!305 = !DIEnumerator(name: "MSGLEVEL_KICKS", value: 1024)
!306 = !DIEnumerator(name: "MSGLEVEL_MODES", value: 2048)
!307 = !DIEnumerator(name: "MSGLEVEL_TOPICS", value: 4096)
!308 = !DIEnumerator(name: "MSGLEVEL_WALLOPS", value: 8192)
!309 = !DIEnumerator(name: "MSGLEVEL_INVITES", value: 16384)
!310 = !DIEnumerator(name: "MSGLEVEL_NICKS", value: 32768)
!311 = !DIEnumerator(name: "MSGLEVEL_DCC", value: 65536)
!312 = !DIEnumerator(name: "MSGLEVEL_DCCMSGS", value: 131072)
!313 = !DIEnumerator(name: "MSGLEVEL_CLIENTNOTICE", value: 262144)
!314 = !DIEnumerator(name: "MSGLEVEL_CLIENTCRAP", value: 524288)
!315 = !DIEnumerator(name: "MSGLEVEL_CLIENTERROR", value: 1048576)
!316 = !DIEnumerator(name: "MSGLEVEL_HILIGHT", value: 2097152)
!317 = !DIEnumerator(name: "MSGLEVEL_ALL", value: 4194303)
!318 = !DIEnumerator(name: "MSGLEVEL_NOHILIGHT", value: 16777216)
!319 = !DIEnumerator(name: "MSGLEVEL_NO_ACT", value: 33554432)
!320 = !DIEnumerator(name: "MSGLEVEL_NEVER", value: 67108864)
!321 = !DIEnumerator(name: "MSGLEVEL_LASTLOG", value: 134217728)
!322 = !DIEnumerator(name: "MSGLEVEL_HIDDEN", value: 268435456)
!323 = !{!324, !325, !326, !327, !328, !331, !333, !334, !335, !336, !441, !618, !668, !669, !670, !648}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!325 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!326 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!327 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !330, line: 46, baseType: !327)
!330 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!334 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!335 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_REC", file: !338, line: 107, baseType: !339)
!338 = !DIFile(filename: "../../../src/common.h", directory: "/home/lichi/Desktop/irssi/task1")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_REC", file: !340, line: 30, size: 2240, align: 64, elements: !341)
!340 = !DIFile(filename: "../../../src/core/servers.h", directory: "/home/lichi/Desktop/irssi/task1")
!341 = !{!342, !344, !345, !346, !573, !578, !579, !580, !581, !582, !583, !584, !585, !586, !590, !591, !595, !596, !597, !601, !606, !607, !608, !609, !610, !611, !612, !613, !620, !621, !622, !623, !624, !628, !632, !636, !640, !644, !649, !656, !663, !667}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !343, line: 3, baseType: !325, size: 32, align: 32)
!343 = !DIFile(filename: "../../../src/core/server-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !339, file: !343, line: 4, baseType: !325, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !339, file: !343, line: 6, baseType: !325, size: 32, align: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "connrec", scope: !339, file: !343, line: 8, baseType: !347, size: 64, align: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "SERVER_CONNECT_REC", file: !338, line: 113, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SERVER_CONNECT_REC", file: !340, line: 25, size: 1920, align: 64, elements: !350)
!350 = !{!351, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !352, line: 3, baseType: !325, size: 32, align: 32)
!352 = !DIFile(filename: "../../../src/core/server-connect-rec.h", directory: "/home/lichi/Desktop/irssi/task1")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "chat_type", scope: !349, file: !352, line: 4, baseType: !325, size: 32, align: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !349, file: !352, line: 6, baseType: !325, size: 32, align: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !349, file: !352, line: 9, baseType: !333, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_port", scope: !349, file: !352, line: 10, baseType: !325, size: 32, align: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string", scope: !349, file: !352, line: 11, baseType: !333, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_string_after", scope: !349, file: !352, line: 11, baseType: !333, size: 64, align: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_password", scope: !349, file: !352, line: 11, baseType: !333, size: 64, align: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !349, file: !352, line: 13, baseType: !326, size: 16, align: 16, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !349, file: !352, line: 14, baseType: !333, size: 64, align: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !349, file: !352, line: 15, baseType: !333, size: 64, align: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !349, file: !352, line: 16, baseType: !325, size: 32, align: 32, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chatnet", scope: !349, file: !352, line: 17, baseType: !333, size: 64, align: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip4", scope: !349, file: !352, line: 19, baseType: !366, size: 64, align: 64, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPADDR", file: !338, line: 99, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IPADDR", file: !338, line: 99, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "own_ip6", scope: !349, file: !352, line: 19, baseType: !366, size: 64, align: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !349, file: !352, line: 21, baseType: !333, size: 64, align: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !349, file: !352, line: 22, baseType: !333, size: 64, align: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !349, file: !352, line: 23, baseType: !333, size: 64, align: 64, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !349, file: !352, line: 24, baseType: !333, size: 64, align: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cert", scope: !349, file: !352, line: 26, baseType: !333, size: 64, align: 64, offset: 1152)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pkey", scope: !349, file: !352, line: 27, baseType: !333, size: 64, align: 64, offset: 1216)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pass", scope: !349, file: !352, line: 28, baseType: !333, size: 64, align: 64, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tls_cafile", scope: !349, file: !352, line: 29, baseType: !333, size: 64, align: 64, offset: 1344)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tls_capath", scope: !349, file: !352, line: 30, baseType: !333, size: 64, align: 64, offset: 1408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tls_ciphers", scope: !349, file: !352, line: 31, baseType: !333, size: 64, align: 64, offset: 1472)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_cert", scope: !349, file: !352, line: 32, baseType: !333, size: 64, align: 64, offset: 1536)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tls_pinned_pubkey", scope: !349, file: !352, line: 33, baseType: !333, size: 64, align: 64, offset: 1600)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "connect_handle", scope: !349, file: !352, line: 35, baseType: !383, size: 64, align: 64, offset: 1664)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !19, line: 41, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !19, line: 97, size: 896, align: 64, elements: !386)
!386 = !{!387, !389, !530, !531, !536, !537, !538, !539, !540, !549, !550, !551, !555, !556, !557, !558, !559, !560, !561, !562}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !385, file: !19, line: 100, baseType: !388, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !330, line: 49, baseType: !325)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !385, file: !19, line: 101, baseType: !390, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !19, line: 42, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !19, line: 131, size: 512, align: 64, elements: !393)
!393 = !{!394, !416, !422, !428, !432, !517, !521, !526}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !392, file: !19, line: 133, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !383, !328, !399, !402, !403}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !19, line: 75, baseType: !18)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !400, line: 66, baseType: !401)
!400 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!401 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !406, line: 42, baseType: !407)
!406 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !406, line: 44, size: 128, align: 64, elements: !408)
!408 = !{!409, !414, !415}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !407, file: !406, line: 46, baseType: !410, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !411, line: 36, baseType: !412)
!411 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !400, line: 45, baseType: !413)
!413 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !407, file: !406, line: 47, baseType: !388, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !407, file: !406, line: 48, baseType: !328, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !392, file: !19, line: 138, baseType: !417, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!398, !383, !420, !399, !402, !403}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !392, file: !19, line: 143, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!398, !383, !426, !427, !403}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !400, line: 51, baseType: !334)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !19, line: 82, baseType: !25)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !392, file: !19, line: 147, baseType: !429, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!398, !383, !403}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !392, file: !19, line: 149, baseType: !433, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !383, !516}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !31, line: 64, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !31, line: 171, size: 768, align: 64, elements: !439)
!439 = !{!440, !442, !463, !492, !494, !498, !499, !500, !501, !509, !510, !511, !512}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !438, file: !31, line: 174, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !330, line: 77, baseType: !324)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !438, file: !31, line: 175, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !31, line: 77, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !31, line: 196, size: 192, align: 64, elements: !446)
!446 = !{!447, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !445, file: !31, line: 198, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !441}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !445, file: !31, line: 199, baseType: !448, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !445, file: !31, line: 200, baseType: !453, size: 64, align: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !441, !436, !456, !462}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !31, line: 155, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !441}
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !330, line: 50, baseType: !388)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !438, file: !31, line: 177, baseType: !464, size: 64, align: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !31, line: 130, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !31, line: 214, size: 384, align: 64, elements: !468)
!468 = !{!469, !474, !478, !482, !486, !487}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !467, file: !31, line: 216, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!461, !436, !473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !467, file: !31, line: 218, baseType: !475, size: 64, align: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!461, !436}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !467, file: !31, line: 219, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!461, !436, !457, !441}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !467, file: !31, line: 222, baseType: !483, size: 64, align: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !436}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !467, file: !31, line: 226, baseType: !457, size: 64, align: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !467, file: !31, line: 227, baseType: !488, size: 64, align: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !31, line: 212, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !438, file: !31, line: 178, baseType: !493, size: 32, align: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !330, line: 55, baseType: !413)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !438, file: !31, line: 180, baseType: !495, size: 64, align: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !31, line: 48, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !31, line: 48, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !438, file: !31, line: 182, baseType: !388, size: 32, align: 32, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !31, line: 183, baseType: !493, size: 32, align: 32, offset: 352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !438, file: !31, line: 184, baseType: !493, size: 32, align: 32, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !438, file: !31, line: 186, baseType: !502, size: 64, align: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !504, line: 37, baseType: !505)
!504 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !504, line: 39, size: 128, align: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !505, file: !504, line: 41, baseType: !441, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !504, line: 42, baseType: !502, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !31, line: 188, baseType: !436, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !31, line: 189, baseType: !436, size: 64, align: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !438, file: !31, line: 191, baseType: !333, size: 64, align: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !438, file: !31, line: 193, baseType: !513, size: 64, align: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !31, line: 65, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !31, line: 65, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !31, line: 39, baseType: !30)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !392, file: !19, line: 151, baseType: !518, size: 64, align: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !383}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !392, file: !19, line: 152, baseType: !522, size: 64, align: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!398, !383, !525, !403}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !19, line: 95, baseType: !39)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !392, file: !19, line: 155, baseType: !527, size: 64, align: 64, offset: 448)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!525, !383}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !385, file: !19, line: 103, baseType: !328, size: 64, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !385, file: !19, line: 104, baseType: !532, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !533, line: 77, baseType: !534)
!533 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !533, line: 77, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !385, file: !19, line: 105, baseType: !532, size: 64, align: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !385, file: !19, line: 106, baseType: !328, size: 64, align: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !385, file: !19, line: 107, baseType: !493, size: 32, align: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !385, file: !19, line: 109, baseType: !399, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !385, file: !19, line: 110, baseType: !541, size: 64, align: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !543, line: 39, baseType: !544)
!543 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !543, line: 41, size: 192, align: 64, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !544, file: !543, line: 43, baseType: !328, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !544, file: !543, line: 44, baseType: !399, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !544, file: !543, line: 45, baseType: !399, size: 64, align: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !385, file: !19, line: 111, baseType: !541, size: 64, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !385, file: !19, line: 112, baseType: !541, size: 64, align: 64, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !385, file: !19, line: 113, baseType: !552, size: 48, align: 8, offset: 704)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 48, align: 8, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 6)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !385, file: !19, line: 117, baseType: !493, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !385, file: !19, line: 118, baseType: !493, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !385, file: !19, line: 119, baseType: !493, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !385, file: !19, line: 120, baseType: !493, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !385, file: !19, line: 121, baseType: !493, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !385, file: !19, line: 122, baseType: !493, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !385, file: !19, line: 124, baseType: !441, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !385, file: !19, line: 125, baseType: !441, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reconnection", scope: !349, file: !352, line: 38, baseType: !413, size: 1, align: 32, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "reconnecting", scope: !349, file: !352, line: 39, baseType: !413, size: 1, align: 32, offset: 1729, flags: DIFlagBitField, extraData: i64 1728)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "no_autojoin_channels", scope: !349, file: !352, line: 40, baseType: !413, size: 1, align: 32, offset: 1730, flags: DIFlagBitField, extraData: i64 1728)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosendcmd", scope: !349, file: !352, line: 41, baseType: !413, size: 1, align: 32, offset: 1731, flags: DIFlagBitField, extraData: i64 1728)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unix_socket", scope: !349, file: !352, line: 42, baseType: !413, size: 1, align: 32, offset: 1732, flags: DIFlagBitField, extraData: i64 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "use_tls", scope: !349, file: !352, line: 43, baseType: !413, size: 1, align: 32, offset: 1733, flags: DIFlagBitField, extraData: i64 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tls_verify", scope: !349, file: !352, line: 44, baseType: !413, size: 1, align: 32, offset: 1734, flags: DIFlagBitField, extraData: i64 1728)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "no_connect", scope: !349, file: !352, line: 45, baseType: !413, size: 1, align: 32, offset: 1735, flags: DIFlagBitField, extraData: i64 1728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !349, file: !352, line: 46, baseType: !333, size: 64, align: 64, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !349, file: !352, line: 47, baseType: !333, size: 64, align: 64, offset: 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "connect_time", scope: !339, file: !343, line: 9, baseType: !574, size: 64, align: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !575, line: 75, baseType: !576)
!575 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/irssi/task1")
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !577, line: 139, baseType: !334)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/irssi/task1")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "real_connect_time", scope: !339, file: !343, line: 10, baseType: !574, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !339, file: !343, line: 12, baseType: !333, size: 64, align: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nick", scope: !339, file: !343, line: 13, baseType: !333, size: 64, align: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !339, file: !343, line: 15, baseType: !413, size: 1, align: 32, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "disconnected", scope: !339, file: !343, line: 16, baseType: !413, size: 1, align: 32, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "connection_lost", scope: !339, file: !343, line: 17, baseType: !413, size: 1, align: 32, offset: 450, flags: DIFlagBitField, extraData: i64 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "session_reconnect", scope: !339, file: !343, line: 18, baseType: !413, size: 1, align: 32, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no_reconnect", scope: !339, file: !343, line: 19, baseType: !413, size: 1, align: 32, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !339, file: !343, line: 21, baseType: !587, size: 64, align: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "NET_SENDBUF_REC", file: !338, line: 102, baseType: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_NET_SENDBUF_REC", file: !338, line: 102, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "readtag", scope: !339, file: !343, line: 22, baseType: !325, size: 32, align: 32, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pipe", scope: !339, file: !343, line: 25, baseType: !592, size: 128, align: 64, offset: 640)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 128, align: 64, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 2)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "connect_tag", scope: !339, file: !343, line: 26, baseType: !325, size: 32, align: 32, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "connect_pid", scope: !339, file: !343, line: 27, baseType: !325, size: 32, align: 32, offset: 800)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rawlog", scope: !339, file: !343, line: 29, baseType: !598, size: 64, align: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAWLOG_REC", file: !338, line: 103, baseType: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RAWLOG_REC", file: !338, line: 103, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "module_data", scope: !339, file: !343, line: 30, baseType: !602, size: 64, align: 64, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !604, line: 37, baseType: !605)
!604 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !604, line: 37, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !339, file: !343, line: 32, baseType: !333, size: 64, align: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "away_reason", scope: !339, file: !343, line: 33, baseType: !333, size: 64, align: 64, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "last_invite", scope: !339, file: !343, line: 34, baseType: !333, size: 64, align: 64, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "server_operator", scope: !339, file: !343, line: 35, baseType: !413, size: 1, align: 32, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "usermode_away", scope: !339, file: !343, line: 36, baseType: !413, size: 1, align: 32, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "banned", scope: !339, file: !343, line: 37, baseType: !413, size: 1, align: 32, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dns_error", scope: !339, file: !343, line: 38, baseType: !413, size: 1, align: 32, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lag_sent", scope: !339, file: !343, line: 40, baseType: !614, size: 128, align: 64, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTimeVal", file: !330, line: 504, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GTimeVal", file: !330, line: 506, size: 128, align: 64, elements: !616)
!616 = !{!617, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !615, file: !330, line: 508, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "glong", file: !330, line: 48, baseType: !334)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !615, file: !330, line: 509, baseType: !618, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lag_last_check", scope: !339, file: !343, line: 41, baseType: !574, size: 64, align: 64, offset: 1344)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lag", scope: !339, file: !343, line: 42, baseType: !325, size: 32, align: 32, offset: 1408)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !339, file: !343, line: 44, baseType: !502, size: 64, align: 64, offset: 1472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "queries", scope: !339, file: !343, line: 45, baseType: !502, size: 64, align: 64, offset: 1536)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "channels_join", scope: !339, file: !343, line: 53, baseType: !625, size: 64, align: 64, offset: 1600)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !336, !331, !325}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "isnickflag", scope: !339, file: !343, line: 55, baseType: !629, size: 64, align: 64, offset: 1664)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!325, !336, !327}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ischannel", scope: !339, file: !343, line: 57, baseType: !633, size: 64, align: 64, offset: 1728)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!325, !336, !331}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "get_nick_flags", scope: !339, file: !343, line: 60, baseType: !637, size: 64, align: 64, offset: 1792)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!331, !336}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "send_message", scope: !339, file: !343, line: 62, baseType: !641, size: 64, align: 64, offset: 1856)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, align: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !336, !331, !331, !325}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "split_message", scope: !339, file: !343, line: 65, baseType: !645, size: 64, align: 64, offset: 1920)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!648, !336, !331, !331}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "channel_find_func", scope: !339, file: !343, line: 69, baseType: !650, size: 64, align: 64, offset: 1984)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!653, !336, !331}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHANNEL_REC", file: !338, line: 109, baseType: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CHANNEL_REC", file: !338, line: 109, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "query_find_func", scope: !339, file: !343, line: 70, baseType: !657, size: 64, align: 64, offset: 2048)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !336, !331}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "QUERY_REC", file: !338, line: 110, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "_QUERY_REC", file: !338, line: 110, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mask_match_func", scope: !339, file: !343, line: 71, baseType: !664, size: 64, align: 64, offset: 2112)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!325, !331, !331}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nick_match_msg", scope: !339, file: !343, line: 73, baseType: !664, size: 64, align: 64, offset: 2176)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!669 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "SIGNAL_FUNC", file: !671, line: 9, baseType: !672)
!671 = !DIFile(filename: "../../../src/core/signals.h", directory: "/home/lichi/Desktop/irssi/task1")
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !675, !675, !675, !675, !675, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!677 = !{!678, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!678 = distinct !DIGlobalVariable(name: "signal_gui_print_text", scope: !0, file: !679, line: 42, type: !325, isLocal: true, isDefinition: true, variable: i32* @signal_gui_print_text)
!679 = !DIFile(filename: "formats.c", directory: "/home/lichi/Desktop/irssi/task1")
!680 = distinct !DIGlobalVariable(name: "hide_text_style", scope: !0, file: !679, line: 43, type: !325, isLocal: true, isDefinition: true, variable: i32* @hide_text_style)
!681 = distinct !DIGlobalVariable(name: "hide_colors", scope: !0, file: !679, line: 43, type: !325, isLocal: true, isDefinition: true, variable: i32* @hide_colors)
!682 = distinct !DIGlobalVariable(name: "format_backs", scope: !0, file: !679, line: 38, type: !331, isLocal: true, isDefinition: true, variable: i8** @format_backs)
!683 = distinct !DIGlobalVariable(name: "format_fores", scope: !0, file: !679, line: 39, type: !331, isLocal: true, isDefinition: true, variable: i8** @format_fores)
!684 = distinct !DIGlobalVariable(name: "format_boldfores", scope: !0, file: !679, line: 40, type: !331, isLocal: true, isDefinition: true, variable: i8** @format_boldfores)
!685 = distinct !DIGlobalVariable(name: "timestamp_level", scope: !0, file: !679, line: 45, type: !325, isLocal: true, isDefinition: true, variable: i32* @timestamp_level)
!686 = distinct !DIGlobalVariable(name: "timestamp_timeout", scope: !0, file: !679, line: 46, type: !325, isLocal: true, isDefinition: true, variable: i32* @timestamp_timeout)
!687 = distinct !DIGlobalVariable(name: "hide_server_tags", scope: !0, file: !679, line: 43, type: !325, isLocal: true, isDefinition: true, variable: i32* @hide_server_tags)
!688 = distinct !DIGlobalVariable(name: "ansitab", scope: !689, file: !679, line: 875, type: !713, isLocal: true, isDefinition: true, variable: [8 x i8]* @get_ansi_color.ansitab)
!689 = distinct !DISubprogram(name: "get_ansi_color", scope: !679, file: !679, line: 872, type: !690, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!690 = !DISubroutineType(types: !691)
!691 = !{!331, !692, !331, !711, !711, !711}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "THEME_REC", file: !694, line: 33, baseType: !695)
!694 = !DIFile(filename: "themes.h", directory: "/home/lichi/Desktop/irssi/task1")
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !694, line: 13, size: 8768, align: 64, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !708, !709, !710}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !695, file: !694, line: 14, baseType: !325, size: 32, align: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !695, file: !694, line: 16, baseType: !333, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !694, line: 17, baseType: !333, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "last_modify", scope: !695, file: !694, line: 18, baseType: !574, size: 64, align: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_color", scope: !695, file: !694, line: 20, baseType: !325, size: 32, align: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "info_eol", scope: !695, file: !694, line: 23, baseType: !413, size: 1, align: 32, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !695, file: !694, line: 26, baseType: !602, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "replace_keys", scope: !695, file: !694, line: 28, baseType: !705, size: 8192, align: 32, offset: 384)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 8192, align: 32, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "replace_values", scope: !695, file: !694, line: 29, baseType: !502, size: 64, align: 64, offset: 8576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "abstracts", scope: !695, file: !694, line: 30, baseType: !602, size: 64, align: 64, offset: 8640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gui_data", scope: !695, file: !694, line: 32, baseType: !324, size: 64, align: 64, offset: 8704)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!712 = !{}
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 64, align: 8, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 8)
!716 = !{i32 2, !"Dwarf Version", i32 4}
!717 = !{i32 2, !"Debug Info Version", i32 3}
!718 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!719 = distinct !DISubprogram(name: "format_find_tag", scope: !679, file: !679, line: 48, type: !665, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!720 = !DILocalVariable(name: "module", arg: 1, scope: !719, file: !679, line: 48, type: !331)
!721 = !DIExpression()
!722 = !DILocation(line: 48, column: 33, scope: !719)
!723 = !DILocalVariable(name: "tag", arg: 2, scope: !719, file: !679, line: 48, type: !331)
!724 = !DILocation(line: 48, column: 53, scope: !719)
!725 = !DILocalVariable(name: "formats", scope: !719, file: !679, line: 50, type: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "FORMAT_REC", file: !694, line: 35, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FORMAT_REC", file: !729, line: 30, size: 512, align: 64, elements: !730)
!729 = !DIFile(filename: "formats.h", directory: "/home/lichi/Desktop/irssi/task1")
!730 = !{!731, !732, !733, !734}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !728, file: !729, line: 31, baseType: !333, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !728, file: !729, line: 32, baseType: !333, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !728, file: !729, line: 34, baseType: !325, size: 32, align: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "paramtypes", scope: !728, file: !729, line: 35, baseType: !735, size: 320, align: 32, offset: 160)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 320, align: 32, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 10)
!738 = !DILocation(line: 50, column: 14, scope: !719)
!739 = !DILocalVariable(name: "n", scope: !719, file: !679, line: 51, type: !325)
!740 = !DILocation(line: 51, column: 6, scope: !719)
!741 = !DILocation(line: 53, column: 32, scope: !719)
!742 = !DILocation(line: 53, column: 49, scope: !719)
!743 = !DILocation(line: 53, column: 12, scope: !719)
!744 = !DILocation(line: 53, column: 10, scope: !719)
!745 = !DILocation(line: 54, column: 6, scope: !746)
!746 = distinct !DILexicalBlock(scope: !719, file: !679, line: 54, column: 6)
!747 = !DILocation(line: 54, column: 14, scope: !746)
!748 = !DILocation(line: 54, column: 6, scope: !719)
!749 = !DILocation(line: 55, column: 3, scope: !746)
!750 = !DILocation(line: 57, column: 9, scope: !751)
!751 = distinct !DILexicalBlock(scope: !719, file: !679, line: 57, column: 2)
!752 = !DILocation(line: 57, column: 7, scope: !751)
!753 = !DILocation(line: 57, column: 22, scope: !754)
!754 = !DILexicalBlockFile(scope: !755, file: !679, discriminator: 1)
!755 = distinct !DILexicalBlock(scope: !751, file: !679, line: 57, column: 2)
!756 = !DILocation(line: 57, column: 14, scope: !754)
!757 = !DILocation(line: 57, column: 25, scope: !754)
!758 = !DILocation(line: 57, column: 29, scope: !754)
!759 = !DILocation(line: 57, column: 2, scope: !754)
!760 = !DILocation(line: 58, column: 15, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !679, line: 58, column: 7)
!762 = distinct !DILexicalBlock(scope: !755, file: !679, line: 57, column: 42)
!763 = !DILocation(line: 58, column: 7, scope: !761)
!764 = !DILocation(line: 58, column: 18, scope: !761)
!765 = !DILocation(line: 58, column: 22, scope: !761)
!766 = !DILocation(line: 58, column: 29, scope: !761)
!767 = !DILocation(line: 59, column: 34, scope: !761)
!768 = !DILocation(line: 59, column: 26, scope: !761)
!769 = !DILocation(line: 59, column: 37, scope: !761)
!770 = !DILocation(line: 59, column: 42, scope: !761)
!771 = !DILocation(line: 59, column: 7, scope: !761)
!772 = !DILocation(line: 59, column: 47, scope: !761)
!773 = !DILocation(line: 58, column: 7, scope: !774)
!774 = !DILexicalBlockFile(scope: !762, file: !679, discriminator: 1)
!775 = !DILocation(line: 60, column: 11, scope: !761)
!776 = !DILocation(line: 60, column: 4, scope: !761)
!777 = !DILocation(line: 61, column: 2, scope: !762)
!778 = !DILocation(line: 57, column: 38, scope: !779)
!779 = !DILexicalBlockFile(scope: !755, file: !679, discriminator: 2)
!780 = !DILocation(line: 57, column: 2, scope: !779)
!781 = distinct !{!781, !782}
!782 = !DILocation(line: 57, column: 2, scope: !719)
!783 = !DILocation(line: 63, column: 2, scope: !719)
!784 = !DILocation(line: 64, column: 1, scope: !719)
!785 = distinct !DISubprogram(name: "format_ext_color", scope: !679, file: !679, line: 105, type: !786, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !541, !325, !325}
!788 = !DILocalVariable(name: "out", arg: 1, scope: !785, file: !679, line: 105, type: !541)
!789 = !DILocation(line: 105, column: 32, scope: !785)
!790 = !DILocalVariable(name: "bg", arg: 2, scope: !785, file: !679, line: 105, type: !325)
!791 = !DILocation(line: 105, column: 41, scope: !785)
!792 = !DILocalVariable(name: "color", arg: 3, scope: !785, file: !679, line: 105, type: !325)
!793 = !DILocation(line: 105, column: 49, scope: !785)
!794 = !DILocation(line: 107, column: 28, scope: !785)
!795 = !DILocation(line: 107, column: 2, scope: !785)
!796 = !DILocation(line: 108, column: 6, scope: !797)
!797 = distinct !DILexicalBlock(scope: !785, file: !679, line: 108, column: 6)
!798 = !DILocation(line: 108, column: 9, scope: !797)
!799 = !DILocation(line: 108, column: 12, scope: !800)
!800 = !DILexicalBlockFile(scope: !797, file: !679, discriminator: 1)
!801 = !DILocation(line: 108, column: 18, scope: !800)
!802 = !DILocation(line: 108, column: 6, scope: !800)
!803 = !DILocation(line: 109, column: 29, scope: !797)
!804 = !DILocation(line: 109, column: 3, scope: !797)
!805 = !DILocation(line: 110, column: 6, scope: !806)
!806 = distinct !DILexicalBlock(scope: !785, file: !679, line: 110, column: 6)
!807 = !DILocation(line: 110, column: 12, scope: !806)
!808 = !DILocation(line: 110, column: 6, scope: !785)
!809 = !DILocation(line: 111, column: 29, scope: !806)
!810 = !DILocation(line: 111, column: 34, scope: !806)
!811 = !DILocation(line: 111, column: 39, scope: !806)
!812 = !DILocation(line: 111, column: 3, scope: !806)
!813 = !DILocation(line: 113, column: 7, scope: !814)
!814 = distinct !DILexicalBlock(scope: !815, file: !679, line: 113, column: 7)
!815 = distinct !DILexicalBlock(scope: !806, file: !679, line: 112, column: 7)
!816 = !DILocation(line: 113, column: 13, scope: !814)
!817 = !DILocation(line: 113, column: 7, scope: !815)
!818 = !DILocation(line: 114, column: 30, scope: !814)
!819 = !DILocation(line: 114, column: 35, scope: !814)
!820 = !DILocation(line: 114, column: 4, scope: !814)
!821 = !DILocation(line: 116, column: 12, scope: !822)
!822 = distinct !DILexicalBlock(scope: !814, file: !679, line: 116, column: 12)
!823 = !DILocation(line: 116, column: 18, scope: !822)
!824 = !DILocation(line: 116, column: 12, scope: !814)
!825 = !DILocation(line: 117, column: 30, scope: !822)
!826 = !DILocation(line: 117, column: 35, scope: !822)
!827 = !DILocation(line: 117, column: 4, scope: !822)
!828 = !DILocation(line: 120, column: 30, scope: !822)
!829 = !DILocation(line: 120, column: 35, scope: !822)
!830 = !DILocation(line: 120, column: 4, scope: !822)
!831 = !DILocation(line: 122, column: 29, scope: !815)
!832 = !DILocation(line: 122, column: 46, scope: !815)
!833 = !DILocation(line: 122, column: 51, scope: !815)
!834 = !DILocation(line: 122, column: 57, scope: !815)
!835 = !DILocation(line: 122, column: 42, scope: !815)
!836 = !DILocation(line: 122, column: 34, scope: !815)
!837 = !DILocation(line: 122, column: 3, scope: !815)
!838 = !DILocation(line: 124, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !785, file: !679, line: 124, column: 6)
!840 = !DILocation(line: 124, column: 10, scope: !839)
!841 = !DILocation(line: 124, column: 13, scope: !842)
!842 = !DILexicalBlockFile(scope: !839, file: !679, discriminator: 1)
!843 = !DILocation(line: 124, column: 19, scope: !842)
!844 = !DILocation(line: 124, column: 6, scope: !842)
!845 = !DILocation(line: 125, column: 29, scope: !839)
!846 = !DILocation(line: 125, column: 3, scope: !839)
!847 = !DILocation(line: 126, column: 1, scope: !785)
!848 = distinct !DISubprogram(name: "g_string_append_c_inline", scope: !543, file: !543, line: 161, type: !849, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!849 = !DISubroutineType(types: !850)
!850 = !{!541, !541, !329}
!851 = !DILocalVariable(name: "gstring", arg: 1, scope: !848, file: !543, line: 161, type: !541)
!852 = !DILocation(line: 161, column: 36, scope: !848)
!853 = !DILocalVariable(name: "c", arg: 2, scope: !848, file: !543, line: 162, type: !329)
!854 = !DILocation(line: 162, column: 33, scope: !848)
!855 = !DILocation(line: 164, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !848, file: !543, line: 164, column: 7)
!857 = !DILocation(line: 164, column: 16, scope: !856)
!858 = !DILocation(line: 164, column: 20, scope: !856)
!859 = !DILocation(line: 164, column: 26, scope: !856)
!860 = !DILocation(line: 164, column: 35, scope: !856)
!861 = !DILocation(line: 164, column: 24, scope: !856)
!862 = !DILocation(line: 164, column: 7, scope: !848)
!863 = !DILocation(line: 166, column: 38, scope: !864)
!864 = distinct !DILexicalBlock(scope: !856, file: !543, line: 165, column: 5)
!865 = !DILocation(line: 166, column: 20, scope: !864)
!866 = !DILocation(line: 166, column: 29, scope: !864)
!867 = !DILocation(line: 166, column: 32, scope: !864)
!868 = !DILocation(line: 166, column: 7, scope: !864)
!869 = !DILocation(line: 166, column: 16, scope: !864)
!870 = !DILocation(line: 166, column: 36, scope: !864)
!871 = !DILocation(line: 167, column: 20, scope: !864)
!872 = !DILocation(line: 167, column: 29, scope: !864)
!873 = !DILocation(line: 167, column: 7, scope: !864)
!874 = !DILocation(line: 167, column: 16, scope: !864)
!875 = !DILocation(line: 167, column: 34, scope: !864)
!876 = !DILocation(line: 168, column: 5, scope: !864)
!877 = !DILocation(line: 170, column: 24, scope: !856)
!878 = !DILocation(line: 170, column: 37, scope: !856)
!879 = !DILocation(line: 170, column: 5, scope: !856)
!880 = !DILocation(line: 171, column: 10, scope: !848)
!881 = !DILocation(line: 171, column: 3, scope: !848)
!882 = distinct !DISubprogram(name: "format_24bit_color", scope: !679, file: !679, line: 157, type: !883, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !541, !325, !413}
!885 = !DILocalVariable(name: "out", arg: 1, scope: !882, file: !679, line: 157, type: !541)
!886 = !DILocation(line: 157, column: 34, scope: !882)
!887 = !DILocalVariable(name: "bg", arg: 2, scope: !882, file: !679, line: 157, type: !325)
!888 = !DILocation(line: 157, column: 43, scope: !882)
!889 = !DILocalVariable(name: "color", arg: 3, scope: !882, file: !679, line: 157, type: !413)
!890 = !DILocation(line: 157, column: 60, scope: !882)
!891 = !DILocalVariable(name: "rgb", scope: !882, file: !679, line: 159, type: !892)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 24, align: 8, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 3)
!895 = !DILocation(line: 159, column: 16, scope: !882)
!896 = !DILocation(line: 159, column: 24, scope: !882)
!897 = !DILocation(line: 159, column: 26, scope: !882)
!898 = !DILocation(line: 159, column: 32, scope: !882)
!899 = !DILocation(line: 159, column: 39, scope: !882)
!900 = !DILocation(line: 159, column: 45, scope: !882)
!901 = !DILocation(line: 159, column: 51, scope: !882)
!902 = !DILocation(line: 175, column: 19, scope: !882)
!903 = !DILocation(line: 175, column: 24, scope: !882)
!904 = !DILocation(line: 175, column: 44, scope: !882)
!905 = !DILocation(line: 175, column: 28, scope: !882)
!906 = !DILocation(line: 175, column: 2, scope: !907)
!907 = !DILexicalBlockFile(scope: !882, file: !679, discriminator: 1)
!908 = !DILocation(line: 177, column: 1, scope: !882)
!909 = distinct !DISubprogram(name: "format_expand_styles", scope: !679, file: !679, line: 179, type: !910, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!910 = !DISubroutineType(types: !911)
!911 = !{!325, !541, !668, !711}
!912 = !DILocalVariable(name: "out", arg: 1, scope: !909, file: !679, line: 179, type: !541)
!913 = !DILocation(line: 179, column: 35, scope: !909)
!914 = !DILocalVariable(name: "format", arg: 2, scope: !909, file: !679, line: 179, type: !668)
!915 = !DILocation(line: 179, column: 53, scope: !909)
!916 = !DILocalVariable(name: "flags", arg: 3, scope: !909, file: !679, line: 179, type: !711)
!917 = !DILocation(line: 179, column: 66, scope: !909)
!918 = !DILocalVariable(name: "retval", scope: !909, file: !679, line: 181, type: !325)
!919 = !DILocation(line: 181, column: 6, scope: !909)
!920 = !DILocalVariable(name: "p", scope: !909, file: !679, line: 183, type: !333)
!921 = !DILocation(line: 183, column: 8, scope: !909)
!922 = !DILocalVariable(name: "fmt", scope: !909, file: !679, line: 183, type: !327)
!923 = !DILocation(line: 183, column: 11, scope: !909)
!924 = !DILocalVariable(name: "tmp", scope: !909, file: !679, line: 186, type: !325)
!925 = !DILocation(line: 186, column: 6, scope: !909)
!926 = !DILocalVariable(name: "tmp2", scope: !909, file: !679, line: 187, type: !413)
!927 = !DILocation(line: 187, column: 15, scope: !909)
!928 = !DILocation(line: 189, column: 10, scope: !909)
!929 = !DILocation(line: 189, column: 9, scope: !909)
!930 = !DILocation(line: 189, column: 8, scope: !909)
!931 = !DILocation(line: 189, column: 6, scope: !909)
!932 = !DILocation(line: 190, column: 10, scope: !909)
!933 = !DILocation(line: 190, column: 2, scope: !909)
!934 = !DILocation(line: 195, column: 29, scope: !935)
!935 = distinct !DILexicalBlock(scope: !909, file: !679, line: 190, column: 15)
!936 = !DILocation(line: 195, column: 34, scope: !935)
!937 = !DILocation(line: 195, column: 3, scope: !935)
!938 = !DILocation(line: 196, column: 3, scope: !935)
!939 = !DILocation(line: 199, column: 29, scope: !935)
!940 = !DILocation(line: 199, column: 3, scope: !935)
!941 = !DILocation(line: 200, column: 29, scope: !935)
!942 = !DILocation(line: 200, column: 3, scope: !935)
!943 = !DILocation(line: 201, column: 3, scope: !935)
!944 = !DILocation(line: 205, column: 29, scope: !935)
!945 = !DILocation(line: 205, column: 3, scope: !935)
!946 = !DILocation(line: 206, column: 29, scope: !935)
!947 = !DILocation(line: 206, column: 3, scope: !935)
!948 = !DILocation(line: 207, column: 3, scope: !935)
!949 = !DILocation(line: 210, column: 29, scope: !935)
!950 = !DILocation(line: 210, column: 3, scope: !935)
!951 = !DILocation(line: 211, column: 29, scope: !935)
!952 = !DILocation(line: 211, column: 3, scope: !935)
!953 = !DILocation(line: 212, column: 3, scope: !935)
!954 = !DILocation(line: 215, column: 29, scope: !935)
!955 = !DILocation(line: 215, column: 3, scope: !935)
!956 = !DILocation(line: 216, column: 29, scope: !935)
!957 = !DILocation(line: 216, column: 3, scope: !935)
!958 = !DILocation(line: 217, column: 3, scope: !935)
!959 = !DILocation(line: 220, column: 29, scope: !935)
!960 = !DILocation(line: 220, column: 3, scope: !935)
!961 = !DILocation(line: 221, column: 3, scope: !935)
!962 = !DILocation(line: 224, column: 29, scope: !935)
!963 = !DILocation(line: 224, column: 3, scope: !935)
!964 = !DILocation(line: 225, column: 29, scope: !935)
!965 = !DILocation(line: 225, column: 3, scope: !935)
!966 = !DILocation(line: 226, column: 3, scope: !935)
!967 = !DILocation(line: 229, column: 29, scope: !935)
!968 = !DILocation(line: 229, column: 3, scope: !935)
!969 = !DILocation(line: 230, column: 29, scope: !935)
!970 = !DILocation(line: 230, column: 3, scope: !935)
!971 = !DILocation(line: 231, column: 3, scope: !935)
!972 = !DILocation(line: 235, column: 29, scope: !935)
!973 = !DILocation(line: 235, column: 3, scope: !935)
!974 = !DILocation(line: 236, column: 29, scope: !935)
!975 = !DILocation(line: 236, column: 3, scope: !935)
!976 = !DILocation(line: 237, column: 3, scope: !935)
!977 = !DILocation(line: 240, column: 29, scope: !935)
!978 = !DILocation(line: 240, column: 3, scope: !935)
!979 = !DILocation(line: 241, column: 29, scope: !935)
!980 = !DILocation(line: 241, column: 3, scope: !935)
!981 = !DILocation(line: 242, column: 3, scope: !935)
!982 = !DILocation(line: 244, column: 29, scope: !935)
!983 = !DILocation(line: 244, column: 3, scope: !935)
!984 = !DILocation(line: 245, column: 29, scope: !935)
!985 = !DILocation(line: 245, column: 3, scope: !935)
!986 = !DILocation(line: 246, column: 3, scope: !935)
!987 = !DILocation(line: 249, column: 22, scope: !935)
!988 = !DILocation(line: 249, column: 30, scope: !935)
!989 = !DILocation(line: 249, column: 35, scope: !935)
!990 = !DILocation(line: 249, column: 3, scope: !935)
!991 = !DILocation(line: 250, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !935, file: !679, line: 250, column: 7)
!993 = !DILocation(line: 250, column: 8, scope: !992)
!994 = !DILocation(line: 250, column: 7, scope: !992)
!995 = !DILocation(line: 250, column: 20, scope: !992)
!996 = !DILocation(line: 250, column: 7, scope: !935)
!997 = !DILocation(line: 252, column: 6, scope: !992)
!998 = !DILocation(line: 252, column: 13, scope: !992)
!999 = !DILocation(line: 252, column: 4, scope: !992)
!1000 = !DILocation(line: 254, column: 3, scope: !935)
!1001 = !DILocation(line: 257, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !935, file: !679, line: 257, column: 7)
!1003 = !DILocation(line: 257, column: 8, scope: !1002)
!1004 = !DILocation(line: 257, column: 7, scope: !1002)
!1005 = !DILocation(line: 257, column: 20, scope: !1002)
!1006 = !DILocation(line: 257, column: 26, scope: !1002)
!1007 = !DILocation(line: 257, column: 31, scope: !1008)
!1008 = !DILexicalBlockFile(scope: !1002, file: !679, discriminator: 1)
!1009 = !DILocation(line: 257, column: 30, scope: !1008)
!1010 = !DILocation(line: 257, column: 29, scope: !1008)
!1011 = !DILocation(line: 257, column: 42, scope: !1008)
!1012 = !DILocation(line: 257, column: 7, scope: !1008)
!1013 = !DILocation(line: 258, column: 4, scope: !1002)
!1014 = !DILocation(line: 260, column: 17, scope: !935)
!1015 = !DILocation(line: 260, column: 16, scope: !935)
!1016 = !DILocation(line: 260, column: 15, scope: !935)
!1017 = !DILocation(line: 260, column: 27, scope: !935)
!1018 = !DILocation(line: 260, column: 31, scope: !935)
!1019 = !DILocation(line: 260, column: 34, scope: !935)
!1020 = !DILocation(line: 260, column: 12, scope: !935)
!1021 = !DILocation(line: 260, column: 7, scope: !935)
!1022 = !DILocation(line: 261, column: 7, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !935, file: !679, line: 261, column: 7)
!1024 = !DILocation(line: 261, column: 11, scope: !1023)
!1025 = !DILocation(line: 261, column: 7, scope: !935)
!1026 = !DILocation(line: 262, column: 10, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !679, line: 262, column: 8)
!1028 = distinct !DILexicalBlock(scope: !1023, file: !679, line: 261, column: 18)
!1029 = !DILocation(line: 262, column: 9, scope: !1027)
!1030 = !DILocation(line: 262, column: 8, scope: !1027)
!1031 = !DILocation(line: 262, column: 29, scope: !1027)
!1032 = !DILocation(line: 262, column: 11, scope: !1027)
!1033 = !DILocation(line: 262, column: 12, scope: !1027)
!1034 = !DILocation(line: 262, column: 8, scope: !1028)
!1035 = !DILocation(line: 263, column: 5, scope: !1027)
!1036 = !DILocation(line: 265, column: 13, scope: !1028)
!1037 = !DILocation(line: 265, column: 12, scope: !1028)
!1038 = !DILocation(line: 265, column: 11, scope: !1028)
!1039 = !DILocation(line: 265, column: 24, scope: !1028)
!1040 = !DILocation(line: 265, column: 35, scope: !1041)
!1041 = !DILexicalBlockFile(scope: !1028, file: !679, discriminator: 1)
!1042 = !DILocation(line: 265, column: 34, scope: !1041)
!1043 = !DILocation(line: 265, column: 33, scope: !1041)
!1044 = !DILocation(line: 265, column: 46, scope: !1041)
!1045 = !DILocation(line: 265, column: 11, scope: !1041)
!1046 = !DILocation(line: 265, column: 56, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1028, file: !679, discriminator: 2)
!1048 = !DILocation(line: 265, column: 55, scope: !1047)
!1049 = !DILocation(line: 265, column: 54, scope: !1047)
!1050 = !DILocation(line: 265, column: 67, scope: !1047)
!1051 = !DILocation(line: 265, column: 11, scope: !1047)
!1052 = !DILocation(line: 265, column: 11, scope: !1053)
!1053 = !DILexicalBlockFile(scope: !1028, file: !679, discriminator: 3)
!1054 = !DILocation(line: 265, column: 8, scope: !1053)
!1055 = !DILocation(line: 267, column: 8, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1028, file: !679, line: 267, column: 8)
!1057 = !DILocation(line: 267, column: 12, scope: !1056)
!1058 = !DILocation(line: 267, column: 8, scope: !1028)
!1059 = !DILocation(line: 268, column: 5, scope: !1056)
!1060 = !DILocation(line: 269, column: 3, scope: !1028)
!1061 = !DILocation(line: 270, column: 12, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1023, file: !679, line: 270, column: 12)
!1063 = !DILocation(line: 270, column: 16, scope: !1062)
!1064 = !DILocation(line: 270, column: 12, scope: !1023)
!1065 = !DILocation(line: 271, column: 10, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !679, line: 271, column: 8)
!1067 = distinct !DILexicalBlock(scope: !1062, file: !679, line: 270, column: 21)
!1068 = !DILocation(line: 271, column: 9, scope: !1066)
!1069 = !DILocation(line: 271, column: 8, scope: !1066)
!1070 = !DILocation(line: 271, column: 29, scope: !1066)
!1071 = !DILocation(line: 271, column: 11, scope: !1066)
!1072 = !DILocation(line: 271, column: 12, scope: !1066)
!1073 = !DILocation(line: 271, column: 8, scope: !1067)
!1074 = !DILocation(line: 272, column: 5, scope: !1066)
!1075 = !DILocation(line: 274, column: 10, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1067, file: !679, line: 274, column: 8)
!1077 = !DILocation(line: 274, column: 9, scope: !1076)
!1078 = !DILocation(line: 274, column: 8, scope: !1076)
!1079 = !DILocation(line: 274, column: 21, scope: !1076)
!1080 = !DILocation(line: 274, column: 8, scope: !1067)
!1081 = !DILocation(line: 275, column: 19, scope: !1076)
!1082 = !DILocation(line: 275, column: 18, scope: !1076)
!1083 = !DILocation(line: 275, column: 17, scope: !1076)
!1084 = !DILocation(line: 275, column: 15, scope: !1076)
!1085 = !DILocation(line: 275, column: 30, scope: !1076)
!1086 = !DILocation(line: 275, column: 9, scope: !1076)
!1087 = !DILocation(line: 275, column: 5, scope: !1076)
!1088 = !DILocation(line: 276, column: 15, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1076, file: !679, line: 276, column: 13)
!1090 = !DILocation(line: 276, column: 14, scope: !1089)
!1091 = !DILocation(line: 276, column: 13, scope: !1089)
!1092 = !DILocation(line: 276, column: 26, scope: !1089)
!1093 = !DILocation(line: 276, column: 13, scope: !1076)
!1094 = !DILocation(line: 277, column: 19, scope: !1089)
!1095 = !DILocation(line: 277, column: 18, scope: !1089)
!1096 = !DILocation(line: 277, column: 17, scope: !1089)
!1097 = !DILocation(line: 277, column: 15, scope: !1089)
!1098 = !DILocation(line: 277, column: 30, scope: !1089)
!1099 = !DILocation(line: 277, column: 9, scope: !1089)
!1100 = !DILocation(line: 277, column: 5, scope: !1089)
!1101 = !DILocation(line: 279, column: 14, scope: !1089)
!1102 = !DILocation(line: 279, column: 13, scope: !1089)
!1103 = !DILocation(line: 279, column: 12, scope: !1089)
!1104 = !DILocation(line: 279, column: 25, scope: !1089)
!1105 = !DILocation(line: 279, column: 9, scope: !1089)
!1106 = !DILocation(line: 280, column: 3, scope: !1067)
!1107 = !DILocation(line: 282, column: 10, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !679, line: 282, column: 8)
!1109 = distinct !DILexicalBlock(scope: !1062, file: !679, line: 281, column: 8)
!1110 = !DILocation(line: 282, column: 9, scope: !1108)
!1111 = !DILocation(line: 282, column: 8, scope: !1108)
!1112 = !DILocation(line: 282, column: 29, scope: !1108)
!1113 = !DILocation(line: 282, column: 11, scope: !1108)
!1114 = !DILocation(line: 282, column: 12, scope: !1108)
!1115 = !DILocation(line: 282, column: 8, scope: !1109)
!1116 = !DILocation(line: 283, column: 5, scope: !1108)
!1117 = !DILocation(line: 285, column: 33, scope: !1109)
!1118 = !DILocation(line: 285, column: 32, scope: !1109)
!1119 = !DILocation(line: 285, column: 31, scope: !1109)
!1120 = !DILocation(line: 285, column: 10, scope: !1109)
!1121 = !DILocation(line: 285, column: 8, scope: !1109)
!1122 = !DILocation(line: 288, column: 10, scope: !935)
!1123 = !DILocation(line: 290, column: 20, scope: !935)
!1124 = !DILocation(line: 290, column: 25, scope: !935)
!1125 = !DILocation(line: 290, column: 29, scope: !935)
!1126 = !DILocation(line: 290, column: 37, scope: !935)
!1127 = !DILocation(line: 290, column: 3, scope: !935)
!1128 = !DILocation(line: 291, column: 3, scope: !935)
!1129 = !DILocation(line: 294, column: 8, scope: !935)
!1130 = !DILocation(line: 295, column: 12, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !935, file: !679, line: 295, column: 3)
!1132 = !DILocation(line: 295, column: 8, scope: !1131)
!1133 = !DILocation(line: 295, column: 17, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1135, file: !679, discriminator: 1)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !679, line: 295, column: 3)
!1136 = !DILocation(line: 295, column: 21, scope: !1134)
!1137 = !DILocation(line: 295, column: 3, scope: !1134)
!1138 = !DILocation(line: 296, column: 18, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !679, line: 296, column: 8)
!1140 = distinct !DILexicalBlock(scope: !1135, file: !679, line: 295, column: 33)
!1141 = !DILocation(line: 296, column: 8, scope: !1139)
!1142 = !DILocation(line: 296, column: 10, scope: !1139)
!1143 = !DILocation(line: 296, column: 9, scope: !1139)
!1144 = !DILocation(line: 296, column: 29, scope: !1139)
!1145 = !DILocation(line: 296, column: 11, scope: !1139)
!1146 = !DILocation(line: 296, column: 12, scope: !1139)
!1147 = !DILocation(line: 296, column: 8, scope: !1140)
!1148 = !DILocation(line: 297, column: 10, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1139, file: !679, line: 296, column: 34)
!1150 = !DILocation(line: 298, column: 5, scope: !1149)
!1151 = !DILocation(line: 300, column: 9, scope: !1140)
!1152 = !DILocation(line: 301, column: 43, scope: !1140)
!1153 = !DILocation(line: 301, column: 33, scope: !1140)
!1154 = !DILocation(line: 301, column: 35, scope: !1140)
!1155 = !DILocation(line: 301, column: 34, scope: !1140)
!1156 = !DILocation(line: 301, column: 12, scope: !1140)
!1157 = !DILocation(line: 301, column: 9, scope: !1140)
!1158 = !DILocation(line: 302, column: 3, scope: !1140)
!1159 = !DILocation(line: 295, column: 26, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1135, file: !679, discriminator: 2)
!1161 = !DILocation(line: 295, column: 3, scope: !1160)
!1162 = distinct !{!1162, !1163}
!1163 = !DILocation(line: 295, column: 3, scope: !935)
!1164 = !DILocation(line: 304, column: 7, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !935, file: !679, line: 304, column: 7)
!1166 = !DILocation(line: 304, column: 12, scope: !1165)
!1167 = !DILocation(line: 304, column: 7, scope: !935)
!1168 = !DILocation(line: 305, column: 4, scope: !1165)
!1169 = !DILocation(line: 307, column: 10, scope: !935)
!1170 = !DILocation(line: 309, column: 22, scope: !935)
!1171 = !DILocation(line: 309, column: 27, scope: !935)
!1172 = !DILocation(line: 309, column: 31, scope: !935)
!1173 = !DILocation(line: 309, column: 39, scope: !935)
!1174 = !DILocation(line: 309, column: 3, scope: !935)
!1175 = !DILocation(line: 310, column: 3, scope: !935)
!1176 = !DILocation(line: 313, column: 14, scope: !935)
!1177 = !DILocation(line: 313, column: 28, scope: !935)
!1178 = !DILocation(line: 313, column: 7, scope: !935)
!1179 = !DILocation(line: 313, column: 5, scope: !935)
!1180 = !DILocation(line: 314, column: 7, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !935, file: !679, line: 314, column: 7)
!1182 = !DILocation(line: 314, column: 9, scope: !1181)
!1183 = !DILocation(line: 314, column: 7, scope: !935)
!1184 = !DILocation(line: 315, column: 30, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !679, line: 314, column: 17)
!1186 = !DILocation(line: 315, column: 4, scope: !1185)
!1187 = !DILocation(line: 316, column: 30, scope: !1185)
!1188 = !DILocation(line: 316, column: 4, scope: !1185)
!1189 = !DILocation(line: 317, column: 30, scope: !1185)
!1190 = !DILocation(line: 317, column: 50, scope: !1185)
!1191 = !DILocation(line: 317, column: 52, scope: !1185)
!1192 = !DILocation(line: 317, column: 51, scope: !1185)
!1193 = !DILocation(line: 317, column: 43, scope: !1185)
!1194 = !DILocation(line: 317, column: 65, scope: !1185)
!1195 = !DILocation(line: 317, column: 35, scope: !1185)
!1196 = !DILocation(line: 317, column: 4, scope: !1185)
!1197 = !DILocation(line: 318, column: 4, scope: !1185)
!1198 = !DILocation(line: 322, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !935, file: !679, line: 322, column: 7)
!1200 = !DILocation(line: 322, column: 11, scope: !1199)
!1201 = !DILocation(line: 322, column: 7, scope: !935)
!1202 = !DILocation(line: 322, column: 23, scope: !1203)
!1203 = !DILexicalBlockFile(scope: !1199, file: !679, discriminator: 1)
!1204 = !DILocation(line: 322, column: 19, scope: !1203)
!1205 = !DILocation(line: 323, column: 14, scope: !935)
!1206 = !DILocation(line: 323, column: 28, scope: !935)
!1207 = !DILocation(line: 323, column: 7, scope: !935)
!1208 = !DILocation(line: 323, column: 5, scope: !935)
!1209 = !DILocation(line: 324, column: 7, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !935, file: !679, line: 324, column: 7)
!1211 = !DILocation(line: 324, column: 9, scope: !1210)
!1212 = !DILocation(line: 324, column: 7, scope: !935)
!1213 = !DILocation(line: 325, column: 30, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !679, line: 324, column: 17)
!1215 = !DILocation(line: 325, column: 4, scope: !1214)
!1216 = !DILocation(line: 326, column: 30, scope: !1214)
!1217 = !DILocation(line: 326, column: 50, scope: !1214)
!1218 = !DILocation(line: 326, column: 52, scope: !1214)
!1219 = !DILocation(line: 326, column: 51, scope: !1214)
!1220 = !DILocation(line: 326, column: 43, scope: !1214)
!1221 = !DILocation(line: 326, column: 65, scope: !1214)
!1222 = !DILocation(line: 326, column: 35, scope: !1214)
!1223 = !DILocation(line: 326, column: 4, scope: !1214)
!1224 = !DILocation(line: 327, column: 30, scope: !1214)
!1225 = !DILocation(line: 327, column: 4, scope: !1214)
!1226 = !DILocation(line: 328, column: 4, scope: !1214)
!1227 = !DILocation(line: 332, column: 7, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !935, file: !679, line: 332, column: 7)
!1229 = !DILocation(line: 332, column: 11, scope: !1228)
!1230 = !DILocation(line: 332, column: 7, scope: !935)
!1231 = !DILocation(line: 332, column: 23, scope: !1232)
!1232 = !DILexicalBlockFile(scope: !1228, file: !679, discriminator: 1)
!1233 = !DILocation(line: 332, column: 19, scope: !1232)
!1234 = !DILocation(line: 333, column: 14, scope: !935)
!1235 = !DILocation(line: 333, column: 32, scope: !935)
!1236 = !DILocation(line: 333, column: 7, scope: !935)
!1237 = !DILocation(line: 333, column: 5, scope: !935)
!1238 = !DILocation(line: 334, column: 7, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !935, file: !679, line: 334, column: 7)
!1240 = !DILocation(line: 334, column: 9, scope: !1239)
!1241 = !DILocation(line: 334, column: 7, scope: !935)
!1242 = !DILocation(line: 335, column: 30, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1239, file: !679, line: 334, column: 17)
!1244 = !DILocation(line: 335, column: 4, scope: !1243)
!1245 = !DILocation(line: 336, column: 30, scope: !1243)
!1246 = !DILocation(line: 336, column: 52, scope: !1243)
!1247 = !DILocation(line: 336, column: 54, scope: !1243)
!1248 = !DILocation(line: 336, column: 53, scope: !1243)
!1249 = !DILocation(line: 336, column: 45, scope: !1243)
!1250 = !DILocation(line: 336, column: 44, scope: !1243)
!1251 = !DILocation(line: 336, column: 71, scope: !1243)
!1252 = !DILocation(line: 336, column: 35, scope: !1243)
!1253 = !DILocation(line: 336, column: 4, scope: !1243)
!1254 = !DILocation(line: 337, column: 30, scope: !1243)
!1255 = !DILocation(line: 337, column: 4, scope: !1243)
!1256 = !DILocation(line: 338, column: 4, scope: !1243)
!1257 = !DILocation(line: 341, column: 3, scope: !935)
!1258 = !DILocation(line: 344, column: 9, scope: !909)
!1259 = !DILocation(line: 344, column: 2, scope: !909)
!1260 = !DILocation(line: 345, column: 1, scope: !909)
!1261 = distinct !DISubprogram(name: "format_expand_code", scope: !679, file: !679, line: 66, type: !1262, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !668, !541, !711}
!1264 = !DILocalVariable(name: "format", arg: 1, scope: !1261, file: !679, line: 66, type: !668)
!1265 = !DILocation(line: 66, column: 45, scope: !1261)
!1266 = !DILocalVariable(name: "out", arg: 2, scope: !1261, file: !679, line: 66, type: !541)
!1267 = !DILocation(line: 66, column: 62, scope: !1261)
!1268 = !DILocalVariable(name: "flags", arg: 3, scope: !1261, file: !679, line: 66, type: !711)
!1269 = !DILocation(line: 66, column: 72, scope: !1261)
!1270 = !DILocalVariable(name: "set", scope: !1261, file: !679, line: 68, type: !325)
!1271 = !DILocation(line: 68, column: 6, scope: !1261)
!1272 = !DILocation(line: 70, column: 6, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1261, file: !679, line: 70, column: 6)
!1274 = !DILocation(line: 70, column: 12, scope: !1273)
!1275 = !DILocation(line: 70, column: 6, scope: !1261)
!1276 = !DILocation(line: 72, column: 3, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1273, file: !679, line: 70, column: 20)
!1278 = !DILocation(line: 72, column: 12, scope: !1279)
!1279 = !DILexicalBlockFile(scope: !1277, file: !679, discriminator: 1)
!1280 = !DILocation(line: 72, column: 11, scope: !1279)
!1281 = !DILocation(line: 72, column: 10, scope: !1279)
!1282 = !DILocation(line: 72, column: 19, scope: !1279)
!1283 = !DILocation(line: 72, column: 26, scope: !1279)
!1284 = !DILocation(line: 72, column: 31, scope: !1285)
!1285 = !DILexicalBlockFile(scope: !1277, file: !679, discriminator: 2)
!1286 = !DILocation(line: 72, column: 30, scope: !1285)
!1287 = !DILocation(line: 72, column: 29, scope: !1285)
!1288 = !DILocation(line: 72, column: 38, scope: !1285)
!1289 = !DILocation(line: 72, column: 3, scope: !1290)
!1290 = !DILexicalBlockFile(scope: !1277, file: !679, discriminator: 3)
!1291 = !DILocation(line: 73, column: 6, scope: !1277)
!1292 = !DILocation(line: 73, column: 13, scope: !1277)
!1293 = !DILocation(line: 72, column: 3, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1277, file: !679, discriminator: 4)
!1295 = distinct !{!1295, !1276}
!1296 = !DILocation(line: 74, column: 3, scope: !1277)
!1297 = !DILocation(line: 77, column: 6, scope: !1261)
!1298 = !DILocation(line: 78, column: 4, scope: !1261)
!1299 = !DILocation(line: 78, column: 11, scope: !1261)
!1300 = !DILocation(line: 79, column: 2, scope: !1261)
!1301 = !DILocation(line: 79, column: 11, scope: !1302)
!1302 = !DILexicalBlockFile(scope: !1261, file: !679, discriminator: 1)
!1303 = !DILocation(line: 79, column: 10, scope: !1302)
!1304 = !DILocation(line: 79, column: 9, scope: !1302)
!1305 = !DILocation(line: 79, column: 18, scope: !1302)
!1306 = !DILocation(line: 79, column: 25, scope: !1302)
!1307 = !DILocation(line: 79, column: 30, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1261, file: !679, discriminator: 2)
!1309 = !DILocation(line: 79, column: 29, scope: !1308)
!1310 = !DILocation(line: 79, column: 28, scope: !1308)
!1311 = !DILocation(line: 79, column: 37, scope: !1308)
!1312 = !DILocation(line: 79, column: 2, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1261, file: !679, discriminator: 3)
!1314 = !DILocation(line: 80, column: 9, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1316, file: !679, line: 80, column: 7)
!1316 = distinct !DILexicalBlock(scope: !1261, file: !679, line: 79, column: 46)
!1317 = !DILocation(line: 80, column: 8, scope: !1315)
!1318 = !DILocation(line: 80, column: 7, scope: !1315)
!1319 = !DILocation(line: 80, column: 16, scope: !1315)
!1320 = !DILocation(line: 80, column: 7, scope: !1316)
!1321 = !DILocation(line: 81, column: 8, scope: !1315)
!1322 = !DILocation(line: 81, column: 4, scope: !1315)
!1323 = !DILocation(line: 82, column: 14, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1315, file: !679, line: 82, column: 12)
!1325 = !DILocation(line: 82, column: 13, scope: !1324)
!1326 = !DILocation(line: 82, column: 12, scope: !1324)
!1327 = !DILocation(line: 82, column: 21, scope: !1324)
!1328 = !DILocation(line: 82, column: 12, scope: !1315)
!1329 = !DILocation(line: 83, column: 8, scope: !1324)
!1330 = !DILocation(line: 83, column: 4, scope: !1324)
!1331 = !DILocation(line: 84, column: 18, scope: !1324)
!1332 = !DILocation(line: 84, column: 17, scope: !1324)
!1333 = !DILocation(line: 84, column: 16, scope: !1324)
!1334 = !DILocation(line: 84, column: 8, scope: !1324)
!1335 = !DILocation(line: 87, column: 15, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1324, file: !679, line: 84, column: 26)
!1337 = !DILocation(line: 87, column: 14, scope: !1336)
!1338 = !DILocation(line: 87, column: 14, scope: !1339)
!1339 = !DILexicalBlockFile(scope: !1336, file: !679, discriminator: 1)
!1340 = !DILocation(line: 88, column: 7, scope: !1336)
!1341 = !DILocation(line: 88, column: 6, scope: !1336)
!1342 = !DILocation(line: 88, column: 5, scope: !1336)
!1343 = !DILocation(line: 88, column: 14, scope: !1336)
!1344 = !DILocation(line: 87, column: 14, scope: !1345)
!1345 = !DILexicalBlockFile(scope: !1336, file: !679, discriminator: 2)
!1346 = !DILocation(line: 87, column: 14, scope: !1347)
!1347 = !DILexicalBlockFile(scope: !1336, file: !679, discriminator: 3)
!1348 = !DILocation(line: 87, column: 5, scope: !1347)
!1349 = !DILocation(line: 87, column: 11, scope: !1347)
!1350 = !DILocation(line: 90, column: 4, scope: !1336)
!1351 = !DILocation(line: 92, column: 14, scope: !1336)
!1352 = !DILocation(line: 92, column: 5, scope: !1336)
!1353 = !DILocation(line: 92, column: 11, scope: !1336)
!1354 = !DILocation(line: 94, column: 4, scope: !1336)
!1355 = !DILocation(line: 96, column: 14, scope: !1336)
!1356 = !DILocation(line: 96, column: 5, scope: !1336)
!1357 = !DILocation(line: 96, column: 11, scope: !1336)
!1358 = !DILocation(line: 98, column: 4, scope: !1336)
!1359 = !DILocation(line: 101, column: 5, scope: !1316)
!1360 = !DILocation(line: 101, column: 12, scope: !1316)
!1361 = !DILocation(line: 79, column: 2, scope: !1362)
!1362 = !DILexicalBlockFile(scope: !1261, file: !679, discriminator: 4)
!1363 = distinct !{!1363, !1300}
!1364 = !DILocation(line: 103, column: 1, scope: !1261)
!1365 = distinct !DISubprogram(name: "format_read_arglist", scope: !679, file: !679, line: 347, type: !1366, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !712)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1368, !726, !648, !325, !333, !325}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 345, size: 192, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1369, file: !1, line: 345, baseType: !413, size: 32, align: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1369, file: !1, line: 345, baseType: !413, size: 32, align: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1369, file: !1, line: 345, baseType: !324, size: 64, align: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1369, file: !1, line: 345, baseType: !324, size: 64, align: 64, offset: 128)
!1375 = !DILocalVariable(name: "va", arg: 1, scope: !1365, file: !679, line: 347, type: !1368)
!1376 = !DILocation(line: 347, column: 34, scope: !1365)
!1377 = !DILocalVariable(name: "format", arg: 2, scope: !1365, file: !679, line: 347, type: !726)
!1378 = !DILocation(line: 347, column: 50, scope: !1365)
!1379 = !DILocalVariable(name: "arglist", arg: 3, scope: !1365, file: !679, line: 348, type: !648)
!1380 = !DILocation(line: 348, column: 12, scope: !1365)
!1381 = !DILocalVariable(name: "arglist_size", arg: 4, scope: !1365, file: !679, line: 348, type: !325)
!1382 = !DILocation(line: 348, column: 25, scope: !1365)
!1383 = !DILocalVariable(name: "buffer", arg: 5, scope: !1365, file: !679, line: 349, type: !333)
!1384 = !DILocation(line: 349, column: 11, scope: !1365)
!1385 = !DILocalVariable(name: "buffer_size", arg: 6, scope: !1365, file: !679, line: 349, type: !325)
!1386 = !DILocation(line: 349, column: 23, scope: !1365)
!1387 = !DILocalVariable(name: "num", scope: !1365, file: !679, line: 351, type: !325)
!1388 = !DILocation(line: 351, column: 6, scope: !1365)
!1389 = !DILocalVariable(name: "len", scope: !1365, file: !679, line: 351, type: !325)
!1390 = !DILocation(line: 351, column: 11, scope: !1365)
!1391 = !DILocalVariable(name: "bufpos", scope: !1365, file: !679, line: 351, type: !325)
!1392 = !DILocation(line: 351, column: 16, scope: !1365)
!1393 = !DILocation(line: 353, column: 2, scope: !1365)
!1394 = distinct !{!1394, !1393}
!1395 = !DILocation(line: 353, column: 10, scope: !1396)
!1396 = !DILexicalBlockFile(scope: !1397, file: !679, discriminator: 1)
!1397 = distinct !DILexicalBlock(scope: !1398, file: !679, line: 353, column: 10)
!1398 = distinct !DILexicalBlock(scope: !1365, file: !679, line: 353, column: 4)
!1399 = !DILocation(line: 353, column: 18, scope: !1396)
!1400 = !DILocation(line: 353, column: 27, scope: !1396)
!1401 = !DILocation(line: 353, column: 25, scope: !1396)
!1402 = !DILocation(line: 353, column: 43, scope: !1403)
!1403 = !DILexicalBlockFile(scope: !1404, file: !679, discriminator: 2)
!1404 = distinct !DILexicalBlock(scope: !1397, file: !679, line: 353, column: 41)
!1405 = !DILocation(line: 353, column: 52, scope: !1406)
!1406 = !DILexicalBlockFile(scope: !1407, file: !679, discriminator: 3)
!1407 = distinct !DILexicalBlock(scope: !1397, file: !679, line: 353, column: 50)
!1408 = !DILocation(line: 353, column: 154, scope: !1406)
!1409 = !DILocation(line: 353, column: 165, scope: !1410)
!1410 = !DILexicalBlockFile(scope: !1398, file: !679, discriminator: 4)
!1411 = !DILocation(line: 355, column: 9, scope: !1365)
!1412 = !DILocation(line: 356, column: 10, scope: !1365)
!1413 = !DILocation(line: 356, column: 18, scope: !1365)
!1414 = !DILocation(line: 356, column: 2, scope: !1365)
!1415 = !DILocation(line: 356, column: 26, scope: !1365)
!1416 = !DILocation(line: 357, column: 11, scope: !1417)
!1417 = distinct !DILexicalBlock(scope: !1365, file: !679, line: 357, column: 2)
!1418 = !DILocation(line: 357, column: 7, scope: !1417)
!1419 = !DILocation(line: 357, column: 16, scope: !1420)
!1420 = !DILexicalBlockFile(scope: !1421, file: !679, discriminator: 1)
!1421 = distinct !DILexicalBlock(scope: !1417, file: !679, line: 357, column: 2)
!1422 = !DILocation(line: 357, column: 22, scope: !1420)
!1423 = !DILocation(line: 357, column: 30, scope: !1420)
!1424 = !DILocation(line: 357, column: 20, scope: !1420)
!1425 = !DILocation(line: 357, column: 2, scope: !1420)
!1426 = !DILocation(line: 358, column: 30, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1421, file: !679, line: 357, column: 45)
!1428 = !DILocation(line: 358, column: 11, scope: !1427)
!1429 = !DILocation(line: 358, column: 19, scope: !1427)
!1430 = !DILocation(line: 358, column: 3, scope: !1427)
!1431 = !DILocation(line: 360, column: 27, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1427, file: !679, line: 358, column: 36)
!1433 = !DILocation(line: 360, column: 27, scope: !1434)
!1434 = !DILexicalBlockFile(scope: !1432, file: !679, discriminator: 1)
!1435 = !DILocation(line: 360, column: 27, scope: !1436)
!1436 = !DILexicalBlockFile(scope: !1432, file: !679, discriminator: 2)
!1437 = !DILocation(line: 360, column: 27, scope: !1438)
!1438 = !DILexicalBlockFile(scope: !1432, file: !679, discriminator: 3)
!1439 = !DILocation(line: 360, column: 12, scope: !1438)
!1440 = !DILocation(line: 360, column: 4, scope: !1438)
!1441 = !DILocation(line: 360, column: 17, scope: !1438)
!1442 = !DILocation(line: 361, column: 16, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1432, file: !679, line: 361, column: 8)
!1444 = !DILocation(line: 361, column: 8, scope: !1443)
!1445 = !DILocation(line: 361, column: 21, scope: !1443)
!1446 = !DILocation(line: 361, column: 8, scope: !1432)
!1447 = !DILocation(line: 362, column: 13, scope: !1443)
!1448 = !DILocation(line: 362, column: 5, scope: !1443)
!1449 = !DILocation(line: 362, column: 18, scope: !1443)
!1450 = !DILocation(line: 363, column: 4, scope: !1432)
!1451 = !DILocalVariable(name: "d", scope: !1452, file: !679, line: 365, type: !325)
!1452 = distinct !DILexicalBlock(scope: !1432, file: !679, line: 364, column: 20)
!1453 = !DILocation(line: 365, column: 8, scope: !1452)
!1454 = !DILocation(line: 365, column: 17, scope: !1452)
!1455 = !DILocation(line: 365, column: 17, scope: !1456)
!1456 = !DILexicalBlockFile(scope: !1452, file: !679, discriminator: 1)
!1457 = !DILocation(line: 365, column: 17, scope: !1458)
!1458 = !DILexicalBlockFile(scope: !1452, file: !679, discriminator: 2)
!1459 = !DILocation(line: 365, column: 17, scope: !1460)
!1460 = !DILexicalBlockFile(scope: !1452, file: !679, discriminator: 3)
!1461 = !DILocation(line: 365, column: 8, scope: !1460)
!1462 = !DILocation(line: 367, column: 8, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1452, file: !679, line: 367, column: 8)
!1464 = !DILocation(line: 367, column: 18, scope: !1463)
!1465 = !DILocation(line: 367, column: 15, scope: !1463)
!1466 = !DILocation(line: 367, column: 8, scope: !1452)
!1467 = !DILocation(line: 368, column: 13, scope: !1468)
!1468 = distinct !DILexicalBlock(scope: !1463, file: !679, line: 367, column: 31)
!1469 = !DILocation(line: 368, column: 5, scope: !1468)
!1470 = !DILocation(line: 368, column: 18, scope: !1468)
!1471 = !DILocation(line: 369, column: 5, scope: !1468)
!1472 = !DILocation(line: 372, column: 19, scope: !1452)
!1473 = !DILocation(line: 372, column: 26, scope: !1452)
!1474 = !DILocation(line: 372, column: 25, scope: !1452)
!1475 = !DILocation(line: 372, column: 12, scope: !1452)
!1476 = !DILocation(line: 372, column: 4, scope: !1452)
!1477 = !DILocation(line: 372, column: 17, scope: !1452)
!1478 = !DILocation(line: 373, column: 21, scope: !1452)
!1479 = !DILocation(line: 373, column: 28, scope: !1452)
!1480 = !DILocation(line: 373, column: 27, scope: !1452)
!1481 = !DILocation(line: 373, column: 36, scope: !1452)
!1482 = !DILocation(line: 373, column: 48, scope: !1452)
!1483 = !DILocation(line: 373, column: 47, scope: !1452)
!1484 = !DILocation(line: 374, column: 13, scope: !1452)
!1485 = !DILocation(line: 373, column: 10, scope: !1452)
!1486 = !DILocation(line: 373, column: 8, scope: !1452)
!1487 = !DILocation(line: 375, column: 14, scope: !1452)
!1488 = !DILocation(line: 375, column: 17, scope: !1452)
!1489 = !DILocation(line: 375, column: 11, scope: !1452)
!1490 = !DILocation(line: 376, column: 4, scope: !1452)
!1491 = !DILocalVariable(name: "l", scope: !1492, file: !679, line: 379, type: !334)
!1492 = distinct !DILexicalBlock(scope: !1432, file: !679, line: 378, column: 21)
!1493 = !DILocation(line: 379, column: 9, scope: !1492)
!1494 = !DILocation(line: 379, column: 19, scope: !1492)
!1495 = !DILocation(line: 379, column: 19, scope: !1496)
!1496 = !DILexicalBlockFile(scope: !1492, file: !679, discriminator: 1)
!1497 = !DILocation(line: 379, column: 19, scope: !1498)
!1498 = !DILexicalBlockFile(scope: !1492, file: !679, discriminator: 2)
!1499 = !DILocation(line: 379, column: 19, scope: !1500)
!1500 = !DILexicalBlockFile(scope: !1492, file: !679, discriminator: 3)
!1501 = !DILocation(line: 379, column: 9, scope: !1500)
!1502 = !DILocation(line: 381, column: 8, scope: !1503)
!1503 = distinct !DILexicalBlock(scope: !1492, file: !679, line: 381, column: 8)
!1504 = !DILocation(line: 381, column: 18, scope: !1503)
!1505 = !DILocation(line: 381, column: 15, scope: !1503)
!1506 = !DILocation(line: 381, column: 8, scope: !1492)
!1507 = !DILocation(line: 382, column: 13, scope: !1508)
!1508 = distinct !DILexicalBlock(scope: !1503, file: !679, line: 381, column: 31)
!1509 = !DILocation(line: 382, column: 5, scope: !1508)
!1510 = !DILocation(line: 382, column: 18, scope: !1508)
!1511 = !DILocation(line: 383, column: 5, scope: !1508)
!1512 = !DILocation(line: 386, column: 19, scope: !1492)
!1513 = !DILocation(line: 386, column: 26, scope: !1492)
!1514 = !DILocation(line: 386, column: 25, scope: !1492)
!1515 = !DILocation(line: 386, column: 12, scope: !1492)
!1516 = !DILocation(line: 386, column: 4, scope: !1492)
!1517 = !DILocation(line: 386, column: 17, scope: !1492)
!1518 = !DILocation(line: 387, column: 21, scope: !1492)
!1519 = !DILocation(line: 387, column: 28, scope: !1492)
!1520 = !DILocation(line: 387, column: 27, scope: !1492)
!1521 = !DILocation(line: 387, column: 36, scope: !1492)
!1522 = !DILocation(line: 387, column: 48, scope: !1492)
!1523 = !DILocation(line: 387, column: 47, scope: !1492)
!1524 = !DILocation(line: 388, column: 14, scope: !1492)
!1525 = !DILocation(line: 387, column: 10, scope: !1492)
!1526 = !DILocation(line: 387, column: 8, scope: !1492)
!1527 = !DILocation(line: 389, column: 14, scope: !1492)
!1528 = !DILocation(line: 389, column: 17, scope: !1492)
!1529 = !DILocation(line: 389, column: 11, scope: !1492)
!1530 = !DILocation(line: 390, column: 4, scope: !1492)
!1531 = !DILocalVariable(name: "f", scope: !1532, file: !679, line: 393, type: !335)
!1532 = distinct !DILexicalBlock(scope: !1432, file: !679, line: 392, column: 22)
!1533 = !DILocation(line: 393, column: 11, scope: !1532)
!1534 = !DILocation(line: 393, column: 23, scope: !1532)
!1535 = !DILocation(line: 393, column: 23, scope: !1536)
!1536 = !DILexicalBlockFile(scope: !1532, file: !679, discriminator: 1)
!1537 = !DILocation(line: 393, column: 23, scope: !1538)
!1538 = !DILexicalBlockFile(scope: !1532, file: !679, discriminator: 2)
!1539 = !DILocation(line: 393, column: 23, scope: !1540)
!1540 = !DILexicalBlockFile(scope: !1532, file: !679, discriminator: 3)
!1541 = !DILocation(line: 393, column: 11, scope: !1540)
!1542 = !DILocation(line: 395, column: 8, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1532, file: !679, line: 395, column: 8)
!1544 = !DILocation(line: 395, column: 18, scope: !1543)
!1545 = !DILocation(line: 395, column: 15, scope: !1543)
!1546 = !DILocation(line: 395, column: 8, scope: !1532)
