; ModuleID = './line6-get.o.i'
source_filename = "./line6-get.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._CONFIG_NODE = type { i32, i8*, i8* }
%struct._GSList = type { i8*, %struct._GSList* }
%struct._CONFIG_REC = type { i8*, i32, i32, i8*, %struct._CONFIG_NODE*, %struct._GHashTable*, %struct._GHashTable*, %struct._GScanner*, %struct._GIOChannel*, i32, i32 }
%struct._GHashTable = type opaque
%struct._GScanner = type { i8*, i32, i32, i8*, %struct._GData*, %struct._GScannerConfig*, i32, %union._GTokenValue, i32, i32, i32, %union._GTokenValue, i32, i32, %struct._GHashTable*, i32, i8*, i8*, i8*, i32, void (%struct._GScanner*, i8*, i32)* }
%struct._GData = type opaque
%struct._GScannerConfig = type { i8*, i8*, i8*, i8*, i24, i32 }
%union._GTokenValue = type { i8* }
%struct._GIOChannel = type { i32, %struct._GIOFuncs*, i8*, %struct._GIConv*, %struct._GIConv*, i8*, i32, i64, %struct._GString*, %struct._GString*, %struct._GString*, [6 x i8], i8, i8*, i8* }
%struct._GIOFuncs = type { i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i8*, i64, i64*, %struct._GError**)*, i32 (%struct._GIOChannel*, i64, i32, %struct._GError**)*, i32 (%struct._GIOChannel*, %struct._GError**)*, %struct._GSource* (%struct._GIOChannel*, i32)*, void (%struct._GIOChannel*)*, i32 (%struct._GIOChannel*, i32, %struct._GError**)*, i32 (%struct._GIOChannel*)* }
%struct._GError = type { i32, i32, i8* }

!6 = !DIEnumerator(name: "NODE_TYPE_KEY", value: 0)
!7 = !DIEnumerator(name: "NODE_TYPE_VALUE", value: 1)
!8 = !DIEnumerator(name: "NODE_TYPE_BLOCK", value: 2)
!9 = !DIEnumerator(name: "NODE_TYPE_LIST", value: 3)
!10 = !DIEnumerator(name: "NODE_TYPE_COMMENT", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 75, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "/usr/include/glib-2.0/glib/gscanner.h", directory: "/home/lichi/Desktop/irssi/task1")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!14 = !DIEnumerator(name: "G_TOKEN_EOF", value: 0)
!15 = !DIEnumerator(name: "G_TOKEN_LEFT_PAREN", value: 40)
!16 = !DIEnumerator(name: "G_TOKEN_RIGHT_PAREN", value: 41)
!17 = !DIEnumerator(name: "G_TOKEN_LEFT_CURLY", value: 123)
!18 = !DIEnumerator(name: "G_TOKEN_RIGHT_CURLY", value: 125)
!19 = !DIEnumerator(name: "G_TOKEN_LEFT_BRACE", value: 91)
!20 = !DIEnumerator(name: "G_TOKEN_RIGHT_BRACE", value: 93)
!21 = !DIEnumerator(name: "G_TOKEN_EQUAL_SIGN", value: 61)
!22 = !DIEnumerator(name: "G_TOKEN_COMMA", value: 44)
!23 = !DIEnumerator(name: "G_TOKEN_NONE", value: 256)
!24 = !DIEnumerator(name: "G_TOKEN_ERROR", value: 257)
!25 = !DIEnumerator(name: "G_TOKEN_CHAR", value: 258)
!26 = !DIEnumerator(name: "G_TOKEN_BINARY", value: 259)
!27 = !DIEnumerator(name: "G_TOKEN_OCTAL", value: 260)
!28 = !DIEnumerator(name: "G_TOKEN_INT", value: 261)
!29 = !DIEnumerator(name: "G_TOKEN_HEX", value: 262)
!30 = !DIEnumerator(name: "G_TOKEN_FLOAT", value: 263)
!31 = !DIEnumerator(name: "G_TOKEN_STRING", value: 264)
!32 = !DIEnumerator(name: "G_TOKEN_SYMBOL", value: 265)
!33 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER", value: 266)
!34 = !DIEnumerator(name: "G_TOKEN_IDENTIFIER_NULL", value: 267)
!35 = !DIEnumerator(name: "G_TOKEN_COMMENT_SINGLE", value: 268)
!36 = !DIEnumerator(name: "G_TOKEN_COMMENT_MULTI", value: 269)
!37 = !DIEnumerator(name: "G_TOKEN_LAST", value: 270)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 69, size: 32, align: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/glib-2.0/glib/giochannel.h", directory: "/home/lichi/Desktop/irssi/task1")
!40 = !{!41, !42, !43, !44}
!41 = !DIEnumerator(name: "G_IO_STATUS_ERROR", value: 0)
!42 = !DIEnumerator(name: "G_IO_STATUS_NORMAL", value: 1)
!43 = !DIEnumerator(name: "G_IO_STATUS_EOF", value: 2)
!44 = !DIEnumerator(name: "G_IO_STATUS_AGAIN", value: 3)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 77, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "G_SEEK_CUR", value: 0)
!48 = !DIEnumerator(name: "G_SEEK_SET", value: 1)
!49 = !DIEnumerator(name: "G_SEEK_END", value: 2)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 31, size: 32, align: 32, elements: !52)
!51 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmain.h", directory: "/home/lichi/Desktop/irssi/task1")
!52 = !{!53, !54, !55, !56, !57, !58}
!53 = !DIEnumerator(name: "G_IO_IN", value: 1)
!54 = !DIEnumerator(name: "G_IO_OUT", value: 4)
!55 = !DIEnumerator(name: "G_IO_PRI", value: 2)
!56 = !DIEnumerator(name: "G_IO_ERR", value: 8)
!57 = !DIEnumerator(name: "G_IO_HUP", value: 16)
!58 = !DIEnumerator(name: "G_IO_NVAL", value: 32)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 84, size: 32, align: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69}
!61 = !DIEnumerator(name: "G_IO_FLAG_APPEND", value: 1)
!62 = !DIEnumerator(name: "G_IO_FLAG_NONBLOCK", value: 2)
!63 = !DIEnumerator(name: "G_IO_FLAG_IS_READABLE", value: 4)
!64 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITABLE", value: 8)
!65 = !DIEnumerator(name: "G_IO_FLAG_IS_WRITEABLE", value: 8)
!66 = !DIEnumerator(name: "G_IO_FLAG_IS_SEEKABLE", value: 16)
!67 = !DIEnumerator(name: "G_IO_FLAG_MASK", value: 31)
!68 = !DIEnumerator(name: "G_IO_FLAG_GET_MASK", value: 31)
!69 = !DIEnumerator(name: "G_IO_FLAG_SET_MASK", value: 3)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 51, size: 32, align: 32, elements: !72)
!71 = !DIFile(filename: "/usr/include/glib-2.0/glib/gmessages.h", directory: "/home/lichi/Desktop/irssi/task1")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81}
!73 = !DIEnumerator(name: "G_LOG_FLAG_RECURSION", value: 1)
!74 = !DIEnumerator(name: "G_LOG_FLAG_FATAL", value: 2)
!75 = !DIEnumerator(name: "G_LOG_LEVEL_ERROR", value: 4)
!76 = !DIEnumerator(name: "G_LOG_LEVEL_CRITICAL", value: 8)
!77 = !DIEnumerator(name: "G_LOG_LEVEL_WARNING", value: 16)
!78 = !DIEnumerator(name: "G_LOG_LEVEL_MESSAGE", value: 32)
!79 = !DIEnumerator(name: "G_LOG_LEVEL_INFO", value: 64)
!80 = !DIEnumerator(name: "G_LOG_LEVEL_DEBUG", value: 128)
!81 = !DIEnumerator(name: "G_LOG_LEVEL_MASK", value: -4)
!82 = !{!83, !84, !88, !90, !97, !95, !99}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "gchar", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/include/glib-2.0/glib/gtypes.h", directory: "/home/lichi/Desktop/irssi/task1")
!87 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_NODE", file: !4, line: 17, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_NODE", file: !4, line: 20, size: 192, align: 64, elements: !93)
!93 = !{!94, !96, !98}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !4, line: 21, baseType: !95, size: 32, align: 32)
!95 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !92, file: !4, line: 22, baseType: !97, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !92, file: !4, line: 23, baseType: !83, size: 64, align: 64, offset: 128)
!99 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!100 = !{i32 2, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!103 = distinct !DISubprogram(name: "config_node_find", scope: !104, file: !104, line: 23, type: !105, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !107)
!104 = !DIFile(filename: "get.c", directory: "/home/lichi/Desktop/irssi/task1")
!105 = !DISubroutineType(types: !106)
!106 = !{!90, !90, !88}
!107 = !{}
!108 = !DILocalVariable(name: "node", arg: 1, scope: !103, file: !104, line: 23, type: !90)
!109 = !DIExpression()
!110 = !DILocation(line: 23, column: 44, scope: !103)
!111 = !DILocalVariable(name: "key", arg: 2, scope: !103, file: !104, line: 23, type: !88)
!112 = !DILocation(line: 23, column: 62, scope: !103)
!113 = !DILocalVariable(name: "tmp", scope: !103, file: !104, line: 25, type: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSList", file: !116, line: 37, baseType: !117)
!116 = !DIFile(filename: "/usr/include/glib-2.0/glib/gslist.h", directory: "/home/lichi/Desktop/irssi/task1")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSList", file: !116, line: 39, size: 128, align: 64, elements: !118)
!118 = !{!119, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !116, line: 41, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpointer", file: !86, line: 77, baseType: !83)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !116, line: 42, baseType: !114, size: 64, align: 64, offset: 64)
!122 = !DILocation(line: 25, column: 10, scope: !103)
!123 = !DILocation(line: 27, column: 2, scope: !103)
!124 = distinct !{!124, !123}
!125 = !DILocation(line: 27, column: 10, scope: !126)
!126 = !DILexicalBlockFile(scope: !127, file: !104, discriminator: 1)
!127 = distinct !DILexicalBlock(scope: !128, file: !104, line: 27, column: 10)
!128 = distinct !DILexicalBlock(scope: !103, file: !104, line: 27, column: 4)
!129 = !DILocation(line: 27, column: 15, scope: !126)
!130 = !DILocation(line: 27, column: 5, scope: !131)
!131 = !DILexicalBlockFile(scope: !132, file: !104, discriminator: 2)
!132 = distinct !DILexicalBlock(scope: !127, file: !104, line: 27, column: 3)
!133 = !DILocation(line: 27, column: 14, scope: !134)
!134 = !DILexicalBlockFile(scope: !135, file: !104, discriminator: 3)
!135 = distinct !DILexicalBlock(scope: !127, file: !104, line: 27, column: 12)
!136 = !DILocation(line: 27, column: 99, scope: !134)
!137 = !DILocation(line: 27, column: 7, scope: !138)
!138 = !DILexicalBlockFile(scope: !128, file: !104, discriminator: 4)
!139 = !DILocation(line: 28, column: 2, scope: !103)
!140 = distinct !{!140, !139}
!141 = !DILocation(line: 28, column: 10, scope: !142)
!142 = !DILexicalBlockFile(scope: !143, file: !104, discriminator: 1)
!143 = distinct !DILexicalBlock(scope: !144, file: !104, line: 28, column: 10)
!144 = distinct !DILexicalBlock(scope: !103, file: !104, line: 28, column: 4)
!145 = !DILocation(line: 28, column: 14, scope: !142)
!146 = !DILocation(line: 28, column: 5, scope: !147)
!147 = !DILexicalBlockFile(scope: !148, file: !104, discriminator: 2)
!148 = distinct !DILexicalBlock(scope: !143, file: !104, line: 28, column: 3)
!149 = !DILocation(line: 28, column: 14, scope: !150)
!150 = !DILexicalBlockFile(scope: !151, file: !104, discriminator: 3)
!151 = distinct !DILexicalBlock(scope: !143, file: !104, line: 28, column: 12)
!152 = !DILocation(line: 28, column: 98, scope: !150)
!153 = !DILocation(line: 28, column: 7, scope: !154)
!154 = !DILexicalBlockFile(scope: !144, file: !104, discriminator: 4)
!155 = !DILocation(line: 29, column: 2, scope: !103)
!156 = distinct !{!156, !155}
!157 = !DILocation(line: 29, column: 12, scope: !158)
!158 = !DILexicalBlockFile(scope: !159, file: !104, discriminator: 1)
!159 = distinct !DILexicalBlock(scope: !160, file: !104, line: 29, column: 10)
!160 = distinct !DILexicalBlock(scope: !103, file: !104, line: 29, column: 4)
!161 = !DILocation(line: 29, column: 19, scope: !158)
!162 = !DILocation(line: 29, column: 24, scope: !158)
!163 = !DILocation(line: 29, column: 43, scope: !158)
!164 = !DILocation(line: 29, column: 47, scope: !165)
!165 = !DILexicalBlockFile(scope: !159, file: !104, discriminator: 2)
!166 = !DILocation(line: 29, column: 54, scope: !165)
!167 = !DILocation(line: 29, column: 59, scope: !165)
!168 = !DILocation(line: 29, column: 10, scope: !165)
!169 = !DILocation(line: 29, column: 81, scope: !170)
!170 = !DILexicalBlockFile(scope: !171, file: !104, discriminator: 3)
!171 = distinct !DILexicalBlock(scope: !159, file: !104, line: 29, column: 79)
!172 = !DILocation(line: 29, column: 90, scope: !173)
!173 = !DILexicalBlockFile(scope: !174, file: !104, discriminator: 4)
!174 = distinct !DILexicalBlock(scope: !159, file: !104, line: 29, column: 88)
!175 = !DILocation(line: 29, column: 181, scope: !173)
!176 = !DILocation(line: 29, column: 7, scope: !177)
!177 = !DILexicalBlockFile(scope: !160, file: !104, discriminator: 5)
!178 = !DILocation(line: 31, column: 13, scope: !179)
!179 = distinct !DILexicalBlock(scope: !103, file: !104, line: 31, column: 2)
!180 = !DILocation(line: 31, column: 19, scope: !179)
!181 = !DILocation(line: 31, column: 11, scope: !179)
!182 = !DILocation(line: 31, column: 7, scope: !179)
!183 = !DILocation(line: 31, column: 26, scope: !184)
!184 = !DILexicalBlockFile(scope: !185, file: !104, discriminator: 1)
!185 = distinct !DILexicalBlock(scope: !179, file: !104, line: 31, column: 2)
!186 = !DILocation(line: 31, column: 30, scope: !184)
!187 = !DILocation(line: 31, column: 2, scope: !184)
!188 = !DILocalVariable(name: "node", scope: !189, file: !104, line: 32, type: !90)
!189 = distinct !DILexicalBlock(scope: !185, file: !104, line: 31, column: 55)
!190 = !DILocation(line: 32, column: 16, scope: !189)
!191 = !DILocation(line: 32, column: 23, scope: !189)
!192 = !DILocation(line: 32, column: 28, scope: !189)
!193 = !DILocation(line: 34, column: 7, scope: !194)
!194 = distinct !DILexicalBlock(scope: !189, file: !104, line: 34, column: 7)
!195 = !DILocation(line: 34, column: 13, scope: !194)
!196 = !DILocation(line: 34, column: 17, scope: !194)
!197 = !DILocation(line: 34, column: 24, scope: !194)
!198 = !DILocation(line: 34, column: 46, scope: !199)
!199 = !DILexicalBlockFile(scope: !194, file: !104, discriminator: 1)
!200 = !DILocation(line: 34, column: 52, scope: !199)
!201 = !DILocation(line: 34, column: 57, scope: !199)
!202 = !DILocation(line: 34, column: 27, scope: !199)
!203 = !DILocation(line: 34, column: 62, scope: !199)
!204 = !DILocation(line: 34, column: 7, scope: !199)
!205 = !DILocation(line: 35, column: 11, scope: !194)
!206 = !DILocation(line: 35, column: 4, scope: !194)
!207 = !DILocation(line: 36, column: 2, scope: !189)
!208 = !DILocation(line: 31, column: 44, scope: !209)
!209 = !DILexicalBlockFile(scope: !185, file: !104, discriminator: 2)
!210 = !DILocation(line: 31, column: 49, scope: !209)
!211 = !DILocation(line: 31, column: 42, scope: !209)
!212 = !DILocation(line: 31, column: 2, scope: !209)
!213 = distinct !{!213, !214}
!214 = !DILocation(line: 31, column: 2, scope: !103)
!215 = !DILocation(line: 38, column: 2, scope: !103)
!216 = !DILocation(line: 39, column: 1, scope: !103)
!217 = distinct !DISubprogram(name: "config_node_section", scope: !104, file: !104, line: 41, type: !218, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !107)
!218 = !DISubroutineType(types: !219)
!219 = !{!90, !220, !90, !88, !95}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONFIG_REC", file: !4, line: 18, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CONFIG_REC", file: !4, line: 49, size: 576, align: 64, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !234, !235, !329, !495, !496}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !222, file: !4, line: 50, baseType: !97, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "create_mode", scope: !222, file: !4, line: 51, baseType: !95, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "modifycounter", scope: !222, file: !4, line: 52, baseType: !95, size: 32, align: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last_error", scope: !222, file: !4, line: 54, baseType: !97, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mainnode", scope: !222, file: !4, line: 55, baseType: !90, size: 64, align: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !222, file: !4, line: 56, baseType: !230, size: 64, align: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashTable", file: !232, line: 37, baseType: !233)
!232 = !DIFile(filename: "/usr/include/glib-2.0/glib/ghash.h", directory: "/home/lichi/Desktop/irssi/task1")
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GHashTable", file: !232, line: 37, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "cache_nodes", scope: !222, file: !4, line: 57, baseType: !230, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "scanner", scope: !222, file: !4, line: 59, baseType: !236, size: 64, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScanner", file: !12, line: 37, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScanner", file: !12, line: 169, size: 1152, align: 64, elements: !239)
!239 = !{!240, !241, !244, !245, !248, !253, !285, !287, !310, !311, !312, !313, !314, !315, !316, !317, !319, !320, !321, !322, !323}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !238, file: !12, line: 172, baseType: !120, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_parse_errors", scope: !238, file: !12, line: 173, baseType: !242, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint", file: !86, line: 55, baseType: !243)
!243 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parse_errors", scope: !238, file: !12, line: 176, baseType: !242, size: 32, align: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "input_name", scope: !238, file: !12, line: 179, baseType: !246, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "qdata", scope: !238, file: !12, line: 182, baseType: !249, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GData", file: !251, line: 36, baseType: !252)
!251 = !DIFile(filename: "/usr/include/glib-2.0/glib/gdataset.h", directory: "/home/lichi/Desktop/irssi/task1")
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GData", file: !251, line: 36, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !238, file: !12, line: 185, baseType: !254, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerConfig", file: !12, line: 38, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GScannerConfig", file: !12, line: 127, size: 320, align: 64, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cset_skip_characters", scope: !256, file: !12, line: 131, baseType: !84, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_first", scope: !256, file: !12, line: 132, baseType: !84, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cset_identifier_nth", scope: !256, file: !12, line: 133, baseType: !84, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cpair_comment_single", scope: !256, file: !12, line: 134, baseType: !84, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "case_sensitive", scope: !256, file: !12, line: 138, baseType: !242, size: 1, align: 32, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_multi", scope: !256, file: !12, line: 143, baseType: !242, size: 1, align: 32, offset: 257, flags: DIFlagBitField, extraData: i64 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "skip_comment_single", scope: !256, file: !12, line: 144, baseType: !242, size: 1, align: 32, offset: 258, flags: DIFlagBitField, extraData: i64 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "scan_comment_multi", scope: !256, file: !12, line: 145, baseType: !242, size: 1, align: 32, offset: 259, flags: DIFlagBitField, extraData: i64 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier", scope: !256, file: !12, line: 146, baseType: !242, size: 1, align: 32, offset: 260, flags: DIFlagBitField, extraData: i64 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_1char", scope: !256, file: !12, line: 147, baseType: !242, size: 1, align: 32, offset: 261, flags: DIFlagBitField, extraData: i64 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scan_identifier_NULL", scope: !256, file: !12, line: 148, baseType: !242, size: 1, align: 32, offset: 262, flags: DIFlagBitField, extraData: i64 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scan_symbols", scope: !256, file: !12, line: 149, baseType: !242, size: 1, align: 32, offset: 263, flags: DIFlagBitField, extraData: i64 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scan_binary", scope: !256, file: !12, line: 150, baseType: !242, size: 1, align: 32, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scan_octal", scope: !256, file: !12, line: 151, baseType: !242, size: 1, align: 32, offset: 265, flags: DIFlagBitField, extraData: i64 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scan_float", scope: !256, file: !12, line: 152, baseType: !242, size: 1, align: 32, offset: 266, flags: DIFlagBitField, extraData: i64 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex", scope: !256, file: !12, line: 153, baseType: !242, size: 1, align: 32, offset: 267, flags: DIFlagBitField, extraData: i64 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scan_hex_dollar", scope: !256, file: !12, line: 154, baseType: !242, size: 1, align: 32, offset: 268, flags: DIFlagBitField, extraData: i64 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_sq", scope: !256, file: !12, line: 155, baseType: !242, size: 1, align: 32, offset: 269, flags: DIFlagBitField, extraData: i64 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scan_string_dq", scope: !256, file: !12, line: 156, baseType: !242, size: 1, align: 32, offset: 270, flags: DIFlagBitField, extraData: i64 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "numbers_2_int", scope: !256, file: !12, line: 157, baseType: !242, size: 1, align: 32, offset: 271, flags: DIFlagBitField, extraData: i64 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "int_2_float", scope: !256, file: !12, line: 158, baseType: !242, size: 1, align: 32, offset: 272, flags: DIFlagBitField, extraData: i64 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "identifier_2_string", scope: !256, file: !12, line: 159, baseType: !242, size: 1, align: 32, offset: 273, flags: DIFlagBitField, extraData: i64 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "char_2_token", scope: !256, file: !12, line: 160, baseType: !242, size: 1, align: 32, offset: 274, flags: DIFlagBitField, extraData: i64 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_2_token", scope: !256, file: !12, line: 161, baseType: !242, size: 1, align: 32, offset: 275, flags: DIFlagBitField, extraData: i64 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scope_0_fallback", scope: !256, file: !12, line: 162, baseType: !242, size: 1, align: 32, offset: 276, flags: DIFlagBitField, extraData: i64 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "store_int64", scope: !256, file: !12, line: 163, baseType: !242, size: 1, align: 32, offset: 277, flags: DIFlagBitField, extraData: i64 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "padding_dummy", scope: !256, file: !12, line: 166, baseType: !242, size: 32, align: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !238, file: !12, line: 188, baseType: !286, size: 32, align: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenType", file: !12, line: 109, baseType: !11)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !12, line: 189, baseType: !288, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "GTokenValue", file: !12, line: 39, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "_GTokenValue", file: !12, line: 111, size: 64, align: 64, elements: !290)
!290 = !{!291, !292, !293, !296, !297, !298, !301, !304, !305, !306, !307, !309}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v_symbol", scope: !289, file: !12, line: 113, baseType: !120, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v_identifier", scope: !289, file: !12, line: 114, baseType: !84, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v_binary", scope: !289, file: !12, line: 115, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "gulong", file: !86, line: 54, baseType: !295)
!295 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v_octal", scope: !289, file: !12, line: 116, baseType: !294, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "v_int", scope: !289, file: !12, line: 117, baseType: !294, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v_int64", scope: !289, file: !12, line: 118, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint64", file: !300, line: 52, baseType: !295)
!300 = !DIFile(filename: "/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h", directory: "/home/lichi/Desktop/irssi/task1")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v_float", scope: !289, file: !12, line: 119, baseType: !302, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "gdouble", file: !86, line: 58, baseType: !303)
!303 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v_hex", scope: !289, file: !12, line: 120, baseType: !294, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v_string", scope: !289, file: !12, line: 121, baseType: !84, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v_comment", scope: !289, file: !12, line: 122, baseType: !84, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v_char", scope: !289, file: !12, line: 123, baseType: !308, size: 8, align: 8)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "guchar", file: !86, line: 52, baseType: !99)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v_error", scope: !289, file: !12, line: 124, baseType: !242, size: 32, align: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !238, file: !12, line: 190, baseType: !242, size: 32, align: 32, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !238, file: !12, line: 191, baseType: !242, size: 32, align: 32, offset: 480)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !238, file: !12, line: 194, baseType: !286, size: 32, align: 32, offset: 512)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next_value", scope: !238, file: !12, line: 195, baseType: !288, size: 64, align: 64, offset: 576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next_line", scope: !238, file: !12, line: 196, baseType: !242, size: 32, align: 32, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next_position", scope: !238, file: !12, line: 197, baseType: !242, size: 32, align: 32, offset: 672)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "symbol_table", scope: !238, file: !12, line: 201, baseType: !230, size: 64, align: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "input_fd", scope: !238, file: !12, line: 202, baseType: !318, size: 32, align: 32, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint", file: !86, line: 49, baseType: !95)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !238, file: !12, line: 203, baseType: !246, size: 64, align: 64, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "text_end", scope: !238, file: !12, line: 204, baseType: !246, size: 64, align: 64, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !238, file: !12, line: 205, baseType: !84, size: 64, align: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scope_id", scope: !238, file: !12, line: 206, baseType: !242, size: 32, align: 32, offset: 1024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "msg_handler", scope: !238, file: !12, line: 210, baseType: !324, size: 64, align: 64, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "GScannerMsgFunc", file: !12, line: 41, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !236, !84, !328}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "gboolean", file: !86, line: 50, baseType: !318)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !222, file: !4, line: 62, baseType: !330, size: 64, align: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOChannel", file: !39, line: 41, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOChannel", file: !39, line: 97, size: 896, align: 64, elements: !333)
!333 = !{!334, !335, !462, !463, !468, !469, !470, !471, !472, !481, !482, !483, !487, !488, !489, !490, !491, !492, !493, !494}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !332, file: !39, line: 100, baseType: !318, size: 32, align: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !332, file: !39, line: 101, baseType: !336, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFuncs", file: !39, line: 42, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GIOFuncs", file: !39, line: 131, size: 512, align: 64, elements: !339)
!339 = !{!340, !359, !363, !370, !374, !449, !453, !458}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "io_read", scope: !338, file: !39, line: 133, baseType: !341, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !330, !84, !345, !346, !347}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOStatus", file: !39, line: 75, baseType: !38)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsize", file: !300, line: 66, baseType: !295)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GError", file: !350, line: 42, baseType: !351)
!350 = !DIFile(filename: "/usr/include/glib-2.0/glib/gerror.h", directory: "/home/lichi/Desktop/irssi/task1")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GError", file: !350, line: 44, size: 128, align: 64, elements: !352)
!352 = !{!353, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !351, file: !350, line: 46, baseType: !354, size: 32, align: 32)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "GQuark", file: !355, line: 36, baseType: !356)
!355 = !DIFile(filename: "/usr/include/glib-2.0/glib/gquark.h", directory: "/home/lichi/Desktop/irssi/task1")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "guint32", file: !300, line: 45, baseType: !243)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !351, file: !350, line: 47, baseType: !318, size: 32, align: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !351, file: !350, line: 48, baseType: !84, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "io_write", scope: !338, file: !39, line: 138, baseType: !360, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!344, !330, !246, !345, !346, !347}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "io_seek", scope: !338, file: !39, line: 143, baseType: !364, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!344, !330, !367, !369, !347}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "gint64", file: !300, line: 51, baseType: !368)
!368 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSeekType", file: !39, line: 82, baseType: !45)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "io_close", scope: !338, file: !39, line: 147, baseType: !371, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!344, !330, !347}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "io_create_watch", scope: !338, file: !39, line: 149, baseType: !375, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !330, !448}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSource", file: !51, line: 64, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSource", file: !51, line: 171, size: 768, align: 64, elements: !381)
!381 = !{!382, !383, !403, !432, !433, !437, !438, !439, !440, !441, !442, !443, !444}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "callback_data", scope: !380, file: !51, line: 174, baseType: !120, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "callback_funcs", scope: !380, file: !51, line: 175, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceCallbackFuncs", file: !51, line: 77, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceCallbackFuncs", file: !51, line: 196, size: 192, align: 64, elements: !387)
!387 = !{!388, !392, !393}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !386, file: !51, line: 198, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !120}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "unref", scope: !386, file: !51, line: 199, baseType: !389, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !386, file: !51, line: 200, baseType: !394, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !120, !378, !397, !402}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFunc", file: !51, line: 155, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!328, !120}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "source_funcs", scope: !380, file: !51, line: 177, baseType: !404, size: 64, align: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceFuncs", file: !51, line: 130, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourceFuncs", file: !51, line: 214, size: 384, align: 64, elements: !408)
!408 = !{!409, !414, !418, !422, !426, !427}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !407, file: !51, line: 216, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!328, !378, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !407, file: !51, line: 218, baseType: !415, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!328, !378}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !407, file: !51, line: 219, baseType: !419, size: 64, align: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!328, !378, !398, !120}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !407, file: !51, line: 222, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !378}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "closure_callback", scope: !407, file: !51, line: 226, baseType: !398, size: 64, align: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "closure_marshal", scope: !407, file: !51, line: 227, baseType: !428, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourceDummyMarshal", file: !51, line: 212, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !380, file: !51, line: 178, baseType: !242, size: 32, align: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !380, file: !51, line: 180, baseType: !434, size: 64, align: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "GMainContext", file: !51, line: 48, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GMainContext", file: !51, line: 48, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !380, file: !51, line: 182, baseType: !318, size: 32, align: 32, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !380, file: !51, line: 183, baseType: !242, size: 32, align: 32, offset: 352)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "source_id", scope: !380, file: !51, line: 184, baseType: !242, size: 32, align: 32, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "poll_fds", scope: !380, file: !51, line: 186, baseType: !114, size: 64, align: 64, offset: 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !380, file: !51, line: 188, baseType: !378, size: 64, align: 64, offset: 512)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !51, line: 189, baseType: !378, size: 64, align: 64, offset: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !51, line: 191, baseType: !97, size: 64, align: 64, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !380, file: !51, line: 193, baseType: !445, size: 64, align: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSourcePrivate", file: !51, line: 65, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GSourcePrivate", file: !51, line: 65, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOCondition", file: !51, line: 39, baseType: !50)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "io_free", scope: !338, file: !39, line: 151, baseType: !450, size: 64, align: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !330}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "io_set_flags", scope: !338, file: !39, line: 152, baseType: !454, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!344, !330, !457, !347}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIOFlags", file: !39, line: 95, baseType: !59)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "io_get_flags", scope: !338, file: !39, line: 155, baseType: !459, size: 64, align: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!457, !330}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !332, file: !39, line: 103, baseType: !84, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "read_cd", scope: !332, file: !39, line: 104, baseType: !464, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "GIConv", file: !465, line: 77, baseType: !466)
!465 = !DIFile(filename: "/usr/include/glib-2.0/glib/gconvert.h", directory: "/home/lichi/Desktop/irssi/task1")
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_GIConv", file: !465, line: 77, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "write_cd", scope: !332, file: !39, line: 105, baseType: !464, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "line_term", scope: !332, file: !39, line: 106, baseType: !84, size: 64, align: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "line_term_len", scope: !332, file: !39, line: 107, baseType: !242, size: 32, align: 32, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !332, file: !39, line: 109, baseType: !345, size: 64, align: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !332, file: !39, line: 110, baseType: !473, size: 64, align: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "GString", file: !475, line: 39, baseType: !476)
!475 = !DIFile(filename: "/usr/include/glib-2.0/glib/gstring.h", directory: "/home/lichi/Desktop/irssi/task1")
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GString", file: !475, line: 41, size: 192, align: 64, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !476, file: !475, line: 43, baseType: !84, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !476, file: !475, line: 44, baseType: !345, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_len", scope: !476, file: !475, line: 45, baseType: !345, size: 64, align: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "encoded_read_buf", scope: !332, file: !39, line: 111, baseType: !473, size: 64, align: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !332, file: !39, line: 112, baseType: !473, size: 64, align: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "partial_write_buf", scope: !332, file: !39, line: 113, baseType: !484, size: 48, align: 8, offset: 704)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, align: 8, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 6)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "use_buffer", scope: !332, file: !39, line: 117, baseType: !242, size: 1, align: 32, offset: 752, flags: DIFlagBitField, extraData: i64 752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "do_encode", scope: !332, file: !39, line: 118, baseType: !242, size: 1, align: 32, offset: 753, flags: DIFlagBitField, extraData: i64 752)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "close_on_unref", scope: !332, file: !39, line: 119, baseType: !242, size: 1, align: 32, offset: 754, flags: DIFlagBitField, extraData: i64 752)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "is_readable", scope: !332, file: !39, line: 120, baseType: !242, size: 1, align: 32, offset: 755, flags: DIFlagBitField, extraData: i64 752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_writeable", scope: !332, file: !39, line: 121, baseType: !242, size: 1, align: 32, offset: 756, flags: DIFlagBitField, extraData: i64 752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "is_seekable", scope: !332, file: !39, line: 122, baseType: !242, size: 1, align: 32, offset: 757, flags: DIFlagBitField, extraData: i64 752)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !332, file: !39, line: 124, baseType: !120, size: 64, align: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !332, file: !39, line: 125, baseType: !120, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_indent_level", scope: !222, file: !4, line: 63, baseType: !95, size: 32, align: 32, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_last_lf", scope: !222, file: !4, line: 64, baseType: !95, size: 32, align: 32, offset: 544)
!497 = !DILocalVariable(name: "rec", arg: 1, scope: !217, file: !104, line: 41, type: !220)
!498 = !DILocation(line: 41, column: 46, scope: !217)
!499 = !DILocalVariable(name: "parent", arg: 2, scope: !217, file: !104, line: 41, type: !90)
!500 = !DILocation(line: 41, column: 64, scope: !217)
!501 = !DILocalVariable(name: "key", arg: 3, scope: !217, file: !104, line: 41, type: !88)
!502 = !DILocation(line: 41, column: 84, scope: !217)
!503 = !DILocalVariable(name: "new_type", arg: 4, scope: !217, file: !104, line: 41, type: !95)
!504 = !DILocation(line: 41, column: 93, scope: !217)
!505 = !DILocation(line: 43, column: 35, scope: !217)
!506 = !DILocation(line: 43, column: 40, scope: !217)
!507 = !DILocation(line: 43, column: 48, scope: !217)
!508 = !DILocation(line: 43, column: 57, scope: !217)
!509 = !DILocation(line: 43, column: 9, scope: !217)
!510 = !DILocation(line: 43, column: 2, scope: !217)
!511 = distinct !DISubprogram(name: "config_node_section_index", scope: !104, file: !104, line: 46, type: !512, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !107)
!512 = !DISubroutineType(types: !513)
!513 = !{!90, !220, !90, !88, !95, !95}
!514 = !DILocalVariable(name: "rec", arg: 1, scope: !511, file: !104, line: 46, type: !220)
!515 = !DILocation(line: 46, column: 52, scope: !511)
!516 = !DILocalVariable(name: "parent", arg: 2, scope: !511, file: !104, line: 46, type: !90)
!517 = !DILocation(line: 46, column: 70, scope: !511)
!518 = !DILocalVariable(name: "key", arg: 3, scope: !511, file: !104, line: 46, type: !88)
!519 = !DILocation(line: 46, column: 90, scope: !511)
!520 = !DILocalVariable(name: "index", arg: 4, scope: !511, file: !104, line: 47, type: !95)
!521 = !DILocation(line: 47, column: 16, scope: !511)
!522 = !DILocalVariable(name: "new_type", arg: 5, scope: !511, file: !104, line: 47, type: !95)
!523 = !DILocation(line: 47, column: 27, scope: !511)
!524 = !DILocalVariable(name: "node", scope: !511, file: !104, line: 49, type: !90)
!525 = !DILocation(line: 49, column: 15, scope: !511)
!526 = !DILocalVariable(name: "nindex", scope: !511, file: !104, line: 50, type: !95)
!527 = !DILocation(line: 50, column: 13, scope: !511)
!528 = !DILocation(line: 52, column: 2, scope: !511)
!529 = distinct !{!529, !528}
!530 = !DILocation(line: 52, column: 10, scope: !531)
!531 = !DILexicalBlockFile(scope: !532, file: !104, discriminator: 1)
!532 = distinct !DILexicalBlock(scope: !533, file: !104, line: 52, column: 10)
!533 = distinct !DILexicalBlock(scope: !511, file: !104, line: 52, column: 4)
!534 = !DILocation(line: 52, column: 17, scope: !531)
!535 = !DILocation(line: 52, column: 5, scope: !536)
!536 = !DILexicalBlockFile(scope: !537, file: !104, discriminator: 2)
!537 = distinct !DILexicalBlock(scope: !532, file: !104, line: 52, column: 3)
!538 = !DILocation(line: 52, column: 14, scope: !539)
!539 = !DILexicalBlockFile(scope: !540, file: !104, discriminator: 3)
!540 = distinct !DILexicalBlock(scope: !532, file: !104, line: 52, column: 12)
!541 = !DILocation(line: 52, column: 101, scope: !539)
!542 = !DILocation(line: 52, column: 7, scope: !543)
!543 = !DILexicalBlockFile(scope: !533, file: !104, discriminator: 4)
!544 = !DILocation(line: 53, column: 2, scope: !511)
!545 = distinct !{!545, !544}
!546 = !DILocation(line: 53, column: 12, scope: !547)
!547 = !DILexicalBlockFile(scope: !548, file: !104, discriminator: 1)
!548 = distinct !DILexicalBlock(scope: !549, file: !104, line: 53, column: 10)
!549 = distinct !DILexicalBlock(scope: !511, file: !104, line: 53, column: 4)
!550 = !DILocation(line: 53, column: 21, scope: !547)
!551 = !DILocation(line: 53, column: 26, scope: !547)
!552 = !DILocation(line: 53, column: 45, scope: !547)
!553 = !DILocation(line: 53, column: 49, scope: !554)
